// Class BravoHotelGame.AmbientSoundVolume
// Size: 0x370 (Inherited: 0x358)
struct AAmbientSoundVolume : AVolume {
	struct FString Ambience; // 0x358(0x10)
	int32_t Priority; // 0x368(0x04)
	char pad_36C[0x4]; // 0x36c(0x04)

	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function BravoHotelGame.AmbientSoundVolume.OnOverlapEnd // (Final|Native|Protected) // @ game+0x1e42680
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function BravoHotelGame.AmbientSoundVolume.OnOverlapBegin // (Final|Native|Protected|HasOutParms) // @ game+0x1e42470
};

// Class BravoHotelGame.AnimNotifyState_PlaySound
// Size: 0x58 (Inherited: 0x30)
struct UAnimNotifyState_PlaySound : UAnimNotifyState {
	struct USoundBase* Sound; // 0x30(0x08)
	float VolumeMultiplier; // 0x38(0x04)
	float PitchMultiplier; // 0x3c(0x04)
	char bFollow : 1; // 0x40(0x01)
	char pad_40_1 : 7; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	struct FName AttachName; // 0x44(0x08)
	char pad_4C[0xc]; // 0x4c(0x0c)
};

// Class BravoHotelGame.BravoHotelGameModeBase
// Size: 0x408 (Inherited: 0x408)
struct ABravoHotelGameModeBase : AGameMode {
};

// Class BravoHotelGame.BravoHotelGameMode
// Size: 0x588 (Inherited: 0x408)
struct ABravoHotelGameMode : ABravoHotelGameModeBase {
	char pad_408[0x4]; // 0x408(0x04)
	bool bFriendlyFire; // 0x40c(0x01)
	char pad_40D[0x3]; // 0x40d(0x03)
	struct UBravoHotelPoolingActorComponent* PoolingActorComponent; // 0x410(0x08)
	struct FDataTableRowHandle MapDataTableHandle; // 0x418(0x10)
	struct TMap<struct FString, struct APlayerController*> PCReceivedPlayerInfos; // 0x428(0x50)
	struct AAIController* TestAIControllerClass; // 0x478(0x08)
	char pad_480[0x71]; // 0x480(0x71)
	bool UsingOuterBlueZone; // 0x4f1(0x01)
	char pad_4F2[0x2]; // 0x4f2(0x02)
	struct FName SelectedPlayZoneName; // 0x4f4(0x08)
	char pad_4FC[0x4]; // 0x4fc(0x04)
	struct ABravoHotelBlueZone* BlueZoneClass; // 0x500(0x08)
	struct FString CQRType; // 0x508(0x10)
	char pad_518[0x68]; // 0x518(0x68)
	struct ABravoHotelBlueZone* BlueZone; // 0x580(0x08)

	void SetTestAIChangeLocation(struct AAIController* AIController); // Function BravoHotelGame.BravoHotelGameMode.SetTestAIChangeLocation // (Final|Native|Public) // @ game+0x1f1b5d0
	float GetCurrentOutOfCircleDamage(); // Function BravoHotelGame.BravoHotelGameMode.GetCurrentOutOfCircleDamage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1f1b5a0
	struct ABravoHotelBlueZone* GetBlueZone(); // Function BravoHotelGame.BravoHotelGameMode.GetBlueZone // (Final|Native|Public) // @ game+0x1f1b570
};

// Class BravoHotelGame.BattleRoyaleGameMode
// Size: 0xe88 (Inherited: 0x588)
struct ABattleRoyaleGameMode : ABravoHotelGameMode {
	struct TArray<struct APlayerState*> RemovePendingPlayerArray; // 0x588(0x10)
	enum class EGameViewType GameViewType; // 0x598(0x01)
	enum class EMatchingType MatchingType; // 0x599(0x01)
	char pad_59A[0x2]; // 0x59a(0x02)
	int32_t TeamSize; // 0x59c(0x04)
	struct FString Training; // 0x5a0(0x10)
	int32_t AIGrade; // 0x5b0(0x04)
	char pad_5B4[0x4]; // 0x5b4(0x04)
	struct FMulticastInlineDelegate UpdateSurvivalCircleDelegate; // 0x5b8(0x10)
	char pad_5C8[0x38]; // 0x5c8(0x38)
	struct TMap<char, struct FTeamInfo> TeamInfoMap; // 0x600(0x50)
	char WinnerTeamIndex; // 0x650(0x01)
	char pad_651[0x7]; // 0x651(0x07)
	struct TArray<struct FName> SendPlayerEndedEvent; // 0x658(0x10)
	struct TArray<int32_t> SendPlayerRankedEvent; // 0x668(0x10)
	char pad_678[0x18]; // 0x678(0x18)
	struct APawn* AircraftViewPawnClass; // 0x690(0x08)
	struct APawn* AircraftFlightPawnClass; // 0x698(0x08)
	bool bAutoStart; // 0x6a0(0x01)
	char pad_6A1[0x3]; // 0x6a1(0x03)
	float StartingPlayerCountRate; // 0x6a4(0x04)
	int32_t WaitingTime; // 0x6a8(0x04)
	int32_t ReadyTime; // 0x6ac(0x04)
	int32_t DescentDelay; // 0x6b0(0x04)
	int32_t DescentableTime; // 0x6b4(0x04)
	struct ABravoHotelAircraftFlight* AircraftFlight; // 0x6b8(0x08)
	bool bIsUseAircraft; // 0x6c0(0x01)
	char pad_6C1[0x14]; // 0x6c1(0x14)
	bool bUseAircraftViewPawn; // 0x6d5(0x01)
	bool bEndlessGame; // 0x6d6(0x01)
	char pad_6D7[0x19]; // 0x6d7(0x19)
	struct TArray<struct FDamageInfo> DamageInfoArray; // 0x6f0(0x10)
	char pad_700[0x8]; // 0x700(0x08)
	struct ABravoHotelRedZoneManager* RedZoneManagerClass; // 0x708(0x08)
	struct ABravoHotelRedZoneManager* RedZoneManager; // 0x710(0x08)
	char pad_718[0x80]; // 0x718(0x80)
	struct ABHPersonalSupplyBoxManager* PersonalSupplyBoxManagerClass; // 0x798(0x08)
	struct ABHPersonalSupplyBoxManager* PersonalSupplyBoxManager; // 0x7a0(0x08)
	struct FLogBuildCountData DivisionItemCountResult; // 0x7a8(0x10)
	bool DisivisonComplete; // 0x7b8(0x01)
	char pad_7B9[0x1e7]; // 0x7b9(0x1e7)
	struct FStandardGroupKeyCountInfo StandardGroupKeyCountInfo; // 0x9a0(0x58)
	struct TMap<struct FName, struct FAreaSpawnRateInfo> AreaSpawnRateList; // 0x9f8(0x50)
	struct FAreaSpawnRateInfo BlueZoneSpawnRateInfo; // 0xa48(0x88)
	struct FName BlueZoneSpawnRateKey; // 0xad0(0x08)
	struct FAreaSpawnRateInfo NoneData; // 0xad8(0x88)
	struct TMap<struct FName, struct FVehicleAreaSpawnRateInfo> VehicleAreaSpawnRateList; // 0xb60(0x50)
	struct FVehicleAreaSpawnRateInfo VehicleBlueZoneSpawnRateInfo; // 0xbb0(0x78)
	struct FName VehicleBlueZoneSpawnRateKey; // 0xc28(0x08)
	struct FVehicleAreaSpawnRateInfo NoneVehicleData; // 0xc30(0x78)
	struct FLocalSpawnRate CustomBlueZoneSpawnRateInfo; // 0xca8(0x28)
	struct TMap<struct FName, struct FLocalSpawnRate> CustomAreaSpawnRateList; // 0xcd0(0x50)
	struct FLocalSpawnRate CustomVehicleBlueZoneSpawnRateInfo; // 0xd20(0x28)
	struct TMap<struct FName, struct FLocalSpawnRate> CustomVehicleAreaSpawnRateList; // 0xd48(0x50)
	char pad_D98[0x8]; // 0xd98(0x08)
	float ItemDivisionDelay; // 0xda0(0x04)
	bool UsingWorldItemSpawnTalbeInBlueZone; // 0xda4(0x01)
	bool ItemSpawnInBlueZone; // 0xda5(0x01)
	bool UnlimitItemSpawnCnt; // 0xda6(0x01)
	char pad_DA7[0x1]; // 0xda7(0x01)
	int32_t MaxItemDivisionCountAtOnce; // 0xda8(0x04)
	bool ItemDivisionLevelLoadComplet; // 0xdac(0x01)
	bool ItemDivisionGameReady; // 0xdad(0x01)
	bool UsingMaxPickUpItemSpawnCount; // 0xdae(0x01)
	char pad_DAF[0x1]; // 0xdaf(0x01)
	int32_t MaxPickUpItemSpawnCount; // 0xdb0(0x04)
	bool UsingMaxVehicleSpawnCount; // 0xdb4(0x01)
	char pad_DB5[0x3]; // 0xdb5(0x03)
	int32_t MaxVehicleSpawnCount; // 0xdb8(0x04)
	int32_t MaxPickUpVehicleSpawnCount; // 0xdbc(0x04)
	bool UsingDynamicMaxPickUpItemSpawnCount; // 0xdc0(0x01)
	char pad_DC1[0x3]; // 0xdc1(0x03)
	struct FItemSpawnLimitInfo ItemSpawnLimitInfo; // 0xdc4(0x14)
	bool GCRecordData; // 0xdd8(0x01)
	char pad_DD9[0x7]; // 0xdd9(0x07)
	struct FString GCRecordDataTitle; // 0xde0(0x10)
	bool RecordBuildingData; // 0xdf0(0x01)
	bool RecordPersonalSupplyBoxData; // 0xdf1(0x01)
	char pad_DF2[0x6]; // 0xdf2(0x06)
	struct UCurveFloat* ItemSpawnRateCurve; // 0xdf8(0x08)
	struct UCurveFloat* VehicleSpawnRateCurve; // 0xe00(0x08)
	int32_t CurrentSpawnVehicleCount; // 0xe08(0x04)
	int32_t CurrentDivisionItemCount; // 0xe0c(0x04)
	char pad_E10[0x18]; // 0xe10(0x18)
	struct TArray<struct ABravoHotelCharacter*> CheckCharacters; // 0xe28(0x10)
	char pad_E38[0x10]; // 0xe38(0x10)
	struct TArray<struct FLoadBuildingInfo> LoadCompleteList; // 0xe48(0x10)
	char pad_E58[0x8]; // 0xe58(0x08)
	struct TArray<int32_t> AutoBotIds; // 0xe60(0x10)
	struct TArray<int32_t> AutoBotInfoSendIDList; // 0xe70(0x10)
	char pad_E80[0x8]; // 0xe80(0x08)

	void UpdateSurvivalCircleDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode.UpdateSurvivalCircleDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void UpdateItemSpawnState(); // Function BravoHotelGame.BattleRoyaleGameMode.UpdateItemSpawnState // (Final|Native|Public) // @ game+0x1e43800
	void UpdateCheckStartPlayCharacters(); // Function BravoHotelGame.BattleRoyaleGameMode.UpdateCheckStartPlayCharacters // (Final|Native|Private) // @ game+0x1e437e0
	void ServerCheat(bool Active, enum class EDediGameCheatType Type); // Function BravoHotelGame.BattleRoyaleGameMode.ServerCheat // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1e43710
	void OnBattleRoyalStateChanged(enum class EBattleRoyaleState PrevState, enum class EBattleRoyaleState CurrentState); // Function BravoHotelGame.BattleRoyaleGameMode.OnBattleRoyalStateChanged // (Final|Native|Public) // @ game+0x1e43650
	struct FString GetSpawnAreaName(struct AController* Player); // Function BravoHotelGame.BattleRoyaleGameMode.GetSpawnAreaName // (Final|Native|Public|BlueprintCallable) // @ game+0x1e43570
	struct ABravoHotelRedZoneManager* GetRedZoneManager(); // Function BravoHotelGame.BattleRoyaleGameMode.GetRedZoneManager // (Final|Native|Public) // @ game+0x1e43540
	enum class EBattleRoyaleState GetBattleRoyaleState(); // Function BravoHotelGame.BattleRoyaleGameMode.GetBattleRoyaleState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1e43510
	void DestroyRedZoneManager(); // Function BravoHotelGame.BattleRoyaleGameMode.DestroyRedZoneManager // (Final|Native|Public) // @ game+0x1e434f0
	bool CreateRedZoneManager(); // Function BravoHotelGame.BattleRoyaleGameMode.CreateRedZoneManager // (Final|Native|Public) // @ game+0x1e434c0
	void Cheat(bool Active, int8_t Type); // Function BravoHotelGame.BattleRoyaleGameMode.Cheat // (Final|Exec|Native|Public) // @ game+0x1e43400
	void AddAIPlayerByTimer(bool bByTimer); // Function BravoHotelGame.BattleRoyaleGameMode.AddAIPlayerByTimer // (Final|Native|Public) // @ game+0x1e43370
};

// Class BravoHotelGame.BattleRoyaleGameMode_Login
// Size: 0x640 (Inherited: 0x408)
struct ABattleRoyaleGameMode_Login : ABravoHotelGameModeBase {
	float MatchingTimeout; // 0x408(0x04)
	char pad_40C[0x4]; // 0x40c(0x04)
	struct TArray<struct FPlayerPawnList> PlayerPawnList; // 0x410(0x10)
	struct ACharacter* CustomizeCharacter; // 0x420(0x08)
	struct ACharacter* RankingCharacter; // 0x428(0x08)
	struct USkeletalMeshComponent* AppearingMotionCharacter; // 0x430(0x08)
	char pad_438[0x118]; // 0x438(0x118)
	struct FTimerHandle Loading_TimerHandle; // 0x550(0x08)
	struct FTimerHandle PartyInfo_TimerHandle; // 0x558(0x08)
	struct FTimerHandle Ping_TimerHandle; // 0x560(0x08)
	struct FTimerHandle GeeGeeLoginToken_TimerHandle; // 0x568(0x08)
	struct FTimerHandle SteamLoginToken_TimerHandle; // 0x570(0x08)
	struct FTimerHandle DuplicatedReconnect_TimerHandle; // 0x578(0x08)
	struct FMulticastInlineDelegate OnLoginSucceeded; // 0x580(0x10)
	struct FMulticastInlineDelegate OnLoginNotify; // 0x590(0x10)
	struct FMulticastInlineDelegate OnLoginFailed; // 0x5a0(0x10)
	struct FMulticastInlineDelegate OnMatchingPending; // 0x5b0(0x10)
	struct FMulticastInlineDelegate OnMatchingStarted; // 0x5c0(0x10)
	struct FMulticastInlineDelegate OnMatchingSucceeded; // 0x5d0(0x10)
	struct FMulticastInlineDelegate OnMatchingFailed; // 0x5e0(0x10)
	struct FMulticastInlineDelegate OnPartyInvited; // 0x5f0(0x10)
	struct FMulticastInlineDelegate OnPartyInfoChanged; // 0x600(0x10)
	struct FMulticastInlineDelegate OnPartyMemberInfoChanged; // 0x610(0x10)
	struct FMulticastInlineDelegate OnMatchingSettingsChanged; // 0x620(0x10)
	struct FMulticastInlineDelegate OnCreateCharacter; // 0x630(0x10)

	void UpdatePCInfo(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.UpdatePCInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x1e45190
	void StartTutorialPlay(bool bOpeningTutorial); // Function BravoHotelGame.BattleRoyaleGameMode_Login.StartTutorialPlay // (Final|Native|Public|BlueprintCallable) // @ game+0x1e45100
	void StartLoginEx(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.StartLoginEx // (Final|Native|Public|BlueprintCallable) // @ game+0x1e450e0
	void StartLogin(struct TMap<struct FString, struct FString>& AppIDs, struct TMap<struct FString, struct FString>& LoginKeys, enum class ELoginType Type); // Function BravoHotelGame.BattleRoyaleGameMode_Login.StartLogin // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1e44eb0
	void SetVisibleRankingCharacter(bool bState); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SetVisibleRankingCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x1e44e20
	void SetRankingCharacter(struct ACharacter* SpawnCharacter); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SetRankingCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x1e44da0
	void SetPawnList(struct TArray<struct ACharacter*>& PawnList); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SetPawnList // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1e44cf0
	void SetCustomizeCharacter(struct ACharacter* SpawnCustomizeCharacter); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SetCustomizeCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x1e44c70
	void SetAppearingMotionCharacter(struct USkeletalMeshComponent* MeshComponent); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SetAppearingMotionCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x1e44bf0
	void PartyMemberInfoChanged__DelegateSignature(struct FString MemberUID, struct FBravoHotelPartyMemberInfo& MemberInfo); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.PartyMemberInfoChanged__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x23a3b60
	void PartyInvited__DelegateSignature(struct FBravoHotelPartyInvitation& Invitation); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.PartyInvited__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x23a3b60
	void PartyInfoChanged__DelegateSignature(struct FBravoHotelPartyInfo& PartyInfo); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.PartyInfoChanged__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x23a3b60
	void OnReadFriendsListComplete(int32_t LocalPlayerNum, bool bWasSuccessful, struct FString ListName, struct FString PlatformName); // Function BravoHotelGame.BattleRoyaleGameMode_Login.OnReadFriendsListComplete // (Final|Native|Protected) // @ game+0x1e44a70
	void MatchingSucceeded__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.MatchingSucceeded__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void MatchingStarted__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.MatchingStarted__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void MatchingSettingsChanged__DelegateSignature(struct FBravoHotelMatchingSettings& Settings); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.MatchingSettingsChanged__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x23a3b60
	void MatchingPending__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.MatchingPending__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void MatchingFailed__DelegateSignature(int32_t ErrorCode, struct FString ExtraDescription); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.MatchingFailed__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void LoginSucceeded__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.LoginSucceeded__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void LoginNotify__DelegateSignature(struct FString Parameters); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.LoginNotify__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void LoginFailed__DelegateSignature(int32_t ErrorIndex, struct FString ErrorID, struct FString Parameters); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.LoginFailed__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	struct TArray<struct FString> GetServicePlatforms(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.GetServicePlatforms // (Final|Native|Public|BlueprintCallable) // @ game+0x1e44990
	struct FString GetServicePlatformName(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.GetServicePlatformName // (Final|Native|Public|BlueprintCallable) // @ game+0x1e44910
	struct ABravoHotelCharacter* GetLobbyPawn(int32_t Index); // Function BravoHotelGame.BattleRoyaleGameMode_Login.GetLobbyPawn // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1e44880
	struct ABravoHotelCharacter* GetCustomizePawn(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.GetCustomizePawn // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1e44850
	void EquipDefaultWeapon(struct ABravoHotelCharacter* TargetCharacter, struct FName& ItemRowName, int32_t TargetWeaponSlotIndex); // Function BravoHotelGame.BattleRoyaleGameMode_Login.EquipDefaultWeapon // (Final|Native|Public|HasOutParms) // @ game+0x1e44740
	void CreateCharacter__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.CreateCharacter__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
};

// Class BravoHotelGame.BattleRoyaleGameMode_StoreWeb
// Size: 0x408 (Inherited: 0x408)
struct ABattleRoyaleGameMode_StoreWeb : ABravoHotelGameModeBase {

	void ChangeLevel(struct FString NextLevelName); // Function BravoHotelGame.BattleRoyaleGameMode_StoreWeb.ChangeLevel // (Final|Native|Public|BlueprintCallable) // @ game+0x1e45330
};

// Class BravoHotelGame.BravoHotelGameState
// Size: 0x678 (Inherited: 0x390)
struct ABravoHotelGameState : AGameState {
	char MatchWinnerTeam; // 0x390(0x01)
	char pad_391[0x7]; // 0x391(0x07)
	struct ABravoHotelPlayerState* WinnerPlayerState; // 0x398(0x08)
	int32_t TimeRemaining; // 0x3a0(0x04)
	struct FName CurrentSeasonID; // 0x3a4(0x08)
	int32_t PerkMode; // 0x3ac(0x04)
	int32_t RecipeMode; // 0x3b0(0x04)
	int32_t MaxPerkCount; // 0x3b4(0x04)
	int32_t OverrideUltimateLevel; // 0x3b8(0x04)
	char pad_3BC[0x4]; // 0x3bc(0x04)
	struct TMap<struct FName, int32_t> PerkClassNumCap; // 0x3c0(0x50)
	struct TMap<struct FName, float> PerkClassWeightModifier; // 0x410(0x50)
	struct TArray<struct FName> PerkClassBlock; // 0x460(0x10)
	bool bBlockSpawnVehicle; // 0x470(0x01)
	bool bBlockRedZone; // 0x471(0x01)
	bool PerkLevelUpAllUserSame; // 0x472(0x01)
	char pad_473[0x5]; // 0x473(0x05)
	struct FString CQRKey; // 0x478(0x10)
	enum class EGameViewType GameViewType; // 0x488(0x01)
	enum class EMatchingType MatchingType; // 0x489(0x01)
	char pad_48A[0x2]; // 0x48a(0x02)
	struct FName ExpertWeaponTableID; // 0x48c(0x08)
	int32_t PersonalSupplyBoxPositionType; // 0x494(0x04)
	bool NoDelaySpawnPersonalSupplyBox; // 0x498(0x01)
	bool MustSpawnPersonalSupplyBox; // 0x499(0x01)
	char pad_49A[0x2]; // 0x49a(0x02)
	int32_t RetiredPlayerCount; // 0x49c(0x04)
	struct TMap<int32_t, struct ABravoHotelPlayerState*> UniqueIDPlayerStates; // 0x4a0(0x50)
	struct FGuid MatchID; // 0x4f0(0x10)
	struct FString GameServerID; // 0x500(0x10)
	char pad_510[0x10]; // 0x510(0x10)
	struct FGameSettingClassSelectInfoElement DefaultClassSelectInfo; // 0x520(0x28)
	struct FGameSettingClassChangeInfoElement DefaultClassChangeInfo; // 0x548(0x48)
	struct FGameSettingInfo CurrentGameSettingInfo; // 0x590(0x88)
	bool IsUsingOuterAreaBlueZone; // 0x618(0x01)
	char pad_619[0x7]; // 0x619(0x07)
	struct ABravoHotelBlueZone* BlueZone; // 0x620(0x08)
	struct FMulticastInlineDelegate OnBlueZoneDelegate; // 0x628(0x10)
	struct FMulticastInlineDelegate OnChangePerkModeDelegate; // 0x638(0x10)
	char pad_648[0x1c]; // 0x648(0x1c)
	float RecoilModifier_AR; // 0x664(0x04)
	float RecoilModifier_SMG; // 0x668(0x04)
	float RecoilModifier_SG; // 0x66c(0x04)
	float RecoilModifier_DMR; // 0x670(0x04)
	float RecoilModifier_SR; // 0x674(0x04)

	void ShowTimeHUDMessage(); // Function BravoHotelGame.BravoHotelGameState.ShowTimeHUDMessage // (Native|Public) // @ game+0x1f204b0
	void OnRep_TimeRemaining(); // Function BravoHotelGame.BravoHotelGameState.OnRep_TimeRemaining // (Final|Native|Public) // @ game+0x1f20490
	void OnRep_RecipeMode(); // Function BravoHotelGame.BravoHotelGameState.OnRep_RecipeMode // (Final|Native|Public) // @ game+0x1f20470
	void OnRep_PerkMode(); // Function BravoHotelGame.BravoHotelGameState.OnRep_PerkMode // (Final|Native|Public) // @ game+0x1f20450
	void OnRep_OverrideUltimateLevel(); // Function BravoHotelGame.BravoHotelGameState.OnRep_OverrideUltimateLevel // (Final|Native|Public) // @ game+0x1f20430
	void OnRep_CurrentGameSettingInfo(); // Function BravoHotelGame.BravoHotelGameState.OnRep_CurrentGameSettingInfo // (Final|Native|Public) // @ game+0x1f20410
	void OnRep_BlueZone(); // Function BravoHotelGame.BravoHotelGameState.OnRep_BlueZone // (Final|Native|Public) // @ game+0x1f203f0
	void OnChangePerkModeDelegate__DelegateSignature(int32_t PerkMode); // DelegateFunction BravoHotelGame.BravoHotelGameState.OnChangePerkModeDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	bool IsDuplicateSelectPossible(); // Function BravoHotelGame.BravoHotelGameState.IsDuplicateSelectPossible // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1f203c0
	bool IsCurrentStatusParty(); // Function BravoHotelGame.BravoHotelGameState.IsCurrentStatusParty // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1f20390
	struct ABravoHotelPlayerState* GetPlayerStateByUniqueID(int32_t UniqueID); // Function BravoHotelGame.BravoHotelGameState.GetPlayerStateByUniqueID // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1f20300
	struct FString GetMatchIDString(); // Function BravoHotelGame.BravoHotelGameState.GetMatchIDString // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1f20270
	struct ABravoHotelBlueZone* GetBlueZone(); // Function BravoHotelGame.BravoHotelGameState.GetBlueZone // (Native|Public|BlueprintCallable) // @ game+0x1f20240
	void ChangeRemainTime(int32_t RemainTime); // Function BravoHotelGame.BravoHotelGameState.ChangeRemainTime // (Native|Public) // @ game+0x1f201b0
	void BlueZoneDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelGameState.BlueZoneDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
};

// Class BravoHotelGame.BattleRoyaleGameState
// Size: 0x850 (Inherited: 0x678)
struct ABattleRoyaleGameState : ABravoHotelGameState {
	bool IsNewItemSpawnMode; // 0x678(0x01)
	char pad_679[0x3]; // 0x679(0x03)
	int32_t TeamSize; // 0x67c(0x04)
	enum class EGameMode GameRule; // 0x680(0x01)
	enum class EBattleRoyaleState BattleRoyaleState; // 0x681(0x01)
	char pad_682[0x2]; // 0x682(0x02)
	int32_t TotalPlayerCount; // 0x684(0x04)
	int32_t TotalAIPlayerCount; // 0x688(0x04)
	int32_t CurrentPlayerCount; // 0x68c(0x04)
	int32_t CurrentTeamCount; // 0x690(0x04)
	int32_t TotalTeamCount; // 0x694(0x04)
	struct FMulticastInlineDelegate OnBattleRoyalStateChanged; // 0x698(0x10)
	struct FMulticastInlineDelegate OnRocketLaunch; // 0x6a8(0x10)
	struct FMulticastInlineDelegate OnItemSpawnModeChanged; // 0x6b8(0x10)
	struct FMulticastInlineDelegate OnChangeRemainTime; // 0x6c8(0x10)
	bool bCheckSeaLevelZ; // 0x6d8(0x01)
	char pad_6D9[0x3]; // 0x6d9(0x03)
	float SeaLevelZ; // 0x6dc(0x04)
	char pad_6E0[0x4]; // 0x6e0(0x04)
	int32_t GhostPlayerCountForTest; // 0x6e4(0x04)
	struct FMulticastInlineDelegate OnRepTeamSize; // 0x6e8(0x10)
	struct TArray<struct FCharacterDiedInfo> CharacterDiedInfos; // 0x6f8(0x10)
	struct TArray<struct FTeamEndInfo> TeamEndInfos; // 0x708(0x10)
	struct TArray<struct FAirCraftBoardingPlayerList> AirCraftBoardingInfos; // 0x718(0x10)
	struct ABravoHotelRedZone* redzone; // 0x728(0x08)
	struct ABravoHotelRedZoneManager* RedZoneManager; // 0x730(0x08)
	char pad_738[0x58]; // 0x738(0x58)
	struct FMulticastInlineDelegate AirCraftDescentPlayerInfoEvent; // 0x790(0x10)
	struct FMulticastInlineDelegate EndAirCraftBoardingPlayerEvent; // 0x7a0(0x10)
	struct ABravoHotelAircraftFlight* AircraftFlightRef; // 0x7b0(0x08)
	struct FMulticastInlineDelegate OnRepCurrentPlayerCount; // 0x7b8(0x10)
	struct FMulticastInlineDelegate OnRepCurrentTeamCount; // 0x7c8(0x10)
	struct TArray<struct UObject*> RestoreList; // 0x7d8(0x10)
	char pad_7E8[0x8]; // 0x7e8(0x08)
	struct FTimerHandle TimerHandle_MoveToLobbyLevel; // 0x7f0(0x08)
	struct TMap<struct FName, int32_t> CurrentClassCounts; // 0x7f8(0x50)
	int32_t AutoBotCount; // 0x848(0x04)
	char pad_84C[0x4]; // 0x84c(0x04)

	void SetDescentPlayerInfo(int32_t PlayerId); // Function BravoHotelGame.BattleRoyaleGameState.SetDescentPlayerInfo // (Final|Native|Public) // @ game+0x1e46a00
	void SetAutoBotCount(int32_t Count); // Function BravoHotelGame.BattleRoyaleGameState.SetAutoBotCount // (Final|Native|Public) // @ game+0x1e46980
	void SetAirCraftBoardingPlayerInfo(bool IsTeam, int32_t TeamID, int32_t PlayerId); // Function BravoHotelGame.BattleRoyaleGameState.SetAirCraftBoardingPlayerInfo // (Final|Native|Public) // @ game+0x1e46880
	void ResetAirCraftBoardingPlayerInfo(); // Function BravoHotelGame.BattleRoyaleGameState.ResetAirCraftBoardingPlayerInfo // (Final|Native|Public) // @ game+0x1e46860
	void RemainTimeDelegate__DelegateSignature(int32_t RemainTime); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.RemainTimeDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnRocketLaunch__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.OnRocketLaunch__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnRepTeamSize__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.OnRepTeamSize__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnRepCurrentPlayerCount__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.OnRepCurrentPlayerCount__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnRep_TeamSize(); // Function BravoHotelGame.BattleRoyaleGameState.OnRep_TeamSize // (Final|Native|Public) // @ game+0x1e46840
	void OnRep_CurrentTeamCount(); // Function BravoHotelGame.BattleRoyaleGameState.OnRep_CurrentTeamCount // (Final|Native|Public) // @ game+0x1e46820
	void OnRep_CurrentPlayerCount(); // Function BravoHotelGame.BattleRoyaleGameState.OnRep_CurrentPlayerCount // (Final|Native|Public) // @ game+0x1e46800
	void OnRep_ChangeNewItemSpawnMode(); // Function BravoHotelGame.BattleRoyaleGameState.OnRep_ChangeNewItemSpawnMode // (Final|Native|Public) // @ game+0x1e467e0
	void OnRep_BattleRoyaleState(); // Function BravoHotelGame.BattleRoyaleGameState.OnRep_BattleRoyaleState // (Final|Native|Public) // @ game+0x1e467c0
	void MulticastOnRocketLaunch(); // Function BravoHotelGame.BattleRoyaleGameState.MulticastOnRocketLaunch // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1e467a0
	void MulticastMoveToLobbyLevel(); // Function BravoHotelGame.BattleRoyaleGameState.MulticastMoveToLobbyLevel // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x1e46780
	void ItemSpawnModeDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.ItemSpawnModeDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	float GetSeaLevelZ(); // Function BravoHotelGame.BattleRoyaleGameState.GetSeaLevelZ // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1e46750
	struct ABravoHotelRedZone* GetRedZone(); // Function BravoHotelGame.BattleRoyaleGameState.GetRedZone // (Final|Native|Public|BlueprintCallable) // @ game+0x1e46720
	void FindAirCraftFlightActor(); // Function BravoHotelGame.BattleRoyaleGameState.FindAirCraftFlightActor // (Final|Native|Public) // @ game+0x1e46700
	void EndAirCraftBoardingPlayer__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.EndAirCraftBoardingPlayer__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void EndAirCraftBoardingPlayer(); // Function BravoHotelGame.BattleRoyaleGameState.EndAirCraftBoardingPlayer // (Final|Native|Public) // @ game+0x1e466e0
	void DoRestore(); // Function BravoHotelGame.BattleRoyaleGameState.DoRestore // (Final|Native|Public) // @ game+0x1e466c0
	void DoMoveToLobbyLevel(float DelayTime); // Function BravoHotelGame.BattleRoyaleGameState.DoMoveToLobbyLevel // (Final|Native|Public) // @ game+0x1e46640
	void ClientExcuteEndAirCraftBoardingPlayerEvent(); // Function BravoHotelGame.BattleRoyaleGameState.ClientExcuteEndAirCraftBoardingPlayerEvent // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1e46620
	void ClientExcuteAirCraftDescentPlayerInfoEvent(int32_t AirCraftID, int32_t SeatID, int32_t PlayerId); // Function BravoHotelGame.BattleRoyaleGameState.ClientExcuteAirCraftDescentPlayerInfoEvent // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1e46530
	void BattleRoyalStateChanged__DelegateSignature(enum class EBattleRoyaleState PrevState, enum class EBattleRoyaleState CurrentState); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.BattleRoyalStateChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void AirCraftDescentPlayerInfo__DelegateSignature(int32_t AirCraftID, int32_t SeatID, int32_t PlayerId); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.AirCraftDescentPlayerInfo__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
};

// Class BravoHotelGame.BHPersonalSupplyBox
// Size: 0x388 (Inherited: 0x320)
struct ABHPersonalSupplyBox : AActor {
	bool NeedInit; // 0x320(0x01)
	char pad_321[0xf]; // 0x321(0x0f)
	struct UBoxComponent* RootBoxComponent; // 0x330(0x08)
	struct USphereComponent* InteractiveSphereComponent; // 0x338(0x08)
	struct UBoxComponent* InteractiveCancleSphereComponent; // 0x340(0x08)
	struct FName BoxName; // 0x348(0x08)
	struct TArray<int32_t> RelatedPlayerIds; // 0x350(0x10)
	char pad_360[0x9]; // 0x360(0x09)
	enum class EBoxStateType CurrentStateType; // 0x369(0x01)
	bool CheckRePosition; // 0x36a(0x01)
	char pad_36B[0x5]; // 0x36b(0x05)
	struct FTimerHandle TimeHandle_CheckRePosition; // 0x370(0x08)
	int32_t CustomIndex; // 0x378(0x04)
	bool TraceLand; // 0x37c(0x01)
	char pad_37D[0x3]; // 0x37d(0x03)
	struct FTimerHandle TimerHandle_Destroy; // 0x380(0x08)

	void UpdateCheckRePosition(); // Function BravoHotelGame.BHPersonalSupplyBox.UpdateCheckRePosition // (Final|Native|Public) // @ game+0x1e47960
	void RequestRePosition(float StartZ, float EndZ); // Function BravoHotelGame.BHPersonalSupplyBox.RequestRePosition // (Final|Native|Public) // @ game+0x1e478a0
	void RePosition(struct FVector& NewLocation); // Function BravoHotelGame.BHPersonalSupplyBox.RePosition // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x1e47810
	void OnRep_SetStateType(); // Function BravoHotelGame.BHPersonalSupplyBox.OnRep_SetStateType // (Native|Public) // @ game+0x1e477f0
	void OnRep_RelatedPlayerIds(); // Function BravoHotelGame.BHPersonalSupplyBox.OnRep_RelatedPlayerIds // (Final|Native|Public) // @ game+0x1e477d0
	void OnRep_CheckRePosition(); // Function BravoHotelGame.BHPersonalSupplyBox.OnRep_CheckRePosition // (Final|Native|Public) // @ game+0x1e477b0
	void OnRecall(); // Function BravoHotelGame.BHPersonalSupplyBox.OnRecall // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x23a3b60
	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function BravoHotelGame.BHPersonalSupplyBox.OnOverlapEnd // (Final|Native|Public) // @ game+0x1e47670
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function BravoHotelGame.BHPersonalSupplyBox.OnOverlapBegin // (Final|Native|Public|HasOutParms) // @ game+0x1e47460
	void OnChangeState(enum class EBoxStateType StateType); // Function BravoHotelGame.BHPersonalSupplyBox.OnChangeState // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x23a3b60
	void OnAssigned(); // Function BravoHotelGame.BHPersonalSupplyBox.OnAssigned // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x23a3b60
	bool IsReplatedBP(); // Function BravoHotelGame.BHPersonalSupplyBox.IsReplatedBP // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1e47430
	void GetRelatedPlayerIds(struct TArray<int32_t>& outList); // Function BravoHotelGame.BHPersonalSupplyBox.GetRelatedPlayerIds // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1e47380
	void DestroyBox(); // Function BravoHotelGame.BHPersonalSupplyBox.DestroyBox // (Final|Native|Public) // @ game+0x1e47360
	void ChangeBoxMesh(bool IsMyBox); // Function BravoHotelGame.BHPersonalSupplyBox.ChangeBoxMesh // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x23a3b60
};

// Class BravoHotelGame.BravoHotelDropBoxActor
// Size: 0x3a0 (Inherited: 0x320)
struct ABravoHotelDropBoxActor : AActor {
	enum class EPickupRoot RootType; // 0x320(0x01)
	char pad_321[0x7]; // 0x321(0x07)
	struct UBoxComponent* RootBoxComponent; // 0x328(0x08)
	struct UDropBoxInventoryComponent* InventoryComponent; // 0x330(0x08)
	struct USphereComponent* InteractiveSphereComponent; // 0x338(0x08)
	struct UBoxComponent* InteractiveCancleSphereComponent; // 0x340(0x08)
	struct FName DropperNickName; // 0x348(0x08)
	struct FName BoxName; // 0x350(0x08)
	int32_t RarityIndex; // 0x358(0x04)
	char pad_35C[0x4]; // 0x35c(0x04)
	struct ABravoHotelCharacter* DetectedCharacter; // 0x360(0x08)
	char pad_368[0x38]; // 0x368(0x38)

	void SetItemInBlueprint(struct FName& ItemKey); // Function BravoHotelGame.BravoHotelDropBoxActor.SetItemInBlueprint // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x23a3b60
	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function BravoHotelGame.BravoHotelDropBoxActor.OnOverlapEnd // (Native|Public) // @ game+0x1f12110
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function BravoHotelGame.BravoHotelDropBoxActor.OnOverlapBegin // (Native|Public|HasOutParms) // @ game+0x1f11f10
	void OnDeactivated(); // Function BravoHotelGame.BravoHotelDropBoxActor.OnDeactivated // (Event|Public|BlueprintEvent) // @ game+0x23a3b60
	void OnBoxChanged(); // Function BravoHotelGame.BravoHotelDropBoxActor.OnBoxChanged // (Native|Public) // @ game+0x1f11ef0
	void OnActivated(); // Function BravoHotelGame.BravoHotelDropBoxActor.OnActivated // (Event|Public|BlueprintEvent) // @ game+0x23a3b60
	void AddItemsToBox(struct TArray<struct FSpawnItemResult>& ItemsToSpawn); // Function BravoHotelGame.BravoHotelDropBoxActor.AddItemsToBox // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1f11e10
};

// Class BravoHotelGame.BHPersonalSupplyBoxDummy
// Size: 0x3a8 (Inherited: 0x3a0)
struct ABHPersonalSupplyBoxDummy : ABravoHotelDropBoxActor {
	int32_t playerGUID; // 0x3a0(0x04)
	char pad_3A4[0x4]; // 0x3a4(0x04)
};

// Class BravoHotelGame.BHPersonalSupplyBoxManager
// Size: 0x3e0 (Inherited: 0x320)
struct ABHPersonalSupplyBoxManager : AInfo {
	struct ABHPersonalSupplyBox* SupplyBoxClass; // 0x320(0x08)
	struct TArray<struct FPersonalSupplyPhaseInfo> ListPhaseInfo; // 0x328(0x10)
	int32_t CurrentPhaseNum; // 0x338(0x04)
	char pad_33C[0x4]; // 0x33c(0x04)
	struct TArray<struct ABHPersonalSupplyBox*> ListUsableSupplyBox; // 0x340(0x10)
	struct TMap<int32_t, struct ABHPersonalSupplyBox*> MapSupplyBox; // 0x350(0x50)
	struct FName TestRandomTableID; // 0x3a0(0x08)
	bool UseTestRandom; // 0x3a8(0x01)
	char pad_3A9[0x17]; // 0x3a9(0x17)
	struct TArray<struct ABHPersonalSupplyBox*> SpawnedSupplyBoxList; // 0x3c0(0x10)
	struct TArray<struct ABHPersonalSupplyBox*> ForceSpawnedSupplyBoxList; // 0x3d0(0x10)

	void SetCurrentPhaseNum(int32_t PhaseNum); // Function BravoHotelGame.BHPersonalSupplyBoxManager.SetCurrentPhaseNum // (Final|Native|Public|BlueprintCallable) // @ game+0x1e47e40
	void RecallAll(); // Function BravoHotelGame.BHPersonalSupplyBoxManager.RecallAll // (Final|Native|Public|BlueprintCallable) // @ game+0x1e47e20
	void ReassignAll(bool Force); // Function BravoHotelGame.BHPersonalSupplyBoxManager.ReassignAll // (Final|Native|Public|BlueprintCallable) // @ game+0x1e47d90
};

// Class BravoHotelGame.BravoHotelCharacter
// Size: 0x3ac0 (Inherited: 0x5f0)
struct ABravoHotelCharacter : ACharacter {
	char pad_5F0[0xad8]; // 0x5f0(0xad8)
	struct UAkComponent* AudioComponent; // 0x10c8(0x08)
	char pad_10D0[0x560]; // 0x10d0(0x560)
	struct USceneComponent* CameraBase; // 0x1630(0x08)
	char pad_1638[0x1c30]; // 0x1638(0x1c30)
	struct USpringArmComponent* CameraAssistant3P; // 0x3268(0x08)
	struct UBravoHotelCameraComponent* Camera3P; // 0x1a98(0x08)
	struct UPointLightComponent* CharacterBackLight; // 0x1460(0x08)
	struct UPointLightComponent* CharacterBackLightSecond; // 0x9d8(0x08)
	float BackLightIntensity_FPP; // 0x1ebc(0x04)
	float BackLightIntensity_ADS; // 0x88c(0x04)
	struct TArray<struct UParticleSystemComponent*> BuffParticleComponents; // 0x1800(0x10)
	struct UCustomizableSkeletalComponent* MutableComponent; // 0x2f90(0x08)
	struct USphereComponent* InteractiveSphereComponent; // 0x28e8(0x08)
	struct USphereComponent* InteractiveCancleSphereComponent; // 0x22a0(0x08)
	struct USkeletalMeshComponent* Parachute; // 0xe88(0x08)
	struct UParticleSystemComponent* WaterParticleSystem; // 0xe18(0x08)
	struct UParticleSystemComponent* FlameDamageParticleComponent; // 0x28f8(0x08)
	char pad_32D0[0x780]; // 0x32d0(0x780)
	struct UParticleSystem* FlameDamageParticle; // 0x3a50(0x08)
	struct UBravoHotelSTMComponent* STMComponent; // 0x1580(0x08)
	struct UBravoHotelActionComponent* ActionComponent; // 0xaf8(0x08)
	char pad_3A68[0x50]; // 0x3a68(0x50)
	struct UBravoHotelPerkComponent* PerkComponent; // 0x3ab8(0x08)
	struct UTeamInfoUpdaterComponent* TeamInfoUpdaterComponentRef; // 0x1d98(0x08)
	struct FTimerHandle TimeHandle_MolotovDotDamage; // 0x19e8(0x08)
	struct FAnimSlot Stand_FlameDotDamageAnim; // 0x19b8(0x10)
	struct FAnimSlot Prone_FlameDotDamageAnim; // 0x1db8(0x10)
	struct TArray<struct FMolotovFlameDotDamageInfo> FlameDamageInfos; // 0x2398(0x10)
	struct FString NPCNickName; // 0xce0(0x10)
	bool bAllowToggleCamera; // 0xea8(0x01)
	bool bThirdPerson; // 0x7f5(0x01)
	float SprintingMoveRightModifier; // 0xb54(0x04)
	float LeanValue; // 0x27fc(0x04)
	float LeanDegreeMax; // 0x3278(0x04)
	float LeanUpdateSpeed; // 0x894(0x04)
	enum class ELeanState SaveLeanState; // 0x1820(0x01)
	enum class ELeanState PrevLeanState; // 0x25c8(0x01)
	bool bFixLeanDegreeMax; // 0x1840(0x01)
	bool bFixFPPFoV; // 0x2a30(0x01)
	float Health; // 0x22d0(0x04)
	float ShortTimeHealth; // 0x18f8(0x04)
	float TargetHealth; // 0xb68(0x04)
	float BandageTargetHealth; // 0x3650(0x04)
	float OverHealHealth; // 0xb10(0x04)
	struct UCameraPostProcessPreset* PP_Preset_ShortHealth; // 0x9e8(0x08)
	struct UCameraPostProcessPreset* PPInst_ShortHealth; // 0x17f0(0x08)
	struct TMap<enum class ETargetHealthType, struct FTargetHealthInfo> TargetHealthMap; // 0x1a10(0x50)
	float Oxygen; // 0x2878(0x04)
	float SteadyPoint; // 0x1588(0x04)
	int8_t BoostPercent; // 0x8d8(0x01)
	float Default3PFOV; // 0x3304(0x04)
	float Default3PFOV_AOS; // 0xe68(0x04)
	float Default3PFOV_AMP; // 0x9f0(0x04)
	float Default3PFOV_HeartBeatSensor; // 0x3728(0x04)
	float Default3PFOV_SkillMAP; // 0x9e0(0x04)
	float ForwardAxisValue; // 0x1958(0x04)
	float RightAxisValue; // 0x2288(0x04)
	float InputMovementAttenuationTime; // 0x1290(0x04)
	float InputMovementAttenuationTimeIdleToCrouch; // 0x2838(0x04)
	float InputMovementAttenuationTimeIdleToProne; // 0x2020(0x04)
	float InputMovementAttenuationTimeProneToIdle; // 0xa18(0x04)
	float InputMovementAttenuationValueIdleToCrouch; // 0x2860(0x04)
	float InputMovementAttenuationValueIdleToProne; // 0x37d0(0x04)
	float InputMovementAttenuationValueProneToIdle; // 0x34a0(0x04)
	float InputMovementAttenuationValue; // 0x2e40(0x04)
	bool bMovementKeyPushed; // 0x2ae8(0x01)
	bool bLastMovementKeyPushed; // 0x1b0c(0x01)
	bool bMovementInputLock; // 0x2931(0x01)
	struct FVector2D InputAxisOnLockMovement; // 0x2c98(0x08)
	bool bInputKeyJump; // 0x7e8(0x01)
	float DoubleTapDelay_ToggleLean; // 0x1ce8(0x04)
	bool bShouldSprint; // 0x28c0(0x01)
	enum class EFireType FireTypeComplete; // 0x2864(0x01)
	struct UDataTable* PerBoneDamageTable; // 0x1b80(0x08)
	struct UDataTable* MeleeDamageTable; // 0x1828(0x08)
	struct UDataTable* PistolsDamageTable; // 0x7d8(0x08)
	struct UDataTable* ShotgunsDamageTable; // 0x1d00(0x08)
	struct UDataTable* SMGsDamageTable; // 0x1ad8(0x08)
	struct UDataTable* ARsDamageTable; // 0x2048(0x08)
	struct UDataTable* DMRsDamageTable; // 0x2128(0x08)
	struct UDataTable* SRsDamageTable; // 0xcf8(0x08)
	struct ABravoHotelBrokenEquipment* BrokenHelmetClass; // 0xa10(0x08)
	bool bNeedToSpawnBrokenEquipment; // 0x2024(0x01)
	float BrokenEquipmentLevel; // 0x3a34(0x04)
	struct FVector BrokenEquipmentDamagedDirection; // 0xdd4(0x0c)
	enum class EWearableItemType BrokenEquipmentType; // 0x166c(0x01)
	enum class EInteractionType InteractionType; // 0x3810(0x01)
	float InteractionTraceDistance; // 0x1420(0x04)
	struct AActor* DetectedInteractionActor; // 0x2ef0(0x08)
	struct UPrimitiveComponent* DetectedInteractionComponet; // 0x1cd8(0x08)
	struct USceneComponent* DetectedVehicleSeatComponent; // 0x36c0(0x08)
	struct TArray<struct AActor*> DetectedInteractionCancleActors; // 0x2840(0x10)
	struct TMap<struct UObject*, float> InteractionDistRatioMap; // 0x2e90(0x50)
	float ResurrectionCameraBlendTime; // 0x1698(0x04)
	struct UCameraPostProcessPreset* PostProcessResurrectionClass; // 0x3320(0x08)
	struct UCurveFloat* ResurrectionEffectCurve; // 0x1988(0x08)
	struct TScriptInterface<IMaterialControllableInterface> ResurrectionMaterialController; // 0x3a88(0x10)
	struct ABravoHotelPickup* DetectedPickableItem; // 0x3770(0x08)
	struct TArray<struct ABravoHotelPickup*> DetectedItemList; // 0x2bd8(0x10)
	struct TArray<struct ABravoHotelDropBoxActor*> DetectedBoxList; // 0x1068(0x10)
	struct TArray<struct ABravoHotelCharacter*> DetectedStealableList; // 0x8f8(0x10)
	struct TArray<struct ABravoHotelPickup*> DetectedItemHideList; // 0x30c8(0x10)
	struct FTimerHandle TimerHandle_CheckDetectedItemList; // 0x3490(0x08)
	struct UPlayerInventoryComponent* InventoryComponent; // 0xe70(0x08)
	struct UBravoHotelAbilityComponent* AbilityComponent; // 0x7e0(0x08)
	struct UBravoHotelDoorComponent* DoorComponent; // 0x1ef0(0x08)
	struct UParkourComponent* ParkourComponent; // 0x36a8(0x08)
	struct UBravoHotelBlueZoneGameRule* BlueZoneGameRule; // 0x2830(0x08)
	struct UBravoHotelVoiceComponent* VoiceComponent; // 0x1920(0x08)
	struct ULadderComponent* LadderComponent; // 0x29c0(0x08)
	struct UBHStationaryCharInfo* StationaryCharInfo; // 0x12e0(0x08)
	struct UBHCharacterReplication* CharacterReplication; // 0x37b0(0x08)
	struct FAnimSlot CombineAnim_Stand; // 0x3410(0x10)
	struct FAnimSlot CombineAnim_Prone; // 0x2b18(0x10)
	struct FAnimSlot RepairAnim_Stand; // 0x2b68(0x10)
	struct FAnimSlot RepairAnim_Prone; // 0x25b8(0x10)
	struct UAnimMontage* CurrentPickupMontage; // 0x19c8(0x08)
	struct FAnimSlot PickUpAnim_Unarmed_Floor; // 0x2bc8(0x10)
	struct FAnimSlot PickUpAnim_Unarmed_Table; // 0x23a8(0x10)
	struct FAnimSlot PickUpAnim_Unarmed_Crouch; // 0x2898(0x10)
	struct FAnimSlot PickUpAnim_Unarmed_Prone; // 0x27d8(0x10)
	struct FAnimSlot PickUpAnim_Rifle_Floor; // 0x1908(0x10)
	struct FAnimSlot PickUpAnim_Rifle_Table; // 0x8b0(0x10)
	struct FAnimSlot PickUpAnim_Rifle_Crouch; // 0x2080(0x10)
	struct FAnimSlot PickUpAnim_Rifle_Prone; // 0x1f00(0x10)
	struct FAnimSlot PickUpAnim_Pistol_Floor; // 0x2e70(0x10)
	struct FAnimSlot PickUpAnim_Pistol_Table; // 0x1050(0x10)
	struct FAnimSlot PickUpAnim_Pistol_Crouch; // 0x2258(0x10)
	struct FAnimSlot PickUpAnim_Pistol_Prone; // 0x1610(0x10)
	struct FAnimSlot DoorAnim_Open; // 0x2f98(0x10)
	struct FAnimSlot DoorAnim_Close; // 0x32c0(0x10)
	struct FAnimSlot DoorAnim_Kick; // 0x1858(0x10)
	struct FAnimSlot MovementAnim_GetUpFromBack; // 0x2bf0(0x10)
	struct FAnimSlot MovementAnim_GetUpFromFront; // 0xac0(0x10)
	struct FAnimSlot ConditionAnim_ShakeOut_Unarmed; // 0xd38(0x10)
	struct FAnimSlot ConditionAnim_ShakeOut_Rifle; // 0x30a0(0x10)
	struct TArray<struct FAnimSlot> MeleeAnim_Punch_Idle; // 0x15c8(0x10)
	struct TArray<struct FAnimSlot> MeleeAnim_Punch_Crouch; // 0x26f8(0x10)
	struct FAnimSlot MeleeAnim_Punch_Jump; // 0x1248(0x10)
	struct TArray<struct FAnimSlot> MeleeAnim_Rifle_Idle; // 0x1c70(0x10)
	struct TArray<struct FAnimSlot> MeleeAnim_Rifle_Crouch; // 0x1188(0x10)
	struct TArray<struct FAnimSlot> MeleeAnim_Pistol_Idle; // 0x8e0(0x10)
	struct TArray<struct FAnimSlot> MeleeAnim_Pistol_Crouch; // 0x28a8(0x10)
	struct TArray<struct FAnimSlot> DeathAnim_Crouch; // 0x1960(0x10)
	struct TArray<struct FAnimSlot> DeathAnim_FlameDamage; // 0x2a50(0x10)
	struct TArray<struct FAnimSlot> DeathAnim_Grenade; // 0xda8(0x10)
	struct TArray<struct FAnimSlot> DeathAnim_HeadShot; // 0x3168(0x10)
	struct TArray<struct FAnimSlot> DeathAnim_Natural; // 0x3378(0x10)
	struct TArray<struct FAnimSlot> DeathAnim_Rifle; // 0x3240(0x10)
	struct TArray<struct FAnimSlot> DeathAnim_Shotgun; // 0x25e0(0x10)
	struct TArray<struct FAnimSlot> DeathAnim_Sprint; // 0x1e10(0x10)
	struct TArray<struct FAnimSlot> DeathAnim_Falling; // 0x2530(0x10)
	struct UAnimationAsset* DeathAnim_ClosedEyes; // 0x26c0(0x08)
	struct UAkAudioEvent* PickUpStartEvent; // 0xdf0(0x08)
	struct UAkAudioEvent* PickUpBackpackEvent; // 0x2040(0x08)
	struct FAnimSlot EquipAnim_MainWeapon1; // 0x2cd8(0x10)
	struct FAnimSlot EquipAnim_MainWeapon1_Prone; // 0x2b58(0x10)
	struct FAnimSlot EquipAnim_MainWeapon2; // 0x1300(0x10)
	struct FAnimSlot EquipAnim_MainWeapon2_Prone; // 0x1a68(0x10)
	struct FAnimSlot EquipAnim_SubWeapon; // 0x2ac0(0x10)
	struct FAnimSlot EquipAnim_SubWeapon_Prone; // 0x1b58(0x10)
	struct FAnimSlot EquipAnim_Melee; // 0x1ae0(0x10)
	struct FAnimSlot EquipAnim_Melee_Prone; // 0x2600(0x10)
	struct FAnimSlot EquipAnim_Amplifier; // 0x3458(0x10)
	struct FAnimSlot EquipAnim_Amplifier_Prone; // 0x3090(0x10)
	struct FAnimSlot EquipAnim_HeartBeatSensor; // 0x2f18(0x10)
	struct FAnimSlot EquipAnim_HeartBeatSensor_Prone; // 0xc70(0x10)
	struct FAnimSlot SlidingAnim; // 0xf60(0x10)
	struct FAnimSlot RollingAnim; // 0x2068(0x10)
	struct FAnimSlot KnockbackRollingAnim; // 0x25f0(0x10)
	struct FAnimSlot EquipAnim_ThrowingWeapon; // 0x2fc0(0x10)
	struct FAnimSlot EquipAnim_Prone_ThrowingWeapon; // 0x16f0(0x10)
	struct FAnimSlot UnequipAnim_MainWeapon1; // 0xb90(0x10)
	struct FAnimSlot UnequipAnim_MainWeapon1_Prone; // 0x1c80(0x10)
	struct FAnimSlot UnequipAnim_MainWeapon2; // 0x3658(0x10)
	struct FAnimSlot UnequipAnim_MainWeapon2_Prone; // 0x3578(0x10)
	struct FAnimSlot UnequipAnim_SubWeapon; // 0x7c0(0x10)
	struct FAnimSlot UnequipAnim_SubWeapon_Prone; // 0xb40(0x10)
	struct FAnimSlot UnequipAnim_Melee; // 0x1468(0x10)
	struct FAnimSlot UnequipAnim_Melee_Prone; // 0x1a80(0x10)
	struct FAnimSlot UnequipAnim_Amplifier; // 0x14c8(0x10)
	struct FAnimSlot UnequipAnim_Amplifier_Prone; // 0x2300(0x10)
	struct FAnimSlot UnequipAnim_HeartBeatSensor; // 0x1f18(0x10)
	struct FAnimSlot UnequipAnim_HeartBeatSensor_Prone; // 0xfb8(0x10)
	struct FAnimSlot UnequipAnim_ThrowingWeapon; // 0x1e20(0x10)
	struct FAnimSlot UnequipAnim_Prone_ThrowingWeapon; // 0x1ca0(0x10)
	struct FAnimSlot LandingAnim_LandStop; // 0x1e58(0x10)
	struct FAnimSlot LandingAnim_Parachute; // 0x2730(0x10)
	struct FAnimSlot LandingAnim_Unarmed; // 0xca8(0x10)
	struct FAnimSlot LandingAnim_Rifle; // 0x33b0(0x10)
	struct FAnimSlot LandingAnim_Pistol; // 0x29a8(0x10)
	struct TArray<struct FResuscitationAnimSet> ResuscitationAnimSets; // 0x1040(0x10)
	struct TArray<struct UAkAudioEvent*> WeaponEquipEvents; // 0x2b80(0x10)
	struct TArray<struct UAkAudioEvent*> AttachmentEquipEvents; // 0xe78(0x10)
	struct TArray<struct UAkAudioEvent*> WearableEquipEvents; // 0x2090(0x10)
	struct TArray<struct UAkAudioEvent*> ConsumablesEvents; // 0x3a98(0x10)
	struct UAkAudioEvent* MedipackUseEvent; // 0x1ee0(0x08)
	struct UAkAudioEvent* ItemDropEvent; // 0x1b68(0x08)
	struct UAkAudioEvent* ADSEnterEvent; // 0x2198(0x08)
	struct UAkAudioEvent* ADSEnterEvent_Digital; // 0x3510(0x08)
	struct UAkAudioEvent* ADSExitEvent; // 0x1cd0(0x08)
	struct UAkAudioEvent* ADSExitEvent_Digital; // 0xc48(0x08)
	struct UAkAudioEvent* AOSEnterEvent; // 0x39c0(0x08)
	struct UAkAudioEvent* AOSExitEvent; // 0x37b8(0x08)
	struct UAkAudioEvent* AMPEnterEvent; // 0x2ba8(0x08)
	struct UAkAudioEvent* AMPExitEvent; // 0x2408(0x08)
	struct UAkAudioEvent* AMPNoiseEvent; // 0xb18(0x08)
	struct UAkAudioEvent* AMPNoiseStopEvent; // 0x2f70(0x08)
	struct UAkAudioEvent* PlosiveSoundDetection3LvEvent; // 0xbc8(0x08)
	struct UAkAudioEvent* HeartBeatSensorEnterEvent; // 0x8a0(0x08)
	struct UAkAudioEvent* HeartBeatSensorExitEvent; // 0x29e0(0x08)
	struct UAkAudioEvent* HeartBeatSensorNoiseEvent; // 0x32b0(0x08)
	struct UAkAudioEvent* HeartBeatSensorNoiseStopEvent; // 0x3798(0x08)
	struct UAkAudioEvent* DamagedEvent; // 0x2708(0x08)
	struct UAkAudioEvent* HitEvent; // 0x1478(0x08)
	struct UAkAudioEvent* SnowAreaEnteringEvent; // 0x9f8(0x08)
	struct UAkAudioEvent* UltimateSprintEvent; // 0x33e0(0x08)
	bool bIsParachuteLanding; // 0x2f88(0x01)
	float ParachuteLandingHeight; // 0x1408(0x04)
	struct UAkAudioEvent* StartDescendingEvent; // 0x23f8(0x08)
	struct UAkAudioEvent* ParachuteFoldEvent; // 0x1e70(0x08)
	struct FTimerHandle TimerHandle_Sequnce; // 0x2890(0x08)
	struct UWidgetComponent* TeamPosition; // 0x23f0(0x08)
	float AdditionalTeamPositionWidgetHeight; // 0x8f0(0x04)
	float TeamPositionWidgetInterpSpeed; // 0x3a18(0x04)
	float CurrentTeamPositionHeight; // 0x1258(0x04)
	struct FMulticastInlineDelegate OnChangeDetectedItems; // 0x3680(0x10)
	bool bIsArmedBeforeAction; // 0x17d8(0x01)
	struct FMulticastInlineDelegate Delegate_OnViewCameraInWater; // 0x1b28(0x10)
	struct FMulticastInlineDelegate Delegate_OnViewCameraOutWater; // 0x14e0(0x10)
	bool bInSmoke; // 0x1484(0x01)
	struct FMulticastInlineDelegate Delegate_OnInSmoke; // 0x1168(0x10)
	struct FMulticastInlineDelegate Delegate_OnOutSmoke; // 0x2a20(0x10)
	struct TArray<struct AActor*> SmokeActors; // 0x34c0(0x10)
	struct UAkAudioEvent* SwimDiveEvent; // 0x1ac0(0x08)
	bool bIsEnterIndoorVolume; // 0x1bbc(0x01)
	struct USkyLightComponent* SkyLightRef; // 0x2f68(0x08)
	float PrevSkyLightIntensityCache; // 0x19e0(0x04)
	struct FColor PrevSkyLightOcclusionTintCache; // 0x1240(0x04)
	float SkyLightCurrentPriority; // 0x3318(0x04)
	struct TArray<struct UInDoorVolumeComponent*> OverlappedInDoorVolumes; // 0x2b38(0x10)
	struct UBravoHotelPhysicalMaterial* LastSteppedSurface; // 0xae0(0x08)
	enum class EPhysicalSurface SurfaceType; // 0x3114(0x01)
	enum class EPhysicalSurface SurfaceType_LastTick; // 0x1344(0x01)
	float MP_SnowInterpSpeed; // 0x37e4(0x04)
	struct FTimerHandle TimerHandle_BreathEffect; // 0x1cf8(0x08)
	struct UParticleSystemComponent* BreathParticleComponent; // 0x9c0(0x08)
	struct UParticleSystem* BreathParticle_Idle; // 0x1550(0x08)
	struct UParticleSystem* BreathParticle_Moving; // 0x3960(0x08)
	struct UParticleSystem* InWaterParticle; // 0x3a58(0x08)
	struct FMulticastInlineDelegate OnUpdateMutableDelegate; // 0xd90(0x10)
	struct ABravoHotelWaterPhysicsVolume* OverlapWaterVolume; // 0x2c70(0x08)
	bool bIsMelee; // 0x2d69(0x01)
	bool bIsMeleeJumpAttack; // 0x2c79(0x01)
	bool bCanJumpMeleeAttack; // 0x2e58(0x01)
	bool bIsMeleeAttackBlocked; // 0x36b4(0x01)
	float LastMeleeAttackTime; // 0x2728(0x04)
	struct FAnimSlot CurrentMeleeAnimSlot; // 0xa70(0x10)
	struct TArray<struct AActor*> ActorsToIgnore_Melee; // 0x1448(0x10)
	struct TArray<struct UPrimitiveComponent*> MeshesToIgnore_Melee; // 0xb58(0x10)
	float UnarmedMeleeDamage_Ground; // 0xe04(0x04)
	float UnarmedMeleeDamage_Jump; // 0x3694(0x04)
	bool bIsFired; // 0xf59(0x01)
	bool bWantsToFire; // 0x1928(0x01)
	bool bWantsToAOS; // 0x2c80(0x01)
	bool bIsLanded; // 0xebc(0x01)
	float FiredTimeCount; // 0x2be8(0x04)
	float StartFireTime; // 0x1b00(0x04)
	char bIsADSFireToCamera : 1; // 0x2ef8(0x01)
	float FireToCameraLocationCorrection; // 0x3270(0x04)
	struct FRotator ArmsLagRotation; // 0x3078(0x0c)
	float ArmsLagDeltaMin; // 0x2120(0x04)
	float ArmsLagDeltaMax; // 0x258c(0x04)
	float DefaultsArmsLagRotationMax; // 0x1a0c(0x04)
	float DefaultsArmsLagRotationSpeed; // 0x1a7c(0x04)
	struct TMap<enum class EWeaponAttachmentItem, struct FBravoHotelArmsLag> ArmsLags; // 0x928(0x50)
	float ArmsLagBaseModify; // 0xe98(0x04)
	float ArmsLagWeaponModify; // 0x12e8(0x04)
	struct FRotator ArmsLagWeaponRotation; // 0x1de4(0x0c)
	struct FRotator ADSDeltaRotation; // 0x7f8(0x0c)
	struct FVector ADSEndLocation; // 0xe38(0x0c)
	bool bSteadyAim; // 0xfb1(0x01)
	struct FVector LastSwayRotationOnSteadyAim; // 0x168c(0x0c)
	struct UAkAudioEvent* SteadyAimReadyEvent; // 0x1fd8(0x08)
	struct UAkAudioEvent* SteadyAimStartEvent; // 0x1eb0(0x08)
	struct UAkAudioEvent* SteadyAimEndEvent; // 0x3070(0x08)
	float HeadShotBloodEffectDistance; // 0x1294(0x04)
	struct UParticleSystem* HeadShotHelmetFxEmitterTemplate; // 0x2200(0x08)
	float BoltActionDelayTime; // 0x3958(0x04)
	bool bWaitingADSReturn; // 0xf94(0x01)
	float ADSReturnEnableTime; // 0x3480(0x04)
	float Delay_AOSToADS; // 0xc84(0x04)
	bool bNeedToBeADS; // 0x22f0(0x01)
	struct FTimerHandle TimerHandle_ADSProcess; // 0x7d0(0x08)
	struct UCameraPostProcessPreset* PP_Preset_ADS; // 0x29d8(0x08)
	struct UCameraPostProcessPreset* PPInst_ADS; // 0x16b0(0x08)
	float ReplayInputForwardAxisValue; // 0x898(0x04)
	float ReplayInputRightAxisValue; // 0xf48(0x04)
	struct FVector2D CurrentInputAxis; // 0x2f48(0x08)
	struct FMulticastInlineDelegate Delegate_OnCameraViewModeChanged; // 0x5f8(0x10)
	struct UAkAudioEvent* ZoomInAudioEvent_Digital; // 0x2570(0x08)
	struct UAkAudioEvent* ZoomOutAudioEvent_Digital; // 0x2680(0x08)
	float ZoomAudioEventRepeatDelay; // 0x1aa0(0x04)
	float ZoomAudioEventLastPlayTime; // 0x2e30(0x04)
	struct FMulticastInlineDelegate OnPickableItemDetected; // 0x638(0x10)
	float OverHeadTraceDistance; // 0xc18(0x04)
	bool bShouldAdjustOverHead; // 0x3568(0x01)
	float UpdateAnimationDistance; // 0x1eb8(0x04)
	bool bIsDisarming; // 0x668(0x01)
	struct UAkAudioEvent* ResuscitationStopEvents; // 0x820(0x08)
	struct ABravoHotelCharacter* ResuscitatingCharacter; // 0xca0(0x08)
	float RequestResuscitationCoolTime; // 0x2670(0x04)
	struct FAnimSlot CurrentResuscitationAnimSlot; // 0xc38(0x10)
	struct FTimerHandle TimerHandle_SetIsFired; // 0xc58(0x08)
	float KillAssistValidTime; // 0x32b8(0x04)
	int32_t KillAssistMaxCount; // 0x37cc(0x04)
	float KnockOutAssistValidTime; // 0x3724(0x04)
	int32_t KnockOutAssistMaxCount; // 0x2cc4(0x04)
	struct TArray<struct FAssistInfo> AssistInfo; // 0x2938(0x10)
	float ThrowingWeaponFireDelay; // 0x1d60(0x04)
	float PreShootDeltaSecond; // 0x3554(0x04)
	bool bIsParachuteAvailable; // 0x2338(0x01)
	float ParachuteInputForward; // 0xad0(0x04)
	float ParachuteInputRight; // 0xf24(0x04)
	float ParachuteForwardMomentum; // 0x27c0(0x04)
	struct FRotator ParachuteLastRotator; // 0x3730(0x0c)
	float CurrentParachuteMaxMomentum; // 0x3a3c(0x04)
	float ParachuteMaxMomentum; // 0x9d4(0x04)
	float ParachuteMomentumAcc; // 0x22f8(0x04)
	float ParachuteMomentumDeacc; // 0x2718(0x04)
	float ParachuteMomentumZ; // 0x29c8(0x04)
	float DescentInputVectorAcc; // 0x109c(0x04)
	float ParachuteInputVectorAcc; // 0x2058(0x04)
	float ParachuteVelocityChangeFinalRate; // 0x3570(0x04)
	float ParachuteVelocityChangeZDecRate; // 0x17e8(0x04)
	float ParachuteLandingVelocityZ; // 0x14b0(0x04)
	float ParachuteLandingVelocityXY; // 0x137c(0x04)
	float ForwardMomentumRangeMin; // 0x3280(0x04)
	float ForwardMomentumRangeMax; // 0x39b8(0x04)
	float CurrentYawSpeed; // 0x1dd4(0x04)
	float CurrentRollSpeed; // 0x2ce8(0x04)
	float CurrentPitchSpeed; // 0x1f8c(0x04)
	float MinPitchInParachute; // 0x12c0(0x04)
	float MaxPitchInParachute; // 0xdf8(0x04)
	float GlidePitchInParachute; // 0x2558(0x04)
	float MinRollInParachute; // 0x1ef8(0x04)
	float MaxRollInParachute; // 0x3698(0x04)
	float MaxRollInParachuteVelocity; // 0x2078(0x04)
	float ParachuteTurnSpeedYaw; // 0x292c(0x04)
	float ParachuteTurnSpeedPitch; // 0x2d84(0x04)
	float ParachuteTurnSpeedRoll; // 0x818(0x04)
	float ParachuteTurnChangeSpeedYaw; // 0x1dd0(0x04)
	float ParachuteTurnChangeSpeedPitch; // 0x17c8(0x04)
	float ParachuteTurnChangeSpeedRoll; // 0x1d68(0x04)
	float HeightToGetInParachuteFromLand; // 0x34ec(0x04)
	float ForceHeightToGetInParachuteFromLand; // 0x12dc(0x04)
	struct FVector_NetQuantize ReplicatedParachuteVelocity; // 0x2fd8(0x0c)
	struct UCurveFloat* ParachutePitchCurve; // 0x12f8(0x08)
	struct TArray<struct TSoftObjectPtr<UMaterialInterface>> ParachuteSkinMaterials; // 0x1510(0x10)
	struct UMaterialInterface* CurrentParachuteSkin; // 0x7b8(0x08)
	bool bChangeNearClipPlane; // 0x2540(0x01)
	float DescentStartZPosition; // 0x3a38(0x04)
	float ParachuteAvailableFallingDistance; // 0x3084(0x04)
	float DescentZ; // 0x2b90(0x04)
	float SeaLevelZ; // 0x30b4(0x04)
	float SaveMaxWalkSpeed; // 0x2134(0x04)
	float SaveCameraBoomLocationZ; // 0x36b0(0x04)
	float PosToGetInParachute; // 0xe5c(0x04)
	struct UCameraPostProcessPreset* AccelerationPPClass; // 0x27c8(0x08)
	struct UCurveFloat* RadialOnDescentCurve; // 0x3520(0x08)
	float RadialRate; // 0x1568(0x04)
	float DescentBlurWidth; // 0x22f4(0x04)
	struct UCameraPostProcessPreset* AccelerationPPInst; // 0x2a08(0x08)
	float TargetSpringArmLengthDescent; // 0x1b18(0x04)
	float SpeedSpringArmLengthDesecnt; // 0x864(0x04)
	bool bDescentCameraShakeLoop; // 0x3558(0x01)
	float DescentCameraShakeDelay; // 0x1b08(0x04)
	struct UCameraShake* DescentCameraShake; // 0x14a8(0x08)
	struct UParticleSystem* CloudFxEmitterTemplate; // 0x26a0(0x08)
	struct UParticleSystemComponent* CloudFxInDescent; // 0x2920(0x08)
	float VelocityZ_LandStop; // 0x3488(0x04)
	float VelocityZ_Falling; // 0x1ffc(0x04)
	float PrevMeshRelativeZ; // 0x3214(0x04)
	float PronedEyeHeight; // 0x155c(0x04)
	bool bIsProneWeaponIdle; // 0x3028(0x01)
	bool bIsAutoSprint; // 0x2c78(0x01)
	float PronedDeltaHeightCamera3P; // 0xb70(0x04)
	float CrouchedDeltaHeightCamera3P; // 0x2ae4(0x04)
	float CrouchMovedDeltaHeightCamera3P; // 0x1b04(0x04)
	float StandDeltaHeightCamera3P; // 0x12a8(0x04)
	float StandSprintDeltaHeightCamera3P; // 0x2f10(0x04)
	struct FVector Camera1PInterpSrc; // 0x1b40(0x0c)
	struct FVector Camera3PInterpSrc; // 0x18fc(0x0c)
	struct FVector Camera3PInterpDst; // 0x194c(0x0c)
	float TargetArmLength; // 0x81c(0x04)
	float TargetArmLengthInterpSpeed; // 0x2d38(0x04)
	float TargetArmLengthInterpSpeed_AMP; // 0x23c8(0x04)
	float TargetArmLengthInterpSpeed_HeartBeatSensor; // 0x2664(0x04)
	float TargetFieldOfView; // 0x1948(0x04)
	struct FVector TargetSocketOffset; // 0xe9c(0x0c)
	float DefaultCameraLag; // 0x207c(0x04)
	float ReturnCameraLag; // 0x3ab0(0x04)
	struct FVector DefaultSocketOffset_VehicleAOS; // 0x330c(0x0c)
	struct FVector DefaultSocketOffset_LeftHipshot; // 0x2e5c(0x0c)
	struct FVector DefaultSocketOffset_Hipshot; // 0x34dc(0x0c)
	struct FVector DefaultSocketOffset_RightHipshot; // 0x1078(0x0c)
	struct FVector DefaultSocketOffset_LeftLeanAOS; // 0x3548(0x0c)
	struct FVector DefaultSocketOffset_RightLeanAOS; // 0x355c(0x0c)
	struct FVector DefaultSocketOffset_LeftAOS_Idle; // 0x33d4(0x0c)
	struct FVector DefaultSocketOffset_RightAOS_Idle; // 0x3670(0x0c)
	struct FVector DefaultSocketOffset_LeftAOS_Crouch; // 0x868(0x0c)
	struct FVector DefaultSocketOffset_RightAOS_Crouch; // 0x2b98(0x0c)
	struct FVector DefaultSocketOffset_LeftAOS_Prone; // 0x14f0(0x0c)
	struct FVector DefaultSocketOffset_RightAOS_Prone; // 0x1b88(0x0c)
	struct FVector DefaultTargetOffset_HipShot; // 0x1bec(0x0c)
	struct FVector DefaultTargetOffset_AOS_Stand_Idle; // 0xc00(0x0c)
	struct FVector DefaultTargetOffset_AOS_Stand_Lean; // 0x394c(0x0c)
	struct FVector DefaultTargetOffset_AOS_Crouch_Idle; // 0x2cc8(0x0c)
	struct FVector DefaultTargetOffset_AOS_Crouch_Lean; // 0x1500(0x0c)
	float DefaultTargetArmLength_Hipshot; // 0x131c(0x04)
	float DefaultTargetArmLength_AOS; // 0x37e0(0x04)
	float Camera3P_FOV_InterpSpeed; // 0x1de0(0x04)
	float Camera3P_AMP_FOV_InterpSpeed; // 0x2af0(0x04)
	float Camera3P_HeartBeatSensor_FOV_InterpSpeed; // 0xd18(0x04)
	float Camera3P_Lean_InterpSpeed; // 0x2660(0x04)
	struct AActor* DeathCamClass; // 0x1640(0x08)
	float DeathBeginTime; // 0x3500(0x04)
	struct USkeletalMesh* BodyBaseSkeletalMesh; // 0x678(0x08)
	bool bNeedToUpdatePreviewPawn; // 0x1bb4(0x01)
	struct UCustomizableObjectInstance* Mutable_MaleInstance; // 0xe90(0x08)
	struct UCustomizableObjectInstance* Mutable_FemaleInstance; // 0x14b8(0x08)
	struct ABravoHotelInventoryCharacter* InventoryCharacterClass; // 0x1d18(0x08)
	struct ABravoHotelInventoryCharacter* InventoryCharacter; // 0x2330(0x08)
	struct FMulticastInlineDelegate OnUpdateCastingDelegate; // 0x6c0(0x10)
	int32_t UsingBackpackItemIndex; // 0x27e8(0x04)
	float ItemInterruptInputSeconds; // 0x2d80(0x04)
	struct FTimerHandle CastingItemTimer; // 0x27f0(0x08)
	struct FTimerHandle CastingSupplyTimer; // 0x3748(0x08)
	struct FTimerHandle CastingItemMontageTimer; // 0x3260(0x08)
	struct FAnimSlot LastCastingItemAnimSlot_Stand; // 0x22c0(0x10)
	struct FAnimSlot LastCastingItemAnimSlot_Prone; // 0x32e0(0x10)
	struct TArray<struct UAkAudioEvent*> CastingStopEvents; // 0x3968(0x10)
	bool bIsCastingItem; // 0x205c(0x01)
	struct FCompletedCasting CompletedCastingInfo; // 0x2544(0x08)
	int32_t BasicSetting_gender; // 0x17b0(0x04)
	int32_t BasicSetting_face; // 0xda0(0x04)
	int32_t BasicSetting_face_color; // 0x19f0(0x04)
	int32_t BasicSetting_hair; // 0x1264(0x04)
	int32_t BasicSetting_hair_color; // 0x3370(0x04)
	int32_t BasicSetting_makeup; // 0x1f48(0x04)
	struct TArray<struct FInventoryItemInfo> BasicSettingItemInfos; // 0x31a0(0x10)
	struct FName CombineTargetRecipe; // 0x1298(0x08)
	struct TArray<struct FName> CombineTargetMaterials; // 0x808(0x10)
	struct UAkAudioEvent* CombineCompleteAudioEvent; // 0x1848(0x08)
	bool bEnabledFur; // 0x3029(0x01)
	struct FName WearableNameHasFur; // 0x7ec(0x08)
	float CooldownTimeForEnterVehicle; // 0x1270(0x04)
	float CoolDownTimeForUseLadder; // 0x17e0(0x04)
	struct TArray<struct ABravoHotelVehicle*> NearbyVehicles; // 0x1f90(0x10)
	struct FMulticastInlineDelegate Delegate_OnEnteredVehicle; // 0x6d0(0x10)
	float MaxVehicleEscapeSpeed; // 0x2e68(0x04)
	struct UBravoHotelVehicleSeatComponent* PreviousVehicleSeat; // 0x23e8(0x08)
	struct TArray<struct ABravoHotelProjectileGrenade*> ProjectileGrenades; // 0x2d40(0x10)
	struct FMulticastInlineDelegate OnChangeProjectilePredictPath; // 0xab0(0x10)
	bool IsBlind; // 0x9b8(0x01)
	struct FMulticastInlineDelegate OnAirCraftDelegate; // 0xe48(0x10)
	struct FMulticastInlineDelegate OnCharacterGroundStateChangeDelegate; // 0x1cb0(0x10)
	float FlashBangAngle; // 0x14c0(0x04)
	struct UCameraPostProcessPreset* PostProcessFlashBangClass; // 0x3528(0x08)
	struct UAkAudioEvent* GrenadeFlashBangStartEvent; // 0x32f0(0x08)
	struct UAkAudioEvent* GrenadeFlashBangEndEvent; // 0x2b48(0x08)
	struct UAkAudioEvent* GrenadeFragmentExplosionSineStopEvent; // 0x3760(0x08)
	struct UCameraPostProcessPreset* PostProcessBloodHitClass; // 0x2fd0(0x08)
	struct UCurveFloat* DamagedDissolveAnimationCurve; // 0x1178(0x08)
	struct UCameraPostProcessPreset* PostProcessBloodHit; // 0x1f50(0x08)
	float DamagedDissolveRateTime; // 0x2b94(0x04)
	float DamagedTermTime; // 0xf00(0x04)
	float DamagedDissolveAnimaitionMaxTime; // 0xcf0(0x04)
	float HitBlinkTime; // 0xec4(0x04)
	float InternalDamagedTermTime; // 0x27d0(0x04)
	float InternalHitBlinkTime; // 0xd00(0x04)
	float DamagedDissolveAnimationValue; // 0x1458(0x04)
	bool IsEndTermTime; // 0x1ec8(0x01)
	bool IsPlayingDamage; // 0x2400(0x01)
	bool IsHit; // 0x1520(0x01)
	bool IsDissolve; // 0x3790(0x01)
	bool DamageReset; // 0x1fc0(0x01)
	int32_t HitBlinkState; // 0x1598(0x04)
	int32_t CurrentDamageCount; // 0x2c7c(0x04)
	int32_t DissolveCount; // 0x30b8(0x04)
	struct UCameraPostProcessPreset* PostProcessOuterPlayZoneClass; // 0x1da0(0x08)
	float ShowTimePostProcessOuterPlayZone; // 0x3088(0x04)
	struct FTimerHandle TimerHandle_OuterPlayZone; // 0x2c68(0x08)
	struct UCameraPostProcessPreset* PostProcessBlueZoneHitClass; // 0x3298(0x08)
	struct FTimerHandle TimerHandle_BlueZone; // 0x1fa0(0x08)
	struct UCameraPostProcessPreset* PostProcessMagneticHitClass; // 0x1320(0x08)
	struct UCameraPostProcessPreset* PostProcessMagneticHit; // 0x1090(0x08)
	struct UCurveFloat* MagneticDamagedDissolveAnimationCurve; // 0x2e28(0x08)
	float MagneticDamagedTermTime; // 0x32a4(0x04)
	float MagneticDamagedDissolveAnimaitionMaxTime; // 0xbfc(0x04)
	float MagneticHitBlinkTime; // 0x29e8(0x04)
	float InternalMagneticDamagedTermTime; // 0x1060(0x04)
	float InternalMagneticHitBlinkTime; // 0x31b0(0x04)
	float MagneticDamagedDissolveAnimationValue; // 0x356c(0x04)
	float BluezoneMaterialOnTime; // 0x2850(0x04)
	bool IsMagneticEndTermTime; // 0x17e4(0x01)
	bool IsMagneticDamage; // 0x3518(0x01)
	bool IsMagneticHit; // 0x201c(0x01)
	bool IsMagneticDissolve; // 0x349c(0x01)
	bool MagneticDamageReset; // 0x2fb0(0x01)
	struct UCameraPostProcessPreset* PostProcessDustClass; // 0xf50(0x08)
	struct UCurveFloat* DustDissolveAnimationCurve; // 0x2550(0x08)
	struct UCameraPostProcessPreset* PostProcessDust; // 0x2298(0x08)
	float DustDissolveAnimaitionMaxTime; // 0x2bb0(0x04)
	float DustDissolveDelayTime; // 0x19b0(0x04)
	float InternalDustDissolveDelayTime; // 0x1f10(0x04)
	float DustDissolveAnimationValue; // 0x191c(0x04)
	bool IsOnDust; // 0x1e50(0x01)
	bool IsDustDissolve; // 0x1084(0x01)
	bool DustReset; // 0x2528(0x01)
	struct UCameraPostProcessPreset* PP_Preset_PickupOutline; // 0x29f0(0x08)
	struct UCameraPostProcessPreset* PP_PickupOutlineRef; // 0x2868(0x08)
	float CurrentOutlineThickness; // 0x228c(0x04)
	float MaxOutlineThickness; // 0x15ac(0x04)
	float OutlineThicknessInterpSpeed; // 0x2564(0x04)
	float CurrentCameraModifyerX; // 0x1ce4(0x04)
	float CurrentCameraModifyerY; // 0x91c(0x04)
	enum class EMouseSensitivityState CurrentEMouseSensitivityState; // 0x1a78(0x01)
	bool bPendingOpenDoor; // 0xb6c(0x01)
	struct ABravoHotelDoor* KickTargetDoor; // 0x3478(0x08)
	struct UParticleSystem* DoorBreachingParticle; // 0x2bb8(0x08)
	struct UParticleSystem* WindowBreachingParticle; // 0x3198(0x08)
	struct UAkAudioEvent* BreachingAudioEvent; // 0xf40(0x08)
	struct UAkAudioEvent* BreachingAudioEvent_Silence; // 0xf30(0x08)
	struct UBravoHotelAnimInstance* AnimInstance; // 0xc88(0x08)
	struct UBravoHotelAnimInstancePostprocess* PostprocessAnimInstance; // 0x1d90(0x08)
	struct UBravoHotelAnimInstanceFPP* AnimInstance_FPP; // 0x2060(0x08)
	struct ABravoHotelGameState* BravoHotelGameState; // 0x23b8(0x08)
	struct ABravoHotelPlayerController* BravoHotelPlayerController; // 0x37a8(0x08)
	int32_t IdleNum; // 0xf90(0x04)
	float IdleWaitingTime; // 0x1bb0(0x04)
	struct FName LevelUpEffectBuffName; // 0x1970(0x08)
	struct TArray<struct FName> DefaultBuffName; // 0xdc0(0x10)
	struct TArray<struct FPerkInfo> DefaultPerkInfo; // 0x1fe8(0x10)
	struct TArray<struct FString> UberUser; // 0xf70(0x10)
	struct TArray<struct FPerkInfo> CurrentPerkInfos; // 0x1c90(0x10)
	struct FPerkInfo UltimatePerkInfo; // 0x1bc0(0x28)
	struct TArray<struct FPerkUIInfo> PerkUIInfos; // 0x3360(0x10)
	struct FPerkUIInfo UltimateUIInfo; // 0xd48(0x2c)
	struct TArray<struct FPerkDeckElement> CurrentPerkCards; // 0x1ed0(0x10)
	struct TArray<struct FMutableData> MutableBuffList; // 0x1278(0x10)
	enum class EBuffEventType CurrentSkillType; // 0x2411(0x01)
	struct FMulticastInlineDelegate OnChangeFireType; // 0xc20(0x10)
	int32_t CurrentReadyToSnipeGrade; // 0x2598(0x04)
	struct FMulticastInlineDelegate Delegate_OnEndSearchInstinct; // 0x37f0(0x10)
	struct TArray<struct AActor*> UsedTrapList; // 0x1650(0x10)
	enum class EPerkLevelUpType PerkLevelUpType; // 0x15d8(0x01)
	int32_t ActiveSkillInitIndex; // 0xc64(0x04)
	int32_t ActiveSkillCount; // 0xe58(0x04)
	struct FDisplayAbility CurrentDisplayAbility; // 0x32f8(0x0c)
	struct TArray<struct UObject*> LoadedClasses; // 0x2d50(0x10)
	int32_t PerkDeckChangingCount; // 0x17fc(0x04)
	struct FMulticastInlineDelegate OnMovementInputPressedDelegate; // 0x718(0x10)
	char bIsMoving : 1; // 0x36a0(0x01)
	char bForceMoving : 1; // 0x3184(0x01)
	struct UBravoHotelDamageType* LastDamagedType; // 0x12a0(0x08)
	float LastDamagedAmount; // 0x1088(0x04)
	struct UBravoHotelDamageType* LastHitType; // 0x3470(0x08)
	struct FBravoHotelTakeDamageInfo LastSimulatedTakeDamageInfo; // 0xa20(0x48)
	struct FHitResult DebuffHitResult; // 0x2d98(0x88)
	struct UBravoHotelDamageType* DebuffHitDamageType; // 0x1df8(0x08)
	struct TArray<struct FAnimSlot> TakeDamageMontageList; // 0x830(0x10)
	struct UParticleSystem* BloodSplatterEffect; // 0x1f58(0x08)
	struct UParticleSystem* PunchEffect; // 0x2a48(0x08)
	struct UParticleSystem* ThrowingWeaponDirectHitEffect; // 0x29d0(0x08)
	float BloodEffectNearbyDist; // 0x3620(0x04)
	struct FBravoHotelDefaultItemSetting DefaultItemSetting; // 0x3420(0x38)
	struct FBravoHotelDefaultWearableSetting DefaultWearableSetting; // 0x2808(0x18)
	struct TArray<struct FBravoHotelItemPresetForBlackMarket> BlackMarketItemPresetList; // 0x3750(0x10)
	struct FMulticastInlineDelegate OnCanProneFailedDelegate; // 0x730(0x10)
	float MinDamageableFallingSpeed; // 0x1f74(0x04)
	float MaxDamageableFallingSpeed; // 0x19f4(0x04)
	float MinDamageableFallingSpeedFromVehicle; // 0x25cc(0x04)
	float MaxDamageableFallingSpeedFromVehicle; // 0x367c(0x04)
	enum class ELandingReason LandingReason; // 0x1660(0x01)
	struct FMulticastInlineDelegate Delegate_OnExitFallingState; // 0x850(0x10)
	struct TArray<struct TWeakObjectPtr<struct UBravoHotelPhysicalMaterial>> OverlappedPhysicMaterials; // 0x878(0x10)
	float BushSoundSpawnDelay; // 0x15b0(0x04)
	float BushLandingDamageMultiplier; // 0x21a4(0x04)
	struct TSet<struct UPrimitiveComponent*> OverlappedCantProneComponent; // 0x2418(0x50)
	bool bIsInsideBlueZone; // 0x1e00(0x01)
	bool bIsSpectated; // 0x145c(0x01)
	struct TMap<struct FName, struct FVector> Camera3P_DeltaTargetOffsets; // 0x18a8(0x50)
	bool bReplaceFreeLook; // 0x1378(0x01)
	bool bUpdateDeathRotation; // 0x8a8(0x01)
	struct FVector RagdollLocation; // 0x1310(0x0c)
	struct FVector RagdollVelocity; // 0x33c8(0x0c)
	struct UDamageType* LastDamageType; // 0x37e8(0x08)
	float Ragdoll_ZOffset; // 0x2fa8(0x04)
	bool bApplyRagdollForce; // 0x2ca0(0x01)
	struct UBravoHotelCharacterMovementComponent* BravoHotelCharacterMovement; // 0x760(0x08)
	enum class EMovementMode PrevMovementMode; // 0x2c64(0x01)
	enum class EMovementMode NewMovementMode; // 0x1b94(0x01)
	enum class ECustomMovementMode PrevCustomMovementMode; // 0x2a38(0x01)
	enum class ECustomMovementMode NewCustomMovementMode; // 0xbd8(0x01)
	struct FVector MovementInputVector; // 0xb04(0x0c)
	struct FTimerHandle TimerHandle_HideParachute; // 0x768(0x08)
	struct FTimeline Timeline_TunnelEffect; // 0x2490(0x98)
	struct TMap<enum class EWeaponAttachmentItem, struct UCurveFloat*> Curve_TunnelEffect; // 0x2c08(0x50)
	struct FTimeline Timeline_CameraInterp; // 0x11a8(0x98)
	struct UCurveFloat* Curve_CameraInterp; // 0x1590(0x08)
	struct UCurveFloat* Curve_AdsCameraInterp; // 0x34b8(0x08)
	float MinTimeJumpingBeforeLand; // 0x844(0x04)
	float DescentXYAcc; // 0x2240(0x04)
	float DescentAirControl; // 0x1850(0x04)
	float DescentSpeed; // 0x3690(0x04)
	float DescentGravityScale; // 0xbd0(0x04)
	float DescentDeacceleration; // 0x3948(0x04)
	float DescentMaxAcceleration; // 0xb00(0x04)
	struct FVector DescentCameraLocation; // 0x2614(0x0c)
	float ParachuteAirControl; // 0x15b8(0x04)
	float ParachuteSpeed; // 0x14b4(0x04)
	float ParachuteGravity; // 0x14d8(0x04)
	float ParachuteDeacceleration; // 0x156c(0x04)
	float ParachuteMaxAcceleration; // 0x26c8(0x04)
	struct FVector ParachuteCameraLocation; // 0x2268(0x0c)
	float ParachuteSocketOffsetY; // 0xd34(0x04)
	float ParachuteSocketDeltaOffsetZ; // 0xcdc(0x04)
	float ParachuteReadyToLandHeight; // 0x848(0x04)
	float ParachuteQuickLandingStartHeight; // 0x2030(0x04)
	float ParachuteQuickLandingStartRadius; // 0x1e0c(0x04)
	float ParachuteQuickLandingVelocityModifierXY; // 0x2f50(0x04)
	float ParachuteQuickLandingVelocityModifierZ; // 0x351c(0x04)
	float ParachuteQuickLandingDMGRate; // 0x1870(0x04)
	bool bCanQuickLanding; // 0x918(0x01)
	struct FVector LastQuickLandingAllowedLocation; // 0x3108(0x0c)
	struct FVector ParachuteTargetCameraLocation; // 0xd20(0x0c)
	float ParachuteTargetCameraSpeed; // 0xdfc(0x04)
	float ParachuteTargetArmLengthSpeedStart; // 0x159c(0x04)
	float ParachuteTargetArmLengthSpeedEnd; // 0x20a8(0x04)
	struct UCameraShake* ParachuteUnfoldCameraShake; // 0x2b30(0x08)
	struct UAkAudioEvent* BreathStartEvent; // 0x2038(0x08)
	struct UAkAudioEvent* BreathEndEvent; // 0xbf0(0x08)
	struct UAkAudioEvent* BreathStopEvent; // 0x1f80(0x08)
	struct FVector2D SprintingBeginRange; // 0x1ba8(0x08)
	struct FVector2D SprintingRange; // 0x8cc(0x08)
	float ReduceCharacterSpeedTime; // 0x2390(0x04)
	float InternalReduceCharacterSpeedTime; // 0x1fe0(0x04)
	bool IsInReduceSpeedExplosionRange; // 0x3400(0x01)
	struct UDataTable* PostProcessEffectsTable; // 0x3628(0x08)
	struct TMap<struct FName, struct FBravoHotelPostProcessSettings> PostProcessAssignedList; // 0x3118(0x50)
	struct TArray<struct UCameraPostProcessPreset*> PostProcessBuffList; // 0x19a0(0x10)
	struct UDataTable* RenderSettingsTable; // 0x2668(0x08)
	bool bUpdateRenderSettings; // 0x1980(0x01)
	int32_t CurrentTerrainType; // 0x3a10(0x04)
	struct FVector AttachInAircraftOffset; // 0xc0c(0x0c)
	struct FRotator AttachInAircraftRotationOffset; // 0x1338(0x0c)
	struct FVector AttachInAircraftCameraLocaiton; // 0x1fa8(0x0c)
	float InitSpringArmLengthInAircraft; // 0xaa0(0x04)
	float TargetSpringArmLengthInAircraft; // 0x3a24(0x04)
	float SpeedSpringArmLengthInAirCraft; // 0x2aec(0x04)
	float PrevBloomIntensity; // 0x9d0(0x04)
	float PrevBloomThreshold; // 0x2f08(0x04)
	float TargetBloomIntensityInAirCraft; // 0x373c(0x04)
	float SpeedBloomIntensityInAirCraft; // 0x1638(0x04)
	float BloomStartDelayTimeInAirCraft; // 0x23c4(0x04)
	float CineDurationTimeMax; // 0x1438(0x04)
	float CineTextAnimationAppearTime; // 0x32d0(0x04)
	float GetPerkOnStartTime; // 0x1ecc(0x04)
	struct UBravoHotelCameraComponent* FPSK_Camera; // 0x19f8(0x08)
	struct USceneComponent* ADSCameraScene; // 0x3a28(0x08)
	struct UCustomizableSkeletalComponent* FPSK_MutableArms; // 0x2ab8(0x08)
	struct USkeletalMeshComponent* FPSK_Arms; // 0x1418(0x08)
	struct FVector FPSK_CameraHeight; // 0x1a00(0x0c)
	float FPSK_CameraProbe; // 0x1bb8(0x04)
	float FPSK_CameraPitchDeltaX; // 0x860(0x04)
	struct FVector FPSK_CameraLocation_Idle; // 0x22d8(0x0c)
	struct FName FPSK_CameraBone_Idle; // 0x2674(0x08)
	struct FVector FPSK_CameraLocation_ADS; // 0x1350(0x0c)
	struct FVector FPSK_CameraLocation_Parkour; // 0x26a8(0x0c)
	struct FName FPSK_CameraBone_Parkour; // 0x1530(0x08)
	float FPSK_CameraHeight_Stand; // 0x2a34(0x04)
	float FPSK_CameraHeight_Crouch; // 0x9cc(0x04)
	float FPSK_CameraHeight_Prone; // 0x1f30(0x04)
	struct FVector FPSK_CameraLocation_Collide; // 0x26b4(0x0c)
	struct FVector FPSK_CameraLocation_LeftLeanDelta; // 0x1880(0x0c)
	struct FVector FPSK_CameraLocation_RightLeanDelta; // 0x39e0(0x0c)
	float FPSK_CameraLocation_CollideAlpha; // 0x3504(0x04)
	struct FVector FPSK_StartCameraHeight; // 0x200c(0x0c)
	struct FVector FPSK_DestCameraHeight; // 0x1574(0x0c)
	struct USkeletalMeshComponent* FPSK_WeaponShadow; // 0x1348(0x08)
	struct UStaticMeshComponent* FPSK_SightShadow; // 0x1d88(0x08)
	struct UStaticMeshComponent* FPSK_GripShadow; // 0x20b0(0x08)
	struct UStaticMeshComponent* FPSK_MagazineShadow; // 0x3288(0x08)
	struct UStaticMeshComponent* FPSK_StockShadow; // 0x3068(0x08)
	struct UStaticMeshComponent* FPSK_TacticalAttachmentShadow; // 0xd10(0x08)
	struct USkeletalMeshComponent* FPSK_BarrelShadow; // 0x37d8(0x08)
	struct USkeletalMeshComponent* FPSK_MuzzleShadow; // 0x30f0(0x08)
	struct TArray<struct UMeshComponent*> FPSK_WeaponAttachments; // 0x2e48(0x10)
	bool bFPSK_UseCustomCurve; // 0x37a0(0x01)
	bool bFPSK_IsDefaultTransformUpdated; // 0x2ca2(0x01)
	bool bFPSK_IsFPSMode; // 0xc68(0x01)
	struct FTransform FPSK_CurrentWeaponTransform; // 0x15e0(0x30)
	struct FTransform FPSK_IdleWeaponTransform; // 0x3980(0x30)
	struct FTransform FPSK_CollideWeaponTransform; // 0xed0(0x30)
	struct FTransform FPSK_ADS_DefaultWeaponTransform; // 0x3330(0x30)
	struct FTransform FPSK_ADS_TargetWeaponTransform; // 0x2770(0x30)
	struct FTransform FPSK_ADS_DefaultWeaponTransform_BasicSightCache; // 0x2ff0(0x30)
	struct FTransform FPSK_ADS_DefaultWeaponTransform_CurrentSightCache; // 0x16c0(0x30)
	struct FTransform FPSK_ADS_WeaponTransform; // 0x2210(0x30)
	float FPSK_ADSFOV; // 0x3408(0x04)
	float FPSK_AOSFOV; // 0x1664(0x04)
	float FPSK_DefaultFOV; // 0x14fc(0x04)
	float FPSK_CurrentMagnificationFactor; // 0xbc0(0x04)
	float FPSK_TargetMagnificationFactor; // 0x12d8(0x04)
	struct UMaterialParameterCollection* MPC_WeaponFov; // 0x1878(0x08)
	struct FVector FPSK_CurrentCameraRelativeLocation; // 0x15a0(0x0c)
	float FPSK_ADSAlpha; // 0x27c4(0x04)
	float FPSK_StartFOV_Delta; // 0x267c(0x04)
	float CameraInterpPlayRate; // 0xf4c(0x04)
	float AdsCameraInterpPlayRate; // 0x3828(0x04)
	float FPSK_TargetADSAlpha; // 0x1978(0x04)
	struct FTimeline FPSK_Timeline_Sway_Idle; // 0x1718(0x98)
	struct FTimeline FPSK_Timeline_Sway_Move; // 0x3588(0x98)
	struct UCurveVector* FPSK_Curve_Sway_Idle_Default; // 0x34a8(0x08)
	struct UCurveVector* FPSK_Curve_Sway_Move_Default; // 0x2280(0x08)
	struct UCurveFloat* FPSK_Curve_Sway_Scale_With_Fov; // 0x30e0(0x08)
	struct UCurveVector* FPSK_Curve_Sway_Idle; // 0x2b78(0x08)
	struct UCurveVector* FPSK_Curve_Sway_Move; // 0xe60(0x08)
	bool bUseFPSK_Sway; // 0x1f2c(0x01)
	float FPSK_SwayAlpha; // 0x3a44(0x04)
	float FPSK_SwayAlphaMin; // 0x2488(0x04)
	float FPSK_SwayAlphaMax; // 0x369c(0x04)
	float FPSK_SwayScale; // 0x2290(0x04)
	struct FRotator FPSK_SwayRotationIdle; // 0x33f0(0x0c)
	struct FRotator FPSK_SwayRotationMove; // 0x22e4(0x0c)
	struct FRotator FPSK_SwayRotationDeltaForSteadyAim; // 0x2620(0x0c)
	float FPSK_SwayInterpSpeed; // 0x3778(0x04)
	struct FRotator FPSK_LeanRotation; // 0x25a8(0x0c)
	struct FVector FPSK_LeanLocation; // 0xf18(0x0c)
	struct FTransform FPSK_CurrentCollideWeaponTransform; // 0x1e80(0x30)
	float FPSK_CollideAlpha; // 0x2bc0(0x04)
	float FPSK_CollideAngle; // 0xd7c(0x04)
	float FPSK_CollideAngle_LocalCache; // 0xd30(0x04)
	bool bFPSK_IsCollide; // 0x145d(0x01)
	struct TMap<enum class EWeaponAttachmentItem, struct UCurveFloat*> FPSK_Curves_TunnelEffect; // 0x21b0(0x50)
	float FPSK_TargetFOV; // 0x3a6c(0x04)
	struct FTimerHandle TimerHandle_NoCarLandingDamageToTeam; // 0x1818(0x08)
	float InAircraftNearClipPlane; // 0x16a0(0x04)
	struct TArray<struct ABravoHotelCharacter*> AIBot_SearchedEnemyList; // 0xae8(0x10)
	bool bEnableCustomDepth; // 0x256c(0x01)
	struct FTimerHandle TimerHandle_HurtCondition; // 0x2b50(0x08)
	float ProneDamageScaleInRedZone; // 0xfc8(0x04)
	struct UAkAudioEvent* BlueZoneFreezeEvent; // 0x23d8(0x08)
	struct UAkAudioEvent* BlueZoneFreezeStopEvent; // 0xf10(0x08)
	struct UAkAudioEvent* BlueZoneDroneEvent; // 0x2278(0x08)
	struct UAkAudioEvent* BlueZoneDroneStopEvent; // 0x1dd8(0x08)
	struct UAkAudioEvent* SupplyBoxNotifyAlertMe; // 0x32d8(0x08)
	struct UAkAudioEvent* SupplyBoxNotifyAlertOther; // 0x2480(0x08)
	float CheckFreezeDistance; // 0x890(0x04)
	float CheckDroneDistance; // 0xbd4(0x04)
	struct FVector DefaultSocketOffset_LeftLeanAMP; // 0xfa4(0x0c)
	struct FVector DefaultSocketOffset_RightLeanAMP; // 0x3250(0x0c)
	struct FVector DefaultSocketOffset_RightAMP; // 0xbe0(0x0c)
	struct FVector DefaultSocketOffset_LeftAMP; // 0x978(0x0c)
	float DefaultTargetArmLength_AMP; // 0x3308(0x04)
	float AmplifierFocusDistance; // 0x31b4(0x04)
	struct FVector DefaultSocketOffset_LeftLeanHeartBeatSensor; // 0x34d0(0x0c)
	struct FVector DefaultSocketOffset_RightLeanHeartBeatSensor; // 0x287c(0x0c)
	struct FVector DefaultSocketOffset_RightHeartBeatSensor; // 0x1158(0x0c)
	struct FVector DefaultSocketOffset_LeftHeartBeatSensor; // 0xb20(0x0c)
	float DefaultTargetArmLength_HeartBeatSensor; // 0x30c0(0x04)
	float HeartBeatSensorFocusDistance; // 0x1be8(0x04)
	float CameraFocusDistanceAOS; // 0xc30(0x04)
	float AirWalkStartTime; // 0x1628(0x04)
	struct FTimerHandle TimerHandle_StopAirWalk; // 0x12b0(0x08)
	float AirWalkBestRecord; // 0xc80(0x04)
	float AirWalkTotalRecord; // 0x2888(0x04)
	struct UAkAudioEvent* AirWalkAudioEvent; // 0x1b38(0x08)
	float CurrentAirWalkVelocityZ; // 0x1624(0x04)
	float AirWalkDuration; // 0x2714(0x04)
	float AirWalkGravity; // 0x1da8(0x04)
	struct UBHPersonalSupplySystemComponent* PersonalSupplySystemComponent; // 0x1b70(0x08)
	enum class ENetworkSmoothingMode PrevNetworkSmoothingMode; // 0x920(0x01)
	struct FTimerHandle TimeHandle_SkyDive; // 0x788(0x08)
	bool bActiveCriticalTime; // 0x2394(0x01)
	float CriticalTimeTickInterval; // 0x26cc(0x04)
	float CriticalTimeLimitTime; // 0x2610(0x04)
	struct FVector CriticalTimeMeshLocaiton; // 0x2c58(0x0c)
	struct TMap<struct UActorComponent*, float> CriticalTimeComponentTickIntervals; // 0x2948(0x50)
	float ParachuteEnableHieght; // 0x3740(0x04)
	struct ABravoHotelParachuteTriggerBox* ParachuteTriggerBox; // 0x7b0(0x08)
	struct FHitResult CurHit; // 0x1380(0x88)
	struct UCurveFloat* Curve_Sliding; // 0xe08(0x08)
	struct UParticleSystem* ParticleSystem_Sliding; // 0x17d0(0x08)
	struct UParticleSystemComponent* ParticleSystemComponent_Sliding; // 0x1360(0x08)
	float SlidingStartTime; // 0x1424(0x04)
	enum class ECharacterGroundState GroundStateBeforeSliding; // 0x1efc(0x01)
	struct TMap<int16_t, int32_t> ReplicateIndexPerkMap; // 0x31b8(0x50)
	int16_t SlidingBuffIndex; // 0x29fa(0x02)
	bool bPendingStopSliding; // 0xd1c(0x01)
	float RollingStartTime; // 0x2f54(0x04)
	struct UCameraPostProcessPreset* PostProcessWetFogClass; // 0x25a0(0x08)
	struct TArray<struct ABravoHotelAreaSkillZone*> ActiveWetFogAreas; // 0x908(0x10)
	struct FAreaSkillZoneInfo WetFogInfo; // 0x1138(0x20)
	struct FWetFogZoneInfo WetFogZoneInfo; // 0x2f58(0x0c)
	struct FTimerHandle TimerHandle_WetFog; // 0x12b8(0x08)
	struct UCameraPostProcessPreset* PostProcessBlackOutClass; // 0x39d8(0x08)
	struct TArray<struct ABravoHotelAreaSkillZone*> ActivePowerInterruptions; // 0x2f78(0x10)
	struct FAreaSkillZoneInfo BlackOutInfo; // 0x1488(0x20)
	struct FTimerHandle TimerHandle_BlackOut; // 0x1ec0(0x08)
	struct UAkAudioEvent* StartBlackOutAudioEvent; // 0x1288(0x08)
	struct UParticleSystem* StartBlackOutParticle; // 0x1b20(0x08)
	struct UParticleSystemComponent* StartBlackOutParticleComponent; // 0x3788(0x08)
	struct FMulticastInlineDelegate OnSpawnBlackOutDelegate; // 0x1aa8(0x10)
	struct UCameraPostProcessPreset* PostProcessForceFieldClass; // 0xd08(0x08)
	struct TArray<struct ABravoHotelAreaSkillZone*> ActiveForceFields; // 0x1b98(0x10)
	struct FAreaSkillZoneInfo ForceFieldInfo; // 0x988(0x20)
	struct FTimerHandle TimerHandle_ForceField; // 0x10a0(0x08)
	struct ABravoHotelSuperBarrier* SuperBarrierClass; // 0x2f40(0x08)
	bool UsingSimulationBox; // 0x1dcc(0x01)
	bool HiddenSimulationBox; // 0x1a61(0x01)
	float SimulationBoxHeight; // 0x2fac(0x04)
	struct TSoftClassPtr<UObject> SimulationBoxClass; // 0x2638(0x28)
	struct FMulticastInlineDelegate OnCompleteActiveSkillDelegate; // 0xa00(0x10)
	struct ABravoHotelSkillTargetingBase* BombingTargetActor; // 0x1af8(0x08)
	struct UAkAudioEvent* StartBomingEvent; // 0x1528(0x08)
	bool IsBombing; // 0x1714(0x01)
	struct FBombingInfo BombingInfo; // 0x3218(0x24)
	float AutoAimRadius; // 0xec0(0x04)
	float AutoAimDistance; // 0x3a20(0x04)
	bool bShowAutoAimDebug; // 0x21a8(0x01)
	struct UParticleSystem* TeleportFxTemplate; // 0xaa8(0x08)
	struct UParticleSystem* TeleportTraceFxTemplate; // 0x39b0(0x08)
	float TeleportDisappearTime; // 0x33fc(0x04)
	float TeleportAppearTime; // 0x2928(0x04)
	float RocketJumpGravity; // 0x2018(0x04)
	struct UAkAudioEvent* RocketJumpAudioEvent; // 0x2d60(0x08)
	struct UAkAudioEvent* RocketJumpLandedAudioEvent; // 0x1428(0x08)
	struct UParticleSystem* ParticleSystem_RocketJump; // 0xe10(0x08)
	struct UParticleSystem* ParticleSystem_RocketJumpTrail; // 0x1648(0x08)
	struct UParticleSystem* ParticleSystem_RocketJumpLanded; // 0x2b28(0x08)
	struct UParticleSystemComponent* RocketJumpTrailEffect; // 0x1df0(0x08)
	bool bFinishMeteorJump; // 0x1ee8(0x01)
	float MeteorJumpGravity; // 0x318c(0x04)
	bool bMeteorStrikeBlockingHit; // 0x1e68(0x01)
	struct TArray<struct ABravoHotelProjectileGrenade*> MeteorGrenadeProjectileClass; // 0x2470(0x10)
	struct UAkAudioEvent* MeteorJumpAudioEvent; // 0xeb0(0x08)
	struct UAkAudioEvent* MeteorJumpLandedAudioEvent; // 0x3aa8(0x08)
	struct UParticleSystem* ParticleSystem_MeteorJump; // 0xb88(0x08)
	struct UParticleSystem* ParticleSystem_MeteorJumpTrail; // 0x28c8(0x08)
	struct UParticleSystem* ParticleSystem_MeteorJumpLanded; // 0xf08(0x08)
	struct UParticleSystemComponent* MeteorJumpTrailEffect; // 0x1e38(0x08)
	struct AActor* MeteorTarget; // 0x2f00(0x08)
	struct TArray<struct ABravoHotelProjectileGrenadeFlashbang*> ThrownFlashbangs; // 0x10a8(0x10)
	struct TArray<struct ABravoHotelProjectileGrenadeMolotovCocktail*> ThrownMolotovCocktails; // 0x3a00(0x10)
	struct TArray<struct ABravoHotelProjectileGrenadeC4*> ThrownC4s; // 0x33a0(0x10)
	bool bIsUltimateSprint; // 0x3938(0x01)
	bool IgnoreInteraction; // 0x2ca1(0x01)
	struct FMulticastInlineDelegate OnChangeCharacterStateDelegate; // 0x2248(0x10)
	int32_t LogSize; // 0x2468(0x04)
	struct FTimerHandle TimeHandle_RequestBuildingInfo; // 0x22b8(0x08)
	float LogIntervalTime; // 0x1244(0x04)
	int32_t LogRequestSize; // 0x1f78(0x04)
	struct TArray<struct FString> LogList; // 0x39c8(0x10)
	struct TArray<struct FString> LogJsonList; // 0x1fc8(0x10)
	struct UParticleSystem* GodEffect1; // 0x2f38(0x08)
	struct UParticleSystem* GodEffect2; // 0x3020(0x08)
	struct UParticleSystem* ParticleSystem_Knockout; // 0x1868(0x08)
	struct FRepSimulatedHittedDamage RepSimulatedHittedDamage; // 0x12c8(0x10)
	float FirstTimeHittedDamage; // 0x2a00(0x04)
	float LastTimeHittedDamage; // 0xb80(0x04)
	struct UParticleSystemComponent* GodParticle; // 0x1440(0x08)
	bool NeedFindPersonalSupplyBoxLocation; // 0x3768(0x01)
	int32_t PersonalSupplyBoxRePositionCount; // 0x3468(0x04)
	bool UsingPersonalSupplyBoxWeightMap; // 0x23e0(0x01)
	bool UsingPersonalSupplyBoxRePosition; // 0x2e34(0x01)
	float PersonalSupplyBoxRePositionDistance; // 0xe00(0x04)
	struct FTimerHandle TimeHandle_Ultimate_Recon; // 0xf28(0x08)
	struct FAnimSlot AnimSlot_Ultimate_Recon; // 0x30f8(0x10)
	bool bIsUltimate_Recon; // 0x154c(0x01)
	struct UAnimMontage* AvoidHeadShotMontage; // 0x2a10(0x08)
	struct UAkAudioEvent* SteelHelmetSound; // 0x2820(0x08)
	struct FVector StuntmanRollingDir; // 0x3390(0x0c)
	float StuntmanStartTime; // 0xc60(0x04)
	struct FTimerHandle TimerHandle_Stuntman; // 0x2720(0x08)
	bool bNeedToUpdateNitroBoost; // 0x1715(0x01)
	float NitroBoostTorqueScale; // 0x3530(0x04)
	struct ABravoHotelVehicle* NitroBoomTargetVehicle; // 0x1268(0x08)
	bool bNeedToUpdateNitroBoom; // 0x3a14(0x01)
	float NitroBoomDuration; // 0x12ec(0x04)
	bool bNeedToDrawNitroBoomTarget; // 0x3a30(0x01)
	struct FVector NitroBoomTargetLocation; // 0x2cb8(0x0c)
	float NitroBoomLastVehicleSetTime; // 0x2568(0x04)
	bool bNeedToUpdateUltimate_Driver; // 0x2ca3(0x01)
	bool bNeedToCheckPlosiveSoundDetection; // 0x3290(0x01)
	struct ABravoHotelMoveElevator* EnteredElevatorRef; // 0x2918(0x08)
	float OuterDamage; // 0x790(0x04)
	struct FTimerHandle TimerHandle_InOuterArea; // 0x798(0x08)
	struct FTimerHandle TimerHandle_UpdateInOuterArea; // 0x7a0(0x08)
	struct FMulticastInlineDelegate DelegateCheckSupplyCost; // 0x2ad0(0x10)
	struct FSecuredVariablesCache SecuredCache; // 0x2cd4(0x04)
	struct UCurveFloat* DamageCorrectValueByPenetrationDepthCurve; // 0x2e38(0x08)
	struct ABravoHotelAircraftFlight* AircraftFlightRef; // 0x3808(0x08)

	void WearItem(enum class EWearableItemType Slot, struct FString UniqueKey, bool bUpdateSkeletalMesh); // Function BravoHotelGame.BravoHotelCharacter.WearItem // (Final|Native|Public|BlueprintCallable) // @ game+0x1eceb80
	bool WasMeshRecentlyRenderedOnScreen(float Tolerance); // Function BravoHotelGame.BravoHotelCharacter.WasMeshRecentlyRenderedOnScreen // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eceaf0
	bool WantToFPSMode(); // Function BravoHotelGame.BravoHotelCharacter.WantToFPSMode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ecea60
	bool WantsToRocketJump(); // Function BravoHotelGame.BravoHotelCharacter.WantsToRocketJump // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eceac0
	bool WantsToMeteorJump(); // Function BravoHotelGame.BravoHotelCharacter.WantsToMeteorJump // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ecea90
	bool ValidateEquippedWeaponsInVehicle(int32_t WeaponIndex); // Function BravoHotelGame.BravoHotelCharacter.ValidateEquippedWeaponsInVehicle // (Final|Native|Public|BlueprintCallable) // @ game+0x1ece9d0
	void ValidateCameraInterp(); // Function BravoHotelGame.BravoHotelCharacter.ValidateCameraInterp // (Final|Native|Public) // @ game+0x1ece9b0
	void UpdateWetFogPP(bool bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdateWetFogPP // (Final|Native|Public) // @ game+0x1ece920
	void UpdateWalking_Prone(); // Function BravoHotelGame.BravoHotelCharacter.UpdateWalking_Prone // (Final|Native|Public) // @ game+0x1ece900
	void UpdateWalking(); // Function BravoHotelGame.BravoHotelCharacter.UpdateWalking // (Final|Native|Public) // @ game+0x1ece8e0
	void UpdateUltimate_Recon(); // Function BravoHotelGame.BravoHotelCharacter.UpdateUltimate_Recon // (Final|Native|Public) // @ game+0x1ece8c0
	void UpdateTunnelEffect(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdateTunnelEffect // (Final|Native|Public) // @ game+0x1ece840
	void UpdateTimeline(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateTimeline // (Final|Native|Public) // @ game+0x1ece7c0
	void UpdateTerrainType(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateTerrainType // (Final|Native|Public) // @ game+0x1ece740
	void UpdateTargetHealth(enum class ETargetHealthType Type, float InTargetHealth); // Function BravoHotelGame.BravoHotelCharacter.UpdateTargetHealth // (Final|Native|Public|BlueprintCallable) // @ game+0x1ece680
	void UpdateSurfaceType(); // Function BravoHotelGame.BravoHotelCharacter.UpdateSurfaceType // (Final|Native|Public) // @ game+0x1ece660
	void UpdateStatupMaterialEffect(); // Function BravoHotelGame.BravoHotelCharacter.UpdateStatupMaterialEffect // (Final|Native|Protected) // @ game+0x1ece640
	void UpdateSliding(); // Function BravoHotelGame.BravoHotelCharacter.UpdateSliding // (Final|Native|Public) // @ game+0x1ece620
	void UpdateRolling(); // Function BravoHotelGame.BravoHotelCharacter.UpdateRolling // (Final|Native|Public) // @ game+0x1ece600
	void UpdateReplaceFreeLook(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateReplaceFreeLook // (Final|Native|Public) // @ game+0x1ece580
	void UpdateRenderSettings(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateRenderSettings // (Final|Native|Public) // @ game+0x1ece500
	void UpdatePowerInterruptionPP(bool bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdatePowerInterruptionPP // (Final|Native|Public) // @ game+0x1ece470
	void UpdatePostProcess_Indoor(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdatePostProcess_Indoor // (Final|Native|Public) // @ game+0x1ece3f0
	void UpdatePostProcess_FPP(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdatePostProcess_FPP // (Final|Native|Public) // @ game+0x1ece370
	void UpdatePostProcess_CameraMonoChrome(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdatePostProcess_CameraMonoChrome // (Final|Native|Public) // @ game+0x1ece2f0
	void UpdatePostProcess_ADS(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdatePostProcess_ADS // (Final|Native|Public) // @ game+0x1ece270
	void UpdatePostProcess(struct FName RowName, float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdatePostProcess // (Final|Native|Public) // @ game+0x1ece1a0
	void UpdatePassengerLocation(); // Function BravoHotelGame.BravoHotelCharacter.UpdatePassengerLocation // (Final|Native|Public) // @ game+0x1ece180
	void UpdateOuterPlayZonePP(bool bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdateOuterPlayZonePP // (Final|Native|Public) // @ game+0x1ece0f0
	void UpdateNitroBoom(); // Function BravoHotelGame.BravoHotelCharacter.UpdateNitroBoom // (Final|Native|Protected) // @ game+0x1ece0d0
	void UpdateNearClipPlane(); // Function BravoHotelGame.BravoHotelCharacter.UpdateNearClipPlane // (Final|Native|Public) // @ game+0x1ece0b0
	void UpdateMutableMesh(); // Function BravoHotelGame.BravoHotelCharacter.UpdateMutableMesh // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ece090
	void UpdateMutableBuffList(); // Function BravoHotelGame.BravoHotelCharacter.UpdateMutableBuffList // (Final|Native|Public|BlueprintCallable) // @ game+0x1ece070
	void UpdateMutable__DelegateSignature(struct ABravoHotelCharacter* Character); // DelegateFunction BravoHotelGame.BravoHotelCharacter.UpdateMutable__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void UpdateMeleeAttack(struct UBravoHotelAnimNotifyState_Melee* MeleeAnimNotifyClass, bool bDrawDebugObject); // Function BravoHotelGame.BravoHotelCharacter.UpdateMeleeAttack // (Final|Native|Public) // @ game+0x1ecdfa0
	void UpdateLeanValue(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateLeanValue // (Final|Native|Public) // @ game+0x1ecdf20
	void UpdateKnockOutParticle(); // Function BravoHotelGame.BravoHotelCharacter.UpdateKnockOutParticle // (Final|Native|Private) // @ game+0x1ecdf00
	void UpdateJetpackFuel(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateJetpackFuel // (Final|Native|Public) // @ game+0x1ecde80
	void UpdateInteractionType(struct FHitResult& Hit); // Function BravoHotelGame.BravoHotelCharacter.UpdateInteractionType // (Final|Native|Public|HasOutParms) // @ game+0x1ecdda0
	void UpdateInRagdoll(); // Function BravoHotelGame.BravoHotelCharacter.UpdateInRagdoll // (Final|Native|Public) // @ game+0x1ecdd80
	void UpdateIdleNum(); // Function BravoHotelGame.BravoHotelCharacter.UpdateIdleNum // (Final|Native|Public) // @ game+0x1ecdd60
	void UpdateGroundFriction(); // Function BravoHotelGame.BravoHotelCharacter.UpdateGroundFriction // (Final|Native|Public) // @ game+0x1ecdd40
	void UpdateFurActivation(); // Function BravoHotelGame.BravoHotelCharacter.UpdateFurActivation // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecdd20
	void UpdateFPSMode(); // Function BravoHotelGame.BravoHotelCharacter.UpdateFPSMode // (Final|Native|Public) // @ game+0x1ecdc30
	void UpdateForceFieldPP(bool bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdateForceFieldPP // (Final|Native|Public) // @ game+0x1ecdc90
	void UpdateFireInput(); // Function BravoHotelGame.BravoHotelCharacter.UpdateFireInput // (Final|Native|Public) // @ game+0x1ecdc70
	void UpdateFalling(); // Function BravoHotelGame.BravoHotelCharacter.UpdateFalling // (Final|Native|Public) // @ game+0x1ecdc50
	void UpdateDrive(); // Function BravoHotelGame.BravoHotelCharacter.UpdateDrive // (Final|Native|Public) // @ game+0x151b910
	void UpdateDebuffState(); // Function BravoHotelGame.BravoHotelCharacter.UpdateDebuffState // (Final|Native|Protected) // @ game+0x1ecdc10
	void UpdateCharacterOutlineMaterial(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCharacterOutlineMaterial // (Final|Native|Public) // @ game+0x1ecdb90
	void UpdateCharacterMagneticDamagedMaterial(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCharacterMagneticDamagedMaterial // (Final|Native|Public) // @ game+0x1ecdb10
	void UpdateCharacterDustMaterial(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCharacterDustMaterial // (Final|Native|Public) // @ game+0x1ecda90
	void UpdateCharacterDamagedMaterial(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCharacterDamagedMaterial // (Final|Native|Public) // @ game+0x1ecda10
	void UpdateCastingUI(); // Function BravoHotelGame.BravoHotelCharacter.UpdateCastingUI // (Final|Native|Public) // @ game+0x1ecd9f0
	void UpdateCameraPPByBuff(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCameraPPByBuff // (Final|Native|Protected) // @ game+0x1ecd970
	void UpdateCameraPP(bool bIsOn, float StartValue, float TargetValue, float InTime, float OutTime, struct FName AnimName, struct UCameraPostProcessPreset* PPPresetClass, struct FTimerHandle& DeactiveTimer, bool bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdateCameraPP // (Final|Native|Public|HasOutParms) // @ game+0x1ecd6d0
	void UpdateCameraInterp(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdateCameraInterp // (Final|Native|Public) // @ game+0x1ecd650
	void UpdateCamera(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCamera // (Final|Native|Public) // @ game+0x1ecd5d0
	void UpdateBreathEffect(); // Function BravoHotelGame.BravoHotelCharacter.UpdateBreathEffect // (Final|Native|Public) // @ game+0x1ecd5b0
	void UpdateBlueZonePP(bool bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdateBlueZonePP // (Final|Native|Public) // @ game+0x1ecd520
	void UpdateAreaInfo(struct TArray<struct ABravoHotelAreaSkillZone*> TargetActiveAreas, struct FAreaSkillZoneInfo& TargetSkillZoneInfo); // Function BravoHotelGame.BravoHotelCharacter.UpdateAreaInfo // (Final|Native|Public|HasOutParms) // @ game+0x1ecd3c0
	void UpdateAOSMode(); // Function BravoHotelGame.BravoHotelCharacter.UpdateAOSMode // (Final|Native|Public) // @ game+0x1ecd320
	void UpdateADSReturnTrigger(); // Function BravoHotelGame.BravoHotelCharacter.UpdateADSReturnTrigger // (Final|Native|Public) // @ game+0x1ecd300
	void UpdateAdsCameraInterp(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdateAdsCameraInterp // (Final|Native|Public) // @ game+0x1ecd340
	void UnProne(bool bClientSimulation); // Function BravoHotelGame.BravoHotelCharacter.UnProne // (Native|Public|BlueprintCallable) // @ game+0x1ecd250
	void UnlockMovementInput(); // Function BravoHotelGame.BravoHotelCharacter.UnlockMovementInput // (Final|Native|Public) // @ game+0x1ecd2e0
	void TryRetreat(bool InIsRandomLocation, struct FVector InTargetLocation); // Function BravoHotelGame.BravoHotelCharacter.TryRetreat // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1ecd170
	void TryNuclear(struct FVector InTargetLocation); // Function BravoHotelGame.BravoHotelCharacter.TryNuclear // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1ecd0e0
	void TryExitLadder(bool bIsForce); // Function BravoHotelGame.BravoHotelCharacter.TryExitLadder // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecd050
	struct UBravoHotelPhysicalMaterial* TraceSteppedSurface(); // Function BravoHotelGame.BravoHotelCharacter.TraceSteppedSurface // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ecd020
	void ThrowingGrenade(); // Function BravoHotelGame.BravoHotelCharacter.ThrowingGrenade // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecd000
	void TestSpawnPersonalSupplyBox(struct FVector& ServerLocation); // Function BravoHotelGame.BravoHotelCharacter.TestSpawnPersonalSupplyBox // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x1eccf70
	void TestMultiPersonalSupplyBox(float Distance, int32_t Count); // Function BravoHotelGame.BravoHotelCharacter.TestMultiPersonalSupplyBox // (Final|Native|Public) // @ game+0x1eccea0
	void TestEndItemSpawnSimulationBox(struct FSpawnPerkData& Data, struct FString Msg); // Function BravoHotelGame.BravoHotelCharacter.TestEndItemSpawnSimulationBox // (Final|Native|Public|HasOutParms) // @ game+0x1eccd40
	void StopRagdoll(); // Function BravoHotelGame.BravoHotelCharacter.StopRagdoll // (Final|Native|Public) // @ game+0x1eccd20
	void StopPostProcessEffects(struct FName RowName, bool bImmediately); // Function BravoHotelGame.BravoHotelCharacter.StopPostProcessEffects // (Final|Native|Public|BlueprintCallable) // @ game+0x1eccc50
	void StopPlayingPickupAnim(); // Function BravoHotelGame.BravoHotelCharacter.StopPlayingPickupAnim // (Final|Native|Public) // @ game+0x1eccc30
	void StopAllPostProcessEffects(); // Function BravoHotelGame.BravoHotelCharacter.StopAllPostProcessEffects // (Final|Native|Public) // @ game+0x1eccc10
	void StartTunnelEffect(); // Function BravoHotelGame.BravoHotelCharacter.StartTunnelEffect // (Final|Native|Public) // @ game+0x1eccbf0
	void StartSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.StartSteadyAim // (Final|Native|Public|BlueprintCallable) // @ game+0x1eccbd0
	void StartStatupMaterialEffect(struct FStatupAnimParameters& StatupParams); // Function BravoHotelGame.BravoHotelCharacter.StartStatupMaterialEffect // (Final|Native|Public|HasOutParms) // @ game+0x1eccb20
	void StartSpawnBlackOut(float DelayTime); // Function BravoHotelGame.BravoHotelCharacter.StartSpawnBlackOut // (Final|Native|Public) // @ game+0x1eccaa0
	void StartReplaceFreeLook(); // Function BravoHotelGame.BravoHotelCharacter.StartReplaceFreeLook // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecca80
	void StartRagdoll(); // Function BravoHotelGame.BravoHotelCharacter.StartRagdoll // (Final|Native|Public) // @ game+0x1ecca60
	void StartPostProcessEffects(struct FName RowName); // Function BravoHotelGame.BravoHotelCharacter.StartPostProcessEffects // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecc9e0
	void StartFalling(); // Function BravoHotelGame.BravoHotelCharacter.StartFalling // (Final|Native|Protected) // @ game+0x1ecc9c0
	void StartDescending(); // Function BravoHotelGame.BravoHotelCharacter.StartDescending // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecc9a0
	void StartCastingUI(enum class ECastingUIType CastingUIType, struct FName SourceName, float MaxTime, struct ABravoHotelCharacter* Target); // Function BravoHotelGame.BravoHotelCharacter.StartCastingUI // (Final|Native|Public) // @ game+0x1ecc850
	void StartADSProcess_2(); // Function BravoHotelGame.BravoHotelCharacter.StartADSProcess_2 // (Final|Native|Public) // @ game+0x1ecc830
	void SpectatedDelegate__DelegateSignature(bool bIsSpectated); // DelegateFunction BravoHotelGame.BravoHotelCharacter.SpectatedDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	struct ABravoHotelSkillTargetingBase* SpawnSkillTargeting(struct FName& ActorName, struct FVector& InSpawnLocation, float Radius); // Function BravoHotelGame.BravoHotelCharacter.SpawnSkillTargeting // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x1ecc700
	void SpawnRandomWeapon(); // Function BravoHotelGame.BravoHotelCharacter.SpawnRandomWeapon // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x1ecc6b0
	void SpawnBrokenEquipment(); // Function BravoHotelGame.BravoHotelCharacter.SpawnBrokenEquipment // (Final|Native|Public) // @ game+0x1ecc690
	void SimulatedTakeDamage(); // Function BravoHotelGame.BravoHotelCharacter.SimulatedTakeDamage // (Final|Native|Public) // @ game+0x1ecc670
	void ShowTeleportAppearEffect(); // Function BravoHotelGame.BravoHotelCharacter.ShowTeleportAppearEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecc650
	void ShowSkillMap(float Radius); // Function BravoHotelGame.BravoHotelCharacter.ShowSkillMap // (Final|Native|Public) // @ game+0x1ecc5d0
	void ShowParachuteMesh(bool bVisibility, bool bIsWithParachute); // Function BravoHotelGame.BravoHotelCharacter.ShowParachuteMesh // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecc500
	void ShowKeyActions(); // Function BravoHotelGame.BravoHotelCharacter.ShowKeyActions // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecc4e0
	void ShowInventoryNotEnoughSpaceMessage(); // Function BravoHotelGame.BravoHotelCharacter.ShowInventoryNotEnoughSpaceMessage // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecc4c0
	void ShowInteractiveForPickup(struct FInteraction& InteractionInfo, struct FInventoryItemInfo& ItemInfo); // Function BravoHotelGame.BravoHotelCharacter.ShowInteractiveForPickup // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1ecc2f0
	void ShowInteractiveForAction(struct FInteraction& InteractionInfo); // Function BravoHotelGame.BravoHotelCharacter.ShowInteractiveForAction // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1ecc1d0
	void ShowInteractionWidget(struct FInteraction InteractionInfo); // Function BravoHotelGame.BravoHotelCharacter.ShowInteractionWidget // (Final|Native|Public) // @ game+0x1ecc060
	void ShowHUDbySequence(); // Function BravoHotelGame.BravoHotelCharacter.ShowHUDbySequence // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecc040
	void ShowHeartBeatSensorEffect(bool IsHeartBeatSensorEffect, float HeartBeatSensorLength); // Function BravoHotelGame.BravoHotelCharacter.ShowHeartBeatSensorEffect // (Event|Public|BlueprintEvent) // @ game+0x23a3b60
	void ShowCloudFxInDescent(bool bWantsToShow); // Function BravoHotelGame.BravoHotelCharacter.ShowCloudFxInDescent // (Final|Native|Public) // @ game+0x1ecbfb0
	void ShowAmplifierEffect(bool IsAmplifierEffect, float AmplifierLength); // Function BravoHotelGame.BravoHotelCharacter.ShowAmplifierEffect // (Event|Public|BlueprintEvent) // @ game+0x23a3b60
	void ShouldSprinting(bool bNewShouldSprinting); // Function BravoHotelGame.BravoHotelCharacter.ShouldSprinting // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecbf20
	bool ShouldAdjustInDoor(enum class EInDoorAdjustmentTarget InTarget); // Function BravoHotelGame.BravoHotelCharacter.ShouldAdjustInDoor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ecbe90
	void SetVisibleOutBlueZoneBlizzard(bool Visible); // Function BravoHotelGame.BravoHotelCharacter.SetVisibleOutBlueZoneBlizzard // (Event|Public|BlueprintEvent) // @ game+0x23a3b60
	void SetTunnelEffectRatio(float Ratio); // Function BravoHotelGame.BravoHotelCharacter.SetTunnelEffectRatio // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecbe10
	void SetTeleportEffect(bool bStart); // Function BravoHotelGame.BravoHotelCharacter.SetTeleportEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecbd80
	void SetTeamInfoVisibility(bool IsVisible); // Function BravoHotelGame.BravoHotelCharacter.SetTeamInfoVisibility // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x23a3b60
	void SetTargetHealth(enum class ETargetHealthType Type, float InTargetHealth, float InUsableHealth); // Function BravoHotelGame.BravoHotelCharacter.SetTargetHealth // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecbc80
	void SetSteadyAim(bool SteadyAim); // Function BravoHotelGame.BravoHotelCharacter.SetSteadyAim // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecbbf0
	void SetState(enum class ECharacterState NewState, bool bReplicated); // Function BravoHotelGame.BravoHotelCharacter.SetState // (Final|Native|Public) // @ game+0x1ecbb20
	void SetSavedPlayerState(struct APlayerState* PState); // Function BravoHotelGame.BravoHotelCharacter.SetSavedPlayerState // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecba80
	void SetReplicatedAnimMontage(struct UAnimMontage* NewAnimMontageTPP, struct UAnimMontage* NewAnimMontageFPP); // Function BravoHotelGame.BravoHotelCharacter.SetReplicatedAnimMontage // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecb9c0
	void SetRecordingCharacterTickRate(float TickRate); // Function BravoHotelGame.BravoHotelCharacter.SetRecordingCharacterTickRate // (Event|Protected|BlueprintEvent) // @ game+0x23a3b60
	void SetRandomValuesToCustomizableObject(); // Function BravoHotelGame.BravoHotelCharacter.SetRandomValuesToCustomizableObject // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecb9a0
	void SetRandomIdleNum(); // Function BravoHotelGame.BravoHotelCharacter.SetRandomIdleNum // (Final|Native|Public) // @ game+0x1ecb980
	void SetProjectileGrenadeActor(struct ABravoHotelProjectileGrenade* Grenade); // Function BravoHotelGame.BravoHotelCharacter.SetProjectileGrenadeActor // (Final|Native|Public) // @ game+0x1ecb900
	void SetParkourTestComponentIndex(int32_t IndexKey); // Function BravoHotelGame.BravoHotelCharacter.SetParkourTestComponentIndex // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecb880
	void SetNearClipPlane(float NearClipPlane); // Function BravoHotelGame.BravoHotelCharacter.SetNearClipPlane // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecb800
	void SetMolotovFlameDotDamage(); // Function BravoHotelGame.BravoHotelCharacter.SetMolotovFlameDotDamage // (Final|Native|Public) // @ game+0x1ecb7e0
	void SetMagneticDmgDissolveAnimationCurve(); // Function BravoHotelGame.BravoHotelCharacter.SetMagneticDmgDissolveAnimationCurve // (Final|Native|Public) // @ game+0x1ecb7c0
	void SetMagneticDamagedCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.SetMagneticDamagedCharacterMaterial // (Final|Native|Public) // @ game+0x1ecb7a0
	void SetLocalChargingGauge(bool bStart); // Function BravoHotelGame.BravoHotelCharacter.SetLocalChargingGauge // (Final|Native|Public) // @ game+0x1ecb710
	void SetLadderComponent(struct ULadderComponent* NewLadder); // Function BravoHotelGame.BravoHotelCharacter.SetLadderComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecb690
	void SetIsMelee(bool bNewMelee, bool bNewMeleeJumpAttack); // Function BravoHotelGame.BravoHotelCharacter.SetIsMelee // (Final|Native|Public) // @ game+0x1ecb5c0
	void SetIsLanded(bool bNewLanded); // Function BravoHotelGame.BravoHotelCharacter.SetIsLanded // (Final|Native|Public) // @ game+0x1ecb530
	void SetIsInsideBlueZone(bool bIsInsideBlueZone); // Function BravoHotelGame.BravoHotelCharacter.SetIsInsideBlueZone // (Final|Native|Protected|BlueprintCallable) // @ game+0x1ecb4a0
	void SetIsFreeLook(bool bNewFreeLook); // Function BravoHotelGame.BravoHotelCharacter.SetIsFreeLook // (Final|Native|Public) // @ game+0x1ecb410
	void SetIsFired(bool bNewFired, float AutoDeactiveDelayTime); // Function BravoHotelGame.BravoHotelCharacter.SetIsFired // (Final|Native|Public) // @ game+0x1ecb340
	void SetInternalMagneticDamagedDissolveCharacterMaterial(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.SetInternalMagneticDamagedDissolveCharacterMaterial // (Final|Native|Public) // @ game+0x1ecb2c0
	void SetInternalMagneticDamagedCharacterMaterial(bool bOn); // Function BravoHotelGame.BravoHotelCharacter.SetInternalMagneticDamagedCharacterMaterial // (Final|Native|Public) // @ game+0x1ecb230
	void SetInternalMagneticDamagedCharacterBackGroundMaterial_On(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalMagneticDamagedCharacterBackGroundMaterial_On // (Final|Native|Public) // @ game+0x1ecb210
	void SetInternalMagneticDamagedCharacterBackGroundMaterial_Off(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalMagneticDamagedCharacterBackGroundMaterial_Off // (Final|Native|Public) // @ game+0x1ecb1f0
	void SetInternalDustDissolveCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDustDissolveCharacterMaterial // (Final|Native|Public) // @ game+0x1ecb1d0
	void SetInternalDustCharacterMaterial(bool bOn); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDustCharacterMaterial // (Final|Native|Public) // @ game+0x1ecb140
	void SetInternalDamagedDissolveCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDamagedDissolveCharacterMaterial // (Final|Native|Public) // @ game+0x1ecb120
	void SetInternalDamagedCharacterMaterial(bool bOn); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDamagedCharacterMaterial // (Final|Native|Public) // @ game+0x1ecb090
	void SetInternalDamagedCharacterBackGroundMaterial_On(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDamagedCharacterBackGroundMaterial_On // (Final|Native|Public) // @ game+0x1ecb070
	void SetInternalDamagedCharacterBackGroundMaterial_Off(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDamagedCharacterBackGroundMaterial_Off // (Final|Native|Public) // @ game+0x1ecb050
	void SetInteractiveNoHide(bool NoHide); // Function BravoHotelGame.BravoHotelCharacter.SetInteractiveNoHide // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecafc0
	void SetInteractiveCustomMode(int32_t ModeNum); // Function BravoHotelGame.BravoHotelCharacter.SetInteractiveCustomMode // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecaf40
	void SetInteractionType(enum class EInteractionType NewType); // Function BravoHotelGame.BravoHotelCharacter.SetInteractionType // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecaec0
	void SetInReduceSpeedExplosionRange(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.SetInReduceSpeedExplosionRange // (Final|Native|Protected) // @ game+0x1ecae40
	void SetFoundVehicleLocations(struct FCarScanUIInfo& InCarScanUIInfo); // Function BravoHotelGame.BravoHotelCharacter.SetFoundVehicleLocations // (Final|Native|Public|HasOutParms) // @ game+0x1ecad70
	void SetFlashBangPlaySound(); // Function BravoHotelGame.BravoHotelCharacter.SetFlashBangPlaySound // (Final|Native|Public) // @ game+0x1ecad50
	void SetFlashBangEndSound(); // Function BravoHotelGame.BravoHotelCharacter.SetFlashBangEndSound // (Final|Native|Public) // @ game+0x1ecad30
	void SetFlashBangAngle(float Angle); // Function BravoHotelGame.BravoHotelCharacter.SetFlashBangAngle // (Final|Native|Public) // @ game+0x1ecacb0
	void SetFireType(enum class EFireType NewFireType); // Function BravoHotelGame.BravoHotelCharacter.SetFireType // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecac30
	void SetDustDissolveAnimationCurve(); // Function BravoHotelGame.BravoHotelCharacter.SetDustDissolveAnimationCurve // (Final|Native|Public) // @ game+0x1ecac10
	void SetDustCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.SetDustCharacterMaterial // (Final|Native|Public) // @ game+0x1ecabf0
	void SetDissolveAnimationCurveData(); // Function BravoHotelGame.BravoHotelCharacter.SetDissolveAnimationCurveData // (Final|Native|Public) // @ game+0x1ecabd0
	void SetDescentVariables(float NewAirControl, float NewMaxWalkSpeed, float NewGravityScale, float NewBarkingDecelerationFalling, float NewMaxAcceleration, struct FVector NewCameraRelativeLocation, bool bForceLocation); // Function BravoHotelGame.BravoHotelCharacter.SetDescentVariables // (Final|Native|Public|HasDefaults) // @ game+0x1eca9b0
	void SetDefaultCameraLag(float NewDefaultCameraLag); // Function BravoHotelGame.BravoHotelCharacter.SetDefaultCameraLag // (Final|Native|Public) // @ game+0x1eca930
	void SetDamagedFlashBang(float FlashBangValue); // Function BravoHotelGame.BravoHotelCharacter.SetDamagedFlashBang // (Final|Native|Public) // @ game+0x1eca8b0
	void SetDamagedCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.SetDamagedCharacterMaterial // (Final|Native|Public) // @ game+0x1eca890
	void SetClassSelectType(bool bSelectType); // Function BravoHotelGame.BravoHotelCharacter.SetClassSelectType // (Final|Native|Public|BlueprintCallable) // @ game+0x1eca810
	void SetChargingGauge(bool bStart); // Function BravoHotelGame.BravoHotelCharacter.SetChargingGauge // (Final|Native|Public) // @ game+0x1eca780
	void SetCharacterMovementMode(enum class EMovementMode Mode); // Function BravoHotelGame.BravoHotelCharacter.SetCharacterMovementMode // (Final|Native|Public) // @ game+0x1eca700
	void SetCharacterIntheWater(); // Function BravoHotelGame.BravoHotelCharacter.SetCharacterIntheWater // (Native|Event|Public|BlueprintEvent) // @ game+0x1eca6e0
	void SetCameraLag(bool bEnable); // Function BravoHotelGame.BravoHotelCharacter.SetCameraLag // (Final|Native|Public) // @ game+0x1eca650
	void SetCameraAssistComponent(bool bSpectactor); // Function BravoHotelGame.BravoHotelCharacter.SetCameraAssistComponent // (Final|Native|Public) // @ game+0x1eca5c0
	void SetBackLightComponentsActive(bool bNewActive); // Function BravoHotelGame.BravoHotelCharacter.SetBackLightComponentsActive // (Final|Native|Public) // @ game+0x1eca530
	void SetArmedState(bool bDoArm, bool bPlayUnequipAnimation, bool bOrdered); // Function BravoHotelGame.BravoHotelCharacter.SetArmedState // (Final|Native|Public|BlueprintCallable) // @ game+0x1eca410
	void SetADSReturnTimer(float ADSReturnDelayTime); // Function BravoHotelGame.BravoHotelCharacter.SetADSReturnTimer // (Final|Native|Public|BlueprintCallable) // @ game+0x1eca300
	void SetActiveFur(bool bActive); // Function BravoHotelGame.BravoHotelCharacter.SetActiveFur // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x23a3b60
	void SetActiveBreathEffect(bool bNewActive); // Function BravoHotelGame.BravoHotelCharacter.SetActiveBreathEffect // (Final|Native|Public) // @ game+0x1eca380
	void ServerWindowBreaching(struct TArray<struct ABravoHotelCharacter*> TargetDamagedCharacters); // Function BravoHotelGame.BravoHotelCharacter.ServerWindowBreaching // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1eca240
	void ServerUseBackpackItem(int32_t BackpackItemIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerUseBackpackItem // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x1eca180
	void ServerUpdateRagdollVariables(struct FVector NewRagdollVelocity, struct FVector NewRagdollLocation, struct FVector NewActorLocation); // Function BravoHotelGame.BravoHotelCharacter.ServerUpdateRagdollVariables // (Net|Native|Event|Protected|NetServer|HasDefaults|NetValidate) // @ game+0x1ec9ff0
	void ServerUpdateNearbyVehicles(struct TArray<struct ABravoHotelVehicle*> AddedVehicles, struct TArray<struct ABravoHotelVehicle*> RemovedVehicles); // Function BravoHotelGame.BravoHotelCharacter.ServerUpdateNearbyVehicles // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec9ed0
	void ServerUpdateCamera(struct FRepCameraInfo InCameraInfo); // Function BravoHotelGame.BravoHotelCharacter.ServerUpdateCamera // (Net|Native|Event|Public|NetServer|NetValidate) // @ game+0x1ec9e10
	void ServerTryUseLadder(struct ABravoHotelLadder* DetectedLadder); // Function BravoHotelGame.BravoHotelCharacter.ServerTryUseLadder // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec9d50
	void ServerTryExitVehicle(enum class ECharacterState NextState); // Function BravoHotelGame.BravoHotelCharacter.ServerTryExitVehicle // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec9ca0
	void ServerTryExitLadder(); // Function BravoHotelGame.BravoHotelCharacter.ServerTryExitLadder // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec9c50
	void ServerTryEnterVehicle(struct UBravoHotelVehicleSeatComponent* TargetVehicleSeat); // Function BravoHotelGame.BravoHotelCharacter.ServerTryEnterVehicle // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec9b90
	void ServerTryElevatorInteraction(struct AActor* ElevatorActor, struct UPrimitiveComponent* ElevatorComponet); // Function BravoHotelGame.BravoHotelCharacter.ServerTryElevatorInteraction // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x1ec9a90
	void ServerTryDropBoxInteraction(struct AActor* TmpDropBox); // Function BravoHotelGame.BravoHotelCharacter.ServerTryDropBoxInteraction // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x1ec99d0
	void ServerTotalAirWalkDistance(float TotalDistance); // Function BravoHotelGame.BravoHotelCharacter.ServerTotalAirWalkDistance // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec9920
	void ServerTestSpawnPersonalBox(float X, float Y); // Function BravoHotelGame.BravoHotelCharacter.ServerTestSpawnPersonalBox // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec9820
	void ServerTakeDamage_Radial(float DamageAmount, struct FBravoHotelDamageEvent_Radial DamageEvent, struct ABravoHotelCharacter* TargetCharacter); // Function BravoHotelGame.BravoHotelCharacter.ServerTakeDamage_Radial // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec95a0
	void ServerTakeDamage_Point(float DamageAmount, struct FBravoHotelDamageEvent_Point DamageEvent, struct ABravoHotelCharacter* TargetCharacter); // Function BravoHotelGame.BravoHotelCharacter.ServerTakeDamage_Point // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec93f0
	void ServerTakeDamage(float DamageAmount, struct FDamageEvent DamageEvent, struct ABravoHotelCharacter* TargetCharacter); // Function BravoHotelGame.BravoHotelCharacter.ServerTakeDamage // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec92a0
	void ServerStopUltimate_Recon(); // Function BravoHotelGame.BravoHotelCharacter.ServerStopUltimate_Recon // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec9250
	void ServerStopSliding(); // Function BravoHotelGame.BravoHotelCharacter.ServerStopSliding // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec9200
	void ServerStopRolling(); // Function BravoHotelGame.BravoHotelCharacter.ServerStopRolling // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec91b0
	void ServerStopRevive(struct AActor* RevivedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerStopRevive // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec90f0
	void ServerStopResuscitation(struct AActor* ResuscitatedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerStopResuscitation // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec9030
	void ServerStopMontage(struct UAnimMontage* AnimMontage, float BlendTime); // Function BravoHotelGame.BravoHotelCharacter.ServerStopMontage // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x1ec8f30
	void ServerStartUltimate_Recon(struct FVector_NetQuantize InitialImpulse); // Function BravoHotelGame.BravoHotelCharacter.ServerStartUltimate_Recon // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec8e80
	void ServerStartStuntman(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartStuntman // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x1ec8e30
	void ServerStartSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartSteadyAim // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec8de0
	void ServerStartSliding(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartSliding // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec8d90
	void ServerStartRolling(struct FVector_NetQuantize TargetRollingImpulse); // Function BravoHotelGame.BravoHotelCharacter.ServerStartRolling // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec8ce0
	void ServerStartRocketJump(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartRocketJump // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec8c90
	void ServerStartRevive(struct AActor* RevivedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerStartRevive // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec8bd0
	void ServerStartResuscitation(struct AActor* ResuscitatedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerStartResuscitation // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec8b10
	void ServerStartMeteorJump(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartMeteorJump // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec8ac0
	void ServerStartKickDoor(struct ABravoHotelDoor* TargetDoor); // Function BravoHotelGame.BravoHotelCharacter.ServerStartKickDoor // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec8a00
	void ServerStartDescenting(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartDescenting // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec89b0
	void ServerSpawnPersonalBox(struct FSpawnPerkData SpawnPersonalBoxData, struct FDebugSupplyBoxInfo DebugData); // Function BravoHotelGame.BravoHotelCharacter.ServerSpawnPersonalBox // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec8840
	void ServerSpawnPerk(struct FSpawnPerkData SpawnPerkData); // Function BravoHotelGame.BravoHotelCharacter.ServerSpawnPerk // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec8730
	void ServerSpawnBombing(struct FVector_NetQuantize SpawnLocation); // Function BravoHotelGame.BravoHotelCharacter.ServerSpawnBombing // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec8680
	void ServerSetUpdateRenderSettings(bool bValue); // Function BravoHotelGame.BravoHotelCharacter.ServerSetUpdateRenderSettings // (Net|Native|Event|Public|NetServer|NetValidate) // @ game+0x1ec85c0
	void ServerSetState(enum class ECharacterState NewState); // Function BravoHotelGame.BravoHotelCharacter.ServerSetState // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec8510
	void ServerSetSearchInstinctLocation(struct FVector_NetQuantize InSearchInstinctLocation); // Function BravoHotelGame.BravoHotelCharacter.ServerSetSearchInstinctLocation // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x1ec8460
	void ServerSetRemoteViewRotForDriver(uint16_t SendPitch, uint16_t SendYaw); // Function BravoHotelGame.BravoHotelCharacter.ServerSetRemoteViewRotForDriver // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec8360
	void ServerSetProjectileGrenadeState(struct ABravoHotelProjectileGrenade* Grenade, enum class EProjectileGrenadeState NewState, struct AActor* NewTriggerActor); // Function BravoHotelGame.BravoHotelCharacter.ServerSetProjectileGrenadeState // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec8230
	void ServerSetParachuteTargetRotator(struct FRotator NewRotation); // Function BravoHotelGame.BravoHotelCharacter.ServerSetParachuteTargetRotator // (Net|Native|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x1ec8180
	void ServerSetLeanState(enum class ELeanState NewLeanState, float InLeanDegreeMax); // Function BravoHotelGame.BravoHotelCharacter.ServerSetLeanState // (Net|Native|Event|Public|NetServer|NetValidate) // @ game+0x1ec8080
	void ServerSetIsParachuteLanding(bool Flag, float Height); // Function BravoHotelGame.BravoHotelCharacter.ServerSetIsParachuteLanding // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x1ec7f80
	void ServerSetIsMelee(bool bNewMelee); // Function BravoHotelGame.BravoHotelCharacter.ServerSetIsMelee // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec7ec0
	void ServerSetIsFreeLook(bool bNewFreeLook); // Function BravoHotelGame.BravoHotelCharacter.ServerSetIsFreeLook // (Net|Native|Event|Public|NetServer|NetValidate) // @ game+0x1ec7e00
	void ServerSetInteractionType(enum class EInteractionType NewType); // Function BravoHotelGame.BravoHotelCharacter.ServerSetInteractionType // (Net|Native|Event|Public|NetServer|NetValidate) // @ game+0x1ec7d50
	void ServerSetInSmoke(bool bNewSmoke); // Function BravoHotelGame.BravoHotelCharacter.ServerSetInSmoke // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec7c90
	void ServerSetFireType(enum class EFireType NewFireType); // Function BravoHotelGame.BravoHotelCharacter.ServerSetFireType // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec7be0
	void ServerSetCustomBuoyancySwimMode(bool Mode); // Function BravoHotelGame.BravoHotelCharacter.ServerSetCustomBuoyancySwimMode // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec7b20
	void ServerSetChargingGauge(bool bStart); // Function BravoHotelGame.BravoHotelCharacter.ServerSetChargingGauge // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec7a60
	void ServerSetCastingUI(enum class ECastingUIType CastingUIType, struct FName SourceName, float MaxTime, struct ABravoHotelCharacter* Target); // Function BravoHotelGame.BravoHotelCharacter.ServerSetCastingUI // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec78e0
	void ServerSetBoostPercent(int8_t Percent); // Function BravoHotelGame.BravoHotelCharacter.ServerSetBoostPercent // (Net|Native|Event|Public|NetServer|NetValidate) // @ game+0x1ec7830
	void ServerSetActorRotation(struct FRotator NewRotation); // Function BravoHotelGame.BravoHotelCharacter.ServerSetActorRotation // (Net|Native|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x1ec7780
	void ServerSetActorLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation); // Function BravoHotelGame.BravoHotelCharacter.ServerSetActorLocationAndRotation // (Net|Native|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x1ec7650
	void ServerSetActiveSkillsKeyNameList(struct TArray<struct FName> KeyNameList); // Function BravoHotelGame.BravoHotelCharacter.ServerSetActiveSkillsKeyNameList // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec7590
	void ServerSendInvalidHitInfos(struct TArray<struct FRepInvalidHitInfo> InvalidHitInofs); // Function BravoHotelGame.BravoHotelCharacter.ServerSendInvalidHitInfos // (Net|Native|Event|Public|NetServer) // @ game+0x1ec74f0
	void ServerSelectThrowingWeaponThrowingType(enum class EGrenadeThrowingType NewThrowingType); // Function BravoHotelGame.BravoHotelCharacter.ServerSelectThrowingWeaponThrowingType // (Net|Native|Event|Public|NetServer|NetValidate) // @ game+0x1ec7440
	void ServerRewindMontage(struct UAnimMontage* AnimMontage); // Function BravoHotelGame.BravoHotelCharacter.ServerRewindMontage // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x1ec7380
	void ServerResetVehicleSearch(); // Function BravoHotelGame.BravoHotelCharacter.ServerResetVehicleSearch // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec7330
	void ServerResetSearchInstinct(); // Function BravoHotelGame.BravoHotelCharacter.ServerResetSearchInstinct // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x1ec72e0
	void ServerReselectPerkDeck(); // Function BravoHotelGame.BravoHotelCharacter.ServerReselectPerkDeck // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec7290
	void ServerRequestPayGold(int32_t ActionCode, int32_t Amount); // Function BravoHotelGame.BravoHotelCharacter.ServerRequestPayGold // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec7190
	void ServerRequestBuildingItemSpawnState(struct ABravoHotelBuilding* Building); // Function BravoHotelGame.BravoHotelCharacter.ServerRequestBuildingItemSpawnState // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec70d0
	void ServerRequestBuildingItemSpawnList(int32_t Size, float IntervalTime, bool ToJson); // Function BravoHotelGame.BravoHotelCharacter.ServerRequestBuildingItemSpawnList // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec6f90
	void ServerRequestBuildingCount(); // Function BravoHotelGame.BravoHotelCharacter.ServerRequestBuildingCount // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec6f40
	void ServerQuickLanding(struct FVector_NetQuantize ClientActorLocation); // Function BravoHotelGame.BravoHotelCharacter.ServerQuickLanding // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec6e90
	void ServerPlayMontage(struct UAnimMontage* AnimMontageTPP, struct UAnimMontage* AnimMontageFPP); // Function BravoHotelGame.BravoHotelCharacter.ServerPlayMontage // (Net|NetReliableNative|Event|Protected|NetServer|BlueprintCallable|NetValidate) // @ game+0x1ec6d90
	void ServerPickUpInBox(struct ABravoHotelDropBoxActor* DropBoxActor, int8_t ItemIndex, int32_t GainQuantity, int32_t WeaponSlotIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerPickUpInBox // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x1ec6c10
	void ServerPersonalBoxRePosition(struct ABHPersonalSupplyBox* TargetSupplyBox, struct FVector NewLocation, struct FString HitActorName); // Function BravoHotelGame.BravoHotelCharacter.ServerPersonalBoxRePosition // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x1ec6ac0
	void ServerMoveItem(struct AActor* SourceActor, enum class ItemWidgetDragType SourceSlotType, struct FInventoryItemInfo SourceItemInfo, struct AActor* TargetActor, enum class ItemWidgetDragType TargetSlotType, int32_t TargetIndex, int32_t GainQuantity); // Function BravoHotelGame.BravoHotelCharacter.ServerMoveItem // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec6830
	void ServerMeteorStrike(); // Function BravoHotelGame.BravoHotelCharacter.ServerMeteorStrike // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec67e0
	void ServerMaxAirWalkDistance(float MaxDistance); // Function BravoHotelGame.BravoHotelCharacter.ServerMaxAirWalkDistance // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec6730
	void ServerLaunchCharacter(struct FVector LaunchVelocity); // Function BravoHotelGame.BravoHotelCharacter.ServerLaunchCharacter // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x1ec6660
	void ServerJetpackBooster(bool bNewJackpack); // Function BravoHotelGame.BravoHotelCharacter.ServerJetpackBooster // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec65a0
	void ServerJetpackAim(bool bNewJetpackAim); // Function BravoHotelGame.BravoHotelCharacter.ServerJetpackAim // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec64e0
	void ServerInputState(int8_t Forward, int8_t Right); // Function BravoHotelGame.BravoHotelCharacter.ServerInputState // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x1ec63f0
	void ServerInputFPSOnly(bool bFlag); // Function BravoHotelGame.BravoHotelCharacter.ServerInputFPSOnly // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec6330
	void ServerHealthRegain(float Amount, enum class ECharacterBuffType BuffType); // Function BravoHotelGame.BravoHotelCharacter.ServerHealthRegain // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec6230
	void ServerHandleDamageToVehicleDestructibleComponent(struct UBravoHotelDestructibleComponent* DestructibleComponent, struct FHitResult HitDetails, struct FVector ImpactVelocity); // Function BravoHotelGame.BravoHotelCharacter.ServerHandleDamageToVehicleDestructibleComponent // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x1ec5ff0
	void ServerForceUpdateTerrainType(); // Function BravoHotelGame.BravoHotelCharacter.ServerForceUpdateTerrainType // (Net|Native|Event|Public|NetServer|NetValidate) // @ game+0x1ec5fa0
	void ServerFireMode(); // Function BravoHotelGame.BravoHotelCharacter.ServerFireMode // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec5f50
	void ServerFailedActiveSkill_2(); // Function BravoHotelGame.BravoHotelCharacter.ServerFailedActiveSkill_2 // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec5f00
	void ServerFailedActiveSkill_1(); // Function BravoHotelGame.BravoHotelCharacter.ServerFailedActiveSkill_1 // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec5eb0
	void ServerEscapeTheFlames(struct FMolotovFlameDotDamageInfo FlameDamageInfo); // Function BravoHotelGame.BravoHotelCharacter.ServerEscapeTheFlames // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec5d70
	void ServerEquipPerk(enum class EPerkSlotFlag Slot, struct FName PerkName, int32_t Level, bool Reset); // Function BravoHotelGame.BravoHotelCharacter.ServerEquipPerk // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec5bf0
	void ServerEndSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.ServerEndSteadyAim // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec5ba0
	void ServerEndRevive(struct AActor* RevivedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerEndRevive // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec5ae0
	void ServerEndResuscitation(struct AActor* ResuscitatedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerEndResuscitation // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec5a20
	void ServerDoWalking(bool bNewWalking); // Function BravoHotelGame.BravoHotelCharacter.ServerDoWalking // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec5810
	void ServerDoSprinting(bool bNewSprinting); // Function BravoHotelGame.BravoHotelCharacter.ServerDoSprinting // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec5750
	void ServerDoRetreat(struct FVector NewLocation, struct FRotator NewRotation, float RandomDistanceMax); // Function BravoHotelGame.BravoHotelCharacter.ServerDoRetreat // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x1ec55d0
	void ServerDoProne(bool bNewProne); // Function BravoHotelGame.BravoHotelCharacter.ServerDoProne // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec5510
	void ServerDoPickUpItemOrWeapon(int32_t WeaponSlotIndex, struct ABravoHotelPickup* PickableItem, int32_t GainQuantity); // Function BravoHotelGame.BravoHotelCharacter.ServerDoPickUpItemOrWeapon // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x1ec53e0
	void ServerDoorBreaching(struct ABravoHotelDoor* TargetDoor, bool bIsDamageCauserFrontOfDoor, struct TArray<struct ABravoHotelCharacter*> TargetDamagedCharacters); // Function BravoHotelGame.BravoHotelCharacter.ServerDoorBreaching // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec58d0
	void ServerDoNuclear(struct FVector_NetQuantize SpawnLocation, struct FNuclearInfo NewNuclearInfo); // Function BravoHotelGame.BravoHotelCharacter.ServerDoNuclear // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec52d0
	void ServerDoAirWalk(bool bNewAirWalk, float InDuration, float InGravity); // Function BravoHotelGame.BravoHotelCharacter.ServerDoAirWalk // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec5190
	void ServerDamageInFlames(struct FMolotovFlameDotDamageInfo FlameDamageInfo); // Function BravoHotelGame.BravoHotelCharacter.ServerDamageInFlames // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec5050
	void ServerCompletedCombine(); // Function BravoHotelGame.BravoHotelCharacter.ServerCompletedCombine // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x1ec5000
	void ServerClearCastingUI(); // Function BravoHotelGame.BravoHotelCharacter.ServerClearCastingUI // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec4fb0
	void ServerChoosePerkDeck(int32_t ChooseIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerChoosePerkDeck // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec4ef0
	void ServerCheckLineTrace(); // Function BravoHotelGame.BravoHotelCharacter.ServerCheckLineTrace // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec4ea0
	void ServerChangeGender(); // Function BravoHotelGame.BravoHotelCharacter.ServerChangeGender // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec4e50
	void ServerCancleActiveSkill(int32_t CancleActiveSkillSlot); // Function BravoHotelGame.BravoHotelCharacter.ServerCancleActiveSkill // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec4d90
	void ServerBuildingCountCheck(); // Function BravoHotelGame.BravoHotelCharacter.ServerBuildingCountCheck // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec4d40
	void ServerBeginCombine(struct FName RecipeKey); // Function BravoHotelGame.BravoHotelCharacter.ServerBeginCombine // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x1ec4c80
	void ServerBeginCastingBackpackItem(int32_t BackpackItemIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerBeginCastingBackpackItem // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x1ec4bc0
	void ServerAttachToComponent(struct AActor* AttachingActor, struct UPrimitiveComponent* AttachedComponent, struct FVector AttachLocation, struct FVector AttachNormal); // Function BravoHotelGame.BravoHotelCharacter.ServerAttachToComponent // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x1ec4a10
	void ServerApplyDamage(float DamageAmount, struct FDamageEvent DamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.ServerApplyDamage // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec4880
	void ServerAddPerk(int32_t Count); // Function BravoHotelGame.BravoHotelCharacter.ServerAddPerk // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec47c0
	void ServerAddExpToPerk(enum class EPerkSlotFlag Slot, int32_t ExpValue); // Function BravoHotelGame.BravoHotelCharacter.ServerAddExpToPerk // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec46c0
	void ServerActiveSkill(int32_t ActiveSkillSlot); // Function BravoHotelGame.BravoHotelCharacter.ServerActiveSkill // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1ec4600
	void ServerActionDestructObject(struct ADestructibleActor* DestructibleActor, struct UDestructibleComponent* DestructibleComponent, struct FVector Location, float Damage, float EffectRange); // Function BravoHotelGame.BravoHotelCharacter.ServerActionDestructObject // (Net|Native|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x1ec4430
	void ServerAbortCombine(); // Function BravoHotelGame.BravoHotelCharacter.ServerAbortCombine // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x1ec43e0
	void ServerAbortCastingBackpackItem(int32_t BackpackItemIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerAbortCastingBackpackItem // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x1ec4320
	void SelectThrowingWeaponThrowingType(); // Function BravoHotelGame.BravoHotelCharacter.SelectThrowingWeaponThrowingType // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec4300
	void SelectPerkDeck(struct FName DeckName); // Function BravoHotelGame.BravoHotelCharacter.SelectPerkDeck // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec4280
	void RifleMeleeAttack(); // Function BravoHotelGame.BravoHotelCharacter.RifleMeleeAttack // (Final|Native|Protected) // @ game+0x1ec4260
	void RevertGeneralSettingNearClipPlane(); // Function BravoHotelGame.BravoHotelCharacter.RevertGeneralSettingNearClipPlane // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec4240
	void ResetTargetHealth(); // Function BravoHotelGame.BravoHotelCharacter.ResetTargetHealth // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec4220
	void ResetPerkDeckUI(); // Function BravoHotelGame.BravoHotelCharacter.ResetPerkDeckUI // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec4200
	void ResetOxygen(); // Function BravoHotelGame.BravoHotelCharacter.ResetOxygen // (Final|Native|Public) // @ game+0x1ec41e0
	void ResetMagneticDamagedCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.ResetMagneticDamagedCharacterMaterial // (Final|Native|Public) // @ game+0x1ec41c0
	void ResetLanding(); // Function BravoHotelGame.BravoHotelCharacter.ResetLanding // (Final|Native|Public) // @ game+0x1ec41a0
	void ResetIdleNum(); // Function BravoHotelGame.BravoHotelCharacter.ResetIdleNum // (Final|Native|Public) // @ game+0x1ec4180
	void ResetFlashBangPP(); // Function BravoHotelGame.BravoHotelCharacter.ResetFlashBangPP // (Final|Native|Public) // @ game+0x1ec4160
	void ResetDustCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.ResetDustCharacterMaterial // (Final|Native|Public) // @ game+0x1ec4140
	void ResetDamagedCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.ResetDamagedCharacterMaterial // (Final|Native|Public) // @ game+0x1ec4120
	void ResendHUDInfo(); // Function BravoHotelGame.BravoHotelCharacter.ResendHUDInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec4100
	void RequestServerBuildingCount(); // Function BravoHotelGame.BravoHotelCharacter.RequestServerBuildingCount // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec40e0
	void RequestNearBuildingItemSpawnState(); // Function BravoHotelGame.BravoHotelCharacter.RequestNearBuildingItemSpawnState // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec40c0
	void RequestAllBuildingItemSpawnInfo(int32_t RequestSize, float IntervalTime, bool ToJson); // Function BravoHotelGame.BravoHotelCharacter.RequestAllBuildingItemSpawnInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec3fb0
	void ReplaceFreeLookImmediately(); // Function BravoHotelGame.BravoHotelCharacter.ReplaceFreeLookImmediately // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec3f90
	void RemoveWearableItem(enum class EWearableItemType Slot, bool bUpdateSkeletalMesh); // Function BravoHotelGame.BravoHotelCharacter.RemoveWearableItem // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec3ec0
	void RemoveThrownMolotovCocktail(struct ABravoHotelProjectileGrenadeMolotovCocktail* MolotovCocktail); // Function BravoHotelGame.BravoHotelCharacter.RemoveThrownMolotovCocktail // (Final|Native|Public) // @ game+0x1ec3e40
	void RemoveThrownFlashbang(struct ABravoHotelProjectileGrenadeFlashbang* Flashbang); // Function BravoHotelGame.BravoHotelCharacter.RemoveThrownFlashbang // (Final|Native|Public) // @ game+0x1ec3dc0
	void RemoveTargetHealth(enum class ETargetHealthType Type); // Function BravoHotelGame.BravoHotelCharacter.RemoveTargetHealth // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec3d40
	void RemoveShortTimeHealth(struct UObject* HealthOwner); // Function BravoHotelGame.BravoHotelCharacter.RemoveShortTimeHealth // (Final|Native|Public) // @ game+0x1ec3cc0
	void RemoveEquippingWearableItems(); // Function BravoHotelGame.BravoHotelCharacter.RemoveEquippingWearableItems // (Final|Native|Public) // @ game+0x1ec3ca0
	void RemoveDetectedStealable(struct ABravoHotelCharacter* NewCharacter); // Function BravoHotelGame.BravoHotelCharacter.RemoveDetectedStealable // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec3c20
	void RemoveDetectedItem(struct ABravoHotelPickup* NewPickup); // Function BravoHotelGame.BravoHotelCharacter.RemoveDetectedItem // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec3ba0
	void RemoveDetectedDropBox(struct ABravoHotelDropBoxActor* NewPickup); // Function BravoHotelGame.BravoHotelCharacter.RemoveDetectedDropBox // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec3b20
	void RemoveCondition(enum class ECharacterConditionType ConditionType, enum class EAbilityCase Key); // Function BravoHotelGame.BravoHotelCharacter.RemoveCondition // (Final|Native|Public) // @ game+0x1ec3a60
	void RemoveCameraPP(struct UCameraPostProcessPreset* TargetPPPresetClass); // Function BravoHotelGame.BravoHotelCharacter.RemoveCameraPP // (Final|Native|Public) // @ game+0x1ec39e0
	void RemoveBackpackShield(struct FBravoHotelDamageEvent_Point& DamageEvent); // Function BravoHotelGame.BravoHotelCharacter.RemoveBackpackShield // (Final|Native|Public|HasOutParms) // @ game+0x1ec38c0
	struct FName RemoveArmShield(struct FHitResult& TargetHitResult, struct FVector& ShotDirection); // Function BravoHotelGame.BravoHotelCharacter.RemoveArmShield // (Final|Native|Public|HasOutParms|HasDefaults|Const) // @ game+0x1ec3780
	void RemoveAllWearableItem2(); // Function BravoHotelGame.BravoHotelCharacter.RemoveAllWearableItem2 // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec3740
	void RemoveAllWearableItem(); // Function BravoHotelGame.BravoHotelCharacter.RemoveAllWearableItem // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec3760
	void RemoveAllFoundVehicleLocations(); // Function BravoHotelGame.BravoHotelCharacter.RemoveAllFoundVehicleLocations // (Final|Native|Public) // @ game+0x1ec3720
	void RemoveAllDetectedItems(); // Function BravoHotelGame.BravoHotelCharacter.RemoveAllDetectedItems // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec3700
	void RemoveAllBackpackItem(); // Function BravoHotelGame.BravoHotelCharacter.RemoveAllBackpackItem // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec36e0
	void RefreshAppearanceInfo(); // Function BravoHotelGame.BravoHotelCharacter.RefreshAppearanceInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec36c0
	void ReduceCharacterSpeedInGrenadeExplosionRange(); // Function BravoHotelGame.BravoHotelCharacter.ReduceCharacterSpeedInGrenadeExplosionRange // (Final|Native|Public) // @ game+0x1ec36a0
	void ReconnectProcess(); // Function BravoHotelGame.BravoHotelCharacter.ReconnectProcess // (Final|Native|Public) // @ game+0x1ec3680
	void ReceiverVoice(struct FName Idx); // Function BravoHotelGame.BravoHotelCharacter.ReceiverVoice // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1ec35f0
	void ReadyTeleport(); // Function BravoHotelGame.BravoHotelCharacter.ReadyTeleport // (Event|Public|BlueprintEvent) // @ game+0x23a3b60
	void ReadyGivePerkEvent(); // Function BravoHotelGame.BravoHotelCharacter.ReadyGivePerkEvent // (Event|Public|BlueprintEvent) // @ game+0x23a3b60
	void PunchOnGround(); // Function BravoHotelGame.BravoHotelCharacter.PunchOnGround // (Final|Native|Protected) // @ game+0x1ec35d0
	void PunchOnAir(); // Function BravoHotelGame.BravoHotelCharacter.PunchOnAir // (Final|Native|Protected) // @ game+0x1ec35b0
	void Prone(bool bClientSimulation); // Function BravoHotelGame.BravoHotelCharacter.Prone // (Native|Public|BlueprintCallable) // @ game+0x1ec3520
	void PrintAllDetectedItems(); // Function BravoHotelGame.BravoHotelCharacter.PrintAllDetectedItems // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec3500
	void PrepareLanding(enum class ELandingReason InLandingReason); // Function BravoHotelGame.BravoHotelCharacter.PrepareLanding // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec3480
	void PlaySoundPlosiveSoundDetection3Lv(); // Function BravoHotelGame.BravoHotelCharacter.PlaySoundPlosiveSoundDetection3Lv // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec3460
	void PlayMontageTakeDamage(); // Function BravoHotelGame.BravoHotelCharacter.PlayMontageTakeDamage // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec3440
	void PlayHitSoundForInstigator(); // Function BravoHotelGame.BravoHotelCharacter.PlayHitSoundForInstigator // (Final|Native|Public) // @ game+0x1ec3420
	void PlayDeathAnimation(struct FAnimSlot DeathAnimSlot, bool bIsForce, struct FVector Force, struct FRotator DeathRotation); // Function BravoHotelGame.BravoHotelCharacter.PlayDeathAnimation // (Final|Native|Private|HasDefaults) // @ game+0x1ec32a0
	struct FAudioPlayingHandle PlayCharacterSound(struct UAkAudioEvent* Event, struct TArray<struct FAudioCondition>& Conditions); // Function BravoHotelGame.BravoHotelCharacter.PlayCharacterSound // (Final|BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1ec3170
	void PlayCameraShakeDescenting(); // Function BravoHotelGame.BravoHotelCharacter.PlayCameraShakeDescenting // (Final|Native|Public) // @ game+0x1ec3150
	void PistolMeleeAttack(); // Function BravoHotelGame.BravoHotelCharacter.PistolMeleeAttack // (Final|Native|Protected) // @ game+0x1ec3130
	void PickableItemDetected__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.PickableItemDetected__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void PhysicsImpulse_OnServer(struct ABravoHotelMutiplayerPhysicsActor* PhysicsActor, struct FVector Impulse, struct FName BoneName); // Function BravoHotelGame.BravoHotelCharacter.PhysicsImpulse_OnServer // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x1ec2fd0
	void PhysicsImpulse_Multicast(struct ABravoHotelMutiplayerPhysicsActor* PhysicsActor, struct FVector Impulse, struct FName BoneName); // Function BravoHotelGame.BravoHotelCharacter.PhysicsImpulse_Multicast // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x1ec2eb0
	void PhysicsActor_OnServer(struct ABravoHotelMutiplayerPhysicsActor* PhysicsActor, struct FTransform actorTransform); // Function BravoHotelGame.BravoHotelCharacter.PhysicsActor_OnServer // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x1ec2d50
	void PhysicsActor_Multicast(struct ABravoHotelMutiplayerPhysicsActor* PhysicsActor, struct FTransform actorTransform); // Function BravoHotelGame.BravoHotelCharacter.PhysicsActor_Multicast // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x1ec2c10
	void PhasePerkLevelUpTimer(float DelayTime, int32_t UpCount); // Function BravoHotelGame.BravoHotelCharacter.PhasePerkLevelUpTimer // (Final|Native|Public) // @ game+0x1ec2b40
	void PhasePerkLevelUpReady(); // Function BravoHotelGame.BravoHotelCharacter.PhasePerkLevelUpReady // (Final|Native|Public) // @ game+0x1ec2b20
	void PhasePerkLevelUp(int32_t UpCount); // Function BravoHotelGame.BravoHotelCharacter.PhasePerkLevelUp // (Final|Native|Public) // @ game+0x1ec2aa0
	void PerkSpinEvent(bool bShow, int32_t Count, enum class EPerkSlotFlag Slot); // Function BravoHotelGame.BravoHotelCharacter.PerkSpinEvent // (Event|Public|BlueprintEvent) // @ game+0x23a3b60
	void OnViewCameraOutWater__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnViewCameraOutWater__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnViewCameraInWater__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnViewCameraInWater__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnUpdateStartReady(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateStartReady // (Final|Native|Public) // @ game+0x1ec2a20
	void OnUpdatePassenger(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdatePassenger // (Final|Native|Public) // @ game+0x1ec26a0
	void OnUpdateParachuting(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateParachuting // (Final|Native|Public) // @ game+0x1ec29a0
	void OnUpdateLadder(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateLadder // (Final|Native|Public) // @ game+0x1ec27a0
	void OnUpdateKnockout(float fDeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateKnockout // (Final|Native|Public) // @ game+0x1ec2920
	void OnUpdateInAircraftCinematic(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateInAircraftCinematic // (Final|Native|Public) // @ game+0x1ec28a0
	void OnUpdateInAircraft(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateInAircraft // (Final|Native|Public) // @ game+0x1ec2820
	void OnUpdateEndReady(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateEndReady // (Final|Native|Public) // @ game+0x1ec27a0
	void OnUpdateDriverPossessedPawn(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateDriverPossessedPawn // (Final|Native|Public) // @ game+0x1ec2720
	void OnUpdateDriver(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateDriver // (Final|Native|Public) // @ game+0x1ec26a0
	void OnUpdateDescent(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateDescent // (Final|Native|Public) // @ game+0x1ec2620
	void OnUpdateDeath(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateDeath // (Final|Native|Public) // @ game+0x1ec25a0
	void OnUpdateCriticalTime(float fDeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateCriticalTime // (Final|Native|Public) // @ game+0x1ec2520
	void OnUpdateBattle(float fDeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateBattle // (Final|Native|Public) // @ game+0x1ec24a0
	void OnToggleWidget(enum class EToggleWidgetModeType& ToggleType); // Function BravoHotelGame.BravoHotelCharacter.OnToggleWidget // (Final|Native|Public|HasOutParms) // @ game+0x1ec2410
	void OnThrowingGrenadeMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function BravoHotelGame.BravoHotelCharacter.OnThrowingGrenadeMontageEnded // (Final|Native|Protected) // @ game+0x1ec1410
	void OnStartCineAircraft(struct AActor* InAircraftFlight); // Function BravoHotelGame.BravoHotelCharacter.OnStartCineAircraft // (Final|Native|Protected) // @ game+0x1ec2390
	void OnSpawnBlackOutDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnSpawnBlackOutDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnSetBaseElevator(struct UPrimitiveComponent* baseComponent); // Function BravoHotelGame.BravoHotelCharacter.OnSetBaseElevator // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec2310
	void OnRep_UnderWater(bool& LastFlag); // Function BravoHotelGame.BravoHotelCharacter.OnRep_UnderWater // (Final|Native|Public|HasOutParms) // @ game+0x1ec2260
	void OnRep_SteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_SteadyAim // (Final|Native|Private) // @ game+0x1ec2240
	void OnRep_NeedFindPersonalSupplyBoxLocation(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_NeedFindPersonalSupplyBoxLocation // (Final|Native|Public) // @ game+0x1ec21a0
	void OnRep_Health(float& LastHealth); // Function BravoHotelGame.BravoHotelCharacter.OnRep_Health // (Final|Native|Private|HasOutParms|BlueprintCallable) // @ game+0x1ec20e0
	void OnRep_FPSK_TargetMagnificationFactor(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_FPSK_TargetMagnificationFactor // (Final|Native|Public) // @ game+0x1ec20a0
	void OnRep_CurrentPerkInfos(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_CurrentPerkInfos // (Final|Native|Protected) // @ game+0x1ec2080
	void OnRep_CurrentPerkDeck(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_CurrentPerkDeck // (Final|Native|Public) // @ game+0x1ec2040
	void OnRep_BoostPercent(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_BoostPercent // (Final|Native|Public) // @ game+0x1ec2000
	void OnRep_bInSmoke(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_bInSmoke // (Final|Native|Public) // @ game+0x1ec22f0
	void OnRep_BandageTargetHealth(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_BandageTargetHealth // (Final|Native|Public) // @ game+0x1ec1fe0
	void OnPinOffMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function BravoHotelGame.BravoHotelCharacter.OnPinOffMontageEnded // (Final|Native|Protected) // @ game+0x1ec1410
	void OnParachuteSkinDataLoaded(struct TSoftObjectPtr<UMaterialInterface> TargetParachuteSkin); // Function BravoHotelGame.BravoHotelCharacter.OnParachuteSkinDataLoaded // (Final|Native|Public) // @ game+0x1ec1ec0
	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function BravoHotelGame.BravoHotelCharacter.OnOverlapEnd // (Final|Native|Protected) // @ game+0x1ec1d80
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function BravoHotelGame.BravoHotelCharacter.OnOverlapBegin // (Final|Native|Protected|HasOutParms) // @ game+0x1ec1b70
	void OnOutSmoke__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnOutSmoke__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnOriginRebasing(struct UWorld* World, struct FIntVector PreviosWorldOriginLocation, struct FIntVector OriginLocation); // Function BravoHotelGame.BravoHotelCharacter.OnOriginRebasing // (Native|Public|HasDefaults) // @ game+0x1ec1a40
	void OnMovementUpdated(float DeltaSeconds, struct FVector OldLocation, struct FVector OldVelocity); // Function BravoHotelGame.BravoHotelCharacter.OnMovementUpdated // (Final|Native|Protected|HasDefaults) // @ game+0x1ec1920
	void OnMovementInputPressed__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnMovementInputPressed__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnInstigatorHitCharacter(struct UBravoHotelDamageType* DamageTypeClass); // Function BravoHotelGame.BravoHotelCharacter.OnInstigatorHitCharacter // (Final|Native|Public) // @ game+0x1ec18a0
	void OnInSmoke__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnInSmoke__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnInputStopFreeLook(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStopFreeLook // (Final|Native|Public) // @ game+0x1ec1880
	void OnInputStopFire(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStopFire // (Final|Native|Public) // @ game+0x1ec1860
	void OnInputStopBoostItemMenu(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStopBoostItemMenu // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec1840
	void OnInputStartSprinting(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStartSprinting // (Final|Native|Public) // @ game+0x1ec1820
	void OnInputStartMovement(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStartMovement // (Final|Native|Public) // @ game+0x151b910
	void OnInputStartFreeLook(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStartFreeLook // (Final|Native|Public) // @ game+0x1ec1800
	void OnInputSmartPingMenuWorldMap(); // Function BravoHotelGame.BravoHotelCharacter.OnInputSmartPingMenuWorldMap // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec17e0
	void OnInputSmartPingMenu2WorldMap(); // Function BravoHotelGame.BravoHotelCharacter.OnInputSmartPingMenu2WorldMap // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec17a0
	void OnInputSmartPingMenu(); // Function BravoHotelGame.BravoHotelCharacter.OnInputSmartPingMenu // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec17c0
	void OnInputReleaseCrouch(); // Function BravoHotelGame.BravoHotelCharacter.OnInputReleaseCrouch // (Final|Native|Public) // @ game+0x1ec1780
	void OnInputFPSOnly(); // Function BravoHotelGame.BravoHotelCharacter.OnInputFPSOnly // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec1760
	void OnInputEndSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.OnInputEndSteadyAim // (Final|Native|Public) // @ game+0x1ec1740
	void OnInitializedFSM(struct UStateMachineComponent* Context); // Function BravoHotelGame.BravoHotelCharacter.OnInitializedFSM // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ec16b0
	void OnHitMeteorStrike(struct UPrimitiveComponent* HitComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, struct FVector NormalImpulse, struct FHitResult& Hit); // Function BravoHotelGame.BravoHotelCharacter.OnHitMeteorStrike // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x1ec14e0
	void OnGrenadeCookMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function BravoHotelGame.BravoHotelCharacter.OnGrenadeCookMontageEnded // (Final|Native|Protected) // @ game+0x1ec1410
	void OnFinishRocketJump(); // Function BravoHotelGame.BravoHotelCharacter.OnFinishRocketJump // (Final|Native|Public) // @ game+0x1ec13f0
	void OnFinishMeteorJump(); // Function BravoHotelGame.BravoHotelCharacter.OnFinishMeteorJump // (Final|Native|Public) // @ game+0x1ec13d0
	void OnFinishAirWalk(); // Function BravoHotelGame.BravoHotelCharacter.OnFinishAirWalk // (Final|Native|Public) // @ game+0x1ec13b0
	void OnExitStartReady(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitStartReady // (Final|Native|Public) // @ game+0x1ec0fd0
	void OnExitPassenger(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitPassenger // (Final|Native|Public) // @ game+0x1ec12f0
	void OnExitParachuting(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitParachuting // (Final|Native|Public) // @ game+0x1ec1270
	void OnExitLadder(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitLadder // (Final|Native|Public) // @ game+0x1ec11f0
	void OnExitKnockout(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitKnockout // (Final|Native|Public) // @ game+0x1ec1170
	void OnExitInAircraftCinematic(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitInAircraftCinematic // (Final|Native|Public) // @ game+0x1ec10f0
	void OnExitInAircraft(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitInAircraft // (Final|Native|Public) // @ game+0x1ec1070
	void OnExitHipShot(); // Function BravoHotelGame.BravoHotelCharacter.OnExitHipShot // (Final|Native|Public) // @ game+0x151b910
	void OnExitHeartBeatSensor(); // Function BravoHotelGame.BravoHotelCharacter.OnExitHeartBeatSensor // (Final|Native|Public) // @ game+0x1ec1050
	void OnExitForceFieldDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnExitForceFieldDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnExitFallingState__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnExitFallingState__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnExitEndReady(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitEndReady // (Final|Native|Public) // @ game+0x1ec0fd0
	void OnExitedVehicle(); // Function BravoHotelGame.BravoHotelCharacter.OnExitedVehicle // (Final|Native|Protected) // @ game+0x1ec1390
	void OnExitedElevator(); // Function BravoHotelGame.BravoHotelCharacter.OnExitedElevator // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec1370
	void OnExitDriverPossessedPawn(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitDriverPossessedPawn // (Final|Native|Public) // @ game+0x1ec0f50
	void OnExitDriver(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitDriver // (Final|Native|Public) // @ game+0x1ec0ed0
	void OnExitDescent(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitDescent // (Final|Native|Public) // @ game+0x1ec0e50
	void OnExitDeath(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitDeath // (Final|Native|Public) // @ game+0x1ec0dd0
	void OnExitCriticalTime(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitCriticalTime // (Final|Native|Public) // @ game+0x1ec0d50
	void OnExitBattle(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitBattle // (Final|Native|Public) // @ game+0x1ec0cd0
	void OnExitAOS(); // Function BravoHotelGame.BravoHotelCharacter.OnExitAOS // (Final|Native|Public) // @ game+0x1ec0cb0
	void OnExitAMP(); // Function BravoHotelGame.BravoHotelCharacter.OnExitAMP // (Final|Native|Public) // @ game+0x1ec0c90
	void OnExitADS(bool bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnExitADS // (Final|Native|Public) // @ game+0x1ec0c00
	void OnEnterHipShot(bool bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnEnterHipShot // (Final|Native|Public) // @ game+0x1ec0ad0
	void OnEnterHeartBeatSensor(bool bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnEnterHeartBeatSensor // (Final|Native|Public) // @ game+0x1ec0a40
	void OnEnteredVehicle__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnEnteredVehicle__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnEnteredVehicle(); // Function BravoHotelGame.BravoHotelCharacter.OnEnteredVehicle // (Final|Native|Protected) // @ game+0x1ec0be0
	void OnEnteredElevator(struct ABravoHotelMoveElevator* OutElevatorRef); // Function BravoHotelGame.BravoHotelCharacter.OnEnteredElevator // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec0b60
	void OnEnterAOS(bool bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnEnterAOS // (Final|Native|Public) // @ game+0x1ec09b0
	void OnEnterAMP(bool bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnEnterAMP // (Final|Native|Public) // @ game+0x1ec0920
	void OnEnterADS(bool bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnEnterADS // (Final|Native|Public) // @ game+0x1ec0890
	void OnEndSearchInstinct__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnEndSearchInstinct__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnEndCineAircraft(); // Function BravoHotelGame.BravoHotelCharacter.OnEndCineAircraft // (Final|Native|Protected) // @ game+0x1ec0870
	void OnDeath(); // Function BravoHotelGame.BravoHotelCharacter.OnDeath // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ec0850
	void OnDamaged(struct UBravoHotelDamageType* DamageTypeClass, float DamageAmount); // Function BravoHotelGame.BravoHotelCharacter.OnDamaged // (Final|Native|Protected) // @ game+0x1ec0780
	void OnConditionStarted(enum class ECharacterConditionType NewCondition); // Function BravoHotelGame.BravoHotelCharacter.OnConditionStarted // (Final|Native|Public) // @ game+0x1ec0700
	void OnConditionEnded(enum class ECharacterConditionType NewCondition); // Function BravoHotelGame.BravoHotelCharacter.OnConditionEnded // (Final|Native|Public) // @ game+0x1ec0680
	void OnCompleteActiveSkillDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnCompleteActiveSkillDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnCheckSupplyCost__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnCheckSupplyCost__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnCharacterGroundStateChange__DelegateSignature(enum class ECharacterGroundState State); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnCharacterGroundStateChange__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnChangeWeaponAttachments(); // Function BravoHotelGame.BravoHotelCharacter.OnChangeWeaponAttachments // (Final|Native|Public) // @ game+0x1ec05a0
	void OnChangeTeleportState(bool IsStart); // Function BravoHotelGame.BravoHotelCharacter.OnChangeTeleportState // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec0510
	void OnChangeProjectilePredictPath__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangeProjectilePredictPath__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnChangeFireType__DelegateSignature(enum class EFireType PreFireType, enum class EFireType NewFireType); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangeFireType__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnChangeEquipWeaponStateIntheWater(bool bState); // Function BravoHotelGame.BravoHotelCharacter.OnChangeEquipWeaponStateIntheWater // (Final|Native|Public) // @ game+0x1ec0480
	void OnChangeDetectedItems__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangeDetectedItems__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnChangedDediSettings(enum class ESettingType SettingType, float Value); // Function BravoHotelGame.BravoHotelCharacter.OnChangedDediSettings // (Final|Native|Public) // @ game+0x1ec05c0
	void OnChangeCurrentWeapon(); // Function BravoHotelGame.BravoHotelCharacter.OnChangeCurrentWeapon // (Final|Native|Private) // @ game+0x1ec0460
	void OnChangeCharacterState__DelegateSignature(enum class ECharacterState& StateType); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangeCharacterState__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x23a3b60
	void OnCameraViewModeChanged__DelegateSignature(bool bIsThirdPerson); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnCameraViewModeChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnBoxChanged(); // Function BravoHotelGame.BravoHotelCharacter.OnBoxChanged // (Final|Native|Public) // @ game+0x1eb3150
	void OnBlueZoneFollowingChanged(struct AActor* Checker, bool bIsFollowing); // Function BravoHotelGame.BravoHotelCharacter.OnBlueZoneFollowingChanged // (Final|Native|Protected) // @ game+0x1ec0390
	void OnBeginStartReady(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginStartReady // (Final|Native|Public) // @ game+0x1ec0370
	void OnBeginPassenger(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginPassenger // (Final|Native|Public) // @ game+0x1ec0350
	void OnBeginParachuting(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginParachuting // (Final|Native|Public) // @ game+0x1ec0330
	void OnBeginLadder(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginLadder // (Final|Native|Public) // @ game+0x1ec0310
	void OnBeginKnockout(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginKnockout // (Final|Native|Public) // @ game+0x1ec02f0
	void OnBeginInAircraftCinematic(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginInAircraftCinematic // (Final|Native|Public) // @ game+0x1ec02d0
	void OnBeginInAircraft(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginInAircraft // (Final|Native|Public) // @ game+0x1ec02b0
	void OnBeginEndReady(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginEndReady // (Final|Native|Public) // @ game+0x1ec0290
	void OnBeginDriverPossessedPawn(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginDriverPossessedPawn // (Final|Native|Public) // @ game+0x1ec0270
	void OnBeginDriver(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginDriver // (Final|Native|Public) // @ game+0x1ec0250
	void OnBeginDescent(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginDescent // (Final|Native|Public) // @ game+0x1ec0230
	void OnBeginDeath(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginDeath // (Final|Native|Public) // @ game+0x1ec0210
	void OnBeginCriticalTime(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginCriticalTime // (Final|Native|Public) // @ game+0x1ec01f0
	void OnBeginBattle(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginBattle // (Final|Native|Public) // @ game+0x1ec01d0
	void OnBattleRoyalStateChanged(enum class EBattleRoyaleState PrevState, enum class EBattleRoyaleState CurrentState); // Function BravoHotelGame.BravoHotelCharacter.OnBattleRoyalStateChanged // (Final|Native|Public) // @ game+0x1ec0110
	void OnAttackOtherCharacterWithRangedWeapon__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnAttackOtherCharacterWithRangedWeapon__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnAnyUpdateState(struct UStateMachineComponent* Context, struct FName WithStateName, char WithStateID, float WithStateTime); // Function BravoHotelGame.BravoHotelCharacter.OnAnyUpdateState // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ebffd0
	void OnAnyExitState(struct UStateMachineComponent* Context, struct FName WithStateName, char WithStateID); // Function BravoHotelGame.BravoHotelCharacter.OnAnyExitState // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ebfed0
	void OnAnyBeginState(struct UStateMachineComponent* Context, struct FName WithStateName, char WithStateID, char WithPrevious); // Function BravoHotelGame.BravoHotelCharacter.OnAnyBeginState // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ebfd90
	void OnAnimInitialized(); // Function BravoHotelGame.BravoHotelCharacter.OnAnimInitialized // (Final|Native|Protected) // @ game+0x1ebfd70
	void OnAirCraftDelegate__DelegateSignature(bool State); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnAirCraftDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void NextParkourTestComponent(); // Function BravoHotelGame.BravoHotelCharacter.NextParkourTestComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x151b910
	void NeedCheckCurrentBuff(); // Function BravoHotelGame.BravoHotelCharacter.NeedCheckCurrentBuff // (Final|Native|Public) // @ game+0x1ebfd50
	void MultiEndAppearingVehicle(struct ABravoHotelVehicle* TargetVehicle, struct UObject* TargetClass, struct FTransform TargetTransform); // Function BravoHotelGame.BravoHotelCharacter.MultiEndAppearingVehicle // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x1ebe7c0
	void MultiDisappearingVehicle(struct ABravoHotelVehicle* TargetVehicle); // Function BravoHotelGame.BravoHotelCharacter.MultiDisappearingVehicle // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1ebe730
	void MulticastWindowBreaching(); // Function BravoHotelGame.BravoHotelCharacter.MulticastWindowBreaching // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1ebfd30
	void MulticastUpdateRagdollVariables(struct FVector NewRagdollVelocity, struct FVector NewRagdollLocation, struct FVector NewActorLocation); // Function BravoHotelGame.BravoHotelCharacter.MulticastUpdateRagdollVariables // (Net|Native|Event|NetMulticast|Protected|HasDefaults|NetValidate) // @ game+0x1ebfba0
	void MulticastTakePointDamage(struct FRepPointDamageInfo DamageInfo); // Function BravoHotelGame.BravoHotelCharacter.MulticastTakePointDamage // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1ebfad0
	void MulticastStopMontage(struct UAnimMontage* AnimMontage, float BlendTime); // Function BravoHotelGame.BravoHotelCharacter.MulticastStopMontage // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x1ebfa00
	void MulticastSimulatedTakeDamage(struct FRepSimulatedTakeDamageInfo RepSimulatedInfo); // Function BravoHotelGame.BravoHotelCharacter.MulticastSimulatedTakeDamage // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1ebf950
	void MulticastSimulatedHittedDamage(struct FRepSimulatedHittedDamage RepSimulatedInfo); // Function BravoHotelGame.BravoHotelCharacter.MulticastSimulatedHittedDamage // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1ebf8b0
	void MulticastSetInteractiveShpere(bool bActive); // Function BravoHotelGame.BravoHotelCharacter.MulticastSetInteractiveShpere // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1ebf820
	void MulticastRewindMontage(struct UAnimMontage* AnimMontage); // Function BravoHotelGame.BravoHotelCharacter.MulticastRewindMontage // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x1ebf790
	void MulticastRemoveAttachedUsableItem(); // Function BravoHotelGame.BravoHotelCharacter.MulticastRemoveAttachedUsableItem // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x1ebf770
	void MulticastPlayMontage(bool bPlayOnLocalClient, struct UAnimMontage* AnimMontageTPP, struct UAnimMontage* AnimMontageFPP); // Function BravoHotelGame.BravoHotelCharacter.MulticastPlayMontage // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x1ebf660
	void MulticastPlayCharacterSound(enum class ECharacterAudioEventType AudioEventType, char TypeIndex); // Function BravoHotelGame.BravoHotelCharacter.MulticastPlayCharacterSound // (Net|Native|Event|NetMulticast|Public) // @ game+0x1ebf5a0
	void MulticastObjectDestruction(struct ADestructibleActor* DestructibleActor, struct UDestructibleComponent* DestructibleComponent, struct FVector Location, float Damage, float EffectRange); // Function BravoHotelGame.BravoHotelCharacter.MulticastObjectDestruction // (Net|Native|Event|NetMulticast|Public|HasDefaults) // @ game+0x1ebf410
	void MulticastInAircraft(struct AActor* AircraftFlight, float AttachYaw); // Function BravoHotelGame.BravoHotelCharacter.MulticastInAircraft // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1ebf340
	void MulticastHandleDamageToVehicleDestructibleComponent(struct UBravoHotelDestructibleComponent* DestructibleComponent, struct FHitResult HitDetails, struct FVector ImpactVelocity); // Function BravoHotelGame.BravoHotelCharacter.MulticastHandleDamageToVehicleDestructibleComponent // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x1ebf190
	void MulticastExceptOwnerStopAnimMontage(struct UAnimMontage* MontageToStopTPP, struct UAnimMontage* MontageToStopFPP); // Function BravoHotelGame.BravoHotelCharacter.MulticastExceptOwnerStopAnimMontage // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1ebf0c0
	void MulticastEndCombine(bool bSuccess, struct FName TargetRecipe); // Function BravoHotelGame.BravoHotelCharacter.MulticastEndCombine // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x1ebeff0
	void MulticastEndCastingBackpackItem(bool bSuccess, struct FName ItemKey); // Function BravoHotelGame.BravoHotelCharacter.MulticastEndCastingBackpackItem // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x1ebef20
	void MulticastDoorObjectDestruction(struct AActor* DoorActor, struct FRadialDamageEvent DamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.MulticastDoorObjectDestruction // (Net|Native|Event|NetMulticast|Public) // @ game+0x1ebeda0
	void MulticastDoorBreaching(struct FVector_NetQuantize BreachingParticleLocation, struct FVector_NetQuantize BreachingParticleRotation); // Function BravoHotelGame.BravoHotelCharacter.MulticastDoorBreaching // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1ebecc0
	void MulticastBravoHotelHIDestructionObejct(struct UBravoHotelHIDestructibleComponent* BravoHotelDestructibleComponent, float Damage, struct FRadialDamageEvent DamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.MulticastBravoHotelHIDestructionObejct // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1ebeb00
	void MulticastBravoHotelDestructionObejct(struct UBravoHotelDestructibleComponent* BravoHotelDestructibleComponent, float Damage, struct FRadialDamageEvent DamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.MulticastBravoHotelDestructionObejct // (Net|Native|Event|NetMulticast|Public) // @ game+0x1ebe940
	void MultiAppearingVehicle(struct ABravoHotelVehicle* TargetVehicle, struct UObject* TargetClass, struct FTransform TargetTransform); // Function BravoHotelGame.BravoHotelCharacter.MultiAppearingVehicle // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x1ebe5b0
	void MuiticastSetUpdateRenderSettings(bool bValue); // Function BravoHotelGame.BravoHotelCharacter.MuiticastSetUpdateRenderSettings // (Net|Native|Event|NetMulticast|Public) // @ game+0x1ebe520
	void MoveRightOnDescent(float DeltaTime, float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.MoveRightOnDescent // (Final|Native|Public) // @ game+0x1ebe460
	void MoveRight(float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.MoveRight // (Final|Native|Public) // @ game+0x1ebe3e0
	void MoveForwardOnDescent(float DeltaTime, float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.MoveForwardOnDescent // (Final|Native|Public) // @ game+0x1ebe320
	void MoveForward(float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.MoveForward // (Final|Native|Public) // @ game+0x1ebe2a0
	void MarkBrokenEquipmentNeedToSpawn(int32_t Equipmentlevel, struct FVector& DamageImpulseDir, enum class EWearableItemType& EquipmentType); // Function BravoHotelGame.BravoHotelCharacter.MarkBrokenEquipmentNeedToSpawn // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x1ebe180
	void ManageRotation(); // Function BravoHotelGame.BravoHotelCharacter.ManageRotation // (Final|Native|Public) // @ game+0x1ebe160
	void ManageMovementMode(); // Function BravoHotelGame.BravoHotelCharacter.ManageMovementMode // (Final|Native|Public) // @ game+0x1ebe140
	void ManageDebuffState(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.ManageDebuffState // (Final|Native|Protected) // @ game+0x1ebe0c0
	void LockMovementInput(); // Function BravoHotelGame.BravoHotelCharacter.LockMovementInput // (Final|Native|Public) // @ game+0x1ebe0a0
	void LoadMouseSensitivty(); // Function BravoHotelGame.BravoHotelCharacter.LoadMouseSensitivty // (Final|Native|Public|BlueprintCallable) // @ game+0x1ebe080
	void KillPerkLevelUpTimer(float DelayTime, int32_t UpCount, int32_t KillCount); // Function BravoHotelGame.BravoHotelCharacter.KillPerkLevelUpTimer // (Final|Native|Public) // @ game+0x1ebdf70
	void KillPerkLevelUpReady(int32_t KillCount); // Function BravoHotelGame.BravoHotelCharacter.KillPerkLevelUpReady // (Final|Native|Public) // @ game+0x1ebdef0
	void KillPerkLevelUp(int32_t UpCount, int32_t KillCount); // Function BravoHotelGame.BravoHotelCharacter.KillPerkLevelUp // (Final|Native|Public) // @ game+0x1ebde30
	void KillGivePerkEvent(int32_t KillCount); // Function BravoHotelGame.BravoHotelCharacter.KillGivePerkEvent // (Event|Public|BlueprintEvent) // @ game+0x23a3b60
	void K2_UpdateMutable_PreviewPawn(bool bChangeGender); // Function BravoHotelGame.BravoHotelCharacter.K2_UpdateMutable_PreviewPawn // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x23a3b60
	void K2_OnStartProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function BravoHotelGame.BravoHotelCharacter.K2_OnStartProne // (Event|Public|BlueprintEvent) // @ game+0x23a3b60
	void K2_OnGoParachute(); // Function BravoHotelGame.BravoHotelCharacter.K2_OnGoParachute // (Event|Public|BlueprintEvent) // @ game+0x23a3b60
	void K2_OnEndProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function BravoHotelGame.BravoHotelCharacter.K2_OnEndProne // (Event|Public|BlueprintEvent) // @ game+0x23a3b60
	void K2_OnCameraViewModeChanged(bool bIsThirdPerson); // Function BravoHotelGame.BravoHotelCharacter.K2_OnCameraViewModeChanged // (Event|Public|BlueprintEvent) // @ game+0x23a3b60
	void K2_OnAddControllerYawInput(float Val); // Function BravoHotelGame.BravoHotelCharacter.K2_OnAddControllerYawInput // (Event|Public|BlueprintEvent) // @ game+0x23a3b60
	struct FPerkLevelUpData K2_GetPerkLevelUpData(); // Function BravoHotelGame.BravoHotelCharacter.K2_GetPerkLevelUpData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebddc0
	struct FPerkDeckData K2_GetPerkDeckData(); // Function BravoHotelGame.BravoHotelCharacter.K2_GetPerkDeckData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebdd50
	struct FPerkLevelUpElement K2_GetPerkClassLevelUpElement(int32_t Level); // Function BravoHotelGame.BravoHotelCharacter.K2_GetPerkClassLevelUpElement // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebdb80
	void K2_FPSK_OnStartADS(); // Function BravoHotelGame.BravoHotelCharacter.K2_FPSK_OnStartADS // (Event|Public|BlueprintEvent) // @ game+0x23a3b60
	void K2_FPSK_OnEndADS(); // Function BravoHotelGame.BravoHotelCharacter.K2_FPSK_OnEndADS // (Event|Public|BlueprintEvent) // @ game+0x23a3b60
	void K2_EnterSceneOfWin(); // Function BravoHotelGame.BravoHotelCharacter.K2_EnterSceneOfWin // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x23a3b60
	void K2_Cheat_ToggleCharacterDebugCamera(); // Function BravoHotelGame.BravoHotelCharacter.K2_Cheat_ToggleCharacterDebugCamera // (Event|Public|BlueprintEvent) // @ game+0x23a3b60
	bool IsWantsToJetpackAim(); // Function BravoHotelGame.BravoHotelCharacter.IsWantsToJetpackAim // (Final|Native|Public|Const) // @ game+0x1ebdb50
	bool IsWantsToJetpack(); // Function BravoHotelGame.BravoHotelCharacter.IsWantsToJetpack // (Final|Native|Public|Const) // @ game+0x1ebdb20
	bool IsViewPointInWaterVolume(); // Function BravoHotelGame.BravoHotelCharacter.IsViewPointInWaterVolume // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebdaf0
	bool IsVehicleState(enum class ECharacterState State); // Function BravoHotelGame.BravoHotelCharacter.IsVehicleState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebda60
	bool IsVehiclePassenger(); // Function BravoHotelGame.BravoHotelCharacter.IsVehiclePassenger // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebda30
	bool IsVehicleDriver(); // Function BravoHotelGame.BravoHotelCharacter.IsVehicleDriver // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebda00
	bool IsThirdPerson(); // Function BravoHotelGame.BravoHotelCharacter.IsThirdPerson // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd9d0
	bool IsSwimming(); // Function BravoHotelGame.BravoHotelCharacter.IsSwimming // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd9a0
	bool IsSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.IsSteadyAim // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd970
	bool IsSprinting(); // Function BravoHotelGame.BravoHotelCharacter.IsSprinting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd940
	bool IsShowingLandingPosition(); // Function BravoHotelGame.BravoHotelCharacter.IsShowingLandingPosition // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebd910
	bool IsReviving(); // Function BravoHotelGame.BravoHotelCharacter.IsReviving // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd890
	bool IsResuscitating(); // Function BravoHotelGame.BravoHotelCharacter.IsResuscitating // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd810
	bool IsRecommendedPerkDeck(struct FName& PerkName); // Function BravoHotelGame.BravoHotelCharacter.IsRecommendedPerkDeck // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd770
	bool IsReadyToSnipe(); // Function BravoHotelGame.BravoHotelCharacter.IsReadyToSnipe // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebd750
	bool IsProneStateTransitioning(); // Function BravoHotelGame.BravoHotelCharacter.IsProneStateTransitioning // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd720
	bool IsProne(); // Function BravoHotelGame.BravoHotelCharacter.IsProne // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd6f0
	bool IsPlayingPickupAnim(); // Function BravoHotelGame.BravoHotelCharacter.IsPlayingPickupAnim // (Final|Native|Public|Const) // @ game+0x1ebd6c0
	bool IsPlayingEquipAnim(); // Function BravoHotelGame.BravoHotelCharacter.IsPlayingEquipAnim // (Final|Native|Public|Const) // @ game+0x1ebd690
	bool IsPlayingCastingAnim(); // Function BravoHotelGame.BravoHotelCharacter.IsPlayingCastingAnim // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd660
	bool IsPlayerReplayViewMode(); // Function BravoHotelGame.BravoHotelCharacter.IsPlayerReplayViewMode // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebd630
	bool IsPendingKickDoor(); // Function BravoHotelGame.BravoHotelCharacter.IsPendingKickDoor // (Final|Native|Public|Const) // @ game+0x1ebd600
	bool IsOverlapWaterVolume(); // Function BravoHotelGame.BravoHotelCharacter.IsOverlapWaterVolume // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd5d0
	bool IsOnLadder(); // Function BravoHotelGame.BravoHotelCharacter.IsOnLadder // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebd5a0
	bool IsOnIceLand(); // Function BravoHotelGame.BravoHotelCharacter.IsOnIceLand // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd570
	bool IsOnDescent(); // Function BravoHotelGame.BravoHotelCharacter.IsOnDescent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd540
	bool IsMaxLevel(); // Function BravoHotelGame.BravoHotelCharacter.IsMaxLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebd510
	bool IsMale(); // Function BravoHotelGame.BravoHotelCharacter.IsMale // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd4e0
	bool IsLockedInventory(); // Function BravoHotelGame.BravoHotelCharacter.IsLockedInventory // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd4b0
	bool IsLocalPlayerControlledPawn(); // Function BravoHotelGame.BravoHotelCharacter.IsLocalPlayerControlledPawn // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd3f0
	bool IsLocallyPlaying(bool bIncludeSpectedPawn); // Function BravoHotelGame.BravoHotelCharacter.IsLocallyPlaying // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd420
	bool IsLandStop(); // Function BravoHotelGame.BravoHotelCharacter.IsLandStop // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd3c0
	bool IsKicking(); // Function BravoHotelGame.BravoHotelCharacter.IsKicking // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd390
	bool IsJumping(); // Function BravoHotelGame.BravoHotelCharacter.IsJumping // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd360
	bool IsJumpAttacking(); // Function BravoHotelGame.BravoHotelCharacter.IsJumpAttacking // (Final|Native|Public|Const) // @ game+0x1ebd330
	bool IsInVehicle(); // Function BravoHotelGame.BravoHotelCharacter.IsInVehicle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd300
	bool IsInstancedFoliageActor(struct AActor* TargetActor); // Function BravoHotelGame.BravoHotelCharacter.IsInstancedFoliageActor // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x23a3b60
	bool IsInSkydiving(); // Function BravoHotelGame.BravoHotelCharacter.IsInSkydiving // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd2d0
	bool IsInParachute(); // Function BravoHotelGame.BravoHotelCharacter.IsInParachute // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd2a0
	bool IsInForceField(); // Function BravoHotelGame.BravoHotelCharacter.IsInForceField // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebd270
	bool IsInDoor(); // Function BravoHotelGame.BravoHotelCharacter.IsInDoor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd240
	bool IsInAircraft(); // Function BravoHotelGame.BravoHotelCharacter.IsInAircraft // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd210
	bool IsHipShot(); // Function BravoHotelGame.BravoHotelCharacter.IsHipShot // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd1e0
	bool IsFoundVehicleSearch(); // Function BravoHotelGame.BravoHotelCharacter.IsFoundVehicleSearch // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebd1b0
	bool IsFoundSearchInstinct(); // Function BravoHotelGame.BravoHotelCharacter.IsFoundSearchInstinct // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebd180
	bool IsFollowReplayViewMode(); // Function BravoHotelGame.BravoHotelCharacter.IsFollowReplayViewMode // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebd150
	bool IsFirstPerson(); // Function BravoHotelGame.BravoHotelCharacter.IsFirstPerson // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd120
	bool IsFiring(); // Function BravoHotelGame.BravoHotelCharacter.IsFiring // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd0f0
	bool IsEnoughtSupplyGold(); // Function BravoHotelGame.BravoHotelCharacter.IsEnoughtSupplyGold // (Final|Native|Public|BlueprintCallable) // @ game+0x1ebd0c0
	bool IsEnemyFor(struct ABravoHotelPlayerController* OtherPlayerController); // Function BravoHotelGame.BravoHotelCharacter.IsEnemyFor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebd030
	bool IsEnemyCharacter(struct ABravoHotelCharacter* OtherCharacter); // Function BravoHotelGame.BravoHotelCharacter.IsEnemyCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebcfa0
	bool IsEnableSpawnSupplyBox(struct AActor* TargetActor, struct FString& OutResult); // Function BravoHotelGame.BravoHotelCharacter.IsEnableSpawnSupplyBox // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x23a3b60
	bool IsDisconnected(); // Function BravoHotelGame.BravoHotelCharacter.IsDisconnected // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebcf70
	bool IsCustomBuoyancySwimMode(); // Function BravoHotelGame.BravoHotelCharacter.IsCustomBuoyancySwimMode // (Final|Native|Public|Const) // @ game+0x1ebcf40
	bool IsCurrentThrowingWeapon(); // Function BravoHotelGame.BravoHotelCharacter.IsCurrentThrowingWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebcf10
	bool IsControllerTargetPawn(); // Function BravoHotelGame.BravoHotelCharacter.IsControllerTargetPawn // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebcee0
	bool IsCondition(enum class ECharacterConditionType ConditionType); // Function BravoHotelGame.BravoHotelCharacter.IsCondition // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebce50
	bool IsClimbing(); // Function BravoHotelGame.BravoHotelCharacter.IsClimbing // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebce20
	bool IsChargingGauge(); // Function BravoHotelGame.BravoHotelCharacter.IsChargingGauge // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebcdf0
	bool IsCharacterPositionUnderWaterSurface(); // Function BravoHotelGame.BravoHotelCharacter.IsCharacterPositionUnderWaterSurface // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebcdc0
	bool IsChangingWeapon(); // Function BravoHotelGame.BravoHotelCharacter.IsChangingWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebcd90
	bool IsCastingBackpackItem(); // Function BravoHotelGame.BravoHotelCharacter.IsCastingBackpackItem // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebcd60
	bool IsBuff(enum class ECharacterBuffType BuffType); // Function BravoHotelGame.BravoHotelCharacter.IsBuff // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebccd0
	bool IsBeginner(); // Function BravoHotelGame.BravoHotelCharacter.IsBeginner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebcca0
	bool IsAppearanceReplicated(); // Function BravoHotelGame.BravoHotelCharacter.IsAppearanceReplicated // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebcc70
	bool IsAOS(); // Function BravoHotelGame.BravoHotelCharacter.IsAOS // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebca20
	bool IsAlive(); // Function BravoHotelGame.BravoHotelCharacter.IsAlive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebcc40
	bool IsAirWalking(); // Function BravoHotelGame.BravoHotelCharacter.IsAirWalking // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebcc10
	bool IsADS(); // Function BravoHotelGame.BravoHotelCharacter.IsADS // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebc9f0
	bool IsActiveLeanDamageBuff(); // Function BravoHotelGame.BravoHotelCharacter.IsActiveLeanDamageBuff // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebcbe0
	bool IsActiveHeartBeatSensor(); // Function BravoHotelGame.BravoHotelCharacter.IsActiveHeartBeatSensor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebcbb0
	bool IsActiveCastingUIWithType(enum class ECastingUIType& InCastingUIType); // Function BravoHotelGame.BravoHotelCharacter.IsActiveCastingUIWithType // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1ebcb10
	bool IsActiveCastingUI(); // Function BravoHotelGame.BravoHotelCharacter.IsActiveCastingUI // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebcae0
	bool IsActiveAmplifier(); // Function BravoHotelGame.BravoHotelCharacter.IsActiveAmplifier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebcab0
	bool IsActionWithWeapon(); // Function BravoHotelGame.BravoHotelCharacter.IsActionWithWeapon // (Final|Native|Public|BlueprintCallable) // @ game+0x1ebca80
	bool IsABot(); // Function BravoHotelGame.BravoHotelCharacter.IsABot // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebc9c0
	bool IsAbleUltimate(); // Function BravoHotelGame.BravoHotelCharacter.IsAbleUltimate // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebca50
	void InternalSimulatedTakeDamage(struct FRepSimulatedTakeDamageInfo& RepSimulatedInfo); // Function BravoHotelGame.BravoHotelCharacter.InternalSimulatedTakeDamage // (Final|Native|Public|HasOutParms) // @ game+0x1ebc900
	void InternalSimulatedHittedDamage(struct FRepHitDamageInfo& RepDamageInfo); // Function BravoHotelGame.BravoHotelCharacter.InternalSimulatedHittedDamage // (Final|Native|Private|HasOutParms) // @ game+0x1ebc840
	void InternalJetpackBooster(bool bNewJackpack); // Function BravoHotelGame.BravoHotelCharacter.InternalJetpackBooster // (Final|Native|Public) // @ game+0x1ebc7b0
	void InternalJetpackAim(bool bNewJetpackAim); // Function BravoHotelGame.BravoHotelCharacter.InternalJetpackAim // (Final|Native|Public) // @ game+0x1ebc720
	void InternalInAircraft(struct AActor* AircraftFlight, float AttachYaw, bool bCheckCinematic); // Function BravoHotelGame.BravoHotelCharacter.InternalInAircraft // (Final|Native|Public) // @ game+0x1ebc610
	void InitTimeline(); // Function BravoHotelGame.BravoHotelCharacter.InitTimeline // (Final|Native|Public) // @ game+0x1ebc5d0
	void InitRecordingCharacter(); // Function BravoHotelGame.BravoHotelCharacter.InitRecordingCharacter // (Event|Protected|BlueprintEvent) // @ game+0x23a3b60
	void InitializeStateAtCriticalTime(); // Function BravoHotelGame.BravoHotelCharacter.InitializeStateAtCriticalTime // (Final|Native|Public) // @ game+0x1ebc5f0
	void InitCustomizableObjectInstance(); // Function BravoHotelGame.BravoHotelCharacter.InitCustomizableObjectInstance // (Native|Event|Public|BlueprintEvent) // @ game+0x1ebc5b0
	void HideSkillMap(); // Function BravoHotelGame.BravoHotelCharacter.HideSkillMap // (Final|Native|Public) // @ game+0x1ebc590
	void HideInteractive(); // Function BravoHotelGame.BravoHotelCharacter.HideInteractive // (Final|Native|Public|BlueprintCallable) // @ game+0x1ebc570
	void HideHUDbySequence(); // Function BravoHotelGame.BravoHotelCharacter.HideHUDbySequence // (Final|Native|Public|BlueprintCallable) // @ game+0x1ebc550
	void HealthTick(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.HealthTick // (Final|Native|Public) // @ game+0x1ebc4d0
	bool HasWeaponOfType(enum class EWeaponType WeaponType); // Function BravoHotelGame.BravoHotelCharacter.HasWeaponOfType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebc440
	void HandleDamageToVehicleDestructibleComponent(struct UBravoHotelDestructibleComponent* DestructibleComponent, struct FHitResult HitDetails, struct FVector ImpactVelocity); // Function BravoHotelGame.BravoHotelCharacter.HandleDamageToVehicleDestructibleComponent // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1ebc290
	void GoParachute(); // Function BravoHotelGame.BravoHotelCharacter.GoParachute // (Final|Native|Public) // @ game+0x1ebc270
	void GoIncapacitated(bool bCriticalTime, struct FDamageInstigatorInfo& DamageInstigatorInfo); // Function BravoHotelGame.BravoHotelCharacter.GoIncapacitated // (Final|Native|Public|HasOutParms) // @ game+0x1ebc150
	void GoForceParachute(); // Function BravoHotelGame.BravoHotelCharacter.GoForceParachute // (Final|Native|Public) // @ game+0x1ebc130
	void GiveEquipment(); // Function BravoHotelGame.BravoHotelCharacter.GiveEquipment // (Final|Native|Public|BlueprintCallable) // @ game+0x1ebc110
	int32_t GetZeroPointDistance(); // Function BravoHotelGame.BravoHotelCharacter.GetZeroPointDistance // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebc0e0
	int32_t GetWearableRarity(enum class EWearableItemType WearableItemType); // Function BravoHotelGame.BravoHotelCharacter.GetWearableRarity // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebc050
	struct FString GetWearableItemName(enum class EWearableItemType SlotType); // Function BravoHotelGame.BravoHotelCharacter.GetWearableItemName // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebbfa0
	struct FName GetWeaponSocketNameBySlot(int32_t SlotIndex); // Function BravoHotelGame.BravoHotelCharacter.GetWeaponSocketNameBySlot // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebbf10
	enum class EWaterDepthType GetWaterDepthType(); // Function BravoHotelGame.BravoHotelCharacter.GetWaterDepthType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebbef0
	float GetViewPitch(); // Function BravoHotelGame.BravoHotelCharacter.GetViewPitch // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebbec0
	struct ABravoHotelLadder* GetUsingLadder(); // Function BravoHotelGame.BravoHotelCharacter.GetUsingLadder // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebbe90
	int32_t GetUsingBackpackItemIndex(); // Function BravoHotelGame.BravoHotelCharacter.GetUsingBackpackItemIndex // (Final|Native|Public|Const) // @ game+0x1ebbe70
	int32_t GetUniquePlayerId(); // Function BravoHotelGame.BravoHotelCharacter.GetUniquePlayerId // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebbe40
	enum class EGrenadeThrowingType GetThrowingType(); // Function BravoHotelGame.BravoHotelCharacter.GetThrowingType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebbe10
	struct UAnimMontage* GetThrowingGrenade(enum class EGrenadeThrowingType Type); // Function BravoHotelGame.BravoHotelCharacter.GetThrowingGrenade // (Final|Native|Public|Const) // @ game+0x1ebbd80
	float GetTeamPositionWidgetHeight(bool FromBottom); // Function BravoHotelGame.BravoHotelCharacter.GetTeamPositionWidgetHeight // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebbce0
	struct UUserWidget* GetTeamPositionWidget(); // Function BravoHotelGame.BravoHotelCharacter.GetTeamPositionWidget // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebbcb0
	bool GetTargetHealthAfterHealing(float& OutTargetHealth); // Function BravoHotelGame.BravoHotelCharacter.GetTargetHealthAfterHealing // (Final|Native|Public|HasOutParms) // @ game+0x1ebbc00
	float GetTargetHealth(); // Function BravoHotelGame.BravoHotelCharacter.GetTargetHealth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebbbd0
	float GetSurfaceDegrees(); // Function BravoHotelGame.BravoHotelCharacter.GetSurfaceDegrees // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebbba0
	float GetStateTime(); // Function BravoHotelGame.BravoHotelCharacter.GetStateTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebbb70
	enum class ECharacterState GetState(); // Function BravoHotelGame.BravoHotelCharacter.GetState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebbb40
	struct UBravoHotelSmartPingSystem* GetSmartPingSystem(); // Function BravoHotelGame.BravoHotelCharacter.GetSmartPingSystem // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x23a3b60
	struct APlayerState* GetSavedPlayerState(); // Function BravoHotelGame.BravoHotelCharacter.GetSavedPlayerState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebbb10
	struct TArray<struct ACharacter*> GetRevivers(); // Function BravoHotelGame.BravoHotelCharacter.GetRevivers // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebbae0
	struct TArray<struct ACharacter*> GetResuscitaters(); // Function BravoHotelGame.BravoHotelCharacter.GetResuscitaters // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebbab0
	float GetReadyToSnipeGauge(); // Function BravoHotelGame.BravoHotelCharacter.GetReadyToSnipeGauge // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebba90
	enum class ECharacterState GetPreviousState(); // Function BravoHotelGame.BravoHotelCharacter.GetPreviousState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebba60
	struct TScriptInterface<IMaterialControllableInterface> GetPostProcessMagneticHit(); // Function BravoHotelGame.BravoHotelCharacter.GetPostProcessMagneticHit // (Final|Native|Public) // @ game+0x1ebba20
	struct TScriptInterface<IMaterialControllableInterface> GetPostProcessMagneticDamage(); // Function BravoHotelGame.BravoHotelCharacter.GetPostProcessMagneticDamage // (Final|Native|Public) // @ game+0x1ebb9e0
	struct TScriptInterface<IMaterialControllableInterface> GetPostProcessHit(); // Function BravoHotelGame.BravoHotelCharacter.GetPostProcessHit // (Final|Native|Public) // @ game+0x1ebb9a0
	struct TScriptInterface<IMaterialControllableInterface> GetPostProcessDust(); // Function BravoHotelGame.BravoHotelCharacter.GetPostProcessDust // (Final|Native|Public) // @ game+0x1ebb960
	struct TScriptInterface<IMaterialControllableInterface> GetPostProcessBlood(); // Function BravoHotelGame.BravoHotelCharacter.GetPostProcessBlood // (Final|Native|Public) // @ game+0x1ebb920
	struct FString GetPlayerName(); // Function BravoHotelGame.BravoHotelCharacter.GetPlayerName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb8a0
	struct FAnimSlot GetPickupAnimSlot(); // Function BravoHotelGame.BravoHotelCharacter.GetPickupAnimSlot // (Final|Native|Public|Const) // @ game+0x1ebb870
	void GetPerkOnStart(); // Function BravoHotelGame.BravoHotelCharacter.GetPerkOnStart // (Final|Native|Public) // @ game+0x1ebb850
	struct FName GetPerkNameByBuffName(struct FName BuffName); // Function BravoHotelGame.BravoHotelCharacter.GetPerkNameByBuffName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb7c0
	int32_t GetPerkIDByBuffName(struct FName BuffName); // Function BravoHotelGame.BravoHotelCharacter.GetPerkIDByBuffName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb730
	int32_t GetPerkClassLevel(); // Function BravoHotelGame.BravoHotelCharacter.GetPerkClassLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb700
	struct ABravoHotelWeaponBase* GetPendingWeapon(); // Function BravoHotelGame.BravoHotelCharacter.GetPendingWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb6d0
	int32_t GetParkourTestIndexKey(); // Function BravoHotelGame.BravoHotelCharacter.GetParkourTestIndexKey // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1508350
	struct ABravoHotelWaterPhysicsVolume* GetOverlapWaterVolume(); // Function BravoHotelGame.BravoHotelCharacter.GetOverlapWaterVolume // (Final|Native|Public|BlueprintCallable) // @ game+0x1ebb6b0
	float GetOverHeal(); // Function BravoHotelGame.BravoHotelCharacter.GetOverHeal // (Final|Native|Public|Const) // @ game+0x1ebb680
	struct UBravoHotelVehicleSeatComponent* GetOccupyingVehicleSeat(); // Function BravoHotelGame.BravoHotelCharacter.GetOccupyingVehicleSeat // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb650
	struct ABravoHotelVehicle* GetOccupyingVehicle(); // Function BravoHotelGame.BravoHotelCharacter.GetOccupyingVehicle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb620
	int32_t GetNextUltimateUnlockLevel(int32_t UltimateLevel); // Function BravoHotelGame.BravoHotelCharacter.GetNextUltimateUnlockLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb590
	struct UCustomizableObjectInstance* GetMutableObjectInstance(); // Function BravoHotelGame.BravoHotelCharacter.GetMutableObjectInstance // (Final|Native|Public|Const) // @ game+0x1ebb560
	struct UCustomizableObjectInstance* GetMutableCloneInstance(); // Function BravoHotelGame.BravoHotelCharacter.GetMutableCloneInstance // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebb530
	float GetMeleeAttackDamage(); // Function BravoHotelGame.BravoHotelCharacter.GetMeleeAttackDamage // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebb500
	float GetMaxLeanValue(); // Function BravoHotelGame.BravoHotelCharacter.GetMaxLeanValue // (Final|Native|Public) // @ game+0x1ebb4d0
	int32_t GetMaxHealth(); // Function BravoHotelGame.BravoHotelCharacter.GetMaxHealth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb4a0
	enum class ELeanState GetLeanState(); // Function BravoHotelGame.BravoHotelCharacter.GetLeanState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb470
	float GetLeanRotationAngle(); // Function BravoHotelGame.BravoHotelCharacter.GetLeanRotationAngle // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebb440
	float GetLeanDegreeMax(); // Function BravoHotelGame.BravoHotelCharacter.GetLeanDegreeMax // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb410
	float GetLandingTimeRate(float LandingDuration); // Function BravoHotelGame.BravoHotelCharacter.GetLandingTimeRate // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebb380
	float GetLandingPositionDuration(); // Function BravoHotelGame.BravoHotelCharacter.GetLandingPositionDuration // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb360
	struct FVector GetLandingPosition(); // Function BravoHotelGame.BravoHotelCharacter.GetLandingPosition // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1ebb330
	struct ULadderComponent* GetLadderComponent(); // Function BravoHotelGame.BravoHotelCharacter.GetLadderComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb310
	float GetJetpackFuel(); // Function BravoHotelGame.BravoHotelCharacter.GetJetpackFuel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb2e0
	float GetIsFiredRemaining(); // Function BravoHotelGame.BravoHotelCharacter.GetIsFiredRemaining // (Final|Native|Public|Const) // @ game+0x1ebb2b0
	struct ABravoHotelInventoryCharacter* GetInventoryCharacter(); // Function BravoHotelGame.BravoHotelCharacter.GetInventoryCharacter // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x1ebb280
	int32_t GetIconIndex(); // Function BravoHotelGame.BravoHotelCharacter.GetIconIndex // (Final|Native|Public|BlueprintCallable) // @ game+0x1ebb250
	float GetHeartBeatSensorLength(); // Function BravoHotelGame.BravoHotelCharacter.GetHeartBeatSensorLength // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb220
	float GetGoldenTimePercent(); // Function BravoHotelGame.BravoHotelCharacter.GetGoldenTimePercent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb1f0
	struct FString GetGameServerUIDString(); // Function BravoHotelGame.BravoHotelCharacter.GetGameServerUIDString // (Final|Native|Public|BlueprintCallable) // @ game+0x1ebb170
	struct FVector GetFloorLocation(); // Function BravoHotelGame.BravoHotelCharacter.GetFloorLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb130
	struct FRotator GetFixedBaseAimRotation(); // Function BravoHotelGame.BravoHotelCharacter.GetFixedBaseAimRotation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb100
	enum class EFireType GetFireType(); // Function BravoHotelGame.BravoHotelCharacter.GetFireType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb0d0
	float GetFindLandingPositionRadius(); // Function BravoHotelGame.BravoHotelCharacter.GetFindLandingPositionRadius // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb0a0
	struct FVector GetEyeLocation(); // Function BravoHotelGame.BravoHotelCharacter.GetEyeLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb060
	struct FVector GetEyeForwardVector(); // Function BravoHotelGame.BravoHotelCharacter.GetEyeForwardVector // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebb020
	struct ABravoHotelWeaponBase* GetEquippedThrowingWeapon(); // Function BravoHotelGame.BravoHotelCharacter.GetEquippedThrowingWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebaff0
	struct ABravoHotelWeaponBase* GetEquippedMeleeWeapon(); // Function BravoHotelGame.BravoHotelCharacter.GetEquippedMeleeWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebafc0
	int32_t GetDefeatLevel(); // Function BravoHotelGame.BravoHotelCharacter.GetDefeatLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebaf90
	struct FBravoHotelDefaultBalanceData GetDefaultBalanceData(); // Function BravoHotelGame.BravoHotelCharacter.GetDefaultBalanceData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebaeb0
	bool GetDeathAnimMontage(struct UBravoHotelDamageType* DamageTypeClass, bool bLocalHeadShot, struct FAnimSlot& OutAnimSlot, bool& bOutIsForce); // Function BravoHotelGame.BravoHotelCharacter.GetDeathAnimMontage // (Final|Native|Private|HasOutParms) // @ game+0x1ebad20
	struct ABravoHotelWeaponBase* GetCurrentWeapon(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebacf0
	int32_t GetCurrentUltimateLevel(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentUltimateLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebacc0
	enum class EThrowingWeaponState GetCurrentThrowingWeaponState(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentThrowingWeaponState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebac90
	int32_t GetCurrentSelfResuscitationPrice(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentSelfResuscitationPrice // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebac60
	int32_t GetCurrentResuscitationPrice(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentResuscitationPrice // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebac30
	struct ABravoHotelRangedWeapon* GetCurrentRangedWeapon(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentRangedWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebac00
	struct FPerkDeckSelectInfo GetCurrentPerkDeckSelectInfo(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentPerkDeckSelectInfo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebaae0
	struct FName GetCurrentPerkDeck(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentPerkDeck // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebaaa0
	struct UParkourComponent* GetCurrentParkourComponent(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentParkourComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ebaa70
	float GetCurrentMovementModeTime(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentMovementModeTime // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ebaa40
	struct UAkRoomComponent* GetCurrentAkRoomComponent(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentAkRoomComponent // (Final|Native|Public) // @ game+0x1ebaa10
	struct ABravoHotelWeaponBase* GetCurrentAbilityWeapon(); // Function BravoHotelGame.BravoHotelCharacter.GetCurrentAbilityWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eba9e0
	struct ABravoHotelWeaponBase* GetCompareWeaponObjectRef(struct FInventoryItemInfo& ItemInfo); // Function BravoHotelGame.BravoHotelCharacter.GetCompareWeaponObjectRef // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1eba8e0
	struct TArray<struct ABravoHotelCharacter*> GetCharactersInBreachingArea(struct FVector& BreachingForward, struct FVector& BreachingRight, struct FVector& BreachingUp, struct FVector& BreachingLoc); // Function BravoHotelGame.BravoHotelCharacter.GetCharactersInBreachingArea // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x1eba6f0
	float GetCastingRemainTime(); // Function BravoHotelGame.BravoHotelCharacter.GetCastingRemainTime // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1eba6d0
	float GetCastingPercent(); // Function BravoHotelGame.BravoHotelCharacter.GetCastingPercent // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1eba6b0
	struct FInventoryItemInfo GetCastingItemInfo(); // Function BravoHotelGame.BravoHotelCharacter.GetCastingItemInfo // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1eba620
	struct FCastingInfo GetCastingInfo(); // Function BravoHotelGame.BravoHotelCharacter.GetCastingInfo // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1eba5e0
	struct UCameraComponent* GetCamera3P(); // Function BravoHotelGame.BravoHotelCharacter.GetCamera3P // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eba5b0
	struct ABravoHotelPlayerState* GetBravoHotelPlayerState(); // Function BravoHotelGame.BravoHotelCharacter.GetBravoHotelPlayerState // (Final|Native|Public|BlueprintCallable) // @ game+0x1eba580
	struct FString GetAudioConditionState(struct FConditionGroup& Group); // Function BravoHotelGame.BravoHotelCharacter.GetAudioConditionState // (BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1eba470
	void GetAttachedUsableItems(struct USkeletalMeshComponent* TargetParent, struct TArray<struct ABravoHotelAttachedUsableItem*>& OutItems); // Function BravoHotelGame.BravoHotelCharacter.GetAttachedUsableItems // (Final|Native|Protected|HasOutParms) // @ game+0x1eba380
	void GetArmsOffset(struct FVector& OutOffset); // Function BravoHotelGame.BravoHotelCharacter.GetArmsOffset // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eba2f0
	struct FString GetAppearanceMutableKey(int32_t AppearanceID, int32_t ColorID); // Function BravoHotelGame.BravoHotelCharacter.GetAppearanceMutableKey // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eba210
	struct UAnimMontage* GetAnimSlotMontage(struct FAnimSlot AnimSlot); // Function BravoHotelGame.BravoHotelCharacter.GetAnimSlotMontage // (Final|Native|Public|Const) // @ game+0x1eba170
	struct FAnimSlot GetAnimSlotByProneState(struct FAnimSlot& AnimSlot_Stand, struct FAnimSlot& AnimSlot_Prone); // Function BravoHotelGame.BravoHotelCharacter.GetAnimSlotByProneState // (Final|Native|Public|HasOutParms|Const) // @ game+0x1eba060
	float GetAmplifierLength(); // Function BravoHotelGame.BravoHotelCharacter.GetAmplifierLength // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eba030
	struct TArray<enum class EWeaponType> GetAllowedWeaponType(); // Function BravoHotelGame.BravoHotelCharacter.GetAllowedWeaponType // (Final|Native|Public|Const) // @ game+0x1eb9fb0
	struct UAkComponent* GetAkComponent(); // Function BravoHotelGame.BravoHotelCharacter.GetAkComponent // (Final|Native|Public|Const) // @ game+0x1eb9f90
	struct FVector GetAirWalkGravity(); // Function BravoHotelGame.BravoHotelCharacter.GetAirWalkGravity // (Final|Native|Public|HasDefaults) // @ game+0x1eb9f50
	struct FRotator GetAimOffsets(); // Function BravoHotelGame.BravoHotelCharacter.GetAimOffsets // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eb9f10
	struct FName GetActiveSkillKeyName(int32_t ActiveSkillSlot); // Function BravoHotelGame.BravoHotelCharacter.GetActiveSkillKeyName // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb9e80
	struct USkeletalMeshComponent* GetActiveMesh(); // Function BravoHotelGame.BravoHotelCharacter.GetActiveMesh // (Final|Native|Public|Const) // @ game+0x1eb9e50
	float GetActiveCameraTargetArmLength(); // Function BravoHotelGame.BravoHotelCharacter.GetActiveCameraTargetArmLength // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1eb9e20
	float GetActiveCameraSocketDistance(); // Function BravoHotelGame.BravoHotelCharacter.GetActiveCameraSocketDistance // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1eb9df0
	struct UCameraComponent* GetActiveCamera(); // Function BravoHotelGame.BravoHotelCharacter.GetActiveCamera // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eb9dc0
	float GetAbilityModifier(enum class ECharacterAbilityType AbilityType); // Function BravoHotelGame.BravoHotelCharacter.GetAbilityModifier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eb9d30
	void FPSK_UpdateWeaponTransform(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.FPSK_UpdateWeaponTransform // (Final|Native|Public) // @ game+0x1eb99a0
	void FPSK_UpdateSwayMove(struct FVector Value); // Function BravoHotelGame.BravoHotelCharacter.FPSK_UpdateSwayMove // (Final|Native|Public|HasDefaults) // @ game+0x1eb9910
	void FPSK_UpdateSwayIdle(struct FVector Value); // Function BravoHotelGame.BravoHotelCharacter.FPSK_UpdateSwayIdle // (Final|Native|Public|HasDefaults) // @ game+0x1eb9880
	void FPSK_UpdateMaterialParams(); // Function BravoHotelGame.BravoHotelCharacter.FPSK_UpdateMaterialParams // (Final|Native|Public) // @ game+0x1eb9860
	void FPSK_UpdateADSReady(); // Function BravoHotelGame.BravoHotelCharacter.FPSK_UpdateADSReady // (Final|Native|Public) // @ game+0x1eb9840
	void FPSK_UpdateADSFOV(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.FPSK_UpdateADSFOV // (Final|Native|Public) // @ game+0x1eb97c0
	void FPSK_SetWeaponShadowVisible(bool bVisible); // Function BravoHotelGame.BravoHotelCharacter.FPSK_SetWeaponShadowVisible // (Final|Native|Public) // @ game+0x1eb9730
	void FPSK_SetADSReady(bool bReady, bool bImmediately); // Function BravoHotelGame.BravoHotelCharacter.FPSK_SetADSReady // (Final|Native|Public) // @ game+0x1eb9540
	void FPSK_SetADSFOV(float TargetFOV, bool bImmediately); // Function BravoHotelGame.BravoHotelCharacter.FPSK_SetADSFOV // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb9470
	void FPSK_SetActiveMutableClipping(bool bNewActive); // Function BravoHotelGame.BravoHotelCharacter.FPSK_SetActiveMutableClipping // (Final|Native|Public) // @ game+0x1eb96a0
	void FPSK_SetActive(bool bNewActive); // Function BravoHotelGame.BravoHotelCharacter.FPSK_SetActive // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb9610
	void FPSK_ServerSetTargetFovMagnifier(float CurrentMagnifier, float NewMagnifier); // Function BravoHotelGame.BravoHotelCharacter.FPSK_ServerSetTargetFovMagnifier // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1eb9370
	void FPSK_KeepBoltActionCallbackFunc(); // Function BravoHotelGame.BravoHotelCharacter.FPSK_KeepBoltActionCallbackFunc // (Final|Native|Public) // @ game+0x1eb9350
	struct UCameraComponent* FPSK_GetCamera(); // Function BravoHotelGame.BravoHotelCharacter.FPSK_GetCamera // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eb9320
	void FPSK_DoSetTargetFovMagnifier(float NewMagnifier); // Function BravoHotelGame.BravoHotelCharacter.FPSK_DoSetTargetFovMagnifier // (Final|Native|Public) // @ game+0x1eb92a0
	void FPSK_CreateWeaponshadowComponents(); // Function BravoHotelGame.BravoHotelCharacter.FPSK_CreateWeaponshadowComponents // (Final|Native|Public) // @ game+0x1eb9280
	void FPSK_ClientSetTargetFovMagnifier(float NewMagnifier); // Function BravoHotelGame.BravoHotelCharacter.FPSK_ClientSetTargetFovMagnifier // (Net|Native|Event|Public|NetClient) // @ game+0x1eb9200
	bool FPSK_CheckIsCollide(struct FTransform& DefaultRelativeWeaponTransform); // Function BravoHotelGame.BravoHotelCharacter.FPSK_CheckIsCollide // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x1eb9120
	bool FPSK_CanWearItem(enum class EWearableItemType& Slot, struct FString UniqueKey); // Function BravoHotelGame.BravoHotelCharacter.FPSK_CanWearItem // (Final|Native|Public|HasOutParms) // @ game+0x1eb9020
	bool FPSK_CanSway(); // Function BravoHotelGame.BravoHotelCharacter.FPSK_CanSway // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1eb8ff0
	void FPSK_ActiveADSEffects(bool bActive); // Function BravoHotelGame.BravoHotelCharacter.FPSK_ActiveADSEffects // (Final|Native|Public) // @ game+0x1eb8f60
	void ForceUnProne(); // Function BravoHotelGame.BravoHotelCharacter.ForceUnProne // (Final|Native|Public) // @ game+0x1eb9d10
	void ForceUnCrouch(); // Function BravoHotelGame.BravoHotelCharacter.ForceUnCrouch // (Final|Native|Public) // @ game+0x1eb9cf0
	void ForceProne(); // Function BravoHotelGame.BravoHotelCharacter.ForceProne // (Final|Native|Public) // @ game+0x1eb9cd0
	void ForceClearCastingUI(); // Function BravoHotelGame.BravoHotelCharacter.ForceClearCastingUI // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb9cb0
	void ForceAllUpdateCameraPP(); // Function BravoHotelGame.BravoHotelCharacter.ForceAllUpdateCameraPP // (Final|Native|Public) // @ game+0x1eb9c90
	struct USkyLightComponent* FindSkyLight(); // Function BravoHotelGame.BravoHotelCharacter.FindSkyLight // (Final|Native|Public) // @ game+0x1eb9c60
	struct FVector FindLocationPersonalSupplyBox(int32_t MinDistance, int32_t MaxDistance, float Degree); // Function BravoHotelGame.BravoHotelCharacter.FindLocationPersonalSupplyBox // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1eb9b40
	struct FVector FindLocation(int32_t MinDistance, int32_t MaxDistance, float Degree); // Function BravoHotelGame.BravoHotelCharacter.FindLocation // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1eb9a20
	struct FText ExpertWeaponName(int32_t Index); // Function BravoHotelGame.BravoHotelCharacter.ExpertWeaponName // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1eb8e70
	struct FName ExpertWeaponKey(int32_t Index); // Function BravoHotelGame.BravoHotelCharacter.ExpertWeaponKey // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1eb8de0
	void ExitWetFog(struct ABravoHotelAreaSkillZone* AreaSkillZone); // Function BravoHotelGame.BravoHotelCharacter.ExitWetFog // (Final|Native|Public) // @ game+0x1eb8d60
	void ExitPowerInterruption(struct ABravoHotelAreaSkillZone* AreaSkillZone); // Function BravoHotelGame.BravoHotelCharacter.ExitPowerInterruption // (Final|Native|Public) // @ game+0x1eb8ce0
	void ExitForceField(struct ABravoHotelAreaSkillZone* AreaSkillZone); // Function BravoHotelGame.BravoHotelCharacter.ExitForceField // (Final|Native|Public) // @ game+0x1eb8c60
	void EnterWetFog(struct ABravoHotelAreaSkillZone* AreaSkillZone); // Function BravoHotelGame.BravoHotelCharacter.EnterWetFog // (Final|Native|Public) // @ game+0x1eb8be0
	void EnterPowerInterruption(struct ABravoHotelAreaSkillZone* AreaSkillZone); // Function BravoHotelGame.BravoHotelCharacter.EnterPowerInterruption // (Final|Native|Public) // @ game+0x1eb8b60
	void EnterForceField(struct ABravoHotelAreaSkillZone* AreaSkillZone); // Function BravoHotelGame.BravoHotelCharacter.EnterForceField // (Final|Native|Public) // @ game+0x1eb8ae0
	void EnterCameraInterp(); // Function BravoHotelGame.BravoHotelCharacter.EnterCameraInterp // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb8ac0
	void EndSpawnSimulationBox(struct FSpawnPerkData& Data, struct FString Msg); // Function BravoHotelGame.BravoHotelCharacter.EndSpawnSimulationBox // (Final|Native|Public|HasOutParms) // @ game+0x1eb8960
	void EndRevived(struct AActor* ActActor); // Function BravoHotelGame.BravoHotelCharacter.EndRevived // (Final|Native|Public) // @ game+0x1eb88e0
	void EndResuscitated(struct AActor* InActActor, int32_t InRevivedCurrentGold, int32_t InSaviorCurrentGold, bool bGoldRequest, int32_t InRevivedUseGold, int32_t InSaviorUseGold); // Function BravoHotelGame.BravoHotelCharacter.EndResuscitated // (Final|Native|Public) // @ game+0x1eb8720
	void EndReplaceFreeLook(); // Function BravoHotelGame.BravoHotelCharacter.EndReplaceFreeLook // (Final|Native|Public) // @ game+0x1eb8700
	void EndKickDoor(); // Function BravoHotelGame.BravoHotelCharacter.EndKickDoor // (Final|Native|Public) // @ game+0x1eb86e0
	void EndItemSpawnSimulationBox(struct FSpawnPerkData& Data); // Function BravoHotelGame.BravoHotelCharacter.EndItemSpawnSimulationBox // (Final|Native|Public|HasOutParms) // @ game+0x1eb85e0
	void EndAppearingVehicle(struct ABravoHotelVehicle* TargetVehicle, struct FTransform TargetTransform); // Function BravoHotelGame.BravoHotelCharacter.EndAppearingVehicle // (Final|Native|Public|HasDefaults) // @ game+0x1eb84a0
	void DrawFoliageLayDown(struct UTextureRenderTarget2D* TextureRenderTarget, struct UMaterialInterface* RenderMaterial, float fTextureScale, float fLieDistance, float fCollisionAreaRadius, float fDrawDistance); // Function BravoHotelGame.BravoHotelCharacter.DrawFoliageLayDown // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb82e0
	void DoWindowBreaching(); // Function BravoHotelGame.BravoHotelCharacter.DoWindowBreaching // (Final|Native|Public) // @ game+0x1eb82c0
	void DoWeaponMeleeAttack(); // Function BravoHotelGame.BravoHotelCharacter.DoWeaponMeleeAttack // (Final|Native|Public) // @ game+0x1eb82a0
	void DoWalking(bool bNewWalking); // Function BravoHotelGame.BravoHotelCharacter.DoWalking // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb8210
	void DoTryUseBackpackItem(int32_t& BackpackItemIndex); // Function BravoHotelGame.BravoHotelCharacter.DoTryUseBackpackItem // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1eb8180
	void DoTryExitVehicle(bool bForceExit); // Function BravoHotelGame.BravoHotelCharacter.DoTryExitVehicle // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb80f0
	void DoTryEnterVehicle(struct UBravoHotelVehicleSeatComponent* TargetVehicleSeat, bool bRetryToVacantSeat); // Function BravoHotelGame.BravoHotelCharacter.DoTryEnterVehicle // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb8020
	void DoToggleCamera(); // Function BravoHotelGame.BravoHotelCharacter.DoToggleCamera // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb8000
	void DoThrowWeaponReady(); // Function BravoHotelGame.BravoHotelCharacter.DoThrowWeaponReady // (Final|Native|Public) // @ game+0x1eb7fe0
	void DoThrowWeaponFire(); // Function BravoHotelGame.BravoHotelCharacter.DoThrowWeaponFire // (Final|Native|Public) // @ game+0x1eb7fc0
	void DoTeleport(); // Function BravoHotelGame.BravoHotelCharacter.DoTeleport // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb7fa0
	void DoStopSliding(); // Function BravoHotelGame.BravoHotelCharacter.DoStopSliding // (Final|Native|Public) // @ game+0x1eb7f80
	void DoStopRevive(); // Function BravoHotelGame.BravoHotelCharacter.DoStopRevive // (Final|Native|Public) // @ game+0x1eb7f60
	void DoStopResuscitation(); // Function BravoHotelGame.BravoHotelCharacter.DoStopResuscitation // (Final|Native|Public) // @ game+0x1eb7f40
	void DoStopMontage(struct UAnimMontage* AnimMontage, float BlendTime); // Function BravoHotelGame.BravoHotelCharacter.DoStopMontage // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb7e70
	void DoStopInteraction(); // Function BravoHotelGame.BravoHotelCharacter.DoStopInteraction // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb7e50
	void DoStopCastingAction(); // Function BravoHotelGame.BravoHotelCharacter.DoStopCastingAction // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb7e30
	void DoStopAllActions(bool bStopAllMontages); // Function BravoHotelGame.BravoHotelCharacter.DoStopAllActions // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb7da0
	void DoStartUltimate_Recon(float InitialImpulseStrength); // Function BravoHotelGame.BravoHotelCharacter.DoStartUltimate_Recon // (Final|Native|Public) // @ game+0x1eb7d20
	void DoStartStuntman(); // Function BravoHotelGame.BravoHotelCharacter.DoStartStuntman // (Final|Native|Protected) // @ game+0x1eb7d00
	void DoStartSliding(); // Function BravoHotelGame.BravoHotelCharacter.DoStartSliding // (Final|Native|Public) // @ game+0x1eb7ce0
	void DoStartRolling(float InitialImpulseStrength); // Function BravoHotelGame.BravoHotelCharacter.DoStartRolling // (Final|Native|Public) // @ game+0x1eb7c60
	void DoStartRevive(); // Function BravoHotelGame.BravoHotelCharacter.DoStartRevive // (Final|Native|Public) // @ game+0x1eb7c40
	void DoStartResuscitation(); // Function BravoHotelGame.BravoHotelCharacter.DoStartResuscitation // (Final|Native|Public) // @ game+0x1eb7c20
	void DoStartKickDoor(bool bFromReplication); // Function BravoHotelGame.BravoHotelCharacter.DoStartKickDoor // (Final|Native|Public) // @ game+0x1eb7b90
	void DoStartInteraction(); // Function BravoHotelGame.BravoHotelCharacter.DoStartInteraction // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb7b70
	void DoSprinting(bool bNewSprinting); // Function BravoHotelGame.BravoHotelCharacter.DoSprinting // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb7ae0
	void DoSpawnBlackOut(); // Function BravoHotelGame.BravoHotelCharacter.DoSpawnBlackOut // (Final|Native|Public) // @ game+0x1eb7ac0
	void DoSetIsParachuteLanding(float DeltaTime, bool Flag, float Height); // Function BravoHotelGame.BravoHotelCharacter.DoSetIsParachuteLanding // (Final|Native|Protected) // @ game+0x1eb79b0
	void DoSetActorRotation(struct FRotator& NewRotation); // Function BravoHotelGame.BravoHotelCharacter.DoSetActorRotation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1eb7920
	void DoReselectPerkDeck(); // Function BravoHotelGame.BravoHotelCharacter.DoReselectPerkDeck // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb7900
	void DoReloadImmediately(); // Function BravoHotelGame.BravoHotelCharacter.DoReloadImmediately // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb78e0
	void DoReload(); // Function BravoHotelGame.BravoHotelCharacter.DoReload // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb78c0
	void DoPunchAttack(); // Function BravoHotelGame.BravoHotelCharacter.DoPunchAttack // (Final|Native|Public) // @ game+0x1eb78a0
	void DoProne(bool bNewProne); // Function BravoHotelGame.BravoHotelCharacter.DoProne // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb7810
	void DoPlayAnimSlot(struct FAnimSlot& AnimSlot); // Function BravoHotelGame.BravoHotelCharacter.DoPlayAnimSlot // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1eb7770
	void DoPickUpWeapon(int32_t& WeaponSlotIndex, struct ABravoHotelPickup* PickableItem); // Function BravoHotelGame.BravoHotelCharacter.DoPickUpWeapon // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1eb76a0
	void DoPickUpQuantity(struct ABravoHotelPickup* PickableItem, int32_t GainQuantity); // Function BravoHotelGame.BravoHotelCharacter.DoPickUpQuantity // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb75e0
	void DoPickUpInBox(struct ABravoHotelDropBoxActor* DropBoxActor, struct FInventoryItemInfo& GainItemInfo, int32_t GainQuantity, int32_t WeaponSlotIndex); // Function BravoHotelGame.BravoHotelCharacter.DoPickUpInBox // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1eb7420
	void DoPickUp(struct ABravoHotelPickup* PickableItem); // Function BravoHotelGame.BravoHotelCharacter.DoPickUp // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb73a0
	void DoNuclear(); // Function BravoHotelGame.BravoHotelCharacter.DoNuclear // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb7380
	void DoMoveUp(float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.DoMoveUp // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb7300
	void DoMoveRight(float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.DoMoveRight // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb7280
	void DoMoveItem(struct AActor* SourceActor, enum class ItemWidgetDragType SourceSlotType, struct FInventoryItemInfo& SourceItemInfo, struct AActor* TargetActor, enum class ItemWidgetDragType TargetSlotType, int32_t TargetIndex, int32_t GainQuantity); // Function BravoHotelGame.BravoHotelCharacter.DoMoveItem // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1eb7020
	void DoMoveForward(float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.DoMoveForward // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb6fa0
	void DoJumpEx(bool bNewJumping); // Function BravoHotelGame.BravoHotelCharacter.DoJumpEx // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb6f10
	void DoJetpackBooster(bool bNewJackpack); // Function BravoHotelGame.BravoHotelCharacter.DoJetpackBooster // (Final|Native|Public) // @ game+0x1eb6e80
	void DoJetpackAim(bool bNewJetpackAim); // Function BravoHotelGame.BravoHotelCharacter.DoJetpackAim // (Final|Native|Public) // @ game+0x1eb6df0
	void DoInAircraft(struct AActor* AircraftFlight, float AttachYaw); // Function BravoHotelGame.BravoHotelCharacter.DoInAircraft // (Final|Native|Public) // @ game+0x1eb6d20
	void DoFiring(bool bIsNewFire); // Function BravoHotelGame.BravoHotelCharacter.DoFiring // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb6c90
	void DoFireMode(); // Function BravoHotelGame.BravoHotelCharacter.DoFireMode // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb6c70
	void DoEquipPerkByID(enum class EPerkSlotFlag Slot, int32_t ID, int32_t Level); // Function BravoHotelGame.BravoHotelCharacter.DoEquipPerkByID // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb6b70
	void DoEquipPerk(enum class EPerkSlotFlag Slot, struct FName PerkName, int32_t Level); // Function BravoHotelGame.BravoHotelCharacter.DoEquipPerk // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb6a70
	void DoEndSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.DoEndSteadyAim // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb6a50
	void DoEndRevive(); // Function BravoHotelGame.BravoHotelCharacter.DoEndRevive // (Final|Native|Public) // @ game+0x1eb6a30
	void DoEndResuscitation(); // Function BravoHotelGame.BravoHotelCharacter.DoEndResuscitation // (Final|Native|Public) // @ game+0x1eb6a10
	void DoDoorBreaching(); // Function BravoHotelGame.BravoHotelCharacter.DoDoorBreaching // (Final|Native|Public) // @ game+0x1eb69f0
	void DoDisArm(); // Function BravoHotelGame.BravoHotelCharacter.DoDisArm // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb69d0
	void DoCrouch(bool bNewCrouch); // Function BravoHotelGame.BravoHotelCharacter.DoCrouch // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb6940
	void DoCookThrowingWeapon(); // Function BravoHotelGame.BravoHotelCharacter.DoCookThrowingWeapon // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb6920
	void DoChoosePerkDeck(int32_t ChooseIndex); // Function BravoHotelGame.BravoHotelCharacter.DoChoosePerkDeck // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb68a0
	void DoChangeWeaponZeroPoint(bool bNext); // Function BravoHotelGame.BravoHotelCharacter.DoChangeWeaponZeroPoint // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb6810
	void DoChangeWeapon(int32_t NewWeaponSlotIndex, bool bPlayUnequipAnimation); // Function BravoHotelGame.BravoHotelCharacter.DoChangeWeapon // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb6750
	void DoChangeGender(); // Function BravoHotelGame.BravoHotelCharacter.DoChangeGender // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb6730
	void DoCancelActiveSkill(); // Function BravoHotelGame.BravoHotelCharacter.DoCancelActiveSkill // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb6710
	void DoBeginCombine(struct FName& RecipeKey); // Function BravoHotelGame.BravoHotelCharacter.DoBeginCombine // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x1eb6680
	void DoAnalogStickX(float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.DoAnalogStickX // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb6600
	void DoAirWalk(bool bNewAirWalk); // Function BravoHotelGame.BravoHotelCharacter.DoAirWalk // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb6570
	void DestroyProjectileGrenadeActor(struct ABravoHotelProjectileGrenade* Grenade); // Function BravoHotelGame.BravoHotelCharacter.DestroyProjectileGrenadeActor // (Final|Native|Public) // @ game+0x1eb64f0
	void DeactiveHeartBeatSensor(); // Function BravoHotelGame.BravoHotelCharacter.DeactiveHeartBeatSensor // (Final|Native|Public) // @ game+0x1eb64d0
	void DeactiveAmplifier(); // Function BravoHotelGame.BravoHotelCharacter.DeactiveAmplifier // (Final|Native|Public) // @ game+0x1eb64b0
	void DeactivateADSPostProcess(); // Function BravoHotelGame.BravoHotelCharacter.DeactivateADSPostProcess // (Final|Native|Public) // @ game+0x1eb6490
	void CreateRandomWeapon(); // Function BravoHotelGame.BravoHotelCharacter.CreateRandomWeapon // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb6470
	bool CollisionCheckBeforeProne(); // Function BravoHotelGame.BravoHotelCharacter.CollisionCheckBeforeProne // (Final|Native|Public) // @ game+0x1eb6440
	void ClinentRemoveNoPlayVoice(struct FName Idx); // Function BravoHotelGame.BravoHotelCharacter.ClinentRemoveNoPlayVoice // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb63b0
	void ClinentAddNoPlayVoice(struct FName Idx); // Function BravoHotelGame.BravoHotelCharacter.ClinentAddNoPlayVoice // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb6320
	void ClientUpdateKillcamInfo(struct ABravoHotelCharacter* OtherCharacter, bool bUpdateTime); // Function BravoHotelGame.BravoHotelCharacter.ClientUpdateKillcamInfo // (Net|NetReliableNative|Event|Public|NetClient|NetValidate) // @ game+0x1eb6220
	void ClientStopUseLadderByReconnect(); // Function BravoHotelGame.BravoHotelCharacter.ClientStopUseLadderByReconnect // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb60a0
	void ClientStopedRevive(struct AActor* RevivedActor); // Function BravoHotelGame.BravoHotelCharacter.ClientStopedRevive // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb6190
	void ClientStopedResuscitation(struct AActor* ResuscitatedActor, bool bSuccess); // Function BravoHotelGame.BravoHotelCharacter.ClientStopedResuscitation // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb60c0
	void ClientSpawnPerkNotiMessage(struct FCommonMessageInfo Message); // Function BravoHotelGame.BravoHotelCharacter.ClientSpawnPerkNotiMessage // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb6000
	void ClientSimulatedHittedDamage(struct FRepSimulatedHittedDamage RepSimulatedInfo); // Function BravoHotelGame.BravoHotelCharacter.ClientSimulatedHittedDamage // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb5f60
	void ClientShowInventoryNotEnoughSpaceMessage(); // Function BravoHotelGame.BravoHotelCharacter.ClientShowInventoryNotEnoughSpaceMessage // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb5f40
	void ClientShowInvenMaterialSlotNotEnoughSpaceMessage(); // Function BravoHotelGame.BravoHotelCharacter.ClientShowInvenMaterialSlotNotEnoughSpaceMessage // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb5f20
	void ClientShowActionMessage(int32_t TableIndex, struct FText Message); // Function BravoHotelGame.BravoHotelCharacter.ClientShowActionMessage // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb5e10
	void ClientSetLeanState(enum class ELeanState NewLeanState); // Function BravoHotelGame.BravoHotelCharacter.ClientSetLeanState // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb5d90
	void ClientSetCastingUI(enum class ECastingUIType CastingUIType, struct FName SourceName, float MaxTime, struct ABravoHotelCharacter* Target); // Function BravoHotelGame.BravoHotelCharacter.ClientSetCastingUI // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb5c50
	void ClientRewindMontage(struct UAnimMontage* AnimMontage); // Function BravoHotelGame.BravoHotelCharacter.ClientRewindMontage // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb5bd0
	void ClientReselectPerkDeckLog(struct FName PrePerkDeck, struct FName NextPerkDeck); // Function BravoHotelGame.BravoHotelCharacter.ClientReselectPerkDeckLog // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb5b00
	void ClientRequestBuildingItemSpawnStateString(struct FString BuildingItemSpawnLog); // Function BravoHotelGame.BravoHotelCharacter.ClientRequestBuildingItemSpawnStateString // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb5a50
	void ClientRequestBuildingItemSpawnList(struct TArray<struct FString> List, bool bStart, bool bEnd, int32_t TotalCnt); // Function BravoHotelGame.BravoHotelCharacter.ClientRequestBuildingItemSpawnList // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb58b0
	void ClientRequestBuildingCount(struct FLogBuildCountData DivisionBuildingCount, struct FLogBuildCountData CurrentBuildingCount); // Function BravoHotelGame.BravoHotelCharacter.ClientRequestBuildingCount // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb57e0
	void ClientReconnectProcess(struct FRepClientCharacterReconnectInfo ReconnectInfo); // Function BravoHotelGame.BravoHotelCharacter.ClientReconnectProcess // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb5760
	void ClientQuickLanding(); // Function BravoHotelGame.BravoHotelCharacter.ClientQuickLanding // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb5740
	void ClientPrepareLanding(enum class ELandingReason InLandingReason); // Function BravoHotelGame.BravoHotelCharacter.ClientPrepareLanding // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb56c0
	void ClientPlayVoice(struct FName Idx); // Function BravoHotelGame.BravoHotelCharacter.ClientPlayVoice // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb5630
	void ClientPlaySequence(struct ALevelSequenceActor* Sequnce, bool bReverse); // Function BravoHotelGame.BravoHotelCharacter.ClientPlaySequence // (Net|Native|Event|Public|NetClient|BlueprintCallable) // @ game+0x1eb5560
	void ClientPickupDefaultTime(float IntervalTime); // Function BravoHotelGame.BravoHotelCharacter.ClientPickupDefaultTime // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb54e0
	void ClientPhasePerkLevelUpReady(); // Function BravoHotelGame.BravoHotelCharacter.ClientPhasePerkLevelUpReady // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb54c0
	void ClientPerkSpinEvent(bool bShow, int32_t Count, enum class EPerkSlotFlag Slot); // Function BravoHotelGame.BravoHotelCharacter.ClientPerkSpinEvent // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb53b0
	void ClientNotifyDamageToDamageCauser(struct ABravoHotelCharacter* HittedCharacter, float DamageAmount, struct FDamageEvent DamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.ClientNotifyDamageToDamageCauser // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb5210
	void ClientKillPerkLevelUpReady(int32_t KillCount); // Function BravoHotelGame.BravoHotelCharacter.ClientKillPerkLevelUpReady // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb5180
	void ClientJetpackBooster(bool bNewJackpack); // Function BravoHotelGame.BravoHotelCharacter.ClientJetpackBooster // (Net|NetReliableNative|Event|Public|NetClient|NetValidate) // @ game+0x1eb50c0
	void ClientInAircraft(struct AActor* AircraftFlight, float AttachYaw); // Function BravoHotelGame.BravoHotelCharacter.ClientInAircraft // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb4ff0
	void ClientHitRateData(struct FHitRateWeaponLogData InHitRateWeaponLogData); // Function BravoHotelGame.BravoHotelCharacter.ClientHitRateData // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb4f60
	void ClientFindPersonalSupplyBoxLocation(struct FSpawnBaseInfo SpawnInfo); // Function BravoHotelGame.BravoHotelCharacter.ClientFindPersonalSupplyBoxLocation // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb4eb0
	void ClientFailedToEnterVehicle(); // Function BravoHotelGame.BravoHotelCharacter.ClientFailedToEnterVehicle // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb4e90
	void ClientExitLadder(); // Function BravoHotelGame.BravoHotelCharacter.ClientExitLadder // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb4e70
	void ClientEndRevive(struct AActor* InRevivedActor, int32_t InRevivedTime); // Function BravoHotelGame.BravoHotelCharacter.ClientEndRevive // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb4da0
	void ClientEndResuscitated(struct APlayerState* InRevivedPlayerState, struct APlayerState* InSaviorPlayerState, struct FGoldenTimeLogData InLogData); // Function BravoHotelGame.BravoHotelCharacter.ClientEndResuscitated // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb4c90
	void ClientDoAbortCastingBackpackItemInVehicle(); // Function BravoHotelGame.BravoHotelCharacter.ClientDoAbortCastingBackpackItemInVehicle // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb4c70
	void ClientDebugBoxTrace(struct FVector TraceStart, struct FVector TraceEnd, struct FVector HalfSize); // Function BravoHotelGame.BravoHotelCharacter.ClientDebugBoxTrace // (Net|NetReliableNative|Event|Public|HasDefaults|NetClient) // @ game+0x1eb4b80
	void ClientClearCastingUI(); // Function BravoHotelGame.BravoHotelCharacter.ClientClearCastingUI // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb4b60
	void ClientChoosePerkDeck(int32_t ChooseIndex, bool bSuccess); // Function BravoHotelGame.BravoHotelCharacter.ClientChoosePerkDeck // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb4a90
	void ClientApplyDamage(float DamageAmount, struct FDamageEvent DamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.ClientApplyDamage // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb4940
	void ClientAddWearableEffectBuffList(struct FString BuffIndex); // Function BravoHotelGame.BravoHotelCharacter.ClientAddWearableEffectBuffList // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb4890
	void ClientAddPerkLevel(struct FPerkInfo InPerkInfo, enum class EPerkLevelUpType InLevelUpType, int32_t InBeforeLevel, int32_t InAfterLevel, int32_t InBeforeMaxHealth); // Function BravoHotelGame.BravoHotelCharacter.ClientAddPerkLevel // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1eb46f0
	void ClearInteractionUI(); // Function BravoHotelGame.BravoHotelCharacter.ClearInteractionUI // (Final|Native|Public) // @ game+0x1eb46d0
	void CheckVisibleOutBlueZoneBlizzard(); // Function BravoHotelGame.BravoHotelCharacter.CheckVisibleOutBlueZoneBlizzard // (Final|Native|Public) // @ game+0x1eb46b0
	void CheckUseItem(struct FName& ItemKey); // Function BravoHotelGame.BravoHotelCharacter.CheckUseItem // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1eb4620
	void CheckUnderLand(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.CheckUnderLand // (Final|Native|Public) // @ game+0x1eb45a0
	void CheckThrowWeapon(struct FName& ItemKey); // Function BravoHotelGame.BravoHotelCharacter.CheckThrowWeapon // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1eb4510
	void CheckStopRevive(); // Function BravoHotelGame.BravoHotelCharacter.CheckStopRevive // (Final|Native|Public) // @ game+0x1eb44f0
	void CheckSteady(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.CheckSteady // (Final|Native|Public) // @ game+0x1eb4470
	void CheckShakeOutMontage(); // Function BravoHotelGame.BravoHotelCharacter.CheckShakeOutMontage // (Final|Native|Public) // @ game+0x1eb4450
	void CheckRequestBuildingInfo(); // Function BravoHotelGame.BravoHotelCharacter.CheckRequestBuildingInfo // (Final|Native|Public) // @ game+0x1eb4430
	void CheckProneWeaponIdle(); // Function BravoHotelGame.BravoHotelCharacter.CheckProneWeaponIdle // (Final|Native|Public) // @ game+0x1eb4410
	void CheckProneCollision(); // Function BravoHotelGame.BravoHotelCharacter.CheckProneCollision // (Final|Native|Protected) // @ game+0x1eb43f0
	bool CheckPlosiveSoundDetection(enum class EPlosiveSoundDetectionType DetiectionType); // Function BravoHotelGame.BravoHotelCharacter.CheckPlosiveSoundDetection // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb4360
	void CheckOxygen(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.CheckOxygen // (Final|Native|Public) // @ game+0x1eb42e0
	void CheckOverHeal(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.CheckOverHeal // (Final|Native|Public) // @ game+0x1eb4260
	void CheckOnChangeCondition(); // Function BravoHotelGame.BravoHotelCharacter.CheckOnChangeCondition // (Final|Native|Public) // @ game+0x151b910
	bool CheckNeedOwnerStopLadder(); // Function BravoHotelGame.BravoHotelCharacter.CheckNeedOwnerStopLadder // (Final|Native|Public) // @ game+0x1eb4230
	void CheckMeleeAnim(); // Function BravoHotelGame.BravoHotelCharacter.CheckMeleeAnim // (Final|Native|Public) // @ game+0x1eb4210
	bool CheckIsCastingBackpackItem(struct FInventoryItemInfo& TargetItemInfo); // Function BravoHotelGame.BravoHotelCharacter.CheckIsCastingBackpackItem // (Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1eb4110
	void CheckEquipAnim(); // Function BravoHotelGame.BravoHotelCharacter.CheckEquipAnim // (Final|Native|Public) // @ game+0x1eb40f0
	void CheckCurrentBuff(); // Function BravoHotelGame.BravoHotelCharacter.CheckCurrentBuff // (Final|Native|Public) // @ game+0x1eb40d0
	void CheckCharacterNamedArguments(); // Function BravoHotelGame.BravoHotelCharacter.CheckCharacterNamedArguments // (Final|Native|Public) // @ game+0x1eb40b0
	void CheckBrokenEquipment(); // Function BravoHotelGame.BravoHotelCharacter.CheckBrokenEquipment // (Final|Native|Public) // @ game+0x1eb4090
	void CheckBombingTargeting(); // Function BravoHotelGame.BravoHotelCharacter.CheckBombingTargeting // (Final|Native|Public) // @ game+0x1eb4070
	void CheckArmedStateForAction(bool bDoArm, bool bPlayUnequipAnimation, bool bOrdered); // Function BravoHotelGame.BravoHotelCharacter.CheckArmedStateForAction // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb3f50
	void ChangeOption(struct TArray<enum class ESettingType>& ChangeTypeList); // Function BravoHotelGame.BravoHotelCharacter.ChangeOption // (Final|Native|Public|HasOutParms) // @ game+0x1eb3ea0
	void ChangeCastingMontageOnProneEvent(bool bNewProne, float TargetMontagePosition); // Function BravoHotelGame.BravoHotelCharacter.ChangeCastingMontageOnProneEvent // (Final|Native|Public) // @ game+0x1eb3dd0
	void CastingDelegate__DelegateSignature(struct FCastingInfo& CastingInfo, float CastingPercent); // DelegateFunction BravoHotelGame.BravoHotelCharacter.CastingDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x23a3b60
	bool CanWeaponMeleeAttack(); // Function BravoHotelGame.BravoHotelCharacter.CanWeaponMeleeAttack // (Final|Native|Protected) // @ game+0x1eb3d60
	bool CanUseBackpackItem(int32_t BackpackItemIndex); // Function BravoHotelGame.BravoHotelCharacter.CanUseBackpackItem // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eb3cd0
	bool CanUpdateIdleNum(); // Function BravoHotelGame.BravoHotelCharacter.CanUpdateIdleNum // (Final|Native|Public|Const) // @ game+0x1eb3ca0
	bool CanUltimate_Recon(); // Function BravoHotelGame.BravoHotelCharacter.CanUltimate_Recon // (Final|Native|Public|Const) // @ game+0x1eb3c70
	bool CanTryUseAutoLadder(); // Function BravoHotelGame.BravoHotelCharacter.CanTryUseAutoLadder // (Final|Native|Public) // @ game+0x1eb3c40
	bool CanSprint(); // Function BravoHotelGame.BravoHotelCharacter.CanSprint // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1eb3c10
	bool CanSpawnSuperBarrier(struct FTransform& OutSpawnTransform); // Function BravoHotelGame.BravoHotelCharacter.CanSpawnSuperBarrier // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x1eb3b30
	bool CanSliding(); // Function BravoHotelGame.BravoHotelCharacter.CanSliding // (Final|Native|Public|Const) // @ game+0x1eb3b00
	bool CanRolling(); // Function BravoHotelGame.BravoHotelCharacter.CanRolling // (Final|Native|Public|Const) // @ game+0x1eb3ad0
	bool CanRocketJump(); // Function BravoHotelGame.BravoHotelCharacter.CanRocketJump // (Final|Native|Public) // @ game+0x1eb3aa0
	bool CanReviveOtherPlayer(); // Function BravoHotelGame.BravoHotelCharacter.CanReviveOtherPlayer // (Final|Native|Public|Const) // @ game+0x1eb3a70
	bool CanResuscitationOtherPlayer(struct AActor* ResuscitatedActor); // Function BravoHotelGame.BravoHotelCharacter.CanResuscitationOtherPlayer // (Final|Native|Public|Const) // @ game+0x1eb39e0
	void CanProneFailedDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.CanProneFailedDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	bool CanPlayShakeOutMontage(); // Function BravoHotelGame.BravoHotelCharacter.CanPlayShakeOutMontage // (Final|Native|Public) // @ game+0x1eb39b0
	bool CanMove(); // Function BravoHotelGame.BravoHotelCharacter.CanMove // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eb3980
	bool CanMeteorJump(); // Function BravoHotelGame.BravoHotelCharacter.CanMeteorJump // (Final|Native|Public) // @ game+0x1eb3950
	bool CanMeleeAttack(); // Function BravoHotelGame.BravoHotelCharacter.CanMeleeAttack // (Final|Native|Protected) // @ game+0x1eb3920
	bool CanLean(); // Function BravoHotelGame.BravoHotelCharacter.CanLean // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1eb38f0
	bool CanKickDoor(); // Function BravoHotelGame.BravoHotelCharacter.CanKickDoor // (Final|Native|Public|Const) // @ game+0x1eb38c0
	bool CanJetpack(); // Function BravoHotelGame.BravoHotelCharacter.CanJetpack // (Final|Native|Public|Const) // @ game+0x1eb3890
	bool CanHeartBeatSensor(); // Function BravoHotelGame.BravoHotelCharacter.CanHeartBeatSensor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eb3860
	bool CanFreeLook(); // Function BravoHotelGame.BravoHotelCharacter.CanFreeLook // (Final|Native|Public) // @ game+0x1eb3830
	bool CanFPS(); // Function BravoHotelGame.BravoHotelCharacter.CanFPS // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eb37d0
	bool CanFire(); // Function BravoHotelGame.BravoHotelCharacter.CanFire // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eb3800
	bool CanEnterVehicle(struct UBravoHotelVehicleSeatComponent* TargetVehicleSeat); // Function BravoHotelGame.BravoHotelCharacter.CanEnterVehicle // (Final|Native|Public|Const) // @ game+0x1eb3740
	bool CanCombine(); // Function BravoHotelGame.BravoHotelCharacter.CanCombine // (Final|Native|Protected|BlueprintCallable) // @ game+0x1eb3710
	bool CanChangeWeapon(); // Function BravoHotelGame.BravoHotelCharacter.CanChangeWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eb36e0
	bool CanChangeFireMode(); // Function BravoHotelGame.BravoHotelCharacter.CanChangeFireMode // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1eb36b0
	void CancelMelee(); // Function BravoHotelGame.BravoHotelCharacter.CancelMelee // (Final|Native|Public) // @ game+0x1eb3db0
	void CancelAimingInVehicle(); // Function BravoHotelGame.BravoHotelCharacter.CancelAimingInVehicle // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb3d90
	bool CanBeKnockedBack(); // Function BravoHotelGame.BravoHotelCharacter.CanBeKnockedBack // (Final|Native|Public|Const) // @ game+0x1eb3680
	bool CanApplyActiveItem(int32_t BackpackItemIndex); // Function BravoHotelGame.BravoHotelCharacter.CanApplyActiveItem // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x1eb35f0
	bool CanAOS(); // Function BravoHotelGame.BravoHotelCharacter.CanAOS // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eb3590
	bool CanAMP(); // Function BravoHotelGame.BravoHotelCharacter.CanAMP // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eb3560
	bool CanAirWalk(); // Function BravoHotelGame.BravoHotelCharacter.CanAirWalk // (Final|Native|Public) // @ game+0x1eb35c0
	bool CanADS(); // Function BravoHotelGame.BravoHotelCharacter.CanADS // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eb3530
	void CallbackLanded(struct FHitResult& Hit); // Function BravoHotelGame.BravoHotelCharacter.CallbackLanded // (Final|Native|Public|HasOutParms) // @ game+0x1eb3450
	void CalculatePreShootInformations(float DeltaTime, struct FVector& Pos, bool& LineOfFire, bool& LastUpdate); // Function BravoHotelGame.BravoHotelCharacter.CalculatePreShootInformations // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1eb32c0
	struct FVector CalculateActorLocationInRagdoll(); // Function BravoHotelGame.BravoHotelCharacter.CalculateActorLocationInRagdoll // (Final|Native|Protected|HasDefaults) // @ game+0x1eb3280
	float CalcDamageByFallingSpeed(float InMinSpeed, float InMaxSpeed, bool bIsLandedFromVehicle); // Function BravoHotelGame.BravoHotelCharacter.CalcDamageByFallingSpeed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eb3170
	void BroadcastDetectItemsDelegate(); // Function BravoHotelGame.BravoHotelCharacter.BroadcastDetectItemsDelegate // (Final|Native|Public) // @ game+0x1eb3150
	void BPSetReplicateMovement(bool bInReplicateMovement); // Function BravoHotelGame.BravoHotelCharacter.BPSetReplicateMovement // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb30a0
	void BeginPlay(); // Function BravoHotelGame.BravoHotelCharacter.BeginPlay // (Native|Public|BlueprintCallable) // @ game+0x1eb3130
	void AttachWeaponToSlot(struct ABravoHotelEquippableActor* EquippableActor, int32_t SlotIndex); // Function BravoHotelGame.BravoHotelCharacter.AttachWeaponToSlot // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb2fe0
	void ApplyDamageEx(float DamageAmount, struct FDamageEvent& DamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.ApplyDamageEx // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1eb2e70
	void AIExitForceField(); // Function BravoHotelGame.BravoHotelCharacter.AIExitForceField // (Final|Native|Public) // @ game+0x1eb25a0
	void AIEnterForceField(); // Function BravoHotelGame.BravoHotelCharacter.AIEnterForceField // (Final|Native|Public) // @ game+0x1eb2580
	float AffectedByForceField_Impl(float OutModifier, bool bNeedMultipy, bool bIsOwnerIgnore); // Function BravoHotelGame.BravoHotelCharacter.AffectedByForceField_Impl // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1eb2d60
	void ADSSettingsAfterChangeCamera(bool bUseCustomCurve); // Function BravoHotelGame.BravoHotelCharacter.ADSSettingsAfterChangeCamera // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb24f0
	void AddThrownMolotovCocktail(struct ABravoHotelProjectileGrenadeMolotovCocktail* MolotovCocktail); // Function BravoHotelGame.BravoHotelCharacter.AddThrownMolotovCocktail // (Final|Native|Public) // @ game+0x1eb2ce0
	void AddThrownFlashbang(struct ABravoHotelProjectileGrenadeFlashbang* Flashbang); // Function BravoHotelGame.BravoHotelCharacter.AddThrownFlashbang // (Final|Native|Public) // @ game+0x1eb2c60
	void AddSimulatedHittedDamage(struct UBravoHotelDamageType* DamageTypeClass, struct APawn* DamageInstigator, float Damage, int16_t HitPointIdx, uint16_t ProjectileId); // Function BravoHotelGame.BravoHotelCharacter.AddSimulatedHittedDamage // (Final|Native|Private) // @ game+0x1eb2ad0
	void AddShortTimeHealth(struct UObject* HealthOwner, float AddHealth); // Function BravoHotelGame.BravoHotelCharacter.AddShortTimeHealth // (Final|Native|Public) // @ game+0x1eb2a00
	bool AddPerkLevel(enum class EPerkSlotFlag PerkSlot, int32_t Count, bool bTakeOne); // Function BravoHotelGame.BravoHotelCharacter.AddPerkLevel // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb2900
	void AddPerkEvent(struct FPerkInfo& PerkInfo, struct FDisplayAbility& InCurrentDisplayAbility, int32_t LastLevel, int32_t ClassLevel, enum class EPerkLevelUpType LevelUpType); // Function BravoHotelGame.BravoHotelCharacter.AddPerkEvent // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x23a3b60
	void AddOverHeal(float Amount); // Function BravoHotelGame.BravoHotelCharacter.AddOverHeal // (Final|Native|Public) // @ game+0x1eb2880
	void AddDetectedStealable(struct ABravoHotelCharacter* NewCharacter); // Function BravoHotelGame.BravoHotelCharacter.AddDetectedStealable // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb2800
	void AddDetectedItem(struct ABravoHotelPickup* NewPickup); // Function BravoHotelGame.BravoHotelCharacter.AddDetectedItem // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb2780
	void AddDetectedDropBox(struct ABravoHotelDropBoxActor* NewPickup); // Function BravoHotelGame.BravoHotelCharacter.AddDetectedDropBox // (Final|Native|Public|BlueprintCallable) // @ game+0x1eb2700
	void AddCondition(enum class ECharacterConditionType ConditionType, enum class EAbilityCase Key); // Function BravoHotelGame.BravoHotelCharacter.AddCondition // (Final|Native|Public) // @ game+0x1eb2640
	void AddCharacterRotation(float Val); // Function BravoHotelGame.BravoHotelCharacter.AddCharacterRotation // (Event|Protected|BlueprintEvent) // @ game+0x23a3b60
	bool ActiveHeartBeatSensor(); // Function BravoHotelGame.BravoHotelCharacter.ActiveHeartBeatSensor // (Final|Native|Public) // @ game+0x1eb2610
	bool ActiveAmplifier(); // Function BravoHotelGame.BravoHotelCharacter.ActiveAmplifier // (Final|Native|Public) // @ game+0x1eb25e0
	void ActivateADSPostProcess(); // Function BravoHotelGame.BravoHotelCharacter.ActivateADSPostProcess // (Final|Native|Public) // @ game+0x1eb25c0
};

// Class BravoHotelGame.BHPersonalSupplySystemComponent
// Size: 0x1c0 (Inherited: 0xb0)
struct UBHPersonalSupplySystemComponent : UActorComponent {
	char pad_B0[0x10]; // 0xb0(0x10)
	struct ABHPersonalSupplyBox* CurrentSupplyBox; // 0xc0(0x08)
	struct ABHPersonalSupplyBoxDummy* CurrentSupplyBoxDummy; // 0xc8(0x08)
	struct ABHPersonalSupplyBox* SupplyBoxClass; // 0xd0(0x08)
	struct ABHPersonalSupplyBoxDummy* SupplyBoxDummyClass; // 0xd8(0x08)
	struct FSupplyBoxAssignmentInfo CurrentAssignmentInfo; // 0xe0(0x30)
	int32_t CountOpenSupplyBox; // 0x110(0x04)
	int32_t SupplyBoxCost; // 0x114(0x04)
	enum class EPersonalSupplyBoxState CurrentPSBState; // 0x118(0x01)
	enum class EAssignReason AssignReason; // 0x119(0x01)
	char pad_11A[0x8]; // 0x11a(0x08)
	bool ShowPingByHUD; // 0x122(0x01)
	char pad_123[0x9d]; // 0x123(0x9d)

	void StartSpawnFromSpawnInfo(struct FSpawnPerkData& Data, bool CheckRePosition); // Function BravoHotelGame.BHPersonalSupplySystemComponent.StartSpawnFromSpawnInfo // (Final|Native|Public|HasOutParms) // @ game+0x1e493a0
	void StartSpawn(); // Function BravoHotelGame.BHPersonalSupplySystemComponent.StartSpawn // (Final|Native|Public) // @ game+0x1e49380
	void SetPersonalSupplyBoxInfo(enum class EPersonalSupplyBoxState NewState, struct FVector NewLocation); // Function BravoHotelGame.BHPersonalSupplySystemComponent.SetPersonalSupplyBoxInfo // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1e492b0
	void ServerSpawnSupplyBoxDummy(); // Function BravoHotelGame.BHPersonalSupplySystemComponent.ServerSpawnSupplyBoxDummy // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1e49260
	void ServerPayGold(int32_t Amount); // Function BravoHotelGame.BHPersonalSupplySystemComponent.ServerPayGold // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1e491a0
	void Response_PayGold(bool bSuccess, int32_t Amount); // Function BravoHotelGame.BHPersonalSupplySystemComponent.Response_PayGold // (Final|Native|Public) // @ game+0x1e490e0
	void OnRep_SupplyBoxCost(); // Function BravoHotelGame.BHPersonalSupplySystemComponent.OnRep_SupplyBoxCost // (Final|Native|Protected) // @ game+0x1e490c0
	void OnRep_CurrentAssignmentInfo(); // Function BravoHotelGame.BHPersonalSupplySystemComponent.OnRep_CurrentAssignmentInfo // (Final|Native|Protected) // @ game+0x1e490a0
	void OnRep_ChangePSMState(); // Function BravoHotelGame.BHPersonalSupplySystemComponent.OnRep_ChangePSMState // (Final|Native|Protected) // @ game+0x1e49080
	void MulticastNotifyAlert(int32_t player_uid); // Function BravoHotelGame.BHPersonalSupplySystemComponent.MulticastNotifyAlert // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x1e48ff0
	struct FPersonalSupplyBoxPingInfo GetPersonalSupplyBoxInfo(); // Function BravoHotelGame.BHPersonalSupplySystemComponent.GetPersonalSupplyBoxInfo // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1e48fb0
	void ForceSpawnPersonalBox(struct FTransform SpawnTransform, struct TArray<struct FSpawnItemResult> ItemInfos); // Function BravoHotelGame.BHPersonalSupplySystemComponent.ForceSpawnPersonalBox // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1e48e20
	void ForceSpawnBox(struct FTransform SpawnTransform, struct TArray<struct FInventoryItemInfo> ItemInfos); // Function BravoHotelGame.BHPersonalSupplySystemComponent.ForceSpawnBox // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1e48c40
	void ClientSetPersonalSupplyBox(struct FSupplyBoxAssignmentInfo AssignmentInfo); // Function BravoHotelGame.BHPersonalSupplySystemComponent.ClientSetPersonalSupplyBox // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x1e48b90
	void ClientRecallPersonalSupplyBox(); // Function BravoHotelGame.BHPersonalSupplySystemComponent.ClientRecallPersonalSupplyBox // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x1e48b70
	void ClientChangePSMState(enum class EPersonalSupplyBoxState State); // Function BravoHotelGame.BHPersonalSupplySystemComponent.ClientChangePSMState // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x1e48af0
	void ChangePersonalSupplyBoxLocationInfo(struct FVector NewLocation); // Function BravoHotelGame.BHPersonalSupplySystemComponent.ChangePersonalSupplyBoxLocationInfo // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1e48a60
};

// Class BravoHotelGame.BravoHotel3DViewActor
// Size: 0x320 (Inherited: 0x320)
struct ABravoHotel3DViewActor : AActor {
};

// Class BravoHotelGame.BravoHotelAbilityComponent
// Size: 0x7d0 (Inherited: 0xb0)
struct UBravoHotelAbilityComponent : UActorComponent {
	char pad_B0[0x5d8]; // 0xb0(0x5d8)
	struct FBravoHotelDefaultBalanceData DefaultBalanceData; // 0x688(0x78)
	struct TMap<enum class ECharacterBuffType, struct FName> CharacterBuffDataKeys; // 0x288(0x50)
	struct AActor* DefaultFireCell; // 0x280(0x08)
	float SimulatedTickTime; // 0xc0(0x04)
	struct TMap<enum class ECharacterAbilityType, struct FBravoHotelAbilityState> AbilityStates; // 0x708(0x50)
	struct TMap<enum class ECharacterConditionedAbilityType, struct FBravoHotelConditionedAbilityState> ConditionedAbilityStates; // 0x388(0x50)
	struct TMap<enum class ECharacterConditionType, struct FBravoHotelConditionState> ConditionStates; // 0x230(0x50)
	uint64_t ConditionFlags; // 0x478(0x08)
	struct TMap<int32_t, struct FBravoHotelBuffUIInfo> BuffUIInfos; // 0x428(0x50)
	struct FBuffHandleArray CurrentBuffKeys; // 0xc8(0x118)
	struct TMap<uint16_t, struct UBravoHotelBuffBase*> CurrentBuffInfos; // 0x528(0x50)
	struct TMap<uint16_t, struct UBuffControlState*> BuffControls; // 0x1e0(0x50)
	struct TArray<struct UBravoHotelBuffBase*> StackBuffInfos; // 0x678(0x10)
	float Loudness; // 0x7bc(0x04)
	float LoudnessCrouchRatio; // 0x2d8(0x04)
	float LoudnessProneRatio; // 0x420(0x04)
	float LoudnessTime; // 0x7b8(0x04)
	struct UUserWidget* DebugWidgetClass; // 0x618(0x08)
	struct TMap<struct UObject*, struct FMaterialEffectInfo> MaterialEffectInfos; // 0x578(0x50)
	struct UCurveFloat* MaterialEffectCurve; // 0x7a8(0x08)
	struct UCurveFloat* MaterialEffectStrCurve; // 0x670(0x08)
	struct UUserWidget* DebugWidget; // 0x7c8(0x08)
	struct UBravoHotelDebugWidget* WeaponDebugTextWidget; // 0x768(0x08)
	struct TMap<enum class EBuffEventType, struct FMulticastInlineDelegate> BuffEventDelegates; // 0x330(0x50)
	struct TMap<enum class EBuffEventType, struct FMulticastInlineDelegate> BuffEndEventDelegates; // 0x2e0(0x50)
	struct TMap<enum class EWeaponBuffEventType, struct FMulticastInlineDelegate> WeaponBuffEventDelegates; // 0x5c8(0x50)

	void WeaponBuffEventDelegate__DelegateSignature(enum class EWeaponBuffEventType& EventType, struct FConditionedWeaponInfo& WeaponInfo); // DelegateFunction BravoHotelGame.BravoHotelAbilityComponent.WeaponBuffEventDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x23a3b60
	void UpdateWeaponDebugTextWidget(); // Function BravoHotelGame.BravoHotelAbilityComponent.UpdateWeaponDebugTextWidget // (Final|Native|Private) // @ game+0x1e51830
	void ToggleWeaponDebugTextWidgetVisible(); // Function BravoHotelGame.BravoHotelAbilityComponent.ToggleWeaponDebugTextWidgetVisible // (Final|Native|Public) // @ game+0x1e51810
	void ShowAbilityDubugText(bool bFlag); // Function BravoHotelGame.BravoHotelAbilityComponent.ShowAbilityDubugText // (Final|Native|Public|BlueprintCallable) // @ game+0x1e51780
	void ServerStopBuffControl(uint16_t BuffIndex); // Function BravoHotelGame.BravoHotelAbilityComponent.ServerStopBuffControl // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1e516c0
	void ServerSetBuffControlTimer(uint16_t BuffIndex, float NewTimer); // Function BravoHotelGame.BravoHotelAbilityComponent.ServerSetBuffControlTimer // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1e515c0
	void ServerRemoveCondition(enum class ECharacterConditionType ConditionType, int32_t Key); // Function BravoHotelGame.BravoHotelAbilityComponent.ServerRemoveCondition // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1e514c0
	void ServerRemoveBuffByIndex(uint16_t BuffIndex); // Function BravoHotelGame.BravoHotelAbilityComponent.ServerRemoveBuffByIndex // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1e51400
	void ServerForceRemoveCondition(enum class ECharacterConditionType ConditionType); // Function BravoHotelGame.BravoHotelAbilityComponent.ServerForceRemoveCondition // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1e51350
	void ServerCheckBuffControl(uint16_t BuffIndex); // Function BravoHotelGame.BravoHotelAbilityComponent.ServerCheckBuffControl // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1e51290
	void ServerAddStackBuffByIndex(uint16_t BuffIndex); // Function BravoHotelGame.BravoHotelAbilityComponent.ServerAddStackBuffByIndex // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1e511d0
	void ServerAddCondition(enum class ECharacterConditionType ConditionType, int32_t Key); // Function BravoHotelGame.BravoHotelAbilityComponent.ServerAddCondition // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1e510d0
	void ServerAddBuffByIndex(uint16_t BuffIndex); // Function BravoHotelGame.BravoHotelAbilityComponent.ServerAddBuffByIndex // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1e51010
	void ServerAddBuffByAttacker(uint16_t BuffIndex, struct AController* PC, struct AActor* Actor); // Function BravoHotelGame.BravoHotelAbilityComponent.ServerAddBuffByAttacker // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1e50ee0
	void ResetAllBuffCoolTime(); // Function BravoHotelGame.BravoHotelAbilityComponent.ResetAllBuffCoolTime // (Final|Native|Public|BlueprintCallable) // @ game+0x1e50ec0
	void RemoveCondition(enum class ECharacterConditionType ConditionType, enum class EAbilityCase Key); // Function BravoHotelGame.BravoHotelAbilityComponent.RemoveCondition // (Final|Native|Public|BlueprintCallable) // @ game+0x1e50e00
	void RemoveBuffByData(struct FName BuffName); // Function BravoHotelGame.BravoHotelAbilityComponent.RemoveBuffByData // (Final|Native|Public|BlueprintCallable) // @ game+0x1e50d80
	void OnRep_ChangedCurrentBuffKeys(); // Function BravoHotelGame.BravoHotelAbilityComponent.OnRep_ChangedCurrentBuffKeys // (Final|Native|Private) // @ game+0x1e50d60
	void MultiResetBuffTimeByIndex(uint16_t BuffIndex, float Time); // Function BravoHotelGame.BravoHotelAbilityComponent.MultiResetBuffTimeByIndex // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1e50c90
	bool IsShowAbilityDubugText(); // Function BravoHotelGame.BravoHotelAbilityComponent.IsShowAbilityDubugText // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1e50c70
	bool IsBuff(enum class ECharacterBuffType BuffType); // Function BravoHotelGame.BravoHotelAbilityComponent.IsBuff // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1e50be0
	void ClientSyncCondition(struct TArray<struct FBravoHotelConditionState> ConditionInfo); // Function BravoHotelGame.BravoHotelAbilityComponent.ClientSyncCondition // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1e50b10
	void ClientSetBuffControlTimer(uint16_t BuffIndex, float NewTimer); // Function BravoHotelGame.BravoHotelAbilityComponent.ClientSetBuffControlTimer // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1e50a40
	void ClientRemoveCondition(enum class ECharacterConditionType ConditionType, int32_t Key); // Function BravoHotelGame.BravoHotelAbilityComponent.ClientRemoveCondition // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1e50970
	void ClientRemoveBuffByIndex(uint16_t BuffIndex); // Function BravoHotelGame.BravoHotelAbilityComponent.ClientRemoveBuffByIndex // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1e508e0
	void ClientRemoveAllBuffDelegates(); // Function BravoHotelGame.BravoHotelAbilityComponent.ClientRemoveAllBuffDelegates // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x120dbb0
	void ClientForceRemoveCondition(enum class ECharacterConditionType ConditionType); // Function BravoHotelGame.BravoHotelAbilityComponent.ClientForceRemoveCondition // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1e50860
	void ClientAddStackBuffByIndex(uint16_t BuffIndex); // Function BravoHotelGame.BravoHotelAbilityComponent.ClientAddStackBuffByIndex // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1e507d0
	void ClientAddCondition(enum class ECharacterConditionType ConditionType, int32_t Key); // Function BravoHotelGame.BravoHotelAbilityComponent.ClientAddCondition // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1e50700
	void ClientAddBuffByIndex(uint16_t BuffIndex); // Function BravoHotelGame.BravoHotelAbilityComponent.ClientAddBuffByIndex // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1e50670
	void ClientAddBuffByAttacker(uint16_t BuffIndex, struct AController* PC, struct AActor* Actor); // Function BravoHotelGame.BravoHotelAbilityComponent.ClientAddBuffByAttacker // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1e50570
	void BuffEventDelegate__DelegateSignature(enum class EBuffEventType& EventType); // DelegateFunction BravoHotelGame.BravoHotelAbilityComponent.BuffEventDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x23a3b60
	void AddCondition(enum class ECharacterConditionType ConditionType, enum class EAbilityCase Key); // Function BravoHotelGame.BravoHotelAbilityComponent.AddCondition // (Final|Native|Public|BlueprintCallable) // @ game+0x1e504b0
	void AddBuffByData(struct FName BuffName); // Function BravoHotelGame.BravoHotelAbilityComponent.AddBuffByData // (Final|Native|Public|BlueprintCallable) // @ game+0x1e50430
};

// Class BravoHotelGame.ConditionedAbilityGetter
// Size: 0xe8 (Inherited: 0x28)
struct UConditionedAbilityGetter : UObject {
	char pad_28[0xc0]; // 0x28(0xc0)
};

// Class BravoHotelGame.BuffControlState
// Size: 0xb0 (Inherited: 0x28)
struct UBuffControlState : UObject {
	char pad_28[0x48]; // 0x28(0x48)
	struct TArray<uint16_t> ActiveBuffs; // 0x70(0x10)
	struct ABravoHotelCharacter* BravoHotelCharacter; // 0x80(0x08)
	struct UBravoHotelAbilityComponent* BravoHotelAbilityComponent; // 0x88(0x08)
	char pad_90[0x20]; // 0x90(0x20)

	void WeaponEventEndCallBack(enum class EWeaponBuffEventType& BuffEventType, struct FConditionedWeaponInfo& WeaponInfo); // Function BravoHotelGame.BuffControlState.WeaponEventEndCallBack // (Final|Native|Public|HasOutParms) // @ game+0x1e5d630
	void WeaponEventCallBack(enum class EWeaponBuffEventType& BuffEventType, struct FConditionedWeaponInfo& WeaponInfo); // Function BravoHotelGame.BuffControlState.WeaponEventCallBack // (Final|Native|Public|HasOutParms) // @ game+0x1e5d510
	void ReduceCoolTimeOnRangedAttack(); // Function BravoHotelGame.BuffControlState.ReduceCoolTimeOnRangedAttack // (Final|Native|Private) // @ game+0x1e5d4f0
	void ReduceCoolTimeOnKill(); // Function BravoHotelGame.BuffControlState.ReduceCoolTimeOnKill // (Final|Native|Private) // @ game+0x1e5d4d0
	void OnEndCoolTime__DelegateSignature(); // DelegateFunction BravoHotelGame.BuffControlState.OnEndCoolTime__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnBeginCoolTime__DelegateSignature(); // DelegateFunction BravoHotelGame.BuffControlState.OnBeginCoolTime__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x23a3b60
	void OnBeginCoolTime(); // Function BravoHotelGame.BuffControlState.OnBeginCoolTime // (Final|Native|Public) // @ game+0x1e5d4b0
	void EventEndCallBack(enum class EBuffEventType& BuffEvnetType); // Function BravoHotelGame.BuffControlState.EventEndCallBack // (Final|Native|Public|HasOutParms) // @ game+0x1e5d420
	void EventCallBack(enum class EBuffEventType& BuffEvnetType); // Function BravoHotelGame.BuffControlState.EventCallBack // (Final|Native|Public|HasOutParms) // @ game+0x1e5d390
};

// Class BravoHotelGame.BravoHotelAchievementManager
// Size: 0x98 (Inherited: 0x28)
struct UBravoHotelAchievementManager : UObject {
	char pad_28[0x70]; // 0x28(0x70)
};

// Class BravoHotelGame.BravoHotelActionComponent
// Size: 0xf0 (Inherited: 0xb0)
struct UBravoHotelActionComponent : UActorComponent {
	char pad_B0[0x18]; // 0xb0(0x18)
	char bWalking : 1; // 0xc8(0x01)
	char bSprinting : 1; // 0xc8(0x01)
	char bIsProned : 1; // 0xc8(0x01)
	char bIsJumping : 1; // 0xc8(0x01)
	char bIsKicking : 1; // 0xc8(0x01)
	char bIsAirWalking : 1; // 0xc8(0x01)
	char bWantsToRocketJump : 1; // 0xc8(0x01)
	char bWantsToMeteorJump : 1; // 0xc8(0x01)
	char bWantsToMeteorStrike : 1; // 0xc9(0x01)
	char bWantsToJetpack : 1; // 0xc9(0x01)
	char bWantsToJetpackAim : 1; // 0xc9(0x01)
	char CustomBuoyancySwimMode : 1; // 0xc9(0x01)
	char pad_C9_4 : 4; // 0xc9(0x01)
	enum class ELeanState LeanState; // 0xca(0x01)
	enum class EFireType FireType; // 0xcb(0x01)
	enum class EGrenadeThrowingType ThrowingType; // 0xcc(0x01)
	char pad_CD[0x3]; // 0xcd(0x03)
	struct UAnimMontage* ReplicatedAnimMontage; // 0xd0(0x08)
	struct UAnimMontage* ReplicatedAnimMontage_FPP; // 0xd8(0x08)
	bool bIsSliding; // 0xe0(0x01)
	bool bIsRolling; // 0xe1(0x01)
	char pad_E2[0x6]; // 0xe2(0x06)
	struct UBravoHotelCharacterMovementComponent* BravoHotelCharacterMovement; // 0xe8(0x08)

	void OnRep_ThrowingType(); // Function BravoHotelGame.BravoHotelActionComponent.OnRep_ThrowingType // (Final|Native|Protected) // @ game+0x1e5eb60
	void OnRep_IsProned(); // Function BravoHotelGame.BravoHotelActionComponent.OnRep_IsProned // (Final|Native|Protected) // @ game+0x1e5eb40
	void OnRep_FireType(enum class EFireType& PreFireType); // Function BravoHotelGame.BravoHotelActionComponent.OnRep_FireType // (Final|Native|Protected|HasOutParms) // @ game+0x1e5eab0
	void OnRep_bWantsToRocketJump(); // Function BravoHotelGame.BravoHotelActionComponent.OnRep_bWantsToRocketJump // (Final|Native|Protected) // @ game+0x1e5ec00
	void OnRep_bWantsToMeteorJump(); // Function BravoHotelGame.BravoHotelActionComponent.OnRep_bWantsToMeteorJump // (Final|Native|Protected) // @ game+0x1e5ebe0
	void OnRep_bIsSliding(); // Function BravoHotelGame.BravoHotelActionComponent.OnRep_bIsSliding // (Final|Native|Protected) // @ game+0x1e5ebc0
	void OnRep_bIsKicking(); // Function BravoHotelGame.BravoHotelActionComponent.OnRep_bIsKicking // (Final|Native|Protected) // @ game+0x1e5eba0
	void OnRep_bIsAirWalking(); // Function BravoHotelGame.BravoHotelActionComponent.OnRep_bIsAirWalking // (Final|Native|Protected) // @ game+0x1e5eb80
	void OnRep_AnimMontageFPP(); // Function BravoHotelGame.BravoHotelActionComponent.OnRep_AnimMontageFPP // (Final|Native|Protected) // @ game+0x1e5ea90
	void OnRep_AnimMontage(); // Function BravoHotelGame.BravoHotelActionComponent.OnRep_AnimMontage // (Final|Native|Protected) // @ game+0x1e5ea70
};

// Class BravoHotelGame.BravoHotelActor
// Size: 0x320 (Inherited: 0x320)
struct ABravoHotelActor : AActor {
};

// Class BravoHotelGame.BravoHotelAggregateTickComponent
// Size: 0x100 (Inherited: 0xb0)
struct UBravoHotelAggregateTickComponent : UActorComponent {
	char pad_B0[0x50]; // 0xb0(0x50)
};

// Class BravoHotelGame.BravoHotelAIPlayerController
// Size: 0x530 (Inherited: 0x448)
struct ABravoHotelAIPlayerController : AAIController {
	float AutoRotateSpeed; // 0x448(0x04)
	struct FName DefaultWeaponName; // 0x44c(0x08)
	char pad_454[0x1c]; // 0x454(0x1c)
	struct AController* NearPlayerController; // 0x470(0x08)
	struct APawn* NearTargetPawn; // 0x478(0x08)
	struct APawn* AttackTargetPawn; // 0x480(0x08)
	char pad_488[0xa8]; // 0x488(0xa8)

	void StartDescenting(); // Function BravoHotelGame.BravoHotelAIPlayerController.StartDescenting // (Final|Native|Public|BlueprintCallable) // @ game+0x1e61330
	void SetIsParachuteLanding(bool Flag, float Height); // Function BravoHotelGame.BravoHotelAIPlayerController.SetIsParachuteLanding // (Final|Native|Public|BlueprintCallable) // @ game+0x1e61260
	void SetHealthModify(); // Function BravoHotelGame.BravoHotelAIPlayerController.SetHealthModify // (Final|Native|Public|BlueprintCallable) // @ game+0x1e61240
	void RefillCurrentWeaponsAmmo(bool bDirectToWeapon, int32_t Count); // Function BravoHotelGame.BravoHotelAIPlayerController.RefillCurrentWeaponsAmmo // (Final|Native|Public|BlueprintCallable) // @ game+0x1e61180
	void OnUpdateParachuting(float DeltaTime); // Function BravoHotelGame.BravoHotelAIPlayerController.OnUpdateParachuting // (Final|Native|Public|BlueprintCallable) // @ game+0x1e61100
	void OnTakeDamagePawn(struct AActor* DamagedActor, float Damage, struct UDamageType* DamageType, struct AController* InstigatedBy, struct AActor* DamageCauser); // Function BravoHotelGame.BravoHotelAIPlayerController.OnTakeDamagePawn // (Final|Native|Public) // @ game+0x1e60f70
	void OnChangeSurvivalCirclePhase(int32_t PrevPhase, int32_t CurrentPhase); // Function BravoHotelGame.BravoHotelAIPlayerController.OnChangeSurvivalCirclePhase // (Final|Native|Public) // @ game+0x1e60eb0
	void MoveRightOnDescent(float DeltaTime, float AxisValue); // Function BravoHotelGame.BravoHotelAIPlayerController.MoveRightOnDescent // (Final|Native|Public|BlueprintCallable) // @ game+0x1e60df0
	void MoveForwardOnDescent(float DeltaTime, float AxisValue); // Function BravoHotelGame.BravoHotelAIPlayerController.MoveForwardOnDescent // (Final|Native|Public|BlueprintCallable) // @ game+0x1e60d30
	bool IsSwimmingBlockingHit(); // Function BravoHotelGame.BravoHotelAIPlayerController.IsSwimmingBlockingHit // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1e60d00
	bool isinbluezone(); // Function BravoHotelGame.BravoHotelAIPlayerController.isinbluezone // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1e60cd0
	void GiveEquipment(); // Function BravoHotelGame.BravoHotelAIPlayerController.GiveEquipment // (Final|Native|Public|BlueprintCallable) // @ game+0x1e60cb0
	float GetTestAINoAttackTime(); // Function BravoHotelGame.BravoHotelAIPlayerController.GetTestAINoAttackTime // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1e60c80
	int32_t GetTestAIMoveMode(); // Function BravoHotelGame.BravoHotelAIPlayerController.GetTestAIMoveMode // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1e60c60
	float GetTestAIDescentDurationWeight(); // Function BravoHotelGame.BravoHotelAIPlayerController.GetTestAIDescentDurationWeight // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1e60c30
	float GetTestAIAttackTime(); // Function BravoHotelGame.BravoHotelAIPlayerController.GetTestAIAttackTime // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1e60c00
	int32_t GetTestAIAttackMode(); // Function BravoHotelGame.BravoHotelAIPlayerController.GetTestAIAttackMode // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1e60be0
	float GetDescentTargetAngle(); // Function BravoHotelGame.BravoHotelAIPlayerController.GetDescentTargetAngle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1e60bb0
	float GetDescentDuration(); // Function BravoHotelGame.BravoHotelAIPlayerController.GetDescentDuration // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1e60b80
	float GetCharacterSpeed(); // Function BravoHotelGame.BravoHotelAIPlayerController.GetCharacterSpeed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1e60b50
	enum class EBluseZoneState GetBlueZoneState(); // Function BravoHotelGame.BravoHotelAIPlayerController.GetBlueZoneState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1e60b20
	struct FVector GetBlueZoneRandomPointInCircle(); // Function BravoHotelGame.BravoHotelAIPlayerController.GetBlueZoneRandomPointInCircle // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1e60ae0
	struct FVector GetBlueZoneNearLandPos(); // Function BravoHotelGame.BravoHotelAIPlayerController.GetBlueZoneNearLandPos // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1e60aa0
	float GetBlueZoneCircleRadius(); // Function BravoHotelGame.BravoHotelAIPlayerController.GetBlueZoneCircleRadius // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1e60a70
	struct FVector GetBlueZoneCirclePos(); // Function BravoHotelGame.BravoHotelAIPlayerController.GetBlueZoneCirclePos // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1e60a30
	struct FVector GetAircraftFlightDirection(); // Function BravoHotelGame.BravoHotelAIPlayerController.GetAircraftFlightDirection // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1e609f0
	float GetAIHealthRate(); // Function BravoHotelGame.BravoHotelAIPlayerController.GetAIHealthRate // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1e609c0
	float GetAIFireTendencyWithAI(); // Function BravoHotelGame.BravoHotelAIPlayerController.GetAIFireTendencyWithAI // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1e60990
