// Class BravoHotelGame.AmbientSoundVolume
// Size: 0x360 (Inherited: 0x348)
struct AAmbientSoundVolume : AVolume 
{
	struct FString                                Ambience;                                                    // 0x348(0x10)
	uint32_t                                      Priority;                                                    // 0x358(0x04)
	char                                          UnknownData35C[0x4];                                         // 0x35c(0x04)

	void OnOverlapEnd(struct FNone* OverlappedComponent, struct FNone* OtherActor, struct FNone* OtherComp, uint32_t OtherBodyIndex); // sub_0x1e3d810
	void OnOverlapBegin(struct FNone* OverlappedComponent, struct FNone* OtherActor, struct FNone* OtherComp, uint32_t OtherBodyIndex, char bFromSweep, struct FNone& SweepResult); // sub_0x1e3d600
};

// Class BravoHotelGame.AnimNotifyState_PlaySound
// Size: 0x58 (Inherited: 0x30)
struct UAnimNotifyState_PlaySound : UAnimNotifyState 
{
	struct FNone*                                 Sound;                                                       // 0x30(0x08)
	float                                         VolumeMultiplier;                                            // 0x38(0x04)
	float                                         PitchMultiplier;                                             // 0x3c(0x04)
	char                                          bFollow : 0;                                                 // 0x40(0x01)
	char                                          UnknownData40[0x4];                                          // 0x40(0x04)
	struct FName                                  AttachName;                                                  // 0x44(0x08)
	char                                          UnknownData4C[0xc];                                          // 0x4c(0x0c)
};

// Class BravoHotelGame.BravoHotelGameModeBase
// Size: 0x3f8 (Inherited: 0x3f8)
struct ABravoHotelGameModeBase : AGameMode 
{
};

// Class BravoHotelGame.BravoHotelGameMode
// Size: 0x578 (Inherited: 0x3f8)
struct ABravoHotelGameMode : ABravoHotelGameModeBase 
{
	char                                          UnknownData3F8[0x4];                                         // 0x3f8(0x04)
	char                                          bFriendlyFire : 0;                                           // 0x3fc(0x01)
	char                                          UnknownData3FC[0x4];                                         // 0x3fc(0x04)
	struct FNone*                                 PoolingActorComponent;                                       // 0x400(0x08)
	struct FNone                                  MapDataTableHandle;                                          // 0x408(0x10)
	struct TMap<None, None>                       PCReceivedPlayerInfos;                                       // 0x418(0x50)
	struct FNone*                                 TestAIControllerClass;                                       // 0x468(0x08)
	char                                          UnknownData470[0x71];                                        // 0x470(0x71)
	char                                          UsingOuterBlueZone : 0;                                      // 0x4e1(0x01)
	char                                          UnknownData4E1[0x3];                                         // 0x4e1(0x03)
	struct FName                                  SelectedPlayZoneName;                                        // 0x4e4(0x08)
	char                                          UnknownData4EC[0x4];                                         // 0x4ec(0x04)
	struct FNone*                                 BlueZoneClass;                                               // 0x4f0(0x08)
	struct FString                                CQRType;                                                     // 0x4f8(0x10)
	char                                          UnknownData508[0x68];                                        // 0x508(0x68)
	struct FNone*                                 BlueZone;                                                    // 0x570(0x08)

	void SetTestAIChangeLocation(struct FNone* AIController); // sub_0x1f15cc0
	float GetCurrentOutOfCircleDamage(); // sub_0x1f15c90
	struct FNone* GetBlueZone(); // sub_0x1f15c60
};

// Class BravoHotelGame.BattleRoyaleGameMode
// Size: 0xe78 (Inherited: 0x578)
struct ABattleRoyaleGameMode : ABravoHotelGameMode 
{
	struct TArray<None>                           RemovePendingPlayerArray;                                    // 0x578(0x10)
	enum class None                               GameViewType;                                                // 0x588(0x01)
	enum class None                               MatchingType;                                                // 0x589(0x01)
	char                                          UnknownData58A[0x2];                                         // 0x58a(0x02)
	uint32_t                                      TeamSize;                                                    // 0x58c(0x04)
	struct FString                                Training;                                                    // 0x590(0x10)
	uint32_t                                      AIGrade;                                                     // 0x5a0(0x04)
	char                                          UnknownData5A4[0x4];                                         // 0x5a4(0x04)
	struct FMulticastInlineDelegate               UpdateSurvivalCircleDelegate;                                // 0x5a8(0x10)
	char                                          UnknownData5B8[0x38];                                        // 0x5b8(0x38)
	struct TMap<None, None>                       TeamInfoMap;                                                 // 0x5f0(0x50)
	char                                          WinnerTeamIndex;                                             // 0x640(0x01)
	char                                          UnknownData641[0x7];                                         // 0x641(0x07)
	struct TArray<None>                           SendPlayerEndedEvent;                                        // 0x648(0x10)
	struct TArray<None>                           SendPlayerRankedEvent;                                       // 0x658(0x10)
	char                                          UnknownData668[0x18];                                        // 0x668(0x18)
	struct FNone*                                 AircraftViewPawnClass;                                       // 0x680(0x08)
	struct FNone*                                 AircraftFlightPawnClass;                                     // 0x688(0x08)
	char                                          bAutoStart : 0;                                              // 0x690(0x01)
	char                                          UnknownData690[0x4];                                         // 0x690(0x04)
	float                                         StartingPlayerCountRate;                                     // 0x694(0x04)
	uint32_t                                      WaitingTime;                                                 // 0x698(0x04)
	uint32_t                                      ReadyTime;                                                   // 0x69c(0x04)
	uint32_t                                      DescentDelay;                                                // 0x6a0(0x04)
	uint32_t                                      DescentableTime;                                             // 0x6a4(0x04)
	struct FNone*                                 AircraftFlight;                                              // 0x6a8(0x08)
	char                                          bIsUseAircraft : 0;                                          // 0x6b0(0x01)
	char                                          UnknownData6B0[0x15];                                        // 0x6b0(0x15)
	char                                          bUseAircraftViewPawn : 0;                                    // 0x6c5(0x01)
	char                                          UnknownData6C5[0x1];                                         // 0x6c5(0x01)
	char                                          bEndlessGame : 0;                                            // 0x6c6(0x01)
	char                                          UnknownData6C6[0x1a];                                        // 0x6c6(0x1a)
	struct TArray<None>                           DamageInfoArray;                                             // 0x6e0(0x10)
	char                                          UnknownData6F0[0x8];                                         // 0x6f0(0x08)
	struct FNone*                                 RedZoneManagerClass;                                         // 0x6f8(0x08)
	struct FNone*                                 RedZoneManager;                                              // 0x700(0x08)
	char                                          UnknownData708[0x80];                                        // 0x708(0x80)
	struct FNone*                                 PersonalSupplyBoxManagerClass;                               // 0x788(0x08)
	struct FNone*                                 PersonalSupplyBoxManager;                                    // 0x790(0x08)
	struct FNone                                  DivisionItemCountResult;                                     // 0x798(0x10)
	char                                          DisivisonComplete : 0;                                       // 0x7a8(0x01)
	char                                          UnknownData7A8[0x1e8];                                       // 0x7a8(0x1e8)
	struct FNone                                  StandardGroupKeyCountInfo;                                   // 0x990(0x58)
	struct TMap<None, None>                       AreaSpawnRateList;                                           // 0x9e8(0x50)
	struct FNone                                  BlueZoneSpawnRateInfo;                                       // 0xa38(0x88)
	struct FName                                  BlueZoneSpawnRateKey;                                        // 0xac0(0x08)
	struct FNone                                  NoneData;                                                    // 0xac8(0x88)
	struct TMap<None, None>                       VehicleAreaSpawnRateList;                                    // 0xb50(0x50)
	struct FNone                                  VehicleBlueZoneSpawnRateInfo;                                // 0xba0(0x78)
	struct FName                                  VehicleBlueZoneSpawnRateKey;                                 // 0xc18(0x08)
	struct FNone                                  NoneVehicleData;                                             // 0xc20(0x78)
	struct FNone                                  CustomBlueZoneSpawnRateInfo;                                 // 0xc98(0x28)
	struct TMap<None, None>                       CustomAreaSpawnRateList;                                     // 0xcc0(0x50)
	struct FNone                                  CustomVehicleBlueZoneSpawnRateInfo;                          // 0xd10(0x28)
	struct TMap<None, None>                       CustomVehicleAreaSpawnRateList;                              // 0xd38(0x50)
	char                                          UnknownDataD88[0x8];                                         // 0xd88(0x08)
	float                                         ItemDivisionDelay;                                           // 0xd90(0x04)
	char                                          UsingWorldItemSpawnTalbeInBlueZone : 0;                      // 0xd94(0x01)
	char                                          UnknownDataD94[0x1];                                         // 0xd94(0x01)
	char                                          ItemSpawnInBlueZone : 0;                                     // 0xd95(0x01)
	char                                          UnknownDataD95[0x1];                                         // 0xd95(0x01)
	char                                          UnlimitItemSpawnCnt : 0;                                     // 0xd96(0x01)
	char                                          UnknownDataD96[0x2];                                         // 0xd96(0x02)
	uint32_t                                      MaxItemDivisionCountAtOnce;                                  // 0xd98(0x04)
	char                                          ItemDivisionLevelLoadComplet : 0;                            // 0xd9c(0x01)
	char                                          UnknownDataD9C[0x1];                                         // 0xd9c(0x01)
	char                                          ItemDivisionGameReady : 0;                                   // 0xd9d(0x01)
	char                                          UnknownDataD9D[0x1];                                         // 0xd9d(0x01)
	char                                          UsingMaxPickUpItemSpawnCount : 0;                            // 0xd9e(0x01)
	char                                          UnknownDataD9E[0x2];                                         // 0xd9e(0x02)
	uint32_t                                      MaxPickUpItemSpawnCount;                                     // 0xda0(0x04)
	char                                          UsingMaxVehicleSpawnCount : 0;                               // 0xda4(0x01)
	char                                          UnknownDataDA4[0x4];                                         // 0xda4(0x04)
	uint32_t                                      MaxVehicleSpawnCount;                                        // 0xda8(0x04)
	uint32_t                                      MaxPickUpVehicleSpawnCount;                                  // 0xdac(0x04)
	char                                          UsingDynamicMaxPickUpItemSpawnCount : 0;                     // 0xdb0(0x01)
	char                                          UnknownDataDB0[0x4];                                         // 0xdb0(0x04)
	struct FNone                                  ItemSpawnLimitInfo;                                          // 0xdb4(0x14)
	char                                          GCRecordData : 0;                                            // 0xdc8(0x01)
	char                                          UnknownDataDC8[0x8];                                         // 0xdc8(0x08)
	struct FString                                GCRecordDataTitle;                                           // 0xdd0(0x10)
	char                                          RecordBuildingData : 0;                                      // 0xde0(0x01)
	char                                          UnknownDataDE0[0x1];                                         // 0xde0(0x01)
	char                                          RecordPersonalSupplyBoxData : 0;                             // 0xde1(0x01)
	char                                          UnknownDataDE1[0x7];                                         // 0xde1(0x07)
	struct FNone*                                 ItemSpawnRateCurve;                                          // 0xde8(0x08)
	struct FNone*                                 VehicleSpawnRateCurve;                                       // 0xdf0(0x08)
	uint32_t                                      CurrentSpawnVehicleCount;                                    // 0xdf8(0x04)
	uint32_t                                      CurrentDivisionItemCount;                                    // 0xdfc(0x04)
	char                                          UnknownDataE00[0x18];                                        // 0xe00(0x18)
	struct TArray<None>                           CheckCharacters;                                             // 0xe18(0x10)
	char                                          UnknownDataE28[0x10];                                        // 0xe28(0x10)
	struct TArray<None>                           LoadCompleteList;                                            // 0xe38(0x10)
	char                                          UnknownDataE48[0x8];                                         // 0xe48(0x08)
	struct TArray<None>                           AutoBotIds;                                                  // 0xe50(0x10)
	struct TArray<None>                           AutoBotInfoSendIDList;                                       // 0xe60(0x10)
	char                                          UnknownDataE70[0x8];                                         // 0xe70(0x08)

	void UpdateSurvivalCircleDelegate__DelegateSignature(); // sub_0x239bfb0
	void UpdateItemSpawnState(); // sub_0x1e3e980
	void UpdateCheckStartPlayCharacters(); // sub_0x1e3e960
	void ServerCheat(char Active, enum class None Type); // sub_0x1e3e890
	void OnBattleRoyalStateChanged(enum class None PrevState, enum class None CurrentState); // sub_0x1e3e7d0
	struct FString GetSpawnAreaName(struct FNone* Player); // sub_0x1e3e6f0
	struct FNone* GetRedZoneManager(); // sub_0x1e3e6c0
	enum class None GetBattleRoyaleState(); // sub_0x1e3e690
	void DestroyRedZoneManager(); // sub_0x1e3e670
	char CreateRedZoneManager(); // sub_0x1e3e640
	void Cheat(char Active, uint8_t Type); // sub_0x1e3e580
	void AddAIPlayerByTimer(char bByTimer); // sub_0x1e3e4f0
};

// Class BravoHotelGame.BattleRoyaleGameMode_Login
// Size: 0x628 (Inherited: 0x3f8)
struct ABattleRoyaleGameMode_Login : ABravoHotelGameModeBase 
{
	float                                         MatchingTimeout;                                             // 0x3f8(0x04)
	char                                          UnknownData3FC[0x4];                                         // 0x3fc(0x04)
	struct TArray<None>                           PlayerPawnList;                                              // 0x400(0x10)
	struct FNone*                                 CustomizeCharacter;                                          // 0x410(0x08)
	struct FNone*                                 RankingCharacter;                                            // 0x418(0x08)
	struct FNone*                                 AppearingMotionCharacter;                                    // 0x420(0x08)
	char                                          UnknownData428[0x110];                                       // 0x428(0x110)
	struct FNone                                  Loading_TimerHandle;                                         // 0x538(0x08)
	struct FNone                                  PartyInfo_TimerHandle;                                       // 0x540(0x08)
	struct FNone                                  Ping_TimerHandle;                                            // 0x548(0x08)
	struct FNone                                  GeeGeeLoginToken_TimerHandle;                                // 0x550(0x08)
	struct FNone                                  SteamLoginToken_TimerHandle;                                 // 0x558(0x08)
	struct FNone                                  DuplicatedReconnect_TimerHandle;                             // 0x560(0x08)
	struct FMulticastInlineDelegate               OnLoginSucceeded;                                            // 0x568(0x10)
	struct FMulticastInlineDelegate               OnLoginNotify;                                               // 0x578(0x10)
	struct FMulticastInlineDelegate               OnLoginFailed;                                               // 0x588(0x10)
	struct FMulticastInlineDelegate               OnMatchingPending;                                           // 0x598(0x10)
	struct FMulticastInlineDelegate               OnMatchingStarted;                                           // 0x5a8(0x10)
	struct FMulticastInlineDelegate               OnMatchingSucceeded;                                         // 0x5b8(0x10)
	struct FMulticastInlineDelegate               OnMatchingFailed;                                            // 0x5c8(0x10)
	struct FMulticastInlineDelegate               OnPartyInvited;                                              // 0x5d8(0x10)
	struct FMulticastInlineDelegate               OnPartyInfoChanged;                                          // 0x5e8(0x10)
	struct FMulticastInlineDelegate               OnPartyMemberInfoChanged;                                    // 0x5f8(0x10)
	struct FMulticastInlineDelegate               OnMatchingSettingsChanged;                                   // 0x608(0x10)
	struct FMulticastInlineDelegate               OnCreateCharacter;                                           // 0x618(0x10)

	void UpdatePCInfo(); // sub_0x1e402e0
	void StartTutorialPlay(char bOpeningTutorial); // sub_0x1e40250
	void StartLoginEx(); // sub_0x1e40230
	void StartLogin(struct TMap<None, None>& AppIDs, struct TMap<None, None>& LoginKeys, enum class None Type); // sub_0x1e40000
	void SetVisibleRankingCharacter(char bState); // sub_0x1e3ff70
	void SetRankingCharacter(struct FNone* SpawnCharacter); // sub_0x1e3fef0
	void SetPawnList(struct TArray<None>& PawnList); // sub_0x1e3fe40
	void SetCustomizeCharacter(struct FNone* SpawnCustomizeCharacter); // sub_0x1e3fdc0
	void SetAppearingMotionCharacter(struct FNone* MeshComponent); // sub_0x1e3fd40
	void PartyMemberInfoChanged__DelegateSignature(struct FString MemberUID, struct FNone& MemberInfo); // sub_0x239bfb0
	void PartyInvited__DelegateSignature(struct FNone& Invitation); // sub_0x239bfb0
	void PartyInfoChanged__DelegateSignature(struct FNone& PartyInfo); // sub_0x239bfb0
	void OnReadFriendsListComplete(uint32_t LocalPlayerNum, char bWasSuccessful, struct FString ListName, struct FString PlatformName); // sub_0x1e3fbc0
	void MatchingSucceeded__DelegateSignature(); // sub_0x239bfb0
	void MatchingStarted__DelegateSignature(); // sub_0x239bfb0
	void MatchingSettingsChanged__DelegateSignature(struct FNone& Settings); // sub_0x239bfb0
	void MatchingPending__DelegateSignature(); // sub_0x239bfb0
	void MatchingFailed__DelegateSignature(uint32_t ErrorCode, struct FString ExtraDescription); // sub_0x239bfb0
	void LoginSucceeded__DelegateSignature(); // sub_0x239bfb0
	void LoginNotify__DelegateSignature(struct FString Parameters); // sub_0x239bfb0
	void LoginFailed__DelegateSignature(uint32_t ErrorIndex, struct FString ErrorID, struct FString Parameters); // sub_0x239bfb0
	struct TArray<None> GetServicePlatforms(); // sub_0x1e3fae0
	struct FString GetServicePlatformName(); // sub_0x1e3fa60
	struct FNone* GetLobbyPawn(uint32_t Index); // sub_0x1e3f9d0
	struct FNone* GetCustomizePawn(); // sub_0x1e3f9a0
	void EquipDefaultWeapon(struct FNone* TargetCharacter, struct FName& ItemRowName, uint32_t TargetWeaponSlotIndex); // sub_0x1e3f890
	void CreateCharacter__DelegateSignature(); // sub_0x239bfb0
};

// Class BravoHotelGame.BattleRoyaleGameMode_StoreWeb
// Size: 0x3f8 (Inherited: 0x3f8)
struct ABattleRoyaleGameMode_StoreWeb : ABravoHotelGameModeBase 
{

	void ChangeLevel(struct FString NextLevelName); // sub_0x1e40480
};

// Class BravoHotelGame.BravoHotelGameState
// Size: 0x668 (Inherited: 0x380)
struct ABravoHotelGameState : AGameState 
{
	char                                          MatchWinnerTeam;                                             // 0x380(0x01)
	char                                          UnknownData381[0x7];                                         // 0x381(0x07)
	struct FNone*                                 WinnerPlayerState;                                           // 0x388(0x08)
	uint32_t                                      TimeRemaining;                                               // 0x390(0x04)
	struct FName                                  CurrentSeasonID;                                             // 0x394(0x08)
	uint32_t                                      PerkMode;                                                    // 0x39c(0x04)
	uint32_t                                      RecipeMode;                                                  // 0x3a0(0x04)
	uint32_t                                      MaxPerkCount;                                                // 0x3a4(0x04)
	uint32_t                                      OverrideUltimateLevel;                                       // 0x3a8(0x04)
	char                                          UnknownData3AC[0x4];                                         // 0x3ac(0x04)
	struct TMap<None, None>                       PerkClassNumCap;                                             // 0x3b0(0x50)
	struct TMap<None, None>                       PerkClassWeightModifier;                                     // 0x400(0x50)
	struct TArray<None>                           PerkClassBlock;                                              // 0x450(0x10)
	char                                          bBlockSpawnVehicle : 0;                                      // 0x460(0x01)
	char                                          UnknownData460[0x1];                                         // 0x460(0x01)
	char                                          bBlockRedZone : 0;                                           // 0x461(0x01)
	char                                          UnknownData461[0x1];                                         // 0x461(0x01)
	char                                          PerkLevelUpAllUserSame : 0;                                  // 0x462(0x01)
	char                                          UnknownData462[0x6];                                         // 0x462(0x06)
	struct FString                                CQRKey;                                                      // 0x468(0x10)
	enum class None                               GameViewType;                                                // 0x478(0x01)
	enum class None                               MatchingType;                                                // 0x479(0x01)
	char                                          UnknownData47A[0x2];                                         // 0x47a(0x02)
	struct FName                                  ExpertWeaponTableID;                                         // 0x47c(0x08)
	uint32_t                                      PersonalSupplyBoxPositionType;                               // 0x484(0x04)
	char                                          NoDelaySpawnPersonalSupplyBox : 0;                           // 0x488(0x01)
	char                                          UnknownData488[0x1];                                         // 0x488(0x01)
	char                                          MustSpawnPersonalSupplyBox : 0;                              // 0x489(0x01)
	char                                          UnknownData489[0x3];                                         // 0x489(0x03)
	uint32_t                                      RetiredPlayerCount;                                          // 0x48c(0x04)
	struct TMap<None, None>                       UniqueIDPlayerStates;                                        // 0x490(0x50)
	struct FNone                                  MatchID;                                                     // 0x4e0(0x10)
	struct FString                                GameServerID;                                                // 0x4f0(0x10)
	char                                          UnknownData500[0x10];                                        // 0x500(0x10)
	struct FNone                                  DefaultClassSelectInfo;                                      // 0x510(0x28)
	struct FNone                                  DefaultClassChangeInfo;                                      // 0x538(0x48)
	struct FNone                                  CurrentGameSettingInfo;                                      // 0x580(0x88)
	char                                          IsUsingOuterAreaBlueZone : 0;                                // 0x608(0x01)
	char                                          UnknownData608[0x8];                                         // 0x608(0x08)
	struct FNone*                                 BlueZone;                                                    // 0x610(0x08)
	struct FMulticastInlineDelegate               OnBlueZoneDelegate;                                          // 0x618(0x10)
	struct FMulticastInlineDelegate               OnChangePerkModeDelegate;                                    // 0x628(0x10)
	char                                          UnknownData638[0x1c];                                        // 0x638(0x1c)
	float                                         RecoilModifier_AR;                                           // 0x654(0x04)
	float                                         RecoilModifier_SMG;                                          // 0x658(0x04)
	float                                         RecoilModifier_SG;                                           // 0x65c(0x04)
	float                                         RecoilModifier_DMR;                                          // 0x660(0x04)
	float                                         RecoilModifier_SR;                                           // 0x664(0x04)

	void ShowTimeHUDMessage(); // sub_0x1f1ab10
	void OnRep_TimeRemaining(); // sub_0x1f1aaf0
	void OnRep_RecipeMode(); // sub_0x1f1aad0
	void OnRep_PerkMode(); // sub_0x1f1aab0
	void OnRep_OverrideUltimateLevel(); // sub_0x1f1aa90
	void OnRep_CurrentGameSettingInfo(); // sub_0x1f1aa70
	void OnRep_BlueZone(); // sub_0x1f1aa50
	void OnChangePerkModeDelegate__DelegateSignature(uint32_t PerkMode); // sub_0x239bfb0
	char IsDuplicateSelectPossible(); // sub_0x1f1aa20
	char IsCurrentStatusParty(); // sub_0x1f1a9f0
	struct FNone* GetPlayerStateByUniqueID(uint32_t UniqueID); // sub_0x1f1a960
	struct FString GetMatchIDString(); // sub_0x1f1a8d0
	struct FNone* GetBlueZone(); // sub_0x1f1a8a0
	void ChangeRemainTime(uint32_t RemainTime); // sub_0x1f1a810
	void BlueZoneDelegate__DelegateSignature(); // sub_0x239bfb0
};

// Class BravoHotelGame.BattleRoyaleGameState
// Size: 0x840 (Inherited: 0x668)
struct ABattleRoyaleGameState : ABravoHotelGameState 
{
	char                                          IsNewItemSpawnMode : 0;                                      // 0x668(0x01)
	char                                          UnknownData668[0x4];                                         // 0x668(0x04)
	uint32_t                                      TeamSize;                                                    // 0x66c(0x04)
	enum class None                               GameRule;                                                    // 0x670(0x01)
	enum class None                               BattleRoyaleState;                                           // 0x671(0x01)
	char                                          UnknownData672[0x2];                                         // 0x672(0x02)
	uint32_t                                      TotalPlayerCount;                                            // 0x674(0x04)
	uint32_t                                      TotalAIPlayerCount;                                          // 0x678(0x04)
	uint32_t                                      CurrentPlayerCount;                                          // 0x67c(0x04)
	uint32_t                                      CurrentTeamCount;                                            // 0x680(0x04)
	uint32_t                                      TotalTeamCount;                                              // 0x684(0x04)
	struct FMulticastInlineDelegate               OnBattleRoyalStateChanged;                                   // 0x688(0x10)
	struct FMulticastInlineDelegate               OnRocketLaunch;                                              // 0x698(0x10)
	struct FMulticastInlineDelegate               OnItemSpawnModeChanged;                                      // 0x6a8(0x10)
	struct FMulticastInlineDelegate               OnChangeRemainTime;                                          // 0x6b8(0x10)
	char                                          bCheckSeaLevelZ : 0;                                         // 0x6c8(0x01)
	char                                          UnknownData6C8[0x4];                                         // 0x6c8(0x04)
	float                                         SeaLevelZ;                                                   // 0x6cc(0x04)
	char                                          UnknownData6D0[0x4];                                         // 0x6d0(0x04)
	uint32_t                                      GhostPlayerCountForTest;                                     // 0x6d4(0x04)
	struct FMulticastInlineDelegate               OnRepTeamSize;                                               // 0x6d8(0x10)
	struct TArray<None>                           CharacterDiedInfos;                                          // 0x6e8(0x10)
	struct TArray<None>                           TeamEndInfos;                                                // 0x6f8(0x10)
	struct TArray<None>                           AirCraftBoardingInfos;                                       // 0x708(0x10)
	struct FNone*                                 redzone;                                                     // 0x718(0x08)
	struct FNone*                                 RedZoneManager;                                              // 0x720(0x08)
	char                                          UnknownData728[0x58];                                        // 0x728(0x58)
	struct FMulticastInlineDelegate               AirCraftDescentPlayerInfoEvent;                              // 0x780(0x10)
	struct FMulticastInlineDelegate               EndAirCraftBoardingPlayerEvent;                              // 0x790(0x10)
	struct F µòÁâáÁô°Áç•ÊΩ¥ÊïÆ„ÖüÊÑ∏‰µü”™Â°î‰ú≠ÊÖ≤Êï∂Áë≥ÊπØÂΩ•„†±ÂΩ°M·êÑ‰úØÊµ°‚Ω•ÁâÇÁô°‰°ØÁëØÊ±•‰îØÁôÆÁâ©ÊπØÊï≠ÁëÆ‚Ω≥ÁâêÁÅØ‚Ω≥ÊÖêÊ≠≤ÂêØ‚µòÁâáÁô°Áç•ÊΩ¥ÊïÆ„ÖüÊÑ∏‰πüÂêÆ‚µòÁâáÁô°Áç•ÊΩ¥ÊïÆ„ÖüÊÑ∏‰πü‡ºä‰úØÊµ°‚Ω•ÁâÇÁô°‰°ØÁëØÊ±•‰îØÁôÆÁâ©ÊπØÊï≠ÁëÆ‚Ω≥ÁâêÁÅØ‚Ω≥ÊÖêÊ≠≤ÂêØ‚µòÁâáÁô°Áç•ÊΩ¥ÊïÆ„ÖüÊÑ∏‰πü”ûÂ°î‰ú≠ÊÖ≤Êï∂Áë≥ÊπØÂΩ•„†±ÂΩ°N·ê§‰úØÊµ°‚Ω•ÁâÇÁô°‰°ØÁëØÊ±•‰îØÁôÆ_6619218* AircraftFlightRef;                                           // 0x7a0(0x08)
	struct FMulticastInlineDelegate               OnRepCurrentPlayerCount;                                     // 0x7a8(0x10)
	struct FMulticastInlineDelegate               OnRepCurrentTeamCount;                                       // 0x7b8(0x10)
	struct TArray<None>                           RestoreList;                                                 // 0x7c8(0x10)
	char                                          UnknownData7D8[0x8];                                         // 0x7d8(0x08)
	struct FNone                                  TimerHandle_MoveToLobbyLevel;                                // 0x7e0(0x08)
	struct TMap<None, None>                       CurrentClassCounts;                                          // 0x7e8(0x50)
	uint32_t                                      AutoBotCount;                                                // 0x838(0x04)
	char                                          UnknownData83C[0x4];                                         // 0x83c(0x04)

	void SetDescentPlayerInfo(uint32_t PlayerId); // sub_0x1e41b10
	void SetAutoBotCount(uint32_t Count); // sub_0x1e41a90
	void SetAirCraftBoardingPlayerInfo(char IsTeam, uint32_t TeamID, uint32_t PlayerId); // sub_0x1e41990
	void ResetAirCraftBoardingPlayerInfo(); // sub_0x1e41970
	void RemainTimeDelegate__DelegateSignature(uint32_t RemainTime); // sub_0x239bfb0
	void OnRocketLaunch__DelegateSignature(); // sub_0x239bfb0
	void OnRepTeamSize__DelegateSignature(); // sub_0x239bfb0
	void OnRepCurrentPlayerCount__DelegateSignature(); // sub_0x239bfb0
	void OnRep_TeamSize(); // sub_0x1e41950
	void OnRep_CurrentTeamCount(); // sub_0x1e41930
	void OnRep_CurrentPlayerCount(); // sub_0x1e41910
	void OnRep_ChangeNewItemSpawnMode(); // sub_0x1e418f0
	void OnRep_BattleRoyaleState(); // sub_0x1e418d0
	void MulticastOnRocketLaunch(); // sub_0x1e418b0
	void MulticastMoveToLobbyLevel(); // sub_0x1e41890
	void ItemSpawnModeDelegate__DelegateSignature(); // sub_0x239bfb0
	float GetSeaLevelZ(); // sub_0x1e41860
	struct FNone* GetRedZone(); // sub_0x1e41830
	void FindAirCraftFlightActor(); // sub_0x1e41810
	void EndAirCraftBoardingPlayer__DelegateSignature(); // sub_0x239bfb0
	void EndAirCraftBoardingPlayer(); // sub_0x1e417f0
	void DoRestore(); // sub_0x1e417d0
	void DoMoveToLobbyLevel(float DelayTime); // sub_0x1e41750
	void ClientExcuteEndAirCraftBoardingPlayerEvent(); // sub_0x1e41730
	void ClientExcuteAirCraftDescentPlayerInfoEvent(uint32_t AirCraftID, uint32_t SeatID, uint32_t PlayerId); // sub_0x1e41640
	void BattleRoyalStateChanged__DelegateSignature(enum class None PrevState, enum class None CurrentState); // sub_0x239bfb0
	void AirCraftDescentPlayerInfo__DelegateSignature(uint32_t AirCraftID, uint32_t SeatID, uint32_t PlayerId); // sub_0x239bfb0
};

// Class BravoHotelGame.BHPersonalSupplyBox
// Size: 0x378 (Inherited: 0x310)
struct ABHPersonalSupplyBox : AActor 
{
	char                                          NeedInit : 0;                                                // 0x310(0x01)
	char                                          UnknownData310[0x10];                                        // 0x310(0x10)
	struct FNone*                                 RootBoxComponent;                                            // 0x320(0x08)
	struct FNone*                                 InteractiveSphereComponent;                                  // 0x328(0x08)
	struct FNone*                                 InteractiveCancleSphereComponent;                            // 0x330(0x08)
	struct FName                                  BoxName;                                                     // 0x338(0x08)
	struct TArray<None>                           RelatedPlayerIds;                                            // 0x340(0x10)
	char                                          UnknownData350[0x9];                                         // 0x350(0x09)
	enum class None                               CurrentStateType;                                            // 0x359(0x01)
	char                                          CheckRePosition : 0;                                         // 0x35a(0x01)
	char                                          UnknownData35A[0x6];                                         // 0x35a(0x06)
	struct FNone                                  TimeHandle_CheckRePosition;                                  // 0x360(0x08)
	uint32_t                                      CustomIndex;                                                 // 0x368(0x04)
	char                                          TraceLand : 0;                                               // 0x36c(0x01)
	char                                          UnknownData36C[0x4];                                         // 0x36c(0x04)
	struct FNone                                  TimerHandle_Destroy;                                         // 0x370(0x08)

	void UpdateCheckRePosition(); // sub_0x1e42a70
	void RequestRePosition(float StartZ, float EndZ); // sub_0x1e429b0
	void RePosition(struct FNone& NewLocation); // sub_0x1e42920
	void OnRep_SetStateType(); // sub_0x1e42900
	void OnRep_RelatedPlayerIds(); // sub_0x1e428e0
	void OnRep_CheckRePosition(); // sub_0x1e428c0
	void OnRecall(); // sub_0x239bfb0
	void OnOverlapEnd(struct FNone* OverlappedComponent, struct FNone* OtherActor, struct FNone* OtherComp, uint32_t OtherBodyIndex); // sub_0x1e42780
	void OnOverlapBegin(struct FNone* OverlappedComponent, struct FNone* OtherActor, struct FNone* OtherComp, uint32_t OtherBodyIndex, char bFromSweep, struct FNone& SweepResult); // sub_0x1e42570
	void OnChangeState(enum class None StateType); // sub_0x239bfb0
	void OnAssigned(); // sub_0x239bfb0
	char IsReplatedBP(); // sub_0x1e42540
	void GetRelatedPlayerIds(struct TArray<None>& outList); // sub_0x1e42490
	void DestroyBox(); // sub_0x1e42470
	void ChangeBoxMesh(char IsMyBox); // sub_0x239bfb0
};

// Class BravoHotelGame.BravoHotelDropBoxActor
// Size: 0x390 (Inherited: 0x310)
struct ABravoHotelDropBoxActor : AActor 
{
	enum class None                               RootType;                                                    // 0x310(0x01)
	char                                          UnknownData311[0x7];                                         // 0x311(0x07)
	struct FNone*                                 RootBoxComponent;                                            // 0x318(0x08)
	struct FNone*                                 InventoryComponent;                                          // 0x320(0x08)
	struct FNone*                                 InteractiveSphereComponent;                                  // 0x328(0x08)
	struct FNone*                                 InteractiveCancleSphereComponent;                            // 0x330(0x08)
	struct FName                                  DropperNickName;                                             // 0x338(0x08)
	struct FName                                  BoxName;                                                     // 0x340(0x08)
	uint32_t                                      RarityIndex;                                                 // 0x348(0x04)
	char                                          UnknownData34C[0x4];                                         // 0x34c(0x04)
	struct FNone*                                 DetectedCharacter;                                           // 0x350(0x08)
	char                                          UnknownData358[0x38];                                        // 0x358(0x38)

	void SetItemInBlueprint(struct FName& ItemKey); // sub_0x239bfb0
	void OnOverlapEnd(struct FNone* OverlappedComponent, struct FNone* OtherActor, struct FNone* OtherComp, uint32_t OtherBodyIndex); // sub_0x1f0c870
	void OnOverlapBegin(struct FNone* OverlappedComponent, struct FNone* OtherActor, struct FNone* OtherComp, uint32_t OtherBodyIndex, char bFromSweep, struct FNone& SweepResult); // sub_0x1f0c670
	void OnDeactivated(); // sub_0x239bfb0
	void OnBoxChanged(); // sub_0x1f0c650
	void OnActivated(); // sub_0x239bfb0
	void AddItemsToBox(struct TArray<None>& ItemsToSpawn); // sub_0x1f0c570
};

// Class BravoHotelGame.BHPersonalSupplyBoxDummy
// Size: 0x398 (Inherited: 0x390)
struct ABHPersonalSupplyBoxDummy : ABravoHotelDropBoxActor 
{
	uint32_t                                      playerGUID;                                                  // 0x390(0x04)
	char                                          UnknownData394[0x4];                                         // 0x394(0x04)
};

// Class BravoHotelGame.BHPersonalSupplyBoxManager
// Size: 0x3d0 (Inherited: 0x310)
struct ABHPersonalSupplyBoxManager : AInfo 
{
	struct FNone*                                 SupplyBoxClass;                                              // 0x310(0x08)
	struct TArray<None>                           ListPhaseInfo;                                               // 0x318(0x10)
	uint32_t                                      CurrentPhaseNum;                                             // 0x328(0x04)
	char                                          UnknownData32C[0x4];                                         // 0x32c(0x04)
	struct TArray<None>                           ListUsableSupplyBox;                                         // 0x330(0x10)
	struct TMap<None, None>                       MapSupplyBox;                                                // 0x340(0x50)
	struct FName                                  TestRandomTableID;                                           // 0x390(0x08)
	char                                          UseTestRandom : 0;                                           // 0x398(0x01)
	char                                          UnknownData398[0x18];                                        // 0x398(0x18)
	struct TArray<None>                           SpawnedSupplyBoxList;                                        // 0x3b0(0x10)
	struct TArray<None>                           ForceSpawnedSupplyBoxList;                                   // 0x3c0(0x10)

	void SetCurrentPhaseNum(uint32_t PhaseNum); // sub_0x1e42f40
	void RecallAll(); // sub_0x1e42f20
	void ReassignAll(char Force); // sub_0x1e42e90
};

// Class BravoHotelGame.BravoHotelCharacter
// Size: 0x3a90 (Inherited: 0x5e0)
struct ABravoHotelCharacter : ACharacter 
{
	char                                          UnknownData5E0[0x2c10];                                      // 0x5e0(0x2c10)
	struct FNone*                                 AudioComponent;                                              // 0x31f0(0x08)
	struct FNone*                                 CameraBase;                                                  // 0x2f38(0x08)
	struct FNone*                                 CameraAssistant3P;                                           // 0x1378(0x08)
	struct FNone*                                 Camera3P;                                                    // 0x8d8(0x08)
	struct FNone*                                 CharacterBackLight;                                          // 0x1dd0(0x08)
	char                                          UnknownData3218[0x4b8];                                      // 0x3218(0x4b8)
	struct FNone*                                 CharacterBackLightSecond;                                    // 0x36d0(0x08)
	char                                          UnknownData36D8[0xb8];                                       // 0x36d8(0xb8)
	float                                         BackLightIntensity_FPP;                                      // 0x3790(0x04)
	float                                         BackLightIntensity_ADS;                                      // 0x3700(0x04)
	struct TArray<None>                           BuffParticleComponents;                                      // 0x24f0(0x10)
	struct FNone*                                 MutableComponent;                                            // 0x2520(0x08)
	struct FNone*                                 InteractiveSphereComponent;                                  // 0xe10(0x08)
	struct FNone*                                 InteractiveCancleSphereComponent;                            // 0x2ad8(0x08)
	struct FNone*                                 Parachute;                                                   // 0x2778(0x08)
	char                                          UnknownData37C8[0xb0];                                       // 0x37c8(0xb0)
	struct FNone*                                 WaterParticleSystem;                                         // 0x3878(0x08)
	struct FNone*                                 FlameDamageParticleComponent;                                // 0x3748(0x08)
	struct FNone*                                 FlameDamageParticle;                                         // 0x36e8(0x08)
	struct FNone*                                 STMComponent;                                                // 0x2e70(0x08)
	struct FNone*                                 ActionComponent;                                             // 0xad8(0x08)
	struct FNone*                                 PerkComponent;                                               // 0x1eb0(0x08)
	struct FNone*                                 TeamInfoUpdaterComponentRef;                                 // 0x1050(0x08)
	struct FNone                                  TimeHandle_MolotovDotDamage;                                 // 0xb18(0x08)
	struct FNone                                  Stand_FlameDotDamageAnim;                                    // 0xe68(0x10)
	struct FNone                                  Prone_FlameDotDamageAnim;                                    // 0x868(0x10)
	struct TArray<None>                           FlameDamageInfos;                                            // 0x2858(0x10)
	struct FString                                NPCNickName;                                                 // 0x1e98(0x10)
	char                                          bAllowToggleCamera : 0;                                      // 0x16f8(0x01)
	char                                          bThirdPerson : 0;                                            // 0x1cb0(0x01)
	float                                         SprintingMoveRightModifier;                                  // 0x1120(0x04)
	float                                         LeanValue;                                                   // 0xf84(0x04)
	float                                         LeanDegreeMax;                                               // 0x2da8(0x04)
	float                                         LeanUpdateSpeed;                                             // 0x10d8(0x04)
	enum class None                               SaveLeanState;                                               // 0x2af4(0x01)
	enum class None                               PrevLeanState;                                               // 0xa7c(0x01)
	char                                          bFixLeanDegreeMax : 0;                                       // 0x1fe8(0x01)
	char                                          bFixFPPFoV : 0;                                              // 0x1600(0x01)
	float                                         Health;                                                      // 0xd28(0x04)
	float                                         ShortTimeHealth;                                             // 0x1334(0x04)
	float                                         TargetHealth;                                                // 0x2e28(0x04)
	float                                         BandageTargetHealth;                                         // 0x9d8(0x04)
	float                                         OverHealHealth;                                              // 0x7e8(0x04)
	struct FNone*                                 PP_Preset_ShortHealth;                                       // 0x1088(0x08)
	struct FNone*                                 PPInst_ShortHealth;                                          // 0x1fa0(0x08)
	struct TMap<None, None>                       TargetHealthMap;                                             // 0x17b0(0x50)
	float                                         Oxygen;                                                      // 0x3300(0x04)
	float                                         SteadyPoint;                                                 // 0x1478(0x04)
	uint8_t                                       BoostPercent;                                                // 0xd08(0x01)
	float                                         Default3PFOV;                                                // 0x3730(0x04)
	float                                         Default3PFOV_AOS;                                            // 0x2794(0x04)
	float                                         Default3PFOV_AMP;                                            // 0xc44(0x04)
	float                                         Default3PFOV_HeartBeatSensor;                                // 0xa78(0x04)
	float                                         Default3PFOV_SkillMAP;                                       // 0x36e0(0x04)
	float                                         ForwardAxisValue;                                            // 0x2400(0x04)
	float                                         RightAxisValue;                                              // 0x2180(0x04)
	float                                         InputMovementAttenuationTime;                                // 0x2854(0x04)
	float                                         InputMovementAttenuationTimeIdleToCrouch;                    // 0x31d8(0x04)
	float                                         InputMovementAttenuationTimeIdleToProne;                     // 0x9e8(0x04)
	float                                         InputMovementAttenuationTimeProneToIdle;                     // 0xde4(0x04)
	float                                         InputMovementAttenuationValueIdleToCrouch;                   // 0x14b4(0x04)
	float                                         InputMovementAttenuationValueIdleToProne;                    // 0xa8c(0x04)
	float                                         InputMovementAttenuationValueProneToIdle;                    // 0x1fd8(0x04)
	float                                         InputMovementAttenuationValue;                               // 0xeb4(0x04)
	char                                          bMovementKeyPushed : 0;                                      // 0x2ad0(0x01)
	char                                          bLastMovementKeyPushed : 0;                                  // 0x7b4(0x01)
	char                                          bMovementInputLock : 0;                                      // 0x27e9(0x01)
	struct FNone                                  InputAxisOnLockMovement;                                     // 0x33d0(0x08)
	char                                          bInputKeyJump : 0;                                           // 0x2825(0x01)
	float                                         DoubleTapDelay_ToggleLean;                                   // 0xae8(0x04)
	char                                          bShouldSprint : 0;                                           // 0xeb0(0x01)
	enum class None                               FireTypeComplete;                                            // 0x20b4(0x01)
	struct FNone*                                 PerBoneDamageTable;                                          // 0x3760(0x08)
	struct FNone*                                 MeleeDamageTable;                                            // 0x2e00(0x08)
	struct FNone*                                 PistolsDamageTable;                                          // 0xeb8(0x08)
	struct FNone*                                 ShotgunsDamageTable;                                         // 0x2880(0x08)
	struct FNone*                                 SMGsDamageTable;                                             // 0x1460(0x08)
	struct FNone*                                 ARsDamageTable;                                              // 0x13c0(0x08)
	struct FNone*                                 DMRsDamageTable;                                             // 0x1240(0x08)
	struct FNone*                                 SRsDamageTable;                                              // 0x36a8(0x08)
	struct FNone*                                 BrokenHelmetClass;                                           // 0x1a58(0x08)
	char                                          bNeedToSpawnBrokenEquipment : 0;                             // 0xfd4(0x01)
	float                                         BrokenEquipmentLevel;                                        // 0x14ec(0x04)
	struct FNone                                  BrokenEquipmentDamagedDirection;                             // 0x254c(0x0c)
	enum class None                               BrokenEquipmentType;                                         // 0x2110(0x01)
	enum class None                               InteractionType;                                             // 0x30b1(0x01)
	float                                         InteractionTraceDistance;                                    // 0xc40(0x04)
	struct FNone*                                 DetectedInteractionActor;                                    // 0x1620(0x08)
	struct FNone*                                 DetectedInteractionComponet;                                 // 0x2728(0x08)
	struct FNone*                                 DetectedVehicleSeatComponent;                                // 0x2538(0x08)
	struct TArray<None>                           DetectedInteractionCancleActors;                             // 0x2010(0x10)
	struct TMap<None, None>                       InteractionDistRatioMap;                                     // 0x11e0(0x50)
	float                                         ResurrectionCameraBlendTime;                                 // 0x32a0(0x04)
	struct FNone*                                 PostProcessResurrectionClass;                                // 0x1390(0x08)
	struct FNone*                                 ResurrectionEffectCurve;                                     // 0xdd8(0x08)
	struct TScriptInterface<INone>                ResurrectionMaterialController;                              // 0x33e0(0x10)
	struct FNone*                                 DetectedPickableItem;                                        // 0xc58(0x08)
	struct TArray<None>                           DetectedItemList;                                            // 0x24c0(0x10)
	struct TArray<None>                           DetectedBoxList;                                             // 0x14d0(0x10)
	struct TArray<None>                           DetectedStealableList;                                       // 0x2700(0x10)
	struct TArray<None>                           DetectedItemHideList;                                        // 0xec0(0x10)
	struct FNone                                  TimerHandle_CheckDetectedItemList;                           // 0x1d70(0x08)
	struct FNone*                                 InventoryComponent;                                          // 0x15e8(0x08)
	struct FNone*                                 AbilityComponent;                                            // 0x13d0(0x08)
	struct FNone*                                 DoorComponent;                                               // 0x1ae8(0x08)
	struct FNone*                                 ParkourComponent;                                            // 0xf50(0x08)
	struct FNone*                                 BlueZoneGameRule;                                            // 0x2468(0x08)
	struct FNone*                                 VoiceComponent;                                              // 0x15f0(0x08)
	struct FNone*                                 LadderComponent;                                             // 0xae0(0x08)
	struct FNone*                                 StationaryCharInfo;                                          // 0x16b8(0x08)
	struct FNone*                                 CharacterReplication;                                        // 0x2198(0x08)
	struct FNone                                  CombineAnim_Stand;                                           // 0x13e0(0x10)
	struct FNone                                  CombineAnim_Prone;                                           // 0x3858(0x10)
	struct FNone                                  RepairAnim_Stand;                                            // 0x2e08(0x10)
	struct FNone                                  RepairAnim_Prone;                                            // 0x10c8(0x10)
	struct FNone*                                 CurrentPickupMontage;                                        // 0x9b8(0x08)
	struct FNone                                  PickUpAnim_Unarmed_Floor;                                    // 0x2fd0(0x10)
	struct FNone                                  PickUpAnim_Unarmed_Table;                                    // 0x1830(0x10)
	struct FNone                                  PickUpAnim_Unarmed_Crouch;                                   // 0x3328(0x10)
	struct FNone                                  PickUpAnim_Unarmed_Prone;                                    // 0xce0(0x10)
	struct FNone                                  PickUpAnim_Rifle_Floor;                                      // 0xf98(0x10)
	struct FNone                                  PickUpAnim_Rifle_Table;                                      // 0x2c88(0x10)
	struct FNone                                  PickUpAnim_Rifle_Crouch;                                     // 0x25e0(0x10)
	struct FNone                                  PickUpAnim_Rifle_Prone;                                      // 0x32a8(0x10)
	struct FNone                                  PickUpAnim_Pistol_Floor;                                     // 0x2d38(0x10)
	struct FNone                                  PickUpAnim_Pistol_Table;                                     // 0x3218(0x10)
	struct FNone                                  PickUpAnim_Pistol_Crouch;                                    // 0x2078(0x10)
	struct FNone                                  PickUpAnim_Pistol_Prone;                                     // 0x1058(0x10)
	struct FNone                                  DoorAnim_Open;                                               // 0x1560(0x10)
	struct FNone                                  DoorAnim_Close;                                              // 0xee8(0x10)
	struct FNone                                  DoorAnim_Kick;                                               // 0x2b88(0x10)
	struct FNone                                  MovementAnim_GetUpFromBack;                                  // 0x3448(0x10)
	struct FNone                                  MovementAnim_GetUpFromFront;                                 // 0x2b58(0x10)
	struct FNone                                  ConditionAnim_ShakeOut_Unarmed;                              // 0x2e88(0x10)
	struct FNone                                  ConditionAnim_ShakeOut_Rifle;                                // 0x18f8(0x10)
	struct TArray<None>                           MeleeAnim_Punch_Idle;                                        // 0x3780(0x10)
	struct TArray<None>                           MeleeAnim_Punch_Crouch;                                      // 0x1540(0x10)
	struct FNone                                  MeleeAnim_Punch_Jump;                                        // 0x3598(0x10)
	struct TArray<None>                           MeleeAnim_Rifle_Idle;                                        // 0x1070(0x10)
	struct TArray<None>                           MeleeAnim_Rifle_Crouch;                                      // 0x3358(0x10)
	struct TArray<None>                           MeleeAnim_Pistol_Idle;                                       // 0x13f8(0x10)
	struct TArray<None>                           MeleeAnim_Pistol_Crouch;                                     // 0xa00(0x10)
	struct TArray<None>                           DeathAnim_Crouch;                                            // 0x27a0(0x10)
	struct TArray<None>                           DeathAnim_FlameDamage;                                       // 0xc08(0x10)
	struct TArray<None>                           DeathAnim_Grenade;                                           // 0x15d0(0x10)
	struct TArray<None>                           DeathAnim_HeadShot;                                          // 0x1ad0(0x10)
	struct TArray<None>                           DeathAnim_Natural;                                           // 0x1520(0x10)
	struct TArray<None>                           DeathAnim_Rifle;                                             // 0x8b0(0x10)
	struct TArray<None>                           DeathAnim_Shotgun;                                           // 0x2490(0x10)
	struct TArray<None>                           DeathAnim_Sprint;                                            // 0x910(0x10)
	struct TArray<None>                           DeathAnim_Falling;                                           // 0xd40(0x10)
	struct FNone*                                 DeathAnim_ClosedEyes;                                        // 0x1c80(0x08)
	struct FNone*                                 PickUpStartEvent;                                            // 0x2e78(0x08)
	struct FNone*                                 PickUpBackpackEvent;                                         // 0x2208(0x08)
	struct FNone                                  EquipAnim_MainWeapon1;                                       // 0x2718(0x10)
	struct FNone                                  EquipAnim_MainWeapon1_Prone;                                 // 0x2bd8(0x10)
	struct FNone                                  EquipAnim_MainWeapon2;                                       // 0xb08(0x10)
	struct FNone                                  EquipAnim_MainWeapon2_Prone;                                 // 0x37f0(0x10)
	struct FNone                                  EquipAnim_SubWeapon;                                         // 0x2f40(0x10)
	struct FNone                                  EquipAnim_SubWeapon_Prone;                                   // 0x26d0(0x10)
	struct FNone                                  EquipAnim_Melee;                                             // 0x1438(0x10)
	struct FNone                                  EquipAnim_Melee_Prone;                                       // 0xa30(0x10)
	struct FNone                                  EquipAnim_Amplifier;                                         // 0x1aa0(0x10)
	struct FNone                                  EquipAnim_Amplifier_Prone;                                   // 0x3468(0x10)
	struct FNone                                  EquipAnim_HeartBeatSensor;                                   // 0x3410(0x10)
	struct FNone                                  EquipAnim_HeartBeatSensor_Prone;                             // 0x9f0(0x10)
	struct FNone                                  SlidingAnim;                                                 // 0xa18(0x10)
	struct FNone                                  RollingAnim;                                                 // 0x9a8(0x10)
	struct FNone                                  KnockbackRollingAnim;                                        // 0x1030(0x10)
	struct FNone                                  EquipAnim_ThrowingWeapon;                                    // 0x3768(0x10)
	struct FNone                                  EquipAnim_Prone_ThrowingWeapon;                              // 0x1380(0x10)
	struct FNone                                  UnequipAnim_MainWeapon1;                                     // 0x1840(0x10)
	struct FNone                                  UnequipAnim_MainWeapon1_Prone;                               // 0xd30(0x10)
	struct FNone                                  UnequipAnim_MainWeapon2;                                     // 0x35e8(0x10)
	struct FNone                                  UnequipAnim_MainWeapon2_Prone;                               // 0x850(0x10)
	struct FNone                                  UnequipAnim_SubWeapon;                                       // 0x1c90(0x10)
	struct FNone                                  UnequipAnim_SubWeapon_Prone;                                 // 0x3010(0x10)
	struct FNone                                  UnequipAnim_Melee;                                           // 0xfd8(0x10)
	struct FNone                                  UnequipAnim_Melee_Prone;                                     // 0x2868(0x10)
	struct FNone                                  UnequipAnim_Amplifier;                                       // 0x1ef8(0x10)
	struct FNone                                  UnequipAnim_Amplifier_Prone;                                 // 0x2cb0(0x10)
	struct FNone                                  UnequipAnim_HeartBeatSensor;                                 // 0x3290(0x10)
	struct FNone                                  UnequipAnim_HeartBeatSensor_Prone;                           // 0x2b20(0x10)
	struct FNone                                  UnequipAnim_ThrowingWeapon;                                  // 0x1868(0x10)
	struct FNone                                  UnequipAnim_Prone_ThrowingWeapon;                            // 0x1ff0(0x10)
	struct FNone                                  LandingAnim_LandStop;                                        // 0x37a8(0x10)
	struct FNone                                  LandingAnim_Parachute;                                       // 0x28e0(0x10)
	struct FNone                                  LandingAnim_Unarmed;                                         // 0x2bf0(0x10)
	struct FNone                                  LandingAnim_Rifle;                                           // 0x10e0(0x10)
	struct FNone                                  LandingAnim_Pistol;                                          // 0x9c8(0x10)
	struct TArray<None>                           ResuscitationAnimSets;                                       // 0x2c58(0x10)
	struct TArray<None>                           WeaponEquipEvents;                                           // 0x1878(0x10)
	struct TArray<None>                           AttachmentEquipEvents;                                       // 0x37d8(0x10)
	struct TArray<None>                           WearableEquipEvents;                                         // 0xbc0(0x10)
	struct TArray<None>                           ConsumablesEvents;                                           // 0xc60(0x10)
	struct FNone*                                 MedipackUseEvent;                                            // 0x2508(0x08)
	struct FNone*                                 ItemDropEvent;                                               // 0x1fa8(0x08)
	struct FNone*                                 ADSEnterEvent;                                               // 0xf78(0x08)
	struct FNone*                                 ADSEnterEvent_Digital;                                       // 0xdc0(0x08)
	struct FNone*                                 ADSExitEvent;                                                // 0x2628(0x08)
	struct FNone*                                 ADSExitEvent_Digital;                                        // 0x33b0(0x08)
	struct FNone*                                 AOSEnterEvent;                                               // 0x3a50(0x08)
	struct FNone*                                 AOSExitEvent;                                                // 0x3810(0x08)
	struct FNone*                                 AMPEnterEvent;                                               // 0x3940(0x08)
	struct FNone*                                 AMPExitEvent;                                                // 0x1010(0x08)
	struct FNone*                                 AMPNoiseEvent;                                               // 0x10f0(0x08)
	struct FNone*                                 AMPNoiseStopEvent;                                           // 0x19b0(0x08)
	struct FNone*                                 PlosiveSoundDetection3LvEvent;                               // 0xe80(0x08)
	struct FNone*                                 HeartBeatSensorEnterEvent;                                   // 0x1e30(0x08)
	struct FNone*                                 HeartBeatSensorExitEvent;                                    // 0x3120(0x08)
	struct FNone*                                 HeartBeatSensorNoiseEvent;                                   // 0x2260(0x08)
	struct FNone*                                 HeartBeatSensorNoiseStopEvent;                               // 0x7f0(0x08)
	struct FNone*                                 DamagedEvent;                                                // 0x36f8(0x08)
	struct FNone*                                 HitEvent;                                                    // 0x32c0(0x08)
	struct FNone*                                 SnowAreaEnteringEvent;                                       // 0x1b40(0x08)
	struct FNone*                                 UltimateSprintEvent;                                         // 0x3430(0x08)
	char                                          bIsParachuteLanding : 0;                                     // 0x3718(0x01)
	float                                         ParachuteLandingHeight;                                      // 0x1ef0(0x04)
	struct FNone*                                 StartDescendingEvent;                                        // 0x1fd0(0x08)
	struct FNone*                                 ParachuteFoldEvent;                                          // 0x3130(0x08)
	struct FNone                                  TimerHandle_Sequnce;                                         // 0x7e0(0x08)
	struct FNone*                                 TeamPosition;                                                // 0x1c30(0x08)
	float                                         AdditionalTeamPositionWidgetHeight;                          // 0x2790(0x04)
	float                                         TeamPositionWidgetInterpSpeed;                               // 0x32e4(0x04)
	float                                         CurrentTeamPositionHeight;                                   // 0x1860(0x04)
	struct FMulticastInlineDelegate               OnChangeDetectedItems;                                       // 0x33f0(0x10)
	char                                          bIsArmedBeforeAction : 0;                                    // 0x1fdc(0x01)
	struct FMulticastInlineDelegate               Delegate_OnViewCameraInWater;                                // 0x3278(0x10)
	struct FMulticastInlineDelegate               Delegate_OnViewCameraOutWater;                               // 0x2278(0x10)
	char                                          bInSmoke : 0;                                                // 0x2b74(0x01)
	struct FMulticastInlineDelegate               Delegate_OnInSmoke;                                          // 0x31f8(0x10)
	struct FMulticastInlineDelegate               Delegate_OnOutSmoke;                                         // 0x1eb8(0x10)
	struct TArray<None>                           SmokeActors;                                                 // 0xf18(0x10)
	struct FNone*                                 SwimDiveEvent;                                               // 0x1a88(0x08)
	char                                          bIsEnterIndoorVolume : 0;                                    // 0x12d0(0x01)
	struct FNone*                                 SkyLightRef;                                                 // 0x2250(0x08)
	float                                         PrevSkyLightIntensityCache;                                  // 0x36dc(0x04)
	struct FNone                                  PrevSkyLightOcclusionTintCache;                              // 0x3268(0x04)
	float                                         SkyLightCurrentPriority;                                     // 0x27f0(0x04)
	struct TArray<None>                           OverlappedInDoorVolumes;                                     // 0x2ef8(0x10)
	struct FNone*                                 LastSteppedSurface;                                          // 0x15c0(0x08)
	char                                          SurfaceType;                                                 // 0x34d4(0x01)
	char                                          SurfaceType_LastTick;                                        // 0x2510(0x01)
	float                                         MP_SnowInterpSpeed;                                          // 0xdc8(0x04)
	struct FNone                                  TimerHandle_BreathEffect;                                    // 0x1d00(0x08)
	struct FNone*                                 BreathParticleComponent;                                     // 0x1618(0x08)
	struct FNone*                                 BreathParticle_Idle;                                         // 0x3818(0x08)
	struct FNone*                                 BreathParticle_Moving;                                       // 0x12c8(0x08)
	struct FNone*                                 InWaterParticle;                                             // 0x2760(0x08)
	struct FMulticastInlineDelegate               OnUpdateMutableDelegate;                                     // 0xd10(0x10)
	struct FNone*                                 OverlapWaterVolume;                                          // 0x35b0(0x08)
	char                                          bIsMelee : 0;                                                // 0x990(0x01)
	char                                          bIsMeleeJumpAttack : 0;                                      // 0x12d1(0x01)
	char                                          bCanJumpMeleeAttack : 0;                                     // 0xd24(0x01)
	char                                          bIsMeleeAttackBlocked : 0;                                   // 0x102c(0x01)
	float                                         LastMeleeAttackTime;                                         // 0x2d88(0x04)
	struct FNone                                  CurrentMeleeAnimSlot;                                        // 0x2eb8(0x10)
	struct TArray<None>                           ActorsToIgnore_Melee;                                        // 0x2240(0x10)
	struct TArray<None>                           MeshesToIgnore_Melee;                                        // 0xde8(0x10)
	float                                         UnarmedMeleeDamage_Ground;                                   // 0x36e4(0x04)
	float                                         UnarmedMeleeDamage_Jump;                                     // 0x2200(0x04)
	char                                          bIsFired : 0;                                                // 0xde0(0x01)
	char                                          bWantsToFire : 0;                                            // 0xf58(0x01)
	char                                          bWantsToAOS : 0;                                             // 0x884(0x01)
	char                                          bIsLanded : 0;                                               // 0x1610(0x01)
	float                                         FiredTimeCount;                                              // 0xf10(0x04)
	float                                         StartFireTime;                                               // 0x2040(0x04)
	char                                          bIsADSFireToCamera : 0;                                      // 0x35b8(0x01)
	float                                         FireToCameraLocationCorrection;                              // 0x1864(0x04)
	struct FNone                                  ArmsLagRotation;                                             // 0x1398(0x0c)
	float                                         ArmsLagDeltaMin;                                             // 0x2c70(0x04)
	float                                         ArmsLagDeltaMax;                                             // 0x1c8c(0x04)
	float                                         DefaultsArmsLagRotationMax;                                  // 0x2904(0x04)
	float                                         DefaultsArmsLagRotationSpeed;                                // 0x2bec(0x04)
	struct TMap<None, None>                       ArmsLags;                                                    // 0x1e38(0x50)
	float                                         ArmsLagBaseModify;                                           // 0xe48(0x04)
	float                                         ArmsLagWeaponModify;                                         // 0x8a4(0x04)
	struct FNone                                  ArmsLagWeaponRotation;                                       // 0x16cc(0x0c)
	struct FNone                                  ADSDeltaRotation;                                            // 0x1af4(0x0c)
	struct FNone                                  ADSEndLocation;                                              // 0x3304(0x0c)
	char                                          bSteadyAim : 0;                                              // 0x1a40(0x01)
	struct FNone                                  LastSwayRotationOnSteadyAim;                                 // 0x1230(0x0c)
	struct FNone*                                 SteadyAimReadyEvent;                                         // 0x25f0(0x08)
	struct FNone*                                 SteadyAimStartEvent;                                         // 0x2b18(0x08)
	struct FNone*                                 SteadyAimEndEvent;                                           // 0x14a8(0x08)
	float                                         HeadShotBloodEffectDistance;                                 // 0xfd0(0x04)
	struct FNone*                                 HeadShotHelmetFxEmitterTemplate;                             // 0x1b50(0x08)
	float                                         BoltActionDelayTime;                                         // 0x2b70(0x04)
	char                                          bWaitingADSReturn : 0;                                       // 0x10a0(0x01)
	float                                         ADSReturnEnableTime;                                         // 0x16c8(0x04)
	float                                         Delay_AOSToADS;                                              // 0x3490(0x04)
	char                                          bNeedToBeADS : 0;                                            // 0x2c80(0x01)
	struct FNone                                  TimerHandle_ADSProcess;                                      // 0x3068(0x08)
	struct FNone*                                 PP_Preset_ADS;                                               // 0x2cc0(0x08)
	struct FNone*                                 PPInst_ADS;                                                  // 0xb28(0x08)
	float                                         ReplayInputForwardAxisValue;                                 // 0x1fcc(0x04)
	float                                         ReplayInputRightAxisValue;                                   // 0x26f0(0x04)
	struct FNone                                  CurrentInputAxis;                                            // 0x1018(0x08)
	struct FMulticastInlineDelegate               Delegate_OnCameraViewModeChanged;                            // 0x5e8(0x10)
	struct FNone*                                 ZoomInAudioEvent_Digital;                                    // 0x1d68(0x08)
	struct FNone*                                 ZoomOutAudioEvent_Digital;                                   // 0x2600(0x08)
	float                                         ZoomAudioEventRepeatDelay;                                   // 0x3528(0x04)
	float                                         ZoomAudioEventLastPlayTime;                                  // 0x37d0(0x04)
	struct FMulticastInlineDelegate               OnPickableItemDetected;                                      // 0x628(0x10)
	float                                         OverHeadTraceDistance;                                       // 0x3458(0x04)
	char                                          bShouldAdjustOverHead : 0;                                   // 0x22c9(0x01)
	float                                         UpdateAnimationDistance;                                     // 0xd64(0x04)
	char                                          bIsDisarming : 0;                                            // 0x658(0x01)
	struct FNone*                                 ResuscitationStopEvents;                                     // 0x1f28(0x08)
	struct FNone*                                 ResuscitatingCharacter;                                      // 0x3058(0x08)
	float                                         RequestResuscitationCoolTime;                                // 0x1af0(0x04)
	struct FNone                                  CurrentResuscitationAnimSlot;                                // 0x3a60(0x10)
	struct FNone                                  TimerHandle_SetIsFired;                                      // 0x12b8(0x08)
	float                                         KillAssistValidTime;                                         // 0x18f0(0x04)
	uint32_t                                      KillAssistMaxCount;                                          // 0x2a84(0x04)
	float                                         KnockOutAssistValidTime;                                     // 0x18c8(0x04)
	uint32_t                                      KnockOutAssistMaxCount;                                      // 0x147c(0x04)
	struct TArray<None>                           AssistInfo;                                                  // 0x7f8(0x10)
	float                                         ThrowingWeaponFireDelay;                                     // 0xe18(0x04)
	float                                         PreShootDeltaSecond;                                         // 0x37c0(0x04)
	char                                          bIsParachuteAvailable : 0;                                   // 0x30f0(0x01)
	float                                         ParachuteInputForward;                                       // 0x136c(0x04)
	float                                         ParachuteInputRight;                                         // 0x1448(0x04)
	float                                         ParachuteForwardMomentum;                                    // 0x3240(0x04)
	struct FNone                                  ParachuteLastRotator;                                        // 0x34a8(0x0c)
	float                                         CurrentParachuteMaxMomentum;                                 // 0x15c8(0x04)
	float                                         ParachuteMaxMomentum;                                        // 0x10bc(0x04)
	float                                         ParachuteMomentumAcc;                                        // 0x1ae4(0x04)
	float                                         ParachuteMomentumDeacc;                                      // 0x888(0x04)
	float                                         ParachuteMomentumZ;                                          // 0x2748(0x04)
	float                                         DescentInputVectorAcc;                                       // 0x1e88(0x04)
	float                                         ParachuteInputVectorAcc;                                     // 0x1310(0x04)
	float                                         ParachuteVelocityChangeFinalRate;                            // 0x3384(0x04)
	float                                         ParachuteVelocityChangeZDecRate;                             // 0x1118(0x04)
	float                                         ParachuteLandingVelocityZ;                                   // 0x16fc(0x04)
	float                                         ParachuteLandingVelocityXY;                                  // 0xf5c(0x04)
	float                                         ForwardMomentumRangeMin;                                     // 0x1c48(0x04)
	float                                         ForwardMomentumRangeMax;                                     // 0xef8(0x04)
	float                                         CurrentYawSpeed;                                             // 0x2a88(0x04)
	float                                         CurrentRollSpeed;                                            // 0x2f50(0x04)
	float                                         CurrentPitchSpeed;                                           // 0x3230(0x04)
	float                                         MinPitchInParachute;                                         // 0x23fc(0x04)
	float                                         MaxPitchInParachute;                                         // 0x1ae0(0x04)
	float                                         GlidePitchInParachute;                                       // 0x2be8(0x04)
	float                                         MinRollInParachute;                                          // 0x34a4(0x04)
	float                                         MaxRollInParachute;                                          // 0x149c(0x04)
	float                                         MaxRollInParachuteVelocity;                                  // 0x2c74(0x04)
	float                                         ParachuteTurnSpeedYaw;                                       // 0x2850(0x04)
	float                                         ParachuteTurnSpeedPitch;                                     // 0x2b38(0x04)
	float                                         ParachuteTurnSpeedRoll;                                      // 0x1fb0(0x04)
	float                                         ParachuteTurnChangeSpeedYaw;                                 // 0x2088(0x04)
	float                                         ParachuteTurnChangeSpeedPitch;                               // 0x1bf8(0x04)
	float                                         ParachuteTurnChangeSpeedRoll;                                // 0x3898(0x04)
	float                                         HeightToGetInParachuteFromLand;                              // 0x2b78(0x04)
	float                                         ForceHeightToGetInParachuteFromLand;                         // 0x2004(0x04)
	struct FNone                                  ReplicatedParachuteVelocity;                                 // 0xbd8(0x0c)
	struct FNone*                                 ParachutePitchCurve;                                         // 0x1718(0x08)
	struct TArray<None>                           ParachuteSkinMaterials;                                      // 0x1488(0x10)
	struct FNone*                                 CurrentParachuteSkin;                                        // 0x2db0(0x08)
	char                                          bChangeNearClipPlane : 0;                                    // 0x2c78(0x01)
	float                                         DescentStartZPosition;                                       // 0xd60(0x04)
	float                                         ParachuteAvailableFallingDistance;                           // 0x82c(0x04)
	float                                         DescentZ;                                                    // 0x1278(0x04)
	float                                         SeaLevelZ;                                                   // 0x2648(0x04)
	float                                         SaveMaxWalkSpeed;                                            // 0x2e1c(0x04)
	float                                         SaveCameraBoomLocationZ;                                     // 0x2d34(0x04)
	float                                         PosToGetInParachute;                                         // 0x3234(0x04)
	struct FNone*                                 AccelerationPPClass;                                         // 0x1820(0x08)
	struct FNone*                                 RadialOnDescentCurve;                                        // 0x1570(0x08)
	float                                         RadialRate;                                                  // 0x37d4(0x04)
	float                                         DescentBlurWidth;                                            // 0x8c0(0x04)
	struct FNone*                                 AccelerationPPInst;                                          // 0x19c0(0x08)
	float                                         TargetSpringArmLengthDescent;                                // 0x81c(0x04)
	float                                         SpeedSpringArmLengthDesecnt;                                 // 0x2b48(0x04)
	char                                          bDescentCameraShakeLoop : 0;                                 // 0x25a8(0x01)
	float                                         DescentCameraShakeDelay;                                     // 0x838(0x04)
	struct FNone*                                 DescentCameraShake;                                          // 0x1e90(0x08)
	struct FNone*                                 CloudFxEmitterTemplate;                                      // 0x34b8(0x08)
	struct FNone*                                 CloudFxInDescent;                                            // 0x1918(0x08)
	float                                         VelocityZ_LandStop;                                          // 0x3238(0x04)
	float                                         VelocityZ_Falling;                                           // 0x1b18(0x04)
	float                                         PrevMeshRelativeZ;                                           // 0x2fe0(0x04)
	float                                         PronedEyeHeight;                                             // 0xdcc(0x04)
	char                                          bIsProneWeaponIdle : 0;                                      // 0x326c(0x01)
	char                                          bIsAutoSprint : 0;                                           // 0x2588(0x01)
	float                                         PronedDeltaHeightCamera3P;                                   // 0x1c78(0x04)
	float                                         CrouchedDeltaHeightCamera3P;                                 // 0x2000(0x04)
	float                                         CrouchMovedDeltaHeightCamera3P;                              // 0x10a4(0x04)
	float                                         StandDeltaHeightCamera3P;                                    // 0x2768(0x04)
	float                                         StandSprintDeltaHeightCamera3P;                              // 0x124c(0x04)
	struct FNone                                  Camera1PInterpSrc;                                           // 0x1908(0x0c)
	struct FNone                                  Camera3PInterpSrc;                                           // 0x13a8(0x0c)
	struct FNone                                  Camera3PInterpDst;                                           // 0x369c(0x0c)
	float                                         TargetArmLength;                                             // 0x2d48(0x04)
	float                                         TargetArmLengthInterpSpeed;                                  // 0x1a60(0x04)
	float                                         TargetArmLengthInterpSpeed_AMP;                              // 0xea0(0x04)
	float                                         TargetArmLengthInterpSpeed_HeartBeatSensor;                  // 0x3320(0x04)
	float                                         TargetFieldOfView;                                           // 0x798(0x04)
	struct FNone                                  TargetSocketOffset;                                          // 0xbfc(0x0c)
	float                                         DefaultCameraLag;                                            // 0x28f0(0x04)
	float                                         ReturnCameraLag;                                             // 0x8a8(0x04)
	struct FNone                                  DefaultSocketOffset_VehicleAOS;                              // 0x32cc(0x0c)
	struct FNone                                  DefaultSocketOffset_LeftHipshot;                             // 0x1fc0(0x0c)
	struct FNone                                  DefaultSocketOffset_Hipshot;                                 // 0x1890(0x0c)
	struct FNone                                  DefaultSocketOffset_RightHipshot;                            // 0x30a4(0x0c)
	struct FNone                                  DefaultSocketOffset_LeftLeanAOS;                             // 0x1514(0x0c)
	struct FNone                                  DefaultSocketOffset_RightLeanAOS;                            // 0x256c(0x0c)
	struct FNone                                  DefaultSocketOffset_LeftAOS_Idle;                            // 0x32d8(0x0c)
	struct FNone                                  DefaultSocketOffset_RightAOS_Idle;                           // 0x1328(0x0c)
	struct FNone                                  DefaultSocketOffset_LeftAOS_Crouch;                          // 0x24a8(0x0c)
	struct FNone                                  DefaultSocketOffset_RightAOS_Crouch;                         // 0x3708(0x0c)
	struct FNone                                  DefaultSocketOffset_LeftAOS_Prone;                           // 0x2ca0(0x0c)
	struct FNone                                  DefaultSocketOffset_RightAOS_Prone;                          // 0x3004(0x0c)
	struct FNone                                  DefaultTargetOffset_HipShot;                                 // 0x2914(0x0c)
	struct FNone                                  DefaultTargetOffset_AOS_Stand_Idle;                          // 0x900(0x0c)
	struct FNone                                  DefaultTargetOffset_AOS_Stand_Lean;                          // 0x1da4(0x0c)
	struct FNone                                  DefaultTargetOffset_AOS_Crouch_Idle;                         // 0x2068(0x0c)
	struct FNone                                  DefaultTargetOffset_AOS_Crouch_Lean;                         // 0x18ac(0x0c)
	float                                         DefaultTargetArmLength_Hipshot;                              // 0x984(0x04)
	float                                         DefaultTargetArmLength_AOS;                                  // 0x9a0(0x04)
	float                                         Camera3P_FOV_InterpSpeed;                                    // 0xb60(0x04)
	float                                         Camera3P_AMP_FOV_InterpSpeed;                                // 0x309c(0x04)
	float                                         Camera3P_HeartBeatSensor_FOV_InterpSpeed;                    // 0x2534(0x04)
	float                                         Camera3P_Lean_InterpSpeed;                                   // 0x920(0x04)
	struct FNone*                                 DeathCamClass;                                               // 0x3a78(0x08)
	float                                         DeathBeginTime;                                              // 0x25b0(0x04)
	struct FNone*                                 BodyBaseSkeletalMesh;                                        // 0x668(0x08)
	char                                          bNeedToUpdatePreviewPawn : 0;                                // 0x1a78(0x01)
	struct FNone*                                 Mutable_MaleInstance;                                        // 0x2c98(0x08)
	struct FNone*                                 Mutable_FemaleInstance;                                      // 0x22b0(0x08)
	struct FNone*                                 InventoryCharacterClass;                                     // 0xcc0(0x08)
	struct FNone*                                 InventoryCharacter;                                          // 0x2b10(0x08)
	struct FMulticastInlineDelegate               OnUpdateCastingDelegate;                                     // 0x6b0(0x10)
	uint32_t                                      UsingBackpackItemIndex;                                      // 0x32b8(0x04)
	float                                         ItemInterruptInputSeconds;                                   // 0x1738(0x04)
	struct FNone                                  CastingItemTimer;                                            // 0x23f0(0x08)
	struct FNone                                  CastingSupplyTimer;                                          // 0x1a48(0x08)
	struct FNone                                  CastingItemMontageTimer;                                     // 0xc38(0x08)
	struct FNone                                  LastCastingItemAnimSlot_Stand;                               // 0x2810(0x10)
	struct FNone                                  LastCastingItemAnimSlot_Prone;                               // 0x2ce8(0x10)
	struct TArray<None>                           CastingStopEvents;                                           // 0x1000(0x10)
	char                                          bIsCastingItem : 0;                                          // 0x2f54(0x01)
	struct FNone                                  CompletedCastingInfo;                                        // 0x14c8(0x08)
	uint32_t                                      BasicSetting_gender;                                         // 0x1f54(0x04)
	uint32_t                                      BasicSetting_face;                                           // 0xcc8(0x04)
	uint32_t                                      BasicSetting_face_color;                                     // 0x24e4(0x04)
	uint32_t                                      BasicSetting_hair;                                           // 0x2b34(0x04)
	uint32_t                                      BasicSetting_hair_color;                                     // 0x3704(0x04)
	uint32_t                                      BasicSetting_makeup;                                         // 0x19f0(0x04)
	struct TArray<None>                           BasicSettingItemInfos;                                       // 0xaa8(0x10)
	struct FName                                  CombineTargetRecipe;                                         // 0x3590(0x08)
	struct TArray<None>                           CombineTargetMaterials;                                      // 0x2730(0x10)
	struct FNone*                                 CombineCompleteAudioEvent;                                   // 0x24e8(0x08)
	char                                          bEnabledFur : 0;                                             // 0x264c(0x01)
	struct FName                                  WearableNameHasFur;                                          // 0x2e50(0x08)
	float                                         CooldownTimeForEnterVehicle;                                 // 0x3750(0x04)
	float                                         CoolDownTimeForUseLadder;                                    // 0x2184(0x04)
	struct TArray<None>                           NearbyVehicles;                                              // 0x36c0(0x10)
	struct FMulticastInlineDelegate               Delegate_OnEnteredVehicle;                                   // 0x6c0(0x10)
	float                                         MaxVehicleEscapeSpeed;                                       // 0x2e24(0x04)
	struct FNone*                                 PreviousVehicleSeat;                                         // 0xdd0(0x08)
	struct TArray<None>                           ProjectileGrenades;                                          // 0x2e60(0x10)
	struct FMulticastInlineDelegate               OnChangeProjectilePredictPath;                               // 0x2118(0x10)
	char                                          IsBlind : 0;                                                 // 0x13f0(0x01)
	struct FMulticastInlineDelegate               OnAirCraftDelegate;                                          // 0x1ce8(0x10)
	struct FMulticastInlineDelegate               OnCharacterGroundStateChangeDelegate;                        // 0x2f60(0x10)
	float                                         FlashBangAngle;                                              // 0x1368(0x04)
	struct FNone*                                 PostProcessFlashBangClass;                                   // 0x7a0(0x08)
	struct FNone*                                 GrenadeFlashBangStartEvent;                                  // 0x3738(0x08)
	struct FNone*                                 GrenadeFlashBangEndEvent;                                    // 0x13b8(0x08)
	struct FNone*                                 GrenadeFragmentExplosionSineStopEvent;                       // 0x37c8(0x08)
	struct FNone*                                 PostProcessBloodHitClass;                                    // 0x2408(0x08)
	struct FNone*                                 DamagedDissolveAnimationCurve;                               // 0x12a0(0x08)
	struct FNone*                                 PostProcessBloodHit;                                         // 0x14e0(0x08)
	float                                         DamagedDissolveRateTime;                                     // 0xe88(0x04)
	float                                         DamagedTermTime;                                             // 0x2ba8(0x04)
	float                                         DamagedDissolveAnimaitionMaxTime;                            // 0x3380(0x04)
	float                                         HitBlinkTime;                                                // 0x1f1c(0x04)
	float                                         InternalDamagedTermTime;                                     // 0xd20(0x04)
	float                                         InternalHitBlinkTime;                                        // 0x2828(0x04)
	float                                         DamagedDissolveAnimationValue;                               // 0xbd0(0x04)
	char                                          IsEndTermTime : 0;                                           // 0x1315(0x01)
	char                                          IsPlayingDamage : 0;                                         // 0x1080(0x01)
	char                                          IsHit : 0;                                                   // 0x2710(0x01)
	char                                          IsDissolve : 0;                                              // 0xf70(0x01)
	char                                          DamageReset : 0;                                             // 0x2614(0x01)
	uint32_t                                      HitBlinkState;                                               // 0x252c(0x04)
	uint32_t                                      CurrentDamageCount;                                          // 0x2268(0x04)
	uint32_t                                      DissolveCount;                                               // 0xb20(0x04)
	struct FNone*                                 PostProcessOuterPlayZoneClass;                               // 0x1c00(0x08)
	float                                         ShowTimePostProcessOuterPlayZone;                            // 0x3208(0x04)
	struct FNone                                  TimerHandle_OuterPlayZone;                                   // 0x1d80(0x08)
	struct FNone*                                 PostProcessBlueZoneHitClass;                                 // 0x1db8(0x08)
	struct FNone                                  TimerHandle_BlueZone;                                        // 0x2e30(0x08)
	struct FNone*                                 PostProcessMagneticHitClass;                                 // 0x2788(0x08)
	struct FNone*                                 PostProcessMagneticHit;                                      // 0x978(0x08)
	struct FNone*                                 MagneticDamagedDissolveAnimationCurve;                       // 0x2bc0(0x08)
	float                                         MagneticDamagedTermTime;                                     // 0x3094(0x04)
	float                                         MagneticDamagedDissolveAnimaitionMaxTime;                    // 0x3494(0x04)
	float                                         MagneticHitBlinkTime;                                        // 0x28d8(0x04)
	float                                         InternalMagneticDamagedTermTime;                             // 0x2ce0(0x04)
	float                                         InternalMagneticHitBlinkTime;                                // 0x1370(0x04)
	float                                         MagneticDamagedDissolveAnimationValue;                       // 0x1b20(0x04)
	float                                         BluezoneMaterialOnTime;                                      // 0x27ec(0x04)
	char                                          IsMagneticEndTermTime : 0;                                   // 0x13d8(0x01)
	char                                          IsMagneticDamage : 0;                                        // 0x2878(0x01)
	char                                          IsMagneticHit : 0;                                           // 0x2840(0x01)
	char                                          IsMagneticDissolve : 0;                                      // 0x3520(0x01)
	char                                          MagneticDamageReset : 0;                                     // 0x2d30(0x01)
	struct FNone*                                 PostProcessDustClass;                                        // 0x39a0(0x08)
	struct FNone*                                 DustDissolveAnimationCurve;                                  // 0x1818(0x08)
	struct FNone*                                 PostProcessDust;                                             // 0x898(0x08)
	float                                         DustDissolveAnimaitionMaxTime;                               // 0x14e8(0x04)
	float                                         DustDissolveDelayTime;                                       // 0x7b0(0x04)
	float                                         InternalDustDissolveDelayTime;                               // 0x2c7c(0x04)
	float                                         DustDissolveAnimationValue;                                  // 0x23e8(0x04)
	char                                          IsOnDust : 0;                                                // 0x13a4(0x01)
	char                                          IsDustDissolve : 0;                                          // 0x18f4(0x01)
	char                                          DustReset : 0;                                               // 0x2798(0x01)
	struct FNone*                                 PP_Preset_PickupOutline;                                     // 0x2578(0x08)
	struct FNone*                                 PP_PickupOutlineRef;                                         // 0x2580(0x08)
	float                                         CurrentOutlineThickness;                                     // 0x1ec8(0x04)
	float                                         MaxOutlineThickness;                                         // 0x2784(0x04)
	float                                         OutlineThicknessInterpSpeed;                                 // 0x1a9c(0x04)
	float                                         CurrentCameraModifyerX;                                      // 0x13c8(0x04)
	float                                         CurrentCameraModifyerY;                                      // 0x3478(0x04)
	enum class None                               CurrentEMouseSensitivityState;                               // 0x1068(0x01)
	char                                          bPendingOpenDoor : 0;                                        // 0x3311(0x01)
	struct FNone*                                 KickTargetDoor;                                              // 0x840(0x08)
	struct FNone*                                 DoorBreachingParticle;                                       // 0x2b40(0x08)
	struct FNone*                                 WindowBreachingParticle;                                     // 0x2c00(0x08)
	struct FNone*                                 BreachingAudioEvent;                                         // 0x37b8(0x08)
	struct FNone*                                 BreachingAudioEvent_Silence;                                 // 0x7d8(0x08)
	struct FNone*                                 AnimInstance;                                                // 0x1098(0x08)
	struct FNone*                                 PostprocessAnimInstance;                                     // 0x2848(0x08)
	struct FNone*                                 AnimInstance_FPP;                                            // 0x26f8(0x08)
	struct FNone*                                 BravoHotelGameState;                                         // 0x3840(0x08)
	struct FNone*                                 BravoHotelPlayerController;                                  // 0x3570(0x08)
	uint32_t                                      IdleNum;                                                     // 0x2e58(0x04)
	float                                         IdleWaitingTime;                                             // 0x3578(0x04)
	struct FName                                  LevelUpEffectBuffName;                                       // 0x1a50(0x08)
	struct TArray<None>                           DefaultBuffName;                                             // 0x2480(0x10)
	struct TArray<None>                           DefaultPerkInfo;                                             // 0x1318(0x10)
	struct TArray<None>                           UberUser;                                                    // 0x33c0(0x10)
	struct TArray<None>                           CurrentPerkInfos;                                            // 0x3368(0x10)
	struct FNone                                  UltimatePerkInfo;                                            // 0x2288(0x28)
	struct TArray<None>                           PerkUIInfos;                                                 // 0x3888(0x10)
	struct FNone                                  UltimateUIInfo;                                              // 0x1980(0x2c)
	struct TArray<None>                           CurrentPerkCards;                                            // 0x2a90(0x10)
	struct TArray<None>                           MutableBuffList;                                             // 0x2590(0x10)
	enum class None                               CurrentSkillType;                                            // 0xa9c(0x01)
	struct FMulticastInlineDelegate               OnChangeFireType;                                            // 0x2618(0x10)
	uint32_t                                      CurrentReadyToSnipeGrade;                                    // 0x1530(0x04)
	struct FMulticastInlineDelegate               Delegate_OnEndSearchInstinct;                                // 0xfc0(0x10)
	struct TArray<None>                           UsedTrapList;                                                // 0x2d98(0x10)
	enum class None                               PerkLevelUpType;                                             // 0x3a58(0x01)
	uint32_t                                      ActiveSkillInitIndex;                                        // 0x276c(0x04)
	uint32_t                                      ActiveSkillCount;                                            // 0x2d4c(0x04)
	struct FNone                                  CurrentDisplayAbility;                                       // 0xa4c(0x0c)
	struct TArray<None>                           LoadedClasses;                                               // 0x1258(0x10)
	uint32_t                                      PerkDeckChangingCount;                                       // 0x3a38(0x04)
	struct FMulticastInlineDelegate               OnMovementInputPressedDelegate;                              // 0x708(0x10)
	char                                          bIsMoving : 0;                                               // 0x890(0x01)
	char                                          bForceMoving : 0;                                            // 0xd50(0x01)
	struct FNone*                                 LastDamagedType;                                             // 0x32e8(0x08)
	float                                         LastDamagedAmount;                                           // 0xa28(0x04)
	struct FNone*                                 LastHitType;                                                 // 0x3778(0x08)
	struct FNone                                  LastSimulatedTakeDamageInfo;                                 // 0x1dd8(0x48)
	struct FNone                                  DebuffHitResult;                                             // 0x39ac(0x88)
	struct FNone*                                 DebuffHitDamageType;                                         // 0xaf0(0x08)
	struct TArray<None>                           TakeDamageMontageList;                                       // 0x1c20(0x10)
	struct FNone*                                 BloodSplatterEffect;                                         // 0x3720(0x08)
	struct FNone*                                 PunchEffect;                                                 // 0x10b0(0x08)
	struct FNone*                                 ThrowingWeaponDirectHitEffect;                               // 0x8e0(0x08)
	float                                         BloodEffectNearbyDist;                                       // 0x980(0x04)
	struct FNone                                  DefaultItemSetting;                                          // 0x2cf8(0x38)
	struct FNone                                  DefaultWearableSetting;                                      // 0x3820(0x18)
	struct TArray<None>                           BlackMarketItemPresetList;                                   // 0x11c0(0x10)
	struct FMulticastInlineDelegate               OnCanProneFailedDelegate;                                    // 0x720(0x10)
	float                                         MinDamageableFallingSpeed;                                   // 0x2404(0x04)
	float                                         MaxDamageableFallingSpeed;                                   // 0x2c10(0x04)
	float                                         MinDamageableFallingSpeedFromVehicle;                        // 0xf08(0x04)
	float                                         MaxDamageableFallingSpeedFromVehicle;                        // 0x8a0(0x04)
	enum class None                               LandingReason;                                               // 0xdf8(0x01)
	struct FMulticastInlineDelegate               Delegate_OnExitFallingState;                                 // 0x1288(0x10)
	struct TArray<None>                           OverlappedPhysicMaterials;                                   // 0x14b8(0x10)
	float                                         BushSoundSpawnDelay;                                         // 0x2f58(0x04)
	float                                         BushLandingDamageMultiplier;                                 // 0xa64(0x04)
	struct TSet<None>                             OverlappedCantProneComponent;                                // 0x1758(0x50)
	char                                          bIsInsideBlueZone : 0;                                       // 0x19b8(0x01)
	char                                          bIsSpectated : 0;                                            // 0x20ae(0x01)
	struct TMap<None, None>                       Camera3P_DeltaTargetOffsets;                                 // 0xc70(0x50)
	char                                          bReplaceFreeLook : 0;                                        // 0x2928(0x01)
	char                                          bUpdateDeathRotation : 0;                                    // 0x197c(0x01)
	struct FNone                                  RagdollLocation;                                             // 0xa40(0x0c)
	struct FNone                                  RagdollVelocity;                                             // 0xa58(0x0c)
	struct FNone*                                 LastDamageType;                                              // 0x1cc0(0x08)
	float                                         Ragdoll_ZOffset;                                             // 0x3118(0x04)
	char                                          bApplyRagdollForce : 0;                                      // 0x2c14(0x01)
	struct FNone*                                 BravoHotelCharacterMovement;                                 // 0x750(0x08)
	char                                          PrevMovementMode;                                            // 0x1edc(0x01)
	char                                          NewMovementMode;                                             // 0x27e8(0x01)
	enum class None                               PrevCustomMovementMode;                                      // 0x2740(0x01)
	enum class None                               NewCustomMovementMode;                                       // 0x1660(0x01)
	struct FNone                                  MovementInputVector;                                         // 0x1970(0x0c)
	struct FNone                                  TimerHandle_HideParachute;                                   // 0x758(0x08)
	struct FNone                                  Timeline_TunnelEffect;                                       // 0x35f8(0x98)
	struct TMap<None, None>                       Curve_TunnelEffect;                                          // 0x3950(0x50)
	struct FNone                                  Timeline_CameraInterp;                                       // 0x1128(0x98)
	struct FNone*                                 Curve_CameraInterp;                                          // 0x2f70(0x08)
	struct FNone*                                 Curve_AdsCameraInterp;                                       // 0x1280(0x08)
	float                                         MinTimeJumpingBeforeLand;                                    // 0x2eb0(0x04)
	float                                         DescentXYAcc;                                                // 0x2ee4(0x04)
	float                                         DescentAirControl;                                           // 0x2f18(0x04)
	float                                         DescentSpeed;                                                // 0x1a80(0x04)
	float                                         DescentGravityScale;                                         // 0x1a7c(0x04)
	float                                         DescentDeacceleration;                                       // 0x1fb4(0x04)
	float                                         DescentMaxAcceleration;                                      // 0x994(0x04)
	struct FNone                                  DescentCameraLocation;                                       // 0x21a0(0x0c)
	float                                         ParachuteAirControl;                                         // 0x3804(0x04)
	float                                         ParachuteSpeed;                                              // 0x2f5c(0x04)
	float                                         ParachuteGravity;                                            // 0x8ec(0x04)
	float                                         ParachuteDeacceleration;                                     // 0x1c18(0x04)
	float                                         ParachuteMaxAcceleration;                                    // 0x2074(0x04)
	struct FNone                                  ParachuteCameraLocation;                                     // 0x144c(0x0c)
	float                                         ParachuteSocketOffsetY;                                      // 0xf60(0x04)
	float                                         ParachuteSocketDeltaOffsetZ;                                 // 0x2514(0x04)
	float                                         ParachuteReadyToLandHeight;                                  // 0x1f20(0x04)
	float                                         ParachuteQuickLandingStartHeight;                            // 0x358c(0x04)
	float                                         ParachuteQuickLandingStartRadius;                            // 0x2c08(0x04)
	float                                         ParachuteQuickLandingVelocityModifierXY;                     // 0x394c(0x04)
	float                                         ParachuteQuickLandingVelocityModifierZ;                      // 0x164c(0x04)
	float                                         ParachuteQuickLandingDMGRate;                                // 0x1298(0x04)
	char                                          bCanQuickLanding : 0;                                        // 0x2008(0x01)
	struct FNone                                  LastQuickLandingAllowedLocation;                             // 0x357c(0x0c)
	struct FNone                                  ParachuteTargetCameraLocation;                               // 0x2b4c(0x0c)
	float                                         ParachuteTargetCameraSpeed;                                  // 0x36b0(0x04)
	float                                         ParachuteTargetArmLengthSpeedStart;                          // 0x8ac(0x04)
	float                                         ParachuteTargetArmLengthSpeedEnd;                            // 0xf28(0x04)
	struct FNone*                                 ParachuteUnfoldCameraShake;                                  // 0x2640(0x08)
	struct FNone*                                 BreathStartEvent;                                            // 0x3498(0x08)
	struct FNone*                                 BreathEndEvent;                                              // 0x1cc8(0x08)
	struct FNone*                                 BreathStopEvent;                                             // 0x1650(0x08)
	struct FNone                                  SprintingBeginRange;                                         // 0x23e0(0x08)
	struct FNone                                  SprintingRange;                                              // 0x3694(0x08)
	float                                         ReduceCharacterSpeedTime;                                    // 0x2ec8(0x04)
	float                                         InternalReduceCharacterSpeedTime;                            // 0x1640(0x04)
	char                                          IsInReduceSpeedExplosionRange : 0;                           // 0x1c08(0x01)
	struct FNone*                                 PostProcessEffectsTable;                                     // 0x3288(0x08)
	struct TMap<None, None>                       PostProcessAssignedList;                                     // 0x1668(0x50)
	struct TArray<None>                           PostProcessBuffList;                                         // 0x1c38(0x10)
	struct FNone*                                 RenderSettingsTable;                                         // 0x1fb8(0x08)
	char                                          bUpdateRenderSettings : 0;                                   // 0xdb8(0x01)
	uint32_t                                      CurrentTerrainType;                                          // 0x1730(0x04)
	struct FNone                                  AttachInAircraftOffset;                                      // 0x2b7c(0x0c)
	struct FNone                                  AttachInAircraftRotationOffset;                              // 0x3424(0x0c)
	struct FNone                                  AttachInAircraftCameraLocaiton;                              // 0x16e8(0x0c)
	float                                         InitSpringArmLengthInAircraft;                               // 0x386c(0x04)
	float                                         TargetSpringArmLengthInAircraft;                             // 0x828(0x04)
	float                                         SpeedSpringArmLengthInAirCraft;                              // 0x1a98(0x04)
	float                                         PrevBloomIntensity;                                          // 0x2b30(0x04)
	float                                         PrevBloomThreshold;                                          // 0x2ba4(0x04)
	float                                         TargetBloomIntensityInAirCraft;                              // 0x2714(0x04)
	float                                         SpeedBloomIntensityInAirCraft;                               // 0x1b00(0x04)
	float                                         BloomStartDelayTimeInAirCraft;                               // 0x1028(0x04)
	float                                         CineDurationTimeMax;                                         // 0x2770(0x04)
	float                                         CineTextAnimationAppearTime;                                 // 0x10c4(0x04)
	float                                         GetPerkOnStartTime;                                          // 0x3378(0x04)
	struct FNone*                                 FPSK_Camera;                                                 // 0xd00(0x08)
	struct FNone*                                 ADSCameraScene;                                              // 0x1ab8(0x08)
	struct FNone*                                 FPSK_MutableArms;                                            // 0x3210(0x08)
	struct FNone*                                 FPSK_Arms;                                                   // 0x1538(0x08)
	struct FNone                                  FPSK_CameraHeight;                                           // 0x2f08(0x0c)
	float                                         FPSK_CameraProbe;                                            // 0x1c1c(0x04)
	float                                         FPSK_CameraPitchDeltaX;                                      // 0x2c0c(0x04)
	struct FNone                                  FPSK_CameraLocation_Idle;                                    // 0x3848(0x0c)
	struct FName                                  FPSK_CameraBone_Idle;                                        // 0xa70(0x08)
	struct FNone                                  FPSK_CameraLocation_ADS;                                     // 0xb54(0x0c)
	struct FNone                                  FPSK_CameraLocation_Parkour;                                 // 0xc48(0x0c)
	struct FName                                  FPSK_CameraBone_Parkour;                                     // 0x2e80(0x08)
	float                                         FPSK_CameraHeight_Stand;                                     // 0xf90(0x04)
	float                                         FPSK_CameraHeight_Crouch;                                    // 0x1b38(0x04)
	float                                         FPSK_CameraHeight_Prone;                                     // 0x3408(0x04)
	struct FNone                                  FPSK_CameraLocation_Collide;                                 // 0x80c(0x0c)
	struct FNone                                  FPSK_CameraLocation_LeftLeanDelta;                           // 0x2650(0x0c)
	struct FNone                                  FPSK_CameraLocation_RightLeanDelta;                          // 0x2908(0x0c)
	float                                         FPSK_CameraLocation_CollideAlpha;                            // 0x25b4(0x04)
	struct FNone                                  FPSK_StartCameraHeight;                                      // 0x2540(0x0c)
	struct FNone                                  FPSK_DestCameraHeight;                                       // 0x924(0x0c)
	struct FNone*                                 FPSK_WeaponShadow;                                           // 0x3838(0x08)
	struct FNone*                                 FPSK_SightShadow;                                            // 0x1db0(0x08)
	struct FNone*                                 FPSK_GripShadow;                                             // 0x1f10(0x08)
	struct FNone*                                 FPSK_MagazineShadow;                                         // 0xf68(0x08)
	struct FNone*                                 FPSK_StockShadow;                                            // 0x1d98(0x08)
	struct FNone*                                 FPSK_TacticalAttachmentShadow;                               // 0xfe8(0x08)
	struct FNone*                                 FPSK_BarrelShadow;                                           // 0x2fe8(0x08)
	struct FNone*                                 FPSK_MuzzleShadow;                                           // 0xb48(0x08)
	struct TArray<None>                           FPSK_WeaponAttachments;                                      // 0x1ee0(0x10)
	char                                          bFPSK_UseCustomCurve : 0;                                    // 0x3930(0x01)
	char                                          bFPSK_IsDefaultTransformUpdated : 0;                         // 0x1248(0x01)
	char                                          bFPSK_IsFPSMode : 0;                                         // 0x1498(0x01)
	struct FNone                                  FPSK_CurrentWeaponTransform;                                 // 0x2210(0x30)
	struct FNone                                  FPSK_IdleWeaponTransform;                                    // 0x2890(0x30)
	struct FNone                                  FPSK_CollideWeaponTransform;                                 // 0x30c0(0x30)
	struct FNone                                  FPSK_ADS_DefaultWeaponTransform;                             // 0x12e0(0x30)
	struct FNone                                  FPSK_ADS_TargetWeaponTransform;                              // 0x3540(0x30)
	struct FNone                                  FPSK_ADS_DefaultWeaponTransform_BasicSightCache;             // 0x2c20(0x30)
	struct FNone                                  FPSK_ADS_DefaultWeaponTransform_CurrentSightCache;           // 0x1d20(0x30)
	struct FNone                                  FPSK_ADS_WeaponTransform;                                    // 0x2dd0(0x30)
	float                                         FPSK_ADSFOV;                                                 // 0x2bb8(0x04)
	float                                         FPSK_AOSFOV;                                                 // 0x34b4(0x04)
	float                                         FPSK_DefaultFOV;                                             // 0x3098(0x04)
	float                                         FPSK_CurrentMagnificationFactor;                             // 0x36f0(0x04)
	float                                         FPSK_TargetMagnificationFactor;                              // 0xa90(0x04)
	struct FNone*                                 MPC_WeaponFov;                                               // 0xcd8(0x08)
	struct FNone                                  FPSK_CurrentCameraRelativeLocation;                          // 0x1100(0x0c)
	float                                         FPSK_ADSAlpha;                                               // 0x1350(0x04)
	float                                         FPSK_StartFOV_Delta;                                         // 0x32c8(0x04)
	float                                         CameraInterpPlayRate;                                        // 0xbe4(0x04)
	float                                         AdsCameraInterpPlayRate;                                     // 0x35a8(0x04)
	float                                         FPSK_TargetADSAlpha;                                         // 0xf2c(0x04)
	struct FNone                                  FPSK_Timeline_Sway_Idle;                                     // 0x2348(0x98)
	struct FNone                                  FPSK_Timeline_Sway_Move;                                     // 0x3140(0x98)
	struct FNone*                                 FPSK_Curve_Sway_Idle_Default;                                // 0x1728(0x08)
	struct FNone*                                 FPSK_Curve_Sway_Move_Default;                                // 0x1040(0x08)
	struct FNone*                                 FPSK_Curve_Sway_Scale_With_Fov;                              // 0x1fe0(0x08)
	struct FNone*                                 FPSK_Curve_Sway_Idle;                                        // 0x28f8(0x08)
	struct FNone*                                 FPSK_Curve_Sway_Move;                                        // 0x9e0(0x08)
	char                                          bUseFPSK_Sway : 0;                                           // 0xb6c(0x01)
	float                                         FPSK_SwayAlpha;                                              // 0x123c(0x04)
	float                                         FPSK_SwayAlphaMin;                                           // 0x3728(0x04)
	float                                         FPSK_SwayAlphaMax;                                           // 0x3868(0x04)
	float                                         FPSK_SwayScale;                                              // 0xf48(0x04)
	struct FNone                                  FPSK_SwayRotationIdle;                                       // 0x1604(0x0c)
	struct FNone                                  FPSK_SwayRotationMove;                                       // 0x146c(0x0c)
	struct FNone                                  FPSK_SwayRotationDeltaForSteadyAim;                          // 0x2034(0x0c)
	float                                         FPSK_SwayInterpSpeed;                                        // 0x1f08(0x04)
	struct FNone                                  FPSK_LeanRotation;                                           // 0xacc(0x0c)
	struct FNone                                  FPSK_LeanLocation;                                           // 0x3248(0x0c)
	struct FNone                                  FPSK_CurrentCollideWeaponTransform;                          // 0x1a00(0x30)
	float                                         FPSK_CollideAlpha;                                           // 0x15e4(0x04)
	float                                         FPSK_CollideAngle;                                           // 0x1b24(0x04)
	float                                         FPSK_CollideAngle_LocalCache;                                // 0x2a80(0x04)
	char                                          bFPSK_IsCollide : 0;                                         // 0x848(0x01)
	struct TMap<None, None>                       FPSK_Curves_TunnelEffect;                                    // 0x1920(0x50)
	float                                         FPSK_TargetFOV;                                              // 0x188c(0x04)
	struct FNone                                  TimerHandle_NoCarLandingDamageToTeam;                        // 0x27d0(0x08)
	float                                         InAircraftNearClipPlane;                                     // 0x3714(0x04)
	struct TArray<None>                           AIBot_SearchedEnemyList;                                     // 0x1ac0(0x10)
	char                                          bEnableCustomDepth : 0;                                      // 0x3060(0x01)
	struct FNone                                  TimerHandle_HurtCondition;                                   // 0x3138(0x08)
	float                                         ProneDamageScaleInRedZone;                                   // 0x36b4(0x04)
	struct FNone*                                 BlueZoneFreezeEvent;                                         // 0x1a90(0x08)
	struct FNone*                                 BlueZoneFreezeStopEvent;                                     // 0x3270(0x08)
	struct FNone*                                 BlueZoneDroneEvent;                                          // 0x27c0(0x08)
	struct FNone*                                 BlueZoneDroneStopEvent;                                      // 0x2178(0x08)
	struct FNone*                                 SupplyBoxNotifyAlertMe;                                      // 0x1f30(0x08)
	struct FNone*                                 SupplyBoxNotifyAlertOther;                                   // 0x31e0(0x08)
	float                                         CheckFreezeDistance;                                         // 0x170c(0x04)
	float                                         CheckDroneDistance;                                          // 0x372c(0x04)
	struct FNone                                  DefaultSocketOffset_LeftLeanAMP;                             // 0xb34(0x0c)
	struct FNone                                  DefaultSocketOffset_RightLeanAMP;                            // 0x1800(0x0c)
	struct FNone                                  DefaultSocketOffset_RightAMP;                                // 0xac0(0x0c)
	struct FNone                                  DefaultSocketOffset_LeftAMP;                                 // 0xbe8(0x0c)
	float                                         DefaultTargetArmLength_AMP;                                  // 0xb40(0x04)
	float                                         AmplifierFocusDistance;                                      // 0x824(0x04)
	struct FNone                                  DefaultSocketOffset_LeftLeanHeartBeatSensor;                 // 0x3338(0x0c)
	struct FNone                                  DefaultSocketOffset_RightLeanHeartBeatSensor;                // 0x1f58(0x0c)
	struct FNone                                  DefaultSocketOffset_RightHeartBeatSensor;                    // 0x27dc(0x0c)
	struct FNone                                  DefaultSocketOffset_LeftHeartBeatSensor;                     // 0xa80(0x0c)
	float                                         DefaultTargetArmLength_HeartBeatSensor;                      // 0x3050(0x04)
	float                                         HeartBeatSensorFocusDistance;                                // 0x1b3c(0x04)
	float                                         CameraFocusDistanceAOS;                                      // 0x12c0(0x04)
	float                                         AirWalkStartTime;                                            // 0x7a8(0x04)
	struct FNone                                  TimerHandle_StopAirWalk;                                     // 0x1f38(0x08)
	float                                         AirWalkBestRecord;                                           // 0xb00(0x04)
	float                                         AirWalkTotalRecord;                                          // 0x258c(0x04)
	struct FNone*                                 AirWalkAudioEvent;                                           // 0x1c70(0x08)
	float                                         CurrentAirWalkVelocityZ;                                     // 0xf04(0x04)
	float                                         AirWalkDuration;                                             // 0x3090(0x04)
	float                                         AirWalkGravity;                                              // 0x20b8(0x04)
	struct FNone*                                 PersonalSupplySystemComponent;                               // 0x3880(0x08)
	enum class None                               PrevNetworkSmoothingMode;                                    // 0x3030(0x01)
	struct FNone                                  TimeHandle_SkyDive;                                          // 0x778(0x08)
	char                                          bActiveCriticalTime : 0;                                     // 0x1dc8(0x01)
	float                                         CriticalTimeTickInterval;                                    // 0x3870(0x04)
	float                                         CriticalTimeLimitTime;                                       // 0x23f8(0x04)
	struct FNone                                  CriticalTimeMeshLocaiton;                                    // 0x2f28(0x0c)
	struct TMap<None, None>                       CriticalTimeComponentTickIntervals;                          // 0x2670(0x50)
	float                                         ParachuteEnableHieght;                                       // 0x1d50(0x04)
	struct FNone*                                 ParachuteTriggerBox;                                         // 0xf40(0x08)
	struct FNone                                  CurHit;                                                      // 0x389c(0x88)
	struct FNone*                                 Curve_Sliding;                                               // 0x988(0x08)
	struct FNone*                                 ParticleSystem_Sliding;                                      // 0xa68(0x08)
	struct FNone*                                 ParticleSystemComponent_Sliding;                             // 0x1638(0x08)
	float                                         SlidingStartTime;                                            // 0x2258(0x04)
	enum class None                               GroundStateBeforeSliding;                                    // 0x1f18(0x01)
	struct TMap<None, None>                       ReplicateIndexPerkMap;                                       // 0x2128(0x50)
	uint16_t                                      SlidingBuffIndex;                                            // 0x1d90(0x02)
	char                                          bPendingStopSliding : 0;                                     // 0x1314(0x01)
	float                                         RollingStartTime;                                            // 0x2530(0x04)
	struct FNone*                                 PostProcessWetFogClass;                                      // 0x3798(0x08)
	struct TArray<None>                           ActiveWetFogAreas;                                           // 0x2ee8(0x10)
	struct FNone                                  WetFogInfo;                                                  // 0x34e0(0x20)
	struct FNone                                  WetFogZoneInfo;                                              // 0x1b58(0x0c)
	struct FNone                                  TimerHandle_WetFog;                                          // 0x1c10(0x08)
	struct FNone*                                 PostProcessBlackOutClass;                                    // 0x2e38(0x08)
	struct TArray<None>                           ActivePowerInterruptions;                                    // 0x1268(0x10)
	struct FNone                                  BlackOutInfo;                                                // 0xe28(0x20)
	struct FNone                                  TimerHandle_BlackOut;                                        // 0x2c50(0x08)
	struct FNone*                                 StartBlackOutAudioEvent;                                     // 0x1020(0x08)
	struct FNone*                                 StartBlackOutParticle;                                       // 0x18a0(0x08)
	struct FNone*                                 StartBlackOutParticleComponent;                              // 0xaa0(0x08)
	struct FMulticastInlineDelegate               OnSpawnBlackOutDelegate;                                     // 0x2d78(0x10)
	struct FNone*                                 PostProcessForceFieldClass;                                  // 0x2b68(0x08)
	struct TArray<None>                           ActiveForceFields;                                           // 0x3480(0x10)
	struct FNone                                  ForceFieldInfo;                                              // 0x1c50(0x20)
	struct FNone                                  TimerHandle_ForceField;                                      // 0x3508(0x08)
	struct FNone*                                 SuperBarrierClass;                                           // 0x1d08(0x08)
	char                                          UsingSimulationBox : 0;                                      // 0x34d5(0x01)
	char                                          HiddenSimulationBox : 0;                                     // 0x1558(0x01)
	float                                         SimulationBoxHeight;                                         // 0x3350(0x04)
	struct TSoftClassPtr<UObject>                 SimulationBoxClass;                                          // 0x35c0(0x28)
	struct FMulticastInlineDelegate               OnCompleteActiveSkillDelegate;                               // 0x1a68(0x10)
	struct FNone*                                 BombingTargetActor;                                          // 0x1348(0x08)
	struct FNone*                                 StartBomingEvent;                                            // 0x2270(0x08)
	char                                          IsBombing : 0;                                               // 0x2030(0x01)
	struct FNone                                  BombingInfo;                                                 // 0x30f4(0x24)
	float                                         AutoAimRadius;                                               // 0x3500(0x04)
	float                                         AutoAimDistance;                                             // 0x1480(0x04)
	char                                          bShowAutoAimDebug : 0;                                       // 0x1559(0x01)
	struct FNone*                                 TeleportFxTemplate;                                          // 0x37a0(0x08)
	struct FNone*                                 TeleportTraceFxTemplate;                                     // 0x2bb0(0x08)
	float                                         TeleportDisappearTime;                                       // 0x14a0(0x04)
	float                                         TeleportAppearTime;                                          // 0x1644(0x04)
	float                                         RocketJumpGravity;                                           // 0x2410(0x04)
	struct FNone*                                 RocketJumpAudioEvent;                                        // 0x1110(0x08)
	struct FNone*                                 RocketJumpLandedAudioEvent;                                  // 0x8c8(0x08)
	struct FNone*                                 ParticleSystem_RocketJump;                                   // 0x2ab8(0x08)
	struct FNone*                                 ParticleSystem_RocketJumpTrail;                              // 0xe60(0x08)
	struct FNone*                                 ParticleSystem_RocketJumpLanded;                             // 0x3070(0x08)
	struct FNone*                                 RocketJumpTrailEffect;                                       // 0x15f8(0x08)
	char                                          bFinishMeteorJump : 0;                                       // 0x1888(0x01)
	float                                         MeteorJumpGravity;                                           // 0x2808(0x04)
	char                                          bMeteorStrikeBlockingHit : 0;                                // 0x1584(0x01)
	struct TArray<None>                           MeteorGrenadeProjectileClass;                                // 0x3020(0x10)
	struct FNone*                                 MeteorJumpAudioEvent;                                        // 0x3318(0x08)
	struct FNone*                                 MeteorJumpLandedAudioEvent;                                  // 0xcd0(0x08)
	struct FNone*                                 ParticleSystem_MeteorJump;                                   // 0x830(0x08)
	struct FNone*                                 ParticleSystem_MeteorJumpTrail;                              // 0x25d0(0x08)
	struct FNone*                                 ParticleSystem_MeteorJumpLanded;                             // 0xf88(0x08)
	struct FNone*                                 MeteorJumpTrailEffect;                                       // 0x30b8(0x08)
	struct FNone*                                 MeteorTarget;                                                // 0x10f8(0x08)
	struct TArray<None>                           ThrownFlashbangs;                                            // 0x3388(0x10)
	struct TArray<None>                           ThrownMolotovCocktails;                                      // 0x28c8(0x10)
	struct TArray<None>                           ThrownC4s;                                                   // 0x2660(0x10)
	char                                          bIsUltimateSprint : 0;                                       // 0x10c0(0x01)
	char                                          IgnoreInteraction : 0;                                       // 0x971(0x01)
	struct FMulticastInlineDelegate               OnChangeCharacterStateDelegate;                              // 0x2750(0x10)
	uint32_t                                      LogSize;                                                     // 0x940(0x04)
	struct FNone                                  TimeHandle_RequestBuildingInfo;                              // 0xff8(0x08)
	float                                         LogIntervalTime;                                             // 0x15b8(0x04)
	uint32_t                                      LogRequestSize;                                              // 0x2cdc(0x04)
	struct TArray<None>                           LogList;                                                     // 0x3a80(0x10)
	struct TArray<None>                           LogJsonList;                                                 // 0x25b8(0x10)
	struct FNone*                                 GodEffect1;                                                  // 0x16c0(0x08)
	struct FNone*                                 GodEffect2;                                                  // 0x2970(0x08)
	struct FNone*                                 ParticleSystem_Knockout;                                     // 0x18e8(0x08)
	struct FNone                                  RepSimulatedHittedDamage;                                    // 0x32f0(0x10)
	float                                         FirstTimeHittedDamage;                                       // 0x25f8(0x04)
	float                                         LastTimeHittedDamage;                                        // 0xaec(0x04)
	struct FNone*                                 GodParticle;                                                 // 0x2470(0x08)
	char                                          NeedFindPersonalSupplyBoxLocation : 0;                       // 0xf0c(0x01)
	uint32_t                                      PersonalSupplyBoxRePositionCount;                            // 0x8f0(0x04)
	char                                          UsingPersonalSupplyBoxWeightMap : 0;                         // 0x27c8(0x01)
	char                                          UsingPersonalSupplyBoxRePosition : 0;                        // 0x3398(0x01)
	float                                         PersonalSupplyBoxRePositionDistance;                         // 0x2ecc(0x04)
	struct FNone                                  TimeHandle_Ultimate_Recon;                                   // 0xee0(0x08)
	struct FNone                                  AnimSlot_Ultimate_Recon;                                     // 0x2bc8(0x10)
	char                                          bIsUltimate_Recon : 0;                                       // 0x8f4(0x01)
	struct FNone*                                 AvoidHeadShotMontage;                                        // 0xc28(0x08)
	struct FNone*                                 SteelHelmetSound;                                            // 0x28c0(0x08)
	struct FNone                                  StuntmanRollingDir;                                          // 0x3754(0x0c)
	float                                         StuntmanStartTime;                                           // 0x15e0(0x04)
	struct FNone                                  TimerHandle_Stuntman;                                        // 0x3228(0x08)
	char                                          bNeedToUpdateNitroBoost : 0;                                 // 0x30f1(0x01)
	float                                         NitroBoostTorqueScale;                                       // 0x1cb4(0x04)
	struct FNone*                                 NitroBoomTargetVehicle;                                      // 0xaf8(0x08)
	char                                          bNeedToUpdateNitroBoom : 0;                                  // 0x157c(0x01)
	float                                         NitroBoomDuration;                                           // 0x1fec(0x04)
	char                                          bNeedToDrawNitroBoomTarget : 0;                              // 0x23ec(0x01)
	struct FNone                                  NitroBoomTargetLocation;                                     // 0x2db8(0x0c)
	float                                         NitroBoomLastVehicleSetTime;                                 // 0x860(0x04)
	char                                          bNeedToUpdateUltimate_Driver : 0;                            // 0x10dc(0x01)
	char                                          bNeedToCheckPlosiveSoundDetection : 0;                       // 0x30b0(0x01)
	struct FNone*                                 EnteredElevatorRef;                                          // 0x37e8(0x08)
	float                                         OuterDamage;                                                 // 0x780(0x04)
	struct FNone                                  TimerHandle_InOuterArea;                                     // 0x788(0x08)
	struct FNone                                  TimerHandle_UpdateInOuterArea;                               // 0x790(0x08)
	struct FMulticastInlineDelegate               DelegateCheckSupplyCost;                                     // 0x2e40(0x10)
	struct FNone                                  SecuredCache;                                                // 0xd54(0x04)
	struct FNone*                                 DamageCorrectValueByPenetrationDepthCurve;                   // 0x1d78(0x08)
	struct FNone*                                 AircraftFlightRef;                                           // 0x2f20(0x08)

	void WearItem(enum class None Slot, struct FString UniqueKey, char bUpdateSkeletalMesh); // sub_0x1ec97b0
	char WasMeshRecentlyRenderedOnScreen(float Tolerance); // sub_0x1ec9720
	char WantToFPSMode(); // sub_0x1ec9690
	char WantsToRocketJump(); // sub_0x1ec96f0
	char WantsToMeteorJump(); // sub_0x1ec96c0
	char ValidateEquippedWeaponsInVehicle(uint32_t WeaponIndex); // sub_0x1ec9600
	void ValidateCameraInterp(); // sub_0x1ec95e0
	void UpdateWetFogPP(char bForce); // sub_0x1ec9550
	void UpdateWalking_Prone(); // sub_0x1ec9530
	void UpdateWalking(); // sub_0x1ec9510
	void UpdateUltimate_Recon(); // sub_0x1ec94f0
	void UpdateTunnelEffect(float Value); // sub_0x1ec9470
	void UpdateTimeline(float DeltaTime); // sub_0x1ec93f0
	void UpdateTerrainType(float DeltaTime); // sub_0x1ec9370
	void UpdateTargetHealth(enum class None Type, float InTargetHealth); // sub_0x1ec92b0
	void UpdateSurfaceType(); // sub_0x1ec9290
	void UpdateStatupMaterialEffect(); // sub_0x1ec9270
	void UpdateSliding(); // sub_0x1ec9250
	void UpdateRolling(); // sub_0x1ec9230
	void UpdateReplaceFreeLook(float DeltaTime); // sub_0x1ec91b0
	void UpdateRenderSettings(float DeltaTime); // sub_0x1ec9130
	void UpdatePowerInterruptionPP(char bForce); // sub_0x1ec90a0
	void UpdatePostProcess_Indoor(float Value); // sub_0x1ec9020
	void UpdatePostProcess_FPP(float Value); // sub_0x1ec8fa0
	void UpdatePostProcess_CameraMonoChrome(float Value); // sub_0x1ec8f20
	void UpdatePostProcess_ADS(float Value); // sub_0x1ec8ea0
	void UpdatePostProcess(struct FName RowName, float Value); // sub_0x1ec8dd0
	void UpdatePassengerLocation(); // sub_0x1ec8db0
	void UpdateOuterPlayZonePP(char bForce); // sub_0x1ec8d20
	void UpdateNitroBoom(); // sub_0x1ec8d00
	void UpdateNearClipPlane(); // sub_0x1ec8ce0
	void UpdateMutableMesh(); // sub_0x1ec8cc0
	void UpdateMutableBuffList(); // sub_0x1ec8ca0
	void UpdateMutable__DelegateSignature(struct FNone* Character); // sub_0x239bfb0
	void UpdateMeleeAttack(struct FNone* MeleeAnimNotifyClass, char bDrawDebugObject); // sub_0x1ec8bd0
	void UpdateLeanValue(float DeltaTime); // sub_0x1ec8b50
	void UpdateKnockOutParticle(); // sub_0x1ec8b30
	void UpdateJetpackFuel(float DeltaTime); // sub_0x1ec8ab0
	void UpdateInteractionType(struct FNone& Hit); // sub_0x1ec89d0
	void UpdateInRagdoll(); // sub_0x1ec89b0
	void UpdateIdleNum(); // sub_0x1ec8990
	void UpdateGroundFriction(); // sub_0x1ec8970
	void UpdateFurActivation(); // sub_0x1ec8950
	void UpdateFPSMode(); // sub_0x1ec8860
	void UpdateForceFieldPP(char bForce); // sub_0x1ec88c0
	void UpdateFireInput(); // sub_0x1ec88a0
	void UpdateFalling(); // sub_0x1ec8880
	void UpdateDrive(); // sub_0x1518fe0
	void UpdateDebuffState(); // sub_0x1ec8840
	void UpdateCharacterOutlineMaterial(float DeltaTime); // sub_0x1ec87c0
	void UpdateCharacterMagneticDamagedMaterial(float DeltaTime); // sub_0x1ec8740
	void UpdateCharacterDustMaterial(float DeltaTime); // sub_0x1ec86c0
	void UpdateCharacterDamagedMaterial(float DeltaTime); // sub_0x1ec8640
	void UpdateCastingUI(); // sub_0x1ec8620
	void UpdateCameraPPByBuff(float DeltaTime); // sub_0x1ec85a0
	void UpdateCameraPP(char bIsOn, float StartValue, float TargetValue, float InTime, float OutTime, struct FName AnimName, struct FNone* PPPresetClass, struct FNone& DeactiveTimer, char bForce); // sub_0x1ec8300
	void UpdateCameraInterp(float Value); // sub_0x1ec8280
	void UpdateCamera(float DeltaTime); // sub_0x1ec8200
	void UpdateBreathEffect(); // sub_0x1ec81e0
	void UpdateBlueZonePP(char bForce); // sub_0x1ec8150
	void UpdateAreaInfo(struct TArray<None> TargetActiveAreas, struct FNone& TargetSkillZoneInfo); // sub_0x1ec7ff0
	void UpdateAOSMode(); // sub_0x1ec7f50
	void UpdateADSReturnTrigger(); // sub_0x1ec7f30
	void UpdateAdsCameraInterp(float Value); // sub_0x1ec7f70
	void UnProne(char bClientSimulation); // sub_0x1ec7e80
	void UnlockMovementInput(); // sub_0x1ec7f10
	void TryRetreat(char InIsRandomLocation, struct FNone InTargetLocation); // sub_0x1ec7da0
	void TryNuclear(struct FNone InTargetLocation); // sub_0x1ec7d10
	void TryExitLadder(char bIsForce); // sub_0x1ec7c80
	struct FNone* TraceSteppedSurface(); // sub_0x1ec7c50
	void ThrowingGrenade(); // sub_0x1ec7c30
	void TestSpawnPersonalSupplyBox(struct FNone& ServerLocation); // sub_0x1ec7ba0
	void TestMultiPersonalSupplyBox(float Distance, uint32_t Count); // sub_0x1ec7ad0
	void TestEndItemSpawnSimulationBox(struct FNone& Data, struct FString Msg); // sub_0x1ec7970
	void StopRagdoll(); // sub_0x1ec7950
	void StopPostProcessEffects(struct FName RowName, char bImmediately); // sub_0x1ec7880
	void StopPlayingPickupAnim(); // sub_0x1ec7860
	void StopAllPostProcessEffects(); // sub_0x1ec7840
	void StartTunnelEffect(); // sub_0x1ec7820
	void StartSteadyAim(); // sub_0x1ec7800
	void StartStatupMaterialEffect(struct FNone& StatupParams); // sub_0x1ec7750
	void StartSpawnBlackOut(float DelayTime); // sub_0x1ec76d0
	void StartReplaceFreeLook(); // sub_0x1ec76b0
	void StartRagdoll(); // sub_0x1ec7690
	void StartPostProcessEffects(struct FName RowName); // sub_0x1ec7610
	void StartFalling(); // sub_0x1ec75f0
	void StartDescending(); // sub_0x1ec75d0
	void StartCastingUI(enum class None CastingUIType, struct FName SourceName, float MaxTime, struct FNone* Target); // sub_0x1ec7480
	void StartADSProcess_2(); // sub_0x1ec7460
	void SpectatedDelegate__DelegateSignature(char bIsSpectated); // sub_0x239bfb0
	struct FNone* SpawnSkillTargeting(struct FName& ActorName, struct FNone& InSpawnLocation, float Radius); // sub_0x1ec7330
	void SpawnRandomWeapon(); // sub_0x1ec72e0
	void SpawnBrokenEquipment(); // sub_0x1ec72c0
	void SimulatedTakeDamage(); // sub_0x1ec72a0
	void ShowTeleportAppearEffect(); // sub_0x1ec7280
	void ShowSkillMap(float Radius); // sub_0x1ec7200
	void ShowParachuteMesh(char bVisibility, char bIsWithParachute); // sub_0x1ec7130
	void ShowKeyActions(); // sub_0x1ec7110
	void ShowInventoryNotEnoughSpaceMessage(); // sub_0x1ec70f0
	void ShowInteractiveForPickup(struct FNone& InteractionInfo, struct FNone& ItemInfo); // sub_0x1ec6f20
	void ShowInteractiveForAction(struct FNone& InteractionInfo); // sub_0x1ec6e00
	void ShowInteractionWidget(struct FNone InteractionInfo); // sub_0x1ec6c90
	void ShowHUDbySequence(); // sub_0x1ec6c70
	void ShowHeartBeatSensorEffect(char IsHeartBeatSensorEffect, float HeartBeatSensorLength); // sub_0x239bfb0
	void ShowCloudFxInDescent(char bWantsToShow); // sub_0x1ec6be0
	void ShowAmplifierEffect(char IsAmplifierEffect, float AmplifierLength); // sub_0x239bfb0
	void ShouldSprinting(char bNewShouldSprinting); // sub_0x1ec6b50
	char ShouldAdjustInDoor(enum class None InTarget); // sub_0x1ec6ac0
	void SetVisibleOutBlueZoneBlizzard(char Visible); // sub_0x239bfb0
	void SetTunnelEffectRatio(float Ratio); // sub_0x1ec6a40
	void SetTeleportEffect(char bStart); // sub_0x1ec69b0
	void SetTeamInfoVisibility(char IsVisible); // sub_0x239bfb0
	void SetTargetHealth(enum class None Type, float InTargetHealth, float InUsableHealth); // sub_0x1ec68b0
	void SetSteadyAim(char SteadyAim); // sub_0x1ec6820
	void SetState(enum class None NewState, char bReplicated); // sub_0x1ec6750
	void SetSavedPlayerState(struct FNone* PState); // sub_0x1ec66b0
	void SetReplicatedAnimMontage(struct FNone* NewAnimMontageTPP, struct FNone* NewAnimMontageFPP); // sub_0x1ec65f0
	void SetRecordingCharacterTickRate(float TickRate); // sub_0x239bfb0
	void SetRandomValuesToCustomizableObject(); // sub_0x1ec65d0
	void SetRandomIdleNum(); // sub_0x1ec65b0
	void SetProjectileGrenadeActor(struct FNone* Grenade); // sub_0x1ec6530
	void SetParkourTestComponentIndex(uint32_t IndexKey); // sub_0x1ec64b0
	void SetNearClipPlane(float NearClipPlane); // sub_0x1ec6430
	void SetMolotovFlameDotDamage(); // sub_0x1ec6410
	void SetMagneticDmgDissolveAnimationCurve(); // sub_0x1ec63f0
	void SetMagneticDamagedCharacterMaterial(); // sub_0x1ec63d0
	void SetLocalChargingGauge(char bStart); // sub_0x1ec6340
	void SetLadderComponent(struct FNone* NewLadder); // sub_0x1ec62c0
	void SetIsMelee(char bNewMelee, char bNewMeleeJumpAttack); // sub_0x1ec61f0
	void SetIsLanded(char bNewLanded); // sub_0x1ec6160
	void SetIsInsideBlueZone(char bIsInsideBlueZone); // sub_0x1ec60d0
	void SetIsFreeLook(char bNewFreeLook); // sub_0x1ec6040
	void SetIsFired(char bNewFired, float AutoDeactiveDelayTime); // sub_0x1ec5f70
	void SetInternalMagneticDamagedDissolveCharacterMaterial(float DeltaTime); // sub_0x1ec5ef0
	void SetInternalMagneticDamagedCharacterMaterial(char bOn); // sub_0x1ec5e60
	void SetInternalMagneticDamagedCharacterBackGroundMaterial_On(); // sub_0x1ec5e40
	void SetInternalMagneticDamagedCharacterBackGroundMaterial_Off(); // sub_0x1ec5e20
	void SetInternalDustDissolveCharacterMaterial(); // sub_0x1ec5e00
	void SetInternalDustCharacterMaterial(char bOn); // sub_0x1ec5d70
	void SetInternalDamagedDissolveCharacterMaterial(); // sub_0x1ec5d50
	void SetInternalDamagedCharacterMaterial(char bOn); // sub_0x1ec5cc0
	void SetInternalDamagedCharacterBackGroundMaterial_On(); // sub_0x1ec5ca0
	void SetInternalDamagedCharacterBackGroundMaterial_Off(); // sub_0x1ec5c80
	void SetInteractiveNoHide(char NoHide); // sub_0x1ec5bf0
	void SetInteractiveCustomMode(uint32_t ModeNum); // sub_0x1ec5b70
	void SetInteractionType(enum class None NewType); // sub_0x1ec5af0
	void SetInReduceSpeedExplosionRange(float DeltaTime); // sub_0x1ec5a70
	void SetFoundVehicleLocations(struct FNone& InCarScanUIInfo); // sub_0x1ec59a0
	void SetFlashBangPlaySound(); // sub_0x1ec5980
	void SetFlashBangEndSound(); // sub_0x1ec5960
	void SetFlashBangAngle(float Angle); // sub_0x1ec58e0
	void SetFireType(enum class None NewFireType); // sub_0x1ec5860
	void SetDustDissolveAnimationCurve(); // sub_0x1ec5840
	void SetDustCharacterMaterial(); // sub_0x1ec5820
	void SetDissolveAnimationCurveData(); // sub_0x1ec5800
	void SetDescentVariables(float NewAirControl, float NewMaxWalkSpeed, float NewGravityScale, float NewBarkingDecelerationFalling, float NewMaxAcceleration, struct FNone NewCameraRelativeLocation, char bForceLocation); // sub_0x1ec55e0
	void SetDefaultCameraLag(float NewDefaultCameraLag); // sub_0x1ec5560
	void SetDamagedFlashBang(float FlashBangValue); // sub_0x1ec54e0
	void SetDamagedCharacterMaterial(); // sub_0x1ec54c0
	void SetClassSelectType(char bSelectType); // sub_0x1ec5440
	void SetChargingGauge(char bStart); // sub_0x1ec53b0
	void SetCharacterMovementMode(char Mode); // sub_0x1ec5330
	void SetCharacterIntheWater(); // sub_0x1ec5310
	void SetCameraLag(char bEnable); // sub_0x1ec5280
	void SetCameraAssistComponent(char bSpectactor); // sub_0x1ec51f0
	void SetBackLightComponentsActive(char bNewActive); // sub_0x1ec5160
	void SetArmedState(char bDoArm, char bPlayUnequipAnimation, char bOrdered); // sub_0x1ec5040
	void SetADSReturnTimer(float ADSReturnDelayTime); // sub_0x1ec4f30
	void SetActiveFur(char bActive); // sub_0x239bfb0
	void SetActiveBreathEffect(char bNewActive); // sub_0x1ec4fb0
	void ServerWindowBreaching(struct TArray<None> TargetDamagedCharacters); // sub_0x1ec4e70
	void ServerUseBackpackItem(uint32_t BackpackItemIndex); // sub_0x1ec4db0
	void ServerUpdateRagdollVariables(struct FNone NewRagdollVelocity, struct FNone NewRagdollLocation, struct FNone NewActorLocation); // sub_0x1ec4c20
	void ServerUpdateNearbyVehicles(struct TArray<None> AddedVehicles, struct TArray<None> RemovedVehicles); // sub_0x1ec4b00
	void ServerUpdateCamera(struct FNone InCameraInfo); // sub_0x1ec4a40
	void ServerTryUseLadder(struct FNone* DetectedLadder); // sub_0x1ec4980
	void ServerTryExitVehicle(enum class None NextState); // sub_0x1ec48d0
	void ServerTryExitLadder(); // sub_0x1ec4880
	void ServerTryEnterVehicle(struct FNone* TargetVehicleSeat); // sub_0x1ec47c0
	void ServerTryElevatorInteraction(struct FNone* ElevatorActor, struct FNone* ElevatorComponet); // sub_0x1ec46c0
	void ServerTryDropBoxInteraction(struct FNone* TmpDropBox); // sub_0x1ec4600
	void ServerTotalAirWalkDistance(float TotalDistance); // sub_0x1ec4550
	void ServerTestSpawnPersonalBox(float X, float Y); // sub_0x1ec4450
	void ServerTakeDamage_Radial(float DamageAmount, struct FNone DamageEvent, struct FNone* TargetCharacter); // sub_0x1ec41d0
	void ServerTakeDamage_Point(float DamageAmount, struct FNone DamageEvent, struct FNone* TargetCharacter); // sub_0x1ec4020
	void ServerTakeDamage(float DamageAmount, struct FNone DamageEvent, struct FNone* TargetCharacter); // sub_0x1ec3ed0
	void ServerStopUltimate_Recon(); // sub_0x1ec3e80
	void ServerStopSliding(); // sub_0x1ec3e30
	void ServerStopRolling(); // sub_0x1ec3de0
	void ServerStopRevive(struct FNone* RevivedActor); // sub_0x1ec3d20
	void ServerStopResuscitation(struct FNone* ResuscitatedActor); // sub_0x1ec3c60
	void ServerStopMontage(struct FNone* AnimMontage, float BlendTime); // sub_0x1ec3b60
	void ServerStartUltimate_Recon(struct FNone InitialImpulse); // sub_0x1ec3ab0
	void ServerStartStuntman(); // sub_0x1ec3a60
	void ServerStartSteadyAim(); // sub_0x1ec3a10
	void ServerStartSliding(); // sub_0x1ec39c0
	void ServerStartRolling(struct FNone TargetRollingImpulse); // sub_0x1ec3910
	void ServerStartRocketJump(); // sub_0x1ec38c0
	void ServerStartRevive(struct FNone* RevivedActor); // sub_0x1ec3800
	void ServerStartResuscitation(struct FNone* ResuscitatedActor); // sub_0x1ec3740
	void ServerStartMeteorJump(); // sub_0x1ec36f0
	void ServerStartKickDoor(struct FNone* TargetDoor); // sub_0x1ec3630
	void ServerStartDescenting(); // sub_0x1ec35e0
	void ServerSpawnPersonalBox(struct FNone SpawnPersonalBoxData, struct FNone DebugData); // sub_0x1ec3470
	void ServerSpawnPerk(struct FNone SpawnPerkData); // sub_0x1ec3360
	void ServerSpawnBombing(struct FNone SpawnLocation); // sub_0x1ec32b0
	void ServerSetUpdateRenderSettings(char bValue); // sub_0x1ec31f0
	void ServerSetState(enum class None NewState); // sub_0x1ec3140
	void ServerSetSearchInstinctLocation(struct FNone InSearchInstinctLocation); // sub_0x1ec3090
	void ServerSetRemoteViewRotForDriver(uint16_t SendPitch, uint16_t SendYaw); // sub_0x1ec2f90
	void ServerSetProjectileGrenadeState(struct FNone* Grenade, enum class None NewState, struct FNone* NewTriggerActor); // sub_0x1ec2e60
	void ServerSetParachuteTargetRotator(struct FNone NewRotation); // sub_0x1ec2db0
	void ServerSetLeanState(enum class None NewLeanState, float InLeanDegreeMax); // sub_0x1ec2cb0
	void ServerSetIsParachuteLanding(char Flag, float Height); // sub_0x1ec2bb0
	void ServerSetIsMelee(char bNewMelee); // sub_0x1ec2af0
	void ServerSetIsFreeLook(char bNewFreeLook); // sub_0x1ec2a30
	void ServerSetInteractionType(enum class None NewType); // sub_0x1ec2980
	void ServerSetInSmoke(char bNewSmoke); // sub_0x1ec28c0
	void ServerSetFireType(enum class None NewFireType); // sub_0x1ec2810
	void ServerSetCustomBuoyancySwimMode(char Mode); // sub_0x1ec2750
	void ServerSetChargingGauge(char bStart); // sub_0x1ec2690
	void ServerSetCastingUI(enum class None CastingUIType, struct FName SourceName, float MaxTime, struct FNone* Target); // sub_0x1ec2510
	void ServerSetBoostPercent(uint8_t Percent); // sub_0x1ec2460
	void ServerSetActorRotation(struct FNone NewRotation); // sub_0x1ec23b0
	void ServerSetActorLocationAndRotation(struct FNone NewLocation, struct FNone NewRotation); // sub_0x1ec2280
	void ServerSetActiveSkillsKeyNameList(struct TArray<None> KeyNameList); // sub_0x1ec21c0
	void ServerSendInvalidHitInfos(struct TArray<None> InvalidHitInofs); // sub_0x1ec2120
	void ServerSelectThrowingWeaponThrowingType(enum class None NewThrowingType); // sub_0x1ec2070
	void ServerRewindMontage(struct FNone* AnimMontage); // sub_0x1ec1fb0
	void ServerResetVehicleSearch(); // sub_0x1ec1f60
	void ServerResetSearchInstinct(); // sub_0x1ec1f10
	void ServerReselectPerkDeck(); // sub_0x1ec1ec0
	void ServerRequestPayGold(uint32_t ActionCode, uint32_t Amount); // sub_0x1ec1dc0
	void ServerRequestBuildingItemSpawnState(struct FNone* Building); // sub_0x1ec1d00
	void ServerRequestBuildingItemSpawnList(uint32_t Size, float IntervalTime, char ToJson); // sub_0x1ec1bc0
	void ServerRequestBuildingCount(); // sub_0x1ec1b70
	void ServerQuickLanding(struct FNone ClientActorLocation); // sub_0x1ec1ac0
	void ServerPlayMontage(struct FNone* AnimMontageTPP, struct FNone* AnimMontageFPP); // sub_0x1ec19c0
	void ServerPickUpInBox(struct FNone* DropBoxActor, uint8_t ItemIndex, uint32_t GainQuantity, uint32_t WeaponSlotIndex); // sub_0x1ec1840
	void ServerPersonalBoxRePosition(struct FNone* TargetSupplyBox, struct FNone NewLocation, struct FString HitActorName); // sub_0x1ec16f0
	void ServerMoveItem(struct FNone* SourceActor, enum class None SourceSlotType, struct FNone SourceItemInfo, struct FNone* TargetActor, enum class None TargetSlotType, uint32_t TargetIndex, uint32_t GainQuantity); // sub_0x1ec1460
	void ServerMeteorStrike(); // sub_0x1ec1410
	void ServerMaxAirWalkDistance(float MaxDistance); // sub_0x1ec1360
	void ServerLaunchCharacter(struct FNone LaunchVelocity); // sub_0x1ec1290
	void ServerJetpackBooster(char bNewJackpack); // sub_0x1ec11d0
	void ServerJetpackAim(char bNewJetpackAim); // sub_0x1ec1110
	void ServerInputState(uint8_t Forward, uint8_t Right); // sub_0x1ec1020
	void ServerInputFPSOnly(char bFlag); // sub_0x1ec0f60
	void ServerHealthRegain(float Amount, enum class None BuffType); // sub_0x1ec0e60
	void ServerHandleDamageToVehicleDestructibleComponent(struct FNone* DestructibleComponent, struct FNone HitDetails, struct FNone ImpactVelocity); // sub_0x1ec0c20
	void ServerForceUpdateTerrainType(); // sub_0x1ec0bd0
	void ServerFireMode(); // sub_0x1ec0b80
	void ServerFailedActiveSkill_2(); // sub_0x1ec0b30
	void ServerFailedActiveSkill_1(); // sub_0x1ec0ae0
	void ServerEscapeTheFlames(struct FNone FlameDamageInfo); // sub_0x1ec09a0
	void ServerEquipPerk(enum class None Slot, struct FName PerkName, uint32_t Level, char Reset); // sub_0x1ec0820
	void ServerEndSteadyAim(); // sub_0x1ec07d0
	void ServerEndRevive(struct FNone* RevivedActor); // sub_0x1ec0710
	void ServerEndResuscitation(struct FNone* ResuscitatedActor); // sub_0x1ec0650
	void ServerDoWalking(char bNewWalking); // sub_0x1ec0440
	void ServerDoSprinting(char bNewSprinting); // sub_0x1ec0380
	void ServerDoRetreat(struct FNone NewLocation, struct FNone NewRotation, float RandomDistanceMax); // sub_0x1ec0200
	void ServerDoProne(char bNewProne); // sub_0x1ec0140
	void ServerDoPickUpItemOrWeapon(uint32_t WeaponSlotIndex, struct FNone* PickableItem, uint32_t GainQuantity); // sub_0x1ec0010
	void ServerDoorBreaching(struct FNone* TargetDoor, char bIsDamageCauserFrontOfDoor, struct TArray<None> TargetDamagedCharacters); // sub_0x1ec0500
	void ServerDoNuclear(struct FNone SpawnLocation, struct FNone NewNuclearInfo); // sub_0x1ebff00
	void ServerDoAirWalk(char bNewAirWalk, float InDuration, float InGravity); // sub_0x1ebfdc0
	void ServerDamageInFlames(struct FNone FlameDamageInfo); // sub_0x1ebfc80
	void ServerCompletedCombine(); // sub_0x1ebfc30
	void ServerClearCastingUI(); // sub_0x1ebfbe0
	void ServerChoosePerkDeck(uint32_t ChooseIndex); // sub_0x1ebfb20
	void ServerCheckLineTrace(); // sub_0x1ebfad0
	void ServerChangeGender(); // sub_0x1ebfa80
	void ServerCancleActiveSkill(uint32_t CancleActiveSkillSlot); // sub_0x1ebf9c0
	void ServerBuildingCountCheck(); // sub_0x1ebf970
	void ServerBeginCombine(struct FName RecipeKey); // sub_0x1ebf8b0
	void ServerBeginCastingBackpackItem(uint32_t BackpackItemIndex); // sub_0x1ebf7f0
	void ServerAttachToComponent(struct FNone* AttachingActor, struct FNone* AttachedComponent, struct FNone AttachLocation, struct FNone AttachNormal); // sub_0x1ebf640
	void ServerApplyDamage(float DamageAmount, struct FNone DamageEvent, struct FNone* EventInstigator, struct FNone* DamageCauser); // sub_0x1ebf4b0
	void ServerAddPerk(uint32_t Count); // sub_0x1ebf3f0
	void ServerAddExpToPerk(enum class None Slot, uint32_t ExpValue); // sub_0x1ebf2f0
	void ServerActiveSkill(uint32_t ActiveSkillSlot); // sub_0x1ebf230
	void ServerActionDestructObject(struct FNone* DestructibleActor, struct FNone* DestructibleComponent, struct FNone Location, float Damage, float EffectRange); // sub_0x1ebf060
	void ServerAbortCombine(); // sub_0x1ebf010
	void ServerAbortCastingBackpackItem(uint32_t BackpackItemIndex); // sub_0x1ebef50
	void SelectThrowingWeaponThrowingType(); // sub_0x1ebef30
	void SelectPerkDeck(struct FName DeckName); // sub_0x1ebeeb0
	void RifleMeleeAttack(); // sub_0x1ebee90
	void RevertGeneralSettingNearClipPlane(); // sub_0x1ebee70
	void ResetTargetHealth(); // sub_0x1ebee50
	void ResetPerkDeckUI(); // sub_0x1ebee30
	void ResetOxygen(); // sub_0x1ebee10
	void ResetMagneticDamagedCharacterMaterial(); // sub_0x1ebedf0
	void ResetLanding(); // sub_0x1ebedd0
	void ResetIdleNum(); // sub_0x1ebedb0
	void ResetFlashBangPP(); // sub_0x1ebed90
	void ResetDustCharacterMaterial(); // sub_0x1ebed70
	void ResetDamagedCharacterMaterial(); // sub_0x1ebed50
	void ResendHUDInfo(); // sub_0x1ebed30
	void RequestServerBuildingCount(); // sub_0x1ebed10
	void RequestNearBuildingItemSpawnState(); // sub_0x1ebecf0
	void RequestAllBuildingItemSpawnInfo(uint32_t RequestSize, float IntervalTime, char ToJson); // sub_0x1ebebe0
	void ReplaceFreeLookImmediately(); // sub_0x1ebebc0
	void RemoveWearableItem(enum class None Slot, char bUpdateSkeletalMesh); // sub_0x1ebeaf0
	void RemoveThrownMolotovCocktail(struct FNone* MolotovCocktail); // sub_0x1ebea70
	void RemoveThrownFlashbang(struct FNone* Flashbang); // sub_0x1ebe9f0
	void RemoveTargetHealth(enum class None Type); // sub_0x1ebe970
	void RemoveShortTimeHealth(struct FNone* HealthOwner); // sub_0x1ebe8f0
	void RemoveEquippingWearableItems(); // sub_0x1ebe8d0
	void RemoveDetectedStealable(struct FNone* NewCharacter); // sub_0x1ebe850
	void RemoveDetectedItem(struct FNone* NewPickup); // sub_0x1ebe7d0
	void RemoveDetectedDropBox(struct FNone* NewPickup); // sub_0x1ebe750
	void RemoveCondition(enum class None ConditionType, enum class None Key); // sub_0x1ebe690
	void RemoveCameraPP(struct FNone* TargetPPPresetClass); // sub_0x1ebe610
	void RemoveBackpackShield(struct FNone& DamageEvent); // sub_0x1ebe4f0
	struct FName RemoveArmShield(struct FNone& TargetHitResult, struct FNone& ShotDirection); // sub_0x1ebe3b0
	void RemoveAllWearableItem2(); // sub_0x1ebe370
	void RemoveAllWearableItem(); // sub_0x1ebe390
	void RemoveAllFoundVehicleLocations(); // sub_0x1ebe350
	void RemoveAllDetectedItems(); // sub_0x1ebe330
	void RemoveAllBackpackItem(); // sub_0x1ebe310
	void RefreshAppearanceInfo(); // sub_0x1ebe2f0
	void ReduceCharacterSpeedInGrenadeExplosionRange(); // sub_0x1ebe2d0
	void ReconnectProcess(); // sub_0x1ebe2b0
	void ReceiverVoice(struct FName Idx); // sub_0x1ebe220
	void ReadyTeleport(); // sub_0x239bfb0
	void ReadyGivePerkEvent(); // sub_0x239bfb0
	void PunchOnGround(); // sub_0x1ebe200
	void PunchOnAir(); // sub_0x1ebe1e0
	void Prone(char bClientSimulation); // sub_0x1ebe150
	void PrintAllDetectedItems(); // sub_0x1ebe130
	void PrepareLanding(enum class None InLandingReason); // sub_0x1ebe0b0
	void PlaySoundPlosiveSoundDetection3Lv(); // sub_0x1ebe090
	void PlayMontageTakeDamage(); // sub_0x1ebe070
	void PlayHitSoundForInstigator(); // sub_0x1ebe050
	void PlayDeathAnimation(struct FNone DeathAnimSlot, char bIsForce, struct FNone Force, struct FNone DeathRotation); // sub_0x1ebded0
	struct FNone PlayCharacterSound(struct FNone* Event, struct TArray<None>& Conditions); // sub_0x1ebdda0
	void PlayCameraShakeDescenting(); // sub_0x1ebdd80
	void PistolMeleeAttack(); // sub_0x1ebdd60
	void PickableItemDetected__DelegateSignature(); // sub_0x239bfb0
	void PhysicsImpulse_OnServer(struct FNone* PhysicsActor, struct FNone Impulse, struct FName BoneName); // sub_0x1ebdc00
	void PhysicsImpulse_Multicast(struct FNone* PhysicsActor, struct FNone Impulse, struct FName BoneName); // sub_0x1ebdae0
	void PhysicsActor_OnServer(struct FNone* PhysicsActor, struct FNone actorTransform); // sub_0x1ebd980
	void PhysicsActor_Multicast(struct FNone* PhysicsActor, struct FNone actorTransform); // sub_0x1ebd840
	void PhasePerkLevelUpTimer(float DelayTime, uint32_t UpCount); // sub_0x1ebd770
	void PhasePerkLevelUpReady(); // sub_0x1ebd750
	void PhasePerkLevelUp(uint32_t UpCount); // sub_0x1ebd6d0
	void PerkSpinEvent(char bShow, uint32_t Count, enum class None Slot); // sub_0x239bfb0
	void OnViewCameraOutWater__DelegateSignature(); // sub_0x239bfb0
	void OnViewCameraInWater__DelegateSignature(); // sub_0x239bfb0
	void OnUpdateStartReady(float DeltaTime); // sub_0x1ebd650
	void OnUpdatePassenger(float DeltaTime); // sub_0x1ebd2d0
	void OnUpdateParachuting(float DeltaTime); // sub_0x1ebd5d0
	void OnUpdateLadder(float DeltaTime); // sub_0x1ebd3d0
	void OnUpdateKnockout(float fDeltaTime); // sub_0x1ebd550
	void OnUpdateInAircraftCinematic(float DeltaTime); // sub_0x1ebd4d0
	void OnUpdateInAircraft(float DeltaTime); // sub_0x1ebd450
	void OnUpdateEndReady(float DeltaTime); // sub_0x1ebd3d0
	void OnUpdateDriverPossessedPawn(float DeltaTime); // sub_0x1ebd350
	void OnUpdateDriver(float DeltaTime); // sub_0x1ebd2d0
	void OnUpdateDescent(float DeltaTime); // sub_0x1ebd250
	void OnUpdateDeath(float DeltaTime); // sub_0x1ebd1d0
	void OnUpdateCriticalTime(float fDeltaTime); // sub_0x1ebd150
	void OnUpdateBattle(float fDeltaTime); // sub_0x1ebd0d0
	void OnToggleWidget(enum class None& ToggleType); // sub_0x1ebd040
	void OnThrowingGrenadeMontageEnded(struct FNone* Montage, char bInterrupted); // sub_0x1ebc040
	void OnStartCineAircraft(struct FNone* InAircraftFlight); // sub_0x1ebcfc0
	void OnSpawnBlackOutDelegate__DelegateSignature(); // sub_0x239bfb0
	void OnSetBaseElevator(struct FNone* baseComponent); // sub_0x1ebcf40
	void OnRep_UnderWater(char& LastFlag); // sub_0x1ebce90
	void OnRep_SteadyAim(); // sub_0x1ebce70
	void OnRep_NeedFindPersonalSupplyBoxLocation(); // sub_0x1ebcdd0
	void OnRep_Health(float& LastHealth); // sub_0x1ebcd10
	void OnRep_FPSK_TargetMagnificationFactor(); // sub_0x1ebccd0
	void OnRep_CurrentPerkInfos(); // sub_0x1ebccb0
	void OnRep_CurrentPerkDeck(); // sub_0x1ebcc70
	void OnRep_BoostPercent(); // sub_0x1ebcc30
	void OnRep_bInSmoke(); // sub_0x1ebcf20
	void OnRep_BandageTargetHealth(); // sub_0x1ebcc10
	void OnPinOffMontageEnded(struct FNone* Montage, char bInterrupted); // sub_0x1ebc040
	void OnParachuteSkinDataLoaded(struct TSoftObjectPtr<FNone> TargetParachuteSkin); // sub_0x1ebcaf0
	void OnOverlapEnd(struct FNone* OverlappedComponent, struct FNone* OtherActor, struct FNone* OtherComp, uint32_t OtherBodyIndex); // sub_0x1ebc9b0
	void OnOverlapBegin(struct FNone* OverlappedComponent, struct FNone* OtherActor, struct FNone* OtherComp, uint32_t OtherBodyIndex, char bFromSweep, struct FNone& SweepResult); // sub_0x1ebc7a0
	void OnOutSmoke__DelegateSignature(); // sub_0x239bfb0
	void OnOriginRebasing(struct FNone* World, struct FNone PreviosWorldOriginLocation, struct FNone OriginLocation); // sub_0x1ebc670
	void OnMovementUpdated(float DeltaSeconds, struct FNone OldLocation, struct FNone OldVelocity); // sub_0x1ebc550
	void OnMovementInputPressed__DelegateSignature(); // sub_0x239bfb0
	void OnInstigatorHitCharacter(struct FNone* DamageTypeClass); // sub_0x1ebc4d0
	void OnInSmoke__DelegateSignature(); // sub_0x239bfb0
	void OnInputStopFreeLook(); // sub_0x1ebc4b0
	void OnInputStopFire(); // sub_0x1ebc490
	void OnInputStopBoostItemMenu(); // sub_0x1ebc470
	void OnInputStartSprinting(); // sub_0x1ebc450
	void OnInputStartMovement(); // sub_0x1518fe0
	void OnInputStartFreeLook(); // sub_0x1ebc430
	void OnInputSmartPingMenuWorldMap(); // sub_0x1ebc410
	void OnInputSmartPingMenu2WorldMap(); // sub_0x1ebc3d0
	void OnInputSmartPingMenu(); // sub_0x1ebc3f0
	void OnInputReleaseCrouch(); // sub_0x1ebc3b0
	void OnInputFPSOnly(); // sub_0x1ebc390
	void OnInputEndSteadyAim(); // sub_0x1ebc370
	void OnInitializedFSM(struct FNone* Context); // sub_0x1ebc2e0
	void OnHitMeteorStrike(struct FNone* HitComponent, struct FNone* OtherActor, struct FNone* OtherComp, struct FNone NormalImpulse, struct FNone& Hit); // sub_0x1ebc110
	void OnGrenadeCookMontageEnded(struct FNone* Montage, char bInterrupted); // sub_0x1ebc040
	void OnFinishRocketJump(); // sub_0x1ebc020
	void OnFinishMeteorJump(); // sub_0x1ebc000
	void OnFinishAirWalk(); // sub_0x1ebbfe0
	void OnExitStartReady(char NextStateID); // sub_0x1ebbc00
	void OnExitPassenger(char NextStateID); // sub_0x1ebbf20
	void OnExitParachuting(char NextStateID); // sub_0x1ebbea0
	void OnExitLadder(char NextStateID); // sub_0x1ebbe20
	void OnExitKnockout(char NextStateID); // sub_0x1ebbda0
	void OnExitInAircraftCinematic(char NextStateID); // sub_0x1ebbd20
	void OnExitInAircraft(char NextStateID); // sub_0x1ebbca0
	void OnExitHipShot(); // sub_0x1518fe0
	void OnExitHeartBeatSensor(); // sub_0x1ebbc80
	void OnExitForceFieldDelegate__DelegateSignature(); // sub_0x239bfb0
	void OnExitFallingState__DelegateSignature(); // sub_0x239bfb0
	void OnExitEndReady(char NextStateID); // sub_0x1ebbc00
	void OnExitedVehicle(); // sub_0x1ebbfc0
	void OnExitedElevator(); // sub_0x1ebbfa0
	void OnExitDriverPossessedPawn(char NextStateID); // sub_0x1ebbb80
	void OnExitDriver(char NextStateID); // sub_0x1ebbb00
	void OnExitDescent(char NextStateID); // sub_0x1ebba80
	void OnExitDeath(char NextStateID); // sub_0x1ebba00
	void OnExitCriticalTime(char NextStateID); // sub_0x1ebb980
	void OnExitBattle(char NextStateID); // sub_0x1ebb900
	void OnExitAOS(); // sub_0x1ebb8e0
	void OnExitAMP(); // sub_0x1ebb8c0
	void OnExitADS(char bImmediately); // sub_0x1ebb830
	void OnEnterHipShot(char bImmediately); // sub_0x1ebb700
	void OnEnterHeartBeatSensor(char bImmediately); // sub_0x1ebb670
	void OnEnteredVehicle__DelegateSignature(); // sub_0x239bfb0
	void OnEnteredVehicle(); // sub_0x1ebb810
	void OnEnteredElevator(struct FNone* OutElevatorRef); // sub_0x1ebb790
	void OnEnterAOS(char bImmediately); // sub_0x1ebb5e0
	void OnEnterAMP(char bImmediately); // sub_0x1ebb550
	void OnEnterADS(char bImmediately); // sub_0x1ebb4c0
	void OnEndSearchInstinct__DelegateSignature(); // sub_0x239bfb0
	void OnEndCineAircraft(); // sub_0x1ebb4a0
	void OnDeath(); // sub_0x1ebb480
	void OnDamaged(struct FNone* DamageTypeClass, float DamageAmount); // sub_0x1ebb3b0
	void OnConditionStarted(enum class None NewCondition); // sub_0x1ebb330
	void OnConditionEnded(enum class None NewCondition); // sub_0x1ebb2b0
	void OnCompleteActiveSkillDelegate__DelegateSignature(); // sub_0x239bfb0
	void OnCheckSupplyCost__DelegateSignature(); // sub_0x239bfb0
	void OnCharacterGroundStateChange__DelegateSignature(enum class None State); // sub_0x239bfb0
	void OnChangeWeaponAttachments(); // sub_0x1ebb1d0
	void OnChangeTeleportState(char IsStart); // sub_0x1ebb140
	void OnChangeProjectilePredictPath__DelegateSignature(); // sub_0x239bfb0
	void OnChangeFireType__DelegateSignature(enum class None PreFireType, enum class None NewFireType); // sub_0x239bfb0
	void OnChangeEquipWeaponStateIntheWater(char bState); // sub_0x1ebb0b0
	void OnChangeDetectedItems__DelegateSignature(); // sub_0x239bfb0
	void OnChangedDediSettings(enum class None SettingType, float Value); // sub_0x1ebb1f0
	void OnChangeCurrentWeapon(); // sub_0x1ebb090
	void OnChangeCharacterState__DelegateSignature(enum class None& StateType); // sub_0x239bfb0
	void OnCameraViewModeChanged__DelegateSignature(char bIsThirdPerson); // sub_0x239bfb0
	void OnBoxChanged(); // sub_0x1eadd80
	void OnBlueZoneFollowingChanged(struct FNone* Checker, char bIsFollowing); // sub_0x1ebafc0
	void OnBeginStartReady(); // sub_0x1ebafa0
	void OnBeginPassenger(); // sub_0x1ebaf80
	void OnBeginParachuting(); // sub_0x1ebaf60
	void OnBeginLadder(); // sub_0x1ebaf40
	void OnBeginKnockout(); // sub_0x1ebaf20
	void OnBeginInAircraftCinematic(); // sub_0x1ebaf00
	void OnBeginInAircraft(); // sub_0x1ebaee0
	void OnBeginEndReady(); // sub_0x1ebaec0
	void OnBeginDriverPossessedPawn(); // sub_0x1ebaea0
	void OnBeginDriver(); // sub_0x1ebae80
	void OnBeginDescent(); // sub_0x1ebae60
	void OnBeginDeath(); // sub_0x1ebae40
	void OnBeginCriticalTime(); // sub_0x1ebae20
	void OnBeginBattle(); // sub_0x1ebae00
	void OnBattleRoyalStateChanged(enum class None PrevState, enum class None CurrentState); // sub_0x1ebad40
	void OnAttackOtherCharacterWithRangedWeapon__DelegateSignature(); // sub_0x239bfb0
	void OnAnyUpdateState(struct FNone* Context, struct FName WithStateName, char WithStateID, float WithStateTime); // sub_0x1ebac00
	void OnAnyExitState(struct FNone* Context, struct FName WithStateName, char WithStateID); // sub_0x1ebab00
	void OnAnyBeginState(struct FNone* Context, struct FName WithStateName, char WithStateID, char WithPrevious); // sub_0x1eba9c0
	void OnAnimInitialized(); // sub_0x1eba9a0
	void OnAirCraftDelegate__DelegateSignature(char State); // sub_0x239bfb0
	void NextParkourTestComponent(); // sub_0x1518fe0
	void NeedCheckCurrentBuff(); // sub_0x1eba980
	void MultiEndAppearingVehicle(struct FNone* TargetVehicle, struct FNone* TargetClass, struct FNone TargetTransform); // sub_0x1eb93f0
	void MultiDisappearingVehicle(struct FNone* TargetVehicle); // sub_0x1eb9360
	void MulticastWindowBreaching(); // sub_0x1eba960
	void MulticastUpdateRagdollVariables(struct FNone NewRagdollVelocity, struct FNone NewRagdollLocation, struct FNone NewActorLocation); // sub_0x1eba7d0
	void MulticastTakePointDamage(struct FNone DamageInfo); // sub_0x1eba700
	void MulticastStopMontage(struct FNone* AnimMontage, float BlendTime); // sub_0x1eba630
	void MulticastSimulatedTakeDamage(struct FNone RepSimulatedInfo); // sub_0x1eba580
	void MulticastSimulatedHittedDamage(struct FNone RepSimulatedInfo); // sub_0x1eba4e0
	void MulticastSetInteractiveShpere(char bActive); // sub_0x1eba450
	void MulticastRewindMontage(struct FNone* AnimMontage); // sub_0x1eba3c0
	void MulticastRemoveAttachedUsableItem(); // sub_0x1eba3a0
	void MulticastPlayMontage(char bPlayOnLocalClient, struct FNone* AnimMontageTPP, struct FNone* AnimMontageFPP); // sub_0x1eba290
	void MulticastPlayCharacterSound(enum class None AudioEventType, char TypeIndex); // sub_0x1eba1d0
	void MulticastObjectDestruction(struct FNone* DestructibleActor, struct FNone* DestructibleComponent, struct FNone Location, float Damage, float EffectRange); // sub_0x1eba040
	void MulticastInAircraft(struct FNone* AircraftFlight, float AttachYaw); // sub_0x1eb9f70
	void MulticastHandleDamageToVehicleDestructibleComponent(struct FNone* DestructibleComponent, struct FNone HitDetails, struct FNone ImpactVelocity); // sub_0x1eb9dc0
	void MulticastExceptOwnerStopAnimMontage(struct FNone* MontageToStopTPP, struct FNone* MontageToStopFPP); // sub_0x1eb9cf0
	void MulticastEndCombine(char bSuccess, struct FName TargetRecipe); // sub_0x1eb9c20
	void MulticastEndCastingBackpackItem(char bSuccess, struct FName ItemKey); // sub_0x1eb9b50
	void MulticastDoorObjectDestruction(struct FNone* DoorActor, struct FNone DamageEvent, struct FNone* EventInstigator, struct FNone* DamageCauser); // sub_0x1eb99d0
	void MulticastDoorBreaching(struct FNone BreachingParticleLocation, struct FNone BreachingParticleRotation); // sub_0x1eb98f0
	void MulticastBravoHotelHIDestructionObejct(struct FNone* BravoHotelDestructibleComponent, float Damage, struct FNone DamageEvent, struct FNone* EventInstigator, struct FNone* DamageCauser); // sub_0x1eb9730
	void MulticastBravoHotelDestructionObejct(struct FNone* BravoHotelDestructibleComponent, float Damage, struct FNone DamageEvent, struct FNone* EventInstigator, struct FNone* DamageCauser); // sub_0x1eb9570
	void MultiAppearingVehicle(struct FNone* TargetVehicle, struct FNone* TargetClass, struct FNone TargetTransform); // sub_0x1eb91e0
	void MuiticastSetUpdateRenderSettings(char bValue); // sub_0x1eb9150
	void MoveRightOnDescent(float DeltaTime, float AxisValue); // sub_0x1eb9090
	void MoveRight(float AxisValue); // sub_0x1eb9010
	void MoveForwardOnDescent(float DeltaTime, float AxisValue); // sub_0x1eb8f50
	void MoveForward(float AxisValue); // sub_0x1eb8ed0
	void MarkBrokenEquipmentNeedToSpawn(uint32_t Equipmentlevel, struct FNone& DamageImpulseDir, enum class None& EquipmentType); // sub_0x1eb8db0
	void ManageRotation(); // sub_0x1eb8d90
	void ManageMovementMode(); // sub_0x1eb8d70
	void ManageDebuffState(float DeltaTime); // sub_0x1eb8cf0
	void LockMovementInput(); // sub_0x1eb8cd0
	void LoadMouseSensitivty(); // sub_0x1eb8cb0
	void KillPerkLevelUpTimer(float DelayTime, uint32_t UpCount, uint32_t KillCount); // sub_0x1eb8ba0
	void KillPerkLevelUpReady(uint32_t KillCount); // sub_0x1eb8b20
	void KillPerkLevelUp(uint32_t UpCount, uint32_t KillCount); // sub_0x1eb8a60
	void KillGivePerkEvent(uint32_t KillCount); // sub_0x239bfb0
	void K2_UpdateMutable_PreviewPawn(char bChangeGender); // sub_0x239bfb0
	void K2_OnStartProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // sub_0x239bfb0
	void K2_OnGoParachute(); // sub_0x239bfb0
	void K2_OnEndProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // sub_0x239bfb0
	void K2_OnCameraViewModeChanged(char bIsThirdPerson); // sub_0x239bfb0
	void K2_OnAddControllerYawInput(float Val); // sub_0x239bfb0
	struct FNone K2_GetPerkLevelUpData(); // sub_0x1eb89f0
	struct FNone K2_GetPerkDeckData(); // sub_0x1eb8980
	struct FNone K2_GetPerkClassLevelUpElement(uint32_t Level); // sub_0x1eb87b0
	void K2_FPSK_OnStartADS(); // sub_0x239bfb0
	void K2_FPSK_OnEndADS(); // sub_0x239bfb0
	void K2_EnterSceneOfWin(); // sub_0x239bfb0
	void K2_Cheat_ToggleCharacterDebugCamera(); // sub_0x239bfb0
	char IsWantsToJetpackAim(); // sub_0x1eb8780
	char IsWantsToJetpack(); // sub_0x1eb8750
	char IsViewPointInWaterVolume(); // sub_0x1eb8720
	char IsVehicleState(enum class None State); // sub_0x1eb8690
	char IsVehiclePassenger(); // sub_0x1eb8660
	char IsVehicleDriver(); // sub_0x1eb8630
	char IsThirdPerson(); // sub_0x1eb8600
	char IsSwimming(); // sub_0x1eb85d0
	char IsSteadyAim(); // sub_0x1eb85a0
	char IsSprinting(); // sub_0x1eb8570
	char IsShowingLandingPosition(); // sub_0x1eb8540
	char IsReviving(); // sub_0x1eb84c0
	char IsResuscitating(); // sub_0x1eb8440
	char IsRecommendedPerkDeck(struct FName& PerkName); // sub_0x1eb83a0
	char IsReadyToSnipe(); // sub_0x1eb8380
	char IsProneStateTransitioning(); // sub_0x1eb8350
	char IsProne(); // sub_0x1eb8320
	char IsPlayingPickupAnim(); // sub_0x1eb82f0
	char IsPlayingEquipAnim(); // sub_0x1eb82c0
	char IsPlayingCastingAnim(); // sub_0x1eb8290
	char IsPlayerReplayViewMode(); // sub_0x1eb8260
	char IsPendingKickDoor(); // sub_0x1eb8230
	char IsOverlapWaterVolume(); // sub_0x1eb8200
	char IsOnLadder(); // sub_0x1eb81d0
	char IsOnIceLand(); // sub_0x1eb81a0
	char IsOnDescent(); // sub_0x1eb8170
	char IsMaxLevel(); // sub_0x1eb8140
	char IsMale(); // sub_0x1eb8110
	char IsLockedInventory(); // sub_0x1eb80e0
	char IsLocalPlayerControlledPawn(); // sub_0x1eb8020
	char IsLocallyPlaying(char bIncludeSpectedPawn); // sub_0x1eb8050
	char IsLandStop(); // sub_0x1eb7ff0
	char IsKicking(); // sub_0x1eb7fc0
	char IsJumping(); // sub_0x1eb7f90
	char IsJumpAttacking(); // sub_0x1eb7f60
	char IsInVehicle(); // sub_0x1eb7f30
	char IsInstancedFoliageActor(struct FNone* TargetActor); // sub_0x239bfb0
	char IsInSkydiving(); // sub_0x1eb7f00
	char IsInParachute(); // sub_0x1eb7ed0
	char IsInForceField(); // sub_0x1eb7ea0
	char IsInDoor(); // sub_0x1eb7e70
	char IsInAircraft(); // sub_0x1eb7e40
	char IsHipShot(); // sub_0x1eb7e10
	char IsFoundVehicleSearch(); // sub_0x1eb7de0
	char IsFoundSearchInstinct(); // sub_0x1eb7db0
	char IsFollowReplayViewMode(); // sub_0x1eb7d80
	char IsFirstPerson(); // sub_0x1eb7d50
	char IsFiring(); // sub_0x1eb7d20
	char IsEnoughtSupplyGold(); // sub_0x1eb7cf0
	char IsEnemyFor(struct FNone* OtherPlayerController); // sub_0x1eb7c60
	char IsEnemyCharacter(struct FNone* OtherCharacter); // sub_0x1eb7bd0
	char IsEnableSpawnSupplyBox(struct FNone* TargetActor, struct FString& OutResult); // sub_0x239bfb0
	char IsDisconnected(); // sub_0x1eb7ba0
	char IsCustomBuoyancySwimMode(); // sub_0x1eb7b70
	char IsCurrentThrowingWeapon(); // sub_0x1eb7b40
	char IsControllerTargetPawn(); // sub_0x1eb7b10
	char IsCondition(enum class None ConditionType); // sub_0x1eb7a80
	char IsClimbing(); // sub_0x1eb7a50
	char IsChargingGauge(); // sub_0x1eb7a20
	char IsCharacterPositionUnderWaterSurface(); // sub_0x1eb79f0
	char IsChangingWeapon(); // sub_0x1eb79c0
	char IsCastingBackpackItem(); // sub_0x1eb7990
	char IsBuff(enum class None BuffType); // sub_0x1eb7900
	char IsBeginner(); // sub_0x1eb78d0
	char IsAppearanceReplicated(); // sub_0x1eb78a0
	char IsAOS(); // sub_0x1eb7650
	char IsAlive(); // sub_0x1eb7870
	char IsAirWalking(); // sub_0x1eb7840
	char IsADS(); // sub_0x1eb7620
	char IsActiveLeanDamageBuff(); // sub_0x1eb7810
	char IsActiveHeartBeatSensor(); // sub_0x1eb77e0
	char IsActiveCastingUIWithType(enum class None& InCastingUIType); // sub_0x1eb7740
	char IsActiveCastingUI(); // sub_0x1eb7710
	char IsActiveAmplifier(); // sub_0x1eb76e0
	char IsActionWithWeapon(); // sub_0x1eb76b0
	char IsABot(); // sub_0x1eb75f0
	char IsAbleUltimate(); // sub_0x1eb7680
	void InternalSimulatedTakeDamage(struct FNone& RepSimulatedInfo); // sub_0x1eb7530
	void InternalSimulatedHittedDamage(struct FNone& RepDamageInfo); // sub_0x1eb7470
	void InternalJetpackBooster(char bNewJackpack); // sub_0x1eb73e0
	void InternalJetpackAim(char bNewJetpackAim); // sub_0x1eb7350
	void InternalInAircraft(struct FNone* AircraftFlight, float AttachYaw, char bCheckCinematic); // sub_0x1eb7240
	void InitTimeline(); // sub_0x1eb7200
	void InitRecordingCharacter(); // sub_0x239bfb0
	void InitializeStateAtCriticalTime(); // sub_0x1eb7220
	void InitCustomizableObjectInstance(); // sub_0x1eb71e0
	void HideSkillMap(); // sub_0x1eb71c0
	void HideInteractive(); // sub_0x1eb71a0
	void HideHUDbySequence(); // sub_0x1eb7180
	void HealthTick(float DeltaTime); // sub_0x1eb7100
	char HasWeaponOfType(enum class None WeaponType); // sub_0x1eb7070
	void HandleDamageToVehicleDestructibleComponent(struct FNone* DestructibleComponent, struct FNone HitDetails, struct FNone ImpactVelocity); // sub_0x1eb6ec0
	void GoParachute(); // sub_0x1eb6ea0
	void GoIncapacitated(char bCriticalTime, struct FNone& DamageInstigatorInfo); // sub_0x1eb6d80
	void GoForceParachute(); // sub_0x1eb6d60
	void GiveEquipment(); // sub_0x1eb6d40
	uint32_t GetZeroPointDistance(); // sub_0x1eb6d10
	uint32_t GetWearableRarity(enum class None WearableItemType); // sub_0x1eb6c80
	struct FString GetWearableItemName(enum class None SlotType); // sub_0x1eb6bd0
	struct FName GetWeaponSocketNameBySlot(uint32_t SlotIndex); // sub_0x1eb6b40
	enum class None GetWaterDepthType(); // sub_0x1eb6b20
	float GetViewPitch(); // sub_0x1eb6af0
	struct FNone* GetUsingLadder(); // sub_0x1eb6ac0
	uint32_t GetUsingBackpackItemIndex(); // sub_0x1eb6aa0
	uint32_t GetUniquePlayerId(); // sub_0x1eb6a70
	enum class None GetThrowingType(); // sub_0x1eb6a40
	struct FNone* GetThrowingGrenade(enum class None Type); // sub_0x1eb69b0
	float GetTeamPositionWidgetHeight(char FromBottom); // sub_0x1eb6910
	struct FNone* GetTeamPositionWidget(); // sub_0x1eb68e0
	char GetTargetHealthAfterHealing(float& OutTargetHealth); // sub_0x1eb6830
	float GetTargetHealth(); // sub_0x1eb6800
	float GetSurfaceDegrees(); // sub_0x1eb67d0
	float GetStateTime(); // sub_0x1eb67a0
	enum class None GetState(); // sub_0x1eb6770
	struct FNone* GetSmartPingSystem(); // sub_0x239bfb0
	struct FNone* GetSavedPlayerState(); // sub_0x1eb6740
	struct TArray<None> GetRevivers(); // sub_0x1eb6710
	struct TArray<None> GetResuscitaters(); // sub_0x1eb66e0
	float GetReadyToSnipeGauge(); // sub_0x1eb66c0
	enum class None GetPreviousState(); // sub_0x1eb6690
	struct TScriptInterface<INone> GetPostProcessMagneticHit(); // sub_0x1eb6650
	struct TScriptInterface<INone> GetPostProcessMagneticDamage(); // sub_0x1eb6610
	struct TScriptInterface<INone> GetPostProcessHit(); // sub_0x1eb65d0
	struct TScriptInterface<INone> GetPostProcessDust(); // sub_0x1eb6590
	struct TScriptInterface<INone> GetPostProcessBlood(); // sub_0x1eb6550
	struct FString GetPlayerName(); // sub_0x1eb64d0
	struct FNone GetPickupAnimSlot(); // sub_0x1eb64a0
	void GetPerkOnStart(); // sub_0x1eb6480
	struct FName GetPerkNameByBuffName(struct FName BuffName); // sub_0x1eb63f0
	uint32_t GetPerkIDByBuffName(struct FName BuffName); // sub_0x1eb6360
	uint32_t GetPerkClassLevel(); // sub_0x1eb6330
	struct FNone* GetPendingWeapon(); // sub_0x1eb6300
	uint32_t GetParkourTestIndexKey(); // sub_0x1505b20
	struct FNone* GetOverlapWaterVolume(); // sub_0x1eb62e0
	float GetOverHeal(); // sub_0x1eb62b0
	struct FNone* GetOccupyingVehicleSeat(); // sub_0x1eb6280
	struct FNone* GetOccupyingVehicle(); // sub_0x1eb6250
	uint32_t GetNextUltimateUnlockLevel(uint32_t UltimateLevel); // sub_0x1eb61c0
	struct FNone* GetMutableObjectInstance(); // sub_0x1eb6190
	struct FNone* GetMutableCloneInstance(); // sub_0x1eb6160
	float GetMeleeAttackDamage(); // sub_0x1eb6130
	float GetMaxLeanValue(); // sub_0x1eb6100
	uint32_t GetMaxHealth(); // sub_0x1eb60d0
	enum class None GetLeanState(); // sub_0x1eb60a0
	float GetLeanRotationAngle(); // sub_0x1eb6070
	float GetLeanDegreeMax(); // sub_0x1eb6040
	float GetLandingTimeRate(float LandingDuration); // sub_0x1eb5fb0
	float GetLandingPositionDuration(); // sub_0x1eb5f90
	struct FNone GetLandingPosition(); // sub_0x1eb5f60
	struct FNone* GetLadderComponent(); // sub_0x1eb5f40
	float GetJetpackFuel(); // sub_0x1eb5f10
	float GetIsFiredRemaining(); // sub_0x1eb5ee0
	struct FNone* GetInventoryCharacter(); // sub_0x1eb5eb0
	uint32_t GetIconIndex(); // sub_0x1eb5e80
	float GetHeartBeatSensorLength(); // sub_0x1eb5e50
	float GetGoldenTimePercent(); // sub_0x1eb5e20
	struct FString GetGameServerUIDString(); // sub_0x1eb5da0
	struct FNone GetFloorLocation(); // sub_0x1eb5d60
	struct FNone GetFixedBaseAimRotation(); // sub_0x1eb5d30
	enum class None GetFireType(); // sub_0x1eb5d00
	float GetFindLandingPositionRadius(); // sub_0x1eb5cd0
	struct FNone GetEyeLocation(); // sub_0x1eb5c90
	struct FNone GetEyeForwardVector(); // sub_0x1eb5c50
	struct FNone* GetEquippedThrowingWeapon(); // sub_0x1eb5c20
	struct FNone* GetEquippedMeleeWeapon(); // sub_0x1eb5bf0
	uint32_t GetDefeatLevel(); // sub_0x1eb5bc0
	struct FNone GetDefaultBalanceData(); // sub_0x1eb5ae0
	char GetDeathAnimMontage(struct FNone* DamageTypeClass, char bLocalHeadShot, struct FNone& OutAnimSlot, char& bOutIsForce); // sub_0x1eb5950
	struct FNone* GetCurrentWeapon(); // sub_0x1eb5920
	uint32_t GetCurrentUltimateLevel(); // sub_0x1eb58f0
	enum class None GetCurrentThrowingWeaponState(); // sub_0x1eb58c0
	uint32_t GetCurrentSelfResuscitationPrice(); // sub_0x1eb5890
	uint32_t GetCurrentResuscitationPrice(); // sub_0x1eb5860
	struct FNone* GetCurrentRangedWeapon(); // sub_0x1eb5830
	struct FNone GetCurrentPerkDeckSelectInfo(); // sub_0x1eb5710
	struct FName GetCurrentPerkDeck(); // sub_0x1eb56d0
	struct FNone* GetCurrentParkourComponent(); // sub_0x1eb56a0
	float GetCurrentMovementModeTime(); // sub_0x1eb5670
	struct FNone* GetCurrentAkRoomComponent(); // sub_0x1eb5640
	struct FNone* GetCurrentAbilityWeapon(); // sub_0x1eb5610
	struct FNone* GetCompareWeaponObjectRef(struct FNone& ItemInfo); // sub_0x1eb5510
	struct TArray<None> GetCharactersInBreachingArea(struct FNone& BreachingForward, struct FNone& BreachingRight, struct FNone& BreachingUp, struct FNone& BreachingLoc); // sub_0x1eb5320
	float GetCastingRemainTime(); // sub_0x1eb5300
	float GetCastingPercent(); // sub_0x1eb52e0
	struct FNone GetCastingItemInfo(); // sub_0x1eb5250
	struct FNone GetCastingInfo(); // sub_0x1eb5210
	struct FNone* GetCamera3P(); // sub_0x1eb51e0
	struct FNone* GetBravoHotelPlayerState(); // sub_0x1eb51b0
	struct FString GetAudioConditionState(struct FNone& Group); // sub_0x1eb50a0
	void GetAttachedUsableItems(struct FNone* TargetParent, struct TArray<None>& OutItems); // sub_0x1eb4fb0
	void GetArmsOffset(struct FNone& OutOffset); // sub_0x1eb4f20
	struct FString GetAppearanceMutableKey(uint32_t AppearanceID, uint32_t ColorID); // sub_0x1eb4e40
	struct FNone* GetAnimSlotMontage(struct FNone AnimSlot); // sub_0x1eb4da0
	struct FNone GetAnimSlotByProneState(struct FNone& AnimSlot_Stand, struct FNone& AnimSlot_Prone); // sub_0x1eb4c90
	float GetAmplifierLength(); // sub_0x1eb4c60
	struct TArray<None> GetAllowedWeaponType(); // sub_0x1eb4be0
	struct FNone* GetAkComponent(); // sub_0x1eb4bc0
	struct FNone GetAirWalkGravity(); // sub_0x1eb4b80
	struct FNone GetAimOffsets(); // sub_0x1eb4b40
	struct FName GetActiveSkillKeyName(uint32_t ActiveSkillSlot); // sub_0x1eb4ab0
	struct FNone* GetActiveMesh(); // sub_0x1eb4a80
	float GetActiveCameraTargetArmLength(); // sub_0x1eb4a50
	float GetActiveCameraSocketDistance(); // sub_0x1eb4a20
	struct FNone* GetActiveCamera(); // sub_0x1eb49f0
	float GetAbilityModifier(enum class None AbilityType); // sub_0x1eb4960
	void FPSK_UpdateWeaponTransform(float DeltaTime); // sub_0x1eb45d0
	void FPSK_UpdateSwayMove(struct FNone Value); // sub_0x1eb4540
	void FPSK_UpdateSwayIdle(struct FNone Value); // sub_0x1eb44b0
	void FPSK_UpdateMaterialParams(); // sub_0x1eb4490
	void FPSK_UpdateADSReady(); // sub_0x1eb4470
	void FPSK_UpdateADSFOV(float DeltaTime); // sub_0x1eb43f0
	void FPSK_SetWeaponShadowVisible(char bVisible); // sub_0x1eb4360
	void FPSK_SetADSReady(char bReady, char bImmediately); // sub_0x1eb4170
	void FPSK_SetADSFOV(float TargetFOV, char bImmediately); // sub_0x1eb40a0
	void FPSK_SetActiveMutableClipping(char bNewActive); // sub_0x1eb42d0
	void FPSK_SetActive(char bNewActive); // sub_0x1eb4240
	void FPSK_ServerSetTargetFovMagnifier(float CurrentMagnifier, float NewMagnifier); // sub_0x1eb3fa0
	void FPSK_KeepBoltActionCallbackFunc(); // sub_0x1eb3f80
	struct FNone* FPSK_GetCamera(); // sub_0x1eb3f50
	void FPSK_DoSetTargetFovMagnifier(float NewMagnifier); // sub_0x1eb3ed0
	void FPSK_CreateWeaponshadowComponents(); // sub_0x1eb3eb0
	void FPSK_ClientSetTargetFovMagnifier(float NewMagnifier); // sub_0x1eb3e30
	char FPSK_CheckIsCollide(struct FNone& DefaultRelativeWeaponTransform); // sub_0x1eb3d50
	char FPSK_CanWearItem(enum class None& Slot, struct FString UniqueKey); // sub_0x1eb3c50
	char FPSK_CanSway(); // sub_0x1eb3c20
	void FPSK_ActiveADSEffects(char bActive); // sub_0x1eb3b90
	void ForceUnProne(); // sub_0x1eb4940
	void ForceUnCrouch(); // sub_0x1eb4920
	void ForceProne(); // sub_0x1eb4900
	void ForceClearCastingUI(); // sub_0x1eb48e0
	void ForceAllUpdateCameraPP(); // sub_0x1eb48c0
	struct FNone* FindSkyLight(); // sub_0x1eb4890
	struct FNone FindLocationPersonalSupplyBox(uint32_t MinDistance, uint32_t MaxDistance, float Degree); // sub_0x1eb4770
	struct FNone FindLocation(uint32_t MinDistance, uint32_t MaxDistance, float Degree); // sub_0x1eb4650
	struct FText ExpertWeaponName(uint32_t Index); // sub_0x1eb3aa0
	struct FName ExpertWeaponKey(uint32_t Index); // sub_0x1eb3a10
	void ExitWetFog(struct FNone* AreaSkillZone); // sub_0x1eb3990
	void ExitPowerInterruption(struct FNone* AreaSkillZone); // sub_0x1eb3910
	void ExitForceField(struct FNone* AreaSkillZone); // sub_0x1eb3890
	void EnterWetFog(struct FNone* AreaSkillZone); // sub_0x1eb3810
	void EnterPowerInterruption(struct FNone* AreaSkillZone); // sub_0x1eb3790
	void EnterForceField(struct FNone* AreaSkillZone); // sub_0x1eb3710
	void EnterCameraInterp(); // sub_0x1eb36f0
	void EndSpawnSimulationBox(struct FNone& Data, struct FString Msg); // sub_0x1eb3590
	void EndRevived(struct FNone* ActActor); // sub_0x1eb3510
	void EndResuscitated(struct FNone* InActActor, uint32_t InRevivedCurrentGold, uint32_t InSaviorCurrentGold, char bGoldRequest, uint32_t InRevivedUseGold, uint32_t InSaviorUseGold); // sub_0x1eb3350
	void EndReplaceFreeLook(); // sub_0x1eb3330
	void EndKickDoor(); // sub_0x1eb3310
	void EndItemSpawnSimulationBox(struct FNone& Data); // sub_0x1eb3210
	void EndAppearingVehicle(struct FNone* TargetVehicle, struct FNone TargetTransform); // sub_0x1eb30d0
	void DrawFoliageLayDown(struct FNone* TextureRenderTarget, struct FNone* RenderMaterial, float fTextureScale, float fLieDistance, float fCollisionAreaRadius, float fDrawDistance); // sub_0x1eb2f10
	void DoWindowBreaching(); // sub_0x1eb2ef0
	void DoWeaponMeleeAttack(); // sub_0x1eb2ed0
	void DoWalking(char bNewWalking); // sub_0x1eb2e40
	void DoTryUseBackpackItem(uint32_t& BackpackItemIndex); // sub_0x1eb2db0
	void DoTryExitVehicle(char bForceExit); // sub_0x1eb2d20
	void DoTryEnterVehicle(struct FNone* TargetVehicleSeat, char bRetryToVacantSeat); // sub_0x1eb2c50
	void DoToggleCamera(); // sub_0x1eb2c30
	void DoThrowWeaponReady(); // sub_0x1eb2c10
	void DoThrowWeaponFire(); // sub_0x1eb2bf0
	void DoTeleport(); // sub_0x1eb2bd0
	void DoStopSliding(); // sub_0x1eb2bb0
	void DoStopRevive(); // sub_0x1eb2b90
	void DoStopResuscitation(); // sub_0x1eb2b70
	void DoStopMontage(struct FNone* AnimMontage, float BlendTime); // sub_0x1eb2aa0
	void DoStopInteraction(); // sub_0x1eb2a80
	void DoStopCastingAction(); // sub_0x1eb2a60
	void DoStopAllActions(char bStopAllMontages); // sub_0x1eb29d0
	void DoStartUltimate_Recon(float InitialImpulseStrength); // sub_0x1eb2950
	void DoStartStuntman(); // sub_0x1eb2930
	void DoStartSliding(); // sub_0x1eb2910
	void DoStartRolling(float InitialImpulseStrength); // sub_0x1eb2890
	void DoStartRevive(); // sub_0x1eb2870
	void DoStartResuscitation(); // sub_0x1eb2850
	void DoStartKickDoor(char bFromReplication); // sub_0x1eb27c0
	void DoStartInteraction(); // sub_0x1eb27a0
	void DoSprinting(char bNewSprinting); // sub_0x1eb2710
	void DoSpawnBlackOut(); // sub_0x1eb26f0
	void DoSetIsParachuteLanding(float DeltaTime, char Flag, float Height); // sub_0x1eb25e0
	void DoSetActorRotation(struct FNone& NewRotation); // sub_0x1eb2550
	void DoReselectPerkDeck(); // sub_0x1eb2530
	void DoReloadImmediately(); // sub_0x1eb2510
	void DoReload(); // sub_0x1eb24f0
	void DoPunchAttack(); // sub_0x1eb24d0
	void DoProne(char bNewProne); // sub_0x1eb2440
	void DoPlayAnimSlot(struct FNone& AnimSlot); // sub_0x1eb23a0
	void DoPickUpWeapon(uint32_t& WeaponSlotIndex, struct FNone* PickableItem); // sub_0x1eb22d0
	void DoPickUpQuantity(struct FNone* PickableItem, uint32_t GainQuantity); // sub_0x1eb2210
	void DoPickUpInBox(struct FNone* DropBoxActor, struct FNone& GainItemInfo, uint32_t GainQuantity, uint32_t WeaponSlotIndex); // sub_0x1eb2050
	void DoPickUp(struct FNone* PickableItem); // sub_0x1eb1fd0
	void DoNuclear(); // sub_0x1eb1fb0
	void DoMoveUp(float AxisValue); // sub_0x1eb1f30
	void DoMoveRight(float AxisValue); // sub_0x1eb1eb0
	void DoMoveItem(struct FNone* SourceActor, enum class None SourceSlotType, struct FNone& SourceItemInfo, struct FNone* TargetActor, enum class None TargetSlotType, uint32_t TargetIndex, uint32_t GainQuantity); // sub_0x1eb1c50
	void DoMoveForward(float AxisValue); // sub_0x1eb1bd0
	void DoJumpEx(char bNewJumping); // sub_0x1eb1b40
	void DoJetpackBooster(char bNewJackpack); // sub_0x1eb1ab0
	void DoJetpackAim(char bNewJetpackAim); // sub_0x1eb1a20
	void DoInAircraft(struct FNone* AircraftFlight, float AttachYaw); // sub_0x1eb1950
	void DoFiring(char bIsNewFire); // sub_0x1eb18c0
	void DoFireMode(); // sub_0x1eb18a0
	void DoEquipPerkByID(enum class None Slot, uint32_t ID, uint32_t Level); // sub_0x1eb17a0
	void DoEquipPerk(enum class None Slot, struct FName PerkName, uint32_t Level); // sub_0x1eb16a0
	void DoEndSteadyAim(); // sub_0x1eb1680
	void DoEndRevive(); // sub_0x1eb1660
	void DoEndResuscitation(); // sub_0x1eb1640
	void DoDoorBreaching(); // sub_0x1eb1620
	void DoDisArm(); // sub_0x1eb1600
	void DoCrouch(char bNewCrouch); // sub_0x1eb1570
	void DoCookThrowingWeapon(); // sub_0x1eb1550
	void DoChoosePerkDeck(uint32_t ChooseIndex); // sub_0x1eb14d0
	void DoChangeWeaponZeroPoint(char bNext); // sub_0x1eb1440
	void DoChangeWeapon(uint32_t NewWeaponSlotIndex, char bPlayUnequipAnimation); // sub_0x1eb1380
	void DoChangeGender(); // sub_0x1eb1360
	void DoCancelActiveSkill(); // sub_0x1eb1340
	void DoBeginCombine(struct FName& RecipeKey); // sub_0x1eb12b0
	void DoAnalogStickX(float AxisValue); // sub_0x1eb1230
	void DoAirWalk(char bNewAirWalk); // sub_0x1eb11a0
	void DestroyProjectileGrenadeActor(struct FNone* Grenade); // sub_0x1eb1120
	void DeactiveHeartBeatSensor(); // sub_0x1eb1100
	void DeactiveAmplifier(); // sub_0x1eb10e0
	void DeactivateADSPostProcess(); // sub_0x1eb10c0
	void CreateRandomWeapon(); // sub_0x1eb10a0
	char CollisionCheckBeforeProne(); // sub_0x1eb1070
	void ClinentRemoveNoPlayVoice(struct FName Idx); // sub_0x1eb0fe0
	void ClinentAddNoPlayVoice(struct FName Idx); // sub_0x1eb0f50
	void ClientUpdateKillcamInfo(struct FNone* OtherCharacter, char bUpdateTime); // sub_0x1eb0e50
	void ClientStopUseLadderByReconnect(); // sub_0x1eb0cd0
	void ClientStopedRevive(struct FNone* RevivedActor); // sub_0x1eb0dc0
	void ClientStopedResuscitation(struct FNone* ResuscitatedActor, char bSuccess); // sub_0x1eb0cf0
	void ClientSpawnPerkNotiMessage(struct FNone Message); // sub_0x1eb0c30
	void ClientSimulatedHittedDamage(struct FNone RepSimulatedInfo); // sub_0x1eb0b90
	void ClientShowInventoryNotEnoughSpaceMessage(); // sub_0x1eb0b70
	void ClientShowInvenMaterialSlotNotEnoughSpaceMessage(); // sub_0x1eb0b50
	void ClientShowActionMessage(uint32_t TableIndex, struct FText Message); // sub_0x1eb0a40
	void ClientSetLeanState(enum class None NewLeanState); // sub_0x1eb09c0
	void ClientSetCastingUI(enum class None CastingUIType, struct FName SourceName, float MaxTime, struct FNone* Target); // sub_0x1eb0880
	void ClientRewindMontage(struct FNone* AnimMontage); // sub_0x1eb0800
	void ClientReselectPerkDeckLog(struct FName PrePerkDeck, struct FName NextPerkDeck); // sub_0x1eb0730
	void ClientRequestBuildingItemSpawnStateString(struct FString BuildingItemSpawnLog); // sub_0x1eb0680
	void ClientRequestBuildingItemSpawnList(struct TArray<None> List, char bStart, char bEnd, uint32_t TotalCnt); // sub_0x1eb04e0
	void ClientRequestBuildingCount(struct FNone DivisionBuildingCount, struct FNone CurrentBuildingCount); // sub_0x1eb0410
	void ClientReconnectProcess(struct FNone ReconnectInfo); // sub_0x1eb0390
	void ClientQuickLanding(); // sub_0x1eb0370
	void ClientPrepareLanding(enum class None InLandingReason); // sub_0x1eb02f0
	void ClientPlayVoice(struct FName Idx); // sub_0x1eb0260
	void ClientPlaySequence(struct FNone* Sequnce, char bReverse); // sub_0x1eb0190
	void ClientPickupDefaultTime(float IntervalTime); // sub_0x1eb0110
	void ClientPhasePerkLevelUpReady(); // sub_0x1eb00f0
	void ClientPerkSpinEvent(char bShow, uint32_t Count, enum class None Slot); // sub_0x1eaffe0
	void ClientNotifyDamageToDamageCauser(struct FNone* HittedCharacter, float DamageAmount, struct FNone DamageEvent, struct FNone* EventInstigator, struct FNone* DamageCauser); // sub_0x1eafe40
	void ClientKillPerkLevelUpReady(uint32_t KillCount); // sub_0x1eafdb0
	void ClientJetpackBooster(char bNewJackpack); // sub_0x1eafcf0
	void ClientInAircraft(struct FNone* AircraftFlight, float AttachYaw); // sub_0x1eafc20
	void ClientHitRateData(struct FNone InHitRateWeaponLogData); // sub_0x1eafb90
	void ClientFindPersonalSupplyBoxLocation(struct FNone SpawnInfo); // sub_0x1eafae0
	void ClientFailedToEnterVehicle(); // sub_0x1eafac0
	void ClientExitLadder(); // sub_0x1eafaa0
	void ClientEndRevive(struct FNone* InRevivedActor, uint32_t InRevivedTime); // sub_0x1eaf9d0
	void ClientEndResuscitated(struct FNone* InRevivedPlayerState, struct FNone* InSaviorPlayerState, struct FNone InLogData); // sub_0x1eaf8c0
	void ClientDoAbortCastingBackpackItemInVehicle(); // sub_0x1eaf8a0
	void ClientDebugBoxTrace(struct FNone TraceStart, struct FNone TraceEnd, struct FNone HalfSize); // sub_0x1eaf7b0
	void ClientClearCastingUI(); // sub_0x1eaf790
	void ClientChoosePerkDeck(uint32_t ChooseIndex, char bSuccess); // sub_0x1eaf6c0
	void ClientApplyDamage(float DamageAmount, struct FNone DamageEvent, struct FNone* EventInstigator, struct FNone* DamageCauser); // sub_0x1eaf570
	void ClientAddWearableEffectBuffList(struct FString BuffIndex); // sub_0x1eaf4c0
	void ClientAddPerkLevel(struct FNone InPerkInfo, enum class None InLevelUpType, uint32_t InBeforeLevel, uint32_t InAfterLevel, uint32_t InBeforeMaxHealth); // sub_0x1eaf320
	void ClearInteractionUI(); // sub_0x1eaf300
	void CheckVisibleOutBlueZoneBlizzard(); // sub_0x1eaf2e0
	void CheckUseItem(struct FName& ItemKey); // sub_0x1eaf250
	void CheckUnderLand(float DeltaTime); // sub_0x1eaf1d0
	void CheckThrowWeapon(struct FName& ItemKey); // sub_0x1eaf140
	void CheckStopRevive(); // sub_0x1eaf120
	void CheckSteady(float DeltaTime); // sub_0x1eaf0a0
	void CheckShakeOutMontage(); // sub_0x1eaf080
	void CheckRequestBuildingInfo(); // sub_0x1eaf060
	void CheckProneWeaponIdle(); // sub_0x1eaf040
	void CheckProneCollision(); // sub_0x1eaf020
	char CheckPlosiveSoundDetection(enum class None DetiectionType); // sub_0x1eaef90
	void CheckOxygen(float DeltaTime); // sub_0x1eaef10
	void CheckOverHeal(float DeltaTime); // sub_0x1eaee90
	void CheckOnChangeCondition(); // sub_0x1518fe0
	char CheckNeedOwnerStopLadder(); // sub_0x1eaee60
	void CheckMeleeAnim(); // sub_0x1eaee40
	char CheckIsCastingBackpackItem(struct FNone& TargetItemInfo); // sub_0x1eaed40
	void CheckEquipAnim(); // sub_0x1eaed20
	void CheckCurrentBuff(); // sub_0x1eaed00
	void CheckCharacterNamedArguments(); // sub_0x1eaece0
	void CheckBrokenEquipment(); // sub_0x1eaecc0
	void CheckBombingTargeting(); // sub_0x1eaeca0
	void CheckArmedStateForAction(char bDoArm, char bPlayUnequipAnimation, char bOrdered); // sub_0x1eaeb80
	void ChangeOption(struct TArray<None>& ChangeTypeList); // sub_0x1eaead0
	void ChangeCastingMontageOnProneEvent(char bNewProne, float TargetMontagePosition); // sub_0x1eaea00
	void CastingDelegate__DelegateSignature(struct FNone& CastingInfo, float CastingPercent); // sub_0x239bfb0
	char CanWeaponMeleeAttack(); // sub_0x1eae990
	char CanUseBackpackItem(uint32_t BackpackItemIndex); // sub_0x1eae900
	char CanUpdateIdleNum(); // sub_0x1eae8d0
	char CanUltimate_Recon(); // sub_0x1eae8a0
	char CanTryUseAutoLadder(); // sub_0x1eae870
	char CanSprint(); // sub_0x1eae840
	char CanSpawnSuperBarrier(struct FNone& OutSpawnTransform); // sub_0x1eae760
	char CanSliding(); // sub_0x1eae730
	char CanRolling(); // sub_0x1eae700
	char CanRocketJump(); // sub_0x1eae6d0
	char CanReviveOtherPlayer(); // sub_0x1eae6a0
	char CanResuscitationOtherPlayer(struct FNone* ResuscitatedActor); // sub_0x1eae610
	void CanProneFailedDelegate__DelegateSignature(); // sub_0x239bfb0
	char CanPlayShakeOutMontage(); // sub_0x1eae5e0
	char CanMove(); // sub_0x1eae5b0
	char CanMeteorJump(); // sub_0x1eae580
	char CanMeleeAttack(); // sub_0x1eae550
	char CanLean(); // sub_0x1eae520
	char CanKickDoor(); // sub_0x1eae4f0
	char CanJetpack(); // sub_0x1eae4c0
	char CanHeartBeatSensor(); // sub_0x1eae490
	char CanFreeLook(); // sub_0x1eae460
	char CanFPS(); // sub_0x1eae400
	char CanFire(); // sub_0x1eae430
	char CanEnterVehicle(struct FNone* TargetVehicleSeat); // sub_0x1eae370
	char CanCombine(); // sub_0x1eae340
	char CanChangeWeapon(); // sub_0x1eae310
	char CanChangeFireMode(); // sub_0x1eae2e0
	void CancelMelee(); // sub_0x1eae9e0
	void CancelAimingInVehicle(); // sub_0x1eae9c0
	char CanBeKnockedBack(); // sub_0x1eae2b0
	char CanApplyActiveItem(uint32_t BackpackItemIndex); // sub_0x1eae220
	char CanAOS(); // sub_0x1eae1c0
	char CanAMP(); // sub_0x1eae190
	char CanAirWalk(); // sub_0x1eae1f0
	char CanADS(); // sub_0x1eae160
	void CallbackLanded(struct FNone& Hit); // sub_0x1eae080
	void CalculatePreShootInformations(float DeltaTime, struct FNone& Pos, char& LineOfFire, char& LastUpdate); // sub_0x1eadef0
	struct FNone CalculateActorLocationInRagdoll(); // sub_0x1eadeb0
	float CalcDamageByFallingSpeed(float InMinSpeed, float InMaxSpeed, char bIsLandedFromVehicle); // sub_0x1eadda0
	void BroadcastDetectItemsDelegate(); // sub_0x1eadd80
	void BPSetReplicateMovement(char bInReplicateMovement); // sub_0x1eadcd0
	void BeginPlay(); // sub_0x1eadd60
	void AttachWeaponToSlot(struct FNone* EquippableActor, uint32_t SlotIndex); // sub_0x1eadc10
	void ApplyDamageEx(float DamageAmount, struct FNone& DamageEvent, struct FNone* EventInstigator, struct FNone* DamageCauser); // sub_0x1eadaa0
	void AIExitForceField(); // sub_0x1ead1d0
	void AIEnterForceField(); // sub_0x1ead1b0
	float AffectedByForceField_Impl(float OutModifier, char bNeedMultipy, char bIsOwnerIgnore); // sub_0x1ead990
	void ADSSettingsAfterChangeCamera(char bUseCustomCurve); // sub_0x1ead120
	void AddThrownMolotovCocktail(struct FNone* MolotovCocktail); // sub_0x1ead910
	void AddThrownFlashbang(struct FNone* Flashbang); // sub_0x1ead890
	void AddSimulatedHittedDamage(struct FNone* DamageTypeClass, struct FNone* DamageInstigator, float Damage, uint16_t HitPointIdx, uint16_t ProjectileId); // sub_0x1ead700
	void AddShortTimeHealth(struct FNone* HealthOwner, float AddHealth); // sub_0x1ead630
	char AddPerkLevel(enum class None PerkSlot, uint32_t Count, char bTakeOne); // sub_0x1ead530
	void AddPerkEvent(struct FNone& PerkInfo, struct FNone& InCurrentDisplayAbility, uint32_t LastLevel, uint32_t ClassLevel, enum class None LevelUpType); // sub_0x239bfb0
	void AddOverHeal(float Amount); // sub_0x1ead4b0
	void AddDetectedStealable(struct FNone* NewCharacter); // sub_0x1ead430
	void AddDetectedItem(struct FNone* NewPickup); // sub_0x1ead3b0
	void AddDetectedDropBox(struct FNone* NewPickup); // sub_0x1ead330
	void AddCondition(enum class None ConditionType, enum class None Key); // sub_0x1ead270
	void AddCharacterRotation(float Val); // sub_0x239bfb0
	char ActiveHeartBeatSensor(); // sub_0x1ead240
	char ActiveAmplifier(); // sub_0x1ead210
	void ActivateADSPostProcess(); // sub_0x1ead1f0
};

// Class BravoHotelGame.BHPersonalSupplySystemComponent
// Size: 0x1c0 (Inherited: 0xb0)
struct UBHPersonalSupplySystemComponent : UActorComponent 
{
	char                                          UnknownDataB0[0x10];                                         // 0xb0(0x10)
	struct FNone*                                 CurrentSupplyBox;                                            // 0xc0(0x08)
	struct FNone*                                 CurrentSupplyBoxDummy;                                       // 0xc8(0x08)
	struct FNone*                                 SupplyBoxClass;                                              // 0xd0(0x08)
	struct FNone*                                 SupplyBoxDummyClass;                                         // 0xd8(0x08)
	struct FNone                                  CurrentAssignmentInfo;                                       // 0xe0(0x30)
	uint32_t                                      CountOpenSupplyBox;                                          // 0x110(0x04)
	uint32_t                                      SupplyBoxCost;                                               // 0x114(0x04)
	enum class None                               CurrentPSBState;                                             // 0x118(0x01)
	enum class None                               AssignReason;                                                // 0x119(0x01)
	char                                          UnknownData11A[0x8];                                         // 0x11a(0x08)
	char                                          ShowPingByHUD : 0;                                           // 0x122(0x01)
	char                                          UnknownData122[0x9e];                                        // 0x122(0x9e)

	void StartSpawnFromSpawnInfo(struct FNone& Data, char CheckRePosition); // sub_0x1e44480
	void StartSpawn(); // sub_0x1e44460
	void SetPersonalSupplyBoxInfo(enum class None NewState, struct FNone NewLocation); // sub_0x1e44390
	void ServerSpawnSupplyBoxDummy(); // sub_0x1e44340
	void ServerPayGold(uint32_t Amount); // sub_0x1e44280
	void Response_PayGold(char bSuccess, uint32_t Amount); // sub_0x1e441c0
	void OnRep_SupplyBoxCost(); // sub_0x1e441a0
	void OnRep_CurrentAssignmentInfo(); // sub_0x1e44180
	void OnRep_ChangePSMState(); // sub_0x1e44160
	void MulticastNotifyAlert(uint32_t player_uid); // sub_0x1e440d0
	struct FNone GetPersonalSupplyBoxInfo(); // sub_0x1e44090
	void ForceSpawnPersonalBox(struct FNone SpawnTransform, struct TArray<None> ItemInfos); // sub_0x1e43f00
	void ForceSpawnBox(struct FNone SpawnTransform, struct TArray<None> ItemInfos); // sub_0x1e43d20
	void ClientSetPersonalSupplyBox(struct FNone AssignmentInfo); // sub_0x1e43c70
	void ClientRecallPersonalSupplyBox(); // sub_0x1e43c50
	void ClientChangePSMState(enum class None State); // sub_0x1e43bd0
	void ChangePersonalSupplyBoxLocationInfo(struct FNone NewLocation); // sub_0x1e43b40
};

// Class BravoHotelGame.BravoHotel3DViewActor
// Size: 0x310 (Inherited: 0x310)
struct ABravoHotel3DViewActor : AActor 
{
};

// Class BravoHotelGame.BravoHotelAbilityComponent
// Size: 0x7d8 (Inherited: 0xb0)
struct UBravoHotelAbilityComponent : UActorComponent 
{
	char                                          UnknownDataB0[0x1e8];                                        // 0xb0(0x1e8)
	struct FNone                                  DefaultBalanceData;                                          // 0x298(0x78)
	char                                          UnknownData310[0xe8];                                        // 0x310(0xe8)
	struct TMap<None, None>                       CharacterBuffDataKeys;                                       // 0x3f8(0x50)
	char                                          UnknownData448[0x218];                                       // 0x448(0x218)
	struct FNone*                                 DefaultFireCell;                                             // 0x660(0x08)
	float                                         SimulatedTickTime;                                           // 0x460(0x04)
	struct TMap<None, None>                       AbilityStates;                                               // 0x188(0x50)
	struct TMap<None, None>                       ConditionedAbilityStates;                                    // 0x3a0(0x50)
	struct TMap<None, None>                       ConditionStates;                                             // 0x518(0x50)
	uint64_t                                      ConditionFlags;                                              // 0x450(0x08)
	struct TMap<None, None>                       BuffUIInfos;                                                 // 0x568(0x50)
	struct FNone                                  CurrentBuffKeys;                                             // 0x6c0(0x118)
	struct TMap<None, None>                       CurrentBuffInfos;                                            // 0xe8(0x50)
	struct TMap<None, None>                       BuffControls;                                                // 0x468(0x50)
	struct TArray<None>                           StackBuffInfos;                                              // 0x1e8(0x10)
	float                                         Loudness;                                                    // 0x45c(0x04)
	float                                         LoudnessCrouchRatio;                                         // 0x1f8(0x04)
	float                                         LoudnessProneRatio;                                          // 0x448(0x04)
	float                                         LoudnessTime;                                                // 0x668(0x04)
	struct FNone*                                 DebugWidgetClass;                                            // 0xd8(0x08)
	struct TMap<None, None>                       MaterialEffectInfos;                                         // 0x350(0x50)
	struct FNone*                                 MaterialEffectCurve;                                         // 0x288(0x08)
	struct FNone*                                 MaterialEffectStrCurve;                                      // 0x290(0x08)
	struct FNone*                                 DebugWidget;                                                 // 0x1d8(0x08)
	struct FNone*                                 WeaponDebugTextWidget;                                       // 0x1e0(0x08)
	struct TMap<None, None>                       BuffEventDelegates;                                          // 0x238(0x50)
	struct TMap<None, None>                       BuffEndEventDelegates;                                       // 0x670(0x50)
	struct TMap<None, None>                       WeaponBuffEventDelegates;                                    // 0x4c8(0x50)

	void WeaponBuffEventDelegate__DelegateSignature(enum class None& EventType, struct FNone& WeaponInfo); // sub_0x239bfb0
	void UpdateWeaponDebugTextWidget(); // sub_0x1e4c8f0
	void ToggleWeaponDebugTextWidgetVisible(); // sub_0x1e4c8d0
	void ShowAbilityDubugText(char bFlag); // sub_0x1e4c840
	void ServerStopBuffControl(uint16_t BuffIndex); // sub_0x1e4c780
	void ServerSetBuffControlTimer(uint16_t BuffIndex, float NewTimer); // sub_0x1e4c680
	void ServerRemoveCondition(enum class None ConditionType, uint32_t Key); // sub_0x1e4c580
	void ServerRemoveBuffByIndex(uint16_t BuffIndex); // sub_0x1e4c4c0
	void ServerForceRemoveCondition(enum class None ConditionType); // sub_0x1e4c410
	void ServerCheckBuffControl(uint16_t BuffIndex); // sub_0x1e4c350
	void ServerAddStackBuffByIndex(uint16_t BuffIndex); // sub_0x1e4c290
	void ServerAddCondition(enum class None ConditionType, uint32_t Key); // sub_0x1e4c190
	void ServerAddBuffByIndex(uint16_t BuffIndex); // sub_0x1e4c0d0
	void ServerAddBuffByAttacker(uint16_t BuffIndex, struct FNone* PC, struct FNone* Actor); // sub_0x1e4bfa0
	void ResetAllBuffCoolTime(); // sub_0x1e4bf80
	void RemoveCondition(enum class None ConditionType, enum class None Key); // sub_0x1e4bec0
	void RemoveBuffByData(struct FName BuffName); // sub_0x1e4be40
	void OnRep_ChangedCurrentBuffKeys(); // sub_0x1e4be20
	void MultiResetBuffTimeByIndex(uint16_t BuffIndex, float Time); // sub_0x1e4bd50
	char IsShowAbilityDubugText(); // sub_0x1e4bd30
	char IsBuff(enum class None BuffType); // sub_0x1e4bca0
	void ClientSyncCondition(struct TArray<None> ConditionInfo); // sub_0x1e4bbd0
	void ClientSetBuffControlTimer(uint16_t BuffIndex, float NewTimer); // sub_0x1e4bb00
	void ClientRemoveCondition(enum class None ConditionType, uint32_t Key); // sub_0x1e4ba30
	void ClientRemoveBuffByIndex(uint16_t BuffIndex); // sub_0x1e4b9a0
	void ClientRemoveAllBuffDelegates(); // sub_0x120b420
	void ClientForceRemoveCondition(enum class None ConditionType); // sub_0x1e4b920
	void ClientAddStackBuffByIndex(uint16_t BuffIndex); // sub_0x1e4b890
	void ClientAddCondition(enum class None ConditionType, uint32_t Key); // sub_0x1e4b7c0
	void ClientAddBuffByIndex(uint16_t BuffIndex); // sub_0x1e4b730
	void ClientAddBuffByAttacker(uint16_t BuffIndex, struct FNone* PC, struct FNone* Actor); // sub_0x1e4b630
	void BuffEventDelegate__DelegateSignature(enum class None& EventType); // sub_0x239bfb0
	void AddCondition(enum class None ConditionType, enum class None Key); // sub_0x1e4b570
	void AddBuffByData(struct FName BuffName); // sub_0x1e4b4f0
};

// Class BravoHotelGame.ConditionedAbilityGetter
// Size: 0xe8 (Inherited: 0x28)
struct UConditionedAbilityGetter : UObject 
{
	char                                          UnknownData28[0xc0];                                         // 0x28(0xc0)
};

// Class BravoHotelGame.BuffControlState
// Size: 0xb0 (Inherited: 0x28)
struct UBuffControlState : UObject 
{
	char                                          UnknownData28[0x48];                                         // 0x28(0x48)
	struct TArray<None>                           ActiveBuffs;                                                 // 0x70(0x10)
	struct FNone*                                 BravoHotelCharacter;                                         // 0x80(0x08)
	struct FNone*                                 BravoHotelAbilityComponent;                                  // 0x88(0x08)
	char                                          UnknownData90[0x20];                                         // 0x90(0x20)

	void WeaponEventEndCallBack(enum class None& BuffEventType, struct FNone& WeaponInfo); // sub_0x1e58550
	void WeaponEventCallBack(enum class None& BuffEventType, struct FNone& WeaponInfo); // sub_0x1e58430
	void ReduceCoolTimeOnRangedAttack(); // sub_0x1e58410
	void ReduceCoolTimeOnKill(); // sub_0x1e583f0
	void OnEndCoolTime__DelegateSignature(); // sub_0x239bfb0
	void OnBeginCoolTime__DelegateSignature(); // sub_0x239bfb0
	void OnBeginCoolTime(); // sub_0x1e583d0
	void EventEndCallBack(enum class None& BuffEvnetType); // sub_0x1e58340
	void EventCallBack(enum class None& BuffEvnetType); // sub_0x1e582b0
};

// Class BravoHotelGame.BravoHotelAchievementManager
// Size: 0x98 (Inherited: 0x28)
struct UBravoHotelAchievementManager : UObject 
{
	char                                          UnknownData28[0x70];                                         // 0x28(0x70)
};

// Class BravoHotelGame.BravoHotelActionComponent
// Size: 0xf0 (Inherited: 0xb0)
struct UBravoHotelActionComponent : UActorComponent 
{
	char                                          UnknownDataB0[0x18];                                         // 0xb0(0x18)
	char                                          bWalking : 0;                                                // 0xc8(0x01)
	char                                          bSprinting : 0;                                              // 0xc8(0x01)
	char                                          bIsProned : 0;                                               // 0xc8(0x01)
	char                                          bIsJumping : 0;                                              // 0xc8(0x01)
	char                                          bIsKicking : 0;                                              // 0xc8(0x01)
	char                                          bIsAirWalking : 0;                                           // 0xc8(0x01)
	char                                          bWantsToRocketJump : 0;                                      // 0xc8(0x01)
	char                                          bWantsToMeteorJump : 0;                                      // 0xc8(0x01)
	char                                          UnknownDataC8[0x1];                                          // 0xc8(0x01)
	char                                          bWantsToMeteorStrike : 0;                                    // 0xc9(0x01)
	char                                          bWantsToJetpack : 0;                                         // 0xc9(0x01)
	char                                          bWantsToJetpackAim : 0;                                      // 0xc9(0x01)
	char                                          CustomBuoyancySwimMode : 0;                                  // 0xc9(0x01)
	char                                          UnknownDataC9[0x1];                                          // 0xc9(0x01)
	enum class None                               LeanState;                                                   // 0xca(0x01)
	enum class None                               FireType;                                                    // 0xcb(0x01)
	enum class None                               ThrowingType;                                                // 0xcc(0x01)
	char                                          UnknownDataCD[0x3];                                          // 0xcd(0x03)
	struct FNone*                                 ReplicatedAnimMontage;                                       // 0xd0(0x08)
	struct FNone*                                 ReplicatedAnimMontage_FPP;                                   // 0xd8(0x08)
	char                                          bIsSliding : 0;                                              // 0xe0(0x01)
	char                                          UnknownDataE0[0x1];                                          // 0xe0(0x01)
	char                                          bIsRolling : 0;                                              // 0xe1(0x01)
	char                                          UnknownDataE1[0x7];                                          // 0xe1(0x07)
	struct FNone*                                 BravoHotelCharacterMovement;                                 // 0xe8(0x08)

	void OnRep_ThrowingType(); // sub_0x1e59a30
	void OnRep_IsProned(); // sub_0x1e59a10
	void OnRep_FireType(enum class None& PreFireType); // sub_0x1e59980
	void OnRep_bWantsToRocketJump(); // sub_0x1e59ad0
	void OnRep_bWantsToMeteorJump(); // sub_0x1e59ab0
	void OnRep_bIsSliding(); // sub_0x1e59a90
	void OnRep_bIsKicking(); // sub_0x1e59a70
	void OnRep_bIsAirWalking(); // sub_0x1e59a50
	void OnRep_AnimMontageFPP(); // sub_0x1e59960
	void OnRep_AnimMontage(); // sub_0x1e59940
};

// Class BravoHotelGame.BravoHotelActor
// Size: 0x310 (Inherited: 0x310)
struct ABravoHotelActor : AActor 
{
};

// Class BravoHotelGame.BravoHotelAggregateTickComponent
// Size: 0x100 (Inherited: 0xb0)
struct UBravoHotelAggregateTickComponent : UActorComponent 
{
	char                                          UnknownDataB0[0x50];                                         // 0xb0(0x50)
};

// Class BravoHotelGame.BravoHotelAIPlayerController
// Size: 0x528 (Inherited: 0x440)
struct ABravoHotelAIPlayerController : AAIController 
{
	float                                         AutoRotateSpeed;                                             // 0x440(0x04)
	struct FName                                  DefaultWeaponName;                                           // 0x444(0x08)
	char                                          UnknownData44C[0x1c];                                        // 0x44c(0x1c)
	struct FNone*                                 NearPlayerController;                                        // 0x468(0x08)
	struct FNone*                                 NearTargetPawn;                                              // 0x470(0x08)
	struct FNone*                                 AttackTargetPawn;                                            // 0x478(0x08)
	char                                          UnknownData480[0xa8];                                        // 0x480(0xa8)

	void StartDescenting(); // sub_0x1e5c1c0
	void SetIsParachuteLanding(char Flag, float Height); // sub_0x1e5c0f0
	void SetHealthModify(); // sub_0x1e5c0d0
	void RefillCurrentWeaponsAmmo(char bDirectToWeapon, uint32_t Count); // sub_0x1e5c010
	void OnUpdateParachuting(float DeltaTime); // sub_0x1e5bf90
	void OnTakeDamagePawn(struct FNone* DamagedActor, float Damage, struct FNone* DamageType, struct FNone* InstigatedBy, struct FNone* DamageCauser); // sub_0x1e5be00
	void OnChangeSurvivalCirclePhase(uint32_t PrevPhase, uint32_t CurrentPhase); // sub_0x1e5bd40
	void MoveRightOnDescent(float DeltaTime, float AxisValue); // sub_0x1e5bc80
	void MoveForwardOnDescent(float DeltaTime, float AxisValue); // sub_0x1e5bbc0
	char IsSwimmingBlockingHit(); // sub_0x1e5bb90
	char isinbluezone(); // sub_0x1e5bb60
	void GiveEquipment(); // sub_0x1e5bb40
	float GetTestAINoAttackTime(); // sub_0x1e5bb10
	uint32_t GetTestAIMoveMode(); // sub_0x1e5baf0
	float GetTestAIDescentDurationWeight(); // sub_0x1e5bac0
	float GetTestAIAttackTime(); // sub_0x1e5ba90
	uint32_t GetTestAIAttackMode(); // sub_0x1e5ba70
	float GetDescentTargetAngle(); // sub_0x1e5ba40
	float GetDescentDuration(); // sub_0x1e5ba10
	float GetCharacterSpeed(); // sub_0x1e5b9e0
	enum class None GetBlueZoneState(); // sub_0x1e5b9b0
	struct FNone GetBlueZoneRandomPointInCircle(); // sub_0x1e5b970
	struct FNone GetBlueZoneNearLandPos(); // sub_0x1e5b930
	float GetBlueZoneCircleRadius(); // sub_0x1e5b900
	struct FNone GetBlueZoneCirclePos(); // sub_0x1e5b8c0
	struct FNone GetAircraftFlightDirection(); // sub_0x1e5b880
	float GetAIHealthRate(); // sub_0x1e5b850
	float GetAIFireTendencyWithAI(); // sub_0x1e5b820
	float GetAIFireTendency(); // sub_0x1e5b7f0
	float GetAIFireAccuracyWithAI(); // sub_0x1e5b7c0
	float GetAIFireAccuracy(); // sub_0x1e5b790
	float GetAIDamageRate(); // sub_0x1e5b760
	void DoFiring(char bIsNewFire, struct FNone ProjectileLocation, struct FNone ProjectileRotation, struct FNone* TargetActor, struct FNone TargetHitResult); // sub_0x1e5b510
	void DoCrouch(char bCrouch); // sub_0x1e5b480
	void DoAIFiring(struct FNone& ProjectileLocation, struct FNone& ProjectileRotation, struct FNone* TargetActor); // sub_0x1e5b360
};

// Class BravoHotelGame.BravoHotelAircraft
// Size: 0x318 (Inherited: 0x310)
struct ABravoHotelAircraft : AActor 
{
	char                                          UnknownData310[0x8];                                         // 0x310(0x08)
};

// Class BravoHotelGame.BravoHotelAircraftBomber
// Size: 0x320 (Inherited: 0x310)
struct ABravoHotelAircraftBomber : AActor 
{
	struct FNone*                                 MovementComponent;                                           // 0x310(0x08)
	uint32_t                                      LoopCount;                                                   // 0x318(0x04)
	char                                          UnknownData31C[0x4];                                         // 0x31c(0x04)

	void OnReset(struct FNone& ImpactResult, float Time); // sub_0x1e5c460
};

// Class BravoHotelGame.BravoHotelAircraftFlight
// Size: 0x880 (Inherited: 0x5e0)
struct ABravoHotelAircraftFlight : ACharacter 
{
	struct FNone*                                 FixedStartingPoint;                                          // 0x5d8(0x08)
	char                                          bScrambled : 0;                                              // 0x5e0(0x01)
	struct FNone*                                 AudioEmitter;                                                // 0x5e8(0x08)
	struct FNone*                                 StartFlyingEvent;                                            // 0x5f0(0x08)
	struct FNone*                                 StopFlyingEvent;                                             // 0x5f8(0x08)
	struct FNone                                  FlyingSoundHandle;                                           // 0x600(0x04)
	char                                          UnknownData604[0x4];                                         // 0x604(0x04)
	struct TArray<None>                           Aircrafts;                                                   // 0x608(0x10)
	struct TArray<None>                           AircraftOrdersForEvenFormation;                              // 0x618(0x10)
	struct TArray<None>                           AircraftOrdersForOddFormation;                               // 0x628(0x10)
	enum class None                               MovementMethod;                                              // 0x638(0x01)
	char                                          UnknownData639[0x3];                                         // 0x639(0x03)
	float                                         ScramblingDuration;                                          // 0x63c(0x04)
	float                                         ScramblingSpeed;                                             // 0x640(0x04)
	float                                         DistanceFromBorder;                                          // 0x644(0x04)
	float                                         SpeedToChangeAltitude;                                       // 0x648(0x04)
	float                                         TargetAltitude;                                              // 0x64c(0x04)
	float                                         AltitudeFromTargetAtFirst;                                   // 0x650(0x04)
	char                                          UnknownData654[0x4];                                         // 0x654(0x04)
	struct FNone*                                 CineCamera;                                                  // 0x658(0x08)
	struct FNone*                                 AircraftRoot;                                                // 0x660(0x08)
	struct FNone*                                 CineParticle;                                                // 0x668(0x08)
	struct FNone*                                 CineCameraSpline;                                            // 0x670(0x08)
	struct FNone                                  CineDeltaLocation;                                           // 0x678(0x0c)
	float                                         CineInterpSpeed;                                             // 0x684(0x04)
	float                                         CineInterpSpeedZ;                                            // 0x688(0x04)
	char                                          UnknownData68C[0x4];                                         // 0x68c(0x04)
	struct FNone*                                 CinePawn;                                                    // 0x690(0x08)
	struct FNone*                                 CineController;                                              // 0x698(0x08)
	float                                         CineCameraBlendTime;                                         // 0x6a0(0x04)
	char                                          CineCameraBlendFunction;                                     // 0x6a4(0x01)
	char                                          UnknownData6A5[0x3];                                         // 0x6a5(0x03)
	float                                         CineCameraBlendExp;                                          // 0x6a8(0x04)
	char                                          bUseSplineAnimation : 0;                                     // 0x6ac(0x01)
	char                                          UnknownData6AC[0x4];                                         // 0x6ac(0x04)
	float                                         SplineAnimationDelayTime;                                    // 0x6b0(0x04)
	float                                         SplineAnimationTime;                                         // 0x6b4(0x04)
	char                                          UnknownData6B8[0x8];                                         // 0x6b8(0x08)
	struct FNone                                  Timeline_SplineInterp;                                       // 0x6c0(0x98)
	struct FNone*                                 Curve_SplineInterp;                                          // 0x758(0x08)
	struct FMulticastInlineDelegate               OnStartCinematic;                                            // 0x760(0x10)
	struct FMulticastInlineDelegate               OnEndCinematic;                                              // 0x770(0x10)
	struct TArray<None>                           CinematicSequenceList;                                       // 0x780(0x10)
	struct FNone*                                 LevelSequenceActor;                                          // 0x790(0x08)
	char                                          UnknownData798[0x8];                                         // 0x798(0x08)
	struct FNone                                  OriginLocation;                                              // 0x7a0(0x0c)
	struct FNone                                  TargetLocation;                                              // 0x7ac(0x0c)
	struct FNone                                  SavedRotation;                                               // 0x7b8(0x0c)
	struct FNone                                  DescentStartPos;                                             // 0x7c4(0x08)
	struct FNone                                  DescentEndPos;                                               // 0x7cc(0x08)
	char                                          UnknownData7D4[0x64];                                        // 0x7d4(0x64)
	struct FNone*                                 WeightMapInfo;                                               // 0x838(0x08)
	char                                          UnknownData840[0x28];                                        // 0x840(0x28)
	char                                          bUseUpdateBloom : 0;                                         // 0x868(0x01)
	char                                          UnknownData868[0x4];                                         // 0x868(0x04)
	float                                         BloomSpeed;                                                  // 0x86c(0x04)
	float                                         TargetBloomIntensity;                                        // 0x870(0x04)
	char                                          IsVisibleStartPoint : 0;                                     // 0x874(0x01)
	char                                          UnknownData874[0x1];                                         // 0x874(0x01)
	char                                          IsVisibleEndPoint : 0;                                       // 0x875(0x01)
	char                                          UnknownData875[0x1];                                         // 0x875(0x01)
	char                                          IsVisibleAircraf : 0;                                        // 0x876(0x01)
	char                                          UnknownData876[0x1];                                         // 0x876(0x01)
	char                                          IsVisibleAircraftLine : 0;                                   // 0x877(0x01)
	char                                          UnknownData877[0x1];                                         // 0x877(0x01)
	char                                          bWantsToDestroy : 0;                                         // 0x878(0x01)
	char                                          UnknownData878[0x1];                                         // 0x878(0x01)
	enum class None                               State;                                                       // 0x879(0x01)
	char                                          UnknownData87A[0x6];                                         // 0x87a(0x06)

	void UpdateSplineTimeline(float Value); // sub_0x1e5d8c0
	void OnStartCinematic__DelegateSignature(); // sub_0x239bfb0
	void OnScrambled(); // sub_0x239bfb0
	void OnRep_Scrambled(); // sub_0x239bfb0
	void OnMediaState(enum class None MediaState); // sub_0x1e5d840
	void OnEndCinematic__DelegateSignature(); // sub_0x239bfb0
	void OnAudioEmitterUnregistered(); // sub_0x1e5d820
	void OnAudioEmitterRegistered(); // sub_0x1e5d800
	void FinishSplineTimeline(); // sub_0x1e5d7e0
	void EndCinematic(); // sub_0x1e5d7c0
};

// Class BravoHotelGame.BravoHotelAircraftPoint
// Size: 0x318 (Inherited: 0x310)
struct ABravoHotelAircraftPoint : ATargetPoint 
{
	struct FNone*                                 NextPoint;                                                   // 0x310(0x08)

	void StartFromHere(struct FNone* AircraftFlight, uint32_t AircraftCount); // sub_0x1e5dae0
};

// Class BravoHotelGame.BravoHotelAircraftRouteWidget
// Size: 0x2b0 (Inherited: 0x248)
struct UBravoHotelAircraftRouteWidget : UUserWidget 
{
	char                                          UnknownData248[0x60];                                        // 0x248(0x60)
	struct FNone*                                 AirCraftRef;                                                 // 0x2a8(0x08)

	void UpdateAircraftPosition(struct FNone* MapCompWidget); // sub_0x1e5e490
	char UpdateAircraftInfo(struct FNone* MapCompWidget); // sub_0x1e5e400
	void UpdateAircraftAngle(float Angle); // sub_0x239bfb0
	struct FNone GetAirCraftInfo(); // sub_0x1e5e390
};

// Class BravoHotelGame.BravoHotelAircraftViewer
// Size: 0x398 (Inherited: 0x380)
struct ABravoHotelAircraftViewer : APawn 
{
	struct FNone*                                 SpringArm;                                                   // 0x380(0x08)
	struct FNone*                                 Camera;                                                      // 0x388(0x08)
	float                                         StartYaw;                                                    // 0x390(0x04)
	char                                          UnknownData394[0x4];                                         // 0x394(0x04)

	void StartDescent(); // sub_0x239bfb0
	void SetHideHUDbySequence(char Hide); // sub_0x1e5e860
	void OnStartYaw(); // sub_0x239bfb0
	void OnRep_StartYaw(); // sub_0x1e5e840
};

// Class BravoHotelGame.BravoHotelAircraftWidget
// Size: 0x258 (Inherited: 0x248)
struct UBravoHotelAircraftWidget : UUserWidget 
{
	char                                          UnknownData248[0x10];                                        // 0x248(0x10)

	void OnEndAirCraftBoardingPlayer(); // sub_0x1e5efe0
	void OnAirCraftSetPlayer(float setNum, struct TArray<None>& AddAirCraftPassengerList); // sub_0x239bfb0
	void OnAirCraftDescentPlayerInfo(uint32_t AirCraftID, uint32_t SeatID, uint32_t PlayerId); // sub_0x1e5eee0
	void OnAirCraftDescentPlayer(float DescentNum, uint32_t PlayerId); // sub_0x239bfb0
};

// Class BravoHotelGame.BravoHotelAliveInfoWidget
// Size: 0x288 (Inherited: 0x248)
struct UBravoHotelAliveInfoWidget : UUserWidget 
{
	char                                          UnknownData248[0x8];                                         // 0x248(0x08)
	struct FNone*                                 Canvas_Aircraft;                                             // 0x250(0x08)
	struct FNone*                                 T_BoardingCount;                                             // 0x258(0x08)
	struct FNone*                                 T_MaxBoardingCount;                                          // 0x260(0x08)
	char                                          UnknownData268[0x8];                                         // 0x268(0x08)
	struct FNone                                  KillAliveInfo;                                               // 0x270(0x14)
	char                                          UnknownData284[0x4];                                         // 0x284(0x04)

	void UpdateTeamCount(); // sub_0x1e5f970
	void UpdateKillCount(); // sub_0x1e5f950
	void UpdateAssistCount(); // sub_0x1e5f930
	void UpdateAliveCount(); // sub_0x1e5f910
	void ShowResuscitation(); // sub_0x239bfb0
	void SetKillCount_BP(uint32_t NewKillCount); // sub_0x239bfb0
	void SetAssistCount_BP(uint32_t NewKillCount); // sub_0x239bfb0
	void SetAliveTeamCount_BP(uint32_t NewAliveTeamCount, uint32_t TeamSize); // sub_0x239bfb0
	void SetAliveCount_BP(uint32_t NewAliveCount); // sub_0x239bfb0
	void OnEndAirCraftBoardingPlayer(); // sub_0x1e5f8f0
	void OnAirCraftDescentPlayerInfo(uint32_t AirCraftID, uint32_t SeatID, uint32_t PlayerId); // sub_0x1e5f7f0
	void Init(); // sub_0x1e5f7d0
};

// Class BravoHotelGame.BravoHotelAmbientSound
// Size: 0x378 (Inherited: 0x350)
struct ABravoHotelAmbientSound : AAkAmbientSound 
{
	char                                          bUseMultiplePositions : 0;                                   // 0x350(0x01)
	char                                          UnknownData350[0x8];                                         // 0x350(0x08)
	struct TArray<None>                           RelativeMultiplePositions;                                   // 0x358(0x10)
	char                                          bUseSynchronization : 0;                                     // 0x368(0x01)
	char                                          UnknownData368[0x4];                                         // 0x368(0x04)
	float                                         LoopInterval;                                                // 0x36c(0x04)
	char                                          UnknownData370[0x8];                                         // 0x370(0x08)

	void OnEmitterUnregistered(); // sub_0x1e5fb80
	void OnEmitterRegistered(); // sub_0x1e5fb60
};

// Class BravoHotelGame.BravoHotelEquippableActor
// Size: 0x858 (Inherited: 0x310)
struct ABravoHotelEquippableActor : AActor 
{
	struct FNone*                                 ReplicatedComponent;                                         // 0x310(0x08)
	struct FNone*                                 StaticMesh;                                                  // 0x318(0x08)
	struct FNone*                                 SkelMesh;                                                    // 0x320(0x08)
	struct FNone                                  ItemDetailInfo;                                              // 0x328(0x490)
	float                                         EquipTime_L;                                                 // 0x7b8(0x04)
	float                                         EquipTime_R;                                                 // 0x7bc(0x04)
	float                                         UnEquipTime;                                                 // 0x7c0(0x04)
	float                                         EquipAnimationPlayRate_L;                                    // 0x7c4(0x04)
	float                                         EquipAnimationPlayRate_R;                                    // 0x7c8(0x04)
	float                                         UnequipAnimationPlayRate;                                    // 0x7cc(0x04)
	char                                          bPendingEquip : 0;                                           // 0x7d0(0x01)
	char                                          bPendingUnEquip : 0;                                         // 0x7d0(0x01)
	char                                          UnknownData7D0[0x28];                                        // 0x7d0(0x28)
	struct FName                                  OverrideAttachSocketName;                                    // 0x7f8(0x08)
	struct FName                                  OverrideAttachSocketName_Backpack;                           // 0x800(0x08)
	struct FNone                                  OverrideEquipAnimMontage_StandSlot;                          // 0x808(0x10)
	struct FNone                                  OverrideEquipAnimMontage_ProneSlot;                          // 0x818(0x10)
	struct FNone                                  OverrideUnequipAnimMontage_StandSlot;                        // 0x828(0x10)
	struct FNone                                  OverrideUnequipAnimMontage_ProneSlot;                        // 0x838(0x10)
	char                                          UnknownData848[0x8];                                         // 0x848(0x08)
	char                                          bIsEquipped : 0;                                             // 0x850(0x01)
	char                                          UnknownData850[0x8];                                         // 0x850(0x08)

	float OnUnEquip(char bPlayUnequipAnimation); // sub_0x1f0eb50
	void OnRep_PendingUnEquip(); // sub_0x11cafb0
	void OnRep_PendingEquip(); // sub_0x1f0eb30
	void OnRep_IsEquipped(); // sub_0x1f0eb10
	float OnEquip(); // sub_0x1f0ead0
	void K2_OnUnEquip(); // sub_0x239bfb0
	void K2_OnEquip(); // sub_0x239bfb0
	char IsPendingUnequip(); // sub_0x1f0eaa0
	char IsPendingEquip(); // sub_0x1f0ea70
	struct FNone* GetOwingPawn(); // sub_0x1f0ea40
	struct FName GetOverrideAttachSocketName(); // sub_0x1f0ea10
	struct FNone GetItemInfo_Const(); // sub_0x1f0e8d0
	char GetItemInfo(struct FNone& OutItemInfo, struct FNone& OutItemDetailInfo); // sub_0x1f0e750
	uint32_t GetEquippedSlotIndex(); // sub_0x1f0e720
	void AttachToWeaponBySlot(uint8_t NewSlotIndex); // sub_0x1f0e6a0
};

// Class BravoHotelGame.BravoHotelWeaponBase
// Size: 0x1bd0 (Inherited: 0x858)
struct ABravoHotelWeaponBase : ABravoHotelEquippableActor 
{
	char                                          UnknownData858[0xf0];                                        // 0x858(0xf0)
	struct FNone*                                 WeaponReplicatedComponent;                                   // 0x948(0x08)
	char                                          UnknownData950[0x168];                                       // 0x950(0x168)
	struct FNone*                                 SkelMesh1P;                                                  // 0xab8(0x08)
	struct FNone                                  WeaponDataTable;                                             // 0x8c8(0x10)
	char                                          UnknownDataAD0[0x4c0];                                       // 0xad0(0x4c0)
	struct TArray<None>                           AttachmentItems;                                             // 0xf90(0x10)
	struct TArray<None>                           AttachmentItemEnums;                                         // 0xac8(0x10)
	struct FNone*                                 IdleHandAnim_3p;                                             // 0x8c0(0x08)
	struct FNone*                                 ProneHandAnim_3p;                                            // 0xb80(0x08)
	struct FNone*                                 IdleHandAnim_1p;                                             // 0x950(0x08)
	struct FNone*                                 IdleHandAnim_Crouch;                                         // 0xe68(0x08)
	char                                          UnknownDataFD0[0x8];                                         // 0xfd0(0x08)
	struct FNone*                                 IdleHandAnim_InVehicle;                                      // 0xfd8(0x08)
	struct FNone*                                 AOSAnim;                                                     // 0xd10(0x08)
	struct FNone*                                 ADSAnim;                                                     // 0xac0(0x08)
	char                                          UnknownDataFF0[0x48];                                        // 0xff0(0x48)
	struct FNone*                                 CollideUpsideAnim;                                           // 0x1038(0x08)
	struct FNone*                                 CollideDownsideAnim;                                         // 0x8b8(0x08)
	struct FNone*                                 CollideProneAnim;                                            // 0xe18(0x08)
	char                                          bAlwaysMaxCollideAlpha : 0;                                  // 0xfe8(0x01)
	char                                          bUseSpecialProneAnimation : 0;                               // 0x900(0x01)
	char                                          UnknownData1050[0xb28];                                      // 0x1050(0xb28)
	char                                          bDisableHandAnimDuringCollide : 0;                           // 0x1b78(0x01)
	char                                          bDisableHandAnimDuringProneCollide : 0;                      // 0xa58(0x01)
	struct FNone*                                 SpecialProneAnimation;                                       // 0xb10(0x08)
	struct FNone*                                 SpecialProneAnimation_1P;                                    // 0xe58(0x08)
	char                                          bUseSpecialSprintAnimation : 0;                              // 0xe60(0x01)
	struct FNone*                                 SpecialSprintAnimation;                                      // 0x958(0x08)
	struct FNone*                                 SpecialSprintReadyAnimation;                                 // 0x870(0x08)
	char                                          bUseSpecialCrouchSprintAnimation : 0;                        // 0xcd9(0x01)
	struct FNone*                                 SpecialCrouchSprintAnimation;                                // 0xf20(0x08)
	struct FNone*                                 SprintAnim_1P;                                               // 0xdb8(0x08)
	struct FNone*                                 Anim_SecondaryWeapon_Stand_Idle;                             // 0xe70(0x08)
	struct FNone*                                 Anim_SecondaryWeapon_Crouch_Idle;                            // 0xff0(0x08)
	char                                          bUseOneHandSprintAnimation : 0;                              // 0x1040(0x01)
	char                                          bDisableHandAnimDuringSprint : 0;                            // 0xf38(0x01)
	float                                         AimOffsetMinY_TPP;                                           // 0xb20(0x04)
	float                                         AimOffsetMaxY_TPP;                                           // 0x8f0(0x04)
	char                                          bHideMagazineWhenEmpty : 0;                                  // 0xed1(0x01)
	char                                          bIsTrueDamageWeapon : 0;                                     // 0x940(0x01)
	struct FNone                                  WeaponInfo;                                                  // 0x1048(0xb30)
	struct FNone                                  WeaponBaseData;                                              // 0xb88(0x110)
	struct FNone*                                 ShiningEffectComponent;                                      // 0x8b0(0x08)
	struct FNone*                                 ShiningEffect;                                               // 0xe78(0x08)
	float                                         LastFireTime;                                                // 0x8e8(0x04)
	uint32_t                                      magazine;                                                    // 0x1030(0x04)
	uint32_t                                      BackPackInTotalAmmoCount;                                    // 0xfe4(0x04)
	uint32_t                                      MagazineCapacity;                                            // 0xad8(0x04)
	float                                         UI_CurrentDamage;                                            // 0xf28(0x04)
	uint32_t                                      UI_CurrentRPM;                                               // 0xdc0(0x04)
	char                                          bIsPerkWeapon : 0;                                           // 0xe50(0x01)
	struct FName                                  PerkIndex;                                                   // 0xf3c(0x08)
	char                                          bIsNoDamageWeapon : 0;                                       // 0xcd8(0x01)
	char                                          ProhibitedforUseInVehicle : 0;                               // 0xf19(0x01)
	struct FMulticastInlineDelegate               OnFireDelegate;                                              // 0xd68(0x10)
	struct FNone*                                 CurrentPlayerMontage_1P;                                     // 0xd78(0x08)
	struct FNone*                                 CurrentPlayerMontage_3P;                                     // 0xf10(0x08)
	struct FNone*                                 CurrentWeaponMontage_1P;                                     // 0x878(0x08)
	struct FNone*                                 CurrentWeaponMontage_3P;                                     // 0x8f8(0x08)
	enum class None                               CurrentMontageState;                                         // 0x8ec(0x01)
	float                                         PausedMontagePosition;                                       // 0xab0(0x04)
	struct FNone                                  AttachmentInfoModifier;                                      // 0x968(0x48)
	struct FNone                                  TimerHandle_UpdateActorHiddenInGame_TPPOnly;                 // 0xfd0(0x08)
	struct TMap<None, None>                       IdlePositionDeltaArray_FPP;                                  // 0xdc8(0x50)
	struct TMap<None, None>                       AOSPositionDeltaArray_FPP;                                   // 0xb28(0x50)
	float                                         AOSPositionInterpSpeed_FPP;                                  // 0xb7c(0x04)
	char                                          bVisibleAbsolutely : 0;                                      // 0xf18(0x01)

	void UpdateActorHiddenInGame_TPPOnly(); // sub_0x201c990
	void StopCurrentPlayingMontage(); // sub_0x201c970
	void StopAllAction(); // sub_0x201c950
	void SetWeaponVisibilityAbsolutely(char bNewVisibleAbsolutely); // sub_0x201c8c0
	void SetWeaponMaterialFov(float TargetFOV); // sub_0x201c840
	void SetFPSMode(char bFPS); // sub_0x201c7b0
	void SetADSPostProcessEffects(); // sub_0x201c790
	void SetADSMode(char bADS); // sub_0x201c700
	void ServerBackPackInTotalAmmoCount(uint32_t nCount); // sub_0x201c640
	char RemoveAttachment(enum class None RemoveAttachmentType); // sub_0x201c5b0
	void OnRep_Magazine(uint32_t LastValue); // sub_0x201c520
	void OnFireProjectile__DelegateSignature(); // sub_0x239bfb0
	void OnChangeWeaponAttachmentsDelegate__DelegateSignature(); // sub_0x239bfb0
	char IsPerkWeapon(); // sub_0x201c1a0
	char IsNoDamageWeapon(); // sub_0x201c180
	char IsFPSMode(); // sub_0x201c160
	char IsEquippableAttachmentEmptySlot(struct FNone NewAttachmentItemInfo); // sub_0x201c070
	char IsEquippableAttachmentByType(enum class None AttachmentType, enum class None AttachmentItem); // sub_0x201bfa0
	char IsEquippableAttachment(struct FNone NewAttachmentItemInfo); // sub_0x201beb0
	char IsEnablePerkWeapon(); // sub_0x201be80
	void InitializeWeapon(struct FNone NewItemInfo); // sub_0x201bd90
	enum class None GetWeaponType(); // sub_0x201bd60
	struct FNone GetWeaponInfo(); // sub_0x201bd20
	struct FNone GetWeaponBaseData(); // sub_0x201bb90
	enum class None GetWeaponAnimationType(); // sub_0x201bb60
	uint32_t GetUICurrentRPM(); // sub_0x201bb40
	float GetUICurrentDamage(); // sub_0x201bb20
	struct FNone GetReloadInfo(); // sub_0x201bae0
	uint32_t GetMagazineInBackPack(); // sub_0x201bab0
	struct FString GetIdentityName(); // sub_0x201ba60
	float GetCoolTimeRatePerkWeapon(); // sub_0x201ba30
	enum class None GetAttachmentSlotUseType(enum class None AttachmentType); // sub_0x201b870
	char GetAttachmentInfo(enum class None AttachmentType, struct FNone& OutItemInfo, struct FNone& OutItemDetailInfo); // sub_0x201b3a0
	uint32_t GetAmmoPerkWeapon(); // sub_0x201b370
	struct FName GetAmmoName(); // sub_0x201b330
	float GetADSFOV(); // sub_0x201b2f0
	void FPSK_SetWeaponVisibility(char bNewVisibility); // sub_0x201b240
	void FPSK_SetWeaponCastShadow(char bNewCastShadow, char bNewCastHiddenShadow); // sub_0x201b170
	void FireWeapon(); // sub_0x201b2d0
	void DoProne(); // sub_0x2012690
	void ClientSetMagazine(uint32_t NewMagazine); // sub_0x1f8e080
	void ChangeAbilities(); // sub_0x201b150
	char CanSprint(); // sub_0x201b120
	char CanMeleeAttack(); // sub_0x201b0f0
	char CanFire(); // sub_0x201b0c0
	char CanAOS(); // sub_0x201b090
	char CanADS(); // sub_0x201b060
	char AttachToWeaponStaticMesh(struct FName SocketName); // sub_0x201afd0
	char AttachToWeaponSkeletalMesh(struct FName SocketName); // sub_0x201af40
	void ApplyAsyncLoadedData(); // sub_0x201af20
	char AddAttachment(struct FNone& NewAttachmentItemInfo); // sub_0x201ae20
	void ActivateShiningEffect(char bActive); // sub_0x201ad90
};

// Class BravoHotelGame.BravoHotelAmplifier
// Size: 0x1bf0 (Inherited: 0x1bd0)
struct ABravoHotelAmplifier : ABravoHotelWeaponBase 
{
	char                                          UnknownData1BD0[0x4];                                        // 0x1bd0(0x04)
	float                                         AmplifierLength;                                             // 0x1bd4(0x04)
	struct FNone                                  TimerHandle_OnStartEffectEvent;                              // 0x1bd8(0x08)
	struct TArray<None>                           DetectedCharacters;                                          // 0x1be0(0x10)

	void ServerValidateAmplifierEffect(struct FNone* TargetCharacter); // sub_0x1e60010
	void OnStartAmplifier(); // sub_0x1e5fff0
	void OnPostEventAtLocationEvent(struct FString EventKey, struct FNone& Location); // sub_0x239bfb0
	void OnDeactiveAmplifier(); // sub_0x239bfb0
	void OnClickedAmplifier(); // sub_0x239bfb0
	void OnActiveAmplifier(); // sub_0x239bfb0
	float GetAmplifierLength(); // sub_0x1e5ffc0
};

// Class BravoHotelGame.BravoHotelAnimInstance
// Size: 0xc60 (Inherited: 0x270)
struct UBravoHotelAnimInstance : UAnimInstance 
{
	char                                          UnknownData270[0x60];                                        // 0x270(0x60)
	struct FNone*                                 Character;                                                   // 0x2d0(0x08)
	char                                          UnknownData2D8[0x378];                                       // 0x2d8(0x378)
	struct FNone*                                 CharacterMovementComponent;                                  // 0x650(0x08)
	char                                          UnknownData658[0x124];                                       // 0x658(0x124)
	char                                          bIsAccelerating : 0;                                         // 0x77c(0x01)
	float                                         ParachuteInputForward;                                       // 0x308(0x04)
	float                                         ParachuteInputRight;                                         // 0x774(0x04)
	char                                          bIsParachuteLanding : 0;                                     // 0x73b(0x01)
	float                                         Direction;                                                   // 0x298(0x04)
	char                                          bIsLocallyPlaying : 0;                                       // 0x347(0x01)
	char                                          bIsFreeLook : 0;                                             // 0x288(0x01)
	char                                          bIsProne : 0;                                                // 0x5e3(0x01)
	char                                          bIsCrouch : 0;                                               // 0x348(0x01)
	char                                          bIsMelee : 0;                                                // 0x764(0x01)
	char                                          bIsJumpAttack : 0;                                           // 0x720(0x01)
	char                                          bMoving : 0;                                                 // 0x53c(0x01)
	char                                          bIsClimbing : 0;                                             // 0x4b4(0x01)
	char                                          bIsKnockbackRolling : 0;                                     // 0x630(0x01)
	uint32_t                                      IdleNum;                                                     // 0x598(0x04)
	float                                         CastingRemainTime;                                           // 0x770(0x04)
	char                                          bMovedWhileMontage : 0;                                      // 0x346(0x01)
	char                                          bIsFallingOrLanding : 0;                                     // 0x410(0x01)
	char                                          bIsSprintStop : 0;                                           // 0x703(0x01)
	char                                          bUseSprintAnimation : 0;                                     // 0x4c2(0x01)
	char                                          bUseSpecialSprintAnimation : 0;                              // 0x29c(0x01)
	char                                          bUseSpecialCrouchSprintAnimation : 0;                        // 0x289(0x01)
	char                                          bUseSpecialProneAnimation : 0;                               // 0x544(0x01)
	char                                          bUseFallingAnimation : 0;                                    // 0x50c(0x01)
	char                                          UnknownData790[0x38];                                        // 0x790(0x38)
	char                                          bUseVehicleStandAnimation : 0;                               // 0x7c8(0x01)
	char                                          UnknownData7C8[0xc];                                         // 0x7c8(0x0c)
	char                                          bIsAirWalking : 0;                                           // 0x7d4(0x01)
	char                                          bIsAmplifier : 0;                                            // 0x5d8(0x01)
	char                                          bIsCriticalTime : 0;                                         // 0x3ca(0x01)
	char                                          bIsResuscitating : 0;                                        // 0x4c1(0x01)
	char                                          bIsInVehicle : 0;                                            // 0x5a4(0x01)
	char                                          UnknownData7D4[0x446];                                       // 0x7d4(0x446)
	char                                          bIsVehicleDriver : 0;                                        // 0xc1a(0x01)
	char                                          bEnableDriverIK_HandL : 0;                                   // 0x76e(0x01)
	char                                          bEnableDriverIK_HandR : 0;                                   // 0x313(0x01)
	float                                         DriverAimOffsetAlpha;                                        // 0x688(0x04)
	struct FNone*                                 VehicleUnarmedAnimIdle;                                      // 0x590(0x08)
	struct FNone*                                 VehicleUnarmedAnimStand;                                     // 0x708(0x08)
	struct FNone*                                 VehicleAnimIdle;                                             // 0x380(0x08)
	struct FNone*                                 VehicleAnimAOS;                                              // 0x4e0(0x08)
	struct FNone*                                 VehicleAnimIdleForMontagePlay;                               // 0x390(0x08)
	struct FNone*                                 VehicleAimingAimOffset;                                      // 0x5e8(0x08)
	struct FNone*                                 VehicleIdleAimOffset;                                        // 0xc28(0x08)
	struct FNone*                                 VehicleUnderThrowAimOffset;                                  // 0x7c0(0x08)
	struct FNone*                                 VehicleAimBlending;                                          // 0x628(0x08)
	struct FNone*                                 VehicleHandlingIdleAnim;                                     // 0x7a8(0x08)
	struct FNone*                                 VehicleHandlingLeftAnim;                                     // 0x520(0x08)
	struct FNone*                                 VehicleHandlingRightAnim;                                    // 0x278(0x08)
	char                                          IsVehicleAimingMotion : 0;                                   // 0x6a9(0x01)
	float                                         VehicleADSBlendTime;                                         // 0x464(0x04)
	float                                         VehicleADSBlendDirectTime;                                   // 0x430(0x04)
	float                                         VehicleAimingBlendTime;                                      // 0x5b8(0x04)
	float                                         VehicleAimingBlendDirectTime;                                // 0x3fc(0x04)
	char                                          bUseVehicleAimingAimOffset : 0;                              // 0x311(0x01)
	float                                         VehicleAOSBlendingAngle;                                     // 0x3f0(0x04)
	float                                         VehicleAOSBlendingPlayRate;                                  // 0x648(0x04)
	char                                          bIsHandlebar : 0;                                            // 0x344(0x01)
	struct FNone*                                 BS_HandlebarVehicle;                                         // 0x750(0x08)
	float                                         HandlebarDirection;                                          // 0x508(0x04)
	float                                         HandlebarSpeed;                                              // 0x600(0x04)
	char                                          bIsLeftSteering : 0;                                         // 0x73a(0x01)
	char                                          bIsRightSteering : 0;                                        // 0x2d8(0x01)
	float                                         LeftSteeringPlayRate;                                        // 0x6fc(0x04)
	float                                         RightSteeringPlayRate;                                       // 0x570(0x04)
	char                                          bIsIdleSteering : 0;                                         // 0x52c(0x01)
	char                                          IsLadderAnim : 0;                                            // 0x460(0x01)
	char                                          IsPawnOnLadder : 0;                                          // 0x76c(0x01)
	char                                          IsLadderSliding : 0;                                         // 0x42c(0x01)
	char                                          LadderIdleMotion : 0;                                        // 0x728(0x01)
	char                                          LadderIdleIsLeft : 0;                                        // 0x701(0x01)
	float                                         LadderBlendTime;                                             // 0x79c(0x04)
	float                                         EvaluateAnimSequence;                                        // 0x724(0x04)
	struct FNone*                                 AS_Ladder_Up_Loop;                                           // 0x2c8(0x08)
	struct FNone                                  LadderIKLocation_HandL;                                      // 0x5bc(0x0c)
	struct FNone                                  LadderIKLocation_HandR;                                      // 0x34c(0x0c)
	struct FNone                                  LadderIKLocation_FootL;                                      // 0x558(0x0c)
	struct FNone                                  LadderIKLocation_FootR;                                      // 0x454(0x0c)
	char                                          bEnableLadderIK_HandL : 0;                                   // 0x36c(0x01)
	char                                          bEnableLadderIK_HandR : 0;                                   // 0x718(0x01)
	char                                          bEnableLadderIK_FootL : 0;                                   // 0xc19(0x01)
	char                                          bEnableLadderIK_FootR : 0;                                   // 0x6e0(0x01)
	struct FNone                                  AimOffset;                                                   // 0x440(0x08)
	char                                          bEnableAimOffset : 0;                                        // 0x3e8(0x01)
	char                                          bEnableSprintAimOffset : 0;                                  // 0x6a0(0x01)
	char                                          bIsAimingDownside : 0;                                       // 0x3f8(0x01)
	float                                         DownsideBlendTime;                                           // 0xc38(0x04)
	float                                         AimOffsetInterpSpeed;                                        // 0xbf8(0x04)
	char                                          bIsPlayingWeaponMontage : 0;                                 // 0xc54(0x01)
	char                                          bIsPlayingCollideWeaponMontage : 0;                          // 0x51c(0x01)
	char                                          bIsADS : 0;                                                  // 0x738(0x01)
	struct FNone*                                 CollideUpsideAnim;                                           // 0x550(0x08)
	struct FNone*                                 CollideDownsideAnim;                                         // 0x740(0x08)
	struct FNone*                                 CollideProneAnim;                                            // 0x4d0(0x08)
	char                                          bIsWeaponColliding : 0;                                      // 0x758(0x01)
	enum class None                               WeaponType;                                                  // 0x2d9(0x01)
	enum class None                               WeaponAnimType;                                              // 0x3a0(0x01)
	enum class None                               SimpleWeaponAnimType;                                        // 0x763(0x01)
	char                                          bIsEquippingThrowWeapon : 0;                                 // 0x65c(0x01)
	char                                          bIsProneColliding : 0;                                       // 0x7d5(0x01)
	struct FNone*                                 WeaponHandAnim;                                              // 0x790(0x08)
	struct FNone*                                 WeaponHandAnim_Crouch;                                       // 0x2b0(0x08)
	struct FNone*                                 WeaponHandAnim_Prone;                                        // 0x730(0x08)
	struct FNone*                                 WeaponHandAnim_InVehicle;                                    // 0x2a8(0x08)
	float                                         WeaponHandAnimAlpha;                                         // 0xc14(0x04)
	float                                         AOS_Weight;                                                  // 0x5a0(0x04)
	float                                         AOS_Weight_InterpSpeed;                                      // 0x3e4(0x04)
	struct FNone*                                 CurrentAOSAnim;                                              // 0xc08(0x08)
	struct FNone*                                 CurrentADSAnim;                                              // 0x548(0x08)
	struct FNone*                                 SecondaryWeapon_Stand_Idle;                                  // 0x2f8(0x08)
	struct FNone*                                 SecondaryWeapon_Crouch_Idle;                                 // 0x510(0x08)
	enum class None                               ThrowingWeaponState;                                         // 0x638(0x01)
	enum class None                               GrenadeThrowingType;                                         // 0x3c9(0x01)
	struct FNone*                                 ThrowingWeapon_Stand_Idle;                                   // 0x2e0(0x08)
	struct FNone*                                 ThrowingWeapon_Stand_Idle_Under;                             // 0x3c0(0x08)
	struct FNone*                                 ThrowingWeapon_Stand_PinOff_Idle;                            // 0xbe0(0x08)
	struct FNone*                                 ThrowingWeapon_Stand_PinOff_Idle_Additive;                   // 0x4b8(0x08)
	struct FNone*                                 ThrowingWeapon_Stand_ThrowUnder_Idle;                        // 0x2c0(0x08)
	struct FNone*                                 ThrowingWeapon_Stand_ThrowUnder_Idle_Additive;               // 0x448(0x08)
	struct FNone*                                 ThrowingWeapon_Crouch_Idle;                                  // 0x530(0x08)
	struct FNone*                                 ThrowingWeapon_Crouch_PinOff_Idle;                           // 0x470(0x08)
	struct FNone*                                 ThrowingWeapon_Crouch_PinOff_Idle_Additive;                  // 0xc30(0x08)
	struct FNone*                                 ThrowingWeapon_Crouch_ThrowUnder_Idle;                       // 0x300(0x08)
	struct FNone*                                 ThrowingWeapon_Crouch_ThrowUnder_Idle_Additive;              // 0x4c8(0x08)
	struct FNone*                                 ThrowingWeapon_Prone_Idle;                                   // 0x328(0x08)
	struct FNone*                                 ThrowingWeapon_Prone_PinOff_Idle_ThrowOver;                  // 0x438(0x08)
	struct FNone*                                 ThrowingWeapon_Prone_PinOff_Idle_ThrowUnder;                 // 0x2b8(0x08)
	struct FNone*                                 MeleeWeapon_Stand_Idle;                                      // 0x710(0x08)
	struct FNone*                                 MeleeWeapon_Crouch_Idle;                                     // 0x318(0x08)
	struct FNone*                                 MeleeWeapon_Prone_Idle;                                      // 0x418(0x08)
	float                                         BS_SprintSpeed;                                              // 0x68c(0x04)
	float                                         BS_IdleSpeed;                                                // 0x2f0(0x04)
	float                                         BS_SprintSpeedLimit;                                         // 0x59c(0x04)
	float                                         FallSpeed;                                                   // 0x704(0x04)
	float                                         AimOffsetBlendTime;                                          // 0x478(0x04)
	float                                         UseSprintAnimBlendTime;                                      // 0x588(0x04)
	float                                         WeaponCollideAlpha;                                          // 0x4fc(0x04)
	float                                         WeaponMontageCollideAlpha;                                   // 0x28c(0x04)
	float                                         AimOffsetAlpha;                                              // 0x5b0(0x04)
	float                                         DoorAnimAlpha;                                               // 0x658(0x04)
	float                                         FootPosition;                                                // 0x30c(0x04)
	float                                         FootPositionDirection;                                       // 0x314(0x04)
	char                                          bUseRightFootAnimation : 0;                                  // 0x76d(0x01)
	float                                         LeanRotation;                                                // 0x420(0x04)
	float                                         LeanAcceleration;                                            // 0x46c(0x04)
	char                                          bLockRotation : 0;                                           // 0x345(0x01)
	enum class None                               MovementDirection;                                           // 0x4f9(0x01)
	struct FNone*                                 SpecialSprintAnimation;                                      // 0x338(0x08)
	struct FNone*                                 SpecialCrouchSprintAnimation;                                // 0x408(0x08)
	struct FNone*                                 SpecialSprintReadyAnimation;                                 // 0x400(0x08)
	struct FNone*                                 SpecialProneAnimation;                                       // 0x3d0(0x08)
	struct FNone                                  FallingAnimParams;                                           // 0x4a0(0x0c)
	float                                         LeanInAir;                                                   // 0x584(0x04)
	struct FNone*                                 JumpAnimSequence_Unarmed;                                    // 0x640(0x08)
	struct FNone*                                 JumpAnimSequence_Rifle;                                      // 0x480(0x08)
	struct FNone*                                 JumpAnimSequence_Pistol;                                     // 0x6b0(0x08)
	struct FNone*                                 JumpAnim_Unarmed_NotMoving;                                  // 0xbf0(0x08)
	struct FNone*                                 JumpAnim_Unarmed_Moving;                                     // 0x6f0(0x08)
	struct FNone*                                 JumpAnim_Rifle_NotMoving;                                    // 0x670(0x08)
	struct FNone*                                 JumpAnim_Rifle_Moving;                                       // 0x578(0x08)
	struct FNone*                                 JumpAnim_Pistol_NotMoving;                                   // 0x500(0x08)
	struct FNone*                                 JumpAnim_Pistol_Moving;                                      // 0x6c0(0x08)
	struct FNone*                                 ToCriticalTime;                                              // 0x7b0(0x08)
	struct FNone*                                 CriticalTimeIdle;                                            // 0x660(0x08)
	struct FNone*                                 Resuscitated;                                                // 0x680(0x08)
	char                                          bUnderWaterSurface : 0;                                      // 0x5e4(0x01)
	float                                         SwimDirection;                                               // 0x6ac(0x04)
	struct FNone                                  FinalSwimRotation;                                           // 0x6d0(0x0c)
	struct FNone                                  TurnInPlaceInfo;                                             // 0x7e0(0x400)
	float                                         TurnInPlaceRepeatTriggerTime;                                // 0x678(0x04)
	float                                         TurnInPlaceRepeatTriggerAngle;                               // 0x268(0x04)
	float                                         TurnInPlaceRepeatTime;                                       // 0x618(0x04)
	float                                         TurnInPlaceRepeatAngle;                                      // 0x2ec(0x04)
	float                                         TurnInPlaceRepeatTimeCrouch;                                 // 0x5d4(0x04)
	float                                         TurnInPlaceRepeatTimeProne;                                  // 0x71c(0x04)
	float                                         TurnInPlaceBlendInTime;                                      // 0x6b8(0x04)
	float                                         TurnInPlaceBlendOutTime;                                     // 0x6a4(0x04)
	char                                          bTurnInPlaceRepeatCheat : 0;                                 // 0x6f9(0x01)
	struct FNone*                                 ParticleSystem_WaterDust;                                    // 0x490(0x08)
	char                                          bUsePredictedAirTime : 0;                                    // 0x52d(0x01)
	char                                          bHitPredictedInAirTime : 0;                                  // 0x760(0x01)
	float                                         HitPredictedZ;                                               // 0x424(0x04)
	float                                         WaterSurfaceHeight;                                          // 0xc00(0x04)
	float                                         SwimTransformAlpha;                                          // 0x61c(0x04)
	float                                         SprintReadyEnteredTime;                                      // 0x270(0x04)
	char                                          bCanEnterSprintReadyState : 0;                               // 0x468(0x01)
	float                                         DebuffAlpha_Burn_FullBody;                                   // 0x7d0(0x04)
	float                                         DebuffAlpha_Burn_UpperBody;                                  // 0x3e0(0x04)
	float                                         DebuffAlpha_Hurt_Additive;                                   // 0x428(0x04)
	float                                         DebuffAlpha_Hurt_Layered;                                    // 0x284(0x04)
	float                                         Hurt_Additive_RightHandAlpha;                                // 0x2f4(0x04)
	float                                         ExplicitTime_FallingAnim;                                    // 0x368(0x04)
	char                                          bIsUnarmedHeadBanging : 0;                                   // 0x5e1(0x01)
	float                                         HeadBangingAlpha;                                            // 0x3f4(0x04)
	uint32_t                                      HeadBangingAnimIndex;                                        // 0x5f0(0x04)
	float                                         HeadBangingCurrentPlayRate;                                  // 0x3ac(0x04)
	float                                         DescentForwardPicthMin;                                      // 0x4ac(0x04)
	float                                         DescentIdlePicthMin;                                         // 0x5b4(0x04)
	struct FNone*                                 DescentBackwardMontage;                                      // 0x5f8(0x08)
	float                                         BS_DescentRotationInput;                                     // 0x340(0x04)
	float                                         RightArmAnimAlpha;                                           // 0x3bc(0x04)
