// Class Engine.ActorComponent
// Size: 0xb0 (Inherited: 0x28)
struct UActorComponent : UObject 
{
	char                                          UnknownData28[0x8];                                          // 0x28(0x08)
	struct FNone                                  PrimaryComponentTick;                                        // 0x30(0x30)
	struct TArray<None>                           ComponentTags;                                               // 0x60(0x10)
	struct TArray<None>                           AssetUserData;                                               // 0x70(0x10)
	char                                          UnknownData80[0x4];                                          // 0x80(0x04)
	uint32_t                                      UCSSerializationIndex;                                       // 0x84(0x04)
	char                                          bNetAddressable : 0;                                         // 0x88(0x01)
	char                                          bReplicates : 0;                                             // 0x88(0x01)
	char                                          UnknownData88[0x1];                                          // 0x88(0x01)
	char                                          bAutoActivate : 0;                                           // 0x89(0x01)
	char                                          UnknownData89[0x1];                                          // 0x89(0x01)
	char                                          bIsActive : 0;                                               // 0x8a(0x01)
	char                                          bEditableWhenInherited : 0;                                  // 0x8a(0x01)
	char                                          bCanEverAffectNavigation : 0;                                // 0x8a(0x01)
	char                                          bIsEditorOnly : 0;                                           // 0x8a(0x01)
	char                                          UnknownData8A[0x2];                                          // 0x8a(0x02)
	enum class None                               CreationMethod;                                              // 0x8c(0x01)
	struct FMulticastSparseDelegate               OnComponentActivated;                                        // 0x8d(0x01)
	struct FMulticastSparseDelegate               OnComponentDeactivated;                                      // 0x8e(0x01)
	char                                          UnknownData8F[0x1];                                          // 0x8f(0x01)
	struct TArray<None>                           UCSModifiedProperties;                                       // 0x90(0x10)
	char                                          UnknownDataA0[0x10];                                         // 0xa0(0x10)

	void ToggleActive(); // sub_0x3373b70
	void SetTickGroup(char NewTickGroup); // sub_0x3c4de40
	void SetTickableWhenPaused(char bTickableWhenPaused); // sub_0x3c4dec0
	void SetIsReplicated(char ShouldReplicate); // sub_0x3c4ddb0
	void SetComponentTickInterval(float TickInterval); // sub_0x3c4dd30
	void SetComponentTickEnabled(char bEnabled); // sub_0x3c48c10
	void SetAutoActivate(char bNewAutoActivate); // sub_0x3c4dca0
	void SetActive(char bNewActive, char bReset); // sub_0x3c4dbd0
	void RemoveTickPrerequisiteComponent(struct FNone* PrerequisiteComponent); // sub_0x3c4db40
	void RemoveTickPrerequisiteActor(struct FNone* PrerequisiteActor); // sub_0x3c4dab0
	void ReceiveTick(float DeltaSeconds); // sub_0x239bfb0
	void ReceiveEndPlay(char EndPlayReason); // sub_0x239bfb0
	void ReceiveBeginPlay(); // sub_0x239bfb0
	void OnRep_IsActive(); // sub_0x2ecb6f0
	void K2_DestroyComponent(struct FNone* Object); // sub_0x3c4d9b0
	char IsComponentTickEnabled(); // sub_0x3c4d980
	char IsBeingDestroyed(); // sub_0x3c4d950
	char IsActive(); // sub_0x3c4d920
	struct FNone* GetOwner(); // sub_0x3c4d900
	float GetComponentTickInterval(); // sub_0x3c4d8d0
	void Deactivate(); // sub_0x2ecb6d0
	char ComponentHasTag(struct FName Tag); // sub_0x3c4d6c0
	void AddTickPrerequisiteComponent(struct FNone* PrerequisiteComponent); // sub_0x3c4d570
	void AddTickPrerequisiteActor(struct FNone* PrerequisiteActor); // sub_0x3c4d4e0
	void Activate(char bReset); // sub_0x3373e10
};

// Class Engine.SceneComponent
// Size: 0x240 (Inherited: 0xb0)
struct USceneComponent : UActorComponent 
{
	char                                          UnknownDataB0[0x94];                                         // 0xb0(0x94)
	struct TWeakObjectPtr<struct FNone>           PhysicsVolume;                                               // 0x144(0x08)
	char                                          UnknownData14C[0x84];                                        // 0x14c(0x84)
	struct FNone*                                 AttachParent;                                                // 0x1d0(0x08)
	char                                          UnknownData1D8[0x4];                                         // 0x1d8(0x04)
	struct FName                                  AttachSocketName;                                            // 0x1dc(0x08)
	struct TArray<None>                           AttachChildren;                                              // 0xb8(0x10)
	struct TArray<None>                           ClientAttachedChildren;                                      // 0x190(0x10)
	char                                          UnknownData204[0x20];                                        // 0x204(0x20)
	struct FNone                                  RelativeLocation;                                            // 0x224(0x0c)
	struct FNone                                  RelativeRotation;                                            // 0x1b4(0x0c)
	struct FNone                                  RelativeScale3D;                                             // 0x1c4(0x0c)
	struct FNone                                  ComponentVelocity;                                           // 0x164(0x0c)
	char                                          bComponentToWorldUpdated : 0;                                // 0x140(0x01)
	char                                          bAbsoluteLocation : 0;                                       // 0x220(0x01)
	char                                          bAbsoluteRotation : 0;                                       // 0x1d8(0x01)
	char                                          bAbsoluteScale : 0;                                          // 0x188(0x01)
	char                                          bVisible : 0;                                                // 0xc8(0x01)
	char                                          bShouldBeAttached : 0;                                       // 0x220(0x01)
	char                                          bShouldSnapLocationWhenAttached : 0;                         // 0x1b0(0x01)
	char                                          bShouldSnapRotationWhenAttached : 0;                         // 0x188(0x01)
	char                                          bShouldUpdatePhysicsVolume : 0;                              // 0x1a0(0x01)
	char                                          bHiddenInGame : 0;                                           // 0x220(0x01)
	char                                          bBoundsChangeTriggersStreamingDataRebuild : 0;               // 0xc8(0x01)
	char                                          bUseAttachParentBound : 0;                                   // 0x1d8(0x01)
	char                                          Mobility;                                                    // 0x221(0x01)
	char                                          DetailMode;                                                  // 0x160(0x01)
	struct FMulticastSparseDelegate               PhysicsVolumeChangedDelegate;                                // 0xb0(0x01)

	void ToggleVisibility(char bPropagateToChildren); // sub_0x3dcc150
	char SnapTo(struct FNone* InParent, struct FName InSocketName); // sub_0x3dcc090
	void SetWorldScale3D(struct FNone NewScale); // sub_0x3dcbeb0
	void SetVisibility(char bNewVisibility, char bPropagateToChildren); // sub_0x3dcbde0
	void SetShouldUpdatePhysicsVolume(char bInShouldUpdatePhysicsVolume); // sub_0x3dcbd50
	void SetRelativeScale3D(struct FNone NewScale3D); // sub_0x3dcbcc0
	void SetMobility(char NewMobility); // sub_0x3dcbc40
	void SetHiddenInGame(char NewHidden, char bPropagateToChildren); // sub_0x3dcbb70
	void SetAbsolute(char bNewAbsoluteLocation, char bNewAbsoluteRotation, char bNewAbsoluteScale); // sub_0x3dcb9d0
	void ResetRelativeTransform(); // sub_0x3dcb9b0
	void OnRep_Visibility(char OldValue); // sub_0x3dcb7d0
	void OnRep_Transform(); // sub_0x3dcb7b0
	void OnRep_AttachSocketName(); // sub_0x3dcb790
	void OnRep_AttachParent(); // sub_0x3dcb790
	void OnRep_AttachChildren(); // sub_0x3dcb770
	void K2_SetWorldTransform(struct FNone& NewTransform, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3dcb570
	void K2_SetWorldRotation(struct FNone NewRotation, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3dcb3d0
	void K2_SetWorldLocationAndRotation(struct FNone NewLocation, struct FNone NewRotation, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3dcb1e0
	void K2_SetWorldLocation(struct FNone NewLocation, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3dcb040
	void K2_SetRelativeTransform(struct FNone& NewTransform, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3dcae40
	void K2_SetRelativeRotation(struct FNone NewRotation, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3dcaca0
	void K2_SetRelativeLocationAndRotation(struct FNone NewLocation, struct FNone NewRotation, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3dcaab0
	void K2_SetRelativeLocation(struct FNone NewLocation, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3dca910
	struct FNone K2_GetComponentToWorld(); // sub_0x3dca8b0
	struct FNone K2_GetComponentScale(); // sub_0x3dca870
	struct FNone K2_GetComponentRotation(); // sub_0x3dca830
	struct FNone K2_GetComponentLocation(); // sub_0x3dca7f0
	void K2_DetachFromComponent(enum class None LocationRule, enum class None RotationRule, enum class None ScaleRule, char bCallModify); // sub_0x3dca6a0
	char K2_AttachToComponent(struct FNone* Parent, struct FName SocketName, enum class None LocationRule, enum class None RotationRule, enum class None ScaleRule, char bWeldSimulatedBodies); // sub_0x3dca4f0
	char K2_AttachTo(struct FNone* InParent, struct FName InSocketName, char AttachType, char bWeldSimulatedBodies); // sub_0x3dca3a0
	void K2_AddWorldTransform(struct FNone& DeltaTransform, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3dca1a0
	void K2_AddWorldRotation(struct FNone DeltaRotation, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3dca000
	void K2_AddWorldOffset(struct FNone DeltaLocation, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3dc9e60
	void K2_AddRelativeRotation(struct FNone DeltaRotation, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3dc9cc0
	void K2_AddRelativeLocation(struct FNone DeltaLocation, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3dc9b20
	void K2_AddLocalTransform(struct FNone& DeltaTransform, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3dc9920
	void K2_AddLocalRotation(struct FNone DeltaRotation, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3dc9780
	void K2_AddLocalOffset(struct FNone DeltaLocation, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3dc95e0
	char IsVisible(); // sub_0x3dc95b0
	char IsSimulatingPhysics(struct FName BoneName); // sub_0x3dc9510
	char IsAnySimulatingPhysics(); // sub_0x3dc94e0
	struct FNone GetUpVector(); // sub_0x3dc9350
	struct FNone GetSocketTransform(struct FName InSocketName, char TransformSpace); // sub_0x3dc9250
	struct FNone GetSocketRotation(struct FName InSocketName); // sub_0x3dc91a0
	struct FNone GetSocketQuaternion(struct FName InSocketName); // sub_0x3dc9100
	struct FNone GetSocketLocation(struct FName InSocketName); // sub_0x3dc9050
	char GetShouldUpdatePhysicsVolume(); // sub_0x3dc9020
	struct FNone GetRightVector(); // sub_0x3dc8fe0
	struct FNone GetRelativeTransform(); // sub_0x3dc8f80
	struct FNone* GetPhysicsVolume(); // sub_0x3dc8f50
	void GetParentComponents(struct TArray<None>& Parents); // sub_0x3dc8ea0
	uint32_t GetNumChildrenComponents(); // sub_0x3dc8e70
	struct FNone GetForwardVector(); // sub_0x3d9fd80
	struct FNone GetComponentVelocity(); // sub_0x3dc8e30
	void GetChildrenComponents(char bIncludeAllDescendants, struct TArray<None>& Children); // sub_0x3dc8d30
	struct FNone* GetChildComponent(uint32_t ChildIndex); // sub_0x3dc8ca0
	struct FName GetAttachSocketName(); // sub_0x3dc8c80
	struct FNone* GetAttachParent(); // sub_0x3dc8c60
	struct TArray<None> GetAllSocketNames(); // sub_0x3dc8be0
	char DoesSocketExist(struct FName InSocketName); // sub_0x3dc8b40
	void DetachFromParent(char bMaintainWorldPosition, char bCallModify); // sub_0x3dc8a70
};

// Class Engine.MKActorEx
// Size: 0x90 (Inherited: 0x28)
struct UMKActorEx : UObject 
{
	char                                          ReplaySamplable;                                             // 0x28(0x01)
	char                                          UnknownData29[0x7];                                          // 0x29(0x07)
	struct FNone*                                 ReplaySampleClass;                                           // 0x30(0x08)
	float                                         ReplaySamplingFrequency;                                     // 0x38(0x04)
	uint32_t                                      ClientReplaySamplingGUID;                                    // 0x3c(0x04)
	char                                          UnknownData40[0x4];                                          // 0x40(0x04)
	char                                          bReplayLevelAttached : 0;                                    // 0x44(0x01)
	char                                          UnknownData44[0x24];                                         // 0x44(0x24)
	struct TArray<None>                           ReplaySamplesForPlayback;                                    // 0x68(0x10)
	char                                          UnknownData78[0x10];                                         // 0x78(0x10)
	struct FNone*                                 SelfActor;                                                   // 0x88(0x08)

	void OnTickReplaySampleRecord(struct FNone* DemoNetDriver, float MinRecordHz, float MaxRecordHz, char bSaveCheckpoint); // sub_0x3d796e0
	void OnTickReplaySamplePlayback(struct FNone* DemoNetDriver); // sub_0x3d79660
	void OnReplayPreScrub(struct FNone* InWorld); // sub_0x2ecb460
	void OnPostRecordReplay(struct FNone* InWorld, struct FNone& DemoURL); // sub_0x3d79570
	void LerpReplaySampleForPlayback(struct FNone* DemoNetDriver, struct FNone* L, struct FNone* R, float LerpPercent); // sub_0x3d79330
	char HandleTimelineScrubbed(); // sub_0x2ecb670
	void GatherReplaySampleForRecording(struct FNone* DemoNetDriver, float DemoCurrentTime, char bSaveCheckpoint); // sub_0x3d784b0
	void ForceReplaySamplingUpdate(); // sub_0x3ca12c0
};

// Class Engine.Actor
// Size: 0x310 (Inherited: 0x90)
struct AActor : UMKActorEx 
{
	char                                          UnknownData90[0x148];                                        // 0x90(0x148)
	struct FNone                                  PrimaryActorTick;                                            // 0x1d8(0x30)
	char                                          UnknownData208[0x7c];                                        // 0x208(0x7c)
	char                                          bNetTemporary : 0;                                           // 0x284(0x01)
	char                                          bNetStartup : 0;                                             // 0x248(0x01)
	char                                          bOnlyRelevantToOwner : 0;                                    // 0x1c4(0x01)
	char                                          bAlwaysRelevant : 0;                                         // 0xa1(0x01)
	char                                          bReplicateMovement : 0;                                      // 0x260(0x01)
	char                                          bHidden : 0;                                                 // 0x222(0x01)
	char                                          bTearOff : 0;                                                // 0x284(0x01)
	char                                          bExchangedRoles : 0;                                         // 0x120(0x01)
	char                                          bNetLoadOnClient : 0;                                        // 0x138(0x01)
	char                                          bNetUseOwnerRelevancy : 0;                                   // 0xe8(0x01)
	char                                          bRelevantForNetworkReplays : 0;                              // 0x170(0x01)
	char                                          bRelevantForLevelBounds : 0;                                 // 0x138(0x01)
	char                                          bReplayRewindable : 0;                                       // 0x9f(0x01)
	char                                          bAllowTickBeforeBeginPlay : 0;                               // 0x1c4(0x01)
	char                                          bAutoDestroyWhenFinished : 0;                                // 0x1c4(0x01)
	char                                          bCanBeDamaged : 0;                                           // 0x1a0(0x01)
	char                                          UnknownData284[0x7f];                                        // 0x284(0x7f)
	char                                          bBlockInput : 0;                                             // 0x303(0x01)
	char                                          bCollideWhenPlacing : 0;                                     // 0x301(0x01)
	char                                          bFindCameraComponentWhenViewTarget : 0;                      // 0x251(0x01)
	char                                          UnknownData303[0xb];                                         // 0x303(0x0b)
	char                                          bGenerateOverlapEventsDuringLevelStreaming : 0;              // 0x30e(0x01)
	char                                          bIgnoresOriginShifting : 0;                                  // 0x155(0x01)
	char                                          bEnableAutoLODGeneration : 0;                                // 0x251(0x01)
	char                                          bIsEditorOnlyActor : 0;                                      // 0x120(0x01)
	char                                          bActorSeamlessTraveled : 0;                                  // 0xea(0x01)
	char                                          bReplicates : 0;                                             // 0x9d(0x01)
	char                                          bCanBeInCluster : 0;                                         // 0x90(0x01)
	char                                          bAllowReceiveTickEventOnDedicatedServer : 0;                 // 0x198(0x01)
	char                                          bActorEnableCollision : 0;                                   // 0x1b8(0x01)
	char                                          bActorIsBeingDestroyed : 0;                                  // 0x30e(0x01)
	enum class None                               UpdateOverlapsMethodDuringLevelStreaming;                    // 0x154(0x01)
	enum class None                               DefaultUpdateOverlapsMethodDuringLevelStreaming;             // 0xa3(0x01)
	char                                          RemoteRole;                                                  // 0x279(0x01)
	struct FNone                                  ReplicatedMovement;                                          // 0xec(0x34)
	float                                         InitialLifeSpan;                                             // 0x2e0(0x04)
	float                                         CustomTimeDilation;                                          // 0x308(0x04)
	struct FNone                                  AttachmentReplication;                                       // 0xa8(0x40)
	struct FNone*                                 Owner;                                                       // 0x178(0x08)
	struct FName                                  NetDriverName;                                               // 0x94(0x08)
	char                                          Role;                                                        // 0x9e(0x01)
	char                                          NetDormancy;                                                 // 0x238(0x01)
	enum class None                               SpawnCollisionHandlingMethod;                                // 0x304(0x01)
	char                                          AutoReceiveInput;                                            // 0x302(0x01)
	uint32_t                                      InputPriority;                                               // 0x150(0x04)
	struct FNone*                                 InputComponent;                                              // 0x2f8(0x08)
	float                                         NetCullDistanceSquared;                                      // 0x280(0x04)
	uint32_t                                      NetTag;                                                      // 0x24c(0x04)
	float                                         NetUpdateFrequency;                                          // 0x27c(0x04)
	float                                         MinNetUpdateFrequency;                                       // 0x288(0x04)
	float                                         NetPriority;                                                 // 0x21c(0x04)
	struct FNone*                                 Instigator;                                                  // 0x258(0x08)
	struct TArray<None>                           Children;                                                    // 0x268(0x10)
	struct FNone*                                 RootComponent;                                               // 0x158(0x08)
	struct TArray<None>                           ControllingMatineeActors;                                    // 0x208(0x10)
	struct TArray<None>                           Layers;                                                      // 0x188(0x10)
	struct TWeakObjectPtr<struct FNone>           ParentComponent;                                             // 0x1bc(0x08)
	char                                          bEnableRerunConstructionScript : 0;                          // 0x30c(0x01)
	struct TArray<None>                           Tags;                                                        // 0x140(0x10)
	struct FMulticastSparseDelegate               OnTakeAnyDamage;                                             // 0x218(0x01)
	struct FMulticastSparseDelegate               OnTakePointDamage;                                           // 0x27a(0x01)
	struct FMulticastSparseDelegate               OnTakeRadialDamage;                                          // 0x9c(0x01)
	struct FMulticastSparseDelegate               OnActorBeginOverlap;                                         // 0x27b(0x01)
	struct FMulticastSparseDelegate               OnActorEndOverlap;                                           // 0xa0(0x01)
	struct FMulticastSparseDelegate               OnBeginCursorOver;                                           // 0x221(0x01)
	struct FMulticastSparseDelegate               OnEndCursorOver;                                             // 0xe9(0x01)
	struct FMulticastSparseDelegate               OnClicked;                                                   // 0x278(0x01)
	struct FMulticastSparseDelegate               OnReleased;                                                  // 0x2e4(0x01)
	struct FMulticastSparseDelegate               OnInputTouchBegin;                                           // 0x300(0x01)
	struct FMulticastSparseDelegate               OnInputTouchEnd;                                             // 0x285(0x01)
	struct FMulticastSparseDelegate               OnInputTouchEnter;                                           // 0xa2(0x01)
	struct FMulticastSparseDelegate               OnInputTouchLeave;                                           // 0x250(0x01)
	struct FMulticastSparseDelegate               OnActorHit;                                                  // 0x180(0x01)
	struct FMulticastSparseDelegate               OnDestroyed;                                                 // 0x220(0x01)
	struct FMulticastSparseDelegate               OnEndPlay;                                                   // 0x30d(0x01)
	struct TArray<None>                           InstanceComponents;                                          // 0x128(0x10)
	struct TArray<None>                           BlueprintCreatedComponents;                                  // 0x1a8(0x10)
	struct TArray<None>                           LoadedObjects;                                               // 0x1c8(0x10)

	char WasRecentlyRendered(float Tolerance); // sub_0x3c49400
	void UserConstructionScript(); // sub_0x239bfb0
	void TearOff(); // sub_0x3c493e0
	void SnapRootComponentTo(struct FNone* InParentActor, struct FName InSocketName); // sub_0x3c49320
	void SetTickGroup(char NewTickGroup); // sub_0x3c49210
	void SetTickableWhenPaused(char bTickableWhenPaused); // sub_0x3c49290
	void SetReplicates(char bInReplicates); // sub_0x3c49180
	void SetReplicateMovement(char bInReplicateMovement); // sub_0x3c490f0
	void SetOwner(struct FNone* NewOwner); // sub_0x3c49060
	void SetNetDormancy(char NewDormancy); // sub_0x3c48fe0
	void SetLifeSpan(float InLifespan); // sub_0x3c48f60
	void SetAutoDestroyWhenFinished(char bVal); // sub_0x3c48ed0
	void SetActorTickInterval(float TickInterval); // sub_0x3c48e50
	void SetActorTickEnabled(char bEnabled); // sub_0x3c48dc0
	void SetActorScale3D(struct FNone NewScale3D); // sub_0x3c48d30
	void SetActorRelativeScale3D(struct FNone NewRelativeScale); // sub_0x3c48ca0
	void SetActorHiddenInGame(char bNewHidden); // sub_0x3c48c10
	void SetActorEnableCollision(char bNewActorEnableCollision); // sub_0x3c48b80
	void RemoveTickPrerequisiteComponent(struct FNone* PrerequisiteComponent); // sub_0x3c48af0
	void RemoveTickPrerequisiteActor(struct FNone* PrerequisiteActor); // sub_0x3c48a60
	void ReceiveTick(float DeltaSeconds); // sub_0x239bfb0
	void ReceiveRadialDamage(float DamageReceived, struct FNone* DamageType, struct FNone Origin, struct FNone& HitInfo, struct FNone* InstigatedBy, struct FNone* DamageCauser); // sub_0x239bfb0
	void ReceivePointDamage(float Damage, struct FNone* DamageType, struct FNone HitLocation, struct FNone HitNormal, struct FNone* HitComponent, struct FName BoneName, struct FNone ShotFromDirection, struct FNone* InstigatedBy, struct FNone* DamageCauser, struct FNone& HitInfo); // sub_0x239bfb0
	void ReceiveHit(struct FNone* MyComp, struct FNone* Other, struct FNone* OtherComp, char bSelfMoved, struct FNone HitLocation, struct FNone HitNormal, struct FNone NormalImpulse, struct FNone& Hit); // sub_0x239bfb0
	void ReceiveEndPlay(char EndPlayReason); // sub_0x239bfb0
	void ReceiveDestroyed(); // sub_0x239bfb0
	void ReceiveBeginPlay(); // sub_0x239bfb0
	void ReceiveAnyDamage(float Damage, struct FNone* DamageType, struct FNone* InstigatedBy, struct FNone* DamageCauser); // sub_0x239bfb0
	void ReceiveActorOnReleased(struct FNone ButtonReleased); // sub_0x239bfb0
	void ReceiveActorOnInputTouchLeave(char FingerIndex); // sub_0x239bfb0
	void ReceiveActorOnInputTouchEnter(char FingerIndex); // sub_0x239bfb0
	void ReceiveActorOnInputTouchEnd(char FingerIndex); // sub_0x239bfb0
	void ReceiveActorOnInputTouchBegin(char FingerIndex); // sub_0x239bfb0
	void ReceiveActorOnClicked(struct FNone ButtonPressed); // sub_0x239bfb0
	void ReceiveActorEndOverlap(struct FNone* OtherActor); // sub_0x239bfb0
	void ReceiveActorEndCursorOver(); // sub_0x239bfb0
	void ReceiveActorBeginOverlap(struct FNone* OtherActor); // sub_0x239bfb0
	void ReceiveActorBeginCursorOver(); // sub_0x239bfb0
	void PrestreamTextures(float Seconds, char bEnableStreaming, uint32_t CinematicTextureGroups); // sub_0x3c48950
	void OnRep_ReplicateMovement(); // sub_0x1e97ea0
	void OnRep_ReplicatedMovement(); // sub_0x3c48930
	void OnRep_Owner(); // sub_0x1e97860
	void OnRep_Instigator(); // sub_0x3c48910
	void OnRep_AttachmentReplication(); // sub_0x1e97a00
	void MakeNoise(float Loudness, struct FNone* NoiseInstigator, struct FNone NoiseLocation, float MaxRange, struct FName Tag); // sub_0x3c48780
	struct FNone* MakeMIDForMaterial(struct FNone* Parent); // sub_0x3c486f0
	char K2_TeleportTo(struct FNone DestLocation, struct FNone DestRotation); // sub_0x3c48600
	char K2_SetActorTransform(struct FNone& NewTransform, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3c48400
	char K2_SetActorRotation(struct FNone NewRotation, char bTeleportPhysics); // sub_0x3c48320
	void K2_SetActorRelativeTransform(struct FNone& NewRelativeTransform, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3c48120
	void K2_SetActorRelativeRotation(struct FNone NewRelativeRotation, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3c47f80
	void K2_SetActorRelativeLocation(struct FNone NewRelativeLocation, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3c47de0
	char K2_SetActorLocationAndRotation(struct FNone NewLocation, struct FNone NewRotation, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3c47be0
	char K2_SetActorLocation(struct FNone NewLocation, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3c47a30
	void K2_OnReset(); // sub_0x239bfb0
	void K2_OnEndViewTarget(struct FNone* PC); // sub_0x239bfb0
	void K2_OnBecomeViewTarget(struct FNone* PC); // sub_0x239bfb0
	struct FNone* K2_GetRootComponent(); // sub_0x3c47a10
	struct TArray<None> K2_GetComponentsByClass(struct FNone* ComponentClass); // sub_0x3c47930
	struct FNone K2_GetActorRotation(); // sub_0x3c47870
	struct FNone K2_GetActorLocation(); // sub_0x3c477d0
	void K2_DetachFromActor(enum class None LocationRule, enum class None RotationRule, enum class None ScaleRule); // sub_0x3c476d0
	void K2_DestroyComponent(struct FNone* Component); // sub_0x3c47650
	void K2_DestroyActor(); // sub_0x3c47630
	void K2_AttachToComponent(struct FNone* Parent, struct FName SocketName, enum class None LocationRule, enum class None RotationRule, enum class None ScaleRule, char bWeldSimulatedBodies); // sub_0x3c47470
	void K2_AttachToActor(struct FNone* ParentActor, struct FName SocketName, enum class None LocationRule, enum class None RotationRule, enum class None ScaleRule, char bWeldSimulatedBodies); // sub_0x3c472b0
	void K2_AttachRootComponentToActor(struct FNone* InParentActor, struct FName InSocketName, char AttachLocationType, char bWeldSimulatedBodies); // sub_0x3c47160
	void K2_AttachRootComponentTo(struct FNone* InParent, struct FName InSocketName, char AttachLocationType, char bWeldSimulatedBodies); // sub_0x3c47010
	void K2_AddActorWorldTransform(struct FNone& DeltaTransform, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3c46e10
	void K2_AddActorWorldRotation(struct FNone DeltaRotation, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3c46c70
	void K2_AddActorWorldOffset(struct FNone DeltaLocation, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3c46ad0
	void K2_AddActorLocalTransform(struct FNone& NewTransform, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3c468d0
	void K2_AddActorLocalRotation(struct FNone DeltaRotation, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3c46730
	void K2_AddActorLocalOffset(struct FNone DeltaLocation, char bSweep, struct FNone& SweepHitResult, char bTeleport); // sub_0x3c46590
	char IsOverlappingActor(struct FNone* Other); // sub_0x3c46500
	char IsChildActor(); // sub_0x3c464d0
	char IsActorTickEnabled(); // sub_0x3c464a0
	char IsActorBeingDestroyed(); // sub_0x3c46470
	char HasAuthority(); // sub_0x3c46440
	float GetVerticalDistanceTo(struct FNone* OtherActor); // sub_0x3c463a0
	struct FNone GetVelocity(); // sub_0x3c46360
	struct FNone GetTransform(); // sub_0x3c46310
	char GetTickableWhenPaused(); // sub_0x3c462e0
	float GetSquaredDistanceTo(struct FNone* OtherActor); // sub_0x3c46240
	char GetRemoteRole(); // sub_0x3c46220
	struct FNone* GetParentComponent(); // sub_0x3c461f0
	struct FNone* GetParentActor(); // sub_0x3c461c0
	struct FNone* GetOwner(); // sub_0x3c461a0
	void GetOverlappingComponents(struct TArray<None>& OverlappingComponents); // sub_0x3c460f0
	void GetOverlappingActors(struct TArray<None>& OverlappingActors, struct FNone* ClassFilter); // sub_0x3c45ff0
	char GetLocalRole(); // sub_0x3c45fd0
	float GetLifeSpan(); // sub_0x3c45f90
	struct FNone* GetInstigatorController(); // sub_0x3c45f60
	struct FNone* GetInstigator(); // sub_0x3c45f30
	struct FNone GetInputVectorAxisValue(struct FNone InputAxisKey); // sub_0x3c45e30
	float GetInputAxisValue(struct FName InputAxisName); // sub_0x3c45d90
	float GetInputAxisKeyValue(struct FNone InputAxisKey); // sub_0x3c45ca0
	float GetHorizontalDotProductTo(struct FNone* OtherActor); // sub_0x3c45c00
	float GetHorizontalDistanceTo(struct FNone* OtherActor); // sub_0x3c45b60
	float GetGameTimeSinceCreation(); // sub_0x3c45b30
	float GetDotProductTo(struct FNone* OtherActor); // sub_0x3c45a90
	float GetDistanceTo(struct FNone* OtherActor); // sub_0x3c459f0
	struct TArray<None> GetComponentsByTag(struct FNone* ComponentClass, struct FName Tag); // sub_0x3c458e0
	struct TArray<None> GetComponentsByInterface(struct FNone* Interface); // sub_0x3c45800
	struct FNone* GetComponentByClass(struct FNone* ComponentClass); // sub_0x3c45770
	struct FName GetAttachParentSocketName(); // sub_0x3c454f0
	void GetAttachParentActors(struct TArray<None>& OutActors); // sub_0x3c45440
	struct FNone* GetAttachParentActorMost(); // sub_0x3c45410
	struct FNone* GetAttachParentActor(); // sub_0x3c453e0
	void GetAttachedActorsRecursive(struct TArray<None>& OutActors, char bIncludeChildActor); // sub_0x3c45670
	void GetAttachedActors(struct TArray<None>& OutActors, char bResetArray, char bIncludeChildActor); // sub_0x3c45530
	void GetAllChildActors(struct TArray<None>& ChildActors, char bIncludeDescendants); // sub_0x3c452e0
	struct FNone GetActorUpVector(); // sub_0x3c45270
	float GetActorTimeDilation(); // sub_0x3c45240
	float GetActorTickInterval(); // sub_0x3c45210
	struct FNone GetActorScale3D(); // sub_0x3c451d0
	struct FNone GetActorRightVector(); // sub_0x3c45160
	struct FNone GetActorRelativeScale3D(); // sub_0x3c45120
	struct FNone GetActorForwardVector(); // sub_0x3c450b0
	void GetActorEyesViewPoint(struct FNone& OutLocation, struct FNone& OutRotation); // sub_0x3c44fc0
	char GetActorEnableCollision(); // sub_0x3c44f90
	void GetActorBounds(char bOnlyCollidingComponents, struct FNone& Origin, struct FNone& BoxExtent, char bIncludeFromChildActors); // sub_0x3c44e10
	void ForceNetUpdate(); // sub_0x3c44df0
	void FlushNetDormancy(); // sub_0x3c44dd0
	void EnableInput(struct FNone* PlayerController); // sub_0x3c44d40
	void DisableInput(struct FNone* PlayerController); // sub_0x3c44cb0
	void DetachRootComponentFromParent(char bMaintainWorldPosition); // sub_0x3c44c20
	void AddTickPrerequisiteComponent(struct FNone* PrerequisiteComponent); // sub_0x3c44b90
	void AddTickPrerequisiteActor(struct FNone* PrerequisiteActor); // sub_0x3c44b00
	struct FNone* AddComponent(struct FName TemplateName, char bManualAttachment, struct FNone& RelativeTransform, struct FNone* ComponentTemplateContext); // sub_0x3c44940
	char ActorHasTag(struct FName Tag); // sub_0x3c448b0
};

// Class Engine.SkeletalMeshActor
// Size: 0x398 (Inherited: 0x310)
struct ASkeletalMeshActor : AActor 
{
	char                                          UnknownData310[0x8];                                         // 0x310(0x08)
	char                                          bShouldDoAnimNotifies : 0;                                   // 0x318(0x01)
	char                                          bWakeOnLevelStart : 0;                                       // 0x318(0x01)
	char                                          UnknownData318[0x8];                                         // 0x318(0x08)
	struct FNone*                                 SkeletalMeshComponent;                                       // 0x320(0x08)
	struct FNone*                                 ReplicatedMesh;                                              // 0x328(0x08)
	struct FNone*                                 ReplicatedPhysAsset;                                         // 0x330(0x08)
	struct FNone*                                 ReplicatedMaterial0;                                         // 0x338(0x08)
	struct FNone*                                 ReplicatedMaterial1;                                         // 0x340(0x08)
	char                                          UnknownData348[0x50];                                        // 0x348(0x50)

	void OnRep_ReplicatedPhysAsset(); // sub_0x1235530
	void OnRep_ReplicatedMesh(); // sub_0x1e42900
	void OnRep_ReplicatedMaterial1(); // sub_0x1f0adc0
	void OnRep_ReplicatedMaterial0(); // sub_0x1f0c650
};

// Class Engine.BlueprintFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBlueprintFunctionLibrary : UObject 
{
};

// Class Engine.PrimitiveComponent
// Size: 0x4c0 (Inherited: 0x240)
struct UPrimitiveComponent : USceneComponent 
{
	float                                         MinDrawDistance;                                             // 0x240(0x04)
	float                                         LDMaxDrawDistance;                                           // 0x244(0x04)
	float                                         CachedMaxDrawDistance;                                       // 0x248(0x04)
	char                                          DepthPriorityGroup;                                          // 0x24c(0x01)
	char                                          ViewOwnerDepthPriorityGroup;                                 // 0x24d(0x01)
	char                                          IndirectLightingCacheQuality;                                // 0x24e(0x01)
	enum class None                               LightmapType;                                                // 0x24f(0x01)
	char                                          bUseMaxLODAsImposter : 0;                                    // 0x250(0x01)
	char                                          bBatchImpostersAsInstances : 0;                              // 0x250(0x01)
	char                                          bNeverDistanceCull : 0;                                      // 0x250(0x01)
	char                                          bAlwaysCreatePhysicsState : 0;                               // 0x250(0x01)
	char                                          UnknownData250[0x1];                                         // 0x250(0x01)
	char                                          bGenerateOverlapEvents : 0;                                  // 0x251(0x01)
	char                                          bMultiBodyOverlap : 0;                                       // 0x251(0x01)
	char                                          bTraceComplexOnMove : 0;                                     // 0x251(0x01)
	char                                          bReturnMaterialOnMove : 0;                                   // 0x251(0x01)
	char                                          bUseViewOwnerDepthPriorityGroup : 0;                         // 0x251(0x01)
	char                                          bAllowCullDistanceVolume : 0;                                // 0x251(0x01)
	char                                          bHasMotionBlurVelocityMeshes : 0;                            // 0x251(0x01)
	char                                          bVisibleInReflectionCaptures : 0;                            // 0x251(0x01)
	char                                          UnknownData251[0x1];                                         // 0x251(0x01)
	char                                          bVisibleInRayTracing : 0;                                    // 0x252(0x01)
	char                                          bRenderInMainPass : 0;                                       // 0x252(0x01)
	char                                          bRenderInDepthPass : 0;                                      // 0x252(0x01)
	char                                          bReceivesDecals : 0;                                         // 0x252(0x01)
	char                                          bOwnerNoSee : 0;                                             // 0x252(0x01)
	char                                          bOnlyOwnerSee : 0;                                           // 0x252(0x01)
	char                                          bIgnoreNearClippingForOcclusion : 0;                         // 0x252(0x01)
	char                                          bTreatAsBackgroundForOcclusion : 0;                          // 0x252(0x01)
	char                                          UnknownData252[0x1];                                         // 0x252(0x01)
	char                                          bUseAsOccluder : 0;                                          // 0x253(0x01)
	char                                          bSelectable : 0;                                             // 0x253(0x01)
	char                                          bForceMipStreaming : 0;                                      // 0x253(0x01)
	char                                          bHasPerInstanceHitProxies : 0;                               // 0x253(0x01)
	char                                          CastShadow : 0;                                              // 0x253(0x01)
	char                                          bAffectDynamicIndirectLighting : 0;                          // 0x253(0x01)
	char                                          bAffectDistanceFieldLighting : 0;                            // 0x253(0x01)
	char                                          bCastDynamicShadow : 0;                                      // 0x253(0x01)
	char                                          UnknownData253[0x1];                                         // 0x253(0x01)
	char                                          bCastStaticShadow : 0;                                       // 0x254(0x01)
	char                                          bCastDirectionalShadow : 0;                                  // 0x254(0x01)
	char                                          bCastVolumetricTranslucentShadow : 0;                        // 0x254(0x01)
	char                                          bSelfShadowOnly : 0;                                         // 0x254(0x01)
	char                                          bCastFarShadow : 0;                                          // 0x254(0x01)
	char                                          bCastInsetShadow : 0;                                        // 0x254(0x01)
	char                                          bCastCinematicShadow : 0;                                    // 0x254(0x01)
	char                                          bCastHiddenShadow : 0;                                       // 0x254(0x01)
	char                                          UnknownData254[0x1];                                         // 0x254(0x01)
	char                                          bCastShadowAsTwoSided : 0;                                   // 0x255(0x01)
	char                                          bLightAsIfStatic : 0;                                        // 0x255(0x01)
	char                                          bLightAttachmentsAsGroup : 0;                                // 0x255(0x01)
	char                                          bExcludeFromLightAttachmentGroup : 0;                        // 0x255(0x01)
	char                                          bReceiveMobileCSMShadows : 0;                                // 0x255(0x01)
	char                                          bSingleSampleShadowFromStationaryLights : 0;                 // 0x255(0x01)
	char                                          bIgnoreRadialImpulse : 0;                                    // 0x255(0x01)
	char                                          bIgnoreRadialForce : 0;                                      // 0x255(0x01)
	char                                          UnknownData255[0x1];                                         // 0x255(0x01)
	char                                          bApplyImpulseOnDamage : 0;                                   // 0x256(0x01)
	char                                          bReplicatePhysicsToAutonomousProxy : 0;                      // 0x256(0x01)
	char                                          bFillCollisionUnderneathForNavmesh : 0;                      // 0x256(0x01)
	char                                          AlwaysLoadOnClient : 0;                                      // 0x256(0x01)
	char                                          AlwaysLoadOnServer : 0;                                      // 0x256(0x01)
	char                                          bUseEditorCompositing : 0;                                   // 0x256(0x01)
	char                                          bRenderCustomDepth : 0;                                      // 0x256(0x01)
	char                                          UnknownData256[0x1];                                         // 0x256(0x01)
	char                                          bHasNoStreamableTextures : 0;                                // 0x257(0x01)
	char                                          UnknownData257[0x1];                                         // 0x257(0x01)
	char                                          bHasCustomNavigableGeometry;                                 // 0x258(0x01)
	char                                          UnknownData259[0x1];                                         // 0x259(0x01)
	char                                          CanCharacterStepUpOn;                                        // 0x25a(0x01)
	struct FNone                                  LightingChannels;                                            // 0x25b(0x01)
	enum class None                               CustomDepthStencilWriteMask;                                 // 0x25c(0x01)
	char                                          UnknownData25D[0x3];                                         // 0x25d(0x03)
	uint32_t                                      CustomDepthStencilValue;                                     // 0x260(0x04)
	char                                          UnknownData264[0x4];                                         // 0x264(0x04)
	struct FNone                                  CustomPrimitiveData;                                         // 0x268(0x10)
	struct FNone                                  CustomPrimitiveDataInternal;                                 // 0x278(0x10)
	uint32_t                                      TranslucencySortPriority;                                    // 0x288(0x04)
	uint32_t                                      VisibilityId;                                                // 0x28c(0x04)
	struct TArray<None>                           RuntimeVirtualTextures;                                      // 0x290(0x10)
	uint8_t                                       VirtualTextureLodBias;                                       // 0x2a0(0x01)
	uint8_t                                       VirtualTextureCullMips;                                      // 0x2a1(0x01)
	uint8_t                                       VirtualTextureMinCoverage;                                   // 0x2a2(0x01)
	enum class None                               VirtualTextureRenderPassType;                                // 0x2a3(0x01)
	char                                          UnknownData2A4[0x4];                                         // 0x2a4(0x04)
	float                                         LpvBiasMultiplier;                                           // 0x2a8(0x04)
	char                                          UnknownData2AC[0x8];                                         // 0x2ac(0x08)
	float                                         BoundsScale;                                                 // 0x2b4(0x04)
	char                                          UnknownData2B8[0x10];                                        // 0x2b8(0x10)
	struct TArray<None>                           MoveIgnoreActors;                                            // 0x2c8(0x10)
	struct TArray<None>                           MoveIgnoreComponents;                                        // 0x2d8(0x10)
	char                                          UnknownData2E8[0x10];                                        // 0x2e8(0x10)
	struct FNone                                  BodyInstance;                                                // 0x2f8(0x190)
	struct FMulticastSparseDelegate               OnComponentHit;                                              // 0x488(0x01)
	struct FMulticastSparseDelegate               OnComponentBeginOverlap;                                     // 0x489(0x01)
	struct FMulticastSparseDelegate               OnComponentEndOverlap;                                       // 0x48a(0x01)
	struct FMulticastSparseDelegate               OnComponentWake;                                             // 0x48b(0x01)
	struct FMulticastSparseDelegate               OnComponentSleep;                                            // 0x48c(0x01)
	char                                          UnknownData48D[0x1];                                         // 0x48d(0x01)
	struct FMulticastSparseDelegate               OnBeginCursorOver;                                           // 0x48e(0x01)
	struct FMulticastSparseDelegate               OnEndCursorOver;                                             // 0x48f(0x01)
	struct FMulticastSparseDelegate               OnClicked;                                                   // 0x490(0x01)
	struct FMulticastSparseDelegate               OnReleased;                                                  // 0x491(0x01)
	struct FMulticastSparseDelegate               OnInputTouchBegin;                                           // 0x492(0x01)
	struct FMulticastSparseDelegate               OnInputTouchEnd;                                             // 0x493(0x01)
	struct FMulticastSparseDelegate               OnInputTouchEnter;                                           // 0x494(0x01)
	struct FMulticastSparseDelegate               OnInputTouchLeave;                                           // 0x495(0x01)
	char                                          UnknownData496[0x1a];                                        // 0x496(0x1a)
	struct FNone*                                 LODParentPrimitive;                                          // 0x4b0(0x08)
	char                                          UnknownData4B8[0x8];                                         // 0x4b8(0x08)

	char WasRecentlyRendered(float Tolerance); // sub_0x3db95d0
	void WakeRigidBody(struct FName BoneName); // sub_0x3db9540
	void WakeAllRigidBodies(); // sub_0x3d983a0
	void SetWalkableSlopeOverride(struct FNone& NewOverride); // sub_0x3db9490
	void SetUseCCD(char InUseCCD, struct FName BoneName); // sub_0x3db93c0
	void SetTranslucentSortPriority(uint32_t NewTranslucentSortPriority); // sub_0x3db9340
	void SetSingleSampleShadowFromStationaryLights(char bNewSingleSampleShadowFromStationaryLights); // sub_0x3db92b0
	void SetSimulatePhysics(char bSimulate); // sub_0x3db9220
	void SetRenderInMainPass(char bValue); // sub_0x3db9190
	void SetRenderCustomDepth(char bValue); // sub_0x3db9100
	void SetReceivesDecals(char bNewReceivesDecals); // sub_0x3db9070
	void SetPhysMaterialOverride(struct FNone* NewPhysMaterial); // sub_0x3db8a40
	void SetPhysicsMaxAngularVelocityInRadians(float NewMaxAngVel, char bAddToCurrent, struct FName BoneName); // sub_0x3db8f60
	void SetPhysicsMaxAngularVelocityInDegrees(float NewMaxAngVel, char bAddToCurrent, struct FName BoneName); // sub_0x3db8e50
	void SetPhysicsMaxAngularVelocity(float NewMaxAngVel, char bAddToCurrent, struct FName BoneName); // sub_0x3db8e50
	void SetPhysicsLinearVelocity(struct FNone NewVel, char bAddToCurrent, struct FName BoneName); // sub_0x3db8d30
	void SetPhysicsAngularVelocityInRadians(struct FNone NewAngVel, char bAddToCurrent, struct FName BoneName); // sub_0x3db8c10
	void SetPhysicsAngularVelocityInDegrees(struct FNone NewAngVel, char bAddToCurrent, struct FName BoneName); // sub_0x3db8ad0
	void SetPhysicsAngularVelocity(struct FNone NewAngVel, char bAddToCurrent, struct FName BoneName); // sub_0x3db8ad0
	void SetOwnerNoSee(char bNewOwnerNoSee); // sub_0x3db89b0
	void SetOnlyOwnerSee(char bNewOnlyOwnerSee); // sub_0x3db8920
	void SetNotifyRigidBodyCollision(char bNewNotifyRigidBodyCollision); // sub_0x3db8890
	void SetMaterialByName(struct FName MaterialSlotName, struct FNone* Material); // sub_0x3db87c0
	void SetMaterial(uint32_t ElementIndex, struct FNone* Material); // sub_0x3db86f0
	void SetMassScale(struct FName BoneName, float InMassScale); // sub_0x3db8620
	void SetMassOverrideInKg(struct FName BoneName, float MassInKg, char bOverrideMass); // sub_0x3db8520
	void SetLinearDamping(float InDamping); // sub_0x3db84a0
	void SetLightingChannels(char bChannel0, char bChannel1, char bChannel2); // sub_0x3db8380
	void SetLightAttachmentsAsGroup(char bInLightAttachmentsAsGroup); // sub_0x3db82f0
	void SetGenerateOverlapEvents(char bInGenerateOverlapEvents); // sub_0x3db8260
	void SetExcludeFromLightAttachmentGroup(char bInExcludeFromLightAttachmentGroup); // sub_0x3db81d0
	void SetEnableGravity(char bGravityEnabled); // sub_0x3db8140
	void SetCustomPrimitiveDataVector4(uint32_t DataIndex, struct FNone Value); // sub_0x3db8070
	void SetCustomPrimitiveDataVector3(uint32_t DataIndex, struct FNone Value); // sub_0x3db7fa0
	void SetCustomPrimitiveDataVector2(uint32_t DataIndex, struct FNone Value); // sub_0x3db7ee0
	void SetCustomPrimitiveDataFloat(uint32_t DataIndex, float Value); // sub_0x3db7e10
	void SetCustomDepthStencilWriteMask(enum class None WriteMaskBit); // sub_0x3db7d90
	void SetCustomDepthStencilValue(uint32_t Value); // sub_0x3db7d10
	void SetCullDistance(float NewCullDistance); // sub_0x3db7c90
	void SetConstraintMode(char ConstraintMode); // sub_0x3db7c10
	void SetCollisionResponseToChannel(char Channel, char NewResponse); // sub_0x3db7b50
	void SetCollisionResponseToAllChannels(char NewResponse); // sub_0x3db7ad0
	void SetCollisionProfileName(struct FName InCollisionProfileName, char bUpdateOverlaps); // sub_0x3db7a00
	void SetCollisionObjectType(char Channel); // sub_0x3db7980
	void SetCollisionEnabled(char NewType); // sub_0x3db7900
	void SetCenterOfMass(struct FNone CenterOfMassOffset, struct FName BoneName); // sub_0x3db7830
	void SetCastShadow(char NewCastShadow); // sub_0x3db77a0
	void SetCastInsetShadow(char bInCastInsetShadow); // sub_0x3db7710
	void SetBoundsScale(float NewBoundsScale); // sub_0x3db7690
	void SetAngularDamping(float InDamping); // sub_0x3db7610
	void SetAllUseCCD(char InUseCCD); // sub_0x3da8ff0
	void SetAllPhysicsLinearVelocity(struct FNone NewVel, char bAddToCurrent); // sub_0x3db7530
	void SetAllPhysicsAngularVelocityInRadians(struct FNone& NewAngVel, char bAddToCurrent); // sub_0x3db7450
	void SetAllPhysicsAngularVelocityInDegrees(struct FNone& NewAngVel, char bAddToCurrent); // sub_0x3db7330
	void SetAllMassScale(float InMassScale); // sub_0x3d97260
	struct FNone ScaleByMomentOfInertia(struct FNone InputVector, struct FName BoneName); // sub_0x3db7230
	void PutRigidBodyToSleep(struct FName BoneName); // sub_0x3db71b0
	char K2_SphereTraceComponent(struct FNone TraceStart, struct FNone TraceEnd, float SphereRadius, char bTraceComplex, char bShowTrace, char bPersistentShowTrace, struct FNone& HitLocation, struct FNone& HitNormal, struct FName& BoneName, struct FNone& OutHit); // sub_0x3db6e20
	char K2_SphereOverlapComponent(struct FNone InSphereCentre, float InSphereRadius, char bTraceComplex, char bShowTrace, char bPersistentShowTrace, struct FNone& HitLocation, struct FNone& HitNormal, struct FName& BoneName, struct FNone& OutHit); // sub_0x3db6ae0
	char K2_LineTraceComponent(struct FNone TraceStart, struct FNone TraceEnd, char bTraceComplex, char bShowTrace, char bPersistentShowTrace, struct FNone& HitLocation, struct FNone& HitNormal, struct FName& BoneName, struct FNone& OutHit); // sub_0x3db6790
	char K2_IsQueryCollisionEnabled(); // sub_0x3db6750
	char K2_IsPhysicsCollisionEnabled(); // sub_0x3db6710
	char K2_IsCollisionEnabled(); // sub_0x3db66d0
	char K2_BoxOverlapComponent(struct FNone InBoxCentre, struct FNone InBox, char bTraceComplex, char bShowTrace, char bPersistentShowTrace, struct FNone& HitLocation, struct FNone& HitNormal, struct FName& BoneName, struct FNone& OutHit); // sub_0x3db6380
	char IsOverlappingComponent(struct FNone* OtherComp); // sub_0x3db62f0
	char IsOverlappingActor(struct FNone* Other); // sub_0x3db6260
	char IsGravityEnabled(); // sub_0x3ca46a0
	char IsAnyRigidBodyAwake(); // sub_0x3db6230
	void IgnoreComponentWhenMoving(struct FNone* Component, char bShouldIgnore); // sub_0x3db6160
	void IgnoreActorWhenMoving(struct FNone* Actor, char bShouldIgnore); // sub_0x3db6090
	struct FNone GetWalkableSlopeOverride(); // sub_0x3db6060
	struct FNone GetPhysicsLinearVelocityAtPoint(struct FNone Point, struct FName BoneName); // sub_0x3db5f70
	struct FNone GetPhysicsLinearVelocity(struct FName BoneName); // sub_0x3db5ed0
	struct FNone GetPhysicsAngularVelocityInRadians(struct FName BoneName); // sub_0x3db5e30
	struct FNone GetPhysicsAngularVelocityInDegrees(struct FName BoneName); // sub_0x3db5d60
	struct FNone GetPhysicsAngularVelocity(struct FName BoneName); // sub_0x3db5d60
	void GetOverlappingComponents(struct TArray<None>& OutOverlappingComponents); // sub_0x3db5cb0
	void GetOverlappingActors(struct TArray<None>& OverlappingActors, struct FNone* ClassFilter); // sub_0x3db5bb0
	uint32_t GetNumMaterials(); // sub_0x3db5b80
	struct FNone* GetMaterialFromCollisionFaceIndex(uint32_t FaceIndex, uint32_t& SectionIndex); // sub_0x3db5aa0
	struct FNone* GetMaterial(uint32_t ElementIndex); // sub_0x3db5a00
	float GetMassScale(struct FName BoneName); // sub_0x3db5960
	float GetMass(); // sub_0x3db5920
	float GetLinearDamping(); // sub_0x3db58e0
	struct FNone GetInertiaTensor(struct FName BoneName); // sub_0x3db5830
	char GetGenerateOverlapEvents(); // sub_0x3db5800
	char GetCollisionResponseToChannel(char Channel); // sub_0x3db5770
	struct FName GetCollisionProfileName(); // sub_0x3db5730
	char GetCollisionObjectType(); // sub_0x3db5700
	char GetCollisionEnabled(); // sub_0x3db56d0
	float GetClosestPointOnCollision(struct FNone& Point, struct FNone& OutPointOnBody, struct FName BoneName); // sub_0x3db5590
	struct FNone GetCenterOfMass(struct FName BoneName); // sub_0x3db54f0
	float GetAngularDamping(); // sub_0x3db54b0
	struct FNone* CreateDynamicMaterialInstance(uint32_t ElementIndex, struct FNone* SourceMaterial, struct FName OptionalName); // sub_0x3db53a0
	struct FNone* CreateAndSetMaterialInstanceDynamicFromMaterial(uint32_t ElementIndex, struct FNone* Parent); // sub_0x3db52d0
	struct FNone* CreateAndSetMaterialInstanceDynamic(uint32_t ElementIndex); // sub_0x3db5230
	struct TArray<None> CopyArrayOfMoveIgnoreComponents(); // sub_0x3db51b0
	struct TArray<None> CopyArrayOfMoveIgnoreActors(); // sub_0x3db5130
	void ClearMoveIgnoreComponents(); // sub_0x3db5100
	void ClearMoveIgnoreActors(); // sub_0x3db50e0
	char CanCharacterStepUp(struct FNone* Pawn); // sub_0x3db5040
	void AddTorqueInRadians(struct FNone Torque, struct FName BoneName, char bAccelChange); // sub_0x3db4de0
	void AddTorqueInDegrees(struct FNone Torque, struct FName BoneName, char bAccelChange); // sub_0x3db4f00
	void AddTorque(struct FNone Torque, struct FName BoneName, char bAccelChange); // sub_0x3db4de0
	void AddRadialImpulse(struct FNone Origin, float Radius, float Strength, char Falloff, char bVelChange); // sub_0x3db4c20
	void AddRadialForce(struct FNone Origin, float Radius, float Strength, char Falloff, char bAccelChange); // sub_0x3db4a60
	void AddImpulseAtLocation(struct FNone Impulse, struct FNone Location, struct FName BoneName); // sub_0x3db4930
	void AddImpulse(struct FNone Impulse, struct FName BoneName, char bVelChange); // sub_0x3db4810
	void AddForceAtLocationLocal(struct FNone Force, struct FNone Location, struct FName BoneName); // sub_0x3db46e0
	void AddForceAtLocation(struct FNone Force, struct FNone Location, struct FName BoneName); // sub_0x3db45b0
	void AddForce(struct FNone Force, struct FName BoneName, char bAccelChange); // sub_0x3db4490
	void AddAngularImpulseInRadians(struct FNone Impulse, struct FName BoneName, char bVelChange); // sub_0x3db4370
	void AddAngularImpulseInDegrees(struct FNone Impulse, struct FName BoneName, char bVelChange); // sub_0x3db4230
	void AddAngularImpulse(struct FNone Impulse, struct FName BoneName, char bVelChange); // sub_0x3db4110
};

// Class Engine.MeshComponent
// Size: 0x4f0 (Inherited: 0x4c0)
struct UMeshComponent : UPrimitiveComponent 
{
	float                                         MipStreamingScale;                                           // 0x4b8(0x04)
	struct TArray<None>                           OverrideMaterials;                                           // 0x4c0(0x10)
	char                                          UnknownData4D4[0xc];                                         // 0x4d4(0x0c)
	char                                          bEnableMaterialParameterCaching : 0;                         // 0x4e0(0x01)
	char                                          UnknownData4E0[0x10];                                        // 0x4e0(0x10)

	void SetVectorParameterValueOnMaterials(struct FName ParameterName, struct FNone ParameterValue); // sub_0x3d71580
	void SetScalarParameterValueOnMaterials(struct FName ParameterName, float ParameterValue); // sub_0x3d714b0
	void SetColorParameterValueOnMaterials(struct FName ParameterName, struct FNone ParameterValue); // sub_0x3d71280
	void PrestreamTextures(float Seconds, char bPrioritizeCharacterTextures, uint32_t CinematicTextureGroups); // sub_0x3d71170
	char IsMaterialSlotNameValid(struct FName MaterialSlotName); // sub_0x3d710d0
	struct TArray<None> GetMaterialSlotNames(); // sub_0x3d70fd0
	struct TArray<None> GetMaterials(); // sub_0x3d71050
	uint32_t GetMaterialIndex(struct FName MaterialSlotName); // sub_0x3d70f30
};

// Class Engine.SkinnedMeshComponent
// Size: 0x700 (Inherited: 0x4f0)
struct USkinnedMeshComponent : UMeshComponent 
{
	struct FNone*                                 SkeletalMesh;                                                // 0x4e8(0x08)
	struct TWeakObjectPtr<struct FNone>           MasterPoseComponent;                                         // 0x4f0(0x08)
	struct TArray<None>                           SkinCacheUsage;                                              // 0x4f8(0x10)
	char                                          UnknownData510[0xf0];                                        // 0x510(0xf0)
	struct FNone*                                 PhysicsAssetOverride;                                        // 0x600(0x08)
	uint32_t                                      ForcedLodModel;                                              // 0x608(0x04)
	uint32_t                                      MinLodModel;                                                 // 0x60c(0x04)
	char                                          UnknownData610[0x8];                                         // 0x610(0x08)
	float                                         StreamingDistanceMultiplier;                                 // 0x618(0x04)
	char                                          UnknownData61C[0xc];                                         // 0x61c(0x0c)
	struct TArray<None>                           LODInfo;                                                     // 0x628(0x10)
	char                                          UnknownData638[0x24];                                        // 0x638(0x24)
	enum class None                               VisibilityBasedAnimTickOption;                               // 0x65c(0x01)
	char                                          UnknownData65D[0x1];                                         // 0x65d(0x01)
	char                                          bOverrideMinLod : 0;                                         // 0x65e(0x01)
	char                                          bUseBoundsFromMasterPoseComponent : 0;                       // 0x65e(0x01)
	char                                          bForceWireframe : 0;                                         // 0x65e(0x01)
	char                                          bDisplayBones : 0;                                           // 0x65e(0x01)
	char                                          bDisableMorphTarget : 0;                                     // 0x65e(0x01)
	char                                          bHideSkin : 0;                                               // 0x65e(0x01)
	char                                          UnknownData65E[0x1];                                         // 0x65e(0x01)
	char                                          bPerBoneMotionBlur : 0;                                      // 0x65f(0x01)
	char                                          bComponentUseFixedSkelBounds : 0;                            // 0x65f(0x01)
	char                                          bConsiderAllBodiesForBounds : 0;                             // 0x65f(0x01)
	char                                          bSyncAttachParentLOD : 0;                                    // 0x65f(0x01)
	char                                          bCanHighlightSelectedSections : 0;                           // 0x65f(0x01)
	char                                          bRecentlyRendered : 0;                                       // 0x65f(0x01)
	char                                          bCastCapsuleDirectShadow : 0;                                // 0x65f(0x01)
	char                                          bCastCapsuleIndirectShadow : 0;                              // 0x65f(0x01)
	char                                          UnknownData65F[0x1];                                         // 0x65f(0x01)
	char                                          bCPUSkinning : 0;                                            // 0x660(0x01)
	char                                          bEnableUpdateRateOptimizations : 0;                          // 0x660(0x01)
	char                                          bDisplayDebugUpdateRateOptimizations : 0;                    // 0x660(0x01)
	char                                          bRenderStatic : 0;                                           // 0x660(0x01)
	char                                          bIgnoreMasterPoseComponentLOD : 0;                           // 0x660(0x01)
	char                                          bCachedLocalBoundsUpToDate : 0;                              // 0x660(0x01)
	char                                          UnknownData660[0x1];                                         // 0x660(0x01)
	char                                          bForceMeshObjectUpdate : 0;                                  // 0x661(0x01)
	char                                          UnknownData661[0x3];                                         // 0x661(0x03)
	float                                         CapsuleIndirectShadowMinVisibility;                          // 0x664(0x04)
	char                                          UnknownData668[0x10];                                        // 0x668(0x10)
	struct FNone                                  CachedWorldSpaceBounds;                                      // 0x678(0x1c)
	char                                          UnknownData694[0xc];                                         // 0x694(0x0c)
	struct FNone                                  CachedWorldToLocalTransform;                                 // 0x6a0(0x40)
	char                                          UnknownData6E0[0x20];                                        // 0x6e0(0x20)

	void UnloadSkinWeightProfile(struct FName InProfileName); // sub_0x3ddfb90
	void UnHideBoneByName(struct FName BoneName); // sub_0x3ddfb10
	void TransformToBoneSpace(struct FName BoneName, struct FNone InPosition, struct FNone InRotation, struct FNone& OutPosition, struct FNone& OutRotation); // sub_0x3ddf950
	void TransformFromBoneSpace(struct FName BoneName, struct FNone InPosition, struct FNone InRotation, struct FNone& OutPosition, struct FNone& OutRotation); // sub_0x3ddf790
	void ShowMaterialSection(uint32_t MaterialID, uint32_t SectionIndex, char bShow, uint32_t LODIndex); // sub_0x3ddf650
	void ShowAllMaterialSections(uint32_t LODIndex); // sub_0x3ddf5d0
	void SetVertexColorOverride_LinearColor(uint32_t LODIndex, struct TArray<None>& VertexColors); // sub_0x3ddf4e0
	char SetSkinWeightProfile(struct FName InProfileName); // sub_0x3ddf450
	void SetSkinWeightOverride(uint32_t LODIndex, struct TArray<None>& SkinWeights); // sub_0x3ddf360
	void SetSkeletalMesh(struct FNone* NewMesh, char bReinitPose); // sub_0x3ddf290
	void SetRenderStatic(char bNewValue); // sub_0x3ddf200
	void SetPhysicsAsset(struct FNone* NewPhysicsAsset, char bForceReInit); // sub_0x3ddf130
	void SetMinLOD(uint32_t InNewMinLOD); // sub_0x3ddf0b0
	void SetMasterPoseComponent(struct FNone* NewMasterBoneComponent, char bForceUpdate); // sub_0x3ddefe0
	void SetForcedLOD(uint32_t InNewForcedLOD); // sub_0x3ddef60
	void SetCastCapsuleIndirectShadow(char bNewValue); // sub_0x3ddeed0
	void SetCastCapsuleDirectShadow(char bNewValue); // sub_0x3ddee40
	void SetCapsuleIndirectShadowMinVisibility(float NewValue); // sub_0x3ddedc0
	char IsUsingSkinWeightProfile(); // sub_0x3dded90
	char IsMaterialSectionShown(uint32_t MaterialID, uint32_t LODIndex); // sub_0x3ddecd0
	char IsBoneHiddenByName(struct FName BoneName); // sub_0x3ddec40
	void HideBoneByName(struct FName BoneName, char PhysBodyOption); // sub_0x3ddea60
	char GetTwistAndSwingAngleOfDeltaRotationFromRefPose(struct FName BoneName, float& OutTwistAngle, float& OutSwingAngle); // sub_0x3dde940
	struct FName GetSocketBoneName(struct FName InSocketName); // sub_0x3dde810
	struct FNone GetRefPosePosition(uint32_t BoneIndex); // sub_0x3dde770
	struct FName GetParentBone(struct FName BoneName); // sub_0x3dde6e0
	uint32_t GetNumLODs(); // sub_0x3dde6b0
	uint32_t GetNumBones(); // sub_0x3dde680
	uint32_t GetForcedLOD(); // sub_0x3dde650
	struct FNone GetDeltaTransformFromRefPose(struct FName BoneName, struct FName BaseName); // sub_0x3dde550
	struct FName GetCurrentSkinWeightProfileName(); // sub_0x3dde530
	struct FName GetBoneName(uint32_t BoneIndex); // sub_0x3dde4a0
	uint32_t GetBoneIndex(struct FName BoneName); // sub_0x3dde410
	struct FName FindClosestBone_K2(struct FNone TestLocation, struct FNone& BoneLocation, float IgnoreScale, char bRequirePhysicsAsset); // sub_0x3dde280
	void ClearVertexColorOverride(uint32_t LODIndex); // sub_0x3dde200
	void ClearSkinWeightProfile(); // sub_0x3dde1e0
	void ClearSkinWeightOverride(uint32_t LODIndex); // sub_0x3dde160
	char BoneIsChildOf(struct FName BoneName, struct FName ParentBoneName); // sub_0x3dde0a0
};

// Class Engine.StreamableRenderAsset
// Size: 0x40 (Inherited: 0x28)
struct UStreamableRenderAsset : UObject 
{
	double                                        ForceMipLevelsToBeResidentTimestamp;                         // 0x28(0x08)
	uint32_t                                      NumCinematicMipLevels;                                       // 0x30(0x04)
	uint32_t                                      StreamingIndex;                                              // 0x34(0x04)
	uint32_t                                      CachedCombinedLODBias;                                       // 0x38(0x04)
	char                                          CachedNumResidentLODs;                                       // 0x3c(0x01)
	char                                          bCachedReadyForStreaming : 0;                                // 0x3d(0x01)
	char                                          NeverStream : 0;                                             // 0x3d(0x01)
	char                                          bGlobalForceMipLevelsToBeResident : 0;                       // 0x3d(0x01)
	char                                          bIsStreamable : 0;                                           // 0x3d(0x01)
	char                                          bHasStreamingUpdatePending : 0;                              // 0x3d(0x01)
	char                                          bForceMiplevelsToBeResident : 0;                             // 0x3d(0x01)
	char                                          bIgnoreStreamingMipBias : 0;                                 // 0x3d(0x01)
	char                                          bUseCinematicMipLevels : 0;                                  // 0x3d(0x01)
	char                                          UnknownData3D[0x3];                                          // 0x3d(0x03)
};

// Class Engine.SkeletalMesh
// Size: 0x380 (Inherited: 0x40)
struct USkeletalMesh : UStreamableRenderAsset 
{
	char                                          UnknownData40[0x20];                                         // 0x40(0x20)
	struct FNone*                                 Skeleton;                                                    // 0x60(0x08)
	struct FNone                                  ImportedBounds;                                              // 0x68(0x1c)
	struct FNone                                  ExtendedBounds;                                              // 0x84(0x1c)
	struct FNone                                  PositiveBoundsExtension;                                     // 0xa0(0x0c)
	struct FNone                                  NegativeBoundsExtension;                                     // 0xac(0x0c)
	struct TArray<None>                           Materials;                                                   // 0xb8(0x10)
	struct TArray<None>                           SkelMirrorTable;                                             // 0xc8(0x10)
	struct TArray<None>                           LODInfo;                                                     // 0xd8(0x10)
	char                                          UnknownDataE8[0x50];                                         // 0xe8(0x50)
	struct FNone                                  MinLOD;                                                      // 0x138(0x04)
	struct FNone                                  DisableBelowMinLodStripping;                                 // 0x13c(0x01)
	char                                          SkelMirrorAxis;                                              // 0x13d(0x01)
	char                                          SkelMirrorFlipAxis;                                          // 0x13e(0x01)
	char                                          bUseFullPrecisionUVs : 0;                                    // 0x13f(0x01)
	char                                          bUseHighPrecisionTangentBasis : 0;                           // 0x13f(0x01)
	char                                          bHasBeenSimplified : 0;                                      // 0x13f(0x01)
	char                                          bHasVertexColors : 0;                                        // 0x13f(0x01)
	char                                          bEnablePerPolyCollision : 0;                                 // 0x13f(0x01)
	char                                          UnknownData13F[0x1];                                         // 0x13f(0x01)
	struct FNone*                                 BodySetup;                                                   // 0x140(0x08)
	struct FNone*                                 PhysicsAsset;                                                // 0x148(0x08)
	struct FNone*                                 ShadowPhysicsAsset;                                          // 0x150(0x08)
	struct TArray<None>                           NodeMappingData;                                             // 0x158(0x10)
	struct TArray<None>                           MorphTargets;                                                // 0x168(0x10)
	char                                          UnknownData178[0x178];                                       // 0x178(0x178)
	struct FNone*                                 PostProcessAnimBlueprint;                                    // 0x2f0(0x08)
	struct TArray<None>                           MeshClothingAssets;                                          // 0x2f8(0x10)
	struct FNone                                  SamplingInfo;                                                // 0x308(0x30)
	struct TArray<None>                           AssetUserData;                                               // 0x338(0x10)
	char                                          UnknownData348[0x8];                                         // 0x348(0x08)
	struct TArray<None>                           Sockets;                                                     // 0x350(0x10)
	char                                          UnknownData360[0x10];                                        // 0x360(0x10)
	struct TArray<None>                           SkinWeightProfiles;                                          // 0x370(0x10)

	void SetLODSettings(struct FNone* InLODSettings); // sub_0x16b20c0
	uint32_t NumSockets(); // sub_0x3dd1cc0
	struct TArray<None> K2_GetAllMorphTargetNames(); // sub_0x3dd1be0
	char IsSectionUsingCloth(uint32_t InSectionIndex, char bCheckCorrespondingSections); // sub_0x3dd1b20
	struct FNone* GetSocketByIndex(uint32_t Index); // sub_0x3dd1a90
	struct FNone* GetNodeMappingContainer(struct FNone* SourceAsset); // sub_0x3dd1a00
	struct FNone GetImportedBounds(); // sub_0x3dd19b0
	struct FNone GetBounds(); // sub_0x3dd1960
	struct FNone* FindSocketInfo(struct FName InSocketName, struct FNone& OutTransform, uint32_t& OutBoneIndex, uint32_t& OutIndex); // sub_0x3dd1790
	struct FNone* FindSocketAndIndex(struct FName InSocketName, uint32_t& OutIndex); // sub_0x3dd16c0
	struct FNone* FindSocket(struct FName InSocketName); // sub_0x3dd1630
};

// Class Engine.StaticMeshActor
// Size: 0x320 (Inherited: 0x310)
struct AStaticMeshActor : AActor 
{
	struct FNone*                                 StaticMeshComponent;                                         // 0x310(0x08)
	char                                          bStaticMeshReplicateMovement : 0;                            // 0x318(0x01)
	char                                          UnknownData318[0x1];                                         // 0x318(0x01)
	enum class None                               NavigationGeometryGatheringMode;                             // 0x319(0x01)
	char                                          UnknownData31A[0x6];                                         // 0x31a(0x06)

	void SetMobility(char InMobility); // sub_0x124b1c0
};

// Class Engine.Texture
// Size: 0xb8 (Inherited: 0x40)
struct UTexture : UStreamableRenderAsset 
{
	char                                          UnknownData40[0x8];                                          // 0x40(0x08)
	struct FNone                                  LightingGuid;                                                // 0x48(0x10)
	uint32_t                                      LODBias;                                                     // 0x58(0x04)
	char                                          CompressionSettings;                                         // 0x5c(0x01)
	char                                          Filter;                                                      // 0x5d(0x01)
	enum class None                               MipLoadOptions;                                              // 0x5e(0x01)
	char                                          LODGroup;                                                    // 0x5f(0x01)
	char                                          SRGB : 0;                                                    // 0x60(0x01)
	char                                          bNoTiling : 0;                                               // 0x60(0x01)
	char                                          VirtualTextureStreaming : 0;                                 // 0x60(0x01)
	char                                          CompressionYCoCg : 0;                                        // 0x60(0x01)
	char                                          bAsyncResourceReleaseHasBeenStarted : 0;                     // 0x60(0x01)
	char                                          UnknownData60[0x8];                                          // 0x60(0x08)
	struct TArray<None>                           AssetUserData;                                               // 0x68(0x10)
	char                                          UnknownData78[0x40];                                         // 0x78(0x40)
};

// Class Engine.Texture2DDynamic
// Size: 0xd0 (Inherited: 0xb8)
struct UTexture2DDynamic : UTexture 
{
	char                                          UnknownDataB8[0x8];                                          // 0xb8(0x08)
	char                                          Format;                                                      // 0xc0(0x01)
	char                                          UnknownDataC1[0xf];                                          // 0xc1(0x0f)
};

// Class Engine.HUD
// Size: 0x400 (Inherited: 0x310)
struct AHUD : AActor 
{
	struct FNone*                                 PlayerOwner;                                                 // 0x310(0x08)
	char                                          bLostFocusPaused : 0;                                        // 0x318(0x01)
	char                                          bShowHUD : 0;                                                // 0x318(0x01)
	char                                          bShowDebugInfo : 0;                                          // 0x318(0x01)
	char                                          UnknownData318[0x4];                                         // 0x318(0x04)
	uint32_t                                      CurrentTargetIndex;                                          // 0x31c(0x04)
	char                                          bShowHitBoxDebugInfo : 0;                                    // 0x320(0x01)
	char                                          bShowOverlays : 0;                                           // 0x320(0x01)
	char                                          bEnableDebugTextShadow : 0;                                  // 0x320(0x01)
	char                                          UnknownData320[0x8];                                         // 0x320(0x08)
	struct TArray<None>                           PostRenderedActors;                                          // 0x328(0x10)
	char                                          UnknownData338[0x8];                                         // 0x338(0x08)
	struct TArray<None>                           DebugDisplay;                                                // 0x340(0x10)
	struct TArray<None>                           ToggledDebugCategories;                                      // 0x350(0x10)
	struct FNone*                                 Canvas;                                                      // 0x360(0x08)
	struct FNone*                                 DebugCanvas;                                                 // 0x368(0x08)
	struct TArray<None>                           DebugTextList;                                               // 0x370(0x10)
	struct FNone*                                 ShowDebugTargetDesiredClass;                                 // 0x380(0x08)
	struct FNone*                                 ShowDebugTargetActor;                                        // 0x388(0x08)
	char                                          UnknownData390[0x70];                                        // 0x390(0x70)

	void ShowHUD(); // sub_0x1e42900
	void ShowDebugToggleSubCategory(struct FName Category); // sub_0x3ce06f0
	void ShowDebugForReticleTargetToggle(struct FNone* DesiredClass); // sub_0x3ce0670
	void ShowDebug(struct FName DebugType); // sub_0x1e67970
	void RemoveDebugText(struct FNone* SrcActor, char bLeaveDurationText); // sub_0x3ce0450
	void RemoveAllDebugStrings(); // sub_0x3ce0430
	void ReceiveHitBoxRelease(struct FName BoxName); // sub_0x239bfb0
	void ReceiveHitBoxEndCursorOver(struct FName BoxName); // sub_0x239bfb0
	void ReceiveHitBoxClick(struct FName BoxName); // sub_0x239bfb0
	void ReceiveHitBoxBeginCursorOver(struct FName BoxName); // sub_0x239bfb0
	void ReceiveDrawHUD(uint32_t SizeX, uint32_t SizeY); // sub_0x239bfb0
	struct FNone Project(struct FNone Location); // sub_0x3ce0380
	void PreviousDebugTarget(); // sub_0x1f9a560
	void NextDebugTarget(); // sub_0x11cafb0
	void GetTextSize(struct FString Text, float& OutWidth, float& OutHeight, struct FNone* Font, float Scale); // sub_0x3ce0080
	struct FNone* GetOwningPlayerController(); // sub_0x16cf7d0
	struct FNone* GetOwningPawn(); // sub_0x3ce0050
	void GetActorsInSelectionRectangle(struct FNone* ClassFilter, struct FNone& FirstPoint, struct FNone& SecondPoint, struct TArray<None>& OutActors, char bIncludeNonCollidingComponents, char bActorMustBeFullyEnclosed); // sub_0x3cdfe40
	void DrawTextureSimple(struct FNone* Texture, float ScreenX, float ScreenY, float Scale, char bScalePosition); // sub_0x3cdfcb0
	void DrawTexture(struct FNone* Texture, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float TextureU, float TextureV, float TextureUWidth, float TextureVHeight, struct FNone TintColor, char BlendMode, float Scale, char bScalePosition, float Rotation, struct FNone RotPivot); // sub_0x3cdf890
	void DrawText(struct FString Text, struct FNone TextColor, float ScreenX, float ScreenY, struct FNone* Font, float Scale, char bScalePosition); // sub_0x3cdf660
	void DrawRect(struct FNone RectColor, float ScreenX, float ScreenY, float ScreenW, float ScreenH); // sub_0x3cdf4b0
	void DrawMaterialTriangle(struct FNone* Material, struct FNone V0_Pos, struct FNone V1_Pos, struct FNone V2_Pos, struct FNone V0_UV, struct FNone V1_UV, struct FNone V2_UV, struct FNone V0_Color, struct FNone V1_Color, struct FNone V2_Color); // sub_0x3cdf1f0
	void DrawMaterialSimple(struct FNone* Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float Scale, char bScalePosition); // sub_0x3cdeff0
	void DrawMaterial(struct FNone* Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float MaterialU, float MaterialV, float MaterialUWidth, float MaterialVHeight, float Scale, char bScalePosition, float Rotation, struct FNone RotPivot); // sub_0x3cdec60
	void DrawLine(float StartScreenX, float StartScreenY, float EndScreenX, float EndScreenY, struct FNone LineColor, float LineThickness); // sub_0x3cdea80
	void Deproject(float ScreenX, float ScreenY, struct FNone& WorldPosition, struct FNone& WorldDirection); // sub_0x3cde880
	void AddHitBox(struct FNone Position, struct FNone Size, struct FName InName, char bConsumesInput, uint32_t Priority); // sub_0x3cde6f0
	void AddDebugText(struct FString DebugText, struct FNone* SrcActor, float Duration, struct FNone Offset, struct FNone DesiredOffset, struct FNone TextColor, char bSkipOverwriteCheck, char bAbsoluteLocation, char bKeepAttachedToActor, struct FNone* InFont, float FontScale, char bDrawShadow); // sub_0x3cde350
};

// Class Engine.Player
// Size: 0x48 (Inherited: 0x28)
struct UPlayer : UObject 
{
	char                                          UnknownData28[0x8];                                          // 0x28(0x08)
	struct FNone*                                 PlayerController;                                            // 0x30(0x08)
	uint32_t                                      CurrentNetSpeed;                                             // 0x38(0x04)
	uint32_t                                      ConfiguredInternetSpeed;                                     // 0x3c(0x04)
	uint32_t                                      ConfiguredLanSpeed;                                          // 0x40(0x04)
	char                                          UnknownData44[0x4];                                          // 0x44(0x04)
};

// Class Engine.MKNetConnectionEx
// Size: 0xb8 (Inherited: 0x48)
struct UMKNetConnectionEx : UPlayer 
{
	char                                          UnknownData48[0x68];                                         // 0x48(0x68)
	struct FNone*                                 SelfNetConnection;                                           // 0xb0(0x08)
};

// Class Engine.NetConnection
// Size: 0x1aa0 (Inherited: 0xb8)
struct UNetConnection : UMKNetConnectionEx 
{
	struct TArray<None>                           Children;                                                    // 0xb8(0x10)
	struct FNone*                                 Driver;                                                      // 0xc8(0x08)
	struct FNone*                                 PackageMapClass;                                             // 0xd0(0x08)
	struct FNone*                                 PackageMap;                                                  // 0xd8(0x08)
	struct TArray<None>                           OpenChannels;                                                // 0xe0(0x10)
	struct TArray<None>                           SentTemporaries;                                             // 0xf0(0x10)
	struct FNone*                                 ViewTarget;                                                  // 0x100(0x08)
	struct FNone*                                 OwningActor;                                                 // 0x108(0x08)
	uint32_t                                      MaxPacket;                                                   // 0x110(0x04)
	char                                          InternalAck : 0;                                             // 0x114(0x01)
	char                                          UnknownData114[0xbc];                                        // 0x114(0xbc)
	struct FNone                                  PlayerId;                                                    // 0x1d0(0x28)
	char                                          UnknownData1F8[0x48];                                        // 0x1f8(0x48)
	double                                        LastReceiveTime;                                             // 0x240(0x08)
	char                                          UnknownData248[0x1338];                                      // 0x248(0x1338)
	struct TArray<None>                           ChannelsToTick;                                              // 0x1580(0x10)
	char                                          UnknownData1590[0x510];                                      // 0x1590(0x510)
};

// Class Engine.NetDriver
// Size: 0x748 (Inherited: 0x28)
struct UNetDriver : UObject 
{
	char                                          UnknownData28[0x8];                                          // 0x28(0x08)
	struct FString                                NetConnectionClassName;                                      // 0x30(0x10)
	struct FString                                ReplicationDriverClassName;                                  // 0x40(0x10)
	uint32_t                                      MaxDownloadSize;                                             // 0x50(0x04)
	char                                          bClampListenServerTickRate : 0;                              // 0x54(0x01)
	char                                          UnknownData54[0x4];                                          // 0x54(0x04)
	uint32_t                                      NetServerMaxTickRate;                                        // 0x58(0x04)
	uint32_t                                      MaxNetTickRate;                                              // 0x5c(0x04)
	uint32_t                                      MaxInternetClientRate;                                       // 0x60(0x04)
	uint32_t                                      MaxClientRate;                                               // 0x64(0x04)
	float                                         ServerTravelPause;                                           // 0x68(0x04)
	float                                         SpawnPrioritySeconds;                                        // 0x6c(0x04)
	float                                         RelevantTimeout;                                             // 0x70(0x04)
	float                                         KeepAliveTime;                                               // 0x74(0x04)
	float                                         InitialConnectTimeout;                                       // 0x78(0x04)
	float                                         ConnectionTimeout;                                           // 0x7c(0x04)
	float                                         TimeoutMultiplierForUnoptimizedBuilds;                       // 0x80(0x04)
	char                                          bNoTimeouts : 0;                                             // 0x84(0x01)
	char                                          UnknownData84[0x1];                                          // 0x84(0x01)
	char                                          bNeverApplyNetworkEmulationSettings : 0;                     // 0x85(0x01)
	char                                          UnknownData85[0x3];                                          // 0x85(0x03)
	struct FNone*                                 ServerConnection;                                            // 0x88(0x08)
	struct TArray<None>                           ClientConnections;                                           // 0x90(0x10)
	char                                          UnknownDataA0[0x60];                                         // 0xa0(0x60)
	uint32_t                                      RecentlyDisconnectedTrackingTime;                            // 0x100(0x04)
	char                                          UnknownData104[0x3c];                                        // 0x104(0x3c)
	struct FNone*                                 World;                                                       // 0x140(0x08)
	struct FNone*                                 WorldPackage;                                                // 0x148(0x08)
	char                                          UnknownData150[0x20];                                        // 0x150(0x20)
	struct FNone*                                 NetConnectionClass;                                          // 0x170(0x08)
	struct FNone*                                 ReplicationDriverClass;                                      // 0x178(0x08)
	char                                          UnknownData180[0x10];                                        // 0x180(0x10)
	struct FName                                  NetDriverName;                                               // 0x190(0x08)
	struct TArray<None>                           ChannelDefinitions;                                          // 0x198(0x10)
	struct TMap<None, None>                       ChannelDefinitionMap;                                        // 0x1a8(0x50)
	struct TArray<None>                           ActorChannelPool;                                            // 0x1f8(0x10)
	char                                          UnknownData208[0x8];                                         // 0x208(0x08)
	float                                         Time;                                                        // 0x210(0x04)
	char                                          UnknownData214[0x4d4];                                       // 0x214(0x4d4)
	struct FNone*                                 ReplicationDriver;                                           // 0x6e8(0x08)
	char                                          UnknownData6F0[0x58];                                        // 0x6f0(0x58)
};

// Class Engine.BlueprintAsyncActionBase
// Size: 0x30 (Inherited: 0x28)
struct UBlueprintAsyncActionBase : UObject 
{
	char                                          UnknownData28[0x8];                                          // 0x28(0x08)

	void Activate(); // sub_0x2ecb6f0
};

// Class Engine.OnlineBlueprintCallProxyBase
// Size: 0x30 (Inherited: 0x30)
struct UOnlineBlueprintCallProxyBase : UBlueprintAsyncActionBase 
{
};

// Class Engine.OnlineEngineInterface
// Size: 0x28 (Inherited: 0x28)
struct UOnlineEngineInterface : UObject 
{
};

// Class Engine.DeveloperSettings
// Size: 0x38 (Inherited: 0x28)
struct UDeveloperSettings : UObject 
{
	char                                          UnknownData28[0x10];                                         // 0x28(0x10)
};

// Class Engine.OnlineSession
// Size: 0x28 (Inherited: 0x28)
struct UOnlineSession : UObject 
{
};

// Class Engine.Engine
// Size: 0xde8 (Inherited: 0x28)
struct UEngine : UObject 
{
	char                                          UnknownData28[0x8];                                          // 0x28(0x08)
	struct FNone*                                 TinyFont;                                                    // 0x30(0x08)
	struct FNone                                  TinyFontName;                                                // 0x38(0x18)
	struct FNone*                                 SmallFont;                                                   // 0x50(0x08)
	struct FNone                                  SmallFontName;                                               // 0x58(0x18)
	struct FNone*                                 MediumFont;                                                  // 0x70(0x08)
	struct FNone                                  MediumFontName;                                              // 0x78(0x18)
	struct FNone*                                 LargeFont;                                                   // 0x90(0x08)
	struct FNone                                  LargeFontName;                                               // 0x98(0x18)
	struct FNone*                                 SubtitleFont;                                                // 0xb0(0x08)
	struct FNone                                  SubtitleFontName;                                            // 0xb8(0x18)
	struct TArray<None>                           AdditionalFonts;                                             // 0xd0(0x10)
	char                                          UnknownDataE0[0x8];                                          // 0xe0(0x08)
	struct TArray<None>                           AdditionalFontNames;                                         // 0xe8(0x10)
	struct FNone*                                 ConsoleClass;                                                // 0xf8(0x08)
	struct FNone                                  ConsoleClassName;                                            // 0x100(0x18)
	struct FNone*                                 GameViewportClientClass;                                     // 0x118(0x08)
	struct FNone                                  GameViewportClientClassName;                                 // 0x120(0x18)
	struct FNone*                                 LocalPlayerClass;                                            // 0x138(0x08)
	struct FNone                                  LocalPlayerClassName;                                        // 0x140(0x18)
	struct FNone*                                 WorldSettingsClass;                                          // 0x158(0x08)
	struct FNone                                  WorldSettingsClassName;                                      // 0x160(0x18)
	struct FNone                                  NavigationSystemClassName;                                   // 0x178(0x18)
	struct FNone*                                 NavigationSystemClass;                                       // 0x190(0x08)
	struct FNone                                  NavigationSystemConfigClassName;                             // 0x198(0x18)
	struct FNone*                                 NavigationSystemConfigClass;                                 // 0x1b0(0x08)
	struct FNone                                  AvoidanceManagerClassName;                                   // 0x1b8(0x18)
	struct FNone*                                 AvoidanceManagerClass;                                       // 0x1d0(0x08)
	struct FNone*                                 PhysicsCollisionHandlerClass;                                // 0x1d8(0x08)
	struct FNone                                  PhysicsCollisionHandlerClassName;                            // 0x1e0(0x18)
	struct FNone                                  GameUserSettingsClassName;                                   // 0x1f8(0x18)
	struct FNone*                                 GameUserSettingsClass;                                       // 0x210(0x08)
	struct FNone                                  AIControllerClassName;                                       // 0x218(0x18)
	struct FNone*                                 GameUserSettings;                                            // 0x230(0x08)
	struct FNone*                                 LevelScriptActorClass;                                       // 0x238(0x08)
	struct FNone                                  LevelScriptActorClassName;                                   // 0x240(0x18)
	struct FNone                                  DefaultBlueprintBaseClassName;                               // 0x258(0x18)
	struct FNone                                  GameSingletonClassName;                                      // 0x270(0x18)
	struct FNone*                                 GameSingleton;                                               // 0x288(0x08)
	struct FNone                                  AssetManagerClassName;                                       // 0x290(0x18)
	struct FNone*                                 AssetManager;                                                // 0x2a8(0x08)
	struct FNone*                                 DefaultTexture;                                              // 0x2b0(0x08)
	struct FNone                                  DefaultTextureName;                                          // 0x2b8(0x18)
	struct FNone*                                 DefaultDiffuseTexture;                                       // 0x2d0(0x08)
	struct FNone                                  DefaultDiffuseTextureName;                                   // 0x2d8(0x18)
	struct FNone*                                 DefaultBSPVertexTexture;                                     // 0x2f0(0x08)
	struct FNone                                  DefaultBSPVertexTextureName;                                 // 0x2f8(0x18)
	struct FNone*                                 HighFrequencyNoiseTexture;                                   // 0x310(0x08)
	struct FNone                                  HighFrequencyNoiseTextureName;                               // 0x318(0x18)
	struct FNone*                                 DefaultBokehTexture;                                         // 0x330(0x08)
	struct FNone                                  DefaultBokehTextureName;                                     // 0x338(0x18)
	struct FNone*                                 DefaultBloomKernelTexture;                                   // 0x350(0x08)
	struct FNone                                  DefaultBloomKernelTextureName;                               // 0x358(0x18)
	struct FNone*                                 WireframeMaterial;                                           // 0x370(0x08)
	struct FString                                WireframeMaterialName;                                       // 0x378(0x10)
	struct FNone*                                 DebugMeshMaterial;                                           // 0x388(0x08)
	struct FNone                                  DebugMeshMaterialName;                                       // 0x390(0x18)
	struct FNone*                                 EmissiveMeshMaterial;                                        // 0x3a8(0x08)
	struct FNone                                  EmissiveMeshMaterialName;                                    // 0x3b0(0x18)
	struct FNone*                                 LevelColorationLitMaterial;                                  // 0x3c8(0x08)
	struct FString                                LevelColorationLitMaterialName;                              // 0x3d0(0x10)
	struct FNone*                                 LevelColorationUnlitMaterial;                                // 0x3e0(0x08)
	struct FString                                LevelColorationUnlitMaterialName;                            // 0x3e8(0x10)
	struct FNone*                                 LightingTexelDensityMaterial;                                // 0x3f8(0x08)
	struct FString                                LightingTexelDensityName;                                    // 0x400(0x10)
	struct FNone*                                 ShadedLevelColorationLitMaterial;                            // 0x410(0x08)
	struct FString                                ShadedLevelColorationLitMaterialName;                        // 0x418(0x10)
	struct FNone*                                 ShadedLevelColorationUnlitMaterial;                          // 0x428(0x08)
	struct FString                                ShadedLevelColorationUnlitMaterialName;                      // 0x430(0x10)
	struct FNone*                                 RemoveSurfaceMaterial;                                       // 0x440(0x08)
	struct FNone                                  RemoveSurfaceMaterialName;                                   // 0x448(0x18)
	struct FNone*                                 VertexColorMaterial;                                         // 0x460(0x08)
	struct FString                                VertexColorMaterialName;                                     // 0x468(0x10)
	struct FNone*                                 VertexColorViewModeMaterial_ColorOnly;                       // 0x478(0x08)
	struct FString                                VertexColorViewModeMaterialName_ColorOnly;                   // 0x480(0x10)
	struct FNone*                                 VertexColorViewModeMaterial_AlphaAsColor;                    // 0x490(0x08)
	struct FString                                VertexColorViewModeMaterialName_AlphaAsColor;                // 0x498(0x10)
	struct FNone*                                 VertexColorViewModeMaterial_RedOnly;                         // 0x4a8(0x08)
	struct FString                                VertexColorViewModeMaterialName_RedOnly;                     // 0x4b0(0x10)
	struct FNone*                                 VertexColorViewModeMaterial_GreenOnly;                       // 0x4c0(0x08)
	struct FString                                VertexColorViewModeMaterialName_GreenOnly;                   // 0x4c8(0x10)
	struct FNone*                                 VertexColorViewModeMaterial_BlueOnly;                        // 0x4d8(0x08)
	struct FString                                VertexColorViewModeMaterialName_BlueOnly;                    // 0x4e0(0x10)
	struct FNone                                  DebugEditorMaterialName;                                     // 0x4f0(0x18)
	struct FNone*                                 ConstraintLimitMaterial;                                     // 0x508(0x08)
	struct FNone*                                 ConstraintLimitMaterialX;                                    // 0x510(0x08)
	struct FNone*                                 ConstraintLimitMaterialXAxis;                                // 0x518(0x08)
	struct FNone*                                 ConstraintLimitMaterialY;                                    // 0x520(0x08)
	struct FNone*                                 ConstraintLimitMaterialYAxis;                                // 0x528(0x08)
	struct FNone*                                 ConstraintLimitMaterialZ;                                    // 0x530(0x08)
	struct FNone*                                 ConstraintLimitMaterialZAxis;                                // 0x538(0x08)
	struct FNone*                                 ConstraintLimitMaterialPrismatic;                            // 0x540(0x08)
	struct FNone*                                 InvalidLightmapSettingsMaterial;                             // 0x548(0x08)
	struct FNone                                  InvalidLightmapSettingsMaterialName;                         // 0x550(0x18)
	struct FNone*                                 PreviewShadowsIndicatorMaterial;                             // 0x568(0x08)
	struct FNone                                  PreviewShadowsIndicatorMaterialName;                         // 0x570(0x18)
	struct FNone*                                 ArrowMaterial;                                               // 0x588(0x08)
	struct FNone*                                 ArrowMaterialYellow;                                         // 0x590(0x08)
	struct FNone                                  ArrowMaterialName;                                           // 0x598(0x18)
	struct FNone                                  LightingOnlyBrightness;                                      // 0x5b0(0x10)
	struct TArray<None>                           ShaderComplexityColors;                                      // 0x5c0(0x10)
	struct TArray<None>                           QuadComplexityColors;                                        // 0x5d0(0x10)
	struct TArray<None>                           LightComplexityColors;                                       // 0x5e0(0x10)
	struct TArray<None>                           StationaryLightOverlapColors;                                // 0x5f0(0x10)
	struct TArray<None>                           LODColorationColors;                                         // 0x600(0x10)
	struct TArray<None>                           HLODColorationColors;                                        // 0x610(0x10)
	struct TArray<None>                           StreamingAccuracyColors;                                     // 0x620(0x10)
	float                                         MaxPixelShaderAdditiveComplexityCount;                       // 0x630(0x04)
	float                                         MaxES3PixelShaderAdditiveComplexityCount;                    // 0x634(0x04)
	float                                         MinLightMapDensity;                                          // 0x638(0x04)
	float                                         IdealLightMapDensity;                                        // 0x63c(0x04)
	float                                         MaxLightMapDensity;                                          // 0x640(0x04)
	char                                          bRenderLightMapDensityGrayscale : 0;                         // 0x644(0x01)
	char                                          UnknownData644[0x4];                                         // 0x644(0x04)
	float                                         RenderLightMapDensityGrayscaleScale;                         // 0x648(0x04)
	float                                         RenderLightMapDensityColorScale;                             // 0x64c(0x04)
	struct FNone                                  LightMapDensityVertexMappedColor;                            // 0x650(0x10)
	struct FNone                                  LightMapDensitySelectedColor;                                // 0x660(0x10)
	struct TArray<None>                           StatColorMappings;                                           // 0x670(0x10)
	struct FNone*                                 DefaultPhysMaterial;                                         // 0x680(0x08)
	struct FNone                                  DefaultPhysMaterialName;                                     // 0x688(0x18)
	struct TArray<None>                           ActiveGameNameRedirects;                                     // 0x6a0(0x10)
	struct TArray<None>                           ActiveClassRedirects;                                        // 0x6b0(0x10)
	struct TArray<None>                           ActivePluginRedirects;                                       // 0x6c0(0x10)
	struct TArray<None>                           ActiveStructRedirects;                                       // 0x6d0(0x10)
	struct FNone*                                 PreIntegratedSkinBRDFTexture;                                // 0x6e0(0x08)
	struct FNone                                  PreIntegratedSkinBRDFTextureName;                            // 0x6e8(0x18)
	struct FNone*                                 BlueNoiseTexture;                                            // 0x700(0x08)
	struct FNone                                  BlueNoiseTextureName;                                        // 0x708(0x18)
	struct FNone*                                 MiniFontTexture;                                             // 0x720(0x08)
	struct FNone                                  MiniFontTextureName;                                         // 0x728(0x18)
	struct FNone*                                 WeightMapPlaceholderTexture;                                 // 0x740(0x08)
	struct FNone                                  WeightMapPlaceholderTextureName;                             // 0x748(0x18)
	struct FNone*                                 LightMapDensityTexture;                                      // 0x760(0x08)
	struct FNone                                  LightMapDensityTextureName;                                  // 0x768(0x18)
	char                                          UnknownData780[0x8];                                         // 0x780(0x08)
	struct FNone*                                 GameViewport;                                                // 0x788(0x08)
	struct TArray<None>                           DeferredCommands;                                            // 0x790(0x10)
	uint32_t                                      TickCycles;                                                  // 0x7a0(0x04)
	uint32_t                                      GameCycles;                                                  // 0x7a4(0x04)
	uint32_t                                      ClientCycles;                                                // 0x7a8(0x04)
	float                                         NearClipPlane;                                               // 0x7ac(0x04)
	float                                         EditorNearClipPlane;                                         // 0x7b0(0x04)
	char                                          bUseCustomAudioModule : 0;                                   // 0x7b4(0x01)
	char                                          UnknownData7B4[0x4];                                         // 0x7b4(0x04)
	char                                          bHardwareSurveyEnabled : 0;                                  // 0x7b8(0x01)
	char                                          bSubtitlesEnabled : 0;                                       // 0x7b8(0x01)
	char                                          bSubtitlesForcedOff : 0;                                     // 0x7b8(0x01)
	char                                          UnknownData7B8[0x4];                                         // 0x7b8(0x04)
	uint32_t                                      MaximumLoopIterationCount;                                   // 0x7bc(0x04)
	char                                          bCanBlueprintsTickByDefault : 0;                             // 0x7c0(0x01)
	char                                          bOptimizeAnimBlueprintMemberVariableAccess : 0;              // 0x7c0(0x01)
	char                                          bAllowMultiThreadedAnimationUpdate : 0;                      // 0x7c0(0x01)
	char                                          bEnableEditorPSysRealtimeLOD : 0;                            // 0x7c0(0x01)
	char                                          bSmoothFrameRate : 0;                                        // 0x7c0(0x01)
	char                                          bUseFixedFrameRate : 0;                                      // 0x7c0(0x01)
	char                                          UnknownData7C0[0x4];                                         // 0x7c0(0x04)
	float                                         FixedFrameRate;                                              // 0x7c4(0x04)
	struct FNone                                  SmoothedFrameRateRange;                                      // 0x7c8(0x10)
	struct FNone*                                 CustomTimeStep;                                              // 0x7d8(0x08)
	char                                          UnknownData7E0[0x20];                                        // 0x7e0(0x20)
	struct FNone                                  CustomTimeStepClassName;                                     // 0x800(0x18)
	struct FNone*                                 TimecodeProvider;                                            // 0x818(0x08)
	char                                          UnknownData820[0x20];                                        // 0x820(0x20)
	struct FNone                                  TimecodeProviderClassName;                                   // 0x840(0x18)
	char                                          bGenerateDefaultTimecode : 0;                                // 0x858(0x01)
	char                                          UnknownData858[0x4];                                         // 0x858(0x04)
	struct FNone                                  GenerateDefaultTimecodeFrameRate;                            // 0x85c(0x08)
	float                                         GenerateDefaultTimecodeFrameDelay;                           // 0x864(0x04)
	char                                          bCheckForMultiplePawnsSpawnedInAFrame : 0;                   // 0x868(0x01)
	char                                          UnknownData868[0x4];                                         // 0x868(0x04)
	uint32_t                                      NumPawnsAllowedToBeSpawnedInAFrame;                          // 0x86c(0x04)
	char                                          bShouldGenerateLowQualityLightmaps : 0;                      // 0x870(0x01)
	char                                          UnknownData870[0x4];                                         // 0x870(0x04)
	struct FNone                                  C_WorldBox;                                                  // 0x874(0x04)
	struct FNone                                  C_BrushWire;                                                 // 0x878(0x04)
	struct FNone                                  C_AddWire;                                                   // 0x87c(0x04)
	struct FNone                                  C_SubtractWire;                                              // 0x880(0x04)
	struct FNone                                  C_SemiSolidWire;                                             // 0x884(0x04)
	struct FNone                                  C_NonSolidWire;                                              // 0x888(0x04)
	struct FNone                                  C_WireBackground;                                            // 0x88c(0x04)
	struct FNone                                  C_ScaleBoxHi;                                                // 0x890(0x04)
	struct FNone                                  C_VolumeCollision;                                           // 0x894(0x04)
	struct FNone                                  C_BSPCollision;                                              // 0x898(0x04)
	struct FNone                                  C_OrthoBackground;                                           // 0x89c(0x04)
	struct FNone                                  C_Volume;                                                    // 0x8a0(0x04)
	struct FNone                                  C_BrushShape;                                                // 0x8a4(0x04)
	float                                         StreamingDistanceFactor;                                     // 0x8a8(0x04)
	char                                          UnknownData8AC[0x4];                                         // 0x8ac(0x04)
	struct FNone                                  GameScreenshotSaveDirectory;                                 // 0x8b0(0x10)
	enum class None                               TransitionType;                                              // 0x8c0(0x01)
	char                                          UnknownData8C1[0x7];                                         // 0x8c1(0x07)
	struct FString                                TransitionDescription;                                       // 0x8c8(0x10)
	struct FString                                TransitionGameMode;                                          // 0x8d8(0x10)
	float                                         MeshLODRange;                                                // 0x8e8(0x04)
	char                                          bAllowMatureLanguage : 0;                                    // 0x8ec(0x01)
	char                                          UnknownData8EC[0x4];                                         // 0x8ec(0x04)
	float                                         CameraRotationThreshold;                                     // 0x8f0(0x04)
	float                                         CameraTranslationThreshold;                                  // 0x8f4(0x04)
	float                                         PrimitiveProbablyVisibleTime;                                // 0x8f8(0x04)
	float                                         MaxOcclusionPixelsFraction;                                  // 0x8fc(0x04)
	char                                          bPauseOnLossOfFocus : 0;                                     // 0x900(0x01)
	char                                          UnknownData900[0x4];                                         // 0x900(0x04)
	uint32_t                                      MaxParticleResize;                                           // 0x904(0x04)
	uint32_t                                      MaxParticleResizeWarn;                                       // 0x908(0x04)
	char                                          UnknownData90C[0x4];                                         // 0x90c(0x04)
	struct TArray<None>                           PendingDroppedNotes;                                         // 0x910(0x10)
	float                                         NetClientTicksPerSecond;                                     // 0x920(0x04)
	float                                         DisplayGamma;                                                // 0x924(0x04)
	float                                         MinDesiredFrameRate;                                         // 0x928(0x04)
	struct FNone                                  DefaultSelectedMaterialColor;                                // 0x92c(0x10)
	struct FNone                                  SelectedMaterialColor;                                       // 0x93c(0x10)
	struct FNone                                  SelectionOutlineColor;                                       // 0x94c(0x10)
	struct FNone                                  SubduedSelectionOutlineColor;                                // 0x95c(0x10)
	struct FNone                                  SelectedMaterialColorOverride;                               // 0x96c(0x10)
	char                                          bIsOverridingSelectedColor : 0;                              // 0x97c(0x01)
	char                                          UnknownData97C[0x4];                                         // 0x97c(0x04)
	char                                          bEnableOnScreenDebugMessages : 0;                            // 0x980(0x01)
	char                                          bEnableOnScreenDebugMessagesDisplay : 0;                     // 0x980(0x01)
	char                                          bSuppressMapWarnings : 0;                                    // 0x980(0x01)
	char                                          bDisableAILogging : 0;                                       // 0x980(0x01)
	char                                          UnknownData980[0x4];                                         // 0x980(0x04)
	uint32_t                                      bEnableVisualLogRecordingOnStart;                            // 0x984(0x04)
	char                                          UnknownData988[0x4];                                         // 0x988(0x04)
	uint32_t                                      ScreenSaverInhibitorSemaphore;                               // 0x98c(0x04)
	char                                          bLockReadOnlyLevels : 0;                                     // 0x990(0x01)
	char                                          UnknownData990[0x8];                                         // 0x990(0x08)
	struct FString                                ParticleEventManagerClassPath;                               // 0x998(0x10)
	float                                         SelectionHighlightIntensity;                                 // 0x9a8(0x04)
	float                                         BSPSelectionHighlightIntensity;                              // 0x9ac(0x04)
	float                                         SelectionHighlightIntensityBillboards;                       // 0x9b0(0x04)
	char                                          UnknownData9B4[0x24c];                                       // 0x9b4(0x24c)
	struct TArray<None>                           NetDriverDefinitions;                                        // 0xc00(0x10)
	struct TArray<None>                           ServerActors;                                                // 0xc10(0x10)
	struct TArray<None>                           RuntimeServerActors;                                         // 0xc20(0x10)
	float                                         NetErrorLogInterval;                                         // 0xc30(0x04)
	char                                          bStartedLoadMapMovie : 0;                                    // 0xc34(0x01)
	char                                          UnknownDataC34[0x1c];                                        // 0xc34(0x1c)
	uint32_t                                      NextWorldContextHandle;                                      // 0xc50(0x04)
	char                                          UnknownDataC54[0x194];                                       // 0xc54(0x194)
};

// Class Engine.LocalPlayer
// Size: 0x258 (Inherited: 0x48)
struct ULocalPlayer : UPlayer 
{
	char                                          UnknownData48[0x28];                                         // 0x48(0x28)
	struct FNone*                                 ViewportClient;                                              // 0x70(0x08)
	char                                          UnknownData78[0x1c];                                         // 0x78(0x1c)
	char                                          AspectRatioAxisConstraint;                                   // 0x94(0x01)
	char                                          UnknownData95[0x3];                                          // 0x95(0x03)
	struct FNone*                                 PendingLevelPlayerControllerClass;                           // 0x98(0x08)
	char                                          bSentSplitJoin : 0;                                          // 0xa0(0x01)
	char                                          UnknownDataA0[0x18];                                         // 0xa0(0x18)
	uint32_t                                      ControllerId;                                                // 0xb8(0x04)
	char                                          UnknownDataBC[0x19c];                                        // 0xbc(0x19c)
};

// Class Engine.Subsystem
// Size: 0x30 (Inherited: 0x28)
struct USubsystem : UObject 
{
	char                                          UnknownData28[0x8];                                          // 0x28(0x08)
};

// Class Engine.LocalPlayerSubsystem
// Size: 0x30 (Inherited: 0x30)
struct ULocalPlayerSubsystem : USubsystem 
{
};

// Class Engine.SkeletalMeshComponent
// Size: 0xb90 (Inherited: 0x700)
struct USkeletalMeshComponent : USkinnedMeshComponent 
{
	struct FNone*                                 AnimBlueprintGeneratedClass;                                 // 0x700(0x08)
	struct FNone*                                 AnimClass;                                                   // 0x708(0x08)
	struct FNone*                                 AnimScriptInstance;                                          // 0x710(0x08)
	struct FT_SM-Concrete_Sewerage01_HLOD_SgBakedMaterial_LOD1_0_Normal.T_SM-Concrete_Sewerage01_HLOD_SgBakedMaterial_4784237* PostprocessAnimInstance;                                     // 0x718(0x08)
	struct FNone                                  AnimationData;                                               // 0x720(0x18)
	char                                          UnknownData738[0x10];                                        // 0x738(0x10)
	struct FNone                                  RootBoneTranslation;                                         // 0x748(0x0c)
	struct FNone                                  LineCheckBoundsScale;                                        // 0x754(0x0c)
	char                                          UnknownData760[0x20];                                        // 0x760(0x20)
	struct TArray<None>                           LinkedInstances;                                             // 0x780(0x10)
	struct TArray<None>                           CachedBoneSpaceTransforms;                                   // 0x790(0x10)
	struct TArray<None>                           CachedComponentSpaceTransforms;                              // 0x7a0(0x10)
	char                                          UnknownData7B0[0x20];                                        // 0x7b0(0x20)
	float                                         GlobalAnimRateScale;                                         // 0x7d0(0x04)
	char                                          KinematicBonesUpdateType;                                    // 0x7d4(0x01)
	char                                          PhysicsTransformUpdateMode;                                  // 0x7d5(0x01)
	char                                          UnknownData7D6[0x7];                                         // 0x7d6(0x07)
	char                                          AnimationMode;                                               // 0x7dd(0x01)
	char                                          UnknownData7DE[0x1];                                         // 0x7de(0x01)
	char                                          bDisablePostProcessBlueprint : 0;                            // 0x7df(0x01)
	char                                          bUpdateOverlapsOnAnimationFinalize : 0;                      // 0x7df(0x01)
	char                                          bHasValidBodies : 0;                                         // 0x7df(0x01)
	char                                          bBlendPhysics : 0;                                           // 0x7df(0x01)
	char                                          bEnablePhysicsOnDedicatedServer : 0;                         // 0x7df(0x01)
	char                                          UnknownData7DF[0x1];                                         // 0x7df(0x01)
	char                                          bUpdateJointsFromAnimation : 0;                              // 0x7e0(0x01)
	char                                          bDisableClothSimulation : 0;                                 // 0x7e0(0x01)
	char                                          bDisableRigidBodyAnimNode : 0;                               // 0x7e0(0x01)
	char                                          bAllowAnimCurveEvaluation : 0;                               // 0x7e0(0x01)
	char                                          bDisableAnimCurves : 0;                                      // 0x7e0(0x01)
	char                                          UnknownData7E0[0x1];                                         // 0x7e0(0x01)
	char                                          bCollideWithEnvironment : 0;                                 // 0x7e1(0x01)
	char                                          bCollideWithAttachedChildren : 0;                            // 0x7e1(0x01)
	char                                          bLocalSpaceSimulation : 0;                                   // 0x7e1(0x01)
	char                                          bResetAfterTeleport : 0;                                     // 0x7e1(0x01)
	char                                          bDeferKinematicBoneUpdate : 0;                               // 0x7e1(0x01)
	char                                          bNoSkeletonUpdate : 0;                                       // 0x7e1(0x01)
	char                                          bPauseAnims : 0;                                             // 0x7e1(0x01)
	char                                          UnknownData7E1[0x1];                                         // 0x7e1(0x01)
	char                                          bUseRefPoseOnInitAnim : 0;                                   // 0x7e2(0x01)
	char                                          bEnablePerPolyCollision : 0;                                 // 0x7e2(0x01)
	char                                          bForceRefpose : 0;                                           // 0x7e2(0x01)
	char                                          bOnlyAllowAutonomousTickPose : 0;                            // 0x7e2(0x01)
	char                                          bIsAutonomousTickPose : 0;                                   // 0x7e2(0x01)
	char                                          bOldForceRefPose : 0;                                        // 0x7e2(0x01)
	char                                          bShowPrePhysBones : 0;                                       // 0x7e2(0x01)
	char                                          bRequiredBonesUpToDate : 0;                                  // 0x7e2(0x01)
	char                                          UnknownData7E2[0x1];                                         // 0x7e2(0x01)
	char                                          bAnimTreeInitialised : 0;                                    // 0x7e3(0x01)
	char                                          bIncludeComponentLocationIntoBounds : 0;                     // 0x7e3(0x01)
	char                                          bEnableLineCheckWithBounds : 0;                              // 0x7e3(0x01)
	char                                          bUseBendingElements : 0;                                     // 0x7e3(0x01)
	char                                          bUseTetrahedralConstraints : 0;                              // 0x7e3(0x01)
	char                                          bUseThinShellVolumeConstraints : 0;                          // 0x7e3(0x01)
	char                                          bUseSelfCollisions : 0;                                      // 0x7e3(0x01)
	char                                          bUseContinuousCollisionDetection : 0;                        // 0x7e3(0x01)
	char                                          UnknownData7E3[0x1];                                         // 0x7e3(0x01)
	char                                          bPropagateCurvesToSlaves : 0;                                // 0x7e4(0x01)
	char                                          bSkipKinematicUpdateWhenInterpolating : 0;                   // 0x7e4(0x01)
	char                                          bSkipBoundsUpdateWhenInterpolating : 0;                      // 0x7e4(0x01)
	char                                          bNeedsQueuedAnimEventsDispatched : 0;                        // 0x7e4(0x01)
	char                                          UnknownData7E4[0x2];                                         // 0x7e4(0x02)
	uint16_t                                      CachedAnimCurveUidVersion;                                   // 0x7e6(0x02)
	enum class None                               MassMode;                                                    // 0x7e8(0x01)
	char                                          UnknownData7E9[0x3];                                         // 0x7e9(0x03)
	float                                         UniformMass;                                                 // 0x7ec(0x04)
	float                                         TotalMass;                                                   // 0x7f0(0x04)
	float                                         Density;                                                     // 0x7f4(0x04)
	float                                         MinPerParticleMass;                                          // 0x7f8(0x04)
	float                                         ClothBlendWeight;                                            // 0x7fc(0x04)
	float                                         EdgeStiffness;                                               // 0x800(0x04)
	float                                         BendingStiffness;                                            // 0x804(0x04)
	float                                         AreaStiffness;                                               // 0x808(0x04)
	float                                         VolumeStiffness;                                             // 0x80c(0x04)
	float                                         StrainLimitingStiffness;                                     // 0x810(0x04)
	float                                         ShapeTargetStiffness;                                        // 0x814(0x04)
	struct TArray<None>                           DisallowedAnimCurves;                                        // 0x818(0x10)
	struct FNone*                                 BodySetup;                                                   // 0x828(0x08)
	char                                          UnknownData830[0x8];                                         // 0x830(0x08)
	struct FMulticastInlineDelegate               OnConstraintBroken;                                          // 0x838(0x10)
	struct FNone*                                 ClothingSimulationFactory;                                   // 0x848(0x08)
	char                                          UnknownData850[0xc8];                                        // 0x850(0xc8)
	float                                         TeleportDistanceThreshold;                                   // 0x918(0x04)
	float                                         TeleportRotationThreshold;                                   // 0x91c(0x04)
	char                                          UnknownData920[0x8];                                         // 0x920(0x08)
	uint32_t                                      LastPoseTickFrame;                                           // 0x928(0x04)
	char                                          UnknownData92C[0x54];                                        // 0x92c(0x54)
	struct FNone*                                 ClothingInteractor;                                          // 0x980(0x08)
	char                                          UnknownData988[0xc8];                                        // 0x988(0xc8)
	struct FMulticastInlineDelegate               OnAnimInitialized;                                           // 0xa50(0x10)
	char                                          UnknownDataA60[0x130];                                       // 0xa60(0x130)

	void UnlinkAnimClassLayers(struct FNone* InClass); // sub_0x3dd7780
	void UnbindClothFromMasterPoseComponent(char bRestoreSimulationSpace); // sub_0x3dd76f0
	void ToggleDisablePostProcessBlueprint(); // sub_0x3dd76d0
	void TermBodiesBelow(struct FName ParentBoneName); // sub_0x3dd7650
	void SuspendClothingSimulation(); // sub_0x3dd7630
	void Stop(); // sub_0x3dd7610
	void SnapshotPose(struct FNone& Snapshot); // sub_0x3dd7540
	void SetUpdateAnimationInEditor(char NewUpdateState); // sub_0x124ae30
	void SetTeleportRotationThreshold(float threshold); // sub_0x3dd74c0
	void SetTeleportDistanceThreshold(float threshold); // sub_0x3dd7440
	void SetPosition(float InPos, char bFireNotifies); // sub_0x3dd7370
	void SetPlayRate(float Rate); // sub_0x3dd72f0
	void SetPhysicsBlendWeight(float PhysicsBlendWeight); // sub_0x3dd7270
	void SetNotifyRigidBodyCollisionBelow(char bNewNotifyRigidBodyCollision, struct FName BoneName, char bIncludeSelf); // sub_0x3dd7160
	void SetMorphTarget(struct FName MorphTargetName, float Value, char bRemoveZeroWeight); // sub_0x3dd7050
	void SetEnablePhysicsBlending(char bNewBlendPhysics); // sub_0x3dd6fc0
	void SetEnableGravityOnAllBodiesBelow(char bEnableGravity, struct FName BoneName, char bIncludeSelf); // sub_0x3dd6eb0
	void SetEnableBodyGravity(char bEnableGravity, struct FName BoneName); // sub_0x3dd6df0
	void SetDisablePostProcessBlueprint(char bInDisablePostProcess); // sub_0x3dd6d60
	void SetDisableAnimCurves(char bInDisableAnimCurves); // sub_0x3dd6cd0
	void SetConstraintProfileForAll(struct FName ProfileName, char bDefaultIfNotFound); // sub_0x3dd6c00
	void SetConstraintProfile(struct FName JointName, struct FName ProfileName, char bDefaultIfNotFound); // sub_0x3dd6af0
	void SetClothMaxDistanceScale(float Scale); // sub_0x3dd6a70
	void SetBodyNotifyRigidBodyCollision(char bNewNotifyRigidBodyCollision, struct FName BoneName); // sub_0x3dd69a0
	void SetAnimClass(struct FNone* NewClass); // sub_0x3dd6810
	void SetAnimationMode(char InAnimationMode); // sub_0x3dd6920
	void SetAnimation(struct FNone* NewAnimToPlay); // sub_0x3dd68a0
	void SetAngularLimits(struct FName InBoneName, float Swing1LimitAngle, float TwistLimitAngle, float Swing2LimitAngle); // sub_0x3dd66c0
	void SetAllowRigidBodyAnimNode(char bInAllow, char bReinitAnim); // sub_0x3dd64f0
	void SetAllowedAnimCurvesEvaluation(struct TArray<None>& List, char bAllow); // sub_0x3dd65c0
	void SetAllowAnimCurveEvaluation(char bInAllow); // sub_0x3dd6460
	void SetAllMotorsAngularVelocityDrive(char bEnableSwingDrive, char bEnableTwistDrive, char bSkipCustomPhysicsType); // sub_0x3dd6340
	void SetAllMotorsAngularPositionDrive(char bEnableSwingDrive, char bEnableTwistDrive, char bSkipCustomPhysicsType); // sub_0x3dd6220
	void SetAllMotorsAngularDriveParams(float InSpring, float InDamping, float InForceLimit, char bSkipCustomPhysicsType); // sub_0x3dd60c0
	void SetAllBodiesSimulatePhysics(char bNewSimulate); // sub_0x3dd6030
	void SetAllBodiesPhysicsBlendWeight(float PhysicsBlendWeight, char bSkipCustomPhysicsType); // sub_0x3dd5f60
	void SetAllBodiesBelowSimulatePhysics(struct FName& InBoneName, char bNewSimulate, char bIncludeSelf); // sub_0x3dd5e40
	void SetAllBodiesBelowPhysicsBlendWeight(struct FName& InBoneName, float PhysicsBlendWeight, char bSkipCustomPhysicsType, char bIncludeSelf); // sub_0x3dd5cd0
	void ResumeClothingSimulation(); // sub_0x3dd5cb0
	void ResetClothTeleportMode(); // sub_0x3dd5c90
	void ResetAnimInstanceDynamics(enum class None InTeleportType); // sub_0x3dd5c10
	void ResetAllowedAnimCurveEvaluation(); // sub_0x3dd5bf0
	void ResetAllBodiesSimulatePhysics(); // sub_0x3dd5bd0
	void PlayAnimation(struct FNone* NewAnimToPlay, char bLooping); // sub_0x3dd5b00
	void Play(char bLooping); // sub_0x3dd5a70
	void OverrideAnimationData(struct FNone* InAnimToPlay, char bIsLooping, char bIsPlaying, float Position, float PlayRate); // sub_0x3dd58d0
	void LinkAnimGraphByTag(struct FName InTag, struct FNone* InClass); // sub_0x3dd5810
	void LinkAnimClassLayers(struct FNone* InClass); // sub_0x3dd5790
	char K2_GetClosestPointOnPhysicsAsset(struct FNone& WorldPosition, struct FNone& ClosestWorldPosition, struct FNone& Normal, struct FName& BoneName, float& Distance); // sub_0x3dd5590
	char IsPlaying(); // sub_0x3dd5560
	char IsClothingSimulationSuspended(); // sub_0x3dd5530
	char IsBodyGravityEnabled(struct FName BoneName); // sub_0x3dd54a0
	char HasValidAnimationInstance(); // sub_0x3dd5470
	float GetTeleportRotationThreshold(); // sub_0x3dd5440
	float GetTeleportDistanceThreshold(); // sub_0x3dd5440
	struct FNone GetSkeletalCenterOfMass(); // sub_0x3dd5400
	struct FNone* GetPostProcessInstance(); // sub_0x1e41830
	float GetPosition(); // sub_0x3dd53d0
	float GetPlayRate(); // sub_0x3dd53a0
	float GetMorphTarget(struct FName MorphTargetName); // sub_0x3dd5300
	struct FNone* GetLinkedAnimLayerInstanceByGroup(struct FName InGroup); // sub_0x3dd5270
	struct FNone* GetLinkedAnimLayerInstanceByClass(struct FNone* InClass); // sub_0x3dd51e0
	void GetLinkedAnimGraphInstancesByTag(struct FName InTag, struct TArray<None>& OutLinkedInstances); // sub_0x3dd50f0
	struct FNone* GetLinkedAnimGraphInstanceByTag(struct FName InTag); // sub_0x3dd5060
	char GetDisablePostProcessBlueprint(); // sub_0x3dd5030
	char GetDisableAnimCurves(); // sub_0x3dd5000
	void GetCurrentJointAngles(struct FName InBoneName, float& Swing1Angle, float& TwistAngle, float& Swing2Angle); // sub_0x3dd4e80
	float GetClothMaxDistanceScale(); // sub_0x3dd4e20
	struct FNone* GetClothingSimulationInteractor(); // sub_0x3dd4e50
	float GetBoneMass(struct FName BoneName, char bScaleMass); // sub_0x3dd4d50
	struct FNone* GetAnimInstance(); // sub_0x3dd4cf0
	struct FNone* GetAnimClass(); // sub_0x3dd4cc0
	char GetAnimationMode(); // sub_0x3dd4d20
	char GetAllowRigidBodyAnimNode(); // sub_0x3dd4c60
	char GetAllowedAnimCurveEvaluate(); // sub_0x3dd4c90
	void ForceClothNextUpdateTeleportAndReset(); // sub_0x3dd4c40
	void ForceClothNextUpdateTeleport(); // sub_0x3dd4c20
	struct FName FindConstraintBoneName(uint32_t ConstraintIndex); // sub_0x3dd4b90
	void ClearMorphTargets(); // sub_0x3dd4b70
	void BreakConstraint(struct FNone Impulse, struct FNone HitLocation, struct FName InBoneName); // sub_0x3dd4a40
	void BindClothToMasterPoseComponent(); // sub_0x3dd4a20
	void AllowAnimCurveEvaluation(struct FName NameOfCurve, char bAllow); // sub_0x3dd4950
	void AddImpulseToAllBodiesBelow(struct FNone Impulse, struct FName BoneName, char bVelChange, char bIncludeSelf); // sub_0x3dd47e0
	void AddForceToAllBodiesBelow(struct FNone Force, struct FName BoneName, char bAccelChange, char bIncludeSelf); // sub_0x3dd4670
	void AccumulateAllBodiesBelowPhysicsBlendWeight(struct FName& InBoneName, float AddPhysicsBlendWeight, char bSkipCustomPhysicsType); // sub_0x3dd4550
};

// Class Engine.AnimInstance
// Size: 0x270 (Inherited: 0x28)
struct UAnimInstance : UObject 
{
	struct FNone*                                 CurrentSkeleton;                                             // 0x28(0x08)
	char                                          RootMotionMode;                                              // 0x30(0x01)
	char                                          bUseMultiThreadedAnimationUpdate : 0;                        // 0x31(0x01)
	char                                          bUsingCopyPoseFromMesh : 0;                                  // 0x31(0x01)
	char                                          bReceiveNotifiesFromLinkedInstances : 0;                     // 0x31(0x01)
	char                                          bPropagateNotifiesToLinkedInstances : 0;                     // 0x31(0x01)
	char                                          bQueueMontageEvents : 0;                                     // 0x31(0x01)
	char                                          UnknownData31[0x7];                                          // 0x31(0x07)
	struct FMulticastInlineDelegate               OnMontageBlendingOut;                                        // 0x38(0x10)
	struct FMulticastInlineDelegate               OnMontageStarted;                                            // 0x48(0x10)
	struct FMulticastInlineDelegate               OnMontageEnded;                                              // 0x58(0x10)
	struct FMulticastInlineDelegate               OnAllMontageInstancesEnded;                                  // 0x68(0x10)
	char                                          UnknownData78[0x88];                                         // 0x78(0x88)
	struct FNone                                  NotifyQueue;                                                 // 0x100(0x70)
	struct TArray<None>                           ActiveAnimNotifyState;                                       // 0x170(0x10)
	char                                          UnknownData180[0xf0];                                        // 0x180(0xf0)

	void UnlockAIResources(char bUnlockMovement, char UnlockAILogic); // sub_0x1ecf4b0
	void UnlinkAnimClassLayers(struct FNone* InClass); // sub_0x3c59280
	struct FNone* TryGetPawnOwner(); // sub_0x3c59250
	void StopSlotAnimation(float InBlendOutTime, struct FName SlotNodeName); // sub_0x3c59180
	void SnapshotPose(struct FNone& Snapshot); // sub_0x3c590b0
	void SetRootMotionMode(char Value); // sub_0x3c59030
	void SetReceiveNotifiesFromLinkedInstances(char bSet); // sub_0x3c58fa0
	void SetPropagateNotifiesToLinkedInstances(char bSet); // sub_0x3c58f10
	void SetMorphTarget(struct FName MorphTargetName, float Value); // sub_0x3c58e40
	void SavePoseSnapshot(struct FName SnapshotName); // sub_0x3c58db0
	void ResetDynamics(enum class None InTeleportType); // sub_0x3c58d30
	struct FNone* PlaySlotAnimationAsDynamicMontage(struct FNone* Asset, struct FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, uint32_t LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt); // sub_0x3c58af0
	float PlaySlotAnimation(struct FNone* Asset, struct FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, uint32_t LoopCount); // sub_0x3c58930
	void Montage_StopGroupByName(float InBlendOutTime, struct FName GroupName); // sub_0x3c58860
	void Montage_Stop(float InBlendOutTime, struct FNone* Montage); // sub_0x3c58790
	void Montage_SetPosition(struct FNone* Montage, float NewPosition); // sub_0x3c586c0
	void Montage_SetPlayRate(struct FNone* Montage, float NewPlayRate); // sub_0x3c585f0
	void Montage_SetNextSection(struct FName SectionNameToChange, struct FName NextSection, struct FNone* Montage); // sub_0x3c584f0
	void Montage_Resume(struct FNone* Montage); // sub_0x3c58470
	float Montage_Play(struct FNone* MontageToPlay, float InPlayRate, enum class None ReturnValueType, float InTimeToStartMontageAt, char bStopAllMontages); // sub_0x3c582e0
	void Montage_Pause(struct FNone* Montage); // sub_0x3c58260
	void Montage_JumpToSectionsEnd(struct FName SectionName, struct FNone* Montage); // sub_0x3c581a0
	void Montage_JumpToSection(struct FName SectionName, struct FNone* Montage); // sub_0x3c580e0
	char Montage_IsPlaying(struct FNone* Montage); // sub_0x3c58050
	char Montage_IsActive(struct FNone* Montage); // sub_0x3c57fc0
	float Montage_GetPosition(struct FNone* Montage); // sub_0x3c57f20
	float Montage_GetPlayRate(struct FNone* Montage); // sub_0x3c57e80
	char Montage_GetIsStopped(struct FNone* Montage); // sub_0x3c57df0
	struct FName Montage_GetCurrentSection(struct FNone* Montage); // sub_0x3c57d60
	float Montage_GetBlendTime(struct FNone* Montage); // sub_0x3c57cc0
	void LockAIResources(char bLockMovement, char LockAILogic); // sub_0x1ecf4b0
	void LinkAnimGraphByTag(struct FName InTag, struct FNone* InClass); // sub_0x3c57c00
	void LinkAnimClassLayers(struct FNone* InClass); // sub_0x3c57b80
	char IsSyncGroupBetweenMarkers(struct FName InSyncGroupName, struct FName PreviousMarker, struct FName NextMarker, char bRespectMarkerOrder); // sub_0x3c57a30
	char IsPlayingSlotAnimation(struct FNone* Asset, struct FName SlotNodeName); // sub_0x3c57970
	char IsAnyMontagePlaying(); // sub_0x3c57940
	char HasMarkerBeenHitThisFrame(struct FName SyncGroup, struct FName MarkerName); // sub_0x3c57880
	char GetTimeToClosestMarker(struct FName SyncGroup, struct FName MarkerName, float& OutMarkerTime); // sub_0x3c57770
	struct FNone GetSyncGroupPosition(struct FName InSyncGroupName); // sub_0x3c576d0
	float GetRelevantAnimTimeRemainingFraction(uint32_t MachineIndex, uint32_t StateIndex); // sub_0x3c57610
	float GetRelevantAnimTimeRemaining(uint32_t MachineIndex, uint32_t StateIndex); // sub_0x3c57550
	float GetRelevantAnimTimeFraction(uint32_t MachineIndex, uint32_t StateIndex); // sub_0x3c57490
	float GetRelevantAnimTime(uint32_t MachineIndex, uint32_t StateIndex); // sub_0x3c573d0
	float GetRelevantAnimLength(uint32_t MachineIndex, uint32_t StateIndex); // sub_0x3c57310
	char GetReceiveNotifiesFromLinkedInstances(); // sub_0x3c572e0
	char GetPropagateNotifiesToLinkedInstances(); // sub_0x3c572b0
	struct FNone* GetOwningComponent(); // sub_0x3c57280
	struct FNone* GetOwningActor(); // sub_0x3c57250
	struct FNone* GetLinkedAnimLayerInstanceByGroup(struct FName InGroup); // sub_0x3c571c0
	struct FNone* GetLinkedAnimLayerInstanceByClass(struct FNone* InClass); // sub_0x3c57130
	void GetLinkedAnimGraphInstancesByTag(struct FName InTag, struct TArray<None>& OutLinkedInstances); // sub_0x3c57040
	struct FNone* GetLinkedAnimGraphInstanceByTag(struct FName InTag); // sub_0x3c56fb0
	float GetInstanceTransitionTimeElapsedFraction(uint32_t MachineIndex, uint32_t TransitionIndex); // sub_0x3c56ef0
	float GetInstanceTransitionTimeElapsed(uint32_t MachineIndex, uint32_t TransitionIndex); // sub_0x3c56e30
	float GetInstanceTransitionCrossfadeDuration(uint32_t MachineIndex, uint32_t TransitionIndex); // sub_0x3c56d70
	float GetInstanceStateWeight(uint32_t MachineIndex, uint32_t StateIndex); // sub_0x3c56cb0
	float GetInstanceMachineWeight(uint32_t MachineIndex); // sub_0x3c56c20
	float GetInstanceCurrentStateElapsedTime(uint32_t MachineIndex); // sub_0x3c56b90
	float GetInstanceAssetPlayerTimeFromEndFraction(uint32_t AssetPlayerIndex); // sub_0x3c56b00
	float GetInstanceAssetPlayerTimeFromEnd(uint32_t AssetPlayerIndex); // sub_0x3c56a70
	float GetInstanceAssetPlayerTimeFraction(uint32_t AssetPlayerIndex); // sub_0x3c569e0
	float GetInstanceAssetPlayerTime(uint32_t AssetPlayerIndex); // sub_0x3c56950
	float GetInstanceAssetPlayerLength(uint32_t AssetPlayerIndex); // sub_0x3c568c0
	float GetCurveValue(struct FName CurveName); // sub_0x3c56820
	struct FName GetCurrentStateName(uint32_t MachineIndex); // sub_0x3c56790
	struct FNone* GetCurrentActiveMontage(); // sub_0x3c56760
	void GetAllCurveNames(struct TArray<None>& OutNames); // sub_0x3c566b0
	void GetActiveCurveNames(enum class None CurveType, struct TArray<None>& OutNames); // sub_0x3c565c0
	void ClearMorphTargets(); // sub_0x3c565a0
	float CalculateDirection(struct FNone& Velocity, struct FNone& BaseRotation); // sub_0x3c564a0
	void BlueprintUpdateAnimation(float DeltaTimeX); // sub_0x239bfb0
	void BlueprintPostEvaluateAnimation(); // sub_0x239bfb0
	void BlueprintLinkedAnimationLayersInitialized(); // sub_0x239bfb0
	void BlueprintInitializeAnimation(); // sub_0x239bfb0
	void BlueprintBeginPlay(); // sub_0x239bfb0
};

// Class Engine.ReplicationDriver
// Size: 0x28 (Inherited: 0x28)
struct UReplicationDriver : UObject 
{
};

// Class Engine.ReplicationConnectionDriver
// Size: 0x28 (Inherited: 0x28)
struct UReplicationConnectionDriver : UObject 
{
};

// Class Engine.Exporter
// Size: 0x78 (Inherited: 0x28)
struct UExporter : UObject 
{
	struct FNone*                                 SupportedClass;                                              // 0x28(0x08)
	struct FNone*                                 ExportRootScope;                                             // 0x30(0x08)
	struct TArray<None>                           FormatExtension;                                             // 0x38(0x10)
	struct TArray<None>                           FormatDescription;                                           // 0x48(0x10)
	uint32_t                                      PreferredFormatIndex;                                        // 0x58(0x04)
	uint32_t                                      TextIndent;                                                  // 0x5c(0x04)
	char                                          bText : 0;                                                   // 0x60(0x01)
	char                                          bSelectedOnly : 0;                                           // 0x60(0x01)
	char                                          bForceFileOperations : 0;                                    // 0x60(0x01)
	char                                          UnknownData60[0x8];                                          // 0x60(0x08)
	struct FNone*                                 ExportTask;                                                  // 0x68(0x08)
	char                                          UnknownData70[0x8];                                          // 0x70(0x08)

	char ScriptRunAssetExportTask(struct FNone* Task); // sub_0x239bfb0
	char RunAssetExportTasks(struct TArray<None>& ExportTasks); // sub_0x3cc7790
	char RunAssetExportTask(struct FNone* Task); // sub_0x17d5930
};

// Class Engine.LevelScriptActor
// Size: 0x318 (Inherited: 0x310)
struct ALevelScriptActor : AActor 
{
	char                                          bInputEnabled : 0;                                           // 0x310(0x01)
	char                                          UnknownData310[0x8];                                         // 0x310(0x08)

	void WorldOriginLocationChanged(struct FNone OldOriginLocation, struct FNone NewOriginLocation); // sub_0x239bfb0
	void SetCinematicMode(char bCinematicMode, char bHidePlayer, char bAffectsHUD, char bAffectsMovement, char bAffectsTurning); // sub_0x3d51900
	char RemoteEvent(struct FName EventName); // sub_0x3d513b0
	void LevelReset(); // sub_0x239bfb0
};

// Class Engine.FXSystemComponent
// Size: 0x4c0 (Inherited: 0x4c0)
struct UFXSystemComponent : UPrimitiveComponent 
{

	void SetVectorParameter(struct FName ParameterName, struct FNone Param); // sub_0x3d93ca0
	void SetUseAutoManageAttachment(char bAutoManage); // sub_0x3d93c10
	void SetFloatParameter(struct FName ParameterName, float Param); // sub_0x3d938b0
	void SetEmitterEnable(struct FName EmitterName, char bNewEnableState); // sub_0x3d937e0
	void SetColorParameter(struct FName ParameterName, struct FNone Param); // sub_0x3d93710
	void SetBoolParameter(struct FName ParameterName, char Param); // sub_0x3d93640
	void SetAutoAttachmentParameters(struct FNone* Parent, struct FName SocketName, enum class None LocationRule, enum class None RotationRule, enum class None ScaleRule); // sub_0x3d92db0
	void SetActorParameter(struct FName ParameterName, struct FNone* Param); // sub_0x3d92bc0
	void ReleaseToPool(); // sub_0x3d92ba0
	struct FNone* GetFXSystemAsset(); // sub_0x3d92aa0
};

// Class Engine.FXSystemAsset
// Size: 0x30 (Inherited: 0x28)
struct UFXSystemAsset : UObject 
{
	uint32_t                                      MaxPoolSize;                                                 // 0x28(0x04)
	char                                          UnknownData2C[0x4];                                          // 0x2c(0x04)
};

// Class Engine.AnimNotify
// Size: 0x38 (Inherited: 0x28)
struct UAnimNotify : UObject 
{
	char                                          UnknownData28[0x10];                                         // 0x28(0x10)

	char Received_Notify(struct FNone* MeshComp, struct FNone* Animation); // sub_0x239bfb0
	struct FString GetNotifyName(); // sub_0x34daea0
};

// Class Engine.AnimNotifyState
// Size: 0x30 (Inherited: 0x28)
struct UAnimNotifyState : UObject 
{
	char                                          UnknownData28[0x8];                                          // 0x28(0x08)

	char Received_NotifyTick(struct FNone* MeshComp, struct FNone* Animation, float FrameDeltaTime); // sub_0x239bfb0
	char Received_NotifyEnd(struct FNone* MeshComp, struct FNone* Animation); // sub_0x239bfb0
	char Received_NotifyBegin(struct FNone* MeshComp, struct FNone* Animation, float TotalDuration); // sub_0x239bfb0
	struct FString GetNotifyName(); // sub_0x34daea0
};

// Class Engine.Brush
// Size: 0x348 (Inherited: 0x310)
struct ABrush : AActor 
{
	char                                          BrushType;                                                   // 0x310(0x01)
	char                                          UnknownData311[0x3];                                         // 0x311(0x03)
	struct FNone                                  BrushColor;                                                  // 0x314(0x04)
	uint32_t                                      PolyFlags;                                                   // 0x318(0x04)
	char                                          bColored : 0;                                                // 0x31c(0x01)
	char                                          bSolidWhenSelected : 0;                                      // 0x31c(0x01)
	char                                          bPlaceableFromClassBrowser : 0;                              // 0x31c(0x01)
	char                                          bNotForClientOrServer : 0;                                   // 0x31c(0x01)
	char                                          UnknownData31C[0x4];                                         // 0x31c(0x04)
	struct FNone*                                 Brush;                                                       // 0x320(0x08)
	struct FNone*                                 BrushComponent;                                              // 0x328(0x08)
	char                                          bInManipulation : 0;                                         // 0x330(0x01)
	char                                          UnknownData330[0x8];                                         // 0x330(0x08)
	struct TArray<None>                           SavedSelections;                                             // 0x338(0x10)
};

// Class Engine.Volume
// Size: 0x348 (Inherited: 0x348)
struct AVolume : ABrush 
{
};

// Class Engine.MKWorldEx
// Size: 0x40 (Inherited: 0x28)
struct UMKWorldEx : UObject 
{
	char                                          UnknownData28[0x10];                                         // 0x28(0x10)
	struct FNone*                                 SelfWorld;                                                   // 0x38(0x08)
};

// Class Engine.World
// Size: 0x770 (Inherited: 0x40)
struct UWorld : UMKWorldEx 
{
	char                                          UnknownData40[0x8];                                          // 0x40(0x08)
	struct FNone*                                 PersistentLevel;                                             // 0x48(0x08)
	struct FNone*                                 NetDriver;                                                   // 0x50(0x08)
	struct FNone*                                 LineBatcher;                                                 // 0x58(0x08)
	struct FNone*                                 PersistentLineBatcher;                                       // 0x60(0x08)
	struct FNone*                                 ForegroundLineBatcher;                                       // 0x68(0x08)
	struct FNone*                                 NetworkManager;                                              // 0x70(0x08)
	struct FNone*                                 PhysicsCollisionHandler;                                     // 0x78(0x08)
	struct TArray<None>                           ExtraReferencedObjects;                                      // 0x80(0x10)
	struct TArray<None>                           PerModuleDataObjects;                                        // 0x90(0x10)
	struct TArray<None>                           LevelSequenceActors;                                         // 0xa0(0x10)
	struct TArray<None>                           StreamingLevels;                                             // 0xb0(0x10)
	struct FNone                                  StreamingLevelsToConsider;                                   // 0xc0(0x48)
	char                                          UnknownData108[0x18];                                        // 0x108(0x18)
	struct FString                                StreamingLevelsPrefix;                                       // 0x120(0x10)
	struct FNone*                                 CurrentLevelPendingVisibility;                               // 0x130(0x08)
	struct FNone*                                 CurrentLevelPendingInvisibility;                             // 0x138(0x08)
	struct FNone*                                 DemoNetDriver;                                               // 0x140(0x08)
	struct FNone*                                 MyParticleEventManager;                                      // 0x148(0x08)
	struct FNone*                                 DefaultPhysicsVolume;                                        // 0x150(0x08)
	char                                          UnknownData158[0x16];                                        // 0x158(0x16)
	char                                          bAreConstraintsDirty : 0;                                    // 0x16e(0x01)
	char                                          UnknownData16E[0x2];                                         // 0x16e(0x02)
	struct FNone*                                 NavigationSystem;                                            // 0x170(0x08)
	struct FNone*                                 AuthorityGameMode;                                           // 0x178(0x08)
	struct FNone*                                 GameState;                                                   // 0x180(0x08)
	struct FNone*                                 AISystem;                                                    // 0x188(0x08)
	struct FNone*                                 AvoidanceManager;                                            // 0x190(0x08)
	struct TArray<None>                           Levels;                                                      // 0x198(0x10)
	struct TArray<None>                           LevelCollections;                                            // 0x1a8(0x10)
	char                                          UnknownData1B8[0x20];                                        // 0x1b8(0x20)
	struct FNone*                                 OwningGameInstance;                                          // 0x1d8(0x08)
	struct TArray<None>                           ParameterCollectionInstances;                                // 0x1e0(0x10)
	struct FNone*                                 CanvasForRenderingToTarget;                                  // 0x1f0(0x08)
	struct FNone*                                 CanvasForDrawMaterialToRenderTarget;                         // 0x1f8(0x08)
	char                                          UnknownData200[0x50];                                        // 0x200(0x50)
	struct TArray<None>                           ComponentsThatNeedEndOfFrameUpdate;                          // 0x250(0x10)
	struct TArray<None>                           ComponentsThatNeedEndOfFrameUpdate_OnGameThread;             // 0x260(0x10)
	char                                          UnknownData270[0x340];                                       // 0x270(0x340)
	struct FNone*                                 WorldComposition;                                            // 0x5b0(0x08)
	char                                          UnknownData5B8[0x98];                                        // 0x5b8(0x98)
	struct FNone                                  PSCPool;                                                     // 0x650(0x58)
	char                                          UnknownData6A8[0xc8];                                        // 0x6a8(0xc8)

	struct FNone* K2_GetWorldSettings(); // sub_0x3e11320
	void HandleTimelineScrubbed(); // sub_0x3e11300
};

// Class Engine.InterpTrack
// Size: 0x70 (Inherited: 0x28)
struct UInterpTrack : UObject 
{
	char                                          UnknownData28[0x10];                                         // 0x28(0x10)
	struct TArray<None>                           SubTracks;                                                   // 0x38(0x10)
	struct FNone*                                 TrackInstClass;                                              // 0x48(0x08)
	char                                          ActiveCondition;                                             // 0x50(0x01)
	char                                          UnknownData51[0x7];                                          // 0x51(0x07)
	struct FString                                TrackTitle;                                                  // 0x58(0x10)
	char                                          bOnePerGroup : 0;                                            // 0x68(0x01)
	char                                          bDirGroupOnly : 0;                                           // 0x68(0x01)
	char                                          bDisableTrack : 0;                                           // 0x68(0x01)
	char                                          bIsSelected : 0;                                             // 0x68(0x01)
	char                                          bIsAnimControlTrack : 0;                                     // 0x68(0x01)
	char                                          bSubTrackOnly : 0;                                           // 0x68(0x01)
	char                                          bVisible : 0;                                                // 0x68(0x01)
	char                                          bIsRecording : 0;                                            // 0x68(0x01)
	char                                          UnknownData68[0x8];                                          // 0x68(0x08)
};

// Class Engine.InterpTrackVectorBase
// Size: 0x90 (Inherited: 0x70)
struct UInterpTrackVectorBase : UInterpTrack 
{
	struct FNone                                  VectorTrack;                                                 // 0x70(0x18)
	float                                         CurveTension;                                                // 0x88(0x04)
	char                                          UnknownData8C[0x4];                                          // 0x8c(0x04)
};

// Class Engine.InterpTrackFloatBase
// Size: 0x90 (Inherited: 0x70)
struct UInterpTrackFloatBase : UInterpTrack 
{
	struct FNone                                  FloatTrack;                                                  // 0x70(0x18)
	float                                         CurveTension;                                                // 0x88(0x04)
	char                                          UnknownData8C[0x4];                                          // 0x8c(0x04)
};

// Class Engine.InterpTrackInst
// Size: 0x28 (Inherited: 0x28)
struct UInterpTrackInst : UObject 
{
};

// Class Engine.DataAsset
// Size: 0x30 (Inherited: 0x28)
struct UDataAsset : UObject 
{
	struct FNone*                                 NativeClass;                                                 // 0x28(0x08)
};

// Class Engine.MaterialExpression
// Size: 0x40 (Inherited: 0x28)
struct UMaterialExpression : UObject 
{
	struct FNone*                                 Material;                                                    // 0x28(0x08)
	struct FNone*                                 Function;                                                    // 0x30(0x08)
	char                                          bIsParameterExpression : 0;                                  // 0x38(0x01)
	char                                          UnknownData38[0x8];                                          // 0x38(0x08)
};

// Class Engine.MaterialExpressionTextureBase
// Size: 0x50 (Inherited: 0x40)
struct UMaterialExpressionTextureBase : UMaterialExpression 
{
	struct FNone*                                 Texture;                                                     // 0x40(0x08)
	char                                          SamplerType;                                                 // 0x48(0x01)
	char                                          IsDefaultMeshpaintTexture : 0;                               // 0x49(0x01)
	char                                          UnknownData49[0x7];                                          // 0x49(0x07)
};

// Class Engine.MaterialExpressionTextureSample
// Size: 0xd0 (Inherited: 0x50)
struct UMaterialExpressionTextureSample : UMaterialExpressionTextureBase 
{
	struct FNone                                  Coordinates;                                                 // 0x50(0x0c)
	char                                          UnknownData5C[0x8];                                          // 0x5c(0x08)
	struct FNone                                  TextureObject;                                               // 0x64(0x0c)
	char                                          UnknownData70[0x8];                                          // 0x70(0x08)
	struct FNone                                  MipValue;                                                    // 0x78(0x0c)
	char                                          UnknownData84[0x8];                                          // 0x84(0x08)
	struct FNone                                  CoordinatesDX;                                               // 0x8c(0x0c)
	char                                          UnknownData98[0x8];                                          // 0x98(0x08)
	struct FNone                                  CoordinatesDY;                                               // 0xa0(0x0c)
	char                                          UnknownDataAC[0x8];                                          // 0xac(0x08)
	struct FNone                                  AutomaticViewMipBiasValue;                                   // 0xb4(0x0c)
	char                                          UnknownDataC0[0x8];                                          // 0xc0(0x08)
	char                                          MipValueMode;                                                // 0xc8(0x01)
	char                                          SamplerSource;                                               // 0xc9(0x01)
	char                                          AutomaticViewMipBias : 0;                                    // 0xca(0x01)
	char                                          UnknownDataCA[0x1];                                          // 0xca(0x01)
	char                                          ConstCoordinate;                                             // 0xcb(0x01)
	uint32_t                                      ConstMipValue;                                               // 0xcc(0x04)
};

// Class Engine.MaterialExpressionTextureSampleParameter
// Size: 0xf0 (Inherited: 0xd0)
struct UMaterialExpressionTextureSampleParameter : UMaterialExpressionTextureSample 
{
	struct FName                                  ParameterName;                                               // 0xd0(0x08)
	struct FNone                                  ExpressionGUID;                                              // 0xd8(0x10)
	struct FName                                  Group;                                                       // 0xe8(0x08)
};

// Class Engine.MaterialExpressionTextureSampleParameter2D
// Size: 0xf0 (Inherited: 0xf0)
struct UMaterialExpressionTextureSampleParameter2D : UMaterialExpressionTextureSampleParameter 
{
};

// Class Engine.MKPawnEx
// Size: 0x320 (Inherited: 0x310)
struct AMKPawnEx : AActor 
{
	char                                          UnknownData310[0x8];                                         // 0x310(0x08)
	struct FNone*                                 SelfPawn;                                                    // 0x318(0x08)

	void OnChangedViewMode(); // sub_0x1e42900
};

// Class Engine.Pawn
// Size: 0x380 (Inherited: 0x320)
struct APawn : AMKPawnEx 
{
	char                                          UnknownData320[0x8];                                         // 0x320(0x08)
	char                                          bUseControllerRotationPitch : 0;                             // 0x328(0x01)
	char                                          bUseControllerRotationYaw : 0;                               // 0x328(0x01)
	char                                          bUseControllerRotationRoll : 0;                              // 0x328(0x01)
	char                                          bCanAffectNavigationGeneration : 0;                          // 0x328(0x01)
	char                                          UnknownData328[0x4];                                         // 0x328(0x04)
	float                                         BaseEyeHeight;                                               // 0x32c(0x04)
	char                                          AutoPossessPlayer;                                           // 0x330(0x01)
	enum class None                               AutoPossessAI;                                               // 0x331(0x01)
	uint16_t                                      RemoteViewPitch;                                             // 0x332(0x02)
	uint16_t                                      RemoteViewYaw;                                               // 0x334(0x02)
	char                                          UnknownData336[0x2];                                         // 0x336(0x02)
	struct FNone*                                 AIControllerClass;                                           // 0x338(0x08)
	struct FNone*                                 PlayerState;                                                 // 0x340(0x08)
	char                                          UnknownData348[0x8];                                         // 0x348(0x08)
	struct FNone*                                 LastHitBy;                                                   // 0x350(0x08)
	struct FNone*                                 Controller;                                                  // 0x358(0x08)
	char                                          UnknownData360[0x4];                                         // 0x360(0x04)
	struct FNone                                  ControlInputVector;                                          // 0x364(0x0c)
	struct FNone                                  LastControlInputVector;                                      // 0x370(0x0c)
	char                                          UnknownData37C[0x4];                                         // 0x37c(0x04)

	void SpawnDefaultController(); // sub_0x3d983a0
	void SetCanAffectNavigationGeneration(char bNewValue, char bForceUpdate); // sub_0x3d981d0
	void ReceiveUnpossessed(struct FNone* OldController); // sub_0x239bfb0
	void ReceivePossessed(struct FNone* NewController); // sub_0x239bfb0
	void PawnMakeNoise(float Loudness, struct FNone NoiseLocation, char bUseNoiseMakerLocation, struct FNone* NoiseMaker); // sub_0x3d98060
	void OnRep_PlayerState(); // sub_0x1f0eb10
	void OnRep_Controller(); // sub_0x3ca4850
	void LaunchPawn(struct FNone LaunchVelocity, char bXYOverride, char bZOverride); // sub_0x3d97e20
	struct FNone K2_GetMovementInputVector(); // sub_0x3d97c90
	char IsPlayerControlled(); // sub_0x3d97df0
	char IsPawnControlled(); // sub_0x3d97dc0
	char IsMoveInputIgnored(); // sub_0x3d97d60
	char IsLocallyControlled(); // sub_0x3d97d30
	char IsControlled(); // sub_0x3d97d00
	char IsBotControlled(); // sub_0x3d97cd0
	struct FNone GetPendingMovementInputVector(); // sub_0x3d97c90
	struct FNone GetNavAgentLocation(); // sub_0x3d97bd0
	struct FNone* GetMovementComponent(); // sub_0x3d97ba0
	struct FNone* GetMovementBaseActor(struct FNone* Pawn); // sub_0x3d97b20
	struct FNone GetLastMovementInputVector(); // sub_0x3d97ae0
	struct FNone GetControlRotation(); // sub_0x3d97a40
	struct FNone* GetController(); // sub_0x3d97a80
	struct FNone GetBaseAimRotation(); // sub_0x3d97940
	void DetachFromControllerPendingDestroy(); // sub_0x1f1ab10
	struct FNone ConsumeMovementInputVector(); // sub_0x3d97900
	void AddMovementInput(struct FNone WorldDirection, float ScaleValue, char bForce); // sub_0x3d97440
	void AddControllerYawInput(float Val); // sub_0x3d972e0
	void AddControllerRollInput(float Val); // sub_0x3d97260
	void AddControllerPitchInput(float Val); // sub_0x3d971e0
};

// Class Engine.MKCharacterEx
// Size: 0x398 (Inherited: 0x380)
struct AMKCharacterEx : APawn 
{
	char                                          UnknownData380[0x8];                                         // 0x380(0x08)
	struct FNone*                                 SelfCharacter;                                               // 0x388(0x08)
	char                                          UnknownData390[0x8];                                         // 0x390(0x08)
};

// Class Engine.Character
// Size: 0x5e0 (Inherited: 0x398)
struct ACharacter : AMKCharacterEx 
{
	struct FNone*                                 Mesh;                                                        // 0x398(0x08)
	struct FNone*                                 CharacterMovement;                                           // 0x3a0(0x08)
	struct FNone*                                 CapsuleComponent;                                            // 0x3a8(0x08)
	char                                          UnknownData3B0[0x8];                                         // 0x3b0(0x08)
	struct FNone                                  BasedMovement;                                               // 0x3b8(0x30)
	struct FNone                                  ReplicatedBasedMovement;                                     // 0x3e8(0x30)
	float                                         AnimRootMotionTranslationScale;                              // 0x418(0x04)
	struct FNone                                  BaseTranslationOffset;                                       // 0x41c(0x0c)
	char                                          UnknownData428[0x8];                                         // 0x428(0x08)
	struct FNone                                  BaseRotationOffset;                                          // 0x430(0x10)
	float                                         ReplicatedServerLastTransformUpdateTimeStamp;                // 0x440(0x04)
	float                                         ReplayLastTransformUpdateTimeStamp;                          // 0x444(0x04)
	char                                          ReplicatedMovementMode;                                      // 0x448(0x01)
	char                                          bInBaseReplication : 0;                                      // 0x449(0x01)
	char                                          UnknownData449[0x3];                                         // 0x449(0x03)
	float                                         CrouchedEyeHeight;                                           // 0x44c(0x04)
	char                                          bIsCrouched : 0;                                             // 0x450(0x01)
	char                                          bProxyIsJumpForceApplied : 0;                                // 0x450(0x01)
	char                                          bPressedJump : 0;                                            // 0x450(0x01)
	char                                          bClientUpdating : 0;                                         // 0x450(0x01)
	char                                          bClientWasFalling : 0;                                       // 0x450(0x01)
	char                                          bClientResimulateRootMotion : 0;                             // 0x450(0x01)
	char                                          bClientResimulateRootMotionSources : 0;                      // 0x450(0x01)
	char                                          bSimGravityDisabled : 0;                                     // 0x450(0x01)
	char                                          UnknownData450[0x1];                                         // 0x450(0x01)
	char                                          bClientCheckEncroachmentOnNetUpdate : 0;                     // 0x451(0x01)
	char                                          bServerMoveIgnoreRootMotion : 0;                             // 0x451(0x01)
	char                                          bWasJumping : 0;                                             // 0x451(0x01)
	char                                          UnknownData451[0x3];                                         // 0x451(0x03)
	float                                         JumpKeyHoldTime;                                             // 0x454(0x04)
	float                                         JumpForceTimeRemaining;                                      // 0x458(0x04)
	float                                         ProxyJumpForceStartedTime;                                   // 0x45c(0x04)
	float                                         JumpMaxHoldTime;                                             // 0x460(0x04)
	uint32_t                                      JumpMaxCount;                                                // 0x464(0x04)
	uint32_t                                      JumpCurrentCount;                                            // 0x468(0x04)
	char                                          UnknownData46C[0x4];                                         // 0x46c(0x04)
	struct FMulticastInlineDelegate               OnReachedJumpApex;                                           // 0x470(0x10)
	char                                          UnknownData480[0x10];                                        // 0x480(0x10)
	struct FMulticastInlineDelegate               MovementModeChangedDelegate;                                 // 0x490(0x10)
	struct FMulticastInlineDelegate               OnCharacterMovementUpdated;                                  // 0x4a0(0x10)
	struct FNone                                  SavedRootMotion;                                             // 0x4b0(0x38)
	char                                          UnknownData4E8[0x8];                                         // 0x4e8(0x08)
	struct FNone                                  ClientRootMotionParams;                                      // 0x4f0(0x40)
	struct TArray<None>                           RootMotionRepMoves;                                          // 0x530(0x10)
	struct FNone                                  RepRootMotion;                                               // 0x540(0x98)
	char                                          UnknownData5D8[0x8];                                         // 0x5d8(0x08)

	void UnCrouch(char bClientSimulation); // sub_0x201b240
	void StopJumping(); // sub_0x201c950
	void StopAnimMontage(struct FNone* AnimMontage); // sub_0x3c997d0
	void ServerMoveOld(float OldTimeStamp, struct FNone OldAccel, struct FNone InVel, char OldMoveFlags); // sub_0x3c99360
	void ServerMoveNoBase(float Timestamp, struct FNone InAccel, struct FNone InVel, struct FNone ClientLoc, char CompressedMoveFlags, char ClientRoll, uint32_t View, char ClientMovementMode); // sub_0x3c99070
	void ServerMoveDualNoBase(float TimeStamp0, struct FNone InAccel0, struct FNone InVel, char PendingFlags, uint32_t View0, float Timestamp, struct FNone InAccel, struct FNone ClientLoc, char NewFlags, char ClientRoll, uint32_t View, char ClientMovementMode); // sub_0x3c98c30
	void ServerMoveDualHybridRootMotion(float TimeStamp0, struct FNone InAccel0, struct FNone InVel, char PendingFlags, uint32_t View0, float Timestamp, struct FNone InAccel, struct FNone ClientLoc, char NewFlags, char ClientRoll, uint32_t View, struct FNone* ClientMovementBase, struct FName ClientBaseBoneName, char ClientMovementMode); // sub_0x3c98780
	void ServerMoveDual(float TimeStamp0, struct FNone InAccel0, struct FNone InVel, char PendingFlags, uint32_t View0, float Timestamp, struct FNone InAccel, struct FNone ClientLoc, char NewFlags, char ClientRoll, uint32_t View, struct FNone* ClientMovementBase, struct FName ClientBaseBoneName, char ClientMovementMode); // sub_0x3c982d0
	void ServerMove(float Timestamp, struct FNone InAccel, struct FNone InVel, struct FNone ClientLoc, char CompressedMoveFlags, char ClientRoll, uint32_t View, struct FNone* ClientMovementBase, struct FName ClientBaseBoneName, char ClientMovementMode); // sub_0x3c97f50
	void RootMotionDebugClientPrintOnScreen(struct FString inString); // sub_0x3c97ea0
	float PlayAnimMontage(struct FNone* AnimMontage, float InPlayRate, struct FName StartSectionName); // sub_0x3c97d90
	void OnWalkingOffLedge(struct FNone& PreviousFloorImpactNormal, struct FNone& PreviousFloorContactNormal, struct FNone& PreviousLocation, float TimeDelta); // sub_0x3c97bf0
	void OnRep_RootMotion(); // sub_0x3c97bd0
	void OnRep_ReplicatedBasedMovement(); // sub_0x3c97bb0
	void OnRep_ReplayLastTransformUpdateTimeStamp(); // sub_0x3c97b90
	void OnRep_IsCrouched(); // sub_0x3c97b70
	void OnLaunched(struct FNone LaunchVelocity, char bXYOverride, char bZOverride); // sub_0x239bfb0
	void OnLanded(struct FNone& Hit); // sub_0x239bfb0
	void OnJumped(); // sub_0x3c97b50
	void LaunchCharacter(struct FNone LaunchVelocity, char bXYOverride, char bZOverride); // sub_0x3c97a30
	void K2_UpdateCustomMovement(float DeltaTime); // sub_0x239bfb0
	void K2_OnStartCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // sub_0x239bfb0
	void K2_OnMovementModeChanged(char PrevMovementMode, char NewMovementMode, char PrevCustomMode, char NewCustomMode); // sub_0x239bfb0
	void K2_OnEndCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // sub_0x239bfb0
	void Jump(); // sub_0x201b2d0
	char IsPlayingRootMotion(); // sub_0x3c97a00
	char IsPlayingNetworkedRootMotionMontage(); // sub_0x3c979d0
	char IsJumpProvidingForce(); // sub_0x201b0c0
	char HasAnyRootMotion(); // sub_0x3c979a0
	struct FNone* GetCurrentMontage(); // sub_0x3c97310
	struct FNone GetBaseTranslationOffset(); // sub_0x3c972e0
	struct FNone GetBaseRotationOffsetRotator(); // sub_0x3c97290
	float GetAnimRootMotionTranslationScale(); // sub_0x3c97260
	void ForceLastAckMove(); // sub_0x3c97240
	void Crouch(char bClientSimulation); // sub_0x3c971b0
	void ClientVeryShortAdjustPosition(float Timestamp, struct FNone NewLoc, struct FNone* NewBase, struct FName NewBaseBoneName, char bHasBase, char bBaseRelativePosition, char ServerMovementMode); // sub_0x3c96e60
	void ClientCheatWalk(); // sub_0x1e98e80
	void ClientCheatGhost(); // sub_0x2013f90
	void ClientCheatFly(); // sub_0x337e300
	void ClientAdjustRootMotionSourcePosition(float Timestamp, struct FNone ServerRootMotion, char bHasAnimRootMotion, float ServerMontageTrackPosition, struct FNone ServerLoc, struct FNone ServerRotation, float ServerVelZ, struct FNone* ServerBase, struct FName ServerBoneName, char bHasBase, char bBaseRelativePosition, char ServerMovementMode); // sub_0x3c969a0
	void ClientAdjustRootMotionPosition(float Timestamp, float ServerMontageTrackPosition, struct FNone ServerLoc, struct FNone ServerRotation, float ServerVelZ, struct FNone* ServerBase, struct FName ServerBoneName, char bHasBase, char bBaseRelativePosition, char ServerMovementMode); // sub_0x3c966b0
	void ClientAdjustPosition(float Timestamp, struct FNone NewLoc, struct FNone NewVel, struct FNone* NewBase, struct FName NewBaseBoneName, char bHasBase, char bBaseRelativePosition, char ServerMovementMode); // sub_0x3c96440
	void ClientAckGoodMove(float Timestamp); // sub_0x3c963c0
	char CanJumpInternal(); // sub_0x3c96390
	char CanJump(); // sub_0x3c96360
	char CanCrouch(); // sub_0x3c96330
	void CacheInitialMeshOffset(struct FNone MeshRelativeLocation, struct FNone MeshRelativeRotation); // sub_0x3c96250
};

// Class Engine.SplineComponent
// Size: 0x5b0 (Inherited: 0x4c0)
struct USplineComponent : UPrimitiveComponent 
{
	struct FNone                                  SplineCurves;                                                // 0x4b8(0x68)
	struct FNone                                  SplineInfo;                                                  // 0x520(0x18)
	struct FNone                                  SplineRotInfo;                                               // 0x538(0x18)
	struct FNone                                  SplineScaleInfo;                                             // 0x550(0x18)
	struct FNone                                  SplineReparamTable;                                          // 0x568(0x18)
	char                                          bAllowSplineEditingPerInstance : 0;                          // 0x580(0x01)
	uint32_t                                      ReparamStepsPerSegment;                                      // 0x584(0x04)
	float                                         Duration;                                                    // 0x588(0x04)
	char                                          bStationaryEndpoints : 0;                                    // 0x58c(0x01)
	char                                          bSplineHasBeenEdited : 0;                                    // 0x58d(0x01)
	char                                          bModifiedByConstructionScript : 0;                           // 0x58e(0x01)
	char                                          bInputSplinePointsToConstructionScript : 0;                  // 0x58f(0x01)
	char                                          bDrawDebug : 0;                                              // 0x590(0x01)
	char                                          UnknownData590[0x1];                                         // 0x590(0x01)
	char                                          bClosedLoop : 0;                                             // 0x591(0x01)
	char                                          UnknownData591[0x1];                                         // 0x591(0x01)
	char                                          bLoopPositionOverride : 0;                                   // 0x592(0x01)
	char                                          UnknownData592[0x2];                                         // 0x592(0x02)
	float                                         LoopPosition;                                                // 0x594(0x04)
	struct FNone                                  DefaultUpVector;                                             // 0x598(0x0c)
	char                                          UnknownData5A4[0xc];                                         // 0x5a4(0x0c)

	void UpdateSpline(); // sub_0x3df4ee0
	void SetWorldLocationAtSplinePoint(uint32_t PointIndex, struct FNone& InLocation); // sub_0x3df4e00
	void SetUpVectorAtSplinePoint(uint32_t PointIndex, struct FNone& InUpVector, char CoordinateSpace, char bUpdateSpline); // sub_0x3df4ca0
	void SetUnselectedSplineSegmentColor(struct FNone& SegmentColor); // sub_0x3df4490
	void SetTangentsAtSplinePoint(uint32_t PointIndex, struct FNone& InArriveTangent, struct FNone& InLeaveTangent, char CoordinateSpace, char bUpdateSpline); // sub_0x3df4ae0
	void SetTangentAtSplinePoint(uint32_t PointIndex, struct FNone& InTangent, char CoordinateSpace, char bUpdateSpline); // sub_0x3df4980
	void SetSplineWorldPoints(struct TArray<None>& Points); // sub_0x3df48d0
	void SetSplinePointType(uint32_t PointIndex, char Type, char bUpdateSpline); // sub_0x3df46a0
	void SetSplinePoints(struct TArray<None>& Points, char CoordinateSpace, char bUpdateSpline); // sub_0x3df47a0
	void SetSplineLocalPoints(struct TArray<None>& Points); // sub_0x3df45f0
	void SetSelectedSplineSegmentColor(struct FNone& SegmentColor); // sub_0x3df4490
	void SetLocationAtSplinePoint(uint32_t PointIndex, struct FNone& InLocation, char CoordinateSpace, char bUpdateSpline); // sub_0x3df4330
	void SetDrawDebug(char bShow); // sub_0x3df42a0
	void SetDefaultUpVector(struct FNone& UpVector, char CoordinateSpace); // sub_0x3df41c0
	void SetClosedLoopAtPosition(char bInClosedLoop, float Key, char bUpdateSpline); // sub_0x3df40b0
	void SetClosedLoop(char bInClosedLoop, char bUpdateSpline); // sub_0x3df3fe0
	void RemoveSplinePoint(uint32_t Index, char bUpdateSpline); // sub_0x3df3f20
	char IsClosedLoop(); // sub_0x3df3ef0
	struct FNone GetWorldTangentAtDistanceAlongSpline(float Distance); // sub_0x3df3e40
	struct FNone GetWorldRotationAtTime(float Time, char bUseConstantVelocity); // sub_0x3df3d50
	struct FNone GetWorldRotationAtDistanceAlongSpline(float Distance); // sub_0x3df3ca0
	struct FNone GetWorldLocationAtTime(float Time, char bUseConstantVelocity); // sub_0x3df3bb0
	struct FNone GetWorldLocationAtSplinePoint(uint32_t PointIndex); // sub_0x3df3b00
	struct FNone GetWorldLocationAtDistanceAlongSpline(float Distance); // sub_0x3df3a50
	struct FNone GetWorldDirectionAtTime(float Time, char bUseConstantVelocity); // sub_0x3df3960
	struct FNone GetWorldDirectionAtDistanceAlongSpline(float Distance); // sub_0x3df38b0
	struct FNone GetVectorPropertyAtSplinePoint(uint32_t Index, struct FName PropertyName); // sub_0x3df37e0
	struct FNone GetVectorPropertyAtSplineInputKey(float InKey, struct FName PropertyName); // sub_0x3df3700
	struct FNone GetUpVectorAtTime(float Time, char CoordinateSpace, char bUseConstantVelocity); // sub_0x3df35e0
	struct FNone GetUpVectorAtSplinePoint(uint32_t PointIndex, char CoordinateSpace); // sub_0x3df3510
	struct FNone GetUpVectorAtSplineInputKey(float InKey, char CoordinateSpace); // sub_0x3df3430
	struct FNone GetUpVectorAtDistanceAlongSpline(float Distance, char CoordinateSpace); // sub_0x3df3350
	struct FNone GetTransformAtTime(float Time, char CoordinateSpace, char bUseConstantVelocity, char bUseScale); // sub_0x3df31c0
	struct FNone GetTransformAtSplinePoint(uint32_t PointIndex, char CoordinateSpace, char bUseScale); // sub_0x3df3080
	struct FNone GetTransformAtSplineInputKey(float InKey, char CoordinateSpace, char bUseScale); // sub_0x3df2f30
	struct FNone GetTransformAtDistanceAlongSpline(float Distance, char CoordinateSpace, char bUseScale); // sub_0x3df2de0
	struct FNone GetTangentAtTime(float Time, char CoordinateSpace, char bUseConstantVelocity); // sub_0x3df2cc0
	struct FNone GetTangentAtSplinePoint(uint32_t PointIndex, char CoordinateSpace); // sub_0x3df14a0
	struct FNone GetTangentAtSplineInputKey(float InKey, char CoordinateSpace); // sub_0x3df2be0
	struct FNone GetTangentAtDistanceAlongSpline(float Distance, char CoordinateSpace); // sub_0x3df2b00
	char GetSplinePointType(uint32_t PointIndex); // sub_0x3df2a70
	float GetSplineLength(); // sub_0x3df2a40
	struct FNone GetScaleAtTime(float Time, char bUseConstantVelocity); // sub_0x3df28d0
	struct FNone GetScaleAtSplinePoint(uint32_t PointIndex); // sub_0x3df2830
	struct FNone GetScaleAtSplineInputKey(float InKey); // sub_0x3df2790
	struct FNone GetScaleAtDistanceAlongSpline(float Distance); // sub_0x3df26f0
	struct FNone GetRotationAtTime(float Time, char CoordinateSpace, char bUseConstantVelocity); // sub_0x3df25d0
	struct FNone GetRotationAtSplinePoint(uint32_t PointIndex, char CoordinateSpace); // sub_0x3df2500
	struct FNone GetRotationAtSplineInputKey(float InKey, char CoordinateSpace); // sub_0x3df2420
	struct FNone GetRotationAtDistanceAlongSpline(float Distance, char CoordinateSpace); // sub_0x3df2340
	float GetRollAtTime(float Time, char CoordinateSpace, char bUseConstantVelocity); // sub_0x3df2230
	float GetRollAtSplinePoint(uint32_t PointIndex, char CoordinateSpace); // sub_0x3df2170
	float GetRollAtSplineInputKey(float InKey, char CoordinateSpace); // sub_0x3df20a0
	float GetRollAtDistanceAlongSpline(float Distance, char CoordinateSpace); // sub_0x3df1fd0
	struct FNone GetRightVectorAtTime(float Time, char CoordinateSpace, char bUseConstantVelocity); // sub_0x3df1eb0
	struct FNone GetRightVectorAtSplinePoint(uint32_t PointIndex, char CoordinateSpace); // sub_0x3df1de0
	struct FNone GetRightVectorAtSplineInputKey(float InKey, char CoordinateSpace); // sub_0x3df1d00
	struct FNone GetRightVectorAtDistanceAlongSpline(float Distance, char CoordinateSpace); // sub_0x3df1c20
	uint32_t GetNumberOfSplineSegments(); // sub_0x3df1bf0
	uint32_t GetNumberOfSplinePoints(); // sub_0x3df1bc0
	struct FNone GetLocationAtTime(float Time, char CoordinateSpace, char bUseConstantVelocity); // sub_0x3df1aa0
	struct FNone GetLocationAtSplinePoint(uint32_t PointIndex, char CoordinateSpace); // sub_0x3df19d0
	struct FNone GetLocationAtSplineInputKey(float InKey, char CoordinateSpace); // sub_0x3df18f0
	struct FNone GetLocationAtDistanceAlongSpline(float Distance, char CoordinateSpace); // sub_0x3df1810
	void GetLocationAndTangentAtSplinePoint(uint32_t PointIndex, struct FNone& Location, struct FNone& Tangent, char CoordinateSpace); // sub_0x3df16a0
	void GetLocalLocationAndTangentAtSplinePoint(uint32_t PointIndex, struct FNone& LocalLocation, struct FNone& LocalTangent); // sub_0x3df1570
	struct FNone GetLeaveTangentAtSplinePoint(uint32_t PointIndex, char CoordinateSpace); // sub_0x3df14a0
	float GetInputKeyAtDistanceAlongSpline(float Distance); // sub_0x3df1410
	float GetFloatPropertyAtSplinePoint(uint32_t Index, struct FName PropertyName); // sub_0x3df1350
	float GetFloatPropertyAtSplineInputKey(float InKey, struct FName PropertyName); // sub_0x3df1280
	float GetDistanceAlongSplineAtSplinePoint(uint32_t PointIndex); // sub_0x3df11f0
	struct FNone GetDirectionAtTime(float Time, char CoordinateSpace, char bUseConstantVelocity); // sub_0x3df10d0
	struct FNone GetDirectionAtSplinePoint(uint32_t PointIndex, char CoordinateSpace); // sub_0x3df1000
	struct FNone GetDirectionAtSplineInputKey(float InKey, char CoordinateSpace); // sub_0x3df0f20
	struct FNone GetDirectionAtDistanceAlongSpline(float Distance, char CoordinateSpace); // sub_0x3df0e40
	struct FNone GetDefaultUpVector(char CoordinateSpace); // sub_0x3df0da0
	struct FNone GetArriveTangentAtSplinePoint(uint32_t PointIndex, char CoordinateSpace); // sub_0x3df0cd0
	struct FNone FindUpVectorClosestToWorldLocation(struct FNone& WorldLocation, char CoordinateSpace); // sub_0x3df0be0
	struct FNone FindTransformClosestToWorldLocation(struct FNone& WorldLocation, char CoordinateSpace, char bUseScale); // sub_0x3df0a90
	struct FNone FindTangentClosestToWorldLocation(struct FNone& WorldLocation, char CoordinateSpace); // sub_0x3df09a0
	struct FNone FindScaleClosestToWorldLocation(struct FNone& WorldLocation); // sub_0x3df08f0
	struct FNone FindRotationClosestToWorldLocation(struct FNone& WorldLocation, char CoordinateSpace); // sub_0x3df0800
	float FindRollClosestToWorldLocation(struct FNone& WorldLocation, char CoordinateSpace); // sub_0x3df0720
	struct FNone FindRightVectorClosestToWorldLocation(struct FNone& WorldLocation, char CoordinateSpace); // sub_0x3df0630
	struct FNone FindLocationClosestToWorldLocation(struct FNone& WorldLocation, char CoordinateSpace); // sub_0x3df0540
	float FindInputKeyClosestToWorldLocation(struct FNone& WorldLocation); // sub_0x3df04a0
	struct FNone FindDirectionClosestToWorldLocation(struct FNone& WorldLocation, char CoordinateSpace); // sub_0x3df03b0
	void ClearSplinePoints(char bUpdateSpline); // sub_0x3df0320
	void AddSplineWorldPoint(struct FNone& Position); // sub_0x3df0280
	void AddSplinePointAtIndex(struct FNone& Position, uint32_t Index, char CoordinateSpace, char bUpdateSpline); // sub_0x3df0120
	void AddSplinePoint(struct FNone& Position, char CoordinateSpace, char bUpdateSpline); // sub_0x3df0010
	void AddSplineLocalPoint(struct FNone& Position); // sub_0x3deff80
	void AddPoints(struct TArray<None>& Points, char bUpdateSpline); // sub_0x3defe80
	void AddPoint(struct FNone& Point, char bUpdateSpline); // sub_0x3defd70
};

// Class Engine.Commandlet
// Size: 0x80 (Inherited: 0x28)
struct UCommandlet : UObject 
{
	struct FString                                HelpDescription;                                             // 0x28(0x10)
	struct FString                                HelpUsage;                                                   // 0x38(0x10)
	struct FString                                HelpWebLink;                                                 // 0x48(0x10)
	struct TArray<None>                           HelpParamNames;                                              // 0x58(0x10)
	struct TArray<None>                           HelpParamDescriptions;                                       // 0x68(0x10)
	char                                          IsServer : 0;                                                // 0x78(0x01)
	char                                          IsClient : 0;                                                // 0x78(0x01)
	char                                          IsEditor : 0;                                                // 0x78(0x01)
	char                                          LogToConsole : 0;                                            // 0x78(0x01)
	char                                          ShowErrorCount : 0;                                          // 0x78(0x01)
	char                                          ShowProgress : 0;                                            // 0x78(0x01)
	char                                          UnknownData78[0x8];                                          // 0x78(0x08)
};

// Class Engine.AudioComponent
// Size: 0x820 (Inherited: 0x240)
struct UAudioComponent : USceneComponent 
{
	struct FNone*                                 Sound;                                                       // 0x238(0x08)
	struct TArray<None>                           InstanceParameters;                                          // 0x240(0x10)
	struct FNone*                                 SoundClassOverride;                                          // 0x250(0x08)
	char                                          bAutoDestroy : 0;                                            // 0x258(0x01)
	char                                          bStopWhenOwnerDestroyed : 0;                                 // 0x258(0x01)
	char                                          bShouldRemainActiveIfDropped : 0;                            // 0x258(0x01)
	char                                          bAllowSpatialization : 0;                                    // 0x258(0x01)
	char                                          bOverrideAttenuation : 0;                                    // 0x258(0x01)
	char                                          bOverrideSubtitlePriority : 0;                               // 0x258(0x01)
	char                                          bIsUISound : 0;                                              // 0x258(0x01)
	char                                          bEnableLowPassFilter : 0;                                    // 0x258(0x01)
	char                                          bOverridePriority : 0;                                       // 0x259(0x01)
	char                                          bSuppressSubtitles : 0;                                      // 0x259(0x01)
	char                                          bAutoManageAttachment : 0;                                   // 0x25a(0x01)
	struct FName                                  AudioComponentUserID;                                        // 0x260(0x08)
	float                                         PitchModulationMin;                                          // 0x268(0x04)
	float                                         PitchModulationMax;                                          // 0x26c(0x04)
	float                                         VolumeModulationMin;                                         // 0x270(0x04)
	float                                         VolumeModulationMax;                                         // 0x274(0x04)
	float                                         VolumeMultiplier;                                            // 0x278(0x04)
	uint32_t                                      EnvelopeFollowerAttackTime;                                  // 0x27c(0x04)
	uint32_t                                      EnvelopeFollowerReleaseTime;                                 // 0x280(0x04)
	float                                         Priority;                                                    // 0x284(0x04)
	float                                         SubtitlePriority;                                            // 0x288(0x04)
	char                                          UnknownData28C[0x4];                                         // 0x28c(0x04)
	struct FNone*                                 SourceEffectChain;                                           // 0x290(0x08)
	float                                         PitchMultiplier;                                             // 0x298(0x04)
	float                                         LowPassFilterFrequency;                                      // 0x29c(0x04)
	char                                          UnknownData2A0[0x8];                                         // 0x2a0(0x08)
	struct FNone*                                 AttenuationSettings;                                         // 0x2a8(0x08)
	struct FNone                                  AttenuationOverrides;                                        // 0x2b0(0x3a0)
	struct FNone*                                 ConcurrencySettings;                                         // 0x650(0x08)
	struct TSet<None>                             ConcurrencySet;                                              // 0x658(0x50)
	char                                          UnknownData6A8[0xc];                                         // 0x6a8(0x0c)
	enum class None                               AutoAttachLocationRule;                                      // 0x6b4(0x01)
	enum class None                               AutoAttachRotationRule;                                      // 0x6b5(0x01)
	enum class None                               AutoAttachScaleRule;                                         // 0x6b6(0x01)
	char                                          UnknownData6B7[0x1];                                         // 0x6b7(0x01)
	struct FMulticastInlineDelegate               OnAudioFinished;                                             // 0x6b8(0x10)
	char                                          UnknownData6C8[0x18];                                        // 0x6c8(0x18)
	struct FMulticastInlineDelegate               OnAudioPlaybackPercent;                                      // 0x6e0(0x10)
	char                                          UnknownData6F0[0x18];                                        // 0x6f0(0x18)
	struct FMulticastInlineDelegate               OnAudioSingleEnvelopeValue;                                  // 0x708(0x10)
	char                                          UnknownData718[0x18];                                        // 0x718(0x18)
	struct FMulticastInlineDelegate               OnAudioMultiEnvelopeValue;                                   // 0x730(0x10)
	char                                          UnknownData740[0x18];                                        // 0x740(0x18)
	struct FNone                                  Modulation;                                                  // 0x758(0x10)
	struct FDelegate                              OnQueueSubtitles;                                            // 0x768(0x10)
	struct TWeakObjectPtr<struct FNone>           AutoAttachParent;                                            // 0x778(0x08)
	struct FName                                  AutoAttachSocketName;                                        // 0x780(0x08)
	char                                          UnknownData788[0x98];                                        // 0x788(0x98)

	void StopDelayed(float DelayTime); // sub_0x3c759a0
	void Stop(); // sub_0x3c75980
	void SetWaveParameter(struct FName InName, struct FNone* InWave); // sub_0x3c758c0
	void SetVolumeMultiplier(float NewVolumeMultiplier); // sub_0x3c75840
	void SetUISound(char bInUISound); // sub_0x3c757b0
	void SetSubmixSend(struct FNone* Submix, float SendLevel); // sub_0x3c756e0
	void SetSourceBusSendPreEffect(struct FNone* SoundSourceBus, float SourceBusSendLevel); // sub_0x3c75610
	void SetSourceBusSendPostEffect(struct FNone* SoundSourceBus, float SourceBusSendLevel); // sub_0x3c75540
	void SetSound(struct FNone* NewSound); // sub_0x3c754c0
	void SetPitchMultiplier(float NewPitchMultiplier); // sub_0x3c75310
	void SetPaused(char bPause); // sub_0x3c75280
	void SetLowPassFilterFrequency(float InLowPassFilterFrequency); // sub_0x3c75200
	void SetLowPassFilterEnabled(char InLowPassFilterEnabled); // sub_0x3c75170
	void SetIntParameter(struct FName InName, uint32_t inInt); // sub_0x3c75010
	void SetFloatParameter(struct FName InName, float InFloat); // sub_0x3c74f40
	void SetBoolParameter(struct FName InName, char InBool); // sub_0x3c74de0
	void Play(float StartTime); // sub_0x3c74d60
	char IsPlaying(); // sub_0x3c74d10
	char HasCookedFFTData(); // sub_0x3c74ce0
	char HasCookedAmplitudeEnvelopeData(); // sub_0x3c74cb0
	enum class None GetPlayState(); // sub_0x3c74c80
	char GetCookedFFTDataForAllPlayingSounds(struct TArray<None>& OutSoundWaveSpectralData); // sub_0x3c74ba0
	char GetCookedFFTData(struct TArray<None>& FrequenciesToGet, struct TArray<None>& OutSoundWaveSpectralData); // sub_0x3c74a70
	char GetCookedEnvelopeDataForAllPlayingSounds(struct TArray<None>& OutEnvelopeData); // sub_0x3c749b0
	char GetCookedEnvelopeData(float& OutEnvelopeData); // sub_0x3c74900
	void FadeOut(float FadeOutDuration, float FadeVolumeLevel, enum class None FadeCurve); // sub_0x3c747f0
	void FadeIn(float FadeInDuration, float FadeVolumeLevel, float StartTime, enum class None FadeCurve); // sub_0x3c746a0
	char BP_GetAttenuationSettingsToApply(struct FNone& OutAttenuationSettings); // sub_0x3c745d0
	void AdjustVolume(float AdjustVolumeDuration, float AdjustVolumeLevel, enum class None FadeCurve); // sub_0x3c744d0
	void AdjustAttenuation(struct FNone& InAttenuationSettings); // sub_0x3c74400
};

// Class Engine.AssetImportData
// Size: 0x28 (Inherited: 0x28)
struct UAssetImportData : UObject 
{
};

// Class Engine.AssetUserData
// Size: 0x28 (Inherited: 0x28)
struct UAssetUserData : UObject 
{
};

// Class Engine.SaveGame
// Size: 0x28 (Inherited: 0x28)
struct USaveGame : UObject 
{
};

// Class Engine.Info
// Size: 0x310 (Inherited: 0x310)
struct AInfo : AActor 
{
};

// Class Engine.GameModeBase
// Size: 0x3b0 (Inherited: 0x310)
struct AGameModeBase : AInfo 
{
	struct FString                                OptionsString;                                               // 0x310(0x10)
	struct FNone*                                 GameSessionClass;                                            // 0x320(0x08)
	struct FNone*                                 GameStateClass;                                              // 0x328(0x08)
	struct FNone*                                 PlayerControllerClass;                                       // 0x330(0x08)
	struct FNone*                                 PlayerStateClass;                                            // 0x338(0x08)
	struct FNone*                                 HUDClass;                                                    // 0x340(0x08)
	struct FNone*                                 DefaultPawnClass;                                            // 0x348(0x08)
	struct FNone*                                 SpectatorClass;                                              // 0x350(0x08)
	struct FNone*                                 ReplaySpectatorPlayerControllerClass;                        // 0x358(0x08)
	struct FNone*                                 ServerStatReplicatorClass;                                   // 0x360(0x08)
	struct FNone*                                 GameSession;                                                 // 0x368(0x08)
	struct FNone*                                 GameState;                                                   // 0x370(0x08)
	struct FNone*                                 ServerStatReplicator;                                        // 0x378(0x08)
	struct FText                                  DefaultPlayerName;                                           // 0x380(0x18)
	char                                          bUseSeamlessTravel : 0;                                      // 0x398(0x01)
	char                                          bStartPlayersAsSpectators : 0;                               // 0x398(0x01)
	char                                          bPauseable : 0;                                              // 0x398(0x01)
	char                                          UnknownData398[0x18];                                        // 0x398(0x18)

	void StartPlay(); // sub_0x3ccb780
	struct FNone* SpawnDefaultPawnFor(struct FNone* NewPlayer, struct FNone* StartSpot); // sub_0x3ccb690
	struct FNone* SpawnDefaultPawnAtTransform(struct FNone* NewPlayer, struct FNone& SpawnTransform); // sub_0x3ccb570
	char ShouldReset(struct FNone* ActorToReset); // sub_0x3ccb4d0
	void ReturnToMainMenuHost(); // sub_0x3ccb380
	void RestartPlayerAtTransform(struct FNone* NewPlayer, struct FNone& SpawnTransform); // sub_0x3ccb260
	void RestartPlayerAtPlayerStart(struct FNone* NewPlayer, struct FNone* StartSpot); // sub_0x3ccb190
	void RestartPlayer(struct FNone* NewPlayer); // sub_0x3ccb100
	void ResetLevel(); // sub_0x3ccb0c0
	char PlayerCanRestart(struct FNone* Player); // sub_0x3ccafc0
	char MustSpectate(struct FNone* NewPlayerController); // sub_0x3ccaf20
	void K2_PostLogin(struct FNone* NewPlayer); // sub_0x239bfb0
	void K2_OnSwapPlayerControllers(struct FNone* OldPC, struct FNone* NewPC); // sub_0x239bfb0
	void K2_OnRestartPlayer(struct FNone* NewPlayer); // sub_0x239bfb0
	void K2_OnLogout(struct FNone* ExitingController); // sub_0x239bfb0
	void K2_OnChangeName(struct FNone* Other, struct FString NewName, char bNameChange); // sub_0x239bfb0
	struct FNone* K2_FindPlayerStart(struct FNone* Player, struct FString IncomingName); // sub_0x3ccae30
	void InitStartSpot(struct FNone* StartSpot, struct FNone* NewPlayer); // sub_0x3ccad30
	void InitializeHUDForPlayer(struct FNone* NewPlayer); // sub_0x3cb5c50
	char HasMatchStarted(); // sub_0x3ccad00
	void HandleStartingNewPlayer(struct FNone* NewPlayer); // sub_0x3ccac40
	uint32_t GetNumSpectators(); // sub_0x3ccac10
	uint32_t GetNumPlayers(); // sub_0x3ccabe0
	struct FNone* GetDefaultPawnClassForController(struct FNone* InController); // sub_0x3ccab20
	struct FNone* FindPlayerStart(struct FNone* Player, struct FString IncomingName); // sub_0x3ccaa20
	struct FNone* ChoosePlayerStart(struct FNone* Player); // sub_0x3cca840
	void ChangeName(struct FNone* Controller, struct FString NewName, char bNameChange); // sub_0x3cca710
	char CanSpectate(struct FNone* Viewer, struct FNone* ViewTarget); // sub_0x3cca640
};

// Class Engine.GameMode
// Size: 0x3f8 (Inherited: 0x3b0)
struct AGameMode : AGameModeBase 
{
	struct FName                                  MatchState;                                                  // 0x3b0(0x08)
	char                                          bDelayedStart : 0;                                           // 0x3b8(0x01)
	char                                          UnknownData3B8[0x4];                                         // 0x3b8(0x04)
	uint32_t                                      NumSpectators;                                               // 0x3bc(0x04)
	uint32_t                                      NumPlayers;                                                  // 0x3c0(0x04)
	uint32_t                                      NumBots;                                                     // 0x3c4(0x04)
	float                                         MinRespawnDelay;                                             // 0x3c8(0x04)
	uint32_t                                      NumTravellingPlayers;                                        // 0x3cc(0x04)
	struct FNone*                                 EngineMessageClass;                                          // 0x3d0(0x08)
	struct TArray<None>                           InactivePlayerArray;                                         // 0x3d8(0x10)
	float                                         InactivePlayerStateLifeSpan;                                 // 0x3e8(0x04)
	uint32_t                                      MaxInactivePlayers;                                          // 0x3ec(0x04)
	char                                          bHandleDedicatedServerReplays : 0;                           // 0x3f0(0x01)
	char                                          UnknownData3F0[0x8];                                         // 0x3f0(0x08)

	void StartMatch(); // sub_0x3ccb760
	void SetBandwidthLimit(float AsyncIOBandwidthLimit); // sub_0x3ccb450
	void Say(struct FString Msg); // sub_0x3ccb3a0
	void RestartGame(); // sub_0x3ccb0e0
	char ReadyToStartMatch(); // sub_0x3ccb090
	char ReadyToEndMatch(); // sub_0x3ccb060
	void K2_OnSetMatchState(struct FName NewState); // sub_0x239bfb0
	char IsMatchInProgress(); // sub_0x3ccae00
	char HasMatchEnded(); // sub_0x3ccacd0
	struct FName GetMatchState(); // sub_0x3ccabc0
	void EndMatch(); // sub_0x3ccaa00
	void AbortMatch(); // sub_0x20129a0
};

// Class Engine.GameStateBase
// Size: 0x360 (Inherited: 0x310)
struct AGameStateBase : AInfo 
{
	struct FNone*                                 GameModeClass;                                               // 0x310(0x08)
	struct FNone*                                 AuthorityGameMode;                                           // 0x318(0x08)
	struct FNone*                                 SpectatorClass;                                              // 0x320(0x08)
	struct TArray<None>                           PlayerArray;                                                 // 0x328(0x10)
	char                                          bReplicatedHasBegunPlay : 0;                                 // 0x338(0x01)
	char                                          UnknownData338[0x4];                                         // 0x338(0x04)
	float                                         ReplicatedWorldTimeSeconds;                                  // 0x33c(0x04)
	float                                         ServerWorldTimeSecondsDelta;                                 // 0x340(0x04)
	float                                         ServerWorldTimeSecondsUpdateFrequency;                       // 0x344(0x04)
	char                                          UnknownData348[0x18];                                        // 0x348(0x18)

	void OnRep_SpectatorClass(); // sub_0x1f0eb10
	void OnRep_ReplicatedWorldTimeSeconds(); // sub_0x1f9a560
	void OnRep_ReplicatedHasBegunPlay(); // sub_0x1f0eb30
	void OnRep_GameModeClass(); // sub_0x3ca4850
	char HasMatchStarted(); // sub_0x3cdaef0
	char HasBegunPlay(); // sub_0x3cdaec0
	float GetServerWorldTimeSeconds(); // sub_0x3cdadf0
	float GetPlayerStartTime(struct FNone* Controller); // sub_0x3cda900
	float GetPlayerRespawnDelay(struct FNone* Controller); // sub_0x3cda860
};

// Class Engine.GameState
// Size: 0x380 (Inherited: 0x360)
struct AGameState : AGameStateBase 
{
	struct FName                                  MatchState;                                                  // 0x360(0x08)
	struct FName                                  PreviousMatchState;                                          // 0x368(0x08)
	uint32_t                                      ElapsedTime;                                                 // 0x370(0x04)
	char                                          UnknownData374[0xc];                                         // 0x374(0x0c)

	void OnRep_MatchState(); // sub_0x3ccb0c0
	void OnRep_ElapsedTime(); // sub_0x3ccb380
};

// Class Engine.Controller
// Size: 0x3b0 (Inherited: 0x310)
struct AController : AActor 
{
	char                                          UnknownData310[0x38];                                        // 0x310(0x38)
	struct FNone*                                 PlayerState;                                                 // 0x348(0x08)
	char                                          UnknownData350[0x38];                                        // 0x350(0x38)
	struct FMulticastInlineDelegate               OnInstigatedAnyDamage;                                       // 0x388(0x10)
	struct FName                                  StateName;                                                   // 0x324(0x08)
	struct FNone*                                 Pawn;                                                        // 0x378(0x08)
	struct FNone*                                 Character;                                                   // 0x338(0x08)
	struct FNone*                                 TransformComponent;                                          // 0x330(0x08)
	struct FNone                                  ControlRotation;                                             // 0x39c(0x0c)
	char                                          bAttachToPawn : 0;                                           // 0x32c(0x01)

	void UnPossess(); // sub_0x3ca4bb0
	void StopMovement(); // sub_0x1f1ab10
	void SetInitialLocationAndRotation(struct FNone& NewLocation, struct FNone& NewRotation); // sub_0x3ca4ac0
	void SetIgnoreMoveInput(char bNewMoveInput); // sub_0x3ca4a30
	void SetIgnoreLookInput(char bNewLookInput); // sub_0x3ca49a0
	void SetControlRotation(struct FNone& NewRotation); // sub_0x3ca4910
	void ResetIgnoreMoveInput(); // sub_0x201af20
	void ResetIgnoreLookInput(); // sub_0x1e41730
	void ResetIgnoreInputFlags(); // sub_0x3ca48f0
	void ReceiveUnPossess(struct FNone* UnpossessedPawn); // sub_0x239bfb0
	void ReceivePossess(struct FNone* PossessedPawn); // sub_0x239bfb0
	void ReceiveInstigatedAnyDamage(float Damage, struct FNone* DamageType, struct FNone* DamagedActor, struct FNone* DamageCauser); // sub_0x239bfb0
	void Possess(struct FNone* InPawn); // sub_0x3ca4870
	void OnRep_PlayerState(); // sub_0x3ca4850
	void OnRep_Pawn(); // sub_0x11cdb40
	char LineOfSightTo(struct FNone* Other, struct FNone ViewPoint, char bAlternateChecks); // sub_0x3ca4730
	struct FNone* K2_GetPawn(); // sub_0x3ca4700
	char IsPlayerController(); // sub_0x3ca46d0
	char IsMoveInputIgnored(); // sub_0x3ca46a0
	char IsLookInputIgnored(); // sub_0x3ca4670
	char IsLocalPlayerController(); // sub_0x3ca4620
	char IsLocalController(); // sub_0x3ca45f0
	struct FNone* GetViewTarget(); // sub_0x3ca45c0
	struct FNone GetDesiredRotation(); // sub_0x3ca4580
	struct FNone GetControlRotation(); // sub_0x3ca4540
	void ClientSetRotation(struct FNone NewRotation, char bResetCamera); // sub_0x3ca4460
	void ClientSetLocation(struct FNone NewLocation, struct FNone NewRotation); // sub_0x3ca4380
	struct FNone* CastToPlayerController(); // sub_0x3ca4350
};

// Class Engine.MKPlayerControllerEx
// Size: 0x3b8 (Inherited: 0x3b0)
struct AMKPlayerControllerEx : AController 
{
	struct FNone*                                 SelfPlayerController;                                        // 0x3b0(0x08)
};

// Class Engine.PlayerController
// Size: 0x6f0 (Inherited: 0x3b8)
struct APlayerController : AMKPlayerControllerEx 
{
	char                                          UnknownData3B8[0x158];                                       // 0x3b8(0x158)
	struct FNone*                                 Player;                                                      // 0x510(0x08)
	struct FNone*                                 AcknowledgedPawn;                                            // 0x428(0x08)
	struct FNone*                                 ControllingDirTrackInst;                                     // 0x4f8(0x08)
	char                                          UnknownData528[0xc0];                                        // 0x528(0xc0)
	struct FNone*                                 MyHUD;                                                       // 0x5e8(0x08)
	struct FNone*                                 PlayerCameraManager;                                         // 0x438(0x08)
	struct FNone*                                 PlayerCameraManagerClass;                                    // 0x480(0x08)
	char                                          UnknownData600[0xe4];                                        // 0x600(0xe4)
	char                                          bAutoManageActiveCameraTarget : 0;                           // 0x6e4(0x01)
	struct FNone                                  TargetViewRotation;                                          // 0x664(0x0c)
	float                                         SmoothTargetViewRotationSpeed;                               // 0x640(0x04)
	struct TArray<None>                           HiddenActors;                                                // 0x5b8(0x10)
	struct TArray<None>                           HiddenPrimitiveComponents;                                   // 0x4d0(0x10)
	float                                         LastSpectatorStateSynchTime;                                 // 0x674(0x04)
	struct FNone                                  LastSpectatorSyncLocation;                                   // 0x558(0x0c)
	struct FNone                                  LastSpectatorSyncRotation;                                   // 0x45c(0x0c)
	uint32_t                                      ClientCap;                                                   // 0x478(0x04)
	struct FNone*                                 CheatManager;                                                // 0x568(0x08)
	struct FNone*                                 CheatClass;                                                  // 0x590(0x08)
	struct FNone*                                 PlayerInput;                                                 // 0x518(0x08)
	struct TArray<None>                           ActiveForceFeedbackEffects;                                  // 0x580(0x10)
	char                                          bPlayerIsWaiting : 0;                                        // 0x498(0x01)
	char                                          NetPlayerIndex;                                              // 0x4bc(0x01)
	struct FNone*                                 PendingSwapConnection;                                       // 0x468(0x08)
	struct FNone*                                 NetConnection;                                               // 0x3e0(0x08)
	float                                         InputYawScale;                                               // 0x5e0(0x04)
	float                                         InputPitchScale;                                             // 0x5a8(0x04)
	float                                         InputRollScale;                                              // 0x578(0x04)
	char                                          bShowMouseCursor : 0;                                        // 0x670(0x01)
	char                                          bEnableClickEvents : 0;                                      // 0x5b4(0x01)
	char                                          bEnableTouchEvents : 0;                                      // 0x4e0(0x01)
	char                                          bEnableMouseOverEvents : 0;                                  // 0x670(0x01)
	char                                          bEnableTouchOverEvents : 0;                                  // 0x670(0x01)
	char                                          bForceFeedbackEnabled : 0;                                   // 0x57c(0x01)
	float                                         ForceFeedbackScale;                                          // 0x488(0x04)
	struct TArray<None>                           ClickEventKeys;                                              // 0x4a0(0x10)
	char                                          DefaultMouseCursor;                                          // 0x618(0x01)
	char                                          CurrentMouseCursor;                                          // 0x5e4(0x01)
	char                                          DefaultClickTraceChannel;                                    // 0x47c(0x01)
	char                                          CurrentClickTraceChannel;                                    // 0x48c(0x01)
	float                                         HitResultTraceDistance;                                      // 0x3ec(0x04)
	uint16_t                                      SeamlessTravelCount;                                         // 0x5ac(0x02)
	uint16_t                                      LastCompletedSeamlessTravelCount;                            // 0x540(0x02)
	struct FNone*                                 InactiveStateInputComponent;                                 // 0x490(0x08)
	char                                          bShouldPerformFullTickWhenPaused : 0;                        // 0x570(0x01)
	struct FNone*                                 CurrentTouchInterface;                                       // 0x550(0x08)
	struct FNone*                                 SpectatorPawn;                                               // 0x470(0x08)
	char                                          bIsLocalPlayerController : 0;                                // 0x5c8(0x01)
	struct FNone                                  SpawnLocation;                                               // 0x61c(0x0c)

	char WasInputKeyJustReleased(struct FNone Key); // sub_0x3dab2b0
	char WasInputKeyJustPressed(struct FNone Key); // sub_0x3dab1c0
	void ToggleSpeaking(char bInSpeaking); // sub_0x3dab130
	void TestServerLevelVisibilityChange(struct FName PackageName, struct FName Filename); // sub_0x1f5f6f0
	void SwitchLevel(struct FString URL); // sub_0x3dab080
	void StopHapticEffect(enum class None Hand); // sub_0x3dab000
	void StartFire(char FireModeNum); // sub_0x3daaf80
	void SetVirtualJoystickVisibility(char bVisible); // sub_0x3daaef0
	void SetViewTargetWithBlend(struct FNone* NewViewTarget, float BlendTime, char BlendFunc, float BlendExp, char bLockOutgoing); // sub_0x3daad70
	void SetName(struct FString S); // sub_0x3daacc0
	void SetMouseLocation(uint32_t X, uint32_t Y); // sub_0x3daac00
	void SetMouseCursorWidget(char Cursor, struct FNone* CursorWidget); // sub_0x3daab40
	void SetHapticsByValue(float Frequency, float Amplitude, enum class None Hand); // sub_0x3daaa40
	void SetDisableHaptics(char bNewDisabled); // sub_0x3daa9b0
	void SetControllerLightColor(struct FNone Color); // sub_0x3daa940
	void SetCinematicMode(char bInCinematicMode, char bHidePlayer, char bAffectsHUD, char bAffectsMovement, char bAffectsTurning); // sub_0x3daa780
	void SetAudioListenerOverride(struct FNone* AttachToComponent, struct FNone Location, struct FNone Rotation); // sub_0x3daa660
	void SetAudioListenerAttenuationOverride(struct FNone* AttachToComponent, struct FNone AttenuationLocationOVerride); // sub_0x3daa590
	void ServerViewSelf(struct FNone TransitionParams); // sub_0x3daa4a0
	void ServerViewPrevPlayer(); // sub_0x3daa450
	void ServerViewNextPlayer(); // sub_0x3daa400
	void ServerVerifyViewTarget(); // sub_0x3daa3b0
	void ServerUpdateMultipleLevelsVisibility(struct TArray<None> LevelVisibilities); // sub_0x3daa2f0
	void ServerUpdateLevelVisibility(struct FNone LevelVisibility); // sub_0x3daa230
	void ServerUpdateCamera(struct FNone CamLoc, uint32_t CamPitchAndYaw); // sub_0x3daa110
	void ServerUnmutePlayer(struct FNone PlayerId); // sub_0x3da9fb0
	void ServerToggleAILogging(); // sub_0x3da9f60
	void ServerShortTimeout(); // sub_0x3da9f10
	void ServerSetSpectatorWaiting(char bWaiting); // sub_0x3da9e50
	void ServerSetSpectatorLocation(struct FNone NewLoc, struct FNone NewRot); // sub_0x3da9d20
	void ServerRestartPlayer(); // sub_0x3da9cd0
	void ServerPause(); // sub_0x3da9c80
	void ServerNotifyLoadedWorld(struct FName WorldPackageName); // sub_0x3da9bd0
	void ServerMutePlayer(struct FNone PlayerId); // sub_0x3da9a70
	void ServerExecRPC(struct FString Msg); // sub_0x3da99a0
	void ServerExec(struct FString Msg); // sub_0x1ecded0
	void ServerCheckClientPossessionReliable(); // sub_0x3da9950
	void ServerCheckClientPossession(); // sub_0x3da9900
	void ServerChangeName(struct FString S); // sub_0x3da9830
	void ServerCamera(struct FName NewMode); // sub_0x3da9770
	void ServerAcknowledgePossession(struct FNone* P); // sub_0x3da96b0
	void SendToConsole(struct FString Command); // sub_0x3da9600
	void RestartLevel(); // sub_0x3da95e0
	void ResetMouseCursorWidget(); // sub_0x3da95c0
	void ResetControllerLightColor(); // sub_0x3da95a0
	char ProjectWorldLocationToScreen(struct FNone WorldLocation, struct FNone& ScreenLocation, char bPlayerViewportRelative); // sub_0x3da9470
	void PlayHapticEffect(struct FNone* HapticEffect, enum class None Hand, float Scale, char bLoop); // sub_0x3da9320
	void PlayDynamicForceFeedback(float Intensity, float Duration, char bAffectsLeftLarge, char bAffectsLeftSmall, char bAffectsRightLarge, char bAffectsRightSmall, char Action, struct FNone LatentInfo); // sub_0x3da90a0
	void Pause(); // sub_0x3da9080
	void OnServerStartedVisualLogger(char bIsLogging); // sub_0x3da8ff0
	void LocalTravel(struct FString URL); // sub_0x3da8f40
	void K2_ClientPlayForceFeedback(struct FNone* ForceFeedbackEffect, struct FName Tag, char bLooping, char bIgnoreTimeDilation, char bPlayWhilePaused); // sub_0x3da8d90
	char IsInputKeyDown(struct FNone Key); // sub_0x3da8ca0
	void GetViewportSize(uint32_t& SizeX, uint32_t& SizeY); // sub_0x3da8bc0
	struct FNone* GetSpectatorPawn(); // sub_0x3da8ba0
	char GetMousePosition(float& LocationX, float& LocationY); // sub_0x3da8ab0
	struct FNone GetInputVectorKeyState(struct FNone Key); // sub_0x3da89b0
	void GetInputTouchState(char FingerIndex, float& LocationX, float& LocationY, char& bIsCurrentlyPressed); // sub_0x3da8830
	void GetInputMouseDelta(float& DeltaX, float& DeltaY); // sub_0x3da8750
	void GetInputMotionState(struct FNone& Tilt, struct FNone& RotationRate, struct FNone& Gravity, struct FNone& Acceleration); // sub_0x3da85c0
	float GetInputKeyTimeDown(struct FNone Key); // sub_0x3da84d0
	void GetInputAnalogStickState(char WhichStick, float& StickX, float& StickY); // sub_0x3da83b0
	float GetInputAnalogKeyState(struct FNone Key); // sub_0x3da82c0
	struct FNone* GetHUD(); // sub_0x3da78f0
	char GetHitResultUnderFingerForObjects(char FingerIndex, struct TArray<None>& ObjectTypes, char bTraceComplex, struct FNone& HitResult); // sub_0x3da80f0
	char GetHitResultUnderFingerByChannel(char FingerIndex, char TraceChannel, char bTraceComplex, struct FNone& HitResult); // sub_0x3da7f50
	char GetHitResultUnderFinger(char FingerIndex, char TraceChannel, char bTraceComplex, struct FNone& HitResult); // sub_0x3da7db0
	char GetHitResultUnderCursorForObjects(struct TArray<None>& ObjectTypes, char bTraceComplex, struct FNone& HitResult); // sub_0x3da7c20
	char GetHitResultUnderCursorByChannel(char TraceChannel, char bTraceComplex, struct FNone& HitResult); // sub_0x3da7aa0
	char GetHitResultUnderCursor(char TraceChannel, char bTraceComplex, struct FNone& HitResult); // sub_0x3da7920
	struct FNone GetFocalLocation(); // sub_0x3da78b0
	void FOV(float NewFOV); // sub_0x3da7830
	void EnableCheats(); // sub_0x3da7810
	char DeprojectScreenPositionToWorld(float ScreenX, float ScreenY, struct FNone& WorldLocation, struct FNone& WorldDirection); // sub_0x3da7690
	char DeprojectMousePositionToWorld(struct FNone& WorldLocation, struct FNone& WorldDirection); // sub_0x3da7590
	void ConsoleKey(struct FNone Key); // sub_0x3da74a0
	void ClientWasKicked(struct FText KickReason); // sub_0x3da73e0
	void ClientVoiceHandshakeComplete(); // sub_0x3da73c0
	void ClientUpdateMultipleLevelsStreamingStatus(struct TArray<None> LevelStatuses); // sub_0x3da7320
	void ClientUpdateLevelStreamingStatus(struct FName PackageName, char bNewShouldBeLoaded, char bNewShouldBeVisible, char bNewShouldBlockOnLoad, uint32_t LODIndex); // sub_0x3da7170
	void ClientUnmutePlayer(struct FNone PlayerId); // sub_0x3da7050
	void ClientTravelInternal(struct FString URL, char TravelType, char bSeamless, struct FNone MapPackageGuid); // sub_0x3da6ed0
	void ClientTravel(struct FString URL, char TravelType, char bSeamless, struct FNone MapPackageGuid); // sub_0x3da6d60
	void ClientTeamMessage(struct FNone* SenderPlayerState, struct FString S, struct FName Type, float MsgLifeTime); // sub_0x3da6c00
	void ClientStopForceFeedback(struct FNone* ForceFeedbackEffect, struct FName Tag); // sub_0x3da6b30
	void ClientStopCameraShakesFromSource(struct FNone* SourceComponent, char bImmediately); // sub_0x3da6a60
	void ClientStopCameraShake(struct FNone* Shake, char bImmediately); // sub_0x3da6990
	void ClientStopCameraAnim(struct FNone* AnimToStop); // sub_0x3da6900
	void ClientStartOnlineSession(); // sub_0x3da68e0
	void ClientSpawnCameraLensEffect(struct FNone* LensEffectEmitterClass); // sub_0x3da6850
	void ClientSetViewTarget(struct FNone* A, struct FNone TransitionParams); // sub_0x3da6760
	void ClientSetSpectatorWaiting(char bWaiting); // sub_0x3da66d0
	void ClientSetHUD(struct FNone* NewHUDClass); // sub_0x3da6640
	void ClientSetForceMipLevelsToBeResident(struct FNone* Material, float ForceDuration, uint32_t CinematicTextureGroups); // sub_0x3da6540
	void ClientSetCinematicMode(char bInCinematicMode, char bAffectsMovement, char bAffectsTurning, char bAffectsHUD); // sub_0x3da63d0
	void ClientSetCameraMode(struct FName NewCamMode); // sub_0x3da6340
	void ClientSetCameraFade(char bEnableFading, struct FNone FadeColor, struct FNone FadeAlpha, float FadeTime, char bFadeAudio); // sub_0x3da61b0
	void ClientSetBlockOnAsyncLoading(); // sub_0x3da6190
	void ClientReturnToMainMenuWithTextReason(struct FText ReturnReason); // sub_0x3da60d0
	void ClientReturnToMainMenu(struct FString ReturnReason); // sub_0x3da6020
	void ClientRetryClientRestart(struct FNone* NewPawn); // sub_0x3da5f90
	void ClientRestart(struct FNone* NewPawn); // sub_0x3da5f00
	void ClientReset(); // sub_0x3da5ee0
	void ClientRepObjRef(struct FNone* Object); // sub_0x3da5e50
	void ClientReceiveLocalizedMessage(struct FNone* Message, uint32_t Switch, struct FNone* RelatedPlayerState_2, struct FNone* RelatedPlayerState_3, struct FNone* OptionalObject); // sub_0x3da5cd0
	void ClientPrestreamTextures(struct FNone* ForcedActor, float ForceDuration, char bEnableStreaming, uint32_t CinematicTextureGroups); // sub_0x3da5b80
	void ClientPrepareMapChange(struct FName LevelName, char bFirst, char bLast); // sub_0x3da5a70
	void ClientPlaySoundAtLocation(struct FNone* Sound, struct FNone Location, float VolumeMultiplier, float PitchMultiplier); // sub_0x3da5920
	void ClientPlaySound(struct FNone* Sound, float VolumeMultiplier, float PitchMultiplier); // sub_0x3da5820
	void ClientPlayForceFeedback_Internal(struct FNone* ForceFeedbackEffect, struct FNone Params); // sub_0x3da5730
	void ClientPlayCameraShakeFromSource(struct FNone* Shake, struct FNone* SourceComponent); // sub_0x3da5670
	void ClientPlayCameraShake(struct FNone* Shake, float Scale, char PlaySpace, struct FNone UserPlaySpaceRot); // sub_0x3da5510
	void ClientPlayCameraAnim(struct FNone* AnimToPlay, float Scale, float Rate, float BlendInTime, float BlendOutTime, char bLoop, char bRandomStartTime, char Space, struct FNone CustomPlaySpace); // sub_0x3da5270
	void ClientMutePlayer(struct FNone PlayerId); // sub_0x3da5150
	void ClientMessage(struct FString S, struct FName Type, float MsgLifeTime); // sub_0x3da5020
	void ClientIgnoreMoveInput(char bIgnore); // sub_0x3da4f90
	void ClientIgnoreLookInput(char bIgnore); // sub_0x3da4f00
	void ClientGotoState(struct FName NewState); // sub_0x3da4e70
	void ClientGameEnded(struct FNone* EndGameFocus, char bIsWinner); // sub_0x3da4da0
	void ClientForceGarbageCollection(); // sub_0x3da4d80
	void ClientFlushLevelStreaming(); // sub_0x3da4d60
	void ClientEndOnlineSession(); // sub_0x3da4d40
	void ClientEnableNetworkVoice(char bEnable); // sub_0x3da4cb0
	void ClientCommitMapChange(); // sub_0x3da4c90
	void ClientClearCameraLensEffects(); // sub_0x3da4c70
	void ClientCapBandwidth(uint32_t Cap); // sub_0x3da4be0
	void ClientCancelPendingMapChange(); // sub_0x3da4bc0
	void ClientAddTextureStreamingLoc(struct FNone InLoc, float Duration, char bOverrideLocation); // sub_0x3da4aa0
	void ClearAudioListenerOverride(); // sub_0x3da4a80
	void ClearAudioListenerAttenuationOverride(); // sub_0x3da4a60
	char CanRestartPlayer(); // sub_0x3da4a30
	void Camera(struct FName NewMode); // sub_0x3da49a0
	void AddYawInput(float Val); // sub_0x3da4920
	void AddRollInput(float Val); // sub_0x3da48a0
	void AddPitchInput(float Val); // sub_0x3da4820
	void ActivateTouchInterface(struct FNone* NewTouchInterface); // sub_0x3da4790
};

// Class Engine.ApplicationLifecycleComponent
// Size: 0x140 (Inherited: 0xb0)
struct UApplicationLifecycleComponent : UActorComponent 
{
	struct FMulticastInlineDelegate               ApplicationWillDeactivateDelegate;                           // 0xb0(0x10)
	struct FMulticastInlineDelegate               ApplicationHasReactivatedDelegate;                           // 0xc0(0x10)
	struct FMulticastInlineDelegate               ApplicationWillEnterBackgroundDelegate;                      // 0xd0(0x10)
	struct FMulticastInlineDelegate               ApplicationHasEnteredForegroundDelegate;                     // 0xe0(0x10)
	struct FMulticastInlineDelegate               ApplicationWillTerminateDelegate;                            // 0xf0(0x10)
	struct FMulticastInlineDelegate               ApplicationShouldUnloadResourcesDelegate;                    // 0x100(0x10)
	struct FMulticastInlineDelegate               ApplicationReceivedStartupArgumentsDelegate;                 // 0x110(0x10)
	struct FMulticastInlineDelegate               OnTemperatureChangeDelegate;                                 // 0x120(0x10)
	struct FMulticastInlineDelegate               OnLowPowerModeDelegate;                                      // 0x130(0x10)
};

// Class Engine.MovementComponent
// Size: 0xf0 (Inherited: 0xb0)
struct UMovementComponent : UActorComponent 
{
	struct FNone*                                 UpdatedComponent;                                            // 0xb0(0x08)
	struct FNone*                                 UpdatedPrimitive;                                            // 0xb8(0x08)
	char                                          UnknownDataC0[0x4];                                          // 0xc0(0x04)
	struct FNone                                  Velocity;                                                    // 0xc4(0x0c)
	struct FNone                                  PlaneConstraintNormal;                                       // 0xd0(0x0c)
	struct FNone                                  PlaneConstraintOrigin;                                       // 0xdc(0x0c)
	char                                          bUpdateOnlyIfRendered : 0;                                   // 0xe8(0x01)
	char                                          bAutoUpdateTickRegistration : 0;                             // 0xe8(0x01)
	char                                          bTickBeforeOwner : 0;                                        // 0xe8(0x01)
	char                                          bAutoRegisterUpdatedComponent : 0;                           // 0xe8(0x01)
	char                                          bConstrainToPlane : 0;                                       // 0xe8(0x01)
	char                                          bSnapToPlaneAtStart : 0;                                     // 0xe8(0x01)
	char                                          bAutoRegisterPhysicsVolumeUpdates : 0;                       // 0xe8(0x01)
	char                                          bComponentShouldUpdatePhysicsVolume : 0;                     // 0xe8(0x01)
	char                                          UnknownDataE8[0x3];                                          // 0xe8(0x03)
	enum class None                               PlaneConstraintAxisSetting;                                  // 0xeb(0x01)
	char                                          UnknownDataEC[0x4];                                          // 0xec(0x04)

	void StopMovementImmediately(); // sub_0x203f6b0
	void SnapUpdatedComponentToPlane(); // sub_0x3d7e260
	void SetUpdatedComponent(struct FNone* NewUpdatedComponent); // sub_0x11f5b50
	void SetPlaneConstraintOrigin(struct FNone PlaneOrigin); // sub_0x3d7e1d0
	void SetPlaneConstraintNormal(struct FNone PlaneNormal); // sub_0x3d7e140
	void SetPlaneConstraintFromVectors(struct FNone Forward, struct FNone Up); // sub_0x3d7e060
	void SetPlaneConstraintEnabled(char bEnabled); // sub_0x3d7dfd0
	void SetPlaneConstraintAxisSetting(enum class None NewAxisSetting); // sub_0x3d7df50
	void PhysicsVolumeChanged(struct FNone* NewVolume); // sub_0x3d7dec0
	char K2_MoveUpdatedComponent(struct FNone Delta, struct FNone NewRotation, struct FNone& OutHit, char bSweep, char bTeleport); // sub_0x3d7dcc0
	float K2_GetModifiedMaxSpeed(); // sub_0x3d7dc80
	float K2_GetMaxSpeedModifier(); // sub_0x3d7dc40
	char IsExceedingMaxSpeed(float MaxSpeed); // sub_0x3d7dbb0
	struct FNone GetPlaneConstraintOrigin(); // sub_0x3d7db70
	struct FNone GetPlaneConstraintNormal(); // sub_0x3d7db30
	enum class None GetPlaneConstraintAxisSetting(); // sub_0x3d7db10
	struct FNone* GetPhysicsVolume(); // sub_0x3d7dae0
	float GetMaxSpeed(); // sub_0x3d7daa0
	float GetGravityZ(); // sub_0x3d7da60
	struct FNone ConstrainNormalToPlane(struct FNone Normal); // sub_0x3d7d9b0
	struct FNone ConstrainLocationToPlane(struct FNone Location); // sub_0x3d7d900
	struct FNone ConstrainDirectionToPlane(struct FNone Direction); // sub_0x3d7d850
};

// Class Engine.NavMovementComponent
// Size: 0x130 (Inherited: 0xf0)
struct UNavMovementComponent : UMovementComponent 
{
	struct FNone                                  NavAgentProps;                                               // 0xf0(0x30)
	float                                         FixedPathBrakingDistance;                                    // 0x120(0x04)
	char                                          bUpdateNavAgentWithOwnersCollision : 0;                      // 0x124(0x01)
	char                                          bUseAccelerationForPaths : 0;                                // 0x124(0x01)
	char                                          bUseFixedBrakingDistanceForPaths : 0;                        // 0x124(0x01)
	char                                          UnknownData124[0x1];                                         // 0x124(0x01)
	struct FNone                                  MovementState;                                               // 0x125(0x01)
	char                                          UnknownData126[0x2];                                         // 0x126(0x02)
	struct FNone*                                 PathFollowingComp;                                           // 0x128(0x08)

	void StopMovementKeepPathing(); // sub_0x3d82ed0
	void StopActiveMovement(); // sub_0x3d82eb0
	char IsSwimming(); // sub_0x3d82ce0
	char IsMovingOnGround(); // sub_0x3c9b580
	char IsFlying(); // sub_0x3d82cb0
	char IsFalling(); // sub_0x3d82c80
	char IsCrouching(); // sub_0x3c74d10
};

// Class Engine.PawnMovementComponent
// Size: 0x138 (Inherited: 0x130)
struct UPawnMovementComponent : UNavMovementComponent 
{
	struct FNone*                                 PawnOwner;                                                   // 0x130(0x08)

	struct FNone K2_GetInputVector(); // sub_0x3d97c50
	char IsMoveInputIgnored(); // sub_0x3d97d90
	struct FNone GetPendingInputVector(); // sub_0x3d97c50
	struct FNone* GetPawnOwner(); // sub_0x3d97c20
	struct FNone GetLastInputVector(); // sub_0x3d97aa0
	struct FNone ConsumeInputVector(); // sub_0x3d978c0
	void AddInputVector(struct FNone WorldVector, char bForce); // sub_0x3d97360
};

// Class Engine.CharacterMovementComponent
// Size: 0x6f0 (Inherited: 0x138)
struct UCharacterMovementComponent : UPawnMovementComponent 
{
	char                                          UnknownData138[0x178];                                       // 0x138(0x178)
	struct FNone*                                 CharacterOwner;                                              // 0x2b0(0x08)
	char                                          UnknownData2B8[0x34];                                        // 0x2b8(0x34)
	float                                         GravityScale;                                                // 0x2ec(0x04)
	char                                          UnknownData2F0[0x178];                                       // 0x2f0(0x178)
	float                                         MaxStepHeight;                                               // 0x468(0x04)
	char                                          UnknownData46C[0x8];                                         // 0x46c(0x08)
	float                                         JumpZVelocity;                                               // 0x474(0x04)
	char                                          UnknownData478[0x250];                                       // 0x478(0x250)
	float                                         JumpOffJumpZFactor;                                          // 0x6c8(0x04)
	float                                         WalkableFloorAngle;                                          // 0x4f8(0x04)
	float                                         WalkableFloorZ;                                              // 0x488(0x04)
	char                                          MovementMode;                                                // 0x438(0x01)
	char                                          CustomMovementMode;                                          // 0x56c(0x01)
	enum class None                               NetworkSmoothingMode;                                        // 0x280(0x01)
	float                                         GroundFriction;                                              // 0x470(0x04)
	float                                         MaxWalkSpeed;                                                // 0x300(0x04)
	char                                          UnknownData6DF[0x1];                                         // 0x6df(0x01)
	float                                         MaxWalkSpeedCrouched;                                        // 0x6e0(0x04)
	float                                         MaxSwimSpeed;                                                // 0x548(0x04)
	float                                         MaxFlySpeed;                                                 // 0x4e8(0x04)
	float                                         MaxCustomMovementSpeed;                                      // 0x460(0x04)
	float                                         MaxAcceleration;                                             // 0x484(0x04)
	float                                         MinAnalogWalkSpeed;                                          // 0x4e0(0x04)
	float                                         BrakingFrictionFactor;                                       // 0x2a0(0x04)
	float                                         BrakingFriction;                                             // 0x54c(0x04)
	float                                         BrakingSubStepTime;                                          // 0x6bc(0x04)
	float                                         BrakingDecelerationWalking;                                  // 0x554(0x04)
	float                                         BrakingDecelerationFalling;                                  // 0x51c(0x04)
	float                                         BrakingDecelerationSwimming;                                 // 0x414(0x04)
	float                                         BrakingDecelerationFlying;                                   // 0x568(0x04)
	float                                         AirControl;                                                  // 0x544(0x04)
	float                                         AirControlBoostMultiplier;                                   // 0x308(0x04)
	float                                         AirControlBoostVelocityThreshold;                            // 0x3f4(0x04)
	float                                         FallingLateralFriction;                                      // 0x3f0(0x04)
	float                                         CrouchedHalfHeight;                                          // 0x264(0x04)
	float                                         Buoyancy;                                                    // 0x40c(0x04)
	float                                         PerchRadiusThreshold;                                        // 0x244(0x04)
	float                                         PerchAdditionalHeight;                                       // 0x248(0x04)
	struct FNone                                  RotationRate;                                                // 0x520(0x0c)
	char                                          bUseSeparateBrakingFriction : 0;                             // 0x298(0x01)
	char                                          bApplyGravityWhileJumping : 0;                               // 0x2d4(0x01)
	char                                          bUseControllerDesiredRotation : 0;                           // 0x2e4(0x01)
	char                                          bOrientRotationToMovement : 0;                               // 0x550(0x01)
	char                                          bSweepWhileNavWalking : 0;                                   // 0x620(0x01)
	char                                          bMovementInProgress : 0;                                     // 0x3c0(0x01)
	char                                          bEnableScopedMovementUpdates : 0;                            // 0x5d0(0x01)
	char                                          bEnableServerDualMoveScopedMovementUpdates : 0;              // 0x4e4(0x01)
	char                                          bForceMaxAccel : 0;                                          // 0x4b8(0x01)
	char                                          bRunPhysicsWithNoController : 0;                             // 0x2f3(0x01)
	char                                          bForceNextFloorCheck : 0;                                    // 0x490(0x01)
	char                                          bShrinkProxyCapsule : 0;                                     // 0x2fc(0x01)
	char                                          bCanWalkOffLedges : 0;                                       // 0x2e4(0x01)
	char                                          bCanWalkOffLedgesWhenCrouching : 0;                          // 0x44c(0x01)
	char                                          bNetworkSkipProxyPredictionOnNetUpdate : 0;                  // 0x490(0x01)
	char                                          bNetworkAlwaysReplicateTransformUpdateTimestamp : 0;         // 0x490(0x01)
	char                                          bDeferUpdateMoveComponent : 0;                               // 0x510(0x01)
	char                                          bEnablePhysicsInteraction : 0;                               // 0x4dc(0x01)
	char                                          bTouchForceScaledToMass : 0;                                 // 0x304(0x01)
	char                                          bPushForceScaledToMass : 0;                                  // 0x540(0x01)
	char                                          bPushForceUsingZOffset : 0;                                  // 0x5ac(0x01)
	char                                          bScalePushForceToVelocity : 0;                               // 0x6dc(0x01)
	struct FNone*                                 DeferredUpdatedMoveComponent;                                // 0x3e8(0x08)
	float                                         MaxOutOfWaterStepHeight;                                     // 0x240(0x04)
	float                                         OutofWaterZ;                                                 // 0x22c(0x04)
	float                                         Mass;                                                        // 0x23c(0x04)
	float                                         StandingDownwardForceScale;                                  // 0x4c8(0x04)
	float                                         InitialPushForceFactor;                                      // 0x294(0x04)
	float                                         PushForceFactor;                                             // 0x2c0(0x04)
	float                                         PushForcePointZOffsetFactor;                                 // 0x2d0(0x04)
	float                                         TouchForceFactor;                                            // 0x434(0x04)
	float                                         MinTouchForce;                                               // 0x3a8(0x04)
	float                                         MaxTouchForce;                                               // 0x5a8(0x04)
	float                                         RepulsionForce;                                              // 0x3ac(0x04)
	struct FNone                                  Acceleration;                                                // 0x6d0(0x0c)
	struct FNone                                  LastUpdateRotation;                                          // 0x270(0x10)
	struct FNone                                  LastUpdateLocation;                                          // 0x288(0x0c)
	struct FNone                                  LastUpdateVelocity;                                          // 0x2d8(0x0c)
	float                                         ServerLastTransformUpdateTimeStamp;                          // 0x310(0x04)
	float                                         ServerLastClientGoodMoveAckTime;                             // 0x50c(0x04)
	float                                         ServerLastClientAdjustmentTime;                              // 0x4bc(0x04)
	struct FNone                                  PendingImpulseToApply;                                       // 0x21c(0x0c)
	struct FNone                                  PendingForceToApply;                                         // 0x5c4(0x0c)
	float                                         AnalogInputModifier;                                         // 0x4d4(0x04)
	float                                         MaxSimulationTimeStep;                                       // 0x2f4(0x04)
	uint32_t                                      MaxSimulationIterations;                                     // 0x444(0x04)
	uint32_t                                      MaxJumpApexAttemptsPerSimulation;                            // 0x47c(0x04)
	float                                         MaxDepenetrationWithGeometry;                                // 0x4ac(0x04)
	float                                         MaxDepenetrationWithGeometryAsProxy;                         // 0x494(0x04)
	float                                         MaxDepenetrationWithPawn;                                    // 0x25c(0x04)
	float                                         MaxDepenetrationWithPawnAsProxy;                             // 0x564(0x04)
	float                                         NetworkSimulatedSmoothLocationTime;                          // 0x3f8(0x04)
	float                                         NetworkSimulatedSmoothRotationTime;                          // 0x6cc(0x04)
	float                                         ListenServerNetworkSimulatedSmoothLocationTime;              // 0x62c(0x04)
	float                                         ListenServerNetworkSimulatedSmoothRotationTime;              // 0x3e4(0x04)
	float                                         NetProxyShrinkRadius;                                        // 0x6c4(0x04)
	float                                         NetProxyShrinkHalfHeight;                                    // 0x440(0x04)
	float                                         NetworkMaxSmoothUpdateDistance;                              // 0x258(0x04)
	float                                         NetworkNoSmoothUpdateDistance;                               // 0x4d8(0x04)
	float                                         NetworkMinTimeBetweenClientAckGoodMoves;                     // 0x530(0x04)
	float                                         NetworkMinTimeBetweenClientAdjustments;                      // 0x284(0x04)
	float                                         NetworkMinTimeBetweenClientAdjustmentsLargeCorrection;       // 0x2e8(0x04)
	float                                         NetworkLargeClientCorrectionDistance;                        // 0x410(0x04)
	float                                         LedgeCheckThreshold;                                         // 0x514(0x04)
	float                                         JumpOutOfWaterPitch;                                         // 0x4cc(0x04)
	struct FNone                                  CurrentFloor;                                                // 0x314(0x94)
	char                                          DefaultLandMovementMode;                                     // 0x3fc(0x01)
	char                                          DefaultWaterMovementMode;                                    // 0x2f2(0x01)
	char                                          GroundMovementMode;                                          // 0x305(0x01)
	char                                          bMaintainHorizontalGroundVelocity : 0;                       // 0x518(0x01)
	char                                          bImpartBaseVelocityX : 0;                                    // 0x5c0(0x01)
	char                                          bImpartBaseVelocityY : 0;                                    // 0x2fc(0x01)
	char                                          bImpartBaseVelocityZ : 0;                                    // 0x4c0(0x01)
	char                                          bImpartBaseAngularVelocity : 0;                              // 0x518(0x01)
	char                                          bJustTeleported : 0;                                         // 0x44c(0x01)
	char                                          bNetworkUpdateReceived : 0;                                  // 0x2fc(0x01)
	char                                          bNetworkMovementModeChanged : 0;                             // 0x230(0x01)
	char                                          bIgnoreClientMovementErrorChecksAndCorrection : 0;           // 0x6c0(0x01)
	char                                          bServerAcceptClientAuthoritativePosition : 0;                // 0x480(0x01)
	char                                          bNotifyApex : 0;                                             // 0x464(0x01)
	char                                          bCheatFlying : 0;                                            // 0x24c(0x01)
	char                                          bWantsToCrouch : 0;                                          // 0x4b8(0x01)
	char                                          bCrouchMaintainsBaseLocation : 0;                            // 0x2b8(0x01)
	char                                          bIgnoreBaseRotation : 0;                                     // 0x538(0x01)
	char                                          bFastAttachedMove : 0;                                       // 0x218(0x01)
	char                                          bAlwaysCheckFloor : 0;                                       // 0x430(0x01)
	char                                          bUseFlatBaseForFloorChecks : 0;                              // 0x238(0x01)
	char                                          bPerformingJumpOff : 0;                                      // 0x2f1(0x01)
	char                                          bWantsToLeaveNavWalking : 0;                                 // 0x46c(0x01)
	char                                          bUseRVOAvoidance : 0;                                        // 0x6c0(0x01)
	char                                          bRequestedMoveUseAcceleration : 0;                           // 0x498(0x01)
	char                                          bWasSimulatingRootMotion : 0;                                // 0x478(0x01)
	char                                          bAllowPhysicsRotationDuringAnimRootMotion : 0;               // 0x44c(0x01)
	char                                          bHasRequestedVelocity : 0;                                   // 0x304(0x01)
	char                                          bRequestedMoveWithMaxSpeed : 0;                              // 0x52c(0x01)
	char                                          bWasAvoidanceUpdated : 0;                                    // 0x2fc(0x01)
	char                                          bProjectNavMeshWalking : 0;                                  // 0x508(0x01)
	char                                          bProjectNavMeshOnBothWorldChannels : 0;                      // 0x228(0x01)
	float                                         AvoidanceConsiderationRadius;                                // 0x448(0x04)
	struct FNone                                  RequestedVelocity;                                           // 0x4a0(0x0c)
	uint32_t                                      AvoidanceUID;                                                // 0x250(0x04)
	struct FNone                                  AvoidanceGroup;                                              // 0x48c(0x04)
	struct FNone                                  GroupsToAvoid;                                               // 0x2bc(0x04)
	struct FNone                                  GroupsToIgnore;                                              // 0x4c4(0x04)
	float                                         AvoidanceWeight;                                             // 0x2a8(0x04)
	struct FNone                                  PendingLaunchVelocity;                                       // 0x558(0x0c)
	float                                         NavMeshProjectionInterval;                                   // 0x2a4(0x04)
	float                                         NavMeshProjectionTimer;                                      // 0x30c(0x04)
	float                                         NavMeshProjectionInterpSpeed;                                // 0x254(0x04)
	float                                         NavMeshProjectionHeightScaleUp;                              // 0x234(0x04)
	float                                         NavMeshProjectionHeightScaleDown;                            // 0x408(0x04)
	float                                         NavWalkingFloorDistTolerance;                                // 0x2f8(0x04)
	struct FNone                                  PostPhysicsTickFunction;                                     // 0x148(0x30)
	float                                         MinTimeBetweenTimeStampResets;                               // 0x5b0(0x04)
	struct FNone*                                 ClientAutonomuousBase;                                       // 0x4f0(0x08)
	struct FNone                                  CurrentRootMotion;                                           // 0x570(0x38)
	struct FNone                                  RootMotionParams;                                            // 0x5e0(0x40)
	struct FNone                                  AnimRootMotionVelocity;                                      // 0x2c4(0x0c)
	float                                         BlockingHit_SlideAccelerator;                                // 0x628(0x04)
	struct FNone*                                 BlockingPhysMaterial;                                        // 0x4b0(0x08)

	void SetWalkableFloorZ(float InWalkableFloorZ); // sub_0x3c9be70
	void SetWalkableFloorAngle(float InWalkableFloorAngle); // sub_0x3c9bdf0
	void SetMovementMode(char NewMovementMode, char NewCustomMode); // sub_0x3c9bd30
	void SetGroupsToIgnoreMask(struct FNone& GroupMask); // sub_0x3c9bca0
	void SetGroupsToIgnore(uint32_t GroupFlags); // sub_0x3c9bc20
	void SetGroupsToAvoidMask(struct FNone& GroupMask); // sub_0x3c9bb90
	void SetGroupsToAvoid(uint32_t GroupFlags); // sub_0x3c9bb10
	void SetAvoidanceGroupMask(struct FNone& GroupMask); // sub_0x3c9ba80
	void SetAvoidanceGroup(uint32_t GroupFlags); // sub_0x3c9ba00
	void SetAvoidanceEnabled(char bEnable); // sub_0x3c9b970
	float K2_GetWalkableFloorZ(); // sub_0x3c9b940
	float K2_GetWalkableFloorAngle(); // sub_0x168b110
	float K2_GetModifiedMaxAcceleration(); // sub_0x3c9b900
	void K2_FindFloor(struct FNone CapsuleLocation, struct FNone& FloorResult); // sub_0x3c9b7b0
	void K2_ComputeFloorDist(struct FNone CapsuleLocation, float LineDistance, float SweepDistance, float SweepRadius, struct FNone& FloorResult); // sub_0x3c9b5b0
	char IsWalking(); // sub_0x3c9b580
	char IsWalkable(struct FNone& Hit); // sub_0x3c9b490
	float GetValidPerchRadius(); // sub_0x3c9b460
	float GetPerchRadiusThreshold(); // sub_0x3c9b430
	struct FNone* GetMovementBase(); // sub_0x3c9b400
	float GetMinAnalogSpeed(); // sub_0x3c9b3c0
	float GetMaxJumpHeightWithJumpTime(); // sub_0x3c9b380
	float GetMaxJumpHeight(); // sub_0x1f0ead0
	float GetMaxBrakingDeceleration(); // sub_0x3c9b340
	float GetMaxAcceleration(); // sub_0x3c9b300
	struct FNone GetLastUpdateVelocity(); // sub_0x3c9b2d0
	struct FNone GetLastUpdateRotation(); // sub_0x3c9b280
	struct FNone GetLastUpdateLocation(); // sub_0x3c9b250
	struct FNone GetImpartedMovementBaseVelocity(); // sub_0x3c9b210
	struct FNone GetCurrentAcceleration(); // sub_0x3c9b1d0
	struct FNone* GetCharacterOwner(); // sub_0x3c9b1b0
	float GetAnalogInputModifier(); // sub_0x3c9b180
	void DisableMovement(); // sub_0x3c9b160
	void ClearAccumulatedForces(); // sub_0x3c9b140
	void CapsuleTouched(struct FNone* OverlappedComp, struct FNone* Other, struct FNone* OtherComp, uint32_t OtherBodyIndex, char bFromSweep, struct FNone& SweepResult); // sub_0x3c9af40
	void CalcVelocity(float DeltaTime, float Friction, char bFluid, float BrakingDeceleration); // sub_0x3c9ade0
	void AddImpulse(struct FNone Impulse, char bVelocityChange); // sub_0x3c9ad00
	void AddForce(struct FNone Force); // sub_0x3c9ac70
};

// Class Engine.DynamicSubsystem
// Size: 0x30 (Inherited: 0x30)
struct UDynamicSubsystem : USubsystem 
{
};

// Class Engine.EngineSubsystem
// Size: 0x30 (Inherited: 0x30)
struct UEngineSubsystem : UDynamicSubsystem 
{
};

// Class Engine.SceneCapture
// Size: 0x320 (Inherited: 0x310)
struct ASceneCapture : AActor 
{
	struct FNone*                                 MeshComp;                                                    // 0x310(0x08)
	struct FNone*                                 SceneComponent;                                              // 0x318(0x08)
};

// Class Engine.SceneCapture2D
// Size: 0x328 (Inherited: 0x320)
struct ASceneCapture2D : ASceneCapture 
{
	struct FNone*                                 CaptureComponent2D;                                          // 0x320(0x08)

	void OnInterpToggle(char bEnable); // sub_0x3d9fe60
};

// Class Engine.SoundEffectPreset
// Size: 0x40 (Inherited: 0x28)
struct USoundEffectPreset : UObject 
{
	char                                          UnknownData28[0x18];                                         // 0x28(0x18)
};

// Class Engine.SoundEffectSourcePreset
// Size: 0x40 (Inherited: 0x40)
struct USoundEffectSourcePreset : USoundEffectPreset 
{
};

// Class Engine.SoundEffectSubmixPreset
// Size: 0x40 (Inherited: 0x40)
struct USoundEffectSubmixPreset : USoundEffectPreset 
{
};

// Class Engine.TargetPoint
// Size: 0x310 (Inherited: 0x310)
struct ATargetPoint : AActor 
{
};

// Class Engine.AssetManager
// Size: 0x438 (Inherited: 0x28)
struct UAssetManager : UObject 
{
	char                                          UnknownData28[0x298];                                        // 0x28(0x298)
	struct TArray<None>                           ObjectReferenceList;                                         // 0x2c0(0x10)
	char                                          bIsGlobalAsyncScanEnvironment : 0;                           // 0x2d0(0x01)
	char                                          UnknownData2D0[0x1];                                         // 0x2d0(0x01)
	char                                          bShouldGuessTypeAndName : 0;                                 // 0x2d1(0x01)
	char                                          UnknownData2D1[0x1];                                         // 0x2d1(0x01)
	char                                          bShouldUseSynchronousLoad : 0;                               // 0x2d2(0x01)
	char                                          UnknownData2D2[0x1];                                         // 0x2d2(0x01)
	char                                          bIsLoadingFromPakFiles : 0;                                  // 0x2d3(0x01)
	char                                          UnknownData2D3[0x1];                                         // 0x2d3(0x01)
	char                                          bShouldAcquireMissingChunksOnLoad : 0;                       // 0x2d4(0x01)
	char                                          UnknownData2D4[0x1];                                         // 0x2d4(0x01)
	char                                          bOnlyCookProductionAssets : 0;                               // 0x2d5(0x01)
	char                                          UnknownData2D5[0x1];                                         // 0x2d5(0x01)
	char                                          bIsBulkScanning : 0;                                         // 0x2d6(0x01)
	char                                          UnknownData2D6[0x1];                                         // 0x2d6(0x01)
	char                                          bIsPrimaryAssetDirectoryCurrent : 0;                         // 0x2d7(0x01)
	char                                          UnknownData2D7[0x1];                                         // 0x2d7(0x01)
	char                                          bIsManagementDatabaseCurrent : 0;                            // 0x2d8(0x01)
	char                                          UnknownData2D8[0x1];                                         // 0x2d8(0x01)
	char                                          bUpdateManagementDatabaseAfterScan : 0;                      // 0x2d9(0x01)
	char                                          UnknownData2D9[0x1];                                         // 0x2d9(0x01)
	char                                          bIncludeOnlyOnDiskAssets : 0;                                // 0x2da(0x01)
	char                                          UnknownData2DA[0x2];                                         // 0x2da(0x02)
	uint32_t                                      NumberOfSpawnedNotifications;                                // 0x2dc(0x04)
	char                                          UnknownData2E0[0x158];                                       // 0x2e0(0x158)
};

// Class Engine.ShapeComponent
// Size: 0x4d0 (Inherited: 0x4c0)
struct UShapeComponent : UPrimitiveComponent 
{
	struct FNone*                                 ShapeBodySetup;                                              // 0x4b8(0x08)
	struct FNone*                                 AreaClass;                                                   // 0x4c0(0x08)
	struct FNone                                  ShapeColor;                                                  // 0x4c8(0x04)
	char                                          bDrawOnlyIfSelected : 0;                                     // 0x4cc(0x01)
	char                                          bShouldCollideWhenPlacing : 0;                               // 0x4cc(0x01)
	char                                          bDynamicObstacle : 0;                                        // 0x4cc(0x01)
};

// Class Engine.BoxComponent
// Size: 0x4e0 (Inherited: 0x4d0)
struct UBoxComponent : UShapeComponent 
{
	struct FNone                                  BoxExtent;                                                   // 0x4d0(0x0c)
	float                                         LineThickness;                                               // 0x4dc(0x04)

	void SetBoxExtent(struct FNone InBoxExtent, char bUpdateOverlaps); // sub_0x3c8db60
	struct FNone GetUnscaledBoxExtent(); // sub_0x3c8d980
	struct FNone GetScaledBoxExtent(); // sub_0x3c8d920
};

// Class Engine.CameraComponent
// Size: 0x880 (Inherited: 0x240)
struct UCameraComponent : USceneComponent 
{
	float                                         FieldOfView;                                                 // 0x238(0x04)
	float                                         OrthoWidth;                                                  // 0x23c(0x04)
	float                                         OrthoNearClipPlane;                                          // 0x240(0x04)
	float                                         OrthoFarClipPlane;                                           // 0x244(0x04)
	float                                         AspectRatio;                                                 // 0x248(0x04)
	char                                          bConstrainAspectRatio : 0;                                   // 0x24c(0x01)
	char                                          bUseFieldOfViewForLOD : 0;                                   // 0x24c(0x01)
	char                                          bLockToHmd : 0;                                              // 0x254(0x01)
	char                                          bUsePawnControlRotation : 0;                                 // 0x254(0x01)
	char                                          UnknownData254[0x1];                                         // 0x254(0x01)
	char                                          ProjectionMode;                                              // 0x255(0x01)
	char                                          UnknownData256[0x3a];                                        // 0x256(0x3a)
	float                                         PostProcessBlendWeight;                                      // 0x290(0x04)
	char                                          UnknownData294[0x2c];                                        // 0x294(0x2c)
	struct FNone                                  PostProcessSettings;                                         // 0x2c0(0x5c0)

	void SetUseFieldOfViewForLOD(char bInUseFieldOfViewForLOD); // sub_0x3c8e0d0
	void SetProjectionMode(char InProjectionMode); // sub_0x3c8dfd0
	void SetPostProcessBlendWeight(float InPostProcessBlendWeight); // sub_0x3c8df50
	void SetOrthoWidth(float InOrthoWidth); // sub_0x3c8ded0
	void SetOrthoNearClipPlane(float InOrthoNearClipPlane); // sub_0x3c8de50
	void SetOrthoFarClipPlane(float InOrthoFarClipPlane); // sub_0x3c8ddd0
	void SetFieldOfView(float InFieldOfView); // sub_0x3c8dd50
	void SetConstraintAspectRatio(char bInConstrainAspectRatio); // sub_0x3c8dc40
	void SetAspectRatio(float InAspectRatio); // sub_0x3c8dae0
	void RemoveBlendable(struct TScriptInterface<INone> InBlendableObject); // sub_0x3c8d9b0
	void OnCameraMeshHiddenChanged(); // sub_0x1518fe0
	void GetCameraView(float DeltaTime, struct FNone& DesiredView); // sub_0x3c8d780
	void AddOrUpdateBlendable(struct TScriptInterface<INone> InBlendableObject, float InWeight); // sub_0x3c8d600
};

// Class Engine.CheatManager
// Size: 0x78 (Inherited: 0x28)
struct UCheatManager : UObject 
{
	struct FNone*                                 DebugCameraControllerRef;                                    // 0x28(0x08)
	struct FNone*                                 DebugCameraControllerClass;                                  // 0x30(0x08)
	char                                          UnknownData38[0x40];                                         // 0x38(0x40)

	void Walk(); // sub_0x2ecb570
	void ViewSelf(); // sub_0x1e97fa0
	void ViewPlayer(struct FString S); // sub_0x3ca1480
	void ViewClass(struct FNone* DesiredClass); // sub_0x3ca13f0
	void ViewActor(struct FName ActorName); // sub_0x3ca1360
	void UpdateSafeArea(); // sub_0x3ca1340
	void ToggleServerStatReplicatorUpdateStatNet(); // sub_0x3ca1320
	void ToggleServerStatReplicatorClientOverwrite(); // sub_0x3ca1300
	void ToggleDebugCamera(); // sub_0x3c48910
	void ToggleAILogging(); // sub_0x3ca12e0
	void TestCollisionDistance(); // sub_0x1eadd60
	void Teleport(); // sub_0x3ca12c0
	void Summon(struct FString ClassName); // sub_0x3ca1210
	void StreamLevelOut(struct FName PackageName); // sub_0x3ca1180
	void StreamLevelIn(struct FName PackageName); // sub_0x3ca10f0
	void SpawnServerStatReplicator(); // sub_0x3ca10d0
	void Slomo(float NewTimeDilation); // sub_0x3ca1050
	void SetWorldOrigin(); // sub_0x3ca1030
	void SetReflexLatencyGraph(uint32_t Type, float Min, float MAX); // sub_0x3ca0f30
	void SetMouseSensitivityToDefault(); // sub_0x3ca0f10
	void ServerToggleAILogging(); // sub_0x3ca0e30
	void ReceiveInitCheatManager(); // sub_0x239bfb0
	void ReceiveEndPlay(); // sub_0x239bfb0
	void PlayersOnly(); // sub_0x1e97760
	void OnlyLoadLevel(struct FName PackageName); // sub_0x3ca0da0
	void LogLoc(); // sub_0x3ca0d80
	void InvertMouse(); // sub_0x3ca0d60
	void God(); // sub_0x1e97ea0
	void Ghost(); // sub_0x3c90e30
	void FreezeFrame(float Delay); // sub_0x3ca0ce0
	void Fly(); // sub_0x34bf990
	void FlushLog(); // sub_0x3ca0cc0
	void EnableDebugCamera(); // sub_0x1e43c50
	void DumpVoiceMutingState(); // sub_0x3ca0ca0
	void DumpPartyState(); // sub_0x3ca0c80
	void DumpOnlineSessionState(); // sub_0x3ca0c60
	void DumpChatState(); // sub_0x3ca0c40
	void DisableDebugCamera(); // sub_0x11f5b30
	void DestroyTarget(); // sub_0x1e97dd0
	void DestroyServerStatReplicator(); // sub_0x3ca0c20
	void DestroyPawns(struct FNone* aClass); // sub_0x3ca0b90
	void DestroyAllPawnsExceptTarget(); // sub_0x1e97860
	void DestroyAll(struct FNone* aClass); // sub_0x3ca0b00
	void DebugCapsuleSweepSize(float HalfHeight, float Radius); // sub_0x3ca0a30
	void DebugCapsuleSweepPawn(); // sub_0x3ca0a10
	void DebugCapsuleSweepComplex(char bTraceComplex); // sub_0x3ca0980
	void DebugCapsuleSweepClear(); // sub_0x3ca0960
	void DebugCapsuleSweepChannel(char Channel); // sub_0x3ca08e0
	void DebugCapsuleSweepCapture(); // sub_0x3ca08c0
	void DebugCapsuleSweep(); // sub_0x3ca08a0
	void DamageTarget(float DamageAmount); // sub_0x3ca0820
	void CheatScript(struct FString ScriptName); // sub_0x3ca0730
	void ChangeSize(float F); // sub_0x3ca06b0
	void BugItStringCreator(struct FNone ViewLocation, struct FNone ViewRotation, struct FString& GoString, struct FString& LocString); // sub_0x3ca04e0
	void BugItGo(float X, float Y, float Z, float Pitch, float Yaw, float Roll); // sub_0x3ca0310
	void BugIt(struct FString ScreenShotDescription); // sub_0x3ca0260
};

// Class Engine.CheatManagerEx
// Size: 0x78 (Inherited: 0x78)
struct UCheatManagerEx : UCheatManager 
{
};

// Class Engine.DamageType
// Size: 0x40 (Inherited: 0x28)
struct UDamageType : UObject 
{
	char                                          bCausedByWorld : 0;                                          // 0x28(0x01)
	char                                          bScaleMomentumByMass : 0;                                    // 0x28(0x01)
	char                                          bRadialDamageVelChange : 0;                                  // 0x28(0x01)
	char                                          UnknownData28[0x4];                                          // 0x28(0x04)
	float                                         DamageImpulse;                                               // 0x2c(0x04)
	float                                         DestructibleImpulse;                                         // 0x30(0x04)
	float                                         DestructibleDamageSpreadScale;                               // 0x34(0x04)
	float                                         DamageFalloff;                                               // 0x38(0x04)
	char                                          UnknownData3C[0x4];                                          // 0x3c(0x04)
};

// Class Engine.MKDemoNetDriverEx
// Size: 0x958 (Inherited: 0x748)
struct UMKDemoNetDriverEx : UNetDriver 
{
	char                                          UnknownData748[0x1e0];                                       // 0x748(0x1e0)
	struct FNone*                                 SpectatorControllerClass;                                    // 0x928(0x08)
	struct FNone*                                 SelfDemoNetDriver;                                           // 0x930(0x08)
	char                                          UnknownData938[0x20];                                        // 0x938(0x20)

	void SetReplaySample(struct FNone* Target, struct FNone* ReplaySample, char bSaveCheckpoint); // sub_0x3d79a10
	void GetReplaySampleArray(struct FNone* Target, struct TArray<None>& OutReplaySampleArray); // sub_0x3d78c80
};

// Class Engine.DemoNetDriver
// Size: 0x1398 (Inherited: 0x958)
struct UDemoNetDriver : UMKDemoNetDriverEx 
{
	char                                          UnknownData958[0xf8];                                        // 0x958(0xf8)
	struct TMap<None, None>                       RollbackNetStartupActors;                                    // 0xa50(0x50)
	char                                          UnknownDataAA0[0x42c];                                       // 0xaa0(0x42c)
	float                                         CheckpointSaveMaxMSPerFrame;                                 // 0xecc(0x04)
	char                                          UnknownDataED0[0x30];                                        // 0xed0(0x30)
	struct TArray<None>                           MulticastRecordOptions;                                      // 0xf00(0x10)
	char                                          UnknownDataF10[0x50];                                        // 0xf10(0x50)
	char                                          bIsLocalReplay : 0;                                          // 0xf60(0x01)
	char                                          UnknownDataF60[0x8];                                         // 0xf60(0x08)
	struct TArray<None>                           SpectatorControllers;                                        // 0xf68(0x10)
	char                                          UnknownDataF78[0x420];                                       // 0xf78(0x420)
};

// Class Engine.StaticMeshComponent
// Size: 0x550 (Inherited: 0x4f0)
struct UStaticMeshComponent : UMeshComponent 
{
	uint32_t                                      ForcedLodModel;                                              // 0x4e8(0x04)
	uint32_t                                      PreviousLODLevel;                                            // 0x4ec(0x04)
	uint32_t                                      MinLOD;                                                      // 0x4f0(0x04)
	uint32_t                                      SubDivisionStepSize;                                         // 0x4f4(0x04)
	struct FNone*                                 StaticMesh;                                                  // 0x4f8(0x08)
	struct FNone                                  WireframeColorOverride;                                      // 0x500(0x04)
	char                                          bEvaluateWorldPositionOffset : 0;                            // 0x504(0x01)
	char                                          bOverrideWireframeColor : 0;                                 // 0x504(0x01)
	char                                          UnknownData50C_0 : 7;                                        // 0x50c(0x01)
	char                                          bOverrideMinLod : 1;                                         // 0x504(0x01)
	char                                          bOverrideNavigationExport : 0;                               // 0x504(0x01)
	char                                          bForceNavigationObstacle : 0;                                // 0x504(0x01)
	char                                          bDisallowMeshPaintPerInstance : 0;                           // 0x504(0x01)
	char                                          bIgnoreInstanceForTextureStreaming : 0;                      // 0x504(0x01)
	char                                          bOverrideLightMapRes : 0;                                    // 0x504(0x01)
	char                                          bCastDistanceFieldIndirectShadow : 0;                        // 0x505(0x01)
	char                                          bOverrideDistanceFieldSelfShadowBias : 0;                    // 0x505(0x01)
	char                                          bUseSubDivisions : 0;                                        // 0x505(0x01)
	char                                          bUseDefaultCollision : 0;                                    // 0x505(0x01)
	char                                          bReverseCulling : 0;                                         // 0x505(0x01)
	uint32_t                                      OverriddenLightMapRes;                                       // 0x508(0x04)
	float                                         DistanceFieldIndirectShadowMinVisibility;                    // 0x50c(0x04)
	float                                         DistanceFieldSelfShadowBias;                                 // 0x510(0x04)
	float                                         StreamingDistanceMultiplier;                                 // 0x514(0x04)
	struct TArray<None>                           LODData;                                                     // 0x518(0x10)
	struct TArray<None>                           StreamingTextureData;                                        // 0x528(0x10)
	struct FNone                                  LightmassSettings;                                           // 0x538(0x18)

	char SetStaticMesh(struct FNone* NewMesh); // sub_0x168b600
	void SetReverseCulling(char ReverseCulling); // sub_0x3dfe310
	void SetForcedLodModel(uint32_t NewForcedLodModel); // sub_0x3dfdf90
	void SetDistanceFieldSelfShadowBias(float NewValue); // sub_0x3dfdd10
	void OnRep_StaticMesh(struct FNone* OldStaticMesh); // sub_0x3dfdc90
	void GetLocalBounds(struct FNone& Min, struct FNone& MAX); // sub_0x3dfdaf0
};

// Class Engine.GameEngine
// Size: 0xe38 (Inherited: 0xde8)
struct UGameEngine : UEngine 
{
	float                                         MaxDeltaTime;                                                // 0xde8(0x04)
	float                                         ServerFlushLogInterval;                                      // 0xdec(0x04)
	struct FNone*                                 GameInstance;                                                // 0xdf0(0x08)
	char                                          UnknownDataDF8[0x40];                                        // 0xdf8(0x40)
};

// Class Engine.MKGameInstanceEx
// Size: 0xa8 (Inherited: 0x28)
struct UMKGameInstanceEx : UObject 
{
	struct TArray<None>                           ReplayListItemInfos;                                         // 0x28(0x10)
	struct FMulticastInlineDelegate               OnEnumerateReplayListCompleteEvent;                          // 0x38(0x10)
	struct FMulticastInlineDelegate               OnDeleteReplayCompleteEvent;                                 // 0x48(0x10)
	struct FMulticastInlineDelegate               OnKeepAndDeleteOldetsReplaysCompleteEvent;                   // 0x58(0x10)
	struct FMulticastInlineDelegate               OnKeepAndDeleteOldVersionReplaysCompleteEvent;               // 0x68(0x10)
	char                                          UnknownData78[0x8];                                          // 0x78(0x08)
	struct FNone*                                 SelfGameInstance;                                            // 0x80(0x08)
	char                                          bLoadingWidgetVisible : 0;                                   // 0x88(0x01)
	char                                          UnknownData88[0x20];                                         // 0x88(0x20)

	void PlayReplayCommand(struct FString DemoName); // sub_0x3d79920
	char PlayReplay(struct FNone* LocalPlayer, struct FString DemoName); // sub_0x3d79830
	void OnKeepAndDeleteOldVersionReplaysCompleteEvent__DelegateSignature(); // sub_0x239bfb0
	void OnKeepAndDeleteOldestReplaysCompleteEvent__DelegateSignature(uint32_t nRemainedReplays, char bSuccess); // sub_0x239bfb0
	void OnEnumerateStreamsCompleteEvent__DelegateSignature(uint32_t OutPageIndex, uint32_t OutPageSize); // sub_0x239bfb0
	void OnDeleteStreamCompleteEvent__DelegateSignature(struct FString StreamName, char bSuccess); // sub_0x239bfb0
	void GetNumOfReplays(uint32_t& TotalReplays, uint32_t& ReplaysToKeep); // sub_0x3d78ba0
	void EnumerateReplayList(uint32_t PageIndex, uint32_t PageSize); // sub_0x3d783f0
};

// Class Engine.GameInstance
// Size: 0x218 (Inherited: 0xa8)
struct UGameInstance : UMKGameInstanceEx 
{
	char                                          UnknownDataA8[0x10];                                         // 0xa8(0x10)
	struct TArray<None>                           LocalPlayers;                                                // 0xb8(0x10)
	struct FNone*                                 OnlineSession;                                               // 0xc8(0x08)
	struct TArray<None>                           ReferencedObjects;                                           // 0xd0(0x10)
	char                                          UnknownDataE0[0x138];                                        // 0xe0(0x138)

	void ReceiveShutdown(); // sub_0x239bfb0
	void ReceiveInit(); // sub_0x239bfb0
	void HandleTravelError(char FailureType); // sub_0x239bfb0
	void HandleNetworkError(char FailureType, char bIsServer); // sub_0x239bfb0
	void DebugRemovePlayer(uint32_t ControllerId); // sub_0x3cca970
	void DebugCreatePlayer(uint32_t ControllerId); // sub_0x3cca8e0
};

// Class Engine.GameSession
// Size: 0x328 (Inherited: 0x310)
struct AGameSession : AInfo 
{
	uint32_t                                      MaxSpectators;                                               // 0x310(0x04)
	uint32_t                                      MaxPlayers;                                                  // 0x314(0x04)
	uint32_t                                      MaxPartySize;                                                // 0x318(0x04)
	char                                          MaxSplitscreensPerConnection;                                // 0x31c(0x01)
	char                                          bRequiresPushToTalk : 0;                                     // 0x31d(0x01)
	char                                          UnknownData31D[0x3];                                         // 0x31d(0x03)
	struct FName                                  SessionName;                                                 // 0x320(0x08)
};

// Class Engine.InstancedStaticMeshComponent
// Size: 0x620 (Inherited: 0x550)
struct UInstancedStaticMeshComponent : UStaticMeshComponent 
{
	struct TArray<None>                           PerInstanceSMData;                                           // 0x550(0x10)
	uint32_t                                      NumCustomDataFloats;                                         // 0x560(0x04)
	char                                          UnknownData564[0x4];                                         // 0x564(0x04)
	struct TArray<None>                           PerInstanceSMCustomData;                                     // 0x568(0x10)
	char                                          bMergeCollision : 0;                                         // 0x578(0x01)
	char                                          UnknownData578[0x4];                                         // 0x578(0x04)
	uint32_t                                      InstancingRandomSeed;                                        // 0x57c(0x04)
	uint32_t                                      InstanceStartCullDistance;                                   // 0x580(0x04)
	uint32_t                                      InstanceEndCullDistance;                                     // 0x584(0x04)
	uint8_t                                       CulldistanceType;                                            // 0x588(0x01)
	char                                          UnknownData589[0x3];                                         // 0x589(0x03)
	float                                         MinScreenSizeScale;                                          // 0x58c(0x04)
	char                                          InstanceBodiesSplitRatio;                                    // 0x590(0x01)
