// UserDefinedStruct .SAudioUpdateStruct
struct FSAudioUpdateStruct {
	struct Unknown AudioEmittor_5_EC37367D413769EBC8347085400A4A09; // 0x0 (8)
	char AudioType_4_3CDAA07D4BB9A7FC4028B7A4994A497E; // 0x8 (1)
	float OriginalVolumeMultiplier_11_352BE51B46F8B38B523630B64B21A772; // 0xC (4)
};

// BlueprintGeneratedClass .B
class AB : public AB {

public:

	struct Unknown BravoHotelVehicleTire_R; // 0xD68 (8)
	struct Unknown BravoHotelVehicleTire_F; // 0xD70 (8)
	struct Unknown VehicleSeatCollision1; // 0xD78 (8)
	struct Unknown VehicleSeatCollision; // 0xD80 (8)
	struct Unknown BravoHotelVehicleSeat02; // 0xD88 (8)
};

