// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_Slot_3; //  0x368 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x3b0 Size(c8)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x478 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x490 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x4d8 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x4f0 Size(a0)
	Unknown AnimGraphNode_Slot; //  0x590 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x5d8 Size(18)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceFPP {
	Unknown UberGraphFrame; //  0x700 Size(8)
	Unknown AnimGraphNode_Root; //  0x708 Size(30)
	Unknown AnimGraphNode_LocalToComponentSpace_11; //  0x738 Size(20)
	Unknown AnimGraphNode_TransitionResult_59; //  0x758 Size(28)
	Unknown AnimGraphNode_TransitionResult_58; //  0x780 Size(28)
	Unknown AnimGraphNode_TransitionResult_57; //  0x7a8 Size(28)
	Unknown AnimGraphNode_TransitionResult_56; //  0x7d0 Size(28)
	Unknown AnimGraphNode_TransitionResult_55; //  0x7f8 Size(28)
	Unknown AnimGraphNode_TransitionResult_54; //  0x820 Size(28)
	Unknown AnimGraphNode_TransitionResult_53; //  0x848 Size(28)
	Unknown AnimGraphNode_TransitionResult_52; //  0x870 Size(28)
	Unknown AnimGraphNode_TransitionResult_51; //  0x898 Size(28)
	Unknown AnimGraphNode_TransitionResult_50; //  0x8c0 Size(28)
	Unknown AnimGraphNode_TransitionResult_49; //  0x8e8 Size(28)
	Unknown AnimGraphNode_TransitionResult_48; //  0x910 Size(28)
	Unknown AnimGraphNode_TransitionResult_47; //  0x938 Size(28)
	Unknown AnimGraphNode_TransitionResult_46; //  0x960 Size(28)
	Unknown AnimGraphNode_TransitionResult_45; //  0x988 Size(28)
	Unknown AnimGraphNode_TransitionResult_44; //  0x9b0 Size(28)
	Unknown AnimGraphNode_TransitionResult_43; //  0x9d8 Size(28)
	Unknown AnimGraphNode_TransitionResult_42; //  0xa00 Size(28)
	Unknown AnimGraphNode_TransitionResult_41; //  0xa28 Size(28)
	Unknown AnimGraphNode_TransitionResult_40; //  0xa50 Size(28)
	Unknown AnimGraphNode_SequencePlayer_129; //  0xa78 Size(78)
	Unknown AnimGraphNode_StateResult_36; //  0xaf0 Size(30)
	Unknown AnimGraphNode_SequencePlayer_128; //  0xb20 Size(78)
	Unknown AnimGraphNode_StateResult_35; //  0xb98 Size(30)
	Unknown AnimGraphNode_SequencePlayer_127; //  0xbc8 Size(78)
	Unknown AnimGraphNode_StateResult_34; //  0xc40 Size(30)
	Unknown AnimGraphNode_StateMachine_9; //  0xc70 Size(b0)
	Unknown AnimGraphNode_StateResult_33; //  0xd20 Size(30)
	Unknown AnimGraphNode_TransitionResult_39; //  0xd50 Size(28)
	Unknown AnimGraphNode_TransitionResult_38; //  0xd78 Size(28)
	Unknown AnimGraphNode_BlendSpacePlayer_27; //  0xda0 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_126; //  0xe80 Size(78)
	Unknown AnimGraphNode_ApplyAdditive_4; //  0xef8 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_125; //  0xfc0 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_26; //  0x1038 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_26; //  0x10e8 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_25; //  0x11c8 Size(e0)
	Unknown AnimGraphNode_BlendListByEnum_25; //  0x12a8 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_24; //  0x1358 Size(e0)
	Unknown AnimGraphNode_StateResult_32; //  0x1438 Size(30)
	Unknown AnimGraphNode_BlendSpacePlayer_23; //  0x1468 Size(e0)
	Unknown AnimGraphNode_BlendListByBo_24; //  0x1548 Size(a0)
	Unknown AnimGraphNode_RotationOffsetBlendSpace; //  0x15e8 Size(188)
	Unknown AnimGraphNode_ModifyBone_15; //  0x1770 Size(108)
	Unknown AnimGraphNode_ModifyBone_14; //  0x1878 Size(108)
	Unknown AnimGraphNode_TwoBoneIK_9; //  0x1980 Size(1e0)
	Unknown AnimGraphNode_TwoBoneIK_8; //  0x1b60 Size(1e0)
	Unknown AnimGraphNode_SequencePlayer_124; //  0x1d40 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_7; //  0x1db8 Size(c0)
	Unknown AnimGraphNode_TransitionResult_37; //  0x1e78 Size(28)
	Unknown AnimGraphNode_TransitionResult_36; //  0x1ea0 Size(28)
	Unknown AnimGraphNode_TransitionResult_35; //  0x1ec8 Size(28)
	Unknown AnimGraphNode_TransitionResult_34; //  0x1ef0 Size(28)
	Unknown AnimGraphNode_TransitionResult_33; //  0x1f18 Size(28)
	Unknown AnimGraphNode_TransitionResult_32; //  0x1f40 Size(28)
	Unknown AnimGraphNode_SequencePlayer_123; //  0x1f68 Size(78)
	Unknown AnimGraphNode_StateResult_31; //  0x1fe0 Size(30)
	Unknown AnimGraphNode_SequencePlayer_122; //  0x2010 Size(78)
	Unknown AnimGraphNode_StateResult_30; //  0x2088 Size(30)
	Unknown AnimGraphNode_SequencePlayer_121; //  0x20b8 Size(78)
	Unknown AnimGraphNode_StateResult_29; //  0x2130 Size(30)
	Unknown AnimGraphNode_StateMachine_8; //  0x2160 Size(b0)
	Unknown AnimGraphNode_ComponentToLo_11; //  0x2210 Size(20)
	Unknown AnimGraphNode_LocalToComponentSpace_10; //  0x2230 Size(20)
	Unknown AnimGraphNode_Fabrik_2; //  0x2250 Size(190)
	Unknown AnimGraphNode_Fabrik; //  0x23e0 Size(190)
	Unknown AnimGraphNode_StateResult_28; //  0x2570 Size(30)
	Unknown AnimGraphNode_StateMachine_7; //  0x25a0 Size(b0)
	Unknown AnimGraphNode_StateResult_27; //  0x2650 Size(30)
	Unknown AnimGraphNode_TransitionResult_31; //  0x2680 Size(28)
	Unknown AnimGraphNode_TransitionResult_30; //  0x26a8 Size(28)
	Unknown AnimGraphNode_TransitionResult_29; //  0x26d0 Size(28)
	Unknown AnimGraphNode_SequencePlayer_120; //  0x26f8 Size(78)
	Unknown AnimGraphNode_StateResult_26; //  0x2770 Size(30)
	Unknown AnimGraphNode_BlendSpacePlayer_22; //  0x27a0 Size(e0)
	Unknown AnimGraphNode_StateResult_25; //  0x2880 Size(30)
	Unknown AnimGraphNode_SequencePlayer_119; //  0x28b0 Size(78)
	Unknown AnimGraphNode_StateResult_24; //  0x2928 Size(30)
	Unknown AnimGraphNode_StateMachine_6; //  0x2958 Size(b0)
	Unknown AnimGraphNode_StateResult_23; //  0x2a08 Size(30)
	Unknown AnimGraphNode_TransitionResult_28; //  0x2a38 Size(28)
	Unknown AnimGraphNode_TransitionResult_27; //  0x2a60 Size(28)
	Unknown AnimGraphNode_TransitionResult_26; //  0x2a88 Size(28)
	Unknown AnimGraphNode_TransitionResult_25; //  0x2ab0 Size(28)
	Unknown AnimGraphNode_BlendSpacePlayer_21; //  0x2ad8 Size(e0)
	Unknown AnimGraphNode_StateResult_22; //  0x2bb8 Size(30)
	Unknown AnimGraphNode_BlendSpacePlayer_20; //  0x2be8 Size(e0)
	Unknown AnimGraphNode_StateResult_21; //  0x2cc8 Size(30)
	Unknown AnimGraphNode_StateMachine_5; //  0x2cf8 Size(b0)
	Unknown AnimGraphNode_StateResult_20; //  0x2da8 Size(30)
	Unknown AnimGraphNode_TransitionResult_24; //  0x2dd8 Size(28)
	Unknown AnimGraphNode_TransitionResult_23; //  0x2e00 Size(28)
	Unknown AnimGraphNode_SequencePlayer_118; //  0x2e28 Size(78)
	Unknown AnimGraphNode_StateResult_19; //  0x2ea0 Size(30)
	Unknown AnimGraphNode_SequencePlayer_117; //  0x2ed0 Size(78)
	Unknown AnimGraphNode_StateResult_18; //  0x2f48 Size(30)
	Unknown AnimGraphNode_StateMachine_4; //  0x2f78 Size(b0)
	Unknown AnimGraphNode_StateResult_17; //  0x3028 Size(30)
	Unknown AnimGraphNode_StateMachine_3; //  0x3058 Size(b0)
	Unknown AnimGraphNode_StateResult_16; //  0x3108 Size(30)
	Unknown AnimGraphNode_TransitionResult_22; //  0x3138 Size(28)
	Unknown AnimGraphNode_SequencePlayer_116; //  0x3160 Size(78)
	Unknown AnimGraphNode_BlendListByBo_23; //  0x31d8 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_115; //  0x3278 Size(78)
	Unknown AnimGraphNode_SequencePlayer_114; //  0x32f0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_113; //  0x3368 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_24; //  0x33e0 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_112; //  0x3490 Size(78)
	Unknown AnimGraphNode_StateResult_15; //  0x3508 Size(30)
	Unknown AnimGraphNode_SequencePlayer_111; //  0x3538 Size(78)
	Unknown AnimGraphNode_BlendListByBo_22; //  0x35b0 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_110; //  0x3650 Size(78)
	Unknown AnimGraphNode_SequencePlayer_109; //  0x36c8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_108; //  0x3740 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_23; //  0x37b8 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_107; //  0x3868 Size(78)
	Unknown AnimGraphNode_StateResult_14; //  0x38e0 Size(30)
	Unknown AnimGraphNode_SequencePlayer_106; //  0x3910 Size(78)
	Unknown AnimGraphNode_SequencePlayer_105; //  0x3988 Size(78)
	Unknown AnimGraphNode_SequencePlayer_104; //  0x3a00 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_22; //  0x3a78 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_103; //  0x3b28 Size(78)
	Unknown AnimGraphNode_StateResult_13; //  0x3ba0 Size(30)
	Unknown AnimGraphNode_ApplyAdditive_3; //  0x3bd0 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_102; //  0x3c98 Size(78)
	Unknown AnimGraphNode_SequencePlayer_101; //  0x3d10 Size(78)
	Unknown AnimGraphNode_Slot_13; //  0x3d88 Size(48)
	Unknown AnimGraphNode_Slot_12; //  0x3dd0 Size(48)
	Unknown AnimGraphNode_BlendListByEnum_21; //  0x3e18 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_100; //  0x3ec8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_99; //  0x3f40 Size(78)
	Unknown AnimGraphNode_SequencePlayer_98; //  0x3fb8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_97; //  0x4030 Size(78)
	Unknown AnimGraphNode_SequencePlayer_96; //  0x40a8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_95; //  0x4120 Size(78)
	Unknown AnimGraphNode_SequencePlayer_94; //  0x4198 Size(78)
	Unknown AnimGraphNode_SequencePlayer_93; //  0x4210 Size(78)
	Unknown AnimGraphNode_SequencePlayer_92; //  0x4288 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_20; //  0x4300 Size(b0)
	Unknown AnimGraphNode_TwoWayBlend_6; //  0x43b0 Size(c8)
	Unknown AnimGraphNode_ApplyAdditive_2; //  0x4478 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_91; //  0x4540 Size(78)
	Unknown AnimGraphNode_TransitionResult_21; //  0x45b8 Size(28)
	Unknown AnimGraphNode_TransitionResult_20; //  0x45e0 Size(28)
	Unknown AnimGraphNode_TransitionResult_19; //  0x4608 Size(28)
	Unknown AnimGraphNode_TransitionResult_18; //  0x4630 Size(28)
	Unknown AnimGraphNode_TransitionResult_17; //  0x4658 Size(28)
	Unknown AnimGraphNode_TransitionResult_16; //  0x4680 Size(28)
	Unknown AnimGraphNode_TransitionResult_15; //  0x46a8 Size(28)
	Unknown AnimGraphNode_TransitionResult_14; //  0x46d0 Size(28)
	Unknown AnimGraphNode_TransitionResult_13; //  0x46f8 Size(28)
	Unknown AnimGraphNode_TransitionResult_12; //  0x4720 Size(28)
	Unknown AnimGraphNode_TransitionResult_11; //  0x4748 Size(28)
	Unknown AnimGraphNode_TransitionResult_10; //  0x4770 Size(28)
	Unknown AnimGraphNode_TransitionResult_9; //  0x4798 Size(28)
	Unknown AnimGraphNode_TransitionResult_8; //  0x47c0 Size(28)
	Unknown AnimGraphNode_TransitionResult_7; //  0x47e8 Size(28)
	Unknown AnimGraphNode_TransitionResult_6; //  0x4810 Size(28)
	Unknown AnimGraphNode_TransitionResult_5; //  0x4838 Size(28)
	Unknown AnimGraphNode_TransitionResult_4; //  0x4860 Size(28)
	Unknown AnimGraphNode_TransitionResult_3; //  0x4888 Size(28)
	Unknown AnimGraphNode_TransitionResult_2; //  0x48b0 Size(28)
	Unknown AnimGraphNode_TransitionResult; //  0x48d8 Size(28)
	Unknown AnimGraphNode_SequencePlayer_90; //  0x4900 Size(78)
	Unknown AnimGraphNode_StateResult_12; //  0x4978 Size(30)
	Unknown AnimGraphNode_SequencePlayer_89; //  0x49a8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_88; //  0x4a20 Size(78)
	Unknown AnimGraphNode_SequencePlayer_87; //  0x4a98 Size(78)
	Unknown AnimGraphNode_SequencePlayer_86; //  0x4b10 Size(78)
	Unknown AnimGraphNode_SequencePlayer_85; //  0x4b88 Size(78)
	Unknown AnimGraphNode_SequencePlayer_84; //  0x4c00 Size(78)
	Unknown AnimGraphNode_SequencePlayer_83; //  0x4c78 Size(78)
	Unknown AnimGraphNode_SequencePlayer_82; //  0x4cf0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_81; //  0x4d68 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_19; //  0x4de0 Size(b0)
	Unknown AnimGraphNode_StateResult_11; //  0x4e90 Size(30)
	Unknown AnimGraphNode_SequencePlayer_80; //  0x4ec0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_79; //  0x4f38 Size(78)
	Unknown AnimGraphNode_SequencePlayer_78; //  0x4fb0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_77; //  0x5028 Size(78)
	Unknown AnimGraphNode_SequencePlayer_76; //  0x50a0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_75; //  0x5118 Size(78)
	Unknown AnimGraphNode_SequencePlayer_74; //  0x5190 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_18; //  0x5208 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_73; //  0x52b8 Size(78)
	Unknown AnimGraphNode_StateResult_10; //  0x5330 Size(30)
	Unknown AnimGraphNode_SequencePlayer_72; //  0x5360 Size(78)
	Unknown AnimGraphNode_SequencePlayer_71; //  0x53d8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_70; //  0x5450 Size(78)
	Unknown AnimGraphNode_SequencePlayer_69; //  0x54c8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_68; //  0x5540 Size(78)
	Unknown AnimGraphNode_SequencePlayer_67; //  0x55b8 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_17; //  0x5630 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_66; //  0x56e0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_65; //  0x5758 Size(78)
	Unknown AnimGraphNode_StateResult_9; //  0x57d0 Size(30)
	Unknown AnimGraphNode_SequencePlayer_64; //  0x5800 Size(78)
	Unknown AnimGraphNode_SequencePlayer_63; //  0x5878 Size(78)
	Unknown AnimGraphNode_SequencePlayer_62; //  0x58f0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_61; //  0x5968 Size(78)
	Unknown AnimGraphNode_SequencePlayer_60; //  0x59e0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_59; //  0x5a58 Size(78)
	Unknown AnimGraphNode_SequencePlayer_58; //  0x5ad0 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_16; //  0x5b48 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_57; //  0x5bf8 Size(78)
	Unknown AnimGraphNode_StateResult_8; //  0x5c70 Size(30)
	Unknown AnimGraphNode_SequencePlayer_56; //  0x5ca0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_55; //  0x5d18 Size(78)
	Unknown AnimGraphNode_SequencePlayer_54; //  0x5d90 Size(78)
	Unknown AnimGraphNode_SequencePlayer_53; //  0x5e08 Size(78)
	Unknown AnimGraphNode_SequencePlayer_52; //  0x5e80 Size(78)
	Unknown AnimGraphNode_SequencePlayer_51; //  0x5ef8 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_15; //  0x5f70 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_50; //  0x6020 Size(78)
	Unknown AnimGraphNode_SequencePlayer_49; //  0x6098 Size(78)
	Unknown AnimGraphNode_StateResult_7; //  0x6110 Size(30)
	Unknown AnimGraphNode_SequencePlayer_48; //  0x6140 Size(78)
	Unknown AnimGraphNode_BlendListByBo_21; //  0x61b8 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_47; //  0x6258 Size(78)
	Unknown AnimGraphNode_SequencePlayer_46; //  0x62d0 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_14; //  0x6348 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_45; //  0x63f8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_44; //  0x6470 Size(78)
	Unknown AnimGraphNode_SequencePlayer_43; //  0x64e8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_42; //  0x6560 Size(78)
	Unknown AnimGraphNode_SequencePlayer_41; //  0x65d8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_40; //  0x6650 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_13; //  0x66c8 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_39; //  0x6778 Size(78)
	Unknown AnimGraphNode_StateResult_6; //  0x67f0 Size(30)
	Unknown AnimGraphNode_SequencePlayer_38; //  0x6820 Size(78)
	Unknown AnimGraphNode_BlendListByBo_20; //  0x6898 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_37; //  0x6938 Size(78)
	Unknown AnimGraphNode_SequencePlayer_36; //  0x69b0 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_12; //  0x6a28 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_35; //  0x6ad8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_34; //  0x6b50 Size(78)
	Unknown AnimGraphNode_SequencePlayer_33; //  0x6bc8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_32; //  0x6c40 Size(78)
	Unknown AnimGraphNode_SequencePlayer_31; //  0x6cb8 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_11; //  0x6d30 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_30; //  0x6de0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_29; //  0x6e58 Size(78)
	Unknown AnimGraphNode_StateResult_5; //  0x6ed0 Size(30)
	Unknown AnimGraphNode_SequencePlayer_28; //  0x6f00 Size(78)
	Unknown AnimGraphNode_BlendListByBo_19; //  0x6f78 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_19; //  0x7018 Size(e0)
	Unknown AnimGraphNode_BlendListByBo_18; //  0x70f8 Size(a0)
	Unknown AnimGraphNode_LayeredBoneBlend_6; //  0x7198 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_27; //  0x7258 Size(78)
	Unknown AnimGraphNode_BlendSpacePlayer_18; //  0x72d0 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_26; //  0x73b0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_25; //  0x7428 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_10; //  0x74a0 Size(b0)
	Unknown AnimGraphNode_TwoWayBlend_5; //  0x7550 Size(c8)
	Unknown AnimGraphNode_BlendSpacePlayer_17; //  0x7618 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_24; //  0x76f8 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_9; //  0x7770 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_16; //  0x7820 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_15; //  0x7900 Size(e0)
	Unknown AnimGraphNode_BlendListByEnum_8; //  0x79e0 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_14; //  0x7a90 Size(e0)
	Unknown AnimGraphNode_StateResult_4; //  0x7b70 Size(30)
	Unknown AnimGraphNode_SequencePlayer_23; //  0x7ba0 Size(78)
	Unknown AnimGraphNode_BlendListByBo_17; //  0x7c18 Size(a0)
	Unknown AnimGraphNode_ComponentToLor_10; //  0x7cb8 Size(20)
	Unknown AnimGraphNode_LocalToComponentSpace_9; //  0x7cd8 Size(20)
	Unknown AnimGraphNode_ModifyBone_13; //  0x7cf8 Size(108)
	Unknown AnimGraphNode_BlendSpacePlayer_13; //  0x7e00 Size(e0)
	Unknown AnimGraphNode_BlendListByBo_16; //  0x7ee0 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_12; //  0x7f80 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_22; //  0x8060 Size(78)
	Unknown AnimGraphNode_SequencePlayer_21; //  0x80d8 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_7; //  0x8150 Size(b0)
	Unknown AnimGraphNode_TwoWayBlend_4; //  0x8200 Size(c8)
	Unknown AnimGraphNode_BlendSpacePlayer_11; //  0x82c8 Size(e0)
	Unknown AnimGraphNode_BlendListByBo_15; //  0x83a8 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_10; //  0x8448 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_20; //  0x8528 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_6; //  0x85a0 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_9; //  0x8650 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_8; //  0x8730 Size(e0)
	Unknown AnimGraphNode_BlendListByEnum_5; //  0x8810 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_7; //  0x88c0 Size(e0)
	Unknown AnimGraphNode_StateResult_3; //  0x89a0 Size(30)
	Unknown AnimGraphNode_SequencePlayer_19; //  0x89d0 Size(78)
	Unknown AnimGraphNode_BlendListByBo_14; //  0x8a48 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_6; //  0x8ae8 Size(e0)
	Unknown AnimGraphNode_BlendListByBo_13; //  0x8bc8 Size(a0)
	Unknown AnimGraphNode_LayeredBoneBlend_5; //  0x8c68 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_18; //  0x8d28 Size(78)
	Unknown AnimGraphNode_SequencePlayer_17; //  0x8da0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_16; //  0x8e18 Size(78)
	Unknown AnimGraphNode_BlendSpacePlayer_5; //  0x8e90 Size(e0)
	Unknown AnimGraphNode_BlendListByInt; //  0x8f70 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_4; //  0x9010 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_15; //  0x90f0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_14; //  0x9168 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_4; //  0x91e0 Size(b0)
	Unknown AnimGraphNode_TwoWayBlend_3; //  0x9290 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_13; //  0x9358 Size(78)
	Unknown AnimGraphNode_SequencePlayer_12; //  0x93d0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_11; //  0x9448 Size(78)
	Unknown AnimGraphNode_SequencePlayer_10; //  0x94c0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_9; //  0x9538 Size(78)
	Unknown AnimGraphNode_SequencePlayer_8; //  0x95b0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_7; //  0x9628 Size(78)
	Unknown AnimGraphNode_SequencePlayer_6; //  0x96a0 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_3; //  0x9718 Size(b0)
	Unknown AnimGraphNode_BlendListByBo_12; //  0x97c8 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_3; //  0x9868 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_5; //  0x9948 Size(78)
	Unknown AnimGraphNode_SequencePlayer_4; //  0x99c0 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_2; //  0x9a38 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_2; //  0x9ae8 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer; //  0x9bc8 Size(e0)
	Unknown AnimGraphNode_BlendListByEnum; //  0x9ca8 Size(b0)
	Unknown AnimGraphNode_StateResult_2; //  0x9d58 Size(30)
	Unknown AnimGraphNode_StateMachine_2; //  0x9d88 Size(b0)
	Unknown AnimGraphNode_StateResult; //  0x9e38 Size(30)
	Unknown AnimGraphNode_StateMachine; //  0x9e68 Size(b0)
	Unknown AnimGraphNode_SaveCachedPose_14; //  0x9f18 Size(b8)
	Unknown AnimGraphNode_CopyPoseFromMesh; //  0x9fd0 Size(140)
	Unknown AnimGraphNode_LayeredBoneBlend_4; //  0xa110 Size(c0)
	Unknown AnimGraphNode_SaveCachedPose_13; //  0xa1d0 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_27; //  0xa288 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_12; //  0xa2b0 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_26; //  0xa368 Size(28)
	Unknown AnimGraphNode_ModifyBone_12; //  0xa390 Size(108)
	Unknown AnimGraphNode_ComponentToLo_9; //  0xa498 Size(20)
	Unknown AnimGraphNode_SaveCachedPose_11; //  0xa4b8 Size(b8)
	Unknown AnimGraphNode_ComponentToLo_8; //  0xa570 Size(20)
	Unknown AnimGraphNode_LocalToComponentSpace_8; //  0xa590 Size(20)
	Unknown AnimGraphNode_ComponentToLo_7; //  0xa5b0 Size(20)
	Unknown AnimGraphNode_SaveCachedPose_10; //  0xa5d0 Size(b8)
	Unknown AnimGraphNode_SaveCachedPose_9; //  0xa688 Size(b8)
	Unknown AnimGraphNode_LocalToComponentSpace_7; //  0xa740 Size(20)
	Unknown AnimGraphNode_TwoBoneIK_7; //  0xa760 Size(1e0)
	Unknown AnimGraphNode_TwoBoneIK_6; //  0xa940 Size(1e0)
	Unknown AnimGraphNode_UseCachedPose_25; //  0xab20 Size(28)
	Unknown AnimGraphNode_ModifyBone_11; //  0xab48 Size(108)
	Unknown AnimGraphNode_BlendListByBo_11; //  0xac50 Size(a0)
	Unknown AnimGraphNode_TwoWayBlend_2; //  0xacf0 Size(c8)
	Unknown AnimGraphNode_SaveCachedPose_8; //  0xadb8 Size(b8)
	Unknown AnimGraphNode_ModifyBone_10; //  0xae70 Size(108)
	Unknown AnimGraphNode_BlendListByBo_10; //  0xaf78 Size(a0)
	Unknown AnimGraphNode_LayeredBoneBlend_3; //  0xb018 Size(c0)
	Unknown AnimGraphNode_UseCachedPose_24; //  0xb0d8 Size(28)
	Unknown AnimGraphNode_CopyBone_2; //  0xb100 Size(f0)
	Unknown AnimGraphNode_ApplyAdditive; //  0xb1f0 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_3; //  0xb2b8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_2; //  0xb330 Size(78)
	Unknown AnimGraphNode_SaveCachedPose_7; //  0xb3a8 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_23; //  0xb460 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_6; //  0xb488 Size(b8)
	Unknown AnimGraphNode_ModifyBone_9; //  0xb540 Size(108)
	Unknown AnimGraphNode_BlendListByBo_9; //  0xb648 Size(a0)
	Unknown AnimGraphNode_ComponentToLoe_6; //  0xb6e8 Size(20)
	Unknown AnimGraphNode_LocalToComponentSpace_6; //  0xb708 Size(20)
	Unknown AnimGraphNode_SaveCachedPose_5; //  0xb728 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_22; //  0xb7e0 Size(28)
	Unknown AnimGraphNode_CopyBone; //  0xb808 Size(f0)
	Unknown AnimGraphNode_ModifyBone_8; //  0xb8f8 Size(108)
	Unknown AnimGraphNode_BlendListByBo_8; //  0xba00 Size(a0)
	Unknown AnimGraphNode_Slot_11; //  0xbaa0 Size(48)
	Unknown AnimGraphNode_Slot_10; //  0xbae8 Size(48)
	Unknown AnimGraphNode_Slot_9; //  0xbb30 Size(48)
	Unknown AnimGraphNode_Slot_8; //  0xbb78 Size(48)
	Unknown AnimGraphNode_BlendListByBo_7; //  0xbbc0 Size(a0)
	Unknown AnimGraphNode_UseCachedPose_21; //  0xbc60 Size(28)
	Unknown AnimGraphNode_Slot_7; //  0xbc88 Size(48)
	Unknown AnimGraphNode_Slot_6; //  0xbcd0 Size(48)
	Unknown AnimGraphNode_ModifyBone_7; //  0xbd18 Size(108)
	Unknown AnimGraphNode_ModifyBone_6; //  0xbe20 Size(108)
	Unknown AnimGraphNode_UseCachedPose_20; //  0xbf28 Size(28)
	Unknown AnimGraphNode_ModifyBone_5; //  0xbf50 Size(108)
	Unknown AnimGraphNode_LocalToComponentSpace_5; //  0xc058 Size(20)
	Unknown AnimGraphNode_SaveCachedPose_4; //  0xc078 Size(b8)
	Unknown AnimGraphNode_ComponentToLo_5; //  0xc130 Size(20)
	Unknown AnimGraphNode_UseCachedPose_19; //  0xc150 Size(28)
	Unknown AnimGraphNode_LocalToComponentSpace_4; //  0xc178 Size(20)
	Unknown AnimGraphNode_TwoBoneIK_5; //  0xc1a0 Size(1e0)
	Unknown AnimGraphNode_ComponentToLo_4; //  0xc380 Size(20)
	Unknown AnimGraphNode_Slot_5; //  0xc3a0 Size(48)
	Unknown AnimGraphNode_LayeredBoneBlend_2; //  0xc3e8 Size(c0)
	Unknown AnimGraphNode_UseCachedPose_18; //  0xc4a8 Size(28)
	Unknown AnimGraphNode_Slot_4; //  0xc4d0 Size(48)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0xc518 Size(c0)
	Unknown AnimGraphNode_UseCachedPose_17; //  0xc5d8 Size(28)
	Unknown AnimGraphNode_UseCachedPose_16; //  0xc600 Size(28)
	Unknown AnimGraphNode_BlendListByBo_6; //  0xc628 Size(a0)
	Unknown AnimGraphNode_UseCachedPose_15; //  0xc6c8 Size(28)
	Unknown AnimGraphNode_TwoWayBlend; //  0xc6f0 Size(c8)
	Unknown AnimGraphNode_ComponentToLo_3; //  0xc7b8 Size(20)
	Unknown AnimGraphNode_LocalToComponentSpace_3; //  0xc7d8 Size(20)
	Unknown AnimGraphNode_SaveCachedPose_3; //  0xc7f8 Size(b8)
	Unknown AnimGraphNode_BlendListByBo_5; //  0xc8b0 Size(a0)
	Unknown AnimGraphNode_UseCachedPose_14; //  0xc950 Size(28)
	Unknown AnimGraphNode_TwoBoneIK_4; //  0xc980 Size(1e0)
	Unknown AnimGraphNode_TwoBoneIK_3; //  0xcb60 Size(1e0)
	Unknown AnimGraphNode_ModifyBone_4; //  0xcd40 Size(108)
	Unknown AnimGraphNode_ModifyBone_3; //  0xce48 Size(108)
	Unknown AnimGraphNode_Slot_3; //  0xcf50 Size(48)
	Unknown AnimGraphNode_TwoBoneIK_2; //  0xcfa0 Size(1e0)
	Unknown AnimGraphNode_BlendListByBo_4; //  0xd180 Size(a0)
	Unknown AnimGraphNode_ModifyBone_2; //  0xd220 Size(108)
	Unknown AnimGraphNode_LocalToComponentSpace_2; //  0xd328 Size(20)
	Unknown AnimGraphNode_ComponentToLo_2; //  0xd348 Size(20)
	Unknown AnimGraphNode_BlendListByBoen_3; //  0xd368 Size(a0)
	Unknown AnimGraphNode_Slot_2; //  0xd408 Size(48)
	Unknown AnimGraphNode_Slot; //  0xd450 Size(48)
	Unknown AnimGraphNode_SaveCachedPose_2; //  0xd498 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_13; //  0xd550 Size(28)
	Unknown AnimGraphNode_UseCachedPose_12; //  0xd578 Size(28)
	Unknown AnimGraphNode_UseCachedPose_11; //  0xd5a0 Size(28)
	Unknown AnimGraphNode_UseCachedPose_10; //  0xd5c8 Size(28)
	Unknown AnimGraphNode_UseCachedPose_9; //  0xd5f0 Size(28)
	Unknown AnimGraphNode_UseCachedPose_8; //  0xd618 Size(28)
	Unknown AnimGraphNode_UseCachedPose_7; //  0xd640 Size(28)
	Unknown AnimGraphNode_UseCachedPose_6; //  0xd668 Size(28)
	Unknown AnimGraphNode_UseCachedPose_5; //  0xd690 Size(28)
	Unknown AnimGraphNode_UseCachedPose_4; //  0xd6b8 Size(28)
	Unknown AnimGraphNode_BlendListByBo_2; //  0xd6e0 Size(a0)
	Unknown AnimGraphNode_SequencePlayer; //  0xd780 Size(78)
	Unknown AnimGraphNode_ModifyBone; //  0xd7f8 Size(108)
	Unknown AnimGraphNode_TwoBoneIK; //  0xd900 Size(1e0)
	Unknown AnimGraphNode_LocalToComponentSpace; //  0xdae0 Size(20)
	Unknown AnimGraphNode_ComponentToLo; //  0xdb00 Size(20)
	Unknown AnimGraphNode_SaveCachedPose; //  0xdb20 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_3; //  0xdbd8 Size(28)
	Unknown AnimGraphNode_UseCachedPose_2; //  0xdc00 Size(28)
	Unknown AnimGraphNode_BlendListByBo; //  0xdc28 Size(a0)
	Unknown AnimGraphNode_UseCachedPose; //  0xdcc8 Size(28)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_Slot_3; //  0x368 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x3b0 Size(c8)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x478 Size(18)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x490 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x4a8 Size(48)
	Unknown AnimGraphNode_Slot; //  0x4f0 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x538 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x550 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UAnimInstance {
	Unknown UberGraphFrame; //  0x270 Size(8)
	Unknown AnimGraphNode_AnimDynamics_11; //  0x280 Size(440)
	Unknown AnimGraphNode_AnimDynamics_10; //  0x6c0 Size(440)
	Unknown AnimGraphNode_ComponentToLo; //  0xb00 Size(20)
	Unknown AnimGraphNode_AnimDynamics_9; //  0xb20 Size(440)
	Unknown AnimGraphNode_AnimDynamics_8; //  0xf60 Size(440)
	Unknown AnimGraphNode_AnimDynamics_7; //  0x13a0 Size(440)
	Unknown AnimGraphNode_AnimDynamics_6; //  0x17e0 Size(440)
	Unknown AnimGraphNode_AnimDynamics_5; //  0x1c20 Size(440)
	Unknown AnimGraphNode_AnimDynamics_4; //  0x2060 Size(440)
	Unknown AnimGraphNode_AnimDynamics_3; //  0x24a0 Size(440)
	Unknown AnimGraphNode_LocalToComponentSpace; //  0x28e0 Size(20)
	Unknown AnimGraphNode_SequencePlayer_12; //  0x2900 Size(78)
	Unknown AnimGraphNode_TransitionResult_4; //  0x2978 Size(28)
	Unknown AnimGraphNode_TransitionResult_3; //  0x29a0 Size(28)
	Unknown AnimGraphNode_TransitionResult_2; //  0x29c8 Size(28)
	Unknown AnimGraphNode_TransitionResult; //  0x29f0 Size(28)
	Unknown AnimGraphNode_SequencePlayer_11; //  0x2a18 Size(78)
	Unknown AnimGraphNode_StateResult_4; //  0x2a90 Size(30)
	Unknown AnimGraphNode_SequencePlayer_10; //  0x2ac0 Size(78)
	Unknown AnimGraphNode_StateResult_3; //  0x2b38 Size(30)
	Unknown AnimGraphNode_SequencePlayer_9; //  0x2b68 Size(78)
	Unknown AnimGraphNode_StateResult_2; //  0x2be0 Size(30)
	Unknown AnimGraphNode_SequencePlayer_8; //  0x2c10 Size(78)
	Unknown AnimGraphNode_StateResult; //  0x2c88 Size(30)
	Unknown AnimGraphNode_StateMachine; //  0x2cb8 Size(b0)
	Unknown AnimGraphNode_SaveCachedPose_3; //  0x2d68 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_6; //  0x2e20 Size(28)
	Unknown AnimGraphNode_UseCachedPose_5; //  0x2e48 Size(28)
	Unknown AnimGraphNode_UseCachedPose_4; //  0x2e70 Size(28)
	Unknown AnimGraphNode_UseCachedPose_3; //  0x2e98 Size(28)
	Unknown AnimGraphNode_AnimDynamics_2; //  0x2ec0 Size(440)
	Unknown AnimGraphNode_AnimDynamics; //  0x3300 Size(440)
	Unknown AnimGraphNode_KawaiiPhysics_12; //  0x3740 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_11; //  0x3990 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_10; //  0x3be0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_9; //  0x3e30 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_8; //  0x4080 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_7; //  0x42d0 Size(250)
	Unknown AnimGraphNode_BoneDrivenController_8; //  0x4520 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_7; //  0x4638 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_6; //  0x4750 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_5; //  0x4868 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_4; //  0x4980 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_3; //  0x4a98 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_2; //  0x4bb0 Size(118)
	Unknown AnimGraphNode_BoneDrivenController; //  0x4cc8 Size(118)
	Unknown AnimGraphNode_SaveCachedPose_2; //  0x4de0 Size(b8)
	Unknown AnimGraphNode_BlendListByEnum; //  0x4e98 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_7; //  0x4f48 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_2; //  0x4fc0 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_6; //  0x5080 Size(78)
	Unknown AnimGraphNode_SequencePlayer_5; //  0x50f8 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x5170 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_4; //  0x5230 Size(78)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x52a8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x5320 Size(78)
	Unknown AnimGraphNode_ApplyAdditive; //  0x5398 Size(c8)
	Unknown AnimGraphNode_UseCachedPose_2; //  0x5460 Size(28)
	Unknown AnimGraphNode_UseCachedPose; //  0x5488 Size(28)
	Unknown AnimGraphNode_SaveCachedPose; //  0x54b0 Size(b8)
	Unknown AnimGraphNode_BlendListByBo; //  0x5568 Size(a0)
	Unknown AnimGraphNode_SequencePlayer; //  0x5608 Size(78)
	Unknown AnimGraphNode_BlendListByInt; //  0x5680 Size(a0)
	Unknown AnimGraphNode_Root; //  0x5720 Size(30)
	Unknown AnimGraphNode_KawaiiPhysics_6; //  0x5750 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_5; //  0x59a0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_4; //  0x5bf0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_3; //  0x5e40 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_2; //  0x6090 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics; //  0x62e0 Size(250)
	int32_t PawnIndex; //  0x6530 Size(4)
	int32_t IdleNum; //  0x6534 Size(4)
	Unknown IdleAnimSequence; //  0x6538 Size(8)
	Unknown CharacterRef; //  0x6540 Size(8)
	char bIsMale; //  0x6548 Size(1)
	char bIsEquippingWeapon; //  0x6549 Size(1)
	Unknown WeaponAnimType; //  0x654a Size(1)
	Unknown HandAnim; //  0x6550 Size(8)
	Unknown GripType; //  0x6558 Size(1)
	char bIsEquippingNormalGrip; //  0x6559 Size(1)
	Unknown HandL_Location; //  0x655c Size(c)
	Unknown HandL_Rotation; //  0x6568 Size(c)
	float LeftHandIK_Alpha; //  0x6574 Size(4)
	Unknown AnimDynamicsForce; //  0x6578 Size(c)
	float PrevCharacterRotationYaw; //  0x6584 Size(4)
	float RightHandIK_Alpha; //  0x6588 Size(4)
	char bReady; //  0x658c Size(1)
	Unknown ReadyAnimSequence; //  0x6590 Size(8)
	Unknown Readyon_AnimSequence; //  0x6598 Size(8)
	Unknown Readyoff_AnimSequence; //  0x65a0 Size(8)
	float DeltaTimeX; //  0x65a8 Size(4)
	float HairAnimDynamicsAlpha; //  0x65ac Size(4)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_Slot_3; //  0x368 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x3b0 Size(c8)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x478 Size(18)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x490 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x4a8 Size(48)
	Unknown AnimGraphNode_Slot; //  0x4f0 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x538 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x550 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_BlendListByEnum; //  0x368 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x418 Size(78)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x490 Size(78)
	Unknown AnimGraphNode_SequencePlayer; //  0x508 Size(78)
	Unknown AnimGraphNode_Slot_4; //  0x580 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x5c8 Size(c8)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x690 Size(c0)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x750 Size(18)
	Unknown AnimGraphNode_Slot_3; //  0x768 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x7b0 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x7c8 Size(48)
	Unknown AnimGraphNode_Slot; //  0x810 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x858 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x870 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UAnimInstance {
	Unknown UberGraphFrame; //  0x270 Size(8)
	Unknown AnimGraphNode_Root; //  0x278 Size(30)
	Unknown AnimGraphNode_SequencePlayer; //  0x2a8 Size(78)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_Slot_3; //  0x368 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x3b0 Size(c8)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x478 Size(18)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x490 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x4a8 Size(48)
	Unknown AnimGraphNode_Slot; //  0x4f0 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x538 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x550 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceParachute {
	Unknown UberGraphFrame; //  0x2d0 Size(8)
	Unknown AnimGraphNode_Root; //  0x2d8 Size(30)
	Unknown AnimGraphNode_TransitionResult_5; //  0x308 Size(28)
	Unknown AnimGraphNode_TransitionResult_4; //  0x330 Size(28)
	Unknown AnimGraphNode_TransitionResult_3; //  0x358 Size(28)
	Unknown AnimGraphNode_TransitionResult_2; //  0x380 Size(28)
	Unknown AnimGraphNode_TransitionResult; //  0x3a8 Size(28)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x3d0 Size(78)
	Unknown AnimGraphNode_StateResult_4; //  0x448 Size(30)
	Unknown AnimGraphNode_BlendSpacePlayer; //  0x478 Size(e0)
	Unknown AnimGraphNode_StateResult_3; //  0x558 Size(30)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x588 Size(78)
	Unknown AnimGraphNode_StateResult_2; //  0x600 Size(30)
	Unknown AnimGraphNode_SequencePlayer; //  0x630 Size(78)
	Unknown AnimGraphNode_StateResult; //  0x6a8 Size(30)
	Unknown AnimGraphNode_StateMachine; //  0x6d8 Size(b0)
	Unknown AnimGraphNode_LocalToComponentSpace; //  0x788 Size(20)
	Unknown AnimGraphNode_ComponentToLo; //  0x7a8 Size(20)
	Unknown AnimGraphNode_ModifyBone_2; //  0x7c8 Size(108)
	Unknown AnimGraphNode_ModifyBone; //  0x8d0 Size(108)
	Unknown RightHandleLocation; //  0x9d8 Size(c)
	Unknown LeftHandleLocation; //  0x9e4 Size(c)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UAnimInstance {
	Unknown UberGraphFrame; //  0x270 Size(8)
	Unknown AnimGraphNode_LayeredBoneBlend_8; //  0x278 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_33; //  0x338 Size(78)
	Unknown AnimGraphNode_SequencePlayer_32; //  0x3b0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_31; //  0x428 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_7; //  0x4a0 Size(c0)
	Unknown AnimGraphNode_HandIKRetargeting_2; //  0x560 Size(120)
	Unknown AnimGraphNode_TwoBoneIK_4; //  0x680 Size(1e0)
	Unknown AnimGraphNode_LocalToComponentSpace_3; //  0x860 Size(20)
	Unknown AnimGraphNode_TwoBoneIK_3; //  0x880 Size(1e0)
	Unknown AnimGraphNode_ModifyBone_2; //  0xa60 Size(108)
	Unknown AnimGraphNode_ComponentToLo_3; //  0xb68 Size(20)
	Unknown AnimGraphNode_SaveCachedPose_8; //  0xb88 Size(b8)
	Unknown AnimGraphNode_ApplyAdditive_6; //  0xc40 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_30; //  0xd08 Size(78)
	Unknown AnimGraphNode_SequencePlayer_29; //  0xd80 Size(78)
	Unknown AnimGraphNode_SequencePlayer_28; //  0xdf8 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_6; //  0xe70 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_27; //  0xf30 Size(78)
	Unknown AnimGraphNode_SequencePlayer_26; //  0xfa8 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_5; //  0x1020 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_25; //  0x10e0 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_4; //  0x1158 Size(b0)
	Unknown AnimGraphNode_SaveCachedPose_7; //  0x1208 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_8; //  0x12c0 Size(28)
	Unknown AnimGraphNode_BlendListByBo_8; //  0x12e8 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_24; //  0x1388 Size(78)
	Unknown AnimGraphNode_SaveCachedPose_6; //  0x1400 Size(b8)
	Unknown AnimGraphNode_SequencePlayer_23; //  0x14b8 Size(78)
	Unknown AnimGraphNode_BlendListByBo_7; //  0x1530 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_22; //  0x15d0 Size(78)
	Unknown AnimGraphNode_BlendListByBo_6; //  0x1648 Size(a0)
	Unknown AnimGraphNode_SaveCachedPose_5; //  0x16e8 Size(b8)
	Unknown AnimGraphNode_SequencePlayer_21; //  0x17a0 Size(78)
	Unknown AnimGraphNode_BlendListByBo_5; //  0x1818 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_20; //  0x18b8 Size(78)
	Unknown AnimGraphNode_SaveCachedPose_4; //  0x1930 Size(b8)
	Unknown AnimGraphNode_SequencePlayer_19; //  0x19e8 Size(78)
	Unknown AnimGraphNode_BlendListByBo_4; //  0x1a60 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_18; //  0x1b00 Size(78)
	Unknown AnimGraphNode_BlendListByBo_3; //  0x1b78 Size(a0)
	Unknown AnimGraphNode_UseCachedPose_7; //  0x1c18 Size(28)
	Unknown AnimGraphNode_UseCachedPose_6; //  0x1c40 Size(28)
	Unknown AnimGraphNode_UseCachedPose_5; //  0x1c68 Size(28)
	Unknown AnimGraphNode_HandIKRetargeting; //  0x1c90 Size(120)
	Unknown AnimGraphNode_TwoBoneIK_2; //  0x1db0 Size(1e0)
	Unknown AnimGraphNode_LocalToComponentSpace_2; //  0x1f90 Size(20)
	Unknown AnimGraphNode_TwoBoneIK; //  0x1fb0 Size(1e0)
	Unknown AnimGraphNode_ModifyBone; //  0x2190 Size(108)
	Unknown AnimGraphNode_ComponentToLo_2; //  0x2298 Size(20)
	Unknown AnimGraphNode_SequencePlayer_17; //  0x22b8 Size(78)
	Unknown AnimGraphNode_ApplyAdditive_5; //  0x2330 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_16; //  0x23f8 Size(78)
	Unknown AnimGraphNode_LocalToComponentSpace; //  0x2470 Size(20)
	Unknown AnimGraphNode_AnimDynamics_11; //  0x2490 Size(440)
	Unknown AnimGraphNode_AnimDynamics_10; //  0x28d0 Size(440)
	Unknown AnimGraphNode_ComponentToLo; //  0x2d10 Size(20)
	Unknown AnimGraphNode_AnimDynamics_9; //  0x2d30 Size(440)
	Unknown AnimGraphNode_AnimDynamics_8; //  0x3170 Size(440)
	Unknown AnimGraphNode_AnimDynamics_7; //  0x35b0 Size(440)
	Unknown AnimGraphNode_AnimDynamics_6; //  0x39f0 Size(440)
	Unknown AnimGraphNode_AnimDynamics_5; //  0x3e30 Size(440)
	Unknown AnimGraphNode_AnimDynamics_4; //  0x4270 Size(440)
	Unknown AnimGraphNode_AnimDynamics_3; //  0x46b0 Size(440)
	Unknown AnimGraphNode_AnimDynamics_2; //  0x4af0 Size(440)
	Unknown AnimGraphNode_AnimDynamics; //  0x4f30 Size(440)
	Unknown AnimGraphNode_SequencePlayer_15; //  0x5370 Size(78)
	Unknown AnimGraphNode_BlendListByBo_2; //  0x53e8 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_14; //  0x5488 Size(78)
	Unknown AnimGraphNode_SequencePlayer_13; //  0x5500 Size(78)
	Unknown AnimGraphNode_BlendListByBo; //  0x5578 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_12; //  0x5618 Size(78)
	Unknown AnimGraphNode_KawaiiPhysics_26; //  0x5690 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_25; //  0x58e0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_24; //  0x5b30 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_23; //  0x5d80 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_22; //  0x5fd0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_21; //  0x6220 Size(250)
	Unknown AnimGraphNode_SequencePlayer_11; //  0x6470 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_4; //  0x64e8 Size(c0)
	Unknown AnimGraphNode_BlendListByEnum_3; //  0x65a8 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_10; //  0x6658 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_2; //  0x66d0 Size(b0)
	Unknown AnimGraphNode_LayeredBoneBlend_3; //  0x6780 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_9; //  0x6840 Size(78)
	Unknown AnimGraphNode_ApplyAdditive_4; //  0x68b8 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_8; //  0x6980 Size(78)
	Unknown AnimGraphNode_SequencePlayer_7; //  0x69f8 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_2; //  0x6a70 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_6; //  0x6b30 Size(78)
	Unknown AnimGraphNode_ApplyAdditive_3; //  0x6ba8 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_5; //  0x6c70 Size(78)
	Unknown AnimGraphNode_SequencePlayer_4; //  0x6ce8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x6d60 Size(78)
	Unknown AnimGraphNode_ApplyAdditive_2; //  0x6dd8 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x6ea0 Size(78)
	Unknown AnimGraphNode_BoneDrivenController_8; //  0x6f18 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_7; //  0x7030 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_6; //  0x7148 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_5; //  0x7260 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_4; //  0x7378 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_3; //  0x7490 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_2; //  0x75a8 Size(118)
	Unknown AnimGraphNode_BoneDrivenController; //  0x76c0 Size(118)
	Unknown AnimGraphNode_KawaiiPhysics_20; //  0x77e0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_19; //  0x7a30 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_18; //  0x7c80 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_17; //  0x7ed0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_16; //  0x8120 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_15; //  0x8370 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_14; //  0x85c0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_13; //  0x8810 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_12; //  0x8a60 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_11; //  0x8cb0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_10; //  0x8f00 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_9; //  0x9150 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_8; //  0x93a0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_7; //  0x95f0 Size(250)
	Unknown AnimGraphNode_SequencePlayer; //  0x9840 Size(78)
	Unknown AnimGraphNode_ApplyAdditive; //  0x98b8 Size(c8)
	Unknown AnimGraphNode_UseCachedPose_4; //  0x9980 Size(28)
	Unknown AnimGraphNode_UseCachedPose_3; //  0x99a8 Size(28)
	Unknown AnimGraphNode_UseCachedPose_2; //  0x99d0 Size(28)
	Unknown AnimGraphNode_UseCachedPose; //  0x99f8 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_3; //  0x9a20 Size(b8)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x9ad8 Size(c0)
	Unknown AnimGraphNode_SaveCachedPose_2; //  0x9b98 Size(b8)
	Unknown AnimGraphNode_SaveCachedPose; //  0x9c50 Size(b8)
	Unknown AnimGraphNode_BlendListByEnum; //  0x9d08 Size(b0)
	Unknown AnimGraphNode_Root; //  0x9db8 Size(30)
	Unknown AnimGraphNode_KawaiiPhysics_6; //  0x9df0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_5; //  0xa040 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_4; //  0xa290 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_3; //  0xa4e0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_2; //  0xa730 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics; //  0xa980 Size(250)
	Unknown Character; //  0xabd0 Size(8)
	Unknown WeaponAnimType; //  0xabd8 Size(1)
	Unknown HandAnim; //  0xabe0 Size(8)
	Unknown HandL_Location; //  0xabe8 Size(c)
	Unknown HandL_Rotation; //  0xabf4 Size(c)
	Unknown Recorder; //  0xac00 Size(8)
	Unknown GripType; //  0xac08 Size(1)
	char IsEquippingNormalGrip; //  0xac09 Size(1)
	Unknown UnarmedIdlePose; //  0xac10 Size(8)
	int32_t IdleNum; //  0xac18 Size(4)
	char bIsMale; //  0xac1c Size(1)
	char bIsEquippingGatling; //  0xac1d Size(1)
	char bIsEquippingRPG; //  0xac1e Size(1)
	Unknown InventoryCharacter; //  0xac20 Size(8)
	Unknown AnimDynamicsForce; //  0xac28 Size(c)
	float PrevMeshRotationYaw; //  0xac34 Size(4)
	float BoneDrivenValue; //  0xac38 Size(4)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_Slot_3; //  0x368 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x3b0 Size(c8)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x478 Size(18)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x490 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x4a8 Size(48)
	Unknown AnimGraphNode_Slot; //  0x4f0 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x538 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x550 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_Slot_3; //  0x368 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x3b0 Size(c8)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x478 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x490 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x4d8 Size(18)
	Unknown AnimGraphNode_LocalRefPose; //  0x4f0 Size(18)
	Unknown AnimGraphNode_Slot; //  0x508 Size(48)
	Unknown AnimGraphNode_BlendListByBo; //  0x550 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstancePostprocess {
	Unknown UberGraphFrame; //  0x520 Size(8)
	Unknown AnimGraphNode_BlendListByBo_21; //  0x528 Size(a0)
	Unknown AnimGraphNode_ModifyBone_21; //  0x5c8 Size(108)
	Unknown AnimGraphNode_TwoBoneIK_11; //  0x6d0 Size(1e0)
	Unknown AnimGraphNode_ModifyBone_20; //  0x8b0 Size(108)
	Unknown AnimGraphNode_TwoBoneIK_10; //  0x9c0 Size(1e0)
	Unknown AnimGraphNode_LocalToComponentSpace_20; //  0xba0 Size(20)
	Unknown AnimGraphNode_ModifyBone_19; //  0xbc0 Size(108)
	Unknown AnimGraphNode_ComponentToLo_20; //  0xcc8 Size(20)
	Unknown AnimGraphNode_SaveCachedPose_20; //  0xce8 Size(b8)
	Unknown AnimGraphNode_SaveCachedPose_19; //  0xda0 Size(b8)
	Unknown AnimGraphNode_ModifyBone_18; //  0xe58 Size(108)
	Unknown AnimGraphNode_ComponentToLo_19; //  0xf60 Size(20)
	Unknown AnimGraphNode_BlendListByBoe_20; //  0xf80 Size(a0)
	Unknown AnimGraphNode_SaveCachedPose_18; //  0x1020 Size(b8)
	Unknown AnimGraphNode_LocalToComponentSpace_19; //  0x10d8 Size(20)
	Unknown AnimGraphNode_UseCachedPose_43; //  0x10f8 Size(28)
	Unknown AnimGraphNode_UseCachedPose_42; //  0x1120 Size(28)
	Unknown AnimGraphNode_UseCachedPose_41; //  0x1148 Size(28)
	Unknown AnimGraphNode_BlendListByBo_19; //  0x1170 Size(a0)
	Unknown AnimGraphNode_UseCachedPose_40; //  0x1210 Size(28)
	Unknown AnimGraphNode_LocalToComponentSpace_18; //  0x1238 Size(20)
	Unknown AnimGraphNode_ModifyBone_17; //  0x1258 Size(108)
	Unknown AnimGraphNode_ComponentToLo_18; //  0x1360 Size(20)
	Unknown AnimGraphNode_ModifyBone_16; //  0x1380 Size(108)
	Unknown AnimGraphNode_ModifyBone_15; //  0x1488 Size(108)
	Unknown AnimGraphNode_ModifyBone_14; //  0x1590 Size(108)
	Unknown AnimGraphNode_SaveCachedPose_17; //  0x1698 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_39; //  0x1750 Size(28)
	Unknown AnimGraphNode_LocalToComponentSpace_17; //  0x1778 Size(20)
	Unknown AnimGraphNode_BlendListByBo_18; //  0x1798 Size(a0)
	Unknown AnimGraphNode_BlendListByBoen_17; //  0x1838 Size(a0)
	Unknown AnimGraphNode_UseCachedPose_38; //  0x18d8 Size(28)
	Unknown AnimGraphNode_ModifyBone_13; //  0x1900 Size(108)
	Unknown AnimGraphNode_BlendListByBo_16; //  0x1a08 Size(a0)
	Unknown AnimGraphNode_ComponentToLo_17; //  0x1aa8 Size(20)
	Unknown AnimGraphNode_LocalToComponentSpace_16; //  0x1ac8 Size(20)
	Unknown AnimGraphNode_UseCachedPose_37; //  0x1ae8 Size(28)
	Unknown AnimGraphNode_ModifyBone_12; //  0x1b10 Size(108)
	Unknown AnimGraphNode_ComponentToLo_16; //  0x1c18 Size(20)
	Unknown AnimGraphNode_LocalToComponentSpace_15; //  0x1c38 Size(20)
	Unknown AnimGraphNode_ComponentToLo_15; //  0x1c58 Size(20)
	Unknown AnimGraphNode_UseCachedPose_36; //  0x1c78 Size(28)
	Unknown AnimGraphNode_LocalToComponentSpace_14; //  0x1ca0 Size(20)
	Unknown AnimGraphNode_AnimDynamics_13; //  0x1cc0 Size(440)
	Unknown AnimGraphNode_AnimDynamics_12; //  0x2100 Size(440)
	Unknown AnimGraphNode_SaveCachedPose_16; //  0x2540 Size(b8)
	Unknown AnimGraphNode_ComponentToLo_14; //  0x25f8 Size(20)
	Unknown AnimGraphNode_ModifyBone_11; //  0x2618 Size(108)
	Unknown AnimGraphNode_ModifyBone_10; //  0x2720 Size(108)
	Unknown AnimGraphNode_ModifyBone_9; //  0x2828 Size(108)
	Unknown AnimGraphNode_LocalToComponentSpace_13; //  0x2930 Size(20)
	Unknown AnimGraphNode_SubInput; //  0x2950 Size(78)
	Unknown AnimGraphNode_Root; //  0x29c8 Size(30)
	Unknown AnimGraphNode_UseCachedPose_35; //  0x29f8 Size(28)
	Unknown AnimGraphNode_UseCachedPose_34; //  0x2a20 Size(28)
	Unknown AnimGraphNode_HandIKRetargeting_3; //  0x2a48 Size(120)
	Unknown AnimGraphNode_TwoBoneIK_9; //  0x2b70 Size(1e0)
	Unknown AnimGraphNode_LocalToComponentSpace_12; //  0x2d50 Size(20)
	Unknown AnimGraphNode_ComponentToLo_13; //  0x2d70 Size(20)
	Unknown AnimGraphNode_SaveCachedPose_15; //  0x2d90 Size(b8)
	Unknown AnimGraphNode_BlendListByBo_15; //  0x2e48 Size(a0)
	Unknown AnimGraphNode_SaveCachedPose_14; //  0x2ee8 Size(b8)
	Unknown AnimGraphNode_TwoBoneIK_8; //  0x2fa0 Size(1e0)
	Unknown AnimGraphNode_LocalToComponentSpace_11; //  0x3180 Size(20)
	Unknown AnimGraphNode_ComponentToLo_12; //  0x31a0 Size(20)
	Unknown AnimGraphNode_ModifyBone_8; //  0x31c0 Size(108)
	Unknown AnimGraphNode_ModifyBone_7; //  0x32c8 Size(108)
	Unknown AnimGraphNode_LocalToComponentSpace_10; //  0x33d0 Size(20)
	Unknown AnimGraphNode_TwoBoneIK_7; //  0x33f0 Size(1e0)
	Unknown AnimGraphNode_ComponentToLo_11; //  0x35d0 Size(20)
	Unknown AnimGraphNode_HandIKRetargeting_2; //  0x35f0 Size(120)
	Unknown AnimGraphNode_BlendListByBo_14; //  0x3710 Size(a0)
	Unknown AnimGraphNode_UseCachedPose_33; //  0x37b0 Size(28)
	Unknown AnimGraphNode_UseCachedPose_32; //  0x37d8 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_13; //  0x3800 Size(b8)
	Unknown AnimGraphNode_ModifyBone_6; //  0x38b8 Size(108)
	Unknown AnimGraphNode_UseCachedPose_31; //  0x39c0 Size(28)
	Unknown AnimGraphNode_UseCachedPose_30; //  0x39e8 Size(28)
	Unknown AnimGraphNode_LayeredBoneBlend_2; //  0x3a10 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x3ad0 Size(78)
	Unknown AnimGraphNode_SaveCachedPose_12; //  0x3b48 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_29; //  0x3c00 Size(28)
	Unknown AnimGraphNode_UseCachedPose_28; //  0x3c28 Size(28)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x3c50 Size(c0)
	Unknown AnimGraphNode_SequencePlayer; //  0x3d10 Size(78)
	Unknown AnimGraphNode_BlendListByBo_13; //  0x3d88 Size(a0)
	Unknown AnimGraphNode_SaveCachedPose_11; //  0x3e28 Size(b8)
	Unknown AnimGraphNode_BlendListByEnum; //  0x3ee0 Size(b0)
	Unknown AnimGraphNode_UseCachedPose_27; //  0x3f90 Size(28)
	Unknown AnimGraphNode_UseCachedPose_26; //  0x3fb8 Size(28)
	Unknown AnimGraphNode_UseCachedPose_25; //  0x3fe0 Size(28)
	Unknown AnimGraphNode_UseCachedPose_24; //  0x4008 Size(28)
	Unknown AnimGraphNode_AnimDynamics_11; //  0x4030 Size(440)
	Unknown AnimGraphNode_AnimDynamics_10; //  0x4470 Size(440)
	Unknown AnimGraphNode_AnimDynamics_9; //  0x48b0 Size(440)
	Unknown AnimGraphNode_AnimDynamics_8; //  0x4cf0 Size(440)
	Unknown AnimGraphNode_AnimDynamics_7; //  0x5130 Size(440)
	Unknown AnimGraphNode_AnimDynamics_6; //  0x5570 Size(440)
	Unknown AnimGraphNode_AnimDynamics_5; //  0x59b0 Size(440)
	Unknown AnimGraphNode_ModifyBone_5; //  0x5df0 Size(108)
	Unknown AnimGraphNode_HandIKRetargeting; //  0x5ef8 Size(120)
	Unknown AnimGraphNode_TwoBoneIK_6; //  0x6020 Size(1e0)
	Unknown AnimGraphNode_LocalToComponentSpace_9; //  0x6200 Size(20)
	Unknown AnimGraphNode_ComponentToLo_10; //  0x6220 Size(20)
	Unknown AnimGraphNode_SaveCachedPose_10; //  0x6240 Size(b8)
	Unknown AnimGraphNode_TwoBoneIK_5; //  0x6300 Size(1e0)
	Unknown AnimGraphNode_LocalToComponentSpace_8; //  0x64e0 Size(20)
	Unknown AnimGraphNode_ComponentToLo_9; //  0x6500 Size(20)
	Unknown AnimGraphNode_SaveCachedPose_9; //  0x6520 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_23; //  0x65d8 Size(28)
	Unknown AnimGraphNode_UseCachedPose_22; //  0x6600 Size(28)
	Unknown AnimGraphNode_BlendListByBo_12; //  0x6628 Size(a0)
	Unknown AnimGraphNode_UseCachedPose_21; //  0x66c8 Size(28)
	Unknown AnimGraphNode_BlendListByBo_11; //  0x66f0 Size(a0)
	Unknown AnimGraphNode_UseCachedPose_20; //  0x6790 Size(28)
	Unknown AnimGraphNode_UseCachedPose_19; //  0x67b8 Size(28)
	Unknown AnimGraphNode_LocalToComponentSpace_7; //  0x67e0 Size(20)
	Unknown AnimGraphNode_ComponentToLo_8; //  0x6800 Size(20)
	Unknown AnimGraphNode_SaveCachedPose_8; //  0x6820 Size(b8)
	Unknown AnimGraphNode_TwoBoneIK_4; //  0x68e0 Size(1e0)
	Unknown AnimGraphNode_TwoBoneIK_3; //  0x6ac0 Size(1e0)
	Unknown AnimGraphNode_TwoBoneIK_2; //  0x6ca0 Size(1e0)
	Unknown AnimGraphNode_TwoBoneIK; //  0x6e80 Size(1e0)
	Unknown AnimGraphNode_ModifyBone_4; //  0x7060 Size(108)
	Unknown AnimGraphNode_ModifyBone_3; //  0x7168 Size(108)
	Unknown AnimGraphNode_ModifyBone_2; //  0x7270 Size(108)
	Unknown AnimGraphNode_ModifyBone; //  0x7378 Size(108)
	Unknown AnimGraphNode_AnimDynamics_4; //  0x7480 Size(440)
	Unknown AnimGraphNode_AnimDynamics_3; //  0x78c0 Size(440)
	Unknown AnimGraphNode_KawaiiPhysics_26; //  0x7d00 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_25; //  0x7f50 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_24; //  0x81a0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_23; //  0x83f0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_22; //  0x8640 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_21; //  0x8890 Size(250)
	Unknown AnimGraphNode_BoneDrivenController_20; //  0x8ae0 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_19; //  0x8bf8 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_18; //  0x8d10 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_17; //  0x8e28 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_16; //  0x8f40 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_15; //  0x9058 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_14; //  0x9170 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_13; //  0x9288 Size(118)
	Unknown AnimGraphNode_KawaiiPhysics_20; //  0x93a0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_19; //  0x95f0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_18; //  0x9840 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_17; //  0x9a90 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_16; //  0x9ce0 Size(250)
	Unknown AnimGraphNode_BoneDrivenController_12; //  0x9f30 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_11; //  0xa048 Size(118)
	Unknown AnimGraphNode_KawaiiPhysics_15; //  0xa160 Size(250)
	Unknown AnimGraphNode_BoneDrivenController_10; //  0xa3b0 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_9; //  0xa4c8 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_8; //  0xa5e0 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_7; //  0xa6f8 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_6; //  0xa810 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_5; //  0xa928 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_4; //  0xaa40 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_3; //  0xab58 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_2; //  0xac70 Size(118)
	Unknown AnimGraphNode_BoneDrivenController; //  0xad88 Size(118)
	Unknown AnimGraphNode_KawaiiPhysics_14; //  0xaea0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_13; //  0xb0f0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_12; //  0xb340 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_11; //  0xb590 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_10; //  0xb7e0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_9; //  0xba30 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_8; //  0xbc80 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_7; //  0xbed0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_6; //  0xc120 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_5; //  0xc370 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_4; //  0xc5c0 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_3; //  0xc810 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics_2; //  0xca60 Size(250)
	Unknown AnimGraphNode_KawaiiPhysics; //  0xccb0 Size(250)
	Unknown AnimGraphNode_AnimDynamics_2; //  0xcf00 Size(440)
	Unknown AnimGraphNode_AnimDynamics; //  0xd340 Size(440)
	Unknown AnimGraphNode_BlendListByBo_10; //  0xd780 Size(a0)
	Unknown AnimGraphNode_UseCachedPose_18; //  0xd820 Size(28)
	Unknown AnimGraphNode_BlendListByBo_9; //  0xd848 Size(a0)
	Unknown AnimGraphNode_UseCachedPose_17; //  0xd8e8 Size(28)
	Unknown AnimGraphNode_UseCachedPose_16; //  0xd910 Size(28)
	Unknown AnimGraphNode_BlendListByBo_8; //  0xd938 Size(a0)
	Unknown AnimGraphNode_ComponentToLo_7; //  0xd9d8 Size(20)
	Unknown AnimGraphNode_UseCachedPose_15; //  0xd9f8 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_7; //  0xda20 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_14; //  0xdad8 Size(28)
	Unknown AnimGraphNode_LocalToComponentSpace_6; //  0xdb00 Size(20)
	Unknown AnimGraphNode_BlendListByBo_7; //  0xdb20 Size(a0)
	Unknown AnimGraphNode_ComponentToLoen_6; //  0xdbc0 Size(20)
	Unknown AnimGraphNode_UseCachedPose_13; //  0xdbe0 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_6; //  0xdc08 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_12; //  0xdcc0 Size(28)
	Unknown AnimGraphNode_LocalToComponentSpace_5; //  0xdce8 Size(20)
	Unknown AnimGraphNode_BlendListByBo_6; //  0xdd08 Size(a0)
	Unknown AnimGraphNode_ComponentToLoen_5; //  0xdda8 Size(20)
	Unknown AnimGraphNode_UseCachedPose_11; //  0xddc8 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_5; //  0xddf0 Size(b8)
	Unknown AnimGraphNode_BlendListByBo_5; //  0xdea8 Size(a0)
	Unknown AnimGraphNode_UseCachedPose_10; //  0xdf48 Size(28)
	Unknown AnimGraphNode_UseCachedPose_9; //  0xdf70 Size(28)
	Unknown AnimGraphNode_LocalToComponentSpace_4; //  0xdf98 Size(20)
	Unknown AnimGraphNode_BlendListByBo_4; //  0xdfb8 Size(a0)
	Unknown AnimGraphNode_ComponentToLoen_4; //  0xe058 Size(20)
	Unknown AnimGraphNode_UseCachedPose_8; //  0xe078 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_4; //  0xe0a0 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_7; //  0xe158 Size(28)
	Unknown AnimGraphNode_UseCachedPose_6; //  0xe180 Size(28)
	Unknown AnimGraphNode_BlendListByBo_3; //  0xe1a8 Size(a0)
	Unknown AnimGraphNode_SaveCachedPose_3; //  0xe248 Size(b8)
	Unknown AnimGraphNode_LocalToComponentSpace_3; //  0xe300 Size(20)
	Unknown AnimGraphNode_ComponentToLo_3; //  0xe320 Size(20)
	Unknown AnimGraphNode_BlendListByBoen_2; //  0xe340 Size(a0)
	Unknown AnimGraphNode_UseCachedPose_5; //  0xe3e0 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_2; //  0xe408 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_4; //  0xe4c0 Size(28)
	Unknown AnimGraphNode_LocalToComponentSpace_2; //  0xe4e8 Size(20)
	Unknown AnimGraphNode_ComponentToLo_2; //  0xe508 Size(20)
	Unknown AnimGraphNode_BlendListByBoen; //  0xe528 Size(a0)
	Unknown AnimGraphNode_SaveCachedPose; //  0xe5c8 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_3; //  0xe680 Size(28)
	Unknown AnimGraphNode_UseCachedPose_2; //  0xe6a8 Size(28)
	Unknown AnimGraphNode_LocalToComponentSpace; //  0xe6d0 Size(20)
	Unknown AnimGraphNode_ComponentToLo; //  0xe6f0 Size(20)
	Unknown AnimGraphNode_UseCachedPose; //  0xe710 Size(28)

	void AnimGraph(Unknown InPose, Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_Slot_3; //  0x368 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x3b0 Size(c8)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x478 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x490 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x4d8 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x4f0 Size(a0)
	Unknown AnimGraphNode_Slot; //  0x590 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x5d8 Size(18)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstance {
	Unknown UberGraphFrame; //  0xc60 Size(8)
	Unknown AnimGraphNode_Root; //  0xc68 Size(30)
	Unknown AnimGraphNode_TransitionResult_119; //  0xc98 Size(28)
	Unknown AnimGraphNode_TransitionResult_118; //  0xcc0 Size(28)
	Unknown AnimGraphNode_TransitionResult_117; //  0xce8 Size(28)
	Unknown AnimGraphNode_TransitionResult_116; //  0xd10 Size(28)
	Unknown AnimGraphNode_TransitionResult_115; //  0xd38 Size(28)
	Unknown AnimGraphNode_TransitionResult_114; //  0xd60 Size(28)
	Unknown AnimGraphNode_TransitionResult_113; //  0xd88 Size(28)
	Unknown AnimGraphNode_TransitionResult_112; //  0xdb0 Size(28)
	Unknown AnimGraphNode_TransitionResult_111; //  0xdd8 Size(28)
	Unknown AnimGraphNode_TransitionResult_110; //  0xe00 Size(28)
	Unknown AnimGraphNode_TransitionResult_109; //  0xe28 Size(28)
	Unknown AnimGraphNode_TransitionResult_108; //  0xe50 Size(28)
	Unknown AnimGraphNode_TransitionResult_107; //  0xe78 Size(28)
	Unknown AnimGraphNode_TransitionResult_106; //  0xea0 Size(28)
	Unknown AnimGraphNode_TransitionResult_105; //  0xec8 Size(28)
	Unknown AnimGraphNode_TransitionResult_104; //  0xef0 Size(28)
	Unknown AnimGraphNode_TransitionResult_103; //  0xf18 Size(28)
	Unknown AnimGraphNode_TransitionResult_102; //  0xf40 Size(28)
	Unknown AnimGraphNode_TransitionResult_101; //  0xf68 Size(28)
	Unknown AnimGraphNode_TransitionResult_100; //  0xf90 Size(28)
	Unknown AnimGraphNode_TransitionResult_99; //  0xfb8 Size(28)
	Unknown AnimGraphNode_TransitionResult_98; //  0xfe0 Size(28)
	Unknown AnimGraphNode_TransitionResult_97; //  0x1008 Size(28)
	Unknown AnimGraphNode_TransitionResult_96; //  0x1030 Size(28)
	Unknown AnimGraphNode_TransitionResult_95; //  0x1058 Size(28)
	Unknown AnimGraphNode_TransitionResult_94; //  0x1080 Size(28)
	Unknown AnimGraphNode_TransitionResult_93; //  0x10a8 Size(28)
	Unknown AnimGraphNode_TransitionResult_92; //  0x10d0 Size(28)
	Unknown AnimGraphNode_TransitionResult_91; //  0x10f8 Size(28)
	Unknown AnimGraphNode_TransitionResult_90; //  0x1120 Size(28)
	Unknown AnimGraphNode_TransitionResult_89; //  0x1148 Size(28)
	Unknown AnimGraphNode_TransitionResult_88; //  0x1170 Size(28)
	Unknown AnimGraphNode_TransitionResult_87; //  0x1198 Size(28)
	Unknown AnimGraphNode_TransitionResult_86; //  0x11c0 Size(28)
	Unknown AnimGraphNode_TransitionResult_85; //  0x11e8 Size(28)
	Unknown AnimGraphNode_TransitionResult_84; //  0x1210 Size(28)
	Unknown AnimGraphNode_TransitionResult_83; //  0x1238 Size(28)
	Unknown AnimGraphNode_TransitionResult_82; //  0x1260 Size(28)
	Unknown AnimGraphNode_SequencePlayer_345; //  0x1288 Size(78)
	Unknown AnimGraphNode_StateResult_61; //  0x1300 Size(30)
	Unknown AnimGraphNode_TransitionResult_81; //  0x1330 Size(28)
	Unknown AnimGraphNode_SequencePlayer_344; //  0x1358 Size(78)
	Unknown AnimGraphNode_StateResult_60; //  0x13d0 Size(30)
	Unknown AnimGraphNode_SequencePlayer_343; //  0x1400 Size(78)
	Unknown AnimGraphNode_StateResult_59; //  0x1478 Size(30)
	Unknown AnimGraphNode_StateMachine_19; //  0x14a8 Size(b0)
	Unknown AnimGraphNode_StateResult_58; //  0x1558 Size(30)
	Unknown AnimGraphNode_TransitionResult_80; //  0x1588 Size(28)
	Unknown AnimGraphNode_TransitionResult_79; //  0x15b0 Size(28)
	Unknown AnimGraphNode_TransitionResult_78; //  0x15d8 Size(28)
	Unknown AnimGraphNode_TransitionResult_77; //  0x1600 Size(28)
	Unknown AnimGraphNode_SequencePlayer_342; //  0x1628 Size(78)
	Unknown AnimGraphNode_StateResult_57; //  0x16a0 Size(30)
	Unknown AnimGraphNode_BlendSpacePlayer_116; //  0x16d0 Size(e0)
	Unknown AnimGraphNode_StateResult_56; //  0x17b0 Size(30)
	Unknown AnimGraphNode_SequencePlayer_341; //  0x17e0 Size(78)
	Unknown AnimGraphNode_StateResult_55; //  0x1858 Size(30)
	Unknown AnimGraphNode_StateMachine_18; //  0x1888 Size(b0)
	Unknown AnimGraphNode_StateResult_54; //  0x1938 Size(30)
	Unknown AnimGraphNode_TransitionResult_76; //  0x1968 Size(28)
	Unknown AnimGraphNode_TransitionResult_75; //  0x1990 Size(28)
	Unknown AnimGraphNode_SequencePlayer_340; //  0x19b8 Size(78)
	Unknown AnimGraphNode_BlendListByBo_83; //  0x1a30 Size(a0)
	Unknown AnimGraphNode_BlendListByEnum_69; //  0x1ad0 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_115; //  0x1b80 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_114; //  0x1c60 Size(e0)
	Unknown AnimGraphNode_LayeredBoneBlend_97; //  0x1d40 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_339; //  0x1e00 Size(78)
	Unknown AnimGraphNode_StateResult_53; //  0x1e78 Size(30)
	Unknown AnimGraphNode_SequencePlayer_338; //  0x1ea8 Size(78)
	Unknown AnimGraphNode_BlendListByBo_82; //  0x1f20 Size(a0)
	Unknown AnimGraphNode_BlendListByEnum_68; //  0x1fc0 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_113; //  0x2070 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_112; //  0x2150 Size(e0)
	Unknown AnimGraphNode_LayeredBoneBlend_96; //  0x2230 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_337; //  0x22f0 Size(78)
	Unknown AnimGraphNode_StateResult_52; //  0x2368 Size(30)
	Unknown AnimGraphNode_SequencePlayer_336; //  0x2398 Size(78)
	Unknown AnimGraphNode_BlendListByBo_81; //  0x2410 Size(a0)
	Unknown AnimGraphNode_BlendListByEnum_67; //  0x24b0 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_111; //  0x2560 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_110; //  0x2640 Size(e0)
	Unknown AnimGraphNode_LayeredBoneBlend_95; //  0x2720 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_335; //  0x27e0 Size(78)
	Unknown AnimGraphNode_StateResult_51; //  0x2858 Size(30)
	Unknown AnimGraphNode_StateMachine_17; //  0x2888 Size(b0)
	Unknown AnimGraphNode_StateResult_50; //  0x2938 Size(30)
	Unknown AnimGraphNode_TransitionResult_74; //  0x2968 Size(28)
	Unknown AnimGraphNode_TransitionResult_73; //  0x2990 Size(28)
	Unknown AnimGraphNode_TransitionResult_72; //  0x29b8 Size(28)
	Unknown AnimGraphNode_TransitionResult_71; //  0x29e0 Size(28)
	Unknown AnimGraphNode_TransitionResult_70; //  0x2a08 Size(28)
	Unknown AnimGraphNode_TransitionResult_69; //  0x2a30 Size(28)
	Unknown AnimGraphNode_TransitionResult_68; //  0x2a58 Size(28)
	Unknown AnimGraphNode_TransitionResult_67; //  0x2a80 Size(28)
	Unknown AnimGraphNode_TransitionResult_66; //  0x2aa8 Size(28)
	Unknown AnimGraphNode_BlendListByBo_80; //  0x2ad0 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_334; //  0x2b70 Size(78)
	Unknown AnimGraphNode_BlendListByBo_79; //  0x2be8 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_333; //  0x2c88 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_94; //  0x2d00 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_332; //  0x2dc0 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_66; //  0x2e38 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_331; //  0x2ee8 Size(78)
	Unknown AnimGraphNode_StateResult_49; //  0x2f60 Size(30)
	Unknown AnimGraphNode_BlendListByBo_78; //  0x2f90 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_330; //  0x3030 Size(78)
	Unknown AnimGraphNode_SequencePlayer_329; //  0x30a8 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_93; //  0x3120 Size(c0)
	Unknown AnimGraphNode_BlendListByBo_77; //  0x31e0 Size(a0)
	Unknown AnimGraphNode_BlendListByBoen_76; //  0x3280 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_328; //  0x3320 Size(78)
	Unknown AnimGraphNode_SequencePlayer_327; //  0x3398 Size(78)
	Unknown AnimGraphNode_SequencePlayer_326; //  0x3410 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_65; //  0x3488 Size(b0)
	Unknown AnimGraphNode_StateResult_48; //  0x3538 Size(30)
	Unknown AnimGraphNode_BlendSpacePlayer_109; //  0x3568 Size(e0)
	Unknown AnimGraphNode_TransitionResult_65; //  0x3648 Size(28)
	Unknown AnimGraphNode_TransitionResult_64; //  0x3670 Size(28)
	Unknown AnimGraphNode_TransitionResult_63; //  0x3698 Size(28)
	Unknown AnimGraphNode_TransitionResult_62; //  0x36c0 Size(28)
	Unknown AnimGraphNode_TransitionResult_61; //  0x36e8 Size(28)
	Unknown AnimGraphNode_TransitionResult_60; //  0x3710 Size(28)
	Unknown AnimGraphNode_SequencePlayer_325; //  0x3738 Size(78)
	Unknown AnimGraphNode_TwoWayBlend_24; //  0x37b0 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_324; //  0x3878 Size(78)
	Unknown AnimGraphNode_StateResult_47; //  0x38f0 Size(30)
	Unknown AnimGraphNode_TwoWayBlend_23; //  0x3920 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_323; //  0x39e8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_322; //  0x3a60 Size(78)
	Unknown AnimGraphNode_StateResult_46; //  0x3ad8 Size(30)
	Unknown AnimGraphNode_SequencePlayer_321; //  0x3b08 Size(78)
	Unknown AnimGraphNode_StateResult_45; //  0x3b80 Size(30)
	Unknown AnimGraphNode_StateMachine_16; //  0x3bb0 Size(b0)
	Unknown AnimGraphNode_BlendListByBo_75; //  0x3c60 Size(a0)
	Unknown AnimGraphNode_StateResult_44; //  0x3d00 Size(30)
	Unknown AnimGraphNode_SequencePlayer_320; //  0x3d30 Size(78)
	Unknown AnimGraphNode_StateResult_43; //  0x3da8 Size(30)
	Unknown AnimGraphNode_StateMachine_15; //  0x3dd8 Size(b0)
	Unknown AnimGraphNode_StateResult_42; //  0x3e88 Size(30)
	Unknown AnimGraphNode_SequencePlayer_319; //  0x3eb8 Size(78)
	Unknown AnimGraphNode_StateResult_41; //  0x3f30 Size(30)
	Unknown AnimGraphNode_SequencePlayer_318; //  0x3f60 Size(78)
	Unknown AnimGraphNode_BlendListByBo_74; //  0x3fd8 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_108; //  0x4078 Size(e0)
	Unknown AnimGraphNode_StateResult_40; //  0x4158 Size(30)
	Unknown AnimGraphNode_TransitionResult_59; //  0x4188 Size(28)
	Unknown AnimGraphNode_ApplyAdditive_17; //  0x41b0 Size(c8)
	Unknown AnimGraphNode_BlendSpacePlayer_107; //  0x4278 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_106; //  0x4358 Size(e0)
	Unknown AnimGraphNode_BlendListByBo_73; //  0x4438 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_105; //  0x44d8 Size(e0)
	Unknown AnimGraphNode_StateResult_39; //  0x45b8 Size(30)
	Unknown AnimGraphNode_TransitionResult_58; //  0x45e8 Size(28)
	Unknown AnimGraphNode_TransitionResult_57; //  0x4610 Size(28)
	Unknown AnimGraphNode_TransitionResult_56; //  0x4638 Size(28)
	Unknown AnimGraphNode_TransitionResult_55; //  0x4660 Size(28)
	Unknown AnimGraphNode_BlendSpacePlayer_104; //  0x4688 Size(e0)
	Unknown AnimGraphNode_StateResult_38; //  0x4768 Size(30)
	Unknown AnimGraphNode_BlendSpacePlayer_103; //  0x4798 Size(e0)
	Unknown AnimGraphNode_StateResult_37; //  0x4878 Size(30)
	Unknown AnimGraphNode_StateMachine_14; //  0x48a8 Size(b0)
	Unknown AnimGraphNode_StateResult_36; //  0x4958 Size(30)
	Unknown AnimGraphNode_TransitionResult_54; //  0x4988 Size(28)
	Unknown AnimGraphNode_TransitionResult_53; //  0x49b0 Size(28)
	Unknown AnimGraphNode_SequencePlayer_317; //  0x49d8 Size(78)
	Unknown AnimGraphNode_StateResult_35; //  0x4a50 Size(30)
	Unknown AnimGraphNode_SequencePlayer_316; //  0x4a80 Size(78)
	Unknown AnimGraphNode_StateResult_34; //  0x4af8 Size(30)
	Unknown AnimGraphNode_StateMachine_13; //  0x4b28 Size(b0)
	Unknown AnimGraphNode_StateResult_33; //  0x4bd8 Size(30)
	Unknown AnimGraphNode_StateMachine_12; //  0x4c08 Size(b0)
	Unknown AnimGraphNode_StateResult_32; //  0x4cb8 Size(30)
	Unknown AnimGraphNode_SequencePlayer_315; //  0x4ce8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_314; //  0x4d60 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_92; //  0x4dd8 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_313; //  0x4e98 Size(78)
	Unknown AnimGraphNode_SequencePlayer_312; //  0x4f10 Size(78)
	Unknown AnimGraphNode_SequencePlayer_311; //  0x4f88 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_64; //  0x5000 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_310; //  0x50b0 Size(78)
	Unknown AnimGraphNode_StateResult_31; //  0x5128 Size(30)
	Unknown AnimGraphNode_SequencePlayer_309; //  0x5158 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_91; //  0x51d0 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_308; //  0x5290 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_90; //  0x5308 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_307; //  0x53c8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_306; //  0x5440 Size(78)
	Unknown AnimGraphNode_SequencePlayer_305; //  0x54b8 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_89; //  0x5530 Size(c0)
	Unknown AnimGraphNode_SequenceEvaluator_6; //  0x55f0 Size(48)
	Unknown AnimGraphNode_SequencePlayer_304; //  0x5638 Size(78)
	Unknown AnimGraphNode_SequencePlayer_303; //  0x56b0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_302; //  0x5728 Size(78)
	Unknown AnimGraphNode_SequencePlayer_301; //  0x57a0 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_63; //  0x5818 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_300; //  0x58c8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_299; //  0x5940 Size(78)
	Unknown AnimGraphNode_SequencePlayer_298; //  0x59b8 Size(78)
	Unknown AnimGraphNode_BlendListByBo_72; //  0x5a30 Size(a0)
	Unknown AnimGraphNode_SequenceEvaluator_5; //  0x5ad0 Size(48)
	Unknown AnimGraphNode_BlendListByBo_71; //  0x5b18 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_297; //  0x5bb8 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_88; //  0x5c30 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_296; //  0x5cf0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_295; //  0x5d68 Size(78)
	Unknown AnimGraphNode_SequencePlayer_294; //  0x5de0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_293; //  0x5e58 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_87; //  0x5ed0 Size(c0)
	Unknown AnimGraphNode_BlendListByBo_70; //  0x5f90 Size(a0)
	Unknown AnimGraphNode_SequenceEvaluator_4; //  0x6030 Size(48)
	Unknown AnimGraphNode_SequenceEvaluator_3; //  0x6078 Size(48)
	Unknown AnimGraphNode_SequenceEvaluator_2; //  0x60c0 Size(48)
	Unknown AnimGraphNode_BlendListByEnum_62; //  0x6108 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_292; //  0x61b8 Size(78)
	Unknown AnimGraphNode_Slot_34; //  0x6230 Size(48)
	Unknown AnimGraphNode_SequencePlayer_291; //  0x6278 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_86; //  0x62f0 Size(c0)
	Unknown AnimGraphNode_BlendListByBo_69; //  0x63b0 Size(a0)
	Unknown AnimGraphNode_BlendListByEnum_61; //  0x6450 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_290; //  0x6500 Size(78)
	Unknown AnimGraphNode_BlendListByBo_68; //  0x6578 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_102; //  0x6618 Size(e0)
	Unknown AnimGraphNode_ApplyAdditive_16; //  0x66f8 Size(c8)
	Unknown AnimGraphNode_StateResult_30; //  0x67c0 Size(30)
	Unknown AnimGraphNode_TransitionResult_52; //  0x67f0 Size(28)
	Unknown AnimGraphNode_BlendListByEnum_60; //  0x6818 Size(b0)
	Unknown AnimGraphNode_BlendListByEnum_59; //  0x68c8 Size(b0)
	Unknown AnimGraphNode_UseCachedPose_60; //  0x6978 Size(28)
	Unknown AnimGraphNode_LocalRefPose; //  0x69a0 Size(18)
	Unknown AnimGraphNode_Slot_33; //  0x69b8 Size(48)
	Unknown AnimGraphNode_LayeredBoneBlend_85; //  0x6a00 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_289; //  0x6ac0 Size(78)
	Unknown AnimGraphNode_BlendListByBo_67; //  0x6b38 Size(a0)
	Unknown AnimGraphNode_TwoWayBlend_22; //  0x6bd8 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_288; //  0x6ca0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_287; //  0x6d18 Size(78)
	Unknown AnimGraphNode_SequencePlayer_286; //  0x6d90 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_84; //  0x6e08 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_285; //  0x6ec8 Size(78)
	Unknown AnimGraphNode_StateResult_29; //  0x6f40 Size(30)
	Unknown AnimGraphNode_StateMachine_11; //  0x6f70 Size(b0)
	Unknown AnimGraphNode_SaveCachedPose_26; //  0x7020 Size(b8)
	Unknown AnimGraphNode_LayeredBoneBlend_83; //  0x70d8 Size(c0)
	Unknown AnimGraphNode_RotationOffsetBlendSpace_9; //  0x7198 Size(188)
	Unknown AnimGraphNode_BlendListByBo_66; //  0x7320 Size(a0)
	Unknown AnimGraphNode_RotationOffsetBlendSpace_8; //  0x73c0 Size(188)
	Unknown AnimGraphNode_ComponentToLo_7; //  0x7548 Size(20)
	Unknown AnimGraphNode_LocalToComponentSpace_7; //  0x7568 Size(20)
	Unknown AnimGraphNode_ModifyBone_3; //  0x7588 Size(108)
	Unknown AnimGraphNode_RotationOffsetBlendSpace_7; //  0x7690 Size(188)
	Unknown AnimGraphNode_BlendListByEnum_58; //  0x7818 Size(b0)
	Unknown AnimGraphNode_BlendListByBo_65; //  0x78c8 Size(a0)
	Unknown AnimGraphNode_Slot_32; //  0x7968 Size(48)
	Unknown AnimGraphNode_BlendListByBoum_64; //  0x79b0 Size(a0)
	Unknown AnimGraphNode_SaveCachedPose_25; //  0x7a50 Size(b8)
	Unknown AnimGraphNode_Slot_31; //  0x7b08 Size(48)
	Unknown AnimGraphNode_SaveCachedPose_24; //  0x7b50 Size(b8)
	Unknown AnimGraphNode_SaveCachedPose_23; //  0x7c08 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_59; //  0x7cc0 Size(28)
	Unknown AnimGraphNode_UseCachedPose_58; //  0x7ce8 Size(28)
	Unknown AnimGraphNode_UseCachedPose_57; //  0x7d10 Size(28)
	Unknown AnimGraphNode_UseCachedPose_56; //  0x7d38 Size(28)
	Unknown AnimGraphNode_LayeredBoneBlend_82; //  0x7d60 Size(c0)
	Unknown AnimGraphNode_UseCachedPose_55; //  0x7e20 Size(28)
	Unknown AnimGraphNode_BlendListByBo_63; //  0x7e48 Size(a0)
	Unknown AnimGraphNode_Slot_30; //  0x7ee8 Size(48)
	Unknown AnimGraphNode_UseCachedPose_54; //  0x7f30 Size(28)
	Unknown AnimGraphNode_UseCachedPose_53; //  0x7f58 Size(28)
	Unknown AnimGraphNode_RotationOffsetBlendSpace_6; //  0x7f80 Size(188)
	Unknown AnimGraphNode_UseCachedPose_52; //  0x8108 Size(28)
	Unknown AnimGraphNode_BlendListByBo_62; //  0x8130 Size(a0)
	Unknown AnimGraphNode_BlendListByBo_61; //  0x81d0 Size(a0)
	Unknown AnimGraphNode_LayeredBoneBlend_81; //  0x8270 Size(c0)
	Unknown AnimGraphNode_UseCachedPose_51; //  0x8330 Size(28)
	Unknown AnimGraphNode_RotationOffsetBlendSpace_5; //  0x8358 Size(188)
	Unknown AnimGraphNode_UseCachedPose_50; //  0x84e0 Size(28)
	Unknown AnimGraphNode_RotationOffsetBlendSpace_4; //  0x8508 Size(188)
	Unknown AnimGraphNode_BlendListByBo_60; //  0x8690 Size(a0)
	Unknown AnimGraphNode_Slot_29; //  0x8730 Size(48)
	Unknown AnimGraphNode_LayeredBoneBlend_80; //  0x8778 Size(c0)
	Unknown AnimGraphNode_Slot_28; //  0x8838 Size(48)
	Unknown AnimGraphNode_BlendListByBo_59; //  0x8880 Size(a0)
	Unknown AnimGraphNode_Slot_27; //  0x8920 Size(48)
	Unknown AnimGraphNode_LayeredBoneBlend_79; //  0x8968 Size(c0)
	Unknown AnimGraphNode_Slot_26; //  0x8a28 Size(48)
	Unknown AnimGraphNode_Slot_25; //  0x8a70 Size(48)
	Unknown AnimGraphNode_UseCachedPose_49; //  0x8ab8 Size(28)
	Unknown AnimGraphNode_ApplyAdditive_15; //  0x8ae0 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_284; //  0x8ba8 Size(78)
	Unknown AnimGraphNode_Slot_24; //  0x8c20 Size(48)
	Unknown AnimGraphNode_ApplyAdditive_14; //  0x8c68 Size(c8)
	Unknown AnimGraphNode_RotationOffsetBlendSpace_3; //  0x8d30 Size(188)
	Unknown AnimGraphNode_BlendListByBo_58; //  0x8eb8 Size(a0)
	Unknown AnimGraphNode_RotationOffsetBlendSpace_2; //  0x8f58 Size(188)
	Unknown AnimGraphNode_UseCachedPose_48; //  0x90e0 Size(28)
	Unknown AnimGraphNode_LayeredBoneBlend_78; //  0x9108 Size(c0)
	Unknown AnimGraphNode_LayeredBoneBlend_77; //  0x91c8 Size(c0)
	Unknown AnimGraphNode_SaveCachedPose_22; //  0x9288 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_47; //  0x9340 Size(28)
	Unknown AnimGraphNode_UseCachedPose_46; //  0x9368 Size(28)
	Unknown AnimGraphNode_UseCachedPose_45; //  0x9390 Size(28)
	Unknown AnimGraphNode_BlendListByBo_57; //  0x93b8 Size(a0)
	Unknown AnimGraphNode_Slot_23; //  0x9458 Size(48)
	Unknown AnimGraphNode_BlendSpacePlayer_101; //  0x94a0 Size(e0)
	Unknown AnimGraphNode_SequenceEvaluator; //  0x9580 Size(48)
	Unknown AnimGraphNode_LocalToComponentSpace_6; //  0x95c8 Size(20)
	Unknown AnimGraphNode_ModifyBone_2; //  0x95e8 Size(108)
	Unknown AnimGraphNode_ComponentToLo_6; //  0x96f0 Size(20)
	Unknown AnimGraphNode_BlendListByBoen_56; //  0x9710 Size(a0)
	Unknown AnimGraphNode_IdentityPose_7; //  0x97b0 Size(18)
	Unknown AnimGraphNode_LayeredBoneBlend_76; //  0x97c8 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_283; //  0x9888 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_75; //  0x9900 Size(c0)
	Unknown AnimGraphNode_IdentityPose_6; //  0x99c0 Size(18)
	Unknown AnimGraphNode_SequencePlayer_282; //  0x99d8 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_74; //  0x9a50 Size(c0)
	Unknown AnimGraphNode_IdentityPose_5; //  0x9b10 Size(18)
	Unknown AnimGraphNode_BlendListByEnum_57; //  0x9b28 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_281; //  0x9bd8 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_73; //  0x9c50 Size(c0)
	Unknown AnimGraphNode_IdentityPose_4; //  0x9d10 Size(18)
	Unknown AnimGraphNode_StateResult_28; //  0x9d28 Size(30)
	Unknown AnimGraphNode_StateMachine_10; //  0x9d58 Size(b0)
	Unknown AnimGraphNode_SaveCachedPose_21; //  0x9e08 Size(b8)
	Unknown AnimGraphNode_ApplyAdditive_13; //  0x9ec0 Size(c8)
	Unknown AnimGraphNode_UseCachedPose_44; //  0x9f88 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_20; //  0x9fb0 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_43; //  0xa068 Size(28)
	Unknown AnimGraphNode_BlendListByBo_55; //  0xa090 Size(a0)
	Unknown AnimGraphNode_Slot_22; //  0xa130 Size(48)
	Unknown AnimGraphNode_SequencePlayer_280; //  0xa178 Size(78)
	Unknown AnimGraphNode_BlendListByBo_54; //  0xa1f0 Size(a0)
	Unknown AnimGraphNode_BlendListByBor_53; //  0xa290 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_279; //  0xa330 Size(78)
	Unknown AnimGraphNode_LocalToComponentSpace_5; //  0xa3a8 Size(20)
	Unknown AnimGraphNode_ModifyBone; //  0xa3c8 Size(108)
	Unknown AnimGraphNode_ComponentToLo_5; //  0xa4d0 Size(20)
	Unknown AnimGraphNode_BlendListByBoen_52; //  0xa4f0 Size(a0)
	Unknown AnimGraphNode_Slot_21; //  0xa590 Size(48)
	Unknown AnimGraphNode_Slot_20; //  0xa5d8 Size(48)
	Unknown AnimGraphNode_Slot_19; //  0xa620 Size(48)
	Unknown AnimGraphNode_IdentityPose_3; //  0xa668 Size(18)
	Unknown AnimGraphNode_SequencePlayer_278; //  0xa680 Size(78)
	Unknown AnimGraphNode_BlendListByBo_51; //  0xa6f8 Size(a0)
	Unknown AnimGraphNode_BlendListByBor_50; //  0xa798 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_277; //  0xa838 Size(78)
	Unknown AnimGraphNode_StateResult_27; //  0xa8b0 Size(30)
	Unknown AnimGraphNode_StateMachine_9; //  0xa8e0 Size(b0)
	Unknown AnimGraphNode_SaveCachedPose_19; //  0xa990 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_42; //  0xaa48 Size(28)
	Unknown AnimGraphNode_UseCachedPose_41; //  0xaa70 Size(28)
	Unknown AnimGraphNode_BlendListByBo_49; //  0xaa98 Size(a0)
	Unknown AnimGraphNode_TwoWayBlend_21; //  0xab38 Size(c8)
	Unknown AnimGraphNode_Slot_18; //  0xac00 Size(48)
	Unknown AnimGraphNode_BlendListByBo_48; //  0xac48 Size(a0)
	Unknown AnimGraphNode_Slot_17; //  0xace8 Size(48)
	Unknown AnimGraphNode_LayeredBoneBlend_72; //  0xad30 Size(c0)
	Unknown AnimGraphNode_UseCachedPose_40; //  0xadf0 Size(28)
	Unknown AnimGraphNode_UseCachedPose_39; //  0xae18 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_18; //  0xae40 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_38; //  0xaef8 Size(28)
	Unknown AnimGraphNode_UseCachedPose_37; //  0xaf20 Size(28)
	Unknown AnimGraphNode_Slot_16; //  0xaf48 Size(48)
	Unknown AnimGraphNode_LayeredBoneBlend_71; //  0xaf90 Size(c0)
	Unknown AnimGraphNode_Slot_15; //  0xb050 Size(48)
	Unknown AnimGraphNode_UseCachedPose_36; //  0xb098 Size(28)
	Unknown AnimGraphNode_SequencePlayer_276; //  0xb0c0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_275; //  0xb138 Size(78)
	Unknown AnimGraphNode_BlendListByInt_20; //  0xb1b0 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_274; //  0xb250 Size(78)
	Unknown AnimGraphNode_SequencePlayer_273; //  0xb2c8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_272; //  0xb340 Size(78)
	Unknown AnimGraphNode_BlendListByInt_19; //  0xb3b8 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_271; //  0xb458 Size(78)
	Unknown AnimGraphNode_SequencePlayer_270; //  0xb4d0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_269; //  0xb548 Size(78)
	Unknown AnimGraphNode_BlendListByInt_18; //  0xb5c0 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_268; //  0xb660 Size(78)
	Unknown AnimGraphNode_SequencePlayer_267; //  0xb6d8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_266; //  0xb750 Size(78)
	Unknown AnimGraphNode_BlendListByInt_17; //  0xb7c8 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_265; //  0xb868 Size(78)
	Unknown AnimGraphNode_BlendListByBo_47; //  0xb8e0 Size(a0)
	Unknown AnimGraphNode_BlendListByBor_46; //  0xb980 Size(a0)
	Unknown AnimGraphNode_BlendListByBo_45; //  0xba20 Size(a0)
	Unknown AnimGraphNode_StateResult_26; //  0xbac0 Size(30)
	Unknown AnimGraphNode_StateMachine_8; //  0xbaf0 Size(b0)
	Unknown AnimGraphNode_SaveCachedPose_17; //  0xbba0 Size(b8)
	Unknown AnimGraphNode_ApplyAdditive_12; //  0xbc58 Size(c8)
	Unknown AnimGraphNode_UseCachedPose_35; //  0xbd20 Size(28)
	Unknown AnimGraphNode_BlendListByBo_44; //  0xbd48 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_264; //  0xbde8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_263; //  0xbe60 Size(78)
	Unknown AnimGraphNode_SequencePlayer_262; //  0xbed8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_261; //  0xbf50 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_56; //  0xbfc8 Size(b0)
	Unknown AnimGraphNode_StateResult_25; //  0xc078 Size(30)
	Unknown AnimGraphNode_StateMachine_7; //  0xc0a8 Size(b0)
	Unknown AnimGraphNode_SaveCachedPose_16; //  0xc158 Size(b8)
	Unknown AnimGraphNode_LayeredBoneBlend_70; //  0xc210 Size(c0)
	Unknown AnimGraphNode_UseCachedPose_34; //  0xc2d0 Size(28)
	Unknown AnimGraphNode_BlendListByBo_43; //  0xc2f8 Size(a0)
	Unknown AnimGraphNode_BlendListByBo_42; //  0xc398 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_260; //  0xc438 Size(78)
	Unknown AnimGraphNode_SequencePlayer_259; //  0xc4b0 Size(78)
	Unknown AnimGraphNode_BlendListByBo_41; //  0xc528 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_258; //  0xc5c8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_257; //  0xc640 Size(78)
	Unknown AnimGraphNode_StateResult_24; //  0xc6b8 Size(30)
	Unknown AnimGraphNode_StateMachine_6; //  0xc6e8 Size(b0)
	Unknown AnimGraphNode_SaveCachedPose_15; //  0xc798 Size(b8)
	Unknown AnimGraphNode_BlendListByBo_40; //  0xc850 Size(a0)
	Unknown AnimGraphNode_BlendListByBoe_39; //  0xc8f0 Size(a0)
	Unknown AnimGraphNode_UseCachedPose_33; //  0xc990 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_14; //  0xc9b8 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_32; //  0xca70 Size(28)
	Unknown AnimGraphNode_Slot_14; //  0xca98 Size(48)
	Unknown AnimGraphNode_LayeredBoneBlend_69; //  0xcae0 Size(c0)
	Unknown AnimGraphNode_UseCachedPose_31; //  0xcba0 Size(28)
	Unknown AnimGraphNode_TwoBoneIK_11; //  0xcbd0 Size(1e0)
	Unknown AnimGraphNode_TwoBoneIK_10; //  0xcdb0 Size(1e0)
	Unknown AnimGraphNode_LocalToComponentSpace_4; //  0xcf90 Size(20)
	Unknown AnimGraphNode_ComponentToLo_4; //  0xcfb0 Size(20)
	Unknown AnimGraphNode_SaveCachedPose_13; //  0xcfd0 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_30; //  0xd088 Size(28)
	Unknown AnimGraphNode_UseCachedPose_29; //  0xd0b0 Size(28)
	Unknown AnimGraphNode_TwoBoneIK_9; //  0xd0e0 Size(1e0)
	Unknown AnimGraphNode_TwoBoneIK_8; //  0xd2c0 Size(1e0)
	Unknown AnimGraphNode_TwoBoneIK_7; //  0xd4a0 Size(1e0)
	Unknown AnimGraphNode_TwoBoneIK_6; //  0xd680 Size(1e0)
	Unknown AnimGraphNode_LocalToComponentSpace_3; //  0xd860 Size(20)
	Unknown AnimGraphNode_ComponentToLo_3; //  0xd880 Size(20)
	Unknown AnimGraphNode_TwoBoneIK_5; //  0xd8a0 Size(1e0)
	Unknown AnimGraphNode_TwoBoneIK_4; //  0xda80 Size(1e0)
	Unknown AnimGraphNode_TwoBoneIK_3; //  0xdc60 Size(1e0)
	Unknown AnimGraphNode_TwoBoneIK_2; //  0xde40 Size(1e0)
	Unknown AnimGraphNode_LocalToComponentSpace_2; //  0xe020 Size(20)
	Unknown AnimGraphNode_ComponentToLo_2; //  0xe040 Size(20)
	Unknown AnimGraphNode_UseCachedPose_28; //  0xe060 Size(28)
	Unknown AnimGraphNode_UseCachedPose_27; //  0xe088 Size(28)
	Unknown AnimGraphNode_UseCachedPose_26; //  0xe0b0 Size(28)
	Unknown AnimGraphNode_Slot_13; //  0xe0d8 Size(48)
	Unknown AnimGraphNode_BlendListByEnum_55; //  0xe120 Size(b0)
	Unknown AnimGraphNode_BlendListByBo_38; //  0xe1d0 Size(a0)
	Unknown AnimGraphNode_RotationOffsetBlendSpace; //  0xe270 Size(188)
	Unknown AnimGraphNode_UseCachedPose_25; //  0xe3f8 Size(28)
	Unknown AnimGraphNode_SequencePlayer_256; //  0xe420 Size(78)
	Unknown AnimGraphNode_BlendListByBo_37; //  0xe498 Size(a0)
	Unknown AnimGraphNode_Slot_12; //  0xe538 Size(48)
	Unknown AnimGraphNode_Slot_11; //  0xe580 Size(48)
	Unknown AnimGraphNode_BlendListByBor_36; //  0xe5c8 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_255; //  0xe668 Size(78)
	Unknown AnimGraphNode_SequencePlayer_254; //  0xe6e0 Size(78)
	Unknown AnimGraphNode_BlendListByBo_35; //  0xe758 Size(a0)
	Unknown AnimGraphNode_LayeredBoneBlend_68; //  0xe7f8 Size(c0)
	Unknown AnimGraphNode_Slot_10; //  0xe8b8 Size(48)
	Unknown AnimGraphNode_BlendListByBo_34; //  0xe900 Size(a0)
	Unknown AnimGraphNode_LayeredBoneBlend_67; //  0xe9a0 Size(c0)
	Unknown AnimGraphNode_Slot_9; //  0xea60 Size(48)
	Unknown AnimGraphNode_BlendListByBo_33; //  0xeaa8 Size(a0)
	Unknown AnimGraphNode_ApplyAdditive_11; //  0xeb48 Size(c8)
	Unknown AnimGraphNode_UseCachedPose_24; //  0xec10 Size(28)
	Unknown AnimGraphNode_TransitionResult_51; //  0xec38 Size(28)
	Unknown AnimGraphNode_TransitionResult_50; //  0xec60 Size(28)
	Unknown AnimGraphNode_TransitionResult_49; //  0xec88 Size(28)
	Unknown AnimGraphNode_TransitionResult_48; //  0xecb0 Size(28)
	Unknown AnimGraphNode_TransitionResult_47; //  0xecd8 Size(28)
	Unknown AnimGraphNode_TransitionResult_46; //  0xed00 Size(28)
	Unknown AnimGraphNode_TransitionResult_45; //  0xed28 Size(28)
	Unknown AnimGraphNode_TransitionResult_44; //  0xed50 Size(28)
	Unknown AnimGraphNode_TransitionResult_43; //  0xed78 Size(28)
	Unknown AnimGraphNode_TransitionResult_42; //  0xeda0 Size(28)
	Unknown AnimGraphNode_TransitionResult_41; //  0xedc8 Size(28)
	Unknown AnimGraphNode_TransitionResult_40; //  0xedf0 Size(28)
	Unknown AnimGraphNode_TransitionResult_39; //  0xee18 Size(28)
	Unknown AnimGraphNode_TransitionResult_38; //  0xee40 Size(28)
	Unknown AnimGraphNode_TransitionResult_37; //  0xee68 Size(28)
	Unknown AnimGraphNode_TransitionResult_36; //  0xee90 Size(28)
	Unknown AnimGraphNode_TransitionResult_35; //  0xeeb8 Size(28)
	Unknown AnimGraphNode_TransitionResult_34; //  0xeee0 Size(28)
	Unknown AnimGraphNode_TransitionResult_33; //  0xef08 Size(28)
	Unknown AnimGraphNode_TransitionResult_32; //  0xef30 Size(28)
	Unknown AnimGraphNode_TransitionResult_31; //  0xef58 Size(28)
	Unknown AnimGraphNode_TransitionResult_30; //  0xef80 Size(28)
	Unknown AnimGraphNode_TransitionResult_29; //  0xefa8 Size(28)
	Unknown AnimGraphNode_TransitionResult_28; //  0xefd0 Size(28)
	Unknown AnimGraphNode_TransitionResult_27; //  0xeff8 Size(28)
	Unknown AnimGraphNode_TransitionResult_26; //  0xf020 Size(28)
	Unknown AnimGraphNode_SequencePlayer_253; //  0xf048 Size(78)
	Unknown AnimGraphNode_SequencePlayer_252; //  0xf0c0 Size(78)
	Unknown AnimGraphNode_TwoWayBlend_20; //  0xf138 Size(c8)
	Unknown AnimGraphNode_LayeredBoneBlend_66; //  0xf200 Size(c0)
	Unknown AnimGraphNode_BlendSpacePlayer_100; //  0xf2c0 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_251; //  0xf3a0 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_65; //  0xf418 Size(c0)
	Unknown AnimGraphNode_BlendSpacePlayer_99; //  0xf4d8 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_250; //  0xf5b8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_249; //  0xf630 Size(78)
	Unknown AnimGraphNode_SequencePlayer_248; //  0xf6a8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_247; //  0xf720 Size(78)
	Unknown AnimGraphNode_SequencePlayer_246; //  0xf798 Size(78)
	Unknown AnimGraphNode_SequencePlayer_245; //  0xf810 Size(78)
	Unknown AnimGraphNode_SequencePlayer_244; //  0xf888 Size(78)
	Unknown AnimGraphNode_SequencePlayer_243; //  0xf900 Size(78)
	Unknown AnimGraphNode_TwoWayBlend_19; //  0xf978 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_242; //  0xfa40 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_64; //  0xfab8 Size(c0)
	Unknown AnimGraphNode_BlendSpacePlayer_98; //  0xfb78 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_241; //  0xfc58 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_63; //  0xfcd0 Size(c0)
	Unknown AnimGraphNode_BlendSpacePlayer_97; //  0xfd90 Size(e0)
	Unknown AnimGraphNode_BlendListByBo_32; //  0xfe70 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_240; //  0xff10 Size(78)
	Unknown AnimGraphNode_TwoWayBlend_18; //  0xff88 Size(c8)
	Unknown AnimGraphNode_BlendSpacePlayer_96; //  0x10050 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_239; //  0x10130 Size(78)
	Unknown AnimGraphNode_TwoWayBlend_17; //  0x101a8 Size(c8)
	Unknown AnimGraphNode_BlendSpacePlayer_95; //  0x10270 Size(e0)
	Unknown AnimGraphNode_TwoWayBlend_16; //  0x10350 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_238; //  0x10418 Size(78)
	Unknown AnimGraphNode_SequencePlayer_237; //  0x10490 Size(78)
	Unknown AnimGraphNode_TwoWayBlend_15; //  0x10508 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_236; //  0x105d0 Size(78)
	Unknown AnimGraphNode_TwoWayBlend_14; //  0x10648 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_235; //  0x10710 Size(78)
	Unknown AnimGraphNode_TwoWayBlend_13; //  0x10788 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_234; //  0x10850 Size(78)
	Unknown AnimGraphNode_TwoWayBlend_12; //  0x108c8 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_233; //  0x10990 Size(78)
	Unknown AnimGraphNode_TwoWayBlend_11; //  0x10a08 Size(c8)
	Unknown AnimGraphNode_BlendSpacePlayer_94; //  0x10ad0 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_93; //  0x10bb0 Size(e0)
	Unknown AnimGraphNode_LayeredBoneBlend_62; //  0x10c90 Size(c0)
	Unknown AnimGraphNode_BlendSpacePlayer_92; //  0x10d50 Size(e0)
	Unknown AnimGraphNode_BlendListByEnum_54; //  0x10e30 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_91; //  0x10ee0 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_90; //  0x10fc0 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_89; //  0x110a0 Size(e0)
	Unknown AnimGraphNode_BlendListByEnum_53; //  0x11180 Size(b0)
	Unknown AnimGraphNode_IdentityPose_2; //  0x11230 Size(18)
	Unknown AnimGraphNode_ApplyAdditive_10; //  0x11248 Size(c8)
	Unknown AnimGraphNode_BlendListByEnum_52; //  0x11310 Size(b0)
	Unknown AnimGraphNode_LayeredBoneBlend_61; //  0x113c0 Size(c0)
	Unknown AnimGraphNode_BlendListByEnum_51; //  0x11480 Size(b0)
	Unknown AnimGraphNode_LayeredBoneBlend_60; //  0x11530 Size(c0)
	Unknown AnimGraphNode_BlendSpacePlayer_88; //  0x115f0 Size(e0)
	Unknown AnimGraphNode_BlendListByEnum_50; //  0x116d0 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_87; //  0x11780 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_86; //  0x11860 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_85; //  0x11940 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_84; //  0x11a20 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_83; //  0x11b00 Size(e0)
	Unknown AnimGraphNode_ApplyAdditive_9; //  0x11be0 Size(c8)
	Unknown AnimGraphNode_ApplyAdditive_8; //  0x11ca8 Size(c8)
	Unknown AnimGraphNode_BlendListByBo_31; //  0x11d70 Size(a0)
	Unknown AnimGraphNode_StateResult_23; //  0x11e10 Size(30)
	Unknown AnimGraphNode_SequencePlayer_232; //  0x11e40 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_59; //  0x11eb8 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_231; //  0x11f78 Size(78)
	Unknown AnimGraphNode_SequencePlayer_230; //  0x11ff0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_229; //  0x12068 Size(78)
	Unknown AnimGraphNode_SequencePlayer_228; //  0x120e0 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_58; //  0x12158 Size(c0)
	Unknown AnimGraphNode_LayeredBoneBlend_57; //  0x12218 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_227; //  0x122d8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_226; //  0x12350 Size(78)
	Unknown AnimGraphNode_SequencePlayer_225; //  0x123c8 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_49; //  0x12440 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_224; //  0x124f0 Size(78)
	Unknown AnimGraphNode_StateResult_22; //  0x12568 Size(30)
	Unknown AnimGraphNode_SequencePlayer_223; //  0x12598 Size(78)
	Unknown AnimGraphNode_SequencePlayer_222; //  0x12610 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_56; //  0x12688 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_221; //  0x12748 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_55; //  0x127c0 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_220; //  0x12880 Size(78)
	Unknown AnimGraphNode_SequencePlayer_219; //  0x128f8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_218; //  0x12970 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_48; //  0x129e8 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_217; //  0x12a98 Size(78)
	Unknown AnimGraphNode_StateResult_21; //  0x12b10 Size(30)
	Unknown AnimGraphNode_SequencePlayer_216; //  0x12b40 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_54; //  0x12bb8 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_215; //  0x12c78 Size(78)
	Unknown AnimGraphNode_SequencePlayer_214; //  0x12cf0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_213; //  0x12d68 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_53; //  0x12de0 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_212; //  0x12ea0 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_52; //  0x12f18 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_211; //  0x12fd8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_210; //  0x13050 Size(78)
	Unknown AnimGraphNode_SequencePlayer_209; //  0x130c8 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_47; //  0x13140 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_208; //  0x131f0 Size(78)
	Unknown AnimGraphNode_StateResult_20; //  0x13268 Size(30)
	Unknown AnimGraphNode_StateMachine_5; //  0x13298 Size(b0)
	Unknown AnimGraphNode_StateResult_19; //  0x13348 Size(30)
	Unknown AnimGraphNode_LayeredBoneBlend_51; //  0x13378 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_207; //  0x13438 Size(78)
	Unknown AnimGraphNode_SequencePlayer_206; //  0x134b0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_205; //  0x13528 Size(78)
	Unknown AnimGraphNode_SequencePlayer_204; //  0x135a0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_203; //  0x13618 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_50; //  0x13690 Size(c0)
	Unknown AnimGraphNode_LayeredBoneBlend_49; //  0x13750 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_202; //  0x13810 Size(78)
	Unknown AnimGraphNode_SequencePlayer_201; //  0x13888 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_46; //  0x13900 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_200; //  0x139b0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_199; //  0x13a28 Size(78)
	Unknown AnimGraphNode_StateResult_18; //  0x13aa0 Size(30)
	Unknown AnimGraphNode_LayeredBoneBlend_48; //  0x13ad0 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_198; //  0x13b90 Size(78)
	Unknown AnimGraphNode_SequencePlayer_197; //  0x13c08 Size(78)
	Unknown AnimGraphNode_SequencePlayer_196; //  0x13c80 Size(78)
	Unknown AnimGraphNode_SequencePlayer_195; //  0x13cf8 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_47; //  0x13d70 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_194; //  0x13e30 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_46; //  0x13ea8 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_193; //  0x13f68 Size(78)
	Unknown AnimGraphNode_SequencePlayer_192; //  0x13fe0 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_45; //  0x14058 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_191; //  0x14108 Size(78)
	Unknown AnimGraphNode_SequencePlayer_190; //  0x14180 Size(78)
	Unknown AnimGraphNode_StateResult_17; //  0x141f8 Size(30)
	Unknown AnimGraphNode_SequencePlayer_189; //  0x14228 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_45; //  0x142a0 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_188; //  0x14360 Size(78)
	Unknown AnimGraphNode_SequencePlayer_187; //  0x143d8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_186; //  0x14450 Size(78)
	Unknown AnimGraphNode_SequencePlayer_185; //  0x144c8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_184; //  0x14540 Size(78)
	Unknown AnimGraphNode_SequencePlayer_183; //  0x145b8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_182; //  0x14630 Size(78)
	Unknown AnimGraphNode_SequencePlayer_181; //  0x146a8 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_44; //  0x14720 Size(c0)
	Unknown AnimGraphNode_LayeredBoneBlend_43; //  0x147e0 Size(c0)
	Unknown AnimGraphNode_BlendListByEnum_44; //  0x148a0 Size(b0)
	Unknown AnimGraphNode_BlendListByEnum_43; //  0x14950 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_180; //  0x14a00 Size(78)
	Unknown AnimGraphNode_SequencePlayer_179; //  0x14a78 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_42; //  0x14af0 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_178; //  0x14ba0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_177; //  0x14c18 Size(78)
	Unknown AnimGraphNode_StateResult_16; //  0x14c90 Size(30)
	Unknown AnimGraphNode_SequencePlayer_176; //  0x14cc0 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_42; //  0x14d38 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_175; //  0x14df8 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_41; //  0x14e70 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_174; //  0x14f30 Size(78)
	Unknown AnimGraphNode_SequencePlayer_173; //  0x14fa8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_172; //  0x15020 Size(78)
	Unknown AnimGraphNode_SequencePlayer_171; //  0x15098 Size(78)
	Unknown AnimGraphNode_SequencePlayer_170; //  0x15110 Size(78)
	Unknown AnimGraphNode_SequencePlayer_169; //  0x15188 Size(78)
	Unknown AnimGraphNode_SequencePlayer_168; //  0x15200 Size(78)
	Unknown AnimGraphNode_SequencePlayer_167; //  0x15278 Size(78)
	Unknown AnimGraphNode_SequencePlayer_166; //  0x152f0 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_40; //  0x15368 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_165; //  0x15428 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_39; //  0x154a0 Size(c0)
	Unknown AnimGraphNode_BlendListByEnum_41; //  0x15560 Size(b0)
	Unknown AnimGraphNode_BlendListByEnum_40; //  0x15610 Size(b0)
	Unknown AnimGraphNode_LayeredBoneBlend_38; //  0x156c0 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_164; //  0x15780 Size(78)
	Unknown AnimGraphNode_SequencePlayer_163; //  0x157f8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_162; //  0x15870 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_39; //  0x158e8 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_161; //  0x15998 Size(78)
	Unknown AnimGraphNode_StateResult_15; //  0x15a10 Size(30)
	Unknown AnimGraphNode_TransitionResult_25; //  0x15a40 Size(28)
	Unknown AnimGraphNode_TransitionResult_24; //  0x15a68 Size(28)
	Unknown AnimGraphNode_TransitionResult_23; //  0x15a90 Size(28)
	Unknown AnimGraphNode_TransitionResult_22; //  0x15ab8 Size(28)
	Unknown AnimGraphNode_TransitionResult_21; //  0x15ae0 Size(28)
	Unknown AnimGraphNode_BlendListByBo_30; //  0x15b08 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_82; //  0x15ba8 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_81; //  0x15c88 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_160; //  0x15d68 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_37; //  0x15de0 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_159; //  0x15ea0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_158; //  0x15f18 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_36; //  0x15f90 Size(c0)
	Unknown AnimGraphNode_BlendListByBo_29; //  0x16050 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_80; //  0x160f0 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_79; //  0x161d0 Size(e0)
	Unknown AnimGraphNode_LayeredBoneBlend_35; //  0x162b0 Size(c0)
	Unknown AnimGraphNode_BlendListByBo_28; //  0x16370 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_78; //  0x16410 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_77; //  0x164f0 Size(e0)
	Unknown AnimGraphNode_BlendListByEnum_38; //  0x165d0 Size(b0)
	Unknown AnimGraphNode_BlendListByBo_27; //  0x16680 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_76; //  0x16720 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_75; //  0x16800 Size(e0)
	Unknown AnimGraphNode_BlendListByBo_26; //  0x168e0 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_74; //  0x16980 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_73; //  0x16a60 Size(e0)
	Unknown AnimGraphNode_StateResult_14; //  0x16b40 Size(30)
	Unknown AnimGraphNode_BlendListByBo_25; //  0x16b70 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_72; //  0x16c10 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_71; //  0x16cf0 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_157; //  0x16dd0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_156; //  0x16e48 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_34; //  0x16ec0 Size(c0)
	Unknown AnimGraphNode_BlendSpacePlayer_70; //  0x16f80 Size(e0)
	Unknown AnimGraphNode_LayeredBoneBlend_33; //  0x17060 Size(c0)
	Unknown AnimGraphNode_BlendSpacePlayer_69; //  0x17120 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_68; //  0x17200 Size(e0)
	Unknown AnimGraphNode_BlendListByEnum_37; //  0x172e0 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_67; //  0x17390 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_66; //  0x17470 Size(e0)
	Unknown AnimGraphNode_StateResult_13; //  0x17550 Size(30)
	Unknown AnimGraphNode_SequencePlayer_155; //  0x17580 Size(78)
	Unknown AnimGraphNode_SequencePlayer_154; //  0x175f8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_153; //  0x17670 Size(78)
	Unknown AnimGraphNode_ComponentToLo; //  0x176e8 Size(20)
	Unknown AnimGraphNode_LocalToComponentSpace; //  0x17708 Size(20)
	Unknown AnimGraphNode_TwoBoneIK; //  0x17730 Size(1e0)
	Unknown AnimGraphNode_SequencePlayer_152; //  0x17910 Size(78)
	Unknown AnimGraphNode_SequencePlayer_151; //  0x17988 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_32; //  0x17a00 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_150; //  0x17ac0 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_31; //  0x17b38 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_149; //  0x17bf8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_148; //  0x17c70 Size(78)
	Unknown AnimGraphNode_BlendListByInt_16; //  0x17ce8 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_147; //  0x17d88 Size(78)
	Unknown AnimGraphNode_SequencePlayer_146; //  0x17e00 Size(78)
	Unknown AnimGraphNode_SequencePlayer_145; //  0x17e78 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_36; //  0x17ef0 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_144; //  0x17fa0 Size(78)
	Unknown AnimGraphNode_BlendListByBo_24; //  0x18018 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_143; //  0x180b8 Size(78)
	Unknown AnimGraphNode_BlendListByBo_23; //  0x18130 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_142; //  0x181d0 Size(78)
	Unknown AnimGraphNode_BlendListByBo_22; //  0x18248 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_141; //  0x182e8 Size(78)
	Unknown AnimGraphNode_BlendListByBo_21; //  0x18360 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_140; //  0x18400 Size(78)
	Unknown AnimGraphNode_SequencePlayer_139; //  0x18478 Size(78)
	Unknown AnimGraphNode_SequencePlayer_138; //  0x184f0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_137; //  0x18568 Size(78)
	Unknown AnimGraphNode_BlendListByInt_15; //  0x185e0 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_136; //  0x18680 Size(78)
	Unknown AnimGraphNode_SequencePlayer_135; //  0x186f8 Size(78)
	Unknown AnimGraphNode_BlendListByInt_14; //  0x18770 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_134; //  0x18810 Size(78)
	Unknown AnimGraphNode_SequencePlayer_133; //  0x18888 Size(78)
	Unknown AnimGraphNode_BlendListByInt_13; //  0x18900 Size(a0)
	Unknown AnimGraphNode_BlendListByEnum_35; //  0x189a0 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_132; //  0x18a50 Size(78)
	Unknown AnimGraphNode_SequencePlayer_131; //  0x18ac8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_130; //  0x18b40 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_34; //  0x18bb8 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_129; //  0x18c68 Size(78)
	Unknown AnimGraphNode_SequencePlayer_128; //  0x18ce0 Size(78)
	Unknown AnimGraphNode_BlendListByBo_20; //  0x18d58 Size(a0)
	Unknown AnimGraphNode_BlendListByEnum_33; //  0x18df8 Size(b0)
	Unknown AnimGraphNode_Slot_8; //  0x18ea8 Size(48)
	Unknown AnimGraphNode_SequencePlayer_127; //  0x18ef0 Size(78)
	Unknown AnimGraphNode_StateResult_12; //  0x18f68 Size(30)
	Unknown AnimGraphNode_StateMachine_4; //  0x18f98 Size(b0)
	Unknown AnimGraphNode_StateResult_11; //  0x19048 Size(30)
	Unknown AnimGraphNode_TransitionResult_20; //  0x19078 Size(28)
	Unknown AnimGraphNode_TransitionResult_19; //  0x190a0 Size(28)
	Unknown AnimGraphNode_TransitionResult_18; //  0x190c8 Size(28)
	Unknown AnimGraphNode_TransitionResult_17; //  0x190f0 Size(28)
	Unknown AnimGraphNode_TransitionResult_16; //  0x19118 Size(28)
	Unknown AnimGraphNode_SequencePlayer_126; //  0x19140 Size(78)
	Unknown AnimGraphNode_BlendSpacePlayer_65; //  0x191b8 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_64; //  0x19298 Size(e0)
	Unknown AnimGraphNode_BlendListByBo_19; //  0x19378 Size(a0)
	Unknown AnimGraphNode_LayeredBoneBlend_30; //  0x19418 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_125; //  0x194d8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_124; //  0x19550 Size(78)
	Unknown AnimGraphNode_SequencePlayer_123; //  0x195c8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_122; //  0x19640 Size(78)
	Unknown AnimGraphNode_SequencePlayer_121; //  0x196b8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_120; //  0x19730 Size(78)
	Unknown AnimGraphNode_SequencePlayer_119; //  0x197a8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_118; //  0x19820 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_29; //  0x19898 Size(c0)
	Unknown AnimGraphNode_BlendSpacePlayer_63; //  0x19958 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_62; //  0x19a38 Size(e0)
	Unknown AnimGraphNode_BlendListByBo_18; //  0x19b18 Size(a0)
	Unknown AnimGraphNode_BlendListByEnum_32; //  0x19bb8 Size(b0)
	Unknown AnimGraphNode_BlendListByEnum_31; //  0x19c68 Size(b0)
	Unknown AnimGraphNode_LayeredBoneBlend_28; //  0x19d18 Size(c0)
	Unknown AnimGraphNode_BlendListByEnum_30; //  0x19dd8 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_61; //  0x19e88 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_60; //  0x19f68 Size(e0)
	Unknown AnimGraphNode_BlendListByBo_17; //  0x1a048 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_59; //  0x1a0e8 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_58; //  0x1a1c8 Size(e0)
	Unknown AnimGraphNode_BlendListByBo_16; //  0x1a2a8 Size(a0)
	Unknown AnimGraphNode_BlendListByEnum_29; //  0x1a348 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_57; //  0x1a3f8 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_56; //  0x1a4d8 Size(e0)
	Unknown AnimGraphNode_BlendListByBo_15; //  0x1a5b8 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_55; //  0x1a658 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_54; //  0x1a738 Size(e0)
	Unknown AnimGraphNode_BlendListByBo_14; //  0x1a818 Size(a0)
	Unknown AnimGraphNode_StateResult_10; //  0x1a8b8 Size(30)
	Unknown AnimGraphNode_BlendSpacePlayer_53; //  0x1a8e8 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_52; //  0x1a9c8 Size(e0)
	Unknown AnimGraphNode_BlendListByBo_13; //  0x1aaa8 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_117; //  0x1ab48 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_27; //  0x1abc0 Size(c0)
	Unknown AnimGraphNode_BlendSpacePlayer_51; //  0x1ac80 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_116; //  0x1ad60 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_26; //  0x1add8 Size(c0)
	Unknown AnimGraphNode_BlendListByEnum_28; //  0x1ae98 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_50; //  0x1af48 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_49; //  0x1b028 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_115; //  0x1b108 Size(78)
	Unknown AnimGraphNode_SequencePlayer_114; //  0x1b180 Size(78)
	Unknown AnimGraphNode_SequencePlayer_113; //  0x1b1f8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_112; //  0x1b270 Size(78)
	Unknown AnimGraphNode_SequencePlayer_111; //  0x1b2e8 Size(78)
	Unknown AnimGraphNode_BlendSpacePlayer_48; //  0x1b360 Size(e0)
	Unknown AnimGraphNode_BlendListByBo_12; //  0x1b440 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_110; //  0x1b4e0 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_25; //  0x1b558 Size(c0)
	Unknown AnimGraphNode_BlendSpacePlayer_47; //  0x1b618 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_109; //  0x1b6f8 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_24; //  0x1b770 Size(c0)
	Unknown AnimGraphNode_BlendListByEnum_27; //  0x1b830 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_46; //  0x1b8e0 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_45; //  0x1b9c0 Size(e0)
	Unknown AnimGraphNode_LayeredBoneBlend_23; //  0x1baa0 Size(c0)
	Unknown AnimGraphNode_LayeredBoneBlend_22; //  0x1bb60 Size(c0)
	Unknown AnimGraphNode_BlendListByEnum_26; //  0x1bc20 Size(b0)
	Unknown AnimGraphNode_BlendListByEnum_25; //  0x1bcd0 Size(b0)
	Unknown AnimGraphNode_BlendListByEnum_24; //  0x1bd80 Size(b0)
	Unknown AnimGraphNode_BlendListByEnum_23; //  0x1be30 Size(b0)
	Unknown AnimGraphNode_LayeredBoneBlend_21; //  0x1bee0 Size(c0)
	Unknown AnimGraphNode_BlendSpacePlayer_44; //  0x1bfa0 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_43; //  0x1c080 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_42; //  0x1c160 Size(e0)
	Unknown AnimGraphNode_BlendListByEnum_22; //  0x1c240 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_41; //  0x1c2f0 Size(e0)
	Unknown AnimGraphNode_BlendListByEnum_21; //  0x1c3d0 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_40; //  0x1c480 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_39; //  0x1c560 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_38; //  0x1c640 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_37; //  0x1c720 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_36; //  0x1c800 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_35; //  0x1c8e0 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_34; //  0x1c9c0 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_33; //  0x1caa0 Size(e0)
	Unknown AnimGraphNode_ApplyAdditive_7; //  0x1cb80 Size(c8)
	Unknown AnimGraphNode_ApplyAdditive_6; //  0x1cc48 Size(c8)
	Unknown AnimGraphNode_BlendListByBo_11; //  0x1cd10 Size(a0)
	Unknown AnimGraphNode_StateResult_9; //  0x1cdb0 Size(30)
	Unknown AnimGraphNode_SequencePlayer_108; //  0x1cde0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_107; //  0x1ce58 Size(78)
	Unknown AnimGraphNode_SequencePlayer_106; //  0x1ced0 Size(78)
	Unknown AnimGraphNode_BlendListByInt_12; //  0x1cf48 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_105; //  0x1cfe8 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_20; //  0x1d060 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_104; //  0x1d120 Size(78)
	Unknown AnimGraphNode_SequencePlayer_103; //  0x1d198 Size(78)
	Unknown AnimGraphNode_SequencePlayer_102; //  0x1d210 Size(78)
	Unknown AnimGraphNode_BlendListByBo_10; //  0x1d288 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_101; //  0x1d328 Size(78)
	Unknown AnimGraphNode_SequencePlayer_100; //  0x1d3a0 Size(78)
	Unknown AnimGraphNode_BlendListByInt_11; //  0x1d418 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_99; //  0x1d4b8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_98; //  0x1d530 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_19; //  0x1d5a8 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_97; //  0x1d668 Size(78)
	Unknown AnimGraphNode_SequencePlayer_96; //  0x1d6e0 Size(78)
	Unknown AnimGraphNode_BlendListByInt_10; //  0x1d758 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_95; //  0x1d7f8 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_18; //  0x1d870 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_94; //  0x1d930 Size(78)
	Unknown AnimGraphNode_SequencePlayer_93; //  0x1d9a8 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_20; //  0x1da20 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_92; //  0x1dad0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_91; //  0x1db48 Size(78)
	Unknown AnimGraphNode_SequencePlayer_90; //  0x1dbc0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_89; //  0x1dc38 Size(78)
	Unknown AnimGraphNode_SequencePlayer_88; //  0x1dcb0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_87; //  0x1dd28 Size(78)
	Unknown AnimGraphNode_BlendListByInt_9; //  0x1dda0 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_86; //  0x1de40 Size(78)
	Unknown AnimGraphNode_SequencePlayer_85; //  0x1deb8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_84; //  0x1df30 Size(78)
	Unknown AnimGraphNode_BlendListByInt_8; //  0x1dfa8 Size(a0)
	Unknown AnimGraphNode_BlendListByInt_7; //  0x1e048 Size(a0)
	Unknown AnimGraphNode_BlendListByEnum_19; //  0x1e0e8 Size(b0)
	Unknown AnimGraphNode_BlendListByEnum_18; //  0x1e198 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_83; //  0x1e248 Size(78)
	Unknown AnimGraphNode_Slot_7; //  0x1e2c0 Size(48)
	Unknown AnimGraphNode_StateResult_8; //  0x1e308 Size(30)
	Unknown AnimGraphNode_StateMachine_3; //  0x1e338 Size(b0)
	Unknown AnimGraphNode_StateResult_7; //  0x1e3e8 Size(30)
	Unknown AnimGraphNode_Slot_6; //  0x1e418 Size(48)
	Unknown AnimGraphNode_TransitionResult_15; //  0x1e460 Size(28)
	Unknown AnimGraphNode_TransitionResult_14; //  0x1e488 Size(28)
	Unknown AnimGraphNode_TransitionResult_13; //  0x1e4b0 Size(28)
	Unknown AnimGraphNode_TransitionResult_12; //  0x1e4d8 Size(28)
	Unknown AnimGraphNode_TransitionResult_11; //  0x1e500 Size(28)
	Unknown AnimGraphNode_TransitionResult_10; //  0x1e528 Size(28)
	Unknown AnimGraphNode_TransitionResult_9; //  0x1e550 Size(28)
	Unknown AnimGraphNode_TransitionResult_8; //  0x1e578 Size(28)
	Unknown AnimGraphNode_TransitionResult_7; //  0x1e5a0 Size(28)
	Unknown AnimGraphNode_TransitionResult_6; //  0x1e5c8 Size(28)
	Unknown AnimGraphNode_TransitionResult_5; //  0x1e5f0 Size(28)
	Unknown AnimGraphNode_TransitionResult_4; //  0x1e618 Size(28)
	Unknown AnimGraphNode_TransitionResult_3; //  0x1e640 Size(28)
	Unknown AnimGraphNode_TransitionResult_2; //  0x1e668 Size(28)
	Unknown AnimGraphNode_TransitionResult; //  0x1e690 Size(28)
	Unknown AnimGraphNode_SequencePlayer_82; //  0x1e6b8 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_17; //  0x1e730 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_81; //  0x1e7f0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_80; //  0x1e868 Size(78)
	Unknown AnimGraphNode_BlendListByBo_9; //  0x1e8e0 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_79; //  0x1e980 Size(78)
	Unknown AnimGraphNode_SequencePlayer_78; //  0x1e9f8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_77; //  0x1ea70 Size(78)
	Unknown AnimGraphNode_SequencePlayer_76; //  0x1eae8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_75; //  0x1eb60 Size(78)
	Unknown AnimGraphNode_SequencePlayer_74; //  0x1ebd8 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_17; //  0x1ec50 Size(b0)
	Unknown AnimGraphNode_StateResult_6; //  0x1ed00 Size(30)
	Unknown AnimGraphNode_SequencePlayer_73; //  0x1ed30 Size(78)
	Unknown AnimGraphNode_SequencePlayer_72; //  0x1eda8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_71; //  0x1ee20 Size(78)
	Unknown AnimGraphNode_SequencePlayer_70; //  0x1ee98 Size(78)
	Unknown AnimGraphNode_SequencePlayer_69; //  0x1ef10 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_16; //  0x1ef88 Size(b0)
	Unknown AnimGraphNode_StateResult_5; //  0x1f038 Size(30)
	Unknown AnimGraphNode_SequencePlayer_68; //  0x1f068 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_16; //  0x1f0e0 Size(c0)
	Unknown AnimGraphNode_BlendListByBo_8; //  0x1f1a0 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_32; //  0x1f240 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_31; //  0x1f320 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_67; //  0x1f400 Size(78)
	Unknown AnimGraphNode_SequencePlayer_66; //  0x1f478 Size(78)
	Unknown AnimGraphNode_SequencePlayer_65; //  0x1f4f0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_64; //  0x1f568 Size(78)
	Unknown AnimGraphNode_SequencePlayer_63; //  0x1f5e0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_62; //  0x1f658 Size(78)
	Unknown AnimGraphNode_SequencePlayer_61; //  0x1f6d0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_60; //  0x1f748 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_15; //  0x1f7c0 Size(c0)
	Unknown AnimGraphNode_BlendListByBo_7; //  0x1f880 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_30; //  0x1f920 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_29; //  0x1fa00 Size(e0)
	Unknown AnimGraphNode_BlendListByEnum_15; //  0x1fae0 Size(b0)
	Unknown AnimGraphNode_BlendListByEnum_14; //  0x1fb90 Size(b0)
	Unknown AnimGraphNode_BlendListByEnum_13; //  0x1fc40 Size(b0)
	Unknown AnimGraphNode_LayeredBoneBlend_14; //  0x1fcf0 Size(c0)
	Unknown AnimGraphNode_BlendListByBo_6; //  0x1fdb0 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_28; //  0x1fe50 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_27; //  0x1ff30 Size(e0)
	Unknown AnimGraphNode_BlendListByEnum_12; //  0x20010 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_26; //  0x200c0 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_25; //  0x201a0 Size(e0)
	Unknown AnimGraphNode_BlendListByBo_5; //  0x20280 Size(a0)
	Unknown AnimGraphNode_BlendListByBoye_4; //  0x20320 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_24; //  0x203c0 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_23; //  0x204a0 Size(e0)
	Unknown AnimGraphNode_BlendListByBo_3; //  0x20580 Size(a0)
	Unknown AnimGraphNode_BlendSpacePlayer_22; //  0x20620 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_21; //  0x20700 Size(e0)
	Unknown AnimGraphNode_StateResult_4; //  0x207e0 Size(30)
	Unknown AnimGraphNode_SequencePlayer_59; //  0x20810 Size(78)
	Unknown AnimGraphNode_SequencePlayer_58; //  0x20888 Size(78)
	Unknown AnimGraphNode_TwoWayBlend_10; //  0x20900 Size(c8)
	Unknown AnimGraphNode_LayeredBoneBlend_13; //  0x209c8 Size(c0)
	Unknown AnimGraphNode_BlendSpacePlayer_20; //  0x20a88 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_57; //  0x20b68 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_12; //  0x20be0 Size(c0)
	Unknown AnimGraphNode_BlendSpacePlayer_19; //  0x20ca0 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_56; //  0x20d80 Size(78)
	Unknown AnimGraphNode_SequencePlayer_55; //  0x20df8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_54; //  0x20e70 Size(78)
	Unknown AnimGraphNode_SequencePlayer_53; //  0x20ee8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_52; //  0x20f60 Size(78)
	Unknown AnimGraphNode_SequencePlayer_51; //  0x20fd8 Size(78)
	Unknown AnimGraphNode_TwoWayBlend_9; //  0x21050 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_50; //  0x21118 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_11; //  0x21190 Size(c0)
	Unknown AnimGraphNode_BlendSpacePlayer_18; //  0x21250 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_49; //  0x21330 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_10; //  0x213a8 Size(c0)
	Unknown AnimGraphNode_BlendSpacePlayer_17; //  0x21468 Size(e0)
	Unknown AnimGraphNode_BlendListByBo_2; //  0x21548 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_48; //  0x215e8 Size(78)
	Unknown AnimGraphNode_TwoWayBlend_8; //  0x21660 Size(c8)
	Unknown AnimGraphNode_BlendSpacePlayer_16; //  0x21728 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_47; //  0x21808 Size(78)
	Unknown AnimGraphNode_TwoWayBlend_7; //  0x21880 Size(c8)
	Unknown AnimGraphNode_BlendSpacePlayer_15; //  0x21948 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_14; //  0x21a28 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_13; //  0x21b08 Size(e0)
	Unknown AnimGraphNode_ApplyAdditive_5; //  0x21be8 Size(c8)
	Unknown AnimGraphNode_ApplyAdditive_4; //  0x21cb0 Size(c8)
	Unknown AnimGraphNode_BlendListByEnum_11; //  0x21d78 Size(b0)
	Unknown AnimGraphNode_IdentityPose; //  0x21e28 Size(18)
	Unknown AnimGraphNode_ApplyAdditive_3; //  0x21e40 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_46; //  0x21f08 Size(78)
	Unknown AnimGraphNode_TwoWayBlend_6; //  0x21f80 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_45; //  0x22048 Size(78)
	Unknown AnimGraphNode_SequencePlayer_44; //  0x220c0 Size(78)
	Unknown AnimGraphNode_TwoWayBlend_5; //  0x22138 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_43; //  0x22200 Size(78)
	Unknown AnimGraphNode_TwoWayBlend_4; //  0x22278 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_42; //  0x22340 Size(78)
	Unknown AnimGraphNode_TwoWayBlend_3; //  0x223b8 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_41; //  0x22480 Size(78)
	Unknown AnimGraphNode_TwoWayBlend_2; //  0x224f8 Size(c8)
	Unknown AnimGraphNode_SequencePlayer_40; //  0x225c0 Size(78)
	Unknown AnimGraphNode_TwoWayBlend; //  0x22638 Size(c8)
	Unknown AnimGraphNode_BlendListByEnum_10; //  0x22700 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_39; //  0x227b0 Size(78)
	Unknown AnimGraphNode_BlendSpacePlayer_12; //  0x22828 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_11; //  0x22908 Size(e0)
	Unknown AnimGraphNode_LayeredBoneBlend_9; //  0x229e8 Size(c0)
	Unknown AnimGraphNode_BlendListByEnum_9; //  0x22aa8 Size(b0)
	Unknown AnimGraphNode_LayeredBoneBlend_8; //  0x22b58 Size(c0)
	Unknown AnimGraphNode_BlendSpacePlayer_10; //  0x22c18 Size(e0)
	Unknown AnimGraphNode_LayeredBoneBlend_7; //  0x22cf8 Size(c0)
	Unknown AnimGraphNode_BlendSpacePlayer_9; //  0x22db8 Size(e0)
	Unknown AnimGraphNode_BlendListByEnum_8; //  0x22e98 Size(b0)
	Unknown AnimGraphNode_BlendListByEnum_7; //  0x22f48 Size(b0)
	Unknown AnimGraphNode_BlendSpacePlayer_8; //  0x22ff8 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_7; //  0x230d8 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_6; //  0x231b8 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_5; //  0x23298 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_4; //  0x23378 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_3; //  0x23458 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer_2; //  0x23538 Size(e0)
	Unknown AnimGraphNode_BlendSpacePlayer; //  0x23618 Size(e0)
	Unknown AnimGraphNode_ApplyAdditive_2; //  0x236f8 Size(c8)
	Unknown AnimGraphNode_ApplyAdditive; //  0x237c0 Size(c8)
	Unknown AnimGraphNode_BlendListByBo; //  0x23888 Size(a0)
	Unknown AnimGraphNode_StateResult_3; //  0x23928 Size(30)
	Unknown AnimGraphNode_SequencePlayer_38; //  0x23958 Size(78)
	Unknown AnimGraphNode_SequencePlayer_37; //  0x239d0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_36; //  0x23a48 Size(78)
	Unknown AnimGraphNode_SequencePlayer_35; //  0x23ac0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_34; //  0x23b38 Size(78)
	Unknown AnimGraphNode_BlendListByInt_6; //  0x23bb0 Size(a0)
	Unknown AnimGraphNode_LayeredBoneBlend_6; //  0x23c50 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_33; //  0x23d10 Size(78)
	Unknown AnimGraphNode_SequencePlayer_32; //  0x23d88 Size(78)
	Unknown AnimGraphNode_SequencePlayer_31; //  0x23e00 Size(78)
	Unknown AnimGraphNode_SequencePlayer_30; //  0x23e78 Size(78)
	Unknown AnimGraphNode_SequencePlayer_29; //  0x23ef0 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_5; //  0x23f68 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_28; //  0x24028 Size(78)
	Unknown AnimGraphNode_SequencePlayer_27; //  0x240a0 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_4; //  0x24118 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_26; //  0x241d8 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend_3; //  0x24250 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_25; //  0x24310 Size(78)
	Unknown AnimGraphNode_SequencePlayer_24; //  0x24388 Size(78)
	Unknown AnimGraphNode_SequencePlayer_23; //  0x24400 Size(78)
	Unknown AnimGraphNode_SequencePlayer_22; //  0x24478 Size(78)
	Unknown AnimGraphNode_SequencePlayer_21; //  0x244f0 Size(78)
	Unknown AnimGraphNode_BlendListByInt_5; //  0x24568 Size(a0)
	Unknown AnimGraphNode_LayeredBoneBlend_2; //  0x24608 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_20; //  0x246c8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_19; //  0x24740 Size(78)
	Unknown AnimGraphNode_SequencePlayer_18; //  0x247b8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_17; //  0x24830 Size(78)
	Unknown AnimGraphNode_BlendListByInt_4; //  0x248a8 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_16; //  0x24948 Size(78)
	Unknown AnimGraphNode_SequencePlayer_15; //  0x249c0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_14; //  0x24a38 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x24ab0 Size(c0)
	Unknown AnimGraphNode_SequencePlayer_13; //  0x24b70 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_6; //  0x24be8 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_12; //  0x24c98 Size(78)
	Unknown AnimGraphNode_BlendListByEnum_5; //  0x24d10 Size(b0)
	Unknown AnimGraphNode_BlendListByEnum_4; //  0x24dc0 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_11; //  0x24e70 Size(78)
	Unknown AnimGraphNode_SequencePlayer_10; //  0x24ee8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_9; //  0x24f60 Size(78)
	Unknown AnimGraphNode_SequencePlayer_8; //  0x24fd8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_7; //  0x25050 Size(78)
	Unknown AnimGraphNode_BlendListByInt_3; //  0x250c8 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_6; //  0x25168 Size(78)
	Unknown AnimGraphNode_SequencePlayer_5; //  0x251e0 Size(78)
	Unknown AnimGraphNode_SequencePlayer_4; //  0x25258 Size(78)
	Unknown AnimGraphNode_BlendListByInt_2; //  0x252d0 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x25370 Size(78)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x253e8 Size(78)
	Unknown AnimGraphNode_SequencePlayer; //  0x25460 Size(78)
	Unknown AnimGraphNode_BlendListByInt; //  0x254d8 Size(a0)
	Unknown AnimGraphNode_BlendListByEnum_3; //  0x25578 Size(b0)
	Unknown AnimGraphNode_BlendListByEnum_2; //  0x25628 Size(b0)
	Unknown AnimGraphNode_Slot_5; //  0x256d8 Size(48)
	Unknown AnimGraphNode_StateResult_2; //  0x25720 Size(30)
	Unknown AnimGraphNode_StateMachine_2; //  0x25750 Size(b0)
	Unknown AnimGraphNode_StateResult; //  0x25800 Size(30)
	Unknown AnimGraphNode_StateMachine; //  0x25830 Size(b0)
	Unknown AnimGraphNode_SaveCachedPose_12; //  0x258e0 Size(b8)
	Unknown AnimGraphNode_SaveCachedPose_11; //  0x25998 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_23; //  0x25a50 Size(28)
	Unknown AnimGraphNode_UseCachedPose_22; //  0x25a78 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_10; //  0x25aa0 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_21; //  0x25b58 Size(28)
	Unknown AnimGraphNode_UseCachedPose_20; //  0x25b80 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_9; //  0x25ba8 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_19; //  0x25c60 Size(28)
	Unknown AnimGraphNode_UseCachedPose_18; //  0x25c88 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_8; //  0x25cb0 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_17; //  0x25d68 Size(28)
	Unknown AnimGraphNode_UseCachedPose_16; //  0x25d90 Size(28)
	Unknown AnimGraphNode_UseCachedPose_15; //  0x25db8 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_7; //  0x25de0 Size(b8)
	Unknown AnimGraphNode_SaveCachedPose_6; //  0x25e98 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_14; //  0x25f50 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_5; //  0x25f78 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_13; //  0x26030 Size(28)
	Unknown AnimGraphNode_UseCachedPose_12; //  0x26058 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_4; //  0x26080 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_11; //  0x26138 Size(28)
	Unknown AnimGraphNode_UseCachedPose_10; //  0x26160 Size(28)
	Unknown AnimGraphNode_UseCachedPose_9; //  0x26188 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_3; //  0x261b0 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_8; //  0x26268 Size(28)
	Unknown AnimGraphNode_UseCachedPose_7; //  0x26290 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_2; //  0x262b8 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_6; //  0x26370 Size(28)
	Unknown AnimGraphNode_UseCachedPose_5; //  0x26398 Size(28)
	Unknown AnimGraphNode_Slot_4; //  0x263c0 Size(48)
	Unknown AnimGraphNode_SaveCachedPose; //  0x26408 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_4; //  0x264c0 Size(28)
	Unknown AnimGraphNode_UseCachedPose_3; //  0x264e8 Size(28)
	Unknown AnimGraphNode_Slot_3; //  0x26510 Size(48)
	Unknown AnimGraphNode_Slot_2; //  0x26558 Size(48)
	Unknown AnimGraphNode_BlendListByEnum; //  0x265a0 Size(b0)
	Unknown AnimGraphNode_UseCachedPose_2; //  0x26650 Size(28)
	Unknown AnimGraphNode_UseCachedPose; //  0x26678 Size(28)
	Unknown AnimGraphNode_Slot; //  0x266a0 Size(48)
	Unknown StoppingAnimation; //  0x266e8 Size(8)
	struct FName AdditiveLandingSlot; //  0x266f0 Size(8)
	float StoppingDirection; //  0x266f8 Size(4)
	Unknown CameraLagTimer; //  0x26700 Size(8)
	Unknown SavedCameraArmLocation; //  0x26708 Size(c)
	char TestSprinting; //  0x26714 Size(1)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_BlendListByEnum; //  0x368 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_4; //  0x418 Size(78)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x490 Size(78)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x508 Size(78)
	Unknown AnimGraphNode_SequencePlayer; //  0x580 Size(78)
	Unknown AnimGraphNode_Slot_4; //  0x5f8 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x640 Size(c8)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x708 Size(c0)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x7c8 Size(18)
	Unknown AnimGraphNode_Slot_3; //  0x7e0 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x828 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x840 Size(48)
	Unknown AnimGraphNode_Slot; //  0x888 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x8d0 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x8e8 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_Slot_3; //  0x368 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x3b0 Size(c8)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x478 Size(18)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x490 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x4a8 Size(48)
	Unknown AnimGraphNode_Slot; //  0x4f0 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x538 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x550 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_Slot_3; //  0x368 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x3b0 Size(c8)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x478 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x490 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x4d8 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x4f0 Size(a0)
	Unknown AnimGraphNode_Slot; //  0x590 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x5d8 Size(18)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_Slot_3; //  0x368 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x3b0 Size(c8)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x478 Size(18)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x490 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x4a8 Size(48)
	Unknown AnimGraphNode_Slot; //  0x4f0 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x538 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x550 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_BlendListByEnum; //  0x368 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x418 Size(78)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x490 Size(78)
	Unknown AnimGraphNode_SequencePlayer; //  0x508 Size(78)
	Unknown AnimGraphNode_Slot_4; //  0x580 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x5c8 Size(c8)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x690 Size(c0)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x750 Size(18)
	Unknown AnimGraphNode_Slot_3; //  0x768 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x7b0 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x7c8 Size(48)
	Unknown AnimGraphNode_Slot; //  0x810 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x858 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x870 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_BlendListByEnum; //  0x368 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x418 Size(78)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x490 Size(78)
	Unknown AnimGraphNode_SequencePlayer; //  0x508 Size(78)
	Unknown AnimGraphNode_Slot_4; //  0x580 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x5c8 Size(c8)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x690 Size(c0)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x750 Size(18)
	Unknown AnimGraphNode_Slot_3; //  0x768 Size(48)
	Unknown AnimGraphNode_Slot_2; //  0x7b0 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x7f8 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x810 Size(a0)
	Unknown AnimGraphNode_Slot; //  0x8b0 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x8f8 Size(18)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_LocalToComponentSpace; //  0x368 Size(20)
	Unknown AnimGraphNode_ComponentToLo; //  0x388 Size(20)
	Unknown AnimGraphNode_ModifyBone_3; //  0x3a8 Size(108)
	Unknown AnimGraphNode_BlendListByBoen; //  0x4b0 Size(a0)
	Unknown AnimGraphNode_ModifyBone_2; //  0x550 Size(108)
	Unknown AnimGraphNode_Slot_5; //  0x658 Size(48)
	Unknown AnimGraphNode_ModifyBone; //  0x6a0 Size(108)
	Unknown AnimGraphNode_TwoWayBlend_2; //  0x7a8 Size(c8)
	Unknown AnimGraphNode_Slot_4; //  0x870 Size(48)
	Unknown AnimGraphNode_Slot_3; //  0x8b8 Size(48)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x900 Size(c0)
	Unknown AnimGraphNode_Slot_2; //  0x9c0 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0xa08 Size(18)
	Unknown AnimGraphNode_TwoWayBlend; //  0xa20 Size(c8)
	Unknown AnimGraphNode_Slot; //  0xae8 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0xb30 Size(18)
	Unknown AnimGraphNode_SaveCachedPose_3; //  0xb48 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_6; //  0xc00 Size(28)
	Unknown AnimGraphNode_UseCachedPose_5; //  0xc28 Size(28)
	Unknown AnimGraphNode_UseCachedPose_4; //  0xc50 Size(28)
	Unknown AnimGraphNode_SaveCachedPose_2; //  0xc78 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_3; //  0xd30 Size(28)
	Unknown AnimGraphNode_SaveCachedPose; //  0xd58 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_2; //  0xe10 Size(28)
	Unknown AnimGraphNode_UseCachedPose; //  0xe38 Size(28)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_BlendListByEnum; //  0x368 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x418 Size(78)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x490 Size(78)
	Unknown AnimGraphNode_SequencePlayer; //  0x508 Size(78)
	Unknown AnimGraphNode_Slot_4; //  0x580 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x5c8 Size(c8)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x690 Size(c0)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x750 Size(18)
	Unknown AnimGraphNode_Slot_3; //  0x768 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x7b0 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x7c8 Size(48)
	Unknown AnimGraphNode_Slot; //  0x810 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x858 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x870 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_Slot_3; //  0x368 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x3b0 Size(c8)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x478 Size(18)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x490 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x4a8 Size(48)
	Unknown AnimGraphNode_Slot; //  0x4f0 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x538 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x550 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_BlendListByEnum; //  0x368 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x418 Size(78)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x490 Size(78)
	Unknown AnimGraphNode_SequencePlayer; //  0x508 Size(78)
	Unknown AnimGraphNode_Slot_4; //  0x580 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x5c8 Size(c8)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x690 Size(c0)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x750 Size(18)
	Unknown AnimGraphNode_Slot_3; //  0x768 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x7b0 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x7c8 Size(48)
	Unknown AnimGraphNode_Slot; //  0x810 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x858 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x870 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_BlendListByEnum; //  0x368 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x418 Size(78)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x490 Size(78)
	Unknown AnimGraphNode_SequencePlayer; //  0x508 Size(78)
	Unknown AnimGraphNode_Slot_4; //  0x580 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x5c8 Size(c8)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x690 Size(c0)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x750 Size(18)
	Unknown AnimGraphNode_Slot_3; //  0x768 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x7b0 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x7c8 Size(48)
	Unknown AnimGraphNode_Slot; //  0x810 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x858 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x870 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_BlendListByEnum; //  0x368 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x418 Size(78)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x490 Size(78)
	Unknown AnimGraphNode_SequencePlayer; //  0x508 Size(78)
	Unknown AnimGraphNode_Slot_4; //  0x580 Size(48)
	Unknown AnimGraphNode_Slot_3; //  0x5c8 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x610 Size(c8)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x6d8 Size(c0)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x798 Size(18)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x7b0 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x7c8 Size(48)
	Unknown AnimGraphNode_Slot; //  0x810 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x858 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x870 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_BlendListByEnum; //  0x368 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x418 Size(78)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x490 Size(78)
	Unknown AnimGraphNode_SequencePlayer; //  0x508 Size(78)
	Unknown AnimGraphNode_Slot_4; //  0x580 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x5c8 Size(c8)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x690 Size(c0)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x750 Size(18)
	Unknown AnimGraphNode_Slot_3; //  0x768 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x7b0 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x7c8 Size(48)
	Unknown AnimGraphNode_Slot; //  0x810 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x858 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x870 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_Slot_3; //  0x368 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x3b0 Size(c8)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x478 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x490 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x4d8 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x4f0 Size(a0)
	Unknown AnimGraphNode_Slot; //  0x590 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x5d8 Size(18)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_BlendListByEnum; //  0x368 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x418 Size(78)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x490 Size(78)
	Unknown AnimGraphNode_SequencePlayer; //  0x508 Size(78)
	Unknown AnimGraphNode_Slot_4; //  0x580 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x5c8 Size(c8)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x690 Size(c0)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x750 Size(18)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x768 Size(18)
	Unknown AnimGraphNode_Slot_3; //  0x780 Size(48)
	Unknown AnimGraphNode_Slot_2; //  0x7c8 Size(48)
	Unknown AnimGraphNode_Slot; //  0x810 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x858 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x870 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_Slot_3; //  0x368 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x3b0 Size(c8)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x478 Size(18)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x490 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x4a8 Size(48)
	Unknown AnimGraphNode_Slot; //  0x4f0 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x538 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x550 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_Slot_3; //  0x368 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x3b0 Size(c8)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x478 Size(18)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x490 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x4a8 Size(48)
	Unknown AnimGraphNode_Slot; //  0x4f0 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x538 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x550 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_Slot_3; //  0x368 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x3b0 Size(c8)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x478 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x490 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x4d8 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x4f0 Size(a0)
	Unknown AnimGraphNode_Slot; //  0x590 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x5d8 Size(18)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_BlendListByEnum; //  0x368 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x418 Size(78)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x490 Size(78)
	Unknown AnimGraphNode_SequencePlayer; //  0x508 Size(78)
	Unknown AnimGraphNode_Slot_4; //  0x580 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x5c8 Size(c8)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x690 Size(c0)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x750 Size(18)
	Unknown AnimGraphNode_Slot_3; //  0x768 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x7b0 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x7c8 Size(48)
	Unknown AnimGraphNode_Slot; //  0x810 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x858 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x870 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_BlendListByEnum; //  0x368 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x418 Size(78)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x490 Size(78)
	Unknown AnimGraphNode_SequencePlayer; //  0x508 Size(78)
	Unknown AnimGraphNode_Slot_4; //  0x580 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x5c8 Size(c8)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x690 Size(c0)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x750 Size(18)
	Unknown AnimGraphNode_Slot_3; //  0x768 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x7b0 Size(18)
	Unknown AnimGraphNode_LocalRefPose; //  0x7c8 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x7e0 Size(48)
	Unknown AnimGraphNode_Slot; //  0x828 Size(48)
	Unknown AnimGraphNode_BlendListByBo; //  0x870 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_Slot_3; //  0x368 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x3b0 Size(c8)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x478 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x490 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x4d8 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x4f0 Size(a0)
	Unknown AnimGraphNode_Slot; //  0x590 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x5d8 Size(18)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_BlendListByEnum; //  0x338 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x3e8 Size(78)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x460 Size(78)
	Unknown AnimGraphNode_SequencePlayer; //  0x4d8 Size(78)
	Unknown AnimGraphNode_Slot_4; //  0x550 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x598 Size(c8)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x660 Size(c0)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x720 Size(18)
	Unknown AnimGraphNode_Root; //  0x738 Size(30)
	Unknown AnimGraphNode_Slot_3; //  0x768 Size(48)
	Unknown AnimGraphNode_Slot_2; //  0x7b0 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x7f8 Size(18)
	Unknown AnimGraphNode_LocalRefPose; //  0x810 Size(18)
	Unknown AnimGraphNode_Slot; //  0x828 Size(48)
	Unknown AnimGraphNode_BlendListByBo; //  0x870 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_Slot_4; //  0x368 Size(48)
	Unknown AnimGraphNode_BlendListByEnum; //  0x3b0 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x460 Size(78)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x4d8 Size(78)
	Unknown AnimGraphNode_SequencePlayer; //  0x550 Size(78)
	Unknown AnimGraphNode_TwoWayBlend; //  0x5c8 Size(c8)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x690 Size(c0)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x750 Size(18)
	Unknown AnimGraphNode_Slot_3; //  0x768 Size(48)
	Unknown AnimGraphNode_Slot_2; //  0x7b0 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x7f8 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x810 Size(a0)
	Unknown AnimGraphNode_Slot; //  0x8b0 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x8f8 Size(18)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelVehicleAnimInstance {
	Unknown UberGraphFrame; //  0xa20 Size(8)
	Unknown AnimGraphNode_ComponentToLo_3; //  0xa28 Size(20)
	Unknown AnimGraphNode_CopyBone_12; //  0xa48 Size(f0)
	Unknown AnimGraphNode_LookAt_4; //  0xb40 Size(1b0)
	Unknown AnimGraphNode_CopyBone_11; //  0xcf0 Size(f0)
	Unknown AnimGraphNode_LookAt_3; //  0xde0 Size(1b0)
	Unknown AnimGraphNode_CopyBone_10; //  0xf90 Size(f0)
	Unknown AnimGraphNode_MeshRefPose_2; //  0x1080 Size(10)
	Unknown AnimGraphNode_CopyBone_9; //  0x1090 Size(f0)
	Unknown AnimGraphNode_BlendListByBo_2; //  0x1180 Size(a0)
	Unknown AnimGraphNode_CopyBone_8; //  0x1220 Size(f0)
	Unknown AnimGraphNode_ComponentToLo_2; //  0x1310 Size(20)
	Unknown AnimGraphNode_CopyBone_7; //  0x1330 Size(f0)
	Unknown AnimGraphNode_Root; //  0x1420 Size(30)
	Unknown AnimGraphNode_CopyBone_6; //  0x1450 Size(f0)
	Unknown AnimGraphNode_CopyBone_5; //  0x1540 Size(f0)
	Unknown AnimGraphNode_CopyBone_4; //  0x1630 Size(f0)
	Unknown AnimGraphNode_CopyBone_3; //  0x1720 Size(f0)
	Unknown AnimGraphNode_CopyBone_2; //  0x1810 Size(f0)
	Unknown AnimGraphNode_CopyBone; //  0x1900 Size(f0)
	Unknown AnimGraphNode_RotationMultiplier_2; //  0x19f0 Size(f0)
	Unknown AnimGraphNode_LookAt_2; //  0x1ae0 Size(1b0)
	Unknown AnimGraphNode_RotationMultiplier; //  0x1c90 Size(f0)
	Unknown AnimGraphNode_LookAt; //  0x1d80 Size(1b0)
	Unknown AnimGraphNode_TransitionResult_12; //  0x1f30 Size(28)
	Unknown AnimGraphNode_TransitionResult_11; //  0x1f58 Size(28)
	Unknown AnimGraphNode_TransitionResult_10; //  0x1f80 Size(28)
	Unknown AnimGraphNode_TransitionResult_9; //  0x1fa8 Size(28)
	Unknown AnimGraphNode_TransitionResult_8; //  0x1fd0 Size(28)
	Unknown AnimGraphNode_TransitionResult_7; //  0x1ff8 Size(28)
	Unknown AnimGraphNode_SequencePlayer_6; //  0x2020 Size(78)
	Unknown AnimGraphNode_StateResult_6; //  0x2098 Size(30)
	Unknown AnimGraphNode_SequencePlayer_5; //  0x20c8 Size(78)
	Unknown AnimGraphNode_StateResult_5; //  0x2140 Size(30)
	Unknown AnimGraphNode_SequencePlayer_4; //  0x2170 Size(78)
	Unknown AnimGraphNode_StateResult_4; //  0x21e8 Size(30)
	Unknown AnimGraphNode_StateMachine_2; //  0x2218 Size(b0)
	Unknown AnimGraphNode_SaveCachedPose_2; //  0x22c8 Size(b8)
	Unknown AnimGraphNode_LocalToComponentSpace; //  0x2380 Size(20)
	Unknown AnimGraphNode_LayeredBoneBlend_2; //  0x23a0 Size(c0)
	Unknown AnimGraphNode_UseCachedPose_4; //  0x2460 Size(28)
	Unknown AnimGraphNode_TransitionResult_6; //  0x2488 Size(28)
	Unknown AnimGraphNode_TransitionResult_5; //  0x24b0 Size(28)
	Unknown AnimGraphNode_TransitionResult_4; //  0x24d8 Size(28)
	Unknown AnimGraphNode_TransitionResult_3; //  0x2500 Size(28)
	Unknown AnimGraphNode_TransitionResult_2; //  0x2528 Size(28)
	Unknown AnimGraphNode_TransitionResult; //  0x2550 Size(28)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x2578 Size(78)
	Unknown AnimGraphNode_StateResult_3; //  0x25f0 Size(30)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x2620 Size(78)
	Unknown AnimGraphNode_StateResult_2; //  0x2698 Size(30)
	Unknown AnimGraphNode_SequencePlayer; //  0x26c8 Size(78)
	Unknown AnimGraphNode_StateResult; //  0x2740 Size(30)
	Unknown AnimGraphNode_StateMachine; //  0x2770 Size(b0)
	Unknown AnimGraphNode_BlendListByBo; //  0x2820 Size(a0)
	Unknown AnimGraphNode_TwoWayBlend; //  0x28c0 Size(c8)
	Unknown AnimGraphNode_SaveCachedPose; //  0x2988 Size(b8)
	Unknown AnimGraphNode_UseCachedPose_3; //  0x2a40 Size(28)
	Unknown AnimGraphNode_UseCachedPose_2; //  0x2a68 Size(28)
	Unknown AnimGraphNode_UseCachedPose; //  0x2a90 Size(28)
	Unknown AnimGraphNode_WheelHandler; //  0x2ab8 Size(e0)
	Unknown AnimGraphNode_MeshRefPose; //  0x2b98 Size(10)
	Unknown AnimGraphNode_ComponentToLo; //  0x2ba8 Size(20)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x2bc8 Size(c0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelVehicleAnimInstance {
	Unknown UberGraphFrame; //  0xa20 Size(8)
	Unknown AnimGraphNode_Root; //  0xa28 Size(30)
	Unknown AnimGraphNode_TransitionResult_9; //  0xa58 Size(28)
	Unknown AnimGraphNode_TransitionResult_8; //  0xa80 Size(28)
	Unknown AnimGraphNode_TransitionResult_7; //  0xaa8 Size(28)
	Unknown AnimGraphNode_TransitionResult_6; //  0xad0 Size(28)
	Unknown AnimGraphNode_TransitionResult_5; //  0xaf8 Size(28)
	Unknown AnimGraphNode_TransitionResult_4; //  0xb20 Size(28)
	Unknown AnimGraphNode_TransitionResult_3; //  0xb48 Size(28)
	Unknown AnimGraphNode_TransitionResult_2; //  0xb70 Size(28)
	Unknown AnimGraphNode_SequencePlayer_6; //  0xb98 Size(78)
	Unknown AnimGraphNode_StateResult_5; //  0xc10 Size(30)
	Unknown AnimGraphNode_SequencePlayer_5; //  0xc40 Size(78)
	Unknown AnimGraphNode_StateResult_4; //  0xcb8 Size(30)
	Unknown AnimGraphNode_SequencePlayer_4; //  0xce8 Size(78)
	Unknown AnimGraphNode_StateResult_3; //  0xd60 Size(30)
	Unknown AnimGraphNode_TransitionResult; //  0xd90 Size(28)
	Unknown AnimGraphNode_ComponentToLo_4; //  0xdb8 Size(20)
	Unknown AnimGraphNode_MeshRefPose_2; //  0xdd8 Size(10)
	Unknown AnimGraphNode_BlendListByBoul_2; //  0xde8 Size(a0)
	Unknown AnimGraphNode_SequencePlayer_3; //  0xe88 Size(78)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0xf00 Size(c0)
	Unknown AnimGraphNode_ComponentToLo_3; //  0xfc0 Size(20)
	Unknown AnimGraphNode_LocalToComponentSpace_2; //  0xfe0 Size(20)
	Unknown AnimGraphNode_ModifyBone_2; //  0x1000 Size(108)
	Unknown AnimGraphNode_WheelHandler_2; //  0x1108 Size(e0)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x11e8 Size(78)
	Unknown AnimGraphNode_StateResult_2; //  0x1260 Size(30)
	Unknown AnimGraphNode_CopyBone_12; //  0x1290 Size(f0)
	Unknown AnimGraphNode_CopyBone_11; //  0x1380 Size(f0)
	Unknown AnimGraphNode_CopyBone_10; //  0x1470 Size(f0)
	Unknown AnimGraphNode_CopyBone_9; //  0x1560 Size(f0)
	Unknown AnimGraphNode_CopyBone_8; //  0x1650 Size(f0)
	Unknown AnimGraphNode_CopyBone_7; //  0x1740 Size(f0)
	Unknown AnimGraphNode_CopyBone_6; //  0x1830 Size(f0)
	Unknown AnimGraphNode_CopyBone_5; //  0x1920 Size(f0)
	Unknown AnimGraphNode_CopyBone_4; //  0x1a10 Size(f0)
	Unknown AnimGraphNode_CopyBone_3; //  0x1b00 Size(f0)
	Unknown AnimGraphNode_CopyBone_2; //  0x1bf0 Size(f0)
	Unknown AnimGraphNode_CopyBone; //  0x1ce0 Size(f0)
	Unknown AnimGraphNode_ComponentToLo_2; //  0x1dd0 Size(20)
	Unknown AnimGraphNode_MeshRefPose; //  0x1df0 Size(10)
	Unknown AnimGraphNode_BlendListByBor; //  0x1e00 Size(a0)
	Unknown AnimGraphNode_AnimDynamics; //  0x1ea0 Size(440)
	Unknown AnimGraphNode_LocalToComponentSpace; //  0x22e0 Size(20)
	Unknown AnimGraphNode_ModifyBone; //  0x2300 Size(108)
	Unknown AnimGraphNode_ComponentToLo; //  0x2408 Size(20)
	Unknown AnimGraphNode_WheelHandler; //  0x2428 Size(e0)
	Unknown AnimGraphNode_SequencePlayer; //  0x2508 Size(78)
	Unknown AnimGraphNode_StateResult; //  0x2580 Size(30)
	Unknown AnimGraphNode_StateMachine; //  0x25b0 Size(b0)
	char bIsAmphibiousMode; //  0x2660 Size(1)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelVehicleAnimInstance {
	Unknown UberGraphFrame; //  0xa20 Size(8)
	Unknown AnimGraphNode_ModifyBone; //  0xa28 Size(108)
	Unknown AnimGraphNode_BlendListByBo; //  0xb30 Size(a0)
	Unknown AnimGraphNode_MeshRefPose_2; //  0xbd0 Size(10)
	Unknown AnimGraphNode_ComponentToLo_2; //  0xbe0 Size(20)
	Unknown AnimGraphNode_CopyBone_12; //  0xc00 Size(f0)
	Unknown AnimGraphNode_ComponentToLo; //  0xcf0 Size(20)
	Unknown AnimGraphNode_CopyBone_11; //  0xd10 Size(f0)
	Unknown AnimGraphNode_WheelHandler; //  0xe00 Size(e0)
	Unknown AnimGraphNode_CopyBone_10; //  0xee0 Size(f0)
	Unknown AnimGraphNode_MeshRefPose; //  0xfd0 Size(10)
	Unknown AnimGraphNode_CopyBone_9; //  0xfe0 Size(f0)
	Unknown AnimGraphNode_Root; //  0x10d0 Size(30)
	Unknown AnimGraphNode_CopyBone_8; //  0x1100 Size(f0)
	Unknown AnimGraphNode_CopyBone_7; //  0x11f0 Size(f0)
	Unknown AnimGraphNode_CopyBone_6; //  0x12e0 Size(f0)
	Unknown AnimGraphNode_CopyBone_5; //  0x13d0 Size(f0)
	Unknown AnimGraphNode_CopyBone_4; //  0x14c0 Size(f0)
	Unknown AnimGraphNode_CopyBone_3; //  0x15b0 Size(f0)
	Unknown AnimGraphNode_CopyBone_2; //  0x16a0 Size(f0)
	Unknown AnimGraphNode_CopyBone; //  0x1790 Size(f0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelVehicleAnimInstance {
	Unknown UberGraphFrame; //  0xa20 Size(8)
	Unknown AnimGraphNode_LookAt_6; //  0xa30 Size(1b0)
	Unknown AnimGraphNode_CopyBone_12; //  0xbe0 Size(f0)
	Unknown AnimGraphNode_LookAt_5; //  0xcd0 Size(1b0)
	Unknown AnimGraphNode_CopyBone_11; //  0xe80 Size(f0)
	Unknown AnimGraphNode_LookAt_4; //  0xf70 Size(1b0)
	Unknown AnimGraphNode_CopyBone_10; //  0x1120 Size(f0)
	Unknown AnimGraphNode_CopyBone_9; //  0x1210 Size(f0)
	Unknown AnimGraphNode_LookAt_3; //  0x1300 Size(1b0)
	Unknown AnimGraphNode_CopyBone_8; //  0x14b0 Size(f0)
	Unknown AnimGraphNode_CopyBone_7; //  0x15a0 Size(f0)
	Unknown AnimGraphNode_ComponentToLo_3; //  0x1690 Size(20)
	Unknown AnimGraphNode_MeshRefPose_2; //  0x16b0 Size(10)
	Unknown AnimGraphNode_BlendListByBo_2; //  0x16c0 Size(a0)
	Unknown AnimGraphNode_CopyBone_6; //  0x1760 Size(f0)
	Unknown AnimGraphNode_ComponentToLo_2; //  0x1850 Size(20)
	Unknown AnimGraphNode_CopyBone_5; //  0x1870 Size(f0)
	Unknown AnimGraphNode_Root; //  0x1960 Size(30)
	Unknown AnimGraphNode_CopyBone_4; //  0x1990 Size(f0)
	Unknown AnimGraphNode_CopyBone_3; //  0x1a80 Size(f0)
	Unknown AnimGraphNode_CopyBone_2; //  0x1b70 Size(f0)
	Unknown AnimGraphNode_CopyBone; //  0x1c60 Size(f0)
	Unknown AnimGraphNode_RotationMultiplier_2; //  0x1d50 Size(f0)
	Unknown AnimGraphNode_LookAt_2; //  0x1e40 Size(1b0)
	Unknown AnimGraphNode_RotationMultiplier; //  0x1ff0 Size(f0)
	Unknown AnimGraphNode_LookAt; //  0x20e0 Size(1b0)
	Unknown AnimGraphNode_TransitionResult_12; //  0x2290 Size(28)
	Unknown AnimGraphNode_TransitionResult_11; //  0x22b8 Size(28)
	Unknown AnimGraphNode_TransitionResult_10; //  0x22e0 Size(28)
	Unknown AnimGraphNode_TransitionResult_9; //  0x2308 Size(28)
	Unknown AnimGraphNode_TransitionResult_8; //  0x2330 Size(28)
	Unknown AnimGraphNode_TransitionResult_7; //  0x2358 Size(28)
	Unknown AnimGraphNode_SequencePlayer_6; //  0x2380 Size(78)
	Unknown AnimGraphNode_StateResult_6; //  0x23f8 Size(30)
	Unknown AnimGraphNode_SequencePlayer_5; //  0x2428 Size(78)
	Unknown AnimGraphNode_StateResult_5; //  0x24a0 Size(30)
	Unknown AnimGraphNode_SequencePlayer_4; //  0x24d0 Size(78)
	Unknown AnimGraphNode_StateResult_4; //  0x2548 Size(30)
	Unknown AnimGraphNode_StateMachine_2; //  0x2578 Size(b0)
	Unknown AnimGraphNode_LocalToComponentSpace; //  0x2628 Size(20)
	Unknown AnimGraphNode_SaveCachedPose_2; //  0x2648 Size(b8)
	Unknown AnimGraphNode_TransitionResult_6; //  0x2700 Size(28)
	Unknown AnimGraphNode_TransitionResult_5; //  0x2728 Size(28)
	Unknown AnimGraphNode_TransitionResult_4; //  0x2750 Size(28)
	Unknown AnimGraphNode_TransitionResult_3; //  0x2778 Size(28)
	Unknown AnimGraphNode_TransitionResult_2; //  0x27a0 Size(28)
	Unknown AnimGraphNode_TransitionResult; //  0x27c8 Size(28)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x27f0 Size(78)
	Unknown AnimGraphNode_StateResult_3; //  0x2868 Size(30)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x2898 Size(78)
	Unknown AnimGraphNode_StateResult_2; //  0x2910 Size(30)
	Unknown AnimGraphNode_SequencePlayer; //  0x2940 Size(78)
	Unknown AnimGraphNode_StateResult; //  0x29b8 Size(30)
	Unknown AnimGraphNode_StateMachine; //  0x29e8 Size(b0)
	Unknown AnimGraphNode_SaveCachedPose; //  0x2a98 Size(b8)
	Unknown AnimGraphNode_LayeredBoneBlend_2; //  0x2b50 Size(c0)
	Unknown AnimGraphNode_UseCachedPose_4; //  0x2c10 Size(28)
	Unknown AnimGraphNode_BlendListByBo; //  0x2c38 Size(a0)
	Unknown AnimGraphNode_TwoWayBlend; //  0x2cd8 Size(c8)
	Unknown AnimGraphNode_UseCachedPose_3; //  0x2da0 Size(28)
	Unknown AnimGraphNode_UseCachedPose_2; //  0x2dc8 Size(28)
	Unknown AnimGraphNode_UseCachedPose; //  0x2df0 Size(28)
	Unknown AnimGraphNode_WheelHandler; //  0x2e18 Size(e0)
	Unknown AnimGraphNode_MeshRefPose; //  0x2ef8 Size(10)
	Unknown AnimGraphNode_ComponentToLo; //  0x2f08 Size(20)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x2f28 Size(c0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelVehicleAnimInstance {
	Unknown UberGraphFrame; //  0xa20 Size(8)
	Unknown AnimGraphNode_Root; //  0xa28 Size(30)
	Unknown AnimGraphNode_MeshRefPose_2; //  0xa58 Size(10)
	Unknown AnimGraphNode_ComponentToLo_2; //  0xa68 Size(20)
	Unknown AnimGraphNode_ModifyBone; //  0xa88 Size(108)
	Unknown AnimGraphNode_BlendListByBo; //  0xb90 Size(a0)
	Unknown AnimGraphNode_MeshRefPose; //  0xc30 Size(10)
	Unknown AnimGraphNode_ComponentToLo; //  0xc40 Size(20)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// AnimBlueprintGeneratedClass AB.AB
struct UAB : UBravoHotelVehicleAnimInstance {
	Unknown UberGraphFrame; //  0xa20 Size(8)
	Unknown AnimGraphNode_ComponentToLo_3; //  0xa28 Size(20)
	Unknown AnimGraphNode_CopyBone_14; //  0xa48 Size(f0)
	Unknown AnimGraphNode_LookAt_6; //  0xb40 Size(1b0)
	Unknown AnimGraphNode_CopyBone_13; //  0xcf0 Size(f0)
	Unknown AnimGraphNode_MeshRefPose_2; //  0xde0 Size(10)
	Unknown AnimGraphNode_CopyBone_12; //  0xdf0 Size(f0)
	Unknown AnimGraphNode_LookAt_5; //  0xee0 Size(1b0)
	Unknown AnimGraphNode_CopyBone_11; //  0x1090 Size(f0)
	Unknown AnimGraphNode_BlendListByBo_2; //  0x1180 Size(a0)
	Unknown AnimGraphNode_CopyBone_10; //  0x1220 Size(f0)
	Unknown AnimGraphNode_LookAt_4; //  0x1310 Size(1b0)
	Unknown AnimGraphNode_CopyBone_9; //  0x14c0 Size(f0)
	Unknown AnimGraphNode_CopyBone_8; //  0x15b0 Size(f0)
	Unknown AnimGraphNode_LookAt_3; //  0x16a0 Size(1b0)
	Unknown AnimGraphNode_CopyBone_7; //  0x1850 Size(f0)
	Unknown AnimGraphNode_CopyBone_6; //  0x1940 Size(f0)
	Unknown AnimGraphNode_ComponentToLo_2; //  0x1a30 Size(20)
	Unknown AnimGraphNode_CopyBone_5; //  0x1a50 Size(f0)
	Unknown AnimGraphNode_Root; //  0x1b40 Size(30)
	Unknown AnimGraphNode_CopyBone_4; //  0x1b70 Size(f0)
	Unknown AnimGraphNode_CopyBone_3; //  0x1c60 Size(f0)
	Unknown AnimGraphNode_CopyBone_2; //  0x1d50 Size(f0)
	Unknown AnimGraphNode_CopyBone; //  0x1e40 Size(f0)
	Unknown AnimGraphNode_RotationMultiplier_2; //  0x1f30 Size(f0)
	Unknown AnimGraphNode_LookAt_2; //  0x2020 Size(1b0)
	Unknown AnimGraphNode_RotationMultiplier; //  0x21d0 Size(f0)
	Unknown AnimGraphNode_LookAt; //  0x22c0 Size(1b0)
	Unknown AnimGraphNode_TransitionResult_12; //  0x2470 Size(28)
	Unknown AnimGraphNode_TransitionResult_11; //  0x2498 Size(28)
	Unknown AnimGraphNode_TransitionResult_10; //  0x24c0 Size(28)
	Unknown AnimGraphNode_TransitionResult_9; //  0x24e8 Size(28)
	Unknown AnimGraphNode_TransitionResult_8; //  0x2510 Size(28)
	Unknown AnimGraphNode_TransitionResult_7; //  0x2538 Size(28)
	Unknown AnimGraphNode_SequencePlayer_6; //  0x2560 Size(78)
	Unknown AnimGraphNode_StateResult_6; //  0x25d8 Size(30)
	Unknown AnimGraphNode_SequencePlayer_5; //  0x2608 Size(78)
	Unknown AnimGraphNode_StateResult_5; //  0x2680 Size(30)
	Unknown AnimGraphNode_SequencePlayer_4; //  0x26b0 Size(78)
	Unknown AnimGraphNode_StateResult_4; //  0x2728 Size(30)
	Unknown AnimGraphNode_StateMachine_2; //  0x2758 Size(b0)
	Unknown AnimGraphNode_SaveCachedPose_2; //  0x2808 Size(b8)
	Unknown AnimGraphNode_LocalToComponentSpace; //  0x28c0 Size(20)
	Unknown AnimGraphNode_TransitionResult_6; //  0x28e0 Size(28)
	Unknown AnimGraphNode_TransitionResult_5; //  0x2908 Size(28)
	Unknown AnimGraphNode_TransitionResult_4; //  0x2930 Size(28)
	Unknown AnimGraphNode_TransitionResult_3; //  0x2958 Size(28)
	Unknown AnimGraphNode_TransitionResult_2; //  0x2980 Size(28)
	Unknown AnimGraphNode_TransitionResult; //  0x29a8 Size(28)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x29d0 Size(78)
	Unknown AnimGraphNode_StateResult_3; //  0x2a48 Size(30)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x2a78 Size(78)
	Unknown AnimGraphNode_StateResult_2; //  0x2af0 Size(30)
	Unknown AnimGraphNode_SequencePlayer; //  0x2b20 Size(78)
	Unknown AnimGraphNode_StateResult; //  0x2b98 Size(30)
	Unknown AnimGraphNode_StateMachine; //  0x2bc8 Size(b0)
	Unknown AnimGraphNode_SaveCachedPose; //  0x2c78 Size(b8)
	Unknown AnimGraphNode_LayeredBoneBlend_2; //  0x2d30 Size(c0)
	Unknown AnimGraphNode_UseCachedPose_4; //  0x2df0 Size(28)
	Unknown AnimGraphNode_BlendListByBo; //  0x2e18 Size(a0)
	Unknown AnimGraphNode_TwoWayBlend; //  0x2eb8 Size(c8)
	Unknown AnimGraphNode_UseCachedPose_3; //  0x2f80 Size(28)
	Unknown AnimGraphNode_UseCachedPose_2; //  0x2fa8 Size(28)
	Unknown AnimGraphNode_UseCachedPose; //  0x2fd0 Size(28)
	Unknown AnimGraphNode_WheelHandler; //  0x2ff8 Size(e0)
	Unknown AnimGraphNode_MeshRefPose; //  0x30d8 Size(10)
	Unknown AnimGraphNode_ComponentToLo; //  0x30e8 Size(20)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x3108 Size(c0)

	void AnimGraph(Unknown& AnimGraph); // Function AB.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

