// AnimBlueprintGeneratedClass ABP-DefaultMan_Native.ABP-DefaultMan_Native_C
class UABP-DefaultMan_Native_C : public UBravoHotelAnimInstance {

public:

	struct Unknown UberGraphFrame; // 0xC60 (8)
	struct Unknown AnimGraphNode_Root; // 0xC68 (48)
	struct Unknown AnimGraphNode_TransitionResult_119; // 0xC98 (40)
	struct Unknown AnimGraphNode_TransitionResult_118; // 0xCC0 (40)
	struct Unknown AnimGraphNode_TransitionResult_117; // 0xCE8 (40)
	struct Unknown AnimGraphNode_TransitionResult_116; // 0xD10 (40)
	struct Unknown AnimGraphNode_TransitionResult_115; // 0xD38 (40)
	struct Unknown AnimGraphNode_TransitionResult_114; // 0xD60 (40)
	struct Unknown AnimGraphNode_TransitionResult_113; // 0xD88 (40)
	struct Unknown AnimGraphNode_TransitionResult_112; // 0xDB0 (40)
	struct Unknown AnimGraphNode_TransitionResult_111; // 0xDD8 (40)
	struct Unknown AnimGraphNode_TransitionResult_110; // 0xE00 (40)
	struct Unknown AnimGraphNode_TransitionResult_109; // 0xE28 (40)
	struct Unknown AnimGraphNode_TransitionResult_108; // 0xE50 (40)
	struct Unknown AnimGraphNode_TransitionResult_107; // 0xE78 (40)
	struct Unknown AnimGraphNode_TransitionResult_106; // 0xEA0 (40)
	struct Unknown AnimGraphNode_TransitionResult_105; // 0xEC8 (40)
	struct Unknown AnimGraphNode_TransitionResult_104; // 0xEF0 (40)
	struct Unknown AnimGraphNode_TransitionResult_103; // 0xF18 (40)
	struct Unknown AnimGraphNode_TransitionResult_102; // 0xF40 (40)
	struct Unknown AnimGraphNode_TransitionResult_101; // 0xF68 (40)
	struct Unknown AnimGraphNode_TransitionResult_100; // 0xF90 (40)
	struct Unknown AnimGraphNode_TransitionResult_99; // 0xFB8 (40)
	struct Unknown AnimGraphNode_TransitionResult_98; // 0xFE0 (40)
	struct Unknown AnimGraphNode_TransitionResult_97; // 0x1008 (40)
	struct Unknown AnimGraphNode_TransitionResult_96; // 0x1030 (40)
	struct Unknown AnimGraphNode_TransitionResult_95; // 0x1058 (40)
	struct Unknown AnimGraphNode_TransitionResult_94; // 0x1080 (40)
	struct Unknown AnimGraphNode_TransitionResult_93; // 0x10A8 (40)
	struct Unknown AnimGraphNode_TransitionResult_92; // 0x10D0 (40)
	struct Unknown AnimGraphNode_TransitionResult_91; // 0x10F8 (40)
	struct Unknown AnimGraphNode_TransitionResult_90; // 0x1120 (40)
	struct Unknown AnimGraphNode_TransitionResult_89; // 0x1148 (40)
	struct Unknown AnimGraphNode_TransitionResult_88; // 0x1170 (40)
	struct Unknown AnimGraphNode_TransitionResult_87; // 0x1198 (40)
	struct Unknown AnimGraphNode_TransitionResult_86; // 0x11C0 (40)
	struct Unknown AnimGraphNode_TransitionResult_85; // 0x11E8 (40)
	struct Unknown AnimGraphNode_TransitionResult_84; // 0x1210 (40)
	struct Unknown AnimGraphNode_TransitionResult_83; // 0x1238 (40)
	struct Unknown AnimGraphNode_TransitionResult_82; // 0x1260 (40)
	struct Unknown AnimGraphNode_SequencePlayer_345; // 0x1288 (120)
	struct Unknown AnimGraphNode_StateResult_61; // 0x1300 (48)
	struct Unknown AnimGraphNode_TransitionResult_81; // 0x1330 (40)
	struct Unknown AnimGraphNode_SequencePlayer_344; // 0x1358 (120)
	struct Unknown AnimGraphNode_StateResult_60; // 0x13D0 (48)
	struct Unknown AnimGraphNode_SequencePlayer_343; // 0x1400 (120)
	struct Unknown AnimGraphNode_StateResult_59; // 0x1478 (48)
	struct Unknown AnimGraphNode_StateMachine_19; // 0x14A8 (176)
	struct Unknown AnimGraphNode_StateResult_58; // 0x1558 (48)
	struct Unknown AnimGraphNode_TransitionResult_80; // 0x1588 (40)
	struct Unknown AnimGraphNode_TransitionResult_79; // 0x15B0 (40)
	struct Unknown AnimGraphNode_TransitionResult_78; // 0x15D8 (40)
	struct Unknown AnimGraphNode_TransitionResult_77; // 0x1600 (40)
	struct Unknown AnimGraphNode_SequencePlayer_342; // 0x1628 (120)
	struct Unknown AnimGraphNode_StateResult_57; // 0x16A0 (48)
	struct Unknown AnimGraphNode_BlendSpacePlayer_116; // 0x16D0 (224)
	struct Unknown AnimGraphNode_StateResult_56; // 0x17B0 (48)
	struct Unknown AnimGraphNode_SequencePlayer_341; // 0x17E0 (120)
	struct Unknown AnimGraphNode_StateResult_55; // 0x1858 (48)
	struct Unknown AnimGraphNode_StateMachine_18; // 0x1888 (176)
	struct Unknown AnimGraphNode_StateResult_54; // 0x1938 (48)
	struct Unknown AnimGraphNode_TransitionResult_76; // 0x1968 (40)
	struct Unknown AnimGraphNode_TransitionResult_75; // 0x1990 (40)
	struct Unknown AnimGraphNode_SequencePlayer_340; // 0x19B8 (120)
	struct Unknown AnimGraphNode_BlendListByBool_83; // 0x1A30 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_69; // 0x1AD0 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_115; // 0x1B80 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_114; // 0x1C60 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_97; // 0x1D40 (192)
	struct Unknown AnimGraphNode_SequencePlayer_339; // 0x1E00 (120)
	struct Unknown AnimGraphNode_StateResult_53; // 0x1E78 (48)
	struct Unknown AnimGraphNode_SequencePlayer_338; // 0x1EA8 (120)
	struct Unknown AnimGraphNode_BlendListByBool_82; // 0x1F20 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_68; // 0x1FC0 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_113; // 0x2070 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_112; // 0x2150 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_96; // 0x2230 (192)
	struct Unknown AnimGraphNode_SequencePlayer_337; // 0x22F0 (120)
	struct Unknown AnimGraphNode_StateResult_52; // 0x2368 (48)
	struct Unknown AnimGraphNode_SequencePlayer_336; // 0x2398 (120)
	struct Unknown AnimGraphNode_BlendListByBool_81; // 0x2410 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_67; // 0x24B0 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_111; // 0x2560 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_110; // 0x2640 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_95; // 0x2720 (192)
	struct Unknown AnimGraphNode_SequencePlayer_335; // 0x27E0 (120)
	struct Unknown AnimGraphNode_StateResult_51; // 0x2858 (48)
	struct Unknown AnimGraphNode_StateMachine_17; // 0x2888 (176)
	struct Unknown AnimGraphNode_StateResult_50; // 0x2938 (48)
	struct Unknown AnimGraphNode_TransitionResult_74; // 0x2968 (40)
	struct Unknown AnimGraphNode_TransitionResult_73; // 0x2990 (40)
	struct Unknown AnimGraphNode_TransitionResult_72; // 0x29B8 (40)
	struct Unknown AnimGraphNode_TransitionResult_71; // 0x29E0 (40)
	struct Unknown AnimGraphNode_TransitionResult_70; // 0x2A08 (40)
	struct Unknown AnimGraphNode_TransitionResult_69; // 0x2A30 (40)
	struct Unknown AnimGraphNode_TransitionResult_68; // 0x2A58 (40)
	struct Unknown AnimGraphNode_TransitionResult_67; // 0x2A80 (40)
	struct Unknown AnimGraphNode_TransitionResult_66; // 0x2AA8 (40)
	struct Unknown AnimGraphNode_BlendListByBool_80; // 0x2AD0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_334; // 0x2B70 (120)
	struct Unknown AnimGraphNode_BlendListByBool_79; // 0x2BE8 (160)
	struct Unknown AnimGraphNode_SequencePlayer_333; // 0x2C88 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_94; // 0x2D00 (192)
	struct Unknown AnimGraphNode_SequencePlayer_332; // 0x2DC0 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_66; // 0x2E38 (176)
	struct Unknown AnimGraphNode_SequencePlayer_331; // 0x2EE8 (120)
	struct Unknown AnimGraphNode_StateResult_49; // 0x2F60 (48)
	struct Unknown AnimGraphNode_BlendListByBool_78; // 0x2F90 (160)
	struct Unknown AnimGraphNode_SequencePlayer_330; // 0x3030 (120)
	struct Unknown AnimGraphNode_SequencePlayer_329; // 0x30A8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_93; // 0x3120 (192)
	struct Unknown AnimGraphNode_BlendListByBool_77; // 0x31E0 (160)
	struct Unknown AnimGraphNode_BlendListByBool_76; // 0x3280 (160)
	struct Unknown AnimGraphNode_SequencePlayer_328; // 0x3320 (120)
	struct Unknown AnimGraphNode_SequencePlayer_327; // 0x3398 (120)
	struct Unknown AnimGraphNode_SequencePlayer_326; // 0x3410 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_65; // 0x3488 (176)
	struct Unknown AnimGraphNode_StateResult_48; // 0x3538 (48)
	struct Unknown AnimGraphNode_BlendSpacePlayer_109; // 0x3568 (224)
	struct Unknown AnimGraphNode_TransitionResult_65; // 0x3648 (40)
	struct Unknown AnimGraphNode_TransitionResult_64; // 0x3670 (40)
	struct Unknown AnimGraphNode_TransitionResult_63; // 0x3698 (40)
	struct Unknown AnimGraphNode_TransitionResult_62; // 0x36C0 (40)
	struct Unknown AnimGraphNode_TransitionResult_61; // 0x36E8 (40)
	struct Unknown AnimGraphNode_TransitionResult_60; // 0x3710 (40)
	struct Unknown AnimGraphNode_SequencePlayer_325; // 0x3738 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_24; // 0x37B0 (200)
	struct Unknown AnimGraphNode_SequencePlayer_324; // 0x3878 (120)
	struct Unknown AnimGraphNode_StateResult_47; // 0x38F0 (48)
	struct Unknown AnimGraphNode_TwoWayBlend_23; // 0x3920 (200)
	struct Unknown AnimGraphNode_SequencePlayer_323; // 0x39E8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_322; // 0x3A60 (120)
	struct Unknown AnimGraphNode_StateResult_46; // 0x3AD8 (48)
	struct Unknown AnimGraphNode_SequencePlayer_321; // 0x3B08 (120)
	struct Unknown AnimGraphNode_StateResult_45; // 0x3B80 (48)
	struct Unknown AnimGraphNode_StateMachine_16; // 0x3BB0 (176)
	struct Unknown AnimGraphNode_BlendListByBool_75; // 0x3C60 (160)
	struct Unknown AnimGraphNode_StateResult_44; // 0x3D00 (48)
	struct Unknown AnimGraphNode_SequencePlayer_320; // 0x3D30 (120)
	struct Unknown AnimGraphNode_StateResult_43; // 0x3DA8 (48)
	struct Unknown AnimGraphNode_StateMachine_15; // 0x3DD8 (176)
	struct Unknown AnimGraphNode_StateResult_42; // 0x3E88 (48)
	struct Unknown AnimGraphNode_SequencePlayer_319; // 0x3EB8 (120)
	struct Unknown AnimGraphNode_StateResult_41; // 0x3F30 (48)
	struct Unknown AnimGraphNode_SequencePlayer_318; // 0x3F60 (120)
	struct Unknown AnimGraphNode_BlendListByBool_74; // 0x3FD8 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_108; // 0x4078 (224)
	struct Unknown AnimGraphNode_StateResult_40; // 0x4158 (48)
	struct Unknown AnimGraphNode_TransitionResult_59; // 0x4188 (40)
	struct Unknown AnimGraphNode_ApplyAdditive_17; // 0x41B0 (200)
	struct Unknown AnimGraphNode_BlendSpacePlayer_107; // 0x4278 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_106; // 0x4358 (224)
	struct Unknown AnimGraphNode_BlendListByBool_73; // 0x4438 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_105; // 0x44D8 (224)
	struct Unknown AnimGraphNode_StateResult_39; // 0x45B8 (48)
	struct Unknown AnimGraphNode_TransitionResult_58; // 0x45E8 (40)
	struct Unknown AnimGraphNode_TransitionResult_57; // 0x4610 (40)
	struct Unknown AnimGraphNode_TransitionResult_56; // 0x4638 (40)
	struct Unknown AnimGraphNode_TransitionResult_55; // 0x4660 (40)
	struct Unknown AnimGraphNode_BlendSpacePlayer_104; // 0x4688 (224)
	struct Unknown AnimGraphNode_StateResult_38; // 0x4768 (48)
	struct Unknown AnimGraphNode_BlendSpacePlayer_103; // 0x4798 (224)
	struct Unknown AnimGraphNode_StateResult_37; // 0x4878 (48)
	struct Unknown AnimGraphNode_StateMachine_14; // 0x48A8 (176)
	struct Unknown AnimGraphNode_StateResult_36; // 0x4958 (48)
	struct Unknown AnimGraphNode_TransitionResult_54; // 0x4988 (40)
	struct Unknown AnimGraphNode_TransitionResult_53; // 0x49B0 (40)
	struct Unknown AnimGraphNode_SequencePlayer_317; // 0x49D8 (120)
	struct Unknown AnimGraphNode_StateResult_35; // 0x4A50 (48)
	struct Unknown AnimGraphNode_SequencePlayer_316; // 0x4A80 (120)
	struct Unknown AnimGraphNode_StateResult_34; // 0x4AF8 (48)
	struct Unknown AnimGraphNode_StateMachine_13; // 0x4B28 (176)
	struct Unknown AnimGraphNode_StateResult_33; // 0x4BD8 (48)
	struct Unknown AnimGraphNode_StateMachine_12; // 0x4C08 (176)
	struct Unknown AnimGraphNode_StateResult_32; // 0x4CB8 (48)
	struct Unknown AnimGraphNode_SequencePlayer_315; // 0x4CE8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_314; // 0x4D60 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_92; // 0x4DD8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_313; // 0x4E98 (120)
	struct Unknown AnimGraphNode_SequencePlayer_312; // 0x4F10 (120)
	struct Unknown AnimGraphNode_SequencePlayer_311; // 0x4F88 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_64; // 0x5000 (176)
	struct Unknown AnimGraphNode_SequencePlayer_310; // 0x50B0 (120)
	struct Unknown AnimGraphNode_StateResult_31; // 0x5128 (48)
	struct Unknown AnimGraphNode_SequencePlayer_309; // 0x5158 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_91; // 0x51D0 (192)
	struct Unknown AnimGraphNode_SequencePlayer_308; // 0x5290 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_90; // 0x5308 (192)
	struct Unknown AnimGraphNode_SequencePlayer_307; // 0x53C8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_306; // 0x5440 (120)
	struct Unknown AnimGraphNode_SequencePlayer_305; // 0x54B8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_89; // 0x5530 (192)
	struct Unknown AnimGraphNode_SequenceEvaluator_6; // 0x55F0 (72)
	struct Unknown AnimGraphNode_SequencePlayer_304; // 0x5638 (120)
	struct Unknown AnimGraphNode_SequencePlayer_303; // 0x56B0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_302; // 0x5728 (120)
	struct Unknown AnimGraphNode_SequencePlayer_301; // 0x57A0 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_63; // 0x5818 (176)
	struct Unknown AnimGraphNode_SequencePlayer_300; // 0x58C8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_299; // 0x5940 (120)
	struct Unknown AnimGraphNode_SequencePlayer_298; // 0x59B8 (120)
	struct Unknown AnimGraphNode_BlendListByBool_72; // 0x5A30 (160)
	struct Unknown AnimGraphNode_SequenceEvaluator_5; // 0x5AD0 (72)
	struct Unknown AnimGraphNode_BlendListByBool_71; // 0x5B18 (160)
	struct Unknown AnimGraphNode_SequencePlayer_297; // 0x5BB8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_88; // 0x5C30 (192)
	struct Unknown AnimGraphNode_SequencePlayer_296; // 0x5CF0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_295; // 0x5D68 (120)
	struct Unknown AnimGraphNode_SequencePlayer_294; // 0x5DE0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_293; // 0x5E58 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_87; // 0x5ED0 (192)
	struct Unknown AnimGraphNode_BlendListByBool_70; // 0x5F90 (160)
	struct Unknown AnimGraphNode_SequenceEvaluator_4; // 0x6030 (72)
	struct Unknown AnimGraphNode_SequenceEvaluator_3; // 0x6078 (72)
	struct Unknown AnimGraphNode_SequenceEvaluator_2; // 0x60C0 (72)
	struct Unknown AnimGraphNode_BlendListByEnum_62; // 0x6108 (176)
	struct Unknown AnimGraphNode_SequencePlayer_292; // 0x61B8 (120)
	struct Unknown AnimGraphNode_Slot_35; // 0x6230 (72)
	struct Unknown AnimGraphNode_SequencePlayer_291; // 0x6278 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_86; // 0x62F0 (192)
	struct Unknown AnimGraphNode_BlendListByBool_69; // 0x63B0 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_61; // 0x6450 (176)
	struct Unknown AnimGraphNode_SequencePlayer_290; // 0x6500 (120)
	struct Unknown AnimGraphNode_BlendListByBool_68; // 0x6578 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_102; // 0x6618 (224)
	struct Unknown AnimGraphNode_ApplyAdditive_16; // 0x66F8 (200)
	struct Unknown AnimGraphNode_StateResult_30; // 0x67C0 (48)
	struct Unknown AnimGraphNode_TransitionResult_52; // 0x67F0 (40)
	struct Unknown AnimGraphNode_BlendListByEnum_60; // 0x6818 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_59; // 0x68C8 (176)
	struct Unknown AnimGraphNode_UseCachedPose_60; // 0x6978 (40)
	struct Unknown AnimGraphNode_LocalRefPose; // 0x69A0 (24)
	struct Unknown AnimGraphNode_Slot_34; // 0x69B8 (72)
	struct Unknown AnimGraphNode_LayeredBoneBlend_85; // 0x6A00 (192)
	struct Unknown AnimGraphNode_SequencePlayer_289; // 0x6AC0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_67; // 0x6B38 (160)
	struct Unknown AnimGraphNode_TwoWayBlend_22; // 0x6BD8 (200)
	struct Unknown AnimGraphNode_SequencePlayer_288; // 0x6CA0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_287; // 0x6D18 (120)
	struct Unknown AnimGraphNode_SequencePlayer_286; // 0x6D90 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_84; // 0x6E08 (192)
	struct Unknown AnimGraphNode_SequencePlayer_285; // 0x6EC8 (120)
	struct Unknown AnimGraphNode_StateResult_29; // 0x6F40 (48)
	struct Unknown AnimGraphNode_StateMachine_11; // 0x6F70 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_26; // 0x7020 (184)
	struct Unknown AnimGraphNode_LayeredBoneBlend_83; // 0x70D8 (192)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_9; // 0x7198 (392)
	struct Unknown AnimGraphNode_BlendListByBool_66; // 0x7320 (160)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_8; // 0x73C0 (392)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_7; // 0x7548 (32)
	struct Unknown AnimGraphNode_LocalToComponentSpace_7; // 0x7568 (32)
	struct Unknown AnimGraphNode_ModifyBone_3; // 0x7588 (264)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_7; // 0x7690 (392)
	struct Unknown AnimGraphNode_BlendListByEnum_58; // 0x7818 (176)
	struct Unknown AnimGraphNode_BlendListByBool_65; // 0x78C8 (160)
	struct Unknown AnimGraphNode_Slot_33; // 0x7968 (72)
	struct Unknown AnimGraphNode_BlendListByBool_64; // 0x79B0 (160)
	struct Unknown AnimGraphNode_SaveCachedPose_25; // 0x7A50 (184)
	struct Unknown AnimGraphNode_Slot_32; // 0x7B08 (72)
	struct Unknown AnimGraphNode_SaveCachedPose_24; // 0x7B50 (184)
	struct Unknown AnimGraphNode_SaveCachedPose_23; // 0x7C08 (184)
	struct Unknown AnimGraphNode_UseCachedPose_59; // 0x7CC0 (40)
	struct Unknown AnimGraphNode_UseCachedPose_58; // 0x7CE8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_57; // 0x7D10 (40)
	struct Unknown AnimGraphNode_UseCachedPose_56; // 0x7D38 (40)
	struct Unknown AnimGraphNode_LayeredBoneBlend_82; // 0x7D60 (192)
	struct Unknown AnimGraphNode_UseCachedPose_55; // 0x7E20 (40)
	struct Unknown AnimGraphNode_BlendListByBool_63; // 0x7E48 (160)
	struct Unknown AnimGraphNode_Slot_31; // 0x7EE8 (72)
	struct Unknown AnimGraphNode_UseCachedPose_54; // 0x7F30 (40)
	struct Unknown AnimGraphNode_UseCachedPose_53; // 0x7F58 (40)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_6; // 0x7F80 (392)
	struct Unknown AnimGraphNode_UseCachedPose_52; // 0x8108 (40)
	struct Unknown AnimGraphNode_BlendListByBool_62; // 0x8130 (160)
	struct Unknown AnimGraphNode_BlendListByBool_61; // 0x81D0 (160)
	struct Unknown AnimGraphNode_LayeredBoneBlend_81; // 0x8270 (192)
	struct Unknown AnimGraphNode_UseCachedPose_51; // 0x8330 (40)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_5; // 0x8358 (392)
	struct Unknown AnimGraphNode_UseCachedPose_50; // 0x84E0 (40)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_4; // 0x8508 (392)
	struct Unknown AnimGraphNode_BlendListByBool_60; // 0x8690 (160)
	struct Unknown AnimGraphNode_Slot_30; // 0x8730 (72)
	struct Unknown AnimGraphNode_LayeredBoneBlend_80; // 0x8778 (192)
	struct Unknown AnimGraphNode_Slot_29; // 0x8838 (72)
	struct Unknown AnimGraphNode_BlendListByBool_59; // 0x8880 (160)
	struct Unknown AnimGraphNode_Slot_28; // 0x8920 (72)
	struct Unknown AnimGraphNode_LayeredBoneBlend_79; // 0x8968 (192)
	struct Unknown AnimGraphNode_Slot_27; // 0x8A28 (72)
	struct Unknown AnimGraphNode_Slot_26; // 0x8A70 (72)
	struct Unknown AnimGraphNode_UseCachedPose_49; // 0x8AB8 (40)
	struct Unknown AnimGraphNode_ApplyAdditive_15; // 0x8AE0 (200)
	struct Unknown AnimGraphNode_SequencePlayer_284; // 0x8BA8 (120)
	struct Unknown AnimGraphNode_Slot_25; // 0x8C20 (72)
	struct Unknown AnimGraphNode_ApplyAdditive_14; // 0x8C68 (200)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_3; // 0x8D30 (392)
	struct Unknown AnimGraphNode_BlendListByBool_58; // 0x8EB8 (160)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_2; // 0x8F58 (392)
	struct Unknown AnimGraphNode_UseCachedPose_48; // 0x90E0 (40)
	struct Unknown AnimGraphNode_LayeredBoneBlend_78; // 0x9108 (192)
	struct Unknown AnimGraphNode_LayeredBoneBlend_77; // 0x91C8 (192)
	struct Unknown AnimGraphNode_SaveCachedPose_22; // 0x9288 (184)
	struct Unknown AnimGraphNode_UseCachedPose_47; // 0x9340 (40)
	struct Unknown AnimGraphNode_UseCachedPose_46; // 0x9368 (40)
	struct Unknown AnimGraphNode_UseCachedPose_45; // 0x9390 (40)
	struct Unknown AnimGraphNode_BlendListByBool_57; // 0x93B8 (160)
	struct Unknown AnimGraphNode_Slot_24; // 0x9458 (72)
	struct Unknown AnimGraphNode_BlendSpacePlayer_101; // 0x94A0 (224)
	struct Unknown AnimGraphNode_SequenceEvaluator; // 0x9580 (72)
	struct Unknown AnimGraphNode_LocalToComponentSpace_6; // 0x95C8 (32)
	struct Unknown AnimGraphNode_ModifyBone_2; // 0x95E8 (264)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_6; // 0x96F0 (32)
	struct Unknown AnimGraphNode_BlendListByBool_56; // 0x9710 (160)
	struct Unknown AnimGraphNode_IdentityPose_7; // 0x97B0 (24)
	struct Unknown AnimGraphNode_LayeredBoneBlend_76; // 0x97C8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_283; // 0x9888 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_75; // 0x9900 (192)
	struct Unknown AnimGraphNode_IdentityPose_6; // 0x99C0 (24)
	struct Unknown AnimGraphNode_SequencePlayer_282; // 0x99D8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_74; // 0x9A50 (192)
	struct Unknown AnimGraphNode_IdentityPose_5; // 0x9B10 (24)
	struct Unknown AnimGraphNode_BlendListByEnum_57; // 0x9B28 (176)
	struct Unknown AnimGraphNode_SequencePlayer_281; // 0x9BD8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_73; // 0x9C50 (192)
	struct Unknown AnimGraphNode_IdentityPose_4; // 0x9D10 (24)
	struct Unknown AnimGraphNode_StateResult_28; // 0x9D28 (48)
	struct Unknown AnimGraphNode_StateMachine_10; // 0x9D58 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_21; // 0x9E08 (184)
	struct Unknown AnimGraphNode_ApplyAdditive_13; // 0x9EC0 (200)
	struct Unknown AnimGraphNode_UseCachedPose_44; // 0x9F88 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_20; // 0x9FB0 (184)
	struct Unknown AnimGraphNode_UseCachedPose_43; // 0xA068 (40)
	struct Unknown AnimGraphNode_BlendListByBool_55; // 0xA090 (160)
	struct Unknown AnimGraphNode_Slot_23; // 0xA130 (72)
	struct Unknown AnimGraphNode_SequencePlayer_280; // 0xA178 (120)
	struct Unknown AnimGraphNode_BlendListByBool_54; // 0xA1F0 (160)
	struct Unknown AnimGraphNode_BlendListByBool_53; // 0xA290 (160)
	struct Unknown AnimGraphNode_SequencePlayer_279; // 0xA330 (120)
	struct Unknown AnimGraphNode_LocalToComponentSpace_5; // 0xA3A8 (32)
	struct Unknown AnimGraphNode_ModifyBone; // 0xA3C8 (264)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_5; // 0xA4D0 (32)
	struct Unknown AnimGraphNode_BlendListByBool_52; // 0xA4F0 (160)
	struct Unknown AnimGraphNode_Slot_22; // 0xA590 (72)
	struct Unknown AnimGraphNode_Slot_21; // 0xA5D8 (72)
	struct Unknown AnimGraphNode_Slot_20; // 0xA620 (72)
	struct Unknown AnimGraphNode_IdentityPose_3; // 0xA668 (24)
	struct Unknown AnimGraphNode_SequencePlayer_278; // 0xA680 (120)
	struct Unknown AnimGraphNode_BlendListByBool_51; // 0xA6F8 (160)
	struct Unknown AnimGraphNode_BlendListByBool_50; // 0xA798 (160)
	struct Unknown AnimGraphNode_SequencePlayer_277; // 0xA838 (120)
	struct Unknown AnimGraphNode_StateResult_27; // 0xA8B0 (48)
	struct Unknown AnimGraphNode_StateMachine_9; // 0xA8E0 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_19; // 0xA990 (184)
	struct Unknown AnimGraphNode_UseCachedPose_42; // 0xAA48 (40)
	struct Unknown AnimGraphNode_UseCachedPose_41; // 0xAA70 (40)
	struct Unknown AnimGraphNode_BlendListByBool_49; // 0xAA98 (160)
	struct Unknown AnimGraphNode_TwoWayBlend_21; // 0xAB38 (200)
	struct Unknown AnimGraphNode_Slot_19; // 0xAC00 (72)
	struct Unknown AnimGraphNode_BlendListByBool_48; // 0xAC48 (160)
	struct Unknown AnimGraphNode_Slot_18; // 0xACE8 (72)
	struct Unknown AnimGraphNode_LayeredBoneBlend_72; // 0xAD30 (192)
	struct Unknown AnimGraphNode_UseCachedPose_40; // 0xADF0 (40)
	struct Unknown AnimGraphNode_UseCachedPose_39; // 0xAE18 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_18; // 0xAE40 (184)
	struct Unknown AnimGraphNode_UseCachedPose_38; // 0xAEF8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_37; // 0xAF20 (40)
	struct Unknown AnimGraphNode_Slot_17; // 0xAF48 (72)
	struct Unknown AnimGraphNode_LayeredBoneBlend_71; // 0xAF90 (192)
	struct Unknown AnimGraphNode_Slot_16; // 0xB050 (72)
	struct Unknown AnimGraphNode_UseCachedPose_36; // 0xB098 (40)
	struct Unknown AnimGraphNode_SequencePlayer_276; // 0xB0C0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_275; // 0xB138 (120)
	struct Unknown AnimGraphNode_BlendListByInt_20; // 0xB1B0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_274; // 0xB250 (120)
	struct Unknown AnimGraphNode_SequencePlayer_273; // 0xB2C8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_272; // 0xB340 (120)
	struct Unknown AnimGraphNode_BlendListByInt_19; // 0xB3B8 (160)
	struct Unknown AnimGraphNode_SequencePlayer_271; // 0xB458 (120)
	struct Unknown AnimGraphNode_SequencePlayer_270; // 0xB4D0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_269; // 0xB548 (120)
	struct Unknown AnimGraphNode_BlendListByInt_18; // 0xB5C0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_268; // 0xB660 (120)
	struct Unknown AnimGraphNode_SequencePlayer_267; // 0xB6D8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_266; // 0xB750 (120)
	struct Unknown AnimGraphNode_BlendListByInt_17; // 0xB7C8 (160)
	struct Unknown AnimGraphNode_SequencePlayer_265; // 0xB868 (120)
	struct Unknown AnimGraphNode_BlendListByBool_47; // 0xB8E0 (160)
	struct Unknown AnimGraphNode_BlendListByBool_46; // 0xB980 (160)
	struct Unknown AnimGraphNode_BlendListByBool_45; // 0xBA20 (160)
	struct Unknown AnimGraphNode_StateResult_26; // 0xBAC0 (48)
	struct Unknown AnimGraphNode_StateMachine_8; // 0xBAF0 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_17; // 0xBBA0 (184)
	struct Unknown AnimGraphNode_ApplyAdditive_12; // 0xBC58 (200)
	struct Unknown AnimGraphNode_UseCachedPose_35; // 0xBD20 (40)
	struct Unknown AnimGraphNode_BlendListByBool_44; // 0xBD48 (160)
	struct Unknown AnimGraphNode_SequencePlayer_264; // 0xBDE8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_263; // 0xBE60 (120)
	struct Unknown AnimGraphNode_SequencePlayer_262; // 0xBED8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_261; // 0xBF50 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_56; // 0xBFC8 (176)
	struct Unknown AnimGraphNode_StateResult_25; // 0xC078 (48)
	struct Unknown AnimGraphNode_StateMachine_7; // 0xC0A8 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_16; // 0xC158 (184)
	struct Unknown AnimGraphNode_LayeredBoneBlend_70; // 0xC210 (192)
	struct Unknown AnimGraphNode_UseCachedPose_34; // 0xC2D0 (40)
	struct Unknown AnimGraphNode_BlendListByBool_43; // 0xC2F8 (160)
	struct Unknown AnimGraphNode_BlendListByBool_42; // 0xC398 (160)
	struct Unknown AnimGraphNode_SequencePlayer_260; // 0xC438 (120)
	struct Unknown AnimGraphNode_SequencePlayer_259; // 0xC4B0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_41; // 0xC528 (160)
	struct Unknown AnimGraphNode_SequencePlayer_258; // 0xC5C8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_257; // 0xC640 (120)
	struct Unknown AnimGraphNode_StateResult_24; // 0xC6B8 (48)
	struct Unknown AnimGraphNode_StateMachine_6; // 0xC6E8 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_15; // 0xC798 (184)
	struct Unknown AnimGraphNode_BlendListByBool_40; // 0xC850 (160)
	struct Unknown AnimGraphNode_BlendListByBool_39; // 0xC8F0 (160)
	struct Unknown AnimGraphNode_UseCachedPose_33; // 0xC990 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_14; // 0xC9B8 (184)
	struct Unknown AnimGraphNode_UseCachedPose_32; // 0xCA70 (40)
	struct Unknown AnimGraphNode_Slot_15; // 0xCA98 (72)
	struct Unknown AnimGraphNode_LayeredBoneBlend_69; // 0xCAE0 (192)
	struct Unknown AnimGraphNode_UseCachedPose_31; // 0xCBA0 (40)
	struct Unknown AnimGraphNode_TwoBoneIK_11; // 0xCBD0 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_10; // 0xCDB0 (480)
	struct Unknown AnimGraphNode_LocalToComponentSpace_4; // 0xCF90 (32)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_4; // 0xCFB0 (32)
	struct Unknown AnimGraphNode_SaveCachedPose_13; // 0xCFD0 (184)
	struct Unknown AnimGraphNode_UseCachedPose_30; // 0xD088 (40)
	struct Unknown AnimGraphNode_UseCachedPose_29; // 0xD0B0 (40)
	struct Unknown AnimGraphNode_TwoBoneIK_9; // 0xD0E0 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_8; // 0xD2C0 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_7; // 0xD4A0 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_6; // 0xD680 (480)
	struct Unknown AnimGraphNode_LocalToComponentSpace_3; // 0xD860 (32)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_3; // 0xD880 (32)
	struct Unknown AnimGraphNode_TwoBoneIK_5; // 0xD8A0 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_4; // 0xDA80 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_3; // 0xDC60 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_2; // 0xDE40 (480)
	struct Unknown AnimGraphNode_LocalToComponentSpace_2; // 0xE020 (32)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_2; // 0xE040 (32)
	struct Unknown AnimGraphNode_UseCachedPose_28; // 0xE060 (40)
	struct Unknown AnimGraphNode_UseCachedPose_27; // 0xE088 (40)
	struct Unknown AnimGraphNode_UseCachedPose_26; // 0xE0B0 (40)
	struct Unknown AnimGraphNode_Slot_14; // 0xE0D8 (72)
	struct Unknown AnimGraphNode_BlendListByEnum_55; // 0xE120 (176)
	struct Unknown AnimGraphNode_BlendListByBool_38; // 0xE1D0 (160)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace; // 0xE270 (392)
	struct Unknown AnimGraphNode_UseCachedPose_25; // 0xE3F8 (40)
	struct Unknown AnimGraphNode_SequencePlayer_256; // 0xE420 (120)
	struct Unknown AnimGraphNode_BlendListByBool_37; // 0xE498 (160)
	struct Unknown AnimGraphNode_Slot_13; // 0xE538 (72)
	struct Unknown AnimGraphNode_Slot_12; // 0xE580 (72)
	struct Unknown AnimGraphNode_BlendListByBool_36; // 0xE5C8 (160)
	struct Unknown AnimGraphNode_SequencePlayer_255; // 0xE668 (120)
	struct Unknown AnimGraphNode_SequencePlayer_254; // 0xE6E0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_35; // 0xE758 (160)
	struct Unknown AnimGraphNode_LayeredBoneBlend_68; // 0xE7F8 (192)
	struct Unknown AnimGraphNode_Slot_11; // 0xE8B8 (72)
	struct Unknown AnimGraphNode_BlendListByBool_34; // 0xE900 (160)
	struct Unknown AnimGraphNode_LayeredBoneBlend_67; // 0xE9A0 (192)
	struct Unknown AnimGraphNode_Slot_10; // 0xEA60 (72)
	struct Unknown AnimGraphNode_BlendListByBool_33; // 0xEAA8 (160)
	struct Unknown AnimGraphNode_ApplyAdditive_11; // 0xEB48 (200)
	struct Unknown AnimGraphNode_UseCachedPose_24; // 0xEC10 (40)
	struct Unknown AnimGraphNode_TransitionResult_51; // 0xEC38 (40)
	struct Unknown AnimGraphNode_TransitionResult_50; // 0xEC60 (40)
	struct Unknown AnimGraphNode_TransitionResult_49; // 0xEC88 (40)
	struct Unknown AnimGraphNode_TransitionResult_48; // 0xECB0 (40)
	struct Unknown AnimGraphNode_TransitionResult_47; // 0xECD8 (40)
	struct Unknown AnimGraphNode_TransitionResult_46; // 0xED00 (40)
	struct Unknown AnimGraphNode_TransitionResult_45; // 0xED28 (40)
	struct Unknown AnimGraphNode_TransitionResult_44; // 0xED50 (40)
	struct Unknown AnimGraphNode_TransitionResult_43; // 0xED78 (40)
	struct Unknown AnimGraphNode_TransitionResult_42; // 0xEDA0 (40)
	struct Unknown AnimGraphNode_TransitionResult_41; // 0xEDC8 (40)
	struct Unknown AnimGraphNode_TransitionResult_40; // 0xEDF0 (40)
	struct Unknown AnimGraphNode_TransitionResult_39; // 0xEE18 (40)
	struct Unknown AnimGraphNode_TransitionResult_38; // 0xEE40 (40)
	struct Unknown AnimGraphNode_TransitionResult_37; // 0xEE68 (40)
	struct Unknown AnimGraphNode_TransitionResult_36; // 0xEE90 (40)
	struct Unknown AnimGraphNode_TransitionResult_35; // 0xEEB8 (40)
	struct Unknown AnimGraphNode_TransitionResult_34; // 0xEEE0 (40)
	struct Unknown AnimGraphNode_TransitionResult_33; // 0xEF08 (40)
	struct Unknown AnimGraphNode_TransitionResult_32; // 0xEF30 (40)
	struct Unknown AnimGraphNode_TransitionResult_31; // 0xEF58 (40)
	struct Unknown AnimGraphNode_TransitionResult_30; // 0xEF80 (40)
	struct Unknown AnimGraphNode_TransitionResult_29; // 0xEFA8 (40)
	struct Unknown AnimGraphNode_TransitionResult_28; // 0xEFD0 (40)
	struct Unknown AnimGraphNode_TransitionResult_27; // 0xEFF8 (40)
	struct Unknown AnimGraphNode_TransitionResult_26; // 0xF020 (40)
	struct Unknown AnimGraphNode_SequencePlayer_253; // 0xF048 (120)
	struct Unknown AnimGraphNode_SequencePlayer_252; // 0xF0C0 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_20; // 0xF138 (200)
	struct Unknown AnimGraphNode_LayeredBoneBlend_66; // 0xF200 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_100; // 0xF2C0 (224)
	struct Unknown AnimGraphNode_SequencePlayer_251; // 0xF3A0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_65; // 0xF418 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_99; // 0xF4D8 (224)
	struct Unknown AnimGraphNode_SequencePlayer_250; // 0xF5B8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_249; // 0xF630 (120)
	struct Unknown AnimGraphNode_SequencePlayer_248; // 0xF6A8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_247; // 0xF720 (120)
	struct Unknown AnimGraphNode_SequencePlayer_246; // 0xF798 (120)
	struct Unknown AnimGraphNode_SequencePlayer_245; // 0xF810 (120)
	struct Unknown AnimGraphNode_SequencePlayer_244; // 0xF888 (120)
	struct Unknown AnimGraphNode_SequencePlayer_243; // 0xF900 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_19; // 0xF978 (200)
	struct Unknown AnimGraphNode_SequencePlayer_242; // 0xFA40 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_64; // 0xFAB8 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_98; // 0xFB78 (224)
	struct Unknown AnimGraphNode_SequencePlayer_241; // 0xFC58 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_63; // 0xFCD0 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_97; // 0xFD90 (224)
	struct Unknown AnimGraphNode_BlendListByBool_32; // 0xFE70 (160)
	struct Unknown AnimGraphNode_SequencePlayer_240; // 0xFF10 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_18; // 0xFF88 (200)
	struct Unknown AnimGraphNode_BlendSpacePlayer_96; // 0x10050 (224)
	struct Unknown AnimGraphNode_SequencePlayer_239; // 0x10130 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_17; // 0x101A8 (200)
	struct Unknown AnimGraphNode_BlendSpacePlayer_95; // 0x10270 (224)
	struct Unknown AnimGraphNode_TwoWayBlend_16; // 0x10350 (200)
	struct Unknown AnimGraphNode_SequencePlayer_238; // 0x10418 (120)
	struct Unknown AnimGraphNode_SequencePlayer_237; // 0x10490 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_15; // 0x10508 (200)
	struct Unknown AnimGraphNode_SequencePlayer_236; // 0x105D0 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_14; // 0x10648 (200)
	struct Unknown AnimGraphNode_SequencePlayer_235; // 0x10710 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_13; // 0x10788 (200)
	struct Unknown AnimGraphNode_SequencePlayer_234; // 0x10850 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_12; // 0x108C8 (200)
	struct Unknown AnimGraphNode_SequencePlayer_233; // 0x10990 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_11; // 0x10A08 (200)
	struct Unknown AnimGraphNode_BlendSpacePlayer_94; // 0x10AD0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_93; // 0x10BB0 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_62; // 0x10C90 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_92; // 0x10D50 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_54; // 0x10E30 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_91; // 0x10EE0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_90; // 0x10FC0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_89; // 0x110A0 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_53; // 0x11180 (176)
	struct Unknown AnimGraphNode_IdentityPose_2; // 0x11230 (24)
	struct Unknown AnimGraphNode_ApplyAdditive_10; // 0x11248 (200)
	struct Unknown AnimGraphNode_BlendListByEnum_52; // 0x11310 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_61; // 0x113C0 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_51; // 0x11480 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_60; // 0x11530 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_88; // 0x115F0 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_50; // 0x116D0 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_87; // 0x11780 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_86; // 0x11860 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_85; // 0x11940 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_84; // 0x11A20 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_83; // 0x11B00 (224)
	struct Unknown AnimGraphNode_ApplyAdditive_9; // 0x11BE0 (200)
	struct Unknown AnimGraphNode_ApplyAdditive_8; // 0x11CA8 (200)
	struct Unknown AnimGraphNode_BlendListByBool_31; // 0x11D70 (160)
	struct Unknown AnimGraphNode_StateResult_23; // 0x11E10 (48)
	struct Unknown AnimGraphNode_SequencePlayer_232; // 0x11E40 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_59; // 0x11EB8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_231; // 0x11F78 (120)
	struct Unknown AnimGraphNode_SequencePlayer_230; // 0x11FF0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_229; // 0x12068 (120)
	struct Unknown AnimGraphNode_SequencePlayer_228; // 0x120E0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_58; // 0x12158 (192)
	struct Unknown AnimGraphNode_LayeredBoneBlend_57; // 0x12218 (192)
	struct Unknown AnimGraphNode_SequencePlayer_227; // 0x122D8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_226; // 0x12350 (120)
	struct Unknown AnimGraphNode_SequencePlayer_225; // 0x123C8 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_49; // 0x12440 (176)
	struct Unknown AnimGraphNode_SequencePlayer_224; // 0x124F0 (120)
	struct Unknown AnimGraphNode_StateResult_22; // 0x12568 (48)
	struct Unknown AnimGraphNode_SequencePlayer_223; // 0x12598 (120)
	struct Unknown AnimGraphNode_SequencePlayer_222; // 0x12610 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_56; // 0x12688 (192)
	struct Unknown AnimGraphNode_SequencePlayer_221; // 0x12748 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_55; // 0x127C0 (192)
	struct Unknown AnimGraphNode_SequencePlayer_220; // 0x12880 (120)
	struct Unknown AnimGraphNode_SequencePlayer_219; // 0x128F8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_218; // 0x12970 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_48; // 0x129E8 (176)
	struct Unknown AnimGraphNode_SequencePlayer_217; // 0x12A98 (120)
	struct Unknown AnimGraphNode_StateResult_21; // 0x12B10 (48)
	struct Unknown AnimGraphNode_SequencePlayer_216; // 0x12B40 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_54; // 0x12BB8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_215; // 0x12C78 (120)
	struct Unknown AnimGraphNode_SequencePlayer_214; // 0x12CF0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_213; // 0x12D68 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_53; // 0x12DE0 (192)
	struct Unknown AnimGraphNode_SequencePlayer_212; // 0x12EA0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_52; // 0x12F18 (192)
	struct Unknown AnimGraphNode_SequencePlayer_211; // 0x12FD8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_210; // 0x13050 (120)
	struct Unknown AnimGraphNode_SequencePlayer_209; // 0x130C8 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_47; // 0x13140 (176)
	struct Unknown AnimGraphNode_SequencePlayer_208; // 0x131F0 (120)
	struct Unknown AnimGraphNode_StateResult_20; // 0x13268 (48)
	struct Unknown AnimGraphNode_StateMachine_5; // 0x13298 (176)
	struct Unknown AnimGraphNode_StateResult_19; // 0x13348 (48)
	struct Unknown AnimGraphNode_LayeredBoneBlend_51; // 0x13378 (192)
	struct Unknown AnimGraphNode_SequencePlayer_207; // 0x13438 (120)
	struct Unknown AnimGraphNode_SequencePlayer_206; // 0x134B0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_205; // 0x13528 (120)
	struct Unknown AnimGraphNode_SequencePlayer_204; // 0x135A0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_203; // 0x13618 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_50; // 0x13690 (192)
	struct Unknown AnimGraphNode_LayeredBoneBlend_49; // 0x13750 (192)
	struct Unknown AnimGraphNode_SequencePlayer_202; // 0x13810 (120)
	struct Unknown AnimGraphNode_SequencePlayer_201; // 0x13888 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_46; // 0x13900 (176)
	struct Unknown AnimGraphNode_SequencePlayer_200; // 0x139B0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_199; // 0x13A28 (120)
	struct Unknown AnimGraphNode_StateResult_18; // 0x13AA0 (48)
	struct Unknown AnimGraphNode_LayeredBoneBlend_48; // 0x13AD0 (192)
	struct Unknown AnimGraphNode_SequencePlayer_198; // 0x13B90 (120)
	struct Unknown AnimGraphNode_SequencePlayer_197; // 0x13C08 (120)
	struct Unknown AnimGraphNode_SequencePlayer_196; // 0x13C80 (120)
	struct Unknown AnimGraphNode_SequencePlayer_195; // 0x13CF8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_47; // 0x13D70 (192)
	struct Unknown AnimGraphNode_SequencePlayer_194; // 0x13E30 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_46; // 0x13EA8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_193; // 0x13F68 (120)
	struct Unknown AnimGraphNode_SequencePlayer_192; // 0x13FE0 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_45; // 0x14058 (176)
	struct Unknown AnimGraphNode_SequencePlayer_191; // 0x14108 (120)
	struct Unknown AnimGraphNode_SequencePlayer_190; // 0x14180 (120)
	struct Unknown AnimGraphNode_StateResult_17; // 0x141F8 (48)
	struct Unknown AnimGraphNode_SequencePlayer_189; // 0x14228 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_45; // 0x142A0 (192)
	struct Unknown AnimGraphNode_SequencePlayer_188; // 0x14360 (120)
	struct Unknown AnimGraphNode_SequencePlayer_187; // 0x143D8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_186; // 0x14450 (120)
	struct Unknown AnimGraphNode_SequencePlayer_185; // 0x144C8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_184; // 0x14540 (120)
	struct Unknown AnimGraphNode_SequencePlayer_183; // 0x145B8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_182; // 0x14630 (120)
	struct Unknown AnimGraphNode_SequencePlayer_181; // 0x146A8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_44; // 0x14720 (192)
	struct Unknown AnimGraphNode_LayeredBoneBlend_43; // 0x147E0 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_44; // 0x148A0 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_43; // 0x14950 (176)
	struct Unknown AnimGraphNode_SequencePlayer_180; // 0x14A00 (120)
	struct Unknown AnimGraphNode_SequencePlayer_179; // 0x14A78 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_42; // 0x14AF0 (176)
	struct Unknown AnimGraphNode_SequencePlayer_178; // 0x14BA0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_177; // 0x14C18 (120)
	struct Unknown AnimGraphNode_StateResult_16; // 0x14C90 (48)
	struct Unknown AnimGraphNode_SequencePlayer_176; // 0x14CC0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_42; // 0x14D38 (192)
	struct Unknown AnimGraphNode_SequencePlayer_175; // 0x14DF8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_41; // 0x14E70 (192)
	struct Unknown AnimGraphNode_SequencePlayer_174; // 0x14F30 (120)
	struct Unknown AnimGraphNode_SequencePlayer_173; // 0x14FA8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_172; // 0x15020 (120)
	struct Unknown AnimGraphNode_SequencePlayer_171; // 0x15098 (120)
	struct Unknown AnimGraphNode_SequencePlayer_170; // 0x15110 (120)
	struct Unknown AnimGraphNode_SequencePlayer_169; // 0x15188 (120)
	struct Unknown AnimGraphNode_SequencePlayer_168; // 0x15200 (120)
	struct Unknown AnimGraphNode_SequencePlayer_167; // 0x15278 (120)
	struct Unknown AnimGraphNode_SequencePlayer_166; // 0x152F0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_40; // 0x15368 (192)
	struct Unknown AnimGraphNode_SequencePlayer_165; // 0x15428 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_39; // 0x154A0 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_41; // 0x15560 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_40; // 0x15610 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_38; // 0x156C0 (192)
	struct Unknown AnimGraphNode_SequencePlayer_164; // 0x15780 (120)
	struct Unknown AnimGraphNode_SequencePlayer_163; // 0x157F8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_162; // 0x15870 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_39; // 0x158E8 (176)
	struct Unknown AnimGraphNode_SequencePlayer_161; // 0x15998 (120)
	struct Unknown AnimGraphNode_StateResult_15; // 0x15A10 (48)
	struct Unknown AnimGraphNode_TransitionResult_25; // 0x15A40 (40)
	struct Unknown AnimGraphNode_TransitionResult_24; // 0x15A68 (40)
	struct Unknown AnimGraphNode_TransitionResult_23; // 0x15A90 (40)
	struct Unknown AnimGraphNode_TransitionResult_22; // 0x15AB8 (40)
	struct Unknown AnimGraphNode_TransitionResult_21; // 0x15AE0 (40)
	struct Unknown AnimGraphNode_BlendListByBool_30; // 0x15B08 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_82; // 0x15BA8 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_81; // 0x15C88 (224)
	struct Unknown AnimGraphNode_SequencePlayer_160; // 0x15D68 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_37; // 0x15DE0 (192)
	struct Unknown AnimGraphNode_SequencePlayer_159; // 0x15EA0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_158; // 0x15F18 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_36; // 0x15F90 (192)
	struct Unknown AnimGraphNode_BlendListByBool_29; // 0x16050 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_80; // 0x160F0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_79; // 0x161D0 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_35; // 0x162B0 (192)
	struct Unknown AnimGraphNode_BlendListByBool_28; // 0x16370 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_78; // 0x16410 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_77; // 0x164F0 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_38; // 0x165D0 (176)
	struct Unknown AnimGraphNode_BlendListByBool_27; // 0x16680 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_76; // 0x16720 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_75; // 0x16800 (224)
	struct Unknown AnimGraphNode_BlendListByBool_26; // 0x168E0 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_74; // 0x16980 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_73; // 0x16A60 (224)
	struct Unknown AnimGraphNode_StateResult_14; // 0x16B40 (48)
	struct Unknown AnimGraphNode_BlendListByBool_25; // 0x16B70 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_72; // 0x16C10 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_71; // 0x16CF0 (224)
	struct Unknown AnimGraphNode_SequencePlayer_157; // 0x16DD0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_156; // 0x16E48 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_34; // 0x16EC0 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_70; // 0x16F80 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_33; // 0x17060 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_69; // 0x17120 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_68; // 0x17200 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_37; // 0x172E0 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_67; // 0x17390 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_66; // 0x17470 (224)
	struct Unknown AnimGraphNode_StateResult_13; // 0x17550 (48)
	struct Unknown AnimGraphNode_SequencePlayer_155; // 0x17580 (120)
	struct Unknown AnimGraphNode_SequencePlayer_154; // 0x175F8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_153; // 0x17670 (120)
	struct Unknown AnimGraphNode_ComponentToLocalSpace; // 0x176E8 (32)
	struct Unknown AnimGraphNode_LocalToComponentSpace; // 0x17708 (32)
	struct Unknown AnimGraphNode_TwoBoneIK; // 0x17730 (480)
	struct Unknown AnimGraphNode_SequencePlayer_152; // 0x17910 (120)
	struct Unknown AnimGraphNode_SequencePlayer_151; // 0x17988 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_32; // 0x17A00 (192)
	struct Unknown AnimGraphNode_SequencePlayer_150; // 0x17AC0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_31; // 0x17B38 (192)
	struct Unknown AnimGraphNode_SequencePlayer_149; // 0x17BF8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_148; // 0x17C70 (120)
	struct Unknown AnimGraphNode_BlendListByInt_16; // 0x17CE8 (160)
	struct Unknown AnimGraphNode_SequencePlayer_147; // 0x17D88 (120)
	struct Unknown AnimGraphNode_SequencePlayer_146; // 0x17E00 (120)
	struct Unknown AnimGraphNode_SequencePlayer_145; // 0x17E78 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_36; // 0x17EF0 (176)
	struct Unknown AnimGraphNode_SequencePlayer_144; // 0x17FA0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_24; // 0x18018 (160)
	struct Unknown AnimGraphNode_SequencePlayer_143; // 0x180B8 (120)
	struct Unknown AnimGraphNode_BlendListByBool_23; // 0x18130 (160)
	struct Unknown AnimGraphNode_SequencePlayer_142; // 0x181D0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_22; // 0x18248 (160)
	struct Unknown AnimGraphNode_SequencePlayer_141; // 0x182E8 (120)
	struct Unknown AnimGraphNode_BlendListByBool_21; // 0x18360 (160)
	struct Unknown AnimGraphNode_SequencePlayer_140; // 0x18400 (120)
	struct Unknown AnimGraphNode_SequencePlayer_139; // 0x18478 (120)
	struct Unknown AnimGraphNode_SequencePlayer_138; // 0x184F0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_137; // 0x18568 (120)
	struct Unknown AnimGraphNode_BlendListByInt_15; // 0x185E0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_136; // 0x18680 (120)
	struct Unknown AnimGraphNode_SequencePlayer_135; // 0x186F8 (120)
	struct Unknown AnimGraphNode_BlendListByInt_14; // 0x18770 (160)
	struct Unknown AnimGraphNode_SequencePlayer_134; // 0x18810 (120)
	struct Unknown AnimGraphNode_SequencePlayer_133; // 0x18888 (120)
	struct Unknown AnimGraphNode_BlendListByInt_13; // 0x18900 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_35; // 0x189A0 (176)
	struct Unknown AnimGraphNode_SequencePlayer_132; // 0x18A50 (120)
	struct Unknown AnimGraphNode_SequencePlayer_131; // 0x18AC8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_130; // 0x18B40 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_34; // 0x18BB8 (176)
	struct Unknown AnimGraphNode_SequencePlayer_129; // 0x18C68 (120)
	struct Unknown AnimGraphNode_SequencePlayer_128; // 0x18CE0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_20; // 0x18D58 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_33; // 0x18DF8 (176)
	struct Unknown AnimGraphNode_Slot_9; // 0x18EA8 (72)
	struct Unknown AnimGraphNode_SequencePlayer_127; // 0x18EF0 (120)
	struct Unknown AnimGraphNode_StateResult_12; // 0x18F68 (48)
	struct Unknown AnimGraphNode_StateMachine_4; // 0x18F98 (176)
	struct Unknown AnimGraphNode_StateResult_11; // 0x19048 (48)
	struct Unknown AnimGraphNode_TransitionResult_20; // 0x19078 (40)
	struct Unknown AnimGraphNode_TransitionResult_19; // 0x190A0 (40)
	struct Unknown AnimGraphNode_TransitionResult_18; // 0x190C8 (40)
	struct Unknown AnimGraphNode_TransitionResult_17; // 0x190F0 (40)
	struct Unknown AnimGraphNode_TransitionResult_16; // 0x19118 (40)
	struct Unknown AnimGraphNode_SequencePlayer_126; // 0x19140 (120)
	struct Unknown AnimGraphNode_BlendSpacePlayer_65; // 0x191B8 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_64; // 0x19298 (224)
	struct Unknown AnimGraphNode_BlendListByBool_19; // 0x19378 (160)
	struct Unknown AnimGraphNode_LayeredBoneBlend_30; // 0x19418 (192)
	struct Unknown AnimGraphNode_SequencePlayer_125; // 0x194D8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_124; // 0x19550 (120)
	struct Unknown AnimGraphNode_SequencePlayer_123; // 0x195C8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_122; // 0x19640 (120)
	struct Unknown AnimGraphNode_SequencePlayer_121; // 0x196B8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_120; // 0x19730 (120)
	struct Unknown AnimGraphNode_SequencePlayer_119; // 0x197A8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_118; // 0x19820 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_29; // 0x19898 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_63; // 0x19958 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_62; // 0x19A38 (224)
	struct Unknown AnimGraphNode_BlendListByBool_18; // 0x19B18 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_32; // 0x19BB8 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_31; // 0x19C68 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_28; // 0x19D18 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_30; // 0x19DD8 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_61; // 0x19E88 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_60; // 0x19F68 (224)
	struct Unknown AnimGraphNode_BlendListByBool_17; // 0x1A048 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_59; // 0x1A0E8 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_58; // 0x1A1C8 (224)
	struct Unknown AnimGraphNode_BlendListByBool_16; // 0x1A2A8 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_29; // 0x1A348 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_57; // 0x1A3F8 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_56; // 0x1A4D8 (224)
	struct Unknown AnimGraphNode_BlendListByBool_15; // 0x1A5B8 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_55; // 0x1A658 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_54; // 0x1A738 (224)
	struct Unknown AnimGraphNode_BlendListByBool_14; // 0x1A818 (160)
	struct Unknown AnimGraphNode_StateResult_10; // 0x1A8B8 (48)
	struct Unknown AnimGraphNode_BlendSpacePlayer_53; // 0x1A8E8 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_52; // 0x1A9C8 (224)
	struct Unknown AnimGraphNode_BlendListByBool_13; // 0x1AAA8 (160)
	struct Unknown AnimGraphNode_SequencePlayer_117; // 0x1AB48 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_27; // 0x1ABC0 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_51; // 0x1AC80 (224)
	struct Unknown AnimGraphNode_SequencePlayer_116; // 0x1AD60 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_26; // 0x1ADD8 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_28; // 0x1AE98 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_50; // 0x1AF48 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_49; // 0x1B028 (224)
	struct Unknown AnimGraphNode_SequencePlayer_115; // 0x1B108 (120)
	struct Unknown AnimGraphNode_SequencePlayer_114; // 0x1B180 (120)
	struct Unknown AnimGraphNode_SequencePlayer_113; // 0x1B1F8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_112; // 0x1B270 (120)
	struct Unknown AnimGraphNode_SequencePlayer_111; // 0x1B2E8 (120)
	struct Unknown AnimGraphNode_BlendSpacePlayer_48; // 0x1B360 (224)
	struct Unknown AnimGraphNode_BlendListByBool_12; // 0x1B440 (160)
	struct Unknown AnimGraphNode_SequencePlayer_110; // 0x1B4E0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_25; // 0x1B558 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_47; // 0x1B618 (224)
	struct Unknown AnimGraphNode_SequencePlayer_109; // 0x1B6F8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_24; // 0x1B770 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_27; // 0x1B830 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_46; // 0x1B8E0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_45; // 0x1B9C0 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_23; // 0x1BAA0 (192)
	struct Unknown AnimGraphNode_LayeredBoneBlend_22; // 0x1BB60 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_26; // 0x1BC20 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_25; // 0x1BCD0 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_24; // 0x1BD80 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_23; // 0x1BE30 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_21; // 0x1BEE0 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_44; // 0x1BFA0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_43; // 0x1C080 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_42; // 0x1C160 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_22; // 0x1C240 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_41; // 0x1C2F0 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_21; // 0x1C3D0 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_40; // 0x1C480 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_39; // 0x1C560 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_38; // 0x1C640 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_37; // 0x1C720 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_36; // 0x1C800 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_35; // 0x1C8E0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_34; // 0x1C9C0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_33; // 0x1CAA0 (224)
	struct Unknown AnimGraphNode_ApplyAdditive_7; // 0x1CB80 (200)
	struct Unknown AnimGraphNode_ApplyAdditive_6; // 0x1CC48 (200)
	struct Unknown AnimGraphNode_BlendListByBool_11; // 0x1CD10 (160)
	struct Unknown AnimGraphNode_StateResult_9; // 0x1CDB0 (48)
	struct Unknown AnimGraphNode_Slot_8; // 0x1CDE0 (72)
	struct Unknown AnimGraphNode_SequencePlayer_108; // 0x1CE28 (120)
	struct Unknown AnimGraphNode_SequencePlayer_107; // 0x1CEA0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_106; // 0x1CF18 (120)
	struct Unknown AnimGraphNode_BlendListByInt_12; // 0x1CF90 (160)
	struct Unknown AnimGraphNode_SequencePlayer_105; // 0x1D030 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_20; // 0x1D0A8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_104; // 0x1D168 (120)
	struct Unknown AnimGraphNode_SequencePlayer_103; // 0x1D1E0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_102; // 0x1D258 (120)
	struct Unknown AnimGraphNode_BlendListByBool_10; // 0x1D2D0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_101; // 0x1D370 (120)
	struct Unknown AnimGraphNode_SequencePlayer_100; // 0x1D3E8 (120)
	struct Unknown AnimGraphNode_BlendListByInt_11; // 0x1D460 (160)
	struct Unknown AnimGraphNode_SequencePlayer_99; // 0x1D500 (120)
	struct Unknown AnimGraphNode_SequencePlayer_98; // 0x1D578 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_19; // 0x1D5F0 (192)
	struct Unknown AnimGraphNode_SequencePlayer_97; // 0x1D6B0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_96; // 0x1D728 (120)
	struct Unknown AnimGraphNode_BlendListByInt_10; // 0x1D7A0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_95; // 0x1D840 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_18; // 0x1D8B8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_94; // 0x1D978 (120)
	struct Unknown AnimGraphNode_SequencePlayer_93; // 0x1D9F0 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_20; // 0x1DA68 (176)
	struct Unknown AnimGraphNode_SequencePlayer_92; // 0x1DB18 (120)
	struct Unknown AnimGraphNode_SequencePlayer_91; // 0x1DB90 (120)
	struct Unknown AnimGraphNode_SequencePlayer_90; // 0x1DC08 (120)
	struct Unknown AnimGraphNode_SequencePlayer_89; // 0x1DC80 (120)
	struct Unknown AnimGraphNode_SequencePlayer_88; // 0x1DCF8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_87; // 0x1DD70 (120)
	struct Unknown AnimGraphNode_BlendListByInt_9; // 0x1DDE8 (160)
	struct Unknown AnimGraphNode_SequencePlayer_86; // 0x1DE88 (120)
	struct Unknown AnimGraphNode_SequencePlayer_85; // 0x1DF00 (120)
	struct Unknown AnimGraphNode_SequencePlayer_84; // 0x1DF78 (120)
	struct Unknown AnimGraphNode_BlendListByInt_8; // 0x1DFF0 (160)
	struct Unknown AnimGraphNode_BlendListByInt_7; // 0x1E090 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_19; // 0x1E130 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_18; // 0x1E1E0 (176)
	struct Unknown AnimGraphNode_SequencePlayer_83; // 0x1E290 (120)
	struct Unknown AnimGraphNode_Slot_7; // 0x1E308 (72)
	struct Unknown AnimGraphNode_StateResult_8; // 0x1E350 (48)
	struct Unknown AnimGraphNode_StateMachine_3; // 0x1E380 (176)
	struct Unknown AnimGraphNode_StateResult_7; // 0x1E430 (48)
	struct Unknown AnimGraphNode_Slot_6; // 0x1E460 (72)
	struct Unknown AnimGraphNode_TransitionResult_15; // 0x1E4A8 (40)
	struct Unknown AnimGraphNode_TransitionResult_14; // 0x1E4D0 (40)
	struct Unknown AnimGraphNode_TransitionResult_13; // 0x1E4F8 (40)
	struct Unknown AnimGraphNode_TransitionResult_12; // 0x1E520 (40)
	struct Unknown AnimGraphNode_TransitionResult_11; // 0x1E548 (40)
	struct Unknown AnimGraphNode_TransitionResult_10; // 0x1E570 (40)
	struct Unknown AnimGraphNode_TransitionResult_9; // 0x1E598 (40)
	struct Unknown AnimGraphNode_TransitionResult_8; // 0x1E5C0 (40)
	struct Unknown AnimGraphNode_TransitionResult_7; // 0x1E5E8 (40)
	struct Unknown AnimGraphNode_TransitionResult_6; // 0x1E610 (40)
	struct Unknown AnimGraphNode_TransitionResult_5; // 0x1E638 (40)
	struct Unknown AnimGraphNode_TransitionResult_4; // 0x1E660 (40)
	struct Unknown AnimGraphNode_TransitionResult_3; // 0x1E688 (40)
	struct Unknown AnimGraphNode_TransitionResult_2; // 0x1E6B0 (40)
	struct Unknown AnimGraphNode_TransitionResult; // 0x1E6D8 (40)
	struct Unknown AnimGraphNode_SequencePlayer_82; // 0x1E700 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_17; // 0x1E778 (192)
	struct Unknown AnimGraphNode_SequencePlayer_81; // 0x1E838 (120)
	struct Unknown AnimGraphNode_SequencePlayer_80; // 0x1E8B0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_9; // 0x1E928 (160)
	struct Unknown AnimGraphNode_SequencePlayer_79; // 0x1E9C8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_78; // 0x1EA40 (120)
	struct Unknown AnimGraphNode_SequencePlayer_77; // 0x1EAB8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_76; // 0x1EB30 (120)
	struct Unknown AnimGraphNode_SequencePlayer_75; // 0x1EBA8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_74; // 0x1EC20 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_17; // 0x1EC98 (176)
	struct Unknown AnimGraphNode_StateResult_6; // 0x1ED48 (48)
	struct Unknown AnimGraphNode_SequencePlayer_73; // 0x1ED78 (120)
	struct Unknown AnimGraphNode_SequencePlayer_72; // 0x1EDF0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_71; // 0x1EE68 (120)
	struct Unknown AnimGraphNode_SequencePlayer_70; // 0x1EEE0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_69; // 0x1EF58 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_16; // 0x1EFD0 (176)
	struct Unknown AnimGraphNode_StateResult_5; // 0x1F080 (48)
	struct Unknown AnimGraphNode_SequencePlayer_68; // 0x1F0B0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_16; // 0x1F128 (192)
	struct Unknown AnimGraphNode_BlendListByBool_8; // 0x1F1E8 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_32; // 0x1F288 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_31; // 0x1F368 (224)
	struct Unknown AnimGraphNode_SequencePlayer_67; // 0x1F448 (120)
	struct Unknown AnimGraphNode_SequencePlayer_66; // 0x1F4C0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_65; // 0x1F538 (120)
	struct Unknown AnimGraphNode_SequencePlayer_64; // 0x1F5B0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_63; // 0x1F628 (120)
	struct Unknown AnimGraphNode_SequencePlayer_62; // 0x1F6A0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_61; // 0x1F718 (120)
	struct Unknown AnimGraphNode_SequencePlayer_60; // 0x1F790 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_15; // 0x1F808 (192)
	struct Unknown AnimGraphNode_BlendListByBool_7; // 0x1F8C8 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_30; // 0x1F968 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_29; // 0x1FA48 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_15; // 0x1FB28 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_14; // 0x1FBD8 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_13; // 0x1FC88 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_14; // 0x1FD38 (192)
	struct Unknown AnimGraphNode_BlendListByBool_6; // 0x1FDF8 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_28; // 0x1FE98 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_27; // 0x1FF78 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_12; // 0x20058 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_26; // 0x20108 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_25; // 0x201E8 (224)
	struct Unknown AnimGraphNode_BlendListByBool_5; // 0x202C8 (160)
	struct Unknown AnimGraphNode_BlendListByBool_4; // 0x20368 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_24; // 0x20408 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_23; // 0x204E8 (224)
	struct Unknown AnimGraphNode_BlendListByBool_3; // 0x205C8 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_22; // 0x20668 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_21; // 0x20748 (224)
	struct Unknown AnimGraphNode_StateResult_4; // 0x20828 (48)
	struct Unknown AnimGraphNode_SequencePlayer_59; // 0x20858 (120)
	struct Unknown AnimGraphNode_SequencePlayer_58; // 0x208D0 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_10; // 0x20948 (200)
	struct Unknown AnimGraphNode_LayeredBoneBlend_13; // 0x20A10 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_20; // 0x20AD0 (224)
	struct Unknown AnimGraphNode_SequencePlayer_57; // 0x20BB0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_12; // 0x20C28 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_19; // 0x20CE8 (224)
	struct Unknown AnimGraphNode_SequencePlayer_56; // 0x20DC8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_55; // 0x20E40 (120)
	struct Unknown AnimGraphNode_SequencePlayer_54; // 0x20EB8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_53; // 0x20F30 (120)
	struct Unknown AnimGraphNode_SequencePlayer_52; // 0x20FA8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_51; // 0x21020 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_9; // 0x21098 (200)
	struct Unknown AnimGraphNode_SequencePlayer_50; // 0x21160 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_11; // 0x211D8 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_18; // 0x21298 (224)
	struct Unknown AnimGraphNode_SequencePlayer_49; // 0x21378 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_10; // 0x213F0 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_17; // 0x214B0 (224)
	struct Unknown AnimGraphNode_BlendListByBool_2; // 0x21590 (160)
	struct Unknown AnimGraphNode_SequencePlayer_48; // 0x21630 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_8; // 0x216A8 (200)
	struct Unknown AnimGraphNode_BlendSpacePlayer_16; // 0x21770 (224)
	struct Unknown AnimGraphNode_SequencePlayer_47; // 0x21850 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_7; // 0x218C8 (200)
	struct Unknown AnimGraphNode_BlendSpacePlayer_15; // 0x21990 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_14; // 0x21A70 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_13; // 0x21B50 (224)
	struct Unknown AnimGraphNode_ApplyAdditive_5; // 0x21C30 (200)
	struct Unknown AnimGraphNode_ApplyAdditive_4; // 0x21CF8 (200)
	struct Unknown AnimGraphNode_BlendListByEnum_11; // 0x21DC0 (176)
	struct Unknown AnimGraphNode_IdentityPose; // 0x21E70 (24)
	struct Unknown AnimGraphNode_ApplyAdditive_3; // 0x21E88 (200)
	struct Unknown AnimGraphNode_SequencePlayer_46; // 0x21F50 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_6; // 0x21FC8 (200)
	struct Unknown AnimGraphNode_SequencePlayer_45; // 0x22090 (120)
	struct Unknown AnimGraphNode_SequencePlayer_44; // 0x22108 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_5; // 0x22180 (200)
	struct Unknown AnimGraphNode_SequencePlayer_43; // 0x22248 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_4; // 0x222C0 (200)
	struct Unknown AnimGraphNode_SequencePlayer_42; // 0x22388 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_3; // 0x22400 (200)
	struct Unknown AnimGraphNode_SequencePlayer_41; // 0x224C8 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_2; // 0x22540 (200)
	struct Unknown AnimGraphNode_SequencePlayer_40; // 0x22608 (120)
	struct Unknown AnimGraphNode_TwoWayBlend; // 0x22680 (200)
	struct Unknown AnimGraphNode_BlendListByEnum_10; // 0x22748 (176)
	struct Unknown AnimGraphNode_SequencePlayer_39; // 0x227F8 (120)
	struct Unknown AnimGraphNode_BlendSpacePlayer_12; // 0x22870 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_11; // 0x22950 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_9; // 0x22A30 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_9; // 0x22AF0 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_8; // 0x22BA0 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_10; // 0x22C60 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_7; // 0x22D40 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_9; // 0x22E00 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_8; // 0x22EE0 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_7; // 0x22F90 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_8; // 0x23040 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_7; // 0x23120 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_6; // 0x23200 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_5; // 0x232E0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_4; // 0x233C0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_3; // 0x234A0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_2; // 0x23580 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer; // 0x23660 (224)
	struct Unknown AnimGraphNode_ApplyAdditive_2; // 0x23740 (200)
	struct Unknown AnimGraphNode_ApplyAdditive; // 0x23808 (200)
	struct Unknown AnimGraphNode_BlendListByBool; // 0x238D0 (160)
	struct Unknown AnimGraphNode_StateResult_3; // 0x23970 (48)
	struct Unknown AnimGraphNode_SequencePlayer_38; // 0x239A0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_37; // 0x23A18 (120)
	struct Unknown AnimGraphNode_SequencePlayer_36; // 0x23A90 (120)
	struct Unknown AnimGraphNode_SequencePlayer_35; // 0x23B08 (120)
	struct Unknown AnimGraphNode_SequencePlayer_34; // 0x23B80 (120)
	struct Unknown AnimGraphNode_BlendListByInt_6; // 0x23BF8 (160)
	struct Unknown AnimGraphNode_LayeredBoneBlend_6; // 0x23C98 (192)
	struct Unknown AnimGraphNode_SequencePlayer_33; // 0x23D58 (120)
	struct Unknown AnimGraphNode_SequencePlayer_32; // 0x23DD0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_31; // 0x23E48 (120)
	struct Unknown AnimGraphNode_SequencePlayer_30; // 0x23EC0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_29; // 0x23F38 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_5; // 0x23FB0 (192)
	struct Unknown AnimGraphNode_SequencePlayer_28; // 0x24070 (120)
	struct Unknown AnimGraphNode_SequencePlayer_27; // 0x240E8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_4; // 0x24160 (192)
	struct Unknown AnimGraphNode_SequencePlayer_26; // 0x24220 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_3; // 0x24298 (192)
	struct Unknown AnimGraphNode_SequencePlayer_25; // 0x24358 (120)
	struct Unknown AnimGraphNode_SequencePlayer_24; // 0x243D0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_23; // 0x24448 (120)
	struct Unknown AnimGraphNode_SequencePlayer_22; // 0x244C0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_21; // 0x24538 (120)
	struct Unknown AnimGraphNode_BlendListByInt_5; // 0x245B0 (160)
	struct Unknown AnimGraphNode_LayeredBoneBlend_2; // 0x24650 (192)
	struct Unknown AnimGraphNode_SequencePlayer_20; // 0x24710 (120)
	struct Unknown AnimGraphNode_SequencePlayer_19; // 0x24788 (120)
	struct Unknown AnimGraphNode_SequencePlayer_18; // 0x24800 (120)
	struct Unknown AnimGraphNode_SequencePlayer_17; // 0x24878 (120)
	struct Unknown AnimGraphNode_BlendListByInt_4; // 0x248F0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_16; // 0x24990 (120)
	struct Unknown AnimGraphNode_SequencePlayer_15; // 0x24A08 (120)
	struct Unknown AnimGraphNode_SequencePlayer_14; // 0x24A80 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend; // 0x24AF8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_13; // 0x24BB8 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_6; // 0x24C30 (176)
	struct Unknown AnimGraphNode_SequencePlayer_12; // 0x24CE0 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_5; // 0x24D58 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_4; // 0x24E08 (176)
	struct Unknown AnimGraphNode_SequencePlayer_11; // 0x24EB8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_10; // 0x24F30 (120)
	struct Unknown AnimGraphNode_SequencePlayer_9; // 0x24FA8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_8; // 0x25020 (120)
	struct Unknown AnimGraphNode_SequencePlayer_7; // 0x25098 (120)
	struct Unknown AnimGraphNode_BlendListByInt_3; // 0x25110 (160)
	struct Unknown AnimGraphNode_SequencePlayer_6; // 0x251B0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_5; // 0x25228 (120)
	struct Unknown AnimGraphNode_SequencePlayer_4; // 0x252A0 (120)
	struct Unknown AnimGraphNode_BlendListByInt_2; // 0x25318 (160)
	struct Unknown AnimGraphNode_SequencePlayer_3; // 0x253B8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_2; // 0x25430 (120)
	struct Unknown AnimGraphNode_SequencePlayer; // 0x254A8 (120)
	struct Unknown AnimGraphNode_BlendListByInt; // 0x25520 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_3; // 0x255C0 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_2; // 0x25670 (176)
	struct Unknown AnimGraphNode_Slot_5; // 0x25720 (72)
	struct Unknown AnimGraphNode_StateResult_2; // 0x25768 (48)
	struct Unknown AnimGraphNode_StateMachine_2; // 0x25798 (176)
	struct Unknown AnimGraphNode_StateResult; // 0x25848 (48)
	struct Unknown AnimGraphNode_StateMachine; // 0x25878 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_12; // 0x25928 (184)
	struct Unknown AnimGraphNode_SaveCachedPose_11; // 0x259E0 (184)
	struct Unknown AnimGraphNode_UseCachedPose_23; // 0x25A98 (40)
	struct Unknown AnimGraphNode_UseCachedPose_22; // 0x25AC0 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_10; // 0x25AE8 (184)
	struct Unknown AnimGraphNode_UseCachedPose_21; // 0x25BA0 (40)
	struct Unknown AnimGraphNode_UseCachedPose_20; // 0x25BC8 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_9; // 0x25BF0 (184)
	struct Unknown AnimGraphNode_UseCachedPose_19; // 0x25CA8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_18; // 0x25CD0 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_8; // 0x25CF8 (184)
	struct Unknown AnimGraphNode_UseCachedPose_17; // 0x25DB0 (40)
	struct Unknown AnimGraphNode_UseCachedPose_16; // 0x25DD8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_15; // 0x25E00 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_7; // 0x25E28 (184)
	struct Unknown AnimGraphNode_SaveCachedPose_6; // 0x25EE0 (184)
	struct Unknown AnimGraphNode_UseCachedPose_14; // 0x25F98 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_5; // 0x25FC0 (184)
	struct Unknown AnimGraphNode_UseCachedPose_13; // 0x26078 (40)
	struct Unknown AnimGraphNode_UseCachedPose_12; // 0x260A0 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_4; // 0x260C8 (184)
	struct Unknown AnimGraphNode_UseCachedPose_11; // 0x26180 (40)
	struct Unknown AnimGraphNode_UseCachedPose_10; // 0x261A8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_9; // 0x261D0 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_3; // 0x261F8 (184)
	struct Unknown AnimGraphNode_UseCachedPose_8; // 0x262B0 (40)
	struct Unknown AnimGraphNode_UseCachedPose_7; // 0x262D8 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_2; // 0x26300 (184)
	struct Unknown AnimGraphNode_UseCachedPose_6; // 0x263B8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_5; // 0x263E0 (40)
	struct Unknown AnimGraphNode_Slot_4; // 0x26408 (72)
	struct Unknown AnimGraphNode_SaveCachedPose; // 0x26450 (184)
	struct Unknown AnimGraphNode_UseCachedPose_4; // 0x26508 (40)
	struct Unknown AnimGraphNode_UseCachedPose_3; // 0x26530 (40)
	struct Unknown AnimGraphNode_Slot_3; // 0x26558 (72)
	struct Unknown AnimGraphNode_Slot_2; // 0x265A0 (72)
	struct Unknown AnimGraphNode_BlendListByEnum; // 0x265E8 (176)
	struct Unknown AnimGraphNode_UseCachedPose_2; // 0x26698 (40)
	struct Unknown AnimGraphNode_UseCachedPose; // 0x266C0 (40)
	struct Unknown AnimGraphNode_Slot; // 0x266E8 (72)
	struct Unknown StoppingAnimation; // 0x26730 (8)
	struct FName AdditiveLandingSlot; // 0x26738 (8)
	float StoppingDirection; // 0x26740 (4)
	struct Unknown CameraLagTimer; // 0x26748 (8)
	struct Unknown SavedCameraArmLocation; // 0x26750 (12)
	char TestSprinting : 0; // 0x2675C (1)

	void AnimGraph(struct Unknown& AnimGraph); // Function ABP-DefaultMan_Native.ABP-DefaultMan_Native_C.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6E050>
	void ChooseStoppingAnim(struct Unknown& StoppingAnim); // Function ABP-DefaultMan_Native.ABP-DefaultMan_Native_C.ChooseStoppingAnim(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6E050>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-DefaultMan_Native_AnimGraphNode_TransitionResult_C088F08849AABF77B6110C8A6B219118(); // Function ABP-DefaultMan_Native.ABP-DefaultMan_Native_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-DefaultMan_Native_AnimGraphNode_TransitionResult_C088F08849AABF77B6110C8A6B219118(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6E050>
