// AnimBlueprintGeneratedClass ABP-Quadski.ABP-Quadski_C
class UABP-Quadski_C : public UBravoHotelVehicleAnimInstance {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0xA40 (8)
	struct FAnimNode_Root AnimGraphNode_Root; // 0xA48 (48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xA78 (40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xAA0 (40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xAC8 (40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xAF0 (40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0xB18 (40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xB40 (40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xB68 (40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xB90 (40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0xBB8 (120)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0xC30 (48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xC60 (120)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xCD8 (48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xD08 (120)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xD80 (48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xDB0 (40)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0xDD8 (32)
	struct FAnimNode_MeshSpaceRefPose AnimGraphNode_MeshRefPose_2; // 0xDF8 (16)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0xE08 (160)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xEA8 (120)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xF20 (192)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0xFE0 (32)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x1000 (32)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x1020 (264)
	struct FAnimNode_WheelHandler AnimGraphNode_WheelHandler_2; // 0x1128 (224)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x1208 (120)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x1280 (48)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_12; // 0x12B0 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_11; // 0x13A0 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_10; // 0x1490 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_9; // 0x1580 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_8; // 0x1670 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_7; // 0x1760 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_6; // 0x1850 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_5; // 0x1940 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_4; // 0x1A30 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_3; // 0x1B20 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_2; // 0x1C10 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1D00 (240)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x1DF0 (32)
	struct FAnimNode_MeshSpaceRefPose AnimGraphNode_MeshRefPose; // 0x1E10 (16)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1E20 (160)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x1EC0 (1088)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2300 (32)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2320 (264)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2428 (32)
	struct FAnimNode_WheelHandler AnimGraphNode_WheelHandler; // 0x2448 (224)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2528 (120)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x25A0 (48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x25D0 (176)
	char bIsAmphibiousMode : 0; // 0x2680 (1)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP-Quadski.ABP-Quadski_C.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_C584BAB4475226CF5A96DA84563281E0(); // Function ABP-Quadski.ABP-Quadski_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_C584BAB4475226CF5A96DA84563281E0(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_5B320C8249FFAA1FF5372BA69A6E9633(); // Function ABP-Quadski.ABP-Quadski_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_5B320C8249FFAA1FF5372BA69A6E9633(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP-Quadski.ABP-Quadski_C.BlueprintUpdateAnimation(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
	void ExecuteUbergraph_ABP-Quadski(int32_t EntryPoint); // Function ABP-Quadski.ABP-Quadski_C.ExecuteUbergraph_ABP-Quadski(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
};

// Function ABP-Quadski.ABP-Quadski_C.AnimGraph
inline void UABP-Quadski_C::AnimGraph(struct FPoseLink& AnimGraph) {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Quadski.ABP-Quadski_C.AnimGraph");

	struct AnimGraph_Params {
		struct FPoseLink& AnimGraph;
	}; AnimGraph_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;

	AnimGraph = Params.AnimGraph;

}

// Function ABP-Quadski.ABP-Quadski_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_C584BAB4475226CF5A96DA84563281E0
inline void UABP-Quadski_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_C584BAB4475226CF5A96DA84563281E0() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Quadski.ABP-Quadski_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_C584BAB4475226CF5A96DA84563281E0");

	struct EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_C584BAB4475226CF5A96DA84563281E0_Params {
		
	}; EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_C584BAB4475226CF5A96DA84563281E0_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Quadski.ABP-Quadski_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_5B320C8249FFAA1FF5372BA69A6E9633
inline void UABP-Quadski_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_5B320C8249FFAA1FF5372BA69A6E9633() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Quadski.ABP-Quadski_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_5B320C8249FFAA1FF5372BA69A6E9633");

	struct EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_5B320C8249FFAA1FF5372BA69A6E9633_Params {
		
	}; EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_5B320C8249FFAA1FF5372BA69A6E9633_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Quadski.ABP-Quadski_C.BlueprintUpdateAnimation
inline void UABP-Quadski_C::BlueprintUpdateAnimation(float DeltaTimeX) {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Quadski.ABP-Quadski_C.BlueprintUpdateAnimation");

	struct BlueprintUpdateAnimation_Params {
		float DeltaTimeX;
	}; BlueprintUpdateAnimation_Params Params;

	Params.DeltaTimeX = DeltaTimeX;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Quadski.ABP-Quadski_C.ExecuteUbergraph_ABP-Quadski
inline void UABP-Quadski_C::ExecuteUbergraph_ABP-Quadski(int32_t EntryPoint) {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Quadski.ABP-Quadski_C.ExecuteUbergraph_ABP-Quadski");

	struct ExecuteUbergraph_ABP-Quadski_Params {
		int32_t EntryPoint;
	}; ExecuteUbergraph_ABP-Quadski_Params Params;

	Params.EntryPoint = EntryPoint;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

