// AnimBlueprintGeneratedClass ABP-Mannequin-PostProcess.ABP-Mannequin-PostProcess_C
class UABP-Mannequin-PostProcess_C : public UBravoHotelAnimInstancePostprocess {

public:

	struct Unknown UberGraphFrame; // 0x520 (8)
	struct Unknown AnimGraphNode_BlendListByBool_21; // 0x528 (160)
	struct Unknown AnimGraphNode_ModifyBone_21; // 0x5C8 (264)
	struct Unknown AnimGraphNode_TwoBoneIK_11; // 0x6D0 (480)
	struct Unknown AnimGraphNode_ModifyBone_20; // 0x8B0 (264)
	struct Unknown AnimGraphNode_TwoBoneIK_10; // 0x9C0 (480)
	struct Unknown AnimGraphNode_LocalToComponentSpace_20; // 0xBA0 (32)
	struct Unknown AnimGraphNode_ModifyBone_19; // 0xBC0 (264)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_20; // 0xCC8 (32)
	struct Unknown AnimGraphNode_SaveCachedPose_20; // 0xCE8 (184)
	struct Unknown AnimGraphNode_SaveCachedPose_19; // 0xDA0 (184)
	struct Unknown AnimGraphNode_ModifyBone_18; // 0xE58 (264)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_19; // 0xF60 (32)
	struct Unknown AnimGraphNode_BlendListByBool_20; // 0xF80 (160)
	struct Unknown AnimGraphNode_SaveCachedPose_18; // 0x1020 (184)
	struct Unknown AnimGraphNode_LocalToComponentSpace_19; // 0x10D8 (32)
	struct Unknown AnimGraphNode_UseCachedPose_43; // 0x10F8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_42; // 0x1120 (40)
	struct Unknown AnimGraphNode_UseCachedPose_41; // 0x1148 (40)
	struct Unknown AnimGraphNode_BlendListByBool_19; // 0x1170 (160)
	struct Unknown AnimGraphNode_UseCachedPose_40; // 0x1210 (40)
	struct Unknown AnimGraphNode_LocalToComponentSpace_18; // 0x1238 (32)
	struct Unknown AnimGraphNode_ModifyBone_17; // 0x1258 (264)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_18; // 0x1360 (32)
	struct Unknown AnimGraphNode_ModifyBone_16; // 0x1380 (264)
	struct Unknown AnimGraphNode_ModifyBone_15; // 0x1488 (264)
	struct Unknown AnimGraphNode_ModifyBone_14; // 0x1590 (264)
	struct Unknown AnimGraphNode_SaveCachedPose_17; // 0x1698 (184)
	struct Unknown AnimGraphNode_UseCachedPose_39; // 0x1750 (40)
	struct Unknown AnimGraphNode_LocalToComponentSpace_17; // 0x1778 (32)
	struct Unknown AnimGraphNode_BlendListByBool_18; // 0x1798 (160)
	struct Unknown AnimGraphNode_BlendListByBool_17; // 0x1838 (160)
	struct Unknown AnimGraphNode_UseCachedPose_38; // 0x18D8 (40)
	struct Unknown AnimGraphNode_ModifyBone_13; // 0x1900 (264)
	struct Unknown AnimGraphNode_BlendListByBool_16; // 0x1A08 (160)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_17; // 0x1AA8 (32)
	struct Unknown AnimGraphNode_LocalToComponentSpace_16; // 0x1AC8 (32)
	struct Unknown AnimGraphNode_UseCachedPose_37; // 0x1AE8 (40)
	struct Unknown AnimGraphNode_ModifyBone_12; // 0x1B10 (264)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_16; // 0x1C18 (32)
	struct Unknown AnimGraphNode_LocalToComponentSpace_15; // 0x1C38 (32)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_15; // 0x1C58 (32)
	struct Unknown AnimGraphNode_UseCachedPose_36; // 0x1C78 (40)
	struct Unknown AnimGraphNode_LocalToComponentSpace_14; // 0x1CA0 (32)
	struct Unknown AnimGraphNode_AnimDynamics_13; // 0x1CC0 (1088)
	struct Unknown AnimGraphNode_AnimDynamics_12; // 0x2100 (1088)
	struct Unknown AnimGraphNode_SaveCachedPose_16; // 0x2540 (184)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_14; // 0x25F8 (32)
	struct Unknown AnimGraphNode_ModifyBone_11; // 0x2618 (264)
	struct Unknown AnimGraphNode_ModifyBone_10; // 0x2720 (264)
	struct Unknown AnimGraphNode_ModifyBone_9; // 0x2828 (264)
	struct Unknown AnimGraphNode_LocalToComponentSpace_13; // 0x2930 (32)
	struct Unknown AnimGraphNode_SubInput; // 0x2950 (120)
	struct Unknown AnimGraphNode_Root; // 0x29C8 (48)
	struct Unknown AnimGraphNode_UseCachedPose_35; // 0x29F8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_34; // 0x2A20 (40)
	struct Unknown AnimGraphNode_HandIKRetargeting_3; // 0x2A48 (288)
	struct Unknown AnimGraphNode_TwoBoneIK_9; // 0x2B70 (480)
	struct Unknown AnimGraphNode_LocalToComponentSpace_12; // 0x2D50 (32)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_13; // 0x2D70 (32)
	struct Unknown AnimGraphNode_SaveCachedPose_15; // 0x2D90 (184)
	struct Unknown AnimGraphNode_BlendListByBool_15; // 0x2E48 (160)
	struct Unknown AnimGraphNode_SaveCachedPose_14; // 0x2EE8 (184)
	struct Unknown AnimGraphNode_TwoBoneIK_8; // 0x2FA0 (480)
	struct Unknown AnimGraphNode_LocalToComponentSpace_11; // 0x3180 (32)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_12; // 0x31A0 (32)
	struct Unknown AnimGraphNode_ModifyBone_8; // 0x31C0 (264)
	struct Unknown AnimGraphNode_ModifyBone_7; // 0x32C8 (264)
	struct Unknown AnimGraphNode_LocalToComponentSpace_10; // 0x33D0 (32)
	struct Unknown AnimGraphNode_TwoBoneIK_7; // 0x33F0 (480)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_11; // 0x35D0 (32)
	struct Unknown AnimGraphNode_HandIKRetargeting_2; // 0x35F0 (288)
	struct Unknown AnimGraphNode_BlendListByBool_14; // 0x3710 (160)
	struct Unknown AnimGraphNode_UseCachedPose_33; // 0x37B0 (40)
	struct Unknown AnimGraphNode_UseCachedPose_32; // 0x37D8 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_13; // 0x3800 (184)
	struct Unknown AnimGraphNode_ModifyBone_6; // 0x38B8 (264)
	struct Unknown AnimGraphNode_UseCachedPose_31; // 0x39C0 (40)
	struct Unknown AnimGraphNode_UseCachedPose_30; // 0x39E8 (40)
	struct Unknown AnimGraphNode_LayeredBoneBlend_2; // 0x3A10 (192)
	struct Unknown AnimGraphNode_SequencePlayer_2; // 0x3AD0 (120)
	struct Unknown AnimGraphNode_SaveCachedPose_12; // 0x3B48 (184)
	struct Unknown AnimGraphNode_UseCachedPose_29; // 0x3C00 (40)
	struct Unknown AnimGraphNode_UseCachedPose_28; // 0x3C28 (40)
	struct Unknown AnimGraphNode_LayeredBoneBlend; // 0x3C50 (192)
	struct Unknown AnimGraphNode_SequencePlayer; // 0x3D10 (120)
	struct Unknown AnimGraphNode_BlendListByBool_13; // 0x3D88 (160)
	struct Unknown AnimGraphNode_SaveCachedPose_11; // 0x3E28 (184)
	struct Unknown AnimGraphNode_BlendListByEnum; // 0x3EE0 (176)
	struct Unknown AnimGraphNode_UseCachedPose_27; // 0x3F90 (40)
	struct Unknown AnimGraphNode_UseCachedPose_26; // 0x3FB8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_25; // 0x3FE0 (40)
	struct Unknown AnimGraphNode_UseCachedPose_24; // 0x4008 (40)
	struct Unknown AnimGraphNode_AnimDynamics_11; // 0x4030 (1088)
	struct Unknown AnimGraphNode_AnimDynamics_10; // 0x4470 (1088)
	struct Unknown AnimGraphNode_AnimDynamics_9; // 0x48B0 (1088)
	struct Unknown AnimGraphNode_AnimDynamics_8; // 0x4CF0 (1088)
	struct Unknown AnimGraphNode_AnimDynamics_7; // 0x5130 (1088)
	struct Unknown AnimGraphNode_AnimDynamics_6; // 0x5570 (1088)
	struct Unknown AnimGraphNode_AnimDynamics_5; // 0x59B0 (1088)
	struct Unknown AnimGraphNode_ModifyBone_5; // 0x5DF0 (264)
	struct Unknown AnimGraphNode_HandIKRetargeting; // 0x5EF8 (288)
	struct Unknown AnimGraphNode_TwoBoneIK_6; // 0x6020 (480)
	struct Unknown AnimGraphNode_LocalToComponentSpace_9; // 0x6200 (32)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_10; // 0x6220 (32)
	struct Unknown AnimGraphNode_SaveCachedPose_10; // 0x6240 (184)
	struct Unknown AnimGraphNode_TwoBoneIK_5; // 0x6300 (480)
	struct Unknown AnimGraphNode_LocalToComponentSpace_8; // 0x64E0 (32)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_9; // 0x6500 (32)
	struct Unknown AnimGraphNode_SaveCachedPose_9; // 0x6520 (184)
	struct Unknown AnimGraphNode_UseCachedPose_23; // 0x65D8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_22; // 0x6600 (40)
	struct Unknown AnimGraphNode_BlendListByBool_12; // 0x6628 (160)
	struct Unknown AnimGraphNode_UseCachedPose_21; // 0x66C8 (40)
	struct Unknown AnimGraphNode_BlendListByBool_11; // 0x66F0 (160)
	struct Unknown AnimGraphNode_UseCachedPose_20; // 0x6790 (40)
	struct Unknown AnimGraphNode_UseCachedPose_19; // 0x67B8 (40)
	struct Unknown AnimGraphNode_LocalToComponentSpace_7; // 0x67E0 (32)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_8; // 0x6800 (32)
	struct Unknown AnimGraphNode_SaveCachedPose_8; // 0x6820 (184)
	struct Unknown AnimGraphNode_TwoBoneIK_4; // 0x68E0 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_3; // 0x6AC0 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_2; // 0x6CA0 (480)
	struct Unknown AnimGraphNode_TwoBoneIK; // 0x6E80 (480)
	struct Unknown AnimGraphNode_ModifyBone_4; // 0x7060 (264)
	struct Unknown AnimGraphNode_ModifyBone_3; // 0x7168 (264)
	struct Unknown AnimGraphNode_ModifyBone_2; // 0x7270 (264)
	struct Unknown AnimGraphNode_ModifyBone; // 0x7378 (264)
	struct Unknown AnimGraphNode_AnimDynamics_4; // 0x7480 (1088)
	struct Unknown AnimGraphNode_AnimDynamics_3; // 0x78C0 (1088)
	struct Unknown AnimGraphNode_KawaiiPhysics_26; // 0x7D00 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_25; // 0x7F50 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_24; // 0x81A0 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_23; // 0x83F0 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_22; // 0x8640 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_21; // 0x8890 (592)
	struct Unknown AnimGraphNode_BoneDrivenController_20; // 0x8AE0 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_19; // 0x8BF8 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_18; // 0x8D10 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_17; // 0x8E28 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_16; // 0x8F40 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_15; // 0x9058 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_14; // 0x9170 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_13; // 0x9288 (280)
	struct Unknown AnimGraphNode_KawaiiPhysics_20; // 0x93A0 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_19; // 0x95F0 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_18; // 0x9840 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_17; // 0x9A90 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_16; // 0x9CE0 (592)
	struct Unknown AnimGraphNode_BoneDrivenController_12; // 0x9F30 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_11; // 0xA048 (280)
	struct Unknown AnimGraphNode_KawaiiPhysics_15; // 0xA160 (592)
	struct Unknown AnimGraphNode_BoneDrivenController_10; // 0xA3B0 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_9; // 0xA4C8 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_8; // 0xA5E0 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_7; // 0xA6F8 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_6; // 0xA810 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_5; // 0xA928 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_4; // 0xAA40 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_3; // 0xAB58 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_2; // 0xAC70 (280)
	struct Unknown AnimGraphNode_BoneDrivenController; // 0xAD88 (280)
	struct Unknown AnimGraphNode_KawaiiPhysics_14; // 0xAEA0 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_13; // 0xB0F0 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_12; // 0xB340 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_11; // 0xB590 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_10; // 0xB7E0 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_9; // 0xBA30 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_8; // 0xBC80 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_7; // 0xBED0 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_6; // 0xC120 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_5; // 0xC370 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_4; // 0xC5C0 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_3; // 0xC810 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_2; // 0xCA60 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics; // 0xCCB0 (592)
	struct Unknown AnimGraphNode_AnimDynamics_2; // 0xCF00 (1088)
	struct Unknown AnimGraphNode_AnimDynamics; // 0xD340 (1088)
	struct Unknown AnimGraphNode_BlendListByBool_10; // 0xD780 (160)
	struct Unknown AnimGraphNode_UseCachedPose_18; // 0xD820 (40)
	struct Unknown AnimGraphNode_BlendListByBool_9; // 0xD848 (160)
	struct Unknown AnimGraphNode_UseCachedPose_17; // 0xD8E8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_16; // 0xD910 (40)
	struct Unknown AnimGraphNode_BlendListByBool_8; // 0xD938 (160)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_7; // 0xD9D8 (32)
	struct Unknown AnimGraphNode_UseCachedPose_15; // 0xD9F8 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_7; // 0xDA20 (184)
	struct Unknown AnimGraphNode_UseCachedPose_14; // 0xDAD8 (40)
	struct Unknown AnimGraphNode_LocalToComponentSpace_6; // 0xDB00 (32)
	struct Unknown AnimGraphNode_BlendListByBool_7; // 0xDB20 (160)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_6; // 0xDBC0 (32)
	struct Unknown AnimGraphNode_UseCachedPose_13; // 0xDBE0 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_6; // 0xDC08 (184)
	struct Unknown AnimGraphNode_UseCachedPose_12; // 0xDCC0 (40)
	struct Unknown AnimGraphNode_LocalToComponentSpace_5; // 0xDCE8 (32)
	struct Unknown AnimGraphNode_BlendListByBool_6; // 0xDD08 (160)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_5; // 0xDDA8 (32)
	struct Unknown AnimGraphNode_UseCachedPose_11; // 0xDDC8 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_5; // 0xDDF0 (184)
	struct Unknown AnimGraphNode_BlendListByBool_5; // 0xDEA8 (160)
	struct Unknown AnimGraphNode_UseCachedPose_10; // 0xDF48 (40)
	struct Unknown AnimGraphNode_UseCachedPose_9; // 0xDF70 (40)
	struct Unknown AnimGraphNode_LocalToComponentSpace_4; // 0xDF98 (32)
	struct Unknown AnimGraphNode_BlendListByBool_4; // 0xDFB8 (160)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_4; // 0xE058 (32)
	struct Unknown AnimGraphNode_UseCachedPose_8; // 0xE078 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_4; // 0xE0A0 (184)
	struct Unknown AnimGraphNode_UseCachedPose_7; // 0xE158 (40)
	struct Unknown AnimGraphNode_UseCachedPose_6; // 0xE180 (40)
	struct Unknown AnimGraphNode_BlendListByBool_3; // 0xE1A8 (160)
	struct Unknown AnimGraphNode_SaveCachedPose_3; // 0xE248 (184)
	struct Unknown AnimGraphNode_LocalToComponentSpace_3; // 0xE300 (32)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_3; // 0xE320 (32)
	struct Unknown AnimGraphNode_BlendListByBool_2; // 0xE340 (160)
	struct Unknown AnimGraphNode_UseCachedPose_5; // 0xE3E0 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_2; // 0xE408 (184)
	struct Unknown AnimGraphNode_UseCachedPose_4; // 0xE4C0 (40)
	struct Unknown AnimGraphNode_LocalToComponentSpace_2; // 0xE4E8 (32)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_2; // 0xE508 (32)
	struct Unknown AnimGraphNode_BlendListByBool; // 0xE528 (160)
	struct Unknown AnimGraphNode_SaveCachedPose; // 0xE5C8 (184)
	struct Unknown AnimGraphNode_UseCachedPose_3; // 0xE680 (40)
	struct Unknown AnimGraphNode_UseCachedPose_2; // 0xE6A8 (40)
	struct Unknown AnimGraphNode_LocalToComponentSpace; // 0xE6D0 (32)
	struct Unknown AnimGraphNode_ComponentToLocalSpace; // 0xE6F0 (32)
	struct Unknown AnimGraphNode_UseCachedPose; // 0xE710 (40)

	void AnimGraph(struct Unknown InPose, struct Unknown& AnimGraph); // Function ABP-Mannequin-PostProcess.ABP-Mannequin-PostProcess_C.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6E050>
	void ExecuteUbergraph_ABP-Mannequin-PostProcess(int32_t EntryPoint); // Function ABP-Mannequin-PostProcess.ABP-Mannequin-PostProcess_C.ExecuteUbergraph_ABP-Mannequin-PostProcess(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6E050>
};

// Function ABP-Mannequin-PostProcess.ABP-Mannequin-PostProcess_C.AnimGraph
inline void UABP-Mannequin-PostProcess_C::AnimGraph(struct Unknown InPose, struct Unknown& AnimGraph) {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Mannequin-PostProcess.ABP-Mannequin-PostProcess_C.AnimGraph");

	struct AnimGraph_Params {
		struct Unknown InPose;
		struct Unknown& AnimGraph;
	}; AnimGraph_Params Params;

	Params.InPose = InPose;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;

	AnimGraph = Params.AnimGraph;

}

// Function ABP-Mannequin-PostProcess.ABP-Mannequin-PostProcess_C.ExecuteUbergraph_ABP-Mannequin-PostProcess
inline void UABP-Mannequin-PostProcess_C::ExecuteUbergraph_ABP-Mannequin-PostProcess(int32_t EntryPoint) {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Mannequin-PostProcess.ABP-Mannequin-PostProcess_C.ExecuteUbergraph_ABP-Mannequin-PostProcess");

	struct ExecuteUbergraph_ABP-Mannequin-PostProcess_Params {
		int32_t EntryPoint;
	}; ExecuteUbergraph_ABP-Mannequin-PostProcess_Params Params;

	Params.EntryPoint = EntryPoint;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

