// AnimBlueprintGeneratedClass ABP-Jaguar.ABP-Jaguar_C
class UABP-Jaguar_C : public UBravoHotelVehicleAnimInstance {

public:

	struct Unknown UberGraphFrame; // 0xA30 (8)
	struct Unknown AnimGraphNode_LookAt_6; // 0xA40 (432)
	struct Unknown AnimGraphNode_CopyBone_12; // 0xBF0 (240)
	struct Unknown AnimGraphNode_LookAt_5; // 0xCE0 (432)
	struct Unknown AnimGraphNode_CopyBone_11; // 0xE90 (240)
	struct Unknown AnimGraphNode_LookAt_4; // 0xF80 (432)
	struct Unknown AnimGraphNode_CopyBone_10; // 0x1130 (240)
	struct Unknown AnimGraphNode_CopyBone_9; // 0x1220 (240)
	struct Unknown AnimGraphNode_LookAt_3; // 0x1310 (432)
	struct Unknown AnimGraphNode_CopyBone_8; // 0x14C0 (240)
	struct Unknown AnimGraphNode_CopyBone_7; // 0x15B0 (240)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_3; // 0x16A0 (32)
	struct Unknown AnimGraphNode_MeshRefPose_2; // 0x16C0 (16)
	struct Unknown AnimGraphNode_BlendListByBool_2; // 0x16D0 (160)
	struct Unknown AnimGraphNode_CopyBone_6; // 0x1770 (240)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_2; // 0x1860 (32)
	struct Unknown AnimGraphNode_CopyBone_5; // 0x1880 (240)
	struct Unknown AnimGraphNode_Root; // 0x1970 (48)
	struct Unknown AnimGraphNode_CopyBone_4; // 0x19A0 (240)
	struct Unknown AnimGraphNode_CopyBone_3; // 0x1A90 (240)
	struct Unknown AnimGraphNode_CopyBone_2; // 0x1B80 (240)
	struct Unknown AnimGraphNode_CopyBone; // 0x1C70 (240)
	struct Unknown AnimGraphNode_RotationMultiplier_2; // 0x1D60 (240)
	struct Unknown AnimGraphNode_LookAt_2; // 0x1E50 (432)
	struct Unknown AnimGraphNode_RotationMultiplier; // 0x2000 (240)
	struct Unknown AnimGraphNode_LookAt; // 0x20F0 (432)
	struct Unknown AnimGraphNode_TransitionResult_12; // 0x22A0 (40)
	struct Unknown AnimGraphNode_TransitionResult_11; // 0x22C8 (40)
	struct Unknown AnimGraphNode_TransitionResult_10; // 0x22F0 (40)
	struct Unknown AnimGraphNode_TransitionResult_9; // 0x2318 (40)
	struct Unknown AnimGraphNode_TransitionResult_8; // 0x2340 (40)
	struct Unknown AnimGraphNode_TransitionResult_7; // 0x2368 (40)
	struct Unknown AnimGraphNode_SequencePlayer_6; // 0x2390 (120)
	struct Unknown AnimGraphNode_StateResult_6; // 0x2408 (48)
	struct Unknown AnimGraphNode_SequencePlayer_5; // 0x2438 (120)
	struct Unknown AnimGraphNode_StateResult_5; // 0x24B0 (48)
	struct Unknown AnimGraphNode_SequencePlayer_4; // 0x24E0 (120)
	struct Unknown AnimGraphNode_StateResult_4; // 0x2558 (48)
	struct Unknown AnimGraphNode_StateMachine_2; // 0x2588 (176)
	struct Unknown AnimGraphNode_LocalToComponentSpace; // 0x2638 (32)
	struct Unknown AnimGraphNode_SaveCachedPose_2; // 0x2658 (184)
	struct Unknown AnimGraphNode_TransitionResult_6; // 0x2710 (40)
	struct Unknown AnimGraphNode_TransitionResult_5; // 0x2738 (40)
	struct Unknown AnimGraphNode_TransitionResult_4; // 0x2760 (40)
	struct Unknown AnimGraphNode_TransitionResult_3; // 0x2788 (40)
	struct Unknown AnimGraphNode_TransitionResult_2; // 0x27B0 (40)
	struct Unknown AnimGraphNode_TransitionResult; // 0x27D8 (40)
	struct Unknown AnimGraphNode_SequencePlayer_3; // 0x2800 (120)
	struct Unknown AnimGraphNode_StateResult_3; // 0x2878 (48)
	struct Unknown AnimGraphNode_SequencePlayer_2; // 0x28A8 (120)
	struct Unknown AnimGraphNode_StateResult_2; // 0x2920 (48)
	struct Unknown AnimGraphNode_SequencePlayer; // 0x2950 (120)
	struct Unknown AnimGraphNode_StateResult; // 0x29C8 (48)
	struct Unknown AnimGraphNode_StateMachine; // 0x29F8 (176)
	struct Unknown AnimGraphNode_SaveCachedPose; // 0x2AA8 (184)
	struct Unknown AnimGraphNode_LayeredBoneBlend_2; // 0x2B60 (192)
	struct Unknown AnimGraphNode_UseCachedPose_4; // 0x2C20 (40)
	struct Unknown AnimGraphNode_BlendListByBool; // 0x2C48 (160)
	struct Unknown AnimGraphNode_TwoWayBlend; // 0x2CE8 (200)
	struct Unknown AnimGraphNode_UseCachedPose_3; // 0x2DB0 (40)
	struct Unknown AnimGraphNode_UseCachedPose_2; // 0x2DD8 (40)
	struct Unknown AnimGraphNode_UseCachedPose; // 0x2E00 (40)
	struct Unknown AnimGraphNode_WheelHandler; // 0x2E28 (224)
	struct Unknown AnimGraphNode_MeshRefPose; // 0x2F08 (16)
	struct Unknown AnimGraphNode_ComponentToLocalSpace; // 0x2F18 (32)
	struct Unknown AnimGraphNode_LayeredBoneBlend; // 0x2F38 (192)

	void AnimGraph(struct Unknown& AnimGraph); // Function ABP-Jaguar.ABP-Jaguar_C.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_B4E46DA04232D436CA8AB7A7DF748FA0(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_B4E46DA04232D436CA8AB7A7DF748FA0(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_12D6BAAC48D8617280ABFE8702E64DBF(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_12D6BAAC48D8617280ABFE8702E64DBF(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_13C224B849356C6D3DD37382826D0405(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_13C224B849356C6D3DD37382826D0405(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_242BED4B45B1A7FDAE9E439F69FD83EF(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_242BED4B45B1A7FDAE9E439F69FD83EF(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_BAF725EF49AC581D85E7288C8F2C0291(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_BAF725EF49AC581D85E7288C8F2C0291(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_E80C90FB4B76E2B9607AC5AC0007B163(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_E80C90FB4B76E2B9607AC5AC0007B163(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_22F89B5F4C5458C220BE8B85DEDD2C33(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_22F89B5F4C5458C220BE8B85DEDD2C33(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_9E3117C348262890CD40EEB85D6D430D(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_9E3117C348262890CD40EEB85D6D430D(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_EDDB324546E00AFEB5F013959ADD4C28(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_EDDB324546E00AFEB5F013959ADD4C28(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_4FDE95304315E46EFC294CA76F3A3A16(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_4FDE95304315E46EFC294CA76F3A3A16(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_D2D4D25442E67A69AFA5DD8EFFA3A785(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_D2D4D25442E67A69AFA5DD8EFFA3A785(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_28F578EE445E01B1F320658013D226AA(); // Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_28F578EE445E01B1F320658013D226AA(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP-Jaguar.ABP-Jaguar_C.BlueprintUpdateAnimation(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void AnimNotify_FPP_Entered_Idle(); // Function ABP-Jaguar.ABP-Jaguar_C.AnimNotify_FPP_Entered_Idle(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void AnimNotify_FPP_Left_Idle(); // Function ABP-Jaguar.ABP-Jaguar_C.AnimNotify_FPP_Left_Idle(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void ExecuteUbergraph_ABP-Jaguar(int32_t EntryPoint); // Function ABP-Jaguar.ABP-Jaguar_C.ExecuteUbergraph_ABP-Jaguar(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
};

// Function ABP-Jaguar.ABP-Jaguar_C.AnimGraph
inline void UABP-Jaguar_C::AnimGraph(struct Unknown& AnimGraph) {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Jaguar.ABP-Jaguar_C.AnimGraph");

	struct AnimGraph_Params {
		struct Unknown& AnimGraph;
	}; AnimGraph_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;

	AnimGraph = Params.AnimGraph;

}

// Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_B4E46DA04232D436CA8AB7A7DF748FA0
inline void UABP-Jaguar_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_B4E46DA04232D436CA8AB7A7DF748FA0() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_B4E46DA04232D436CA8AB7A7DF748FA0");

	struct EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_B4E46DA04232D436CA8AB7A7DF748FA0_Params {
		
	}; EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_B4E46DA04232D436CA8AB7A7DF748FA0_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_12D6BAAC48D8617280ABFE8702E64DBF
inline void UABP-Jaguar_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_12D6BAAC48D8617280ABFE8702E64DBF() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_12D6BAAC48D8617280ABFE8702E64DBF");

	struct EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_12D6BAAC48D8617280ABFE8702E64DBF_Params {
		
	}; EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_12D6BAAC48D8617280ABFE8702E64DBF_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_13C224B849356C6D3DD37382826D0405
inline void UABP-Jaguar_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_13C224B849356C6D3DD37382826D0405() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_13C224B849356C6D3DD37382826D0405");

	struct EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_13C224B849356C6D3DD37382826D0405_Params {
		
	}; EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_13C224B849356C6D3DD37382826D0405_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_242BED4B45B1A7FDAE9E439F69FD83EF
inline void UABP-Jaguar_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_242BED4B45B1A7FDAE9E439F69FD83EF() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_242BED4B45B1A7FDAE9E439F69FD83EF");

	struct EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_242BED4B45B1A7FDAE9E439F69FD83EF_Params {
		
	}; EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_242BED4B45B1A7FDAE9E439F69FD83EF_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_BAF725EF49AC581D85E7288C8F2C0291
inline void UABP-Jaguar_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_BAF725EF49AC581D85E7288C8F2C0291() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_BAF725EF49AC581D85E7288C8F2C0291");

	struct EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_BAF725EF49AC581D85E7288C8F2C0291_Params {
		
	}; EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_BAF725EF49AC581D85E7288C8F2C0291_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_E80C90FB4B76E2B9607AC5AC0007B163
inline void UABP-Jaguar_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_E80C90FB4B76E2B9607AC5AC0007B163() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_E80C90FB4B76E2B9607AC5AC0007B163");

	struct EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_E80C90FB4B76E2B9607AC5AC0007B163_Params {
		
	}; EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_E80C90FB4B76E2B9607AC5AC0007B163_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_22F89B5F4C5458C220BE8B85DEDD2C33
inline void UABP-Jaguar_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_22F89B5F4C5458C220BE8B85DEDD2C33() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_22F89B5F4C5458C220BE8B85DEDD2C33");

	struct EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_22F89B5F4C5458C220BE8B85DEDD2C33_Params {
		
	}; EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_22F89B5F4C5458C220BE8B85DEDD2C33_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_9E3117C348262890CD40EEB85D6D430D
inline void UABP-Jaguar_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_9E3117C348262890CD40EEB85D6D430D() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_9E3117C348262890CD40EEB85D6D430D");

	struct EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_9E3117C348262890CD40EEB85D6D430D_Params {
		
	}; EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_9E3117C348262890CD40EEB85D6D430D_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_EDDB324546E00AFEB5F013959ADD4C28
inline void UABP-Jaguar_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_EDDB324546E00AFEB5F013959ADD4C28() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_EDDB324546E00AFEB5F013959ADD4C28");

	struct EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_EDDB324546E00AFEB5F013959ADD4C28_Params {
		
	}; EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_EDDB324546E00AFEB5F013959ADD4C28_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_4FDE95304315E46EFC294CA76F3A3A16
inline void UABP-Jaguar_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_4FDE95304315E46EFC294CA76F3A3A16() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_4FDE95304315E46EFC294CA76F3A3A16");

	struct EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_4FDE95304315E46EFC294CA76F3A3A16_Params {
		
	}; EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_4FDE95304315E46EFC294CA76F3A3A16_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_D2D4D25442E67A69AFA5DD8EFFA3A785
inline void UABP-Jaguar_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_D2D4D25442E67A69AFA5DD8EFFA3A785() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_D2D4D25442E67A69AFA5DD8EFFA3A785");

	struct EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_D2D4D25442E67A69AFA5DD8EFFA3A785_Params {
		
	}; EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_D2D4D25442E67A69AFA5DD8EFFA3A785_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_28F578EE445E01B1F320658013D226AA
inline void UABP-Jaguar_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_28F578EE445E01B1F320658013D226AA() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Jaguar.ABP-Jaguar_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_28F578EE445E01B1F320658013D226AA");

	struct EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_28F578EE445E01B1F320658013D226AA_Params {
		
	}; EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Jaguar_AnimGraphNode_TransitionResult_28F578EE445E01B1F320658013D226AA_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Jaguar.ABP-Jaguar_C.BlueprintUpdateAnimation
inline void UABP-Jaguar_C::BlueprintUpdateAnimation(float DeltaTimeX) {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Jaguar.ABP-Jaguar_C.BlueprintUpdateAnimation");

	struct BlueprintUpdateAnimation_Params {
		float DeltaTimeX;
	}; BlueprintUpdateAnimation_Params Params;

	Params.DeltaTimeX = DeltaTimeX;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Jaguar.ABP-Jaguar_C.AnimNotify_FPP_Entered_Idle
inline void UABP-Jaguar_C::AnimNotify_FPP_Entered_Idle() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Jaguar.ABP-Jaguar_C.AnimNotify_FPP_Entered_Idle");

	struct AnimNotify_FPP_Entered_Idle_Params {
		
	}; AnimNotify_FPP_Entered_Idle_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Jaguar.ABP-Jaguar_C.AnimNotify_FPP_Left_Idle
inline void UABP-Jaguar_C::AnimNotify_FPP_Left_Idle() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Jaguar.ABP-Jaguar_C.AnimNotify_FPP_Left_Idle");

	struct AnimNotify_FPP_Left_Idle_Params {
		
	}; AnimNotify_FPP_Left_Idle_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Jaguar.ABP-Jaguar_C.ExecuteUbergraph_ABP-Jaguar
inline void UABP-Jaguar_C::ExecuteUbergraph_ABP-Jaguar(int32_t EntryPoint) {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Jaguar.ABP-Jaguar_C.ExecuteUbergraph_ABP-Jaguar");

	struct ExecuteUbergraph_ABP-Jaguar_Params {
		int32_t EntryPoint;
	}; ExecuteUbergraph_ABP-Jaguar_Params Params;

	Params.EntryPoint = EntryPoint;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

