// AnimBlueprintGeneratedClass ABP-DefaultMan_Native.ABP-DefaultMan_Native_C
class UABP-DefaultMan_Native_C : public UBravoHotelAnimInstance {

public:

	struct Unknown UberGraphFrame; // 0xC80 (8)
	struct Unknown AnimGraphNode_Root; // 0xC88 (48)
	struct Unknown AnimGraphNode_TransitionResult_119; // 0xCB8 (40)
	struct Unknown AnimGraphNode_TransitionResult_118; // 0xCE0 (40)
	struct Unknown AnimGraphNode_TransitionResult_117; // 0xD08 (40)
	struct Unknown AnimGraphNode_TransitionResult_116; // 0xD30 (40)
	struct Unknown AnimGraphNode_TransitionResult_115; // 0xD58 (40)
	struct Unknown AnimGraphNode_TransitionResult_114; // 0xD80 (40)
	struct Unknown AnimGraphNode_TransitionResult_113; // 0xDA8 (40)
	struct Unknown AnimGraphNode_TransitionResult_112; // 0xDD0 (40)
	struct Unknown AnimGraphNode_TransitionResult_111; // 0xDF8 (40)
	struct Unknown AnimGraphNode_TransitionResult_110; // 0xE20 (40)
	struct Unknown AnimGraphNode_TransitionResult_109; // 0xE48 (40)
	struct Unknown AnimGraphNode_TransitionResult_108; // 0xE70 (40)
	struct Unknown AnimGraphNode_TransitionResult_107; // 0xE98 (40)
	struct Unknown AnimGraphNode_TransitionResult_106; // 0xEC0 (40)
	struct Unknown AnimGraphNode_TransitionResult_105; // 0xEE8 (40)
	struct Unknown AnimGraphNode_TransitionResult_104; // 0xF10 (40)
	struct Unknown AnimGraphNode_TransitionResult_103; // 0xF38 (40)
	struct Unknown AnimGraphNode_TransitionResult_102; // 0xF60 (40)
	struct Unknown AnimGraphNode_TransitionResult_101; // 0xF88 (40)
	struct Unknown AnimGraphNode_TransitionResult_100; // 0xFB0 (40)
	struct Unknown AnimGraphNode_TransitionResult_99; // 0xFD8 (40)
	struct Unknown AnimGraphNode_TransitionResult_98; // 0x1000 (40)
	struct Unknown AnimGraphNode_TransitionResult_97; // 0x1028 (40)
	struct Unknown AnimGraphNode_TransitionResult_96; // 0x1050 (40)
	struct Unknown AnimGraphNode_TransitionResult_95; // 0x1078 (40)
	struct Unknown AnimGraphNode_TransitionResult_94; // 0x10A0 (40)
	struct Unknown AnimGraphNode_TransitionResult_93; // 0x10C8 (40)
	struct Unknown AnimGraphNode_TransitionResult_92; // 0x10F0 (40)
	struct Unknown AnimGraphNode_TransitionResult_91; // 0x1118 (40)
	struct Unknown AnimGraphNode_TransitionResult_90; // 0x1140 (40)
	struct Unknown AnimGraphNode_TransitionResult_89; // 0x1168 (40)
	struct Unknown AnimGraphNode_TransitionResult_88; // 0x1190 (40)
	struct Unknown AnimGraphNode_TransitionResult_87; // 0x11B8 (40)
	struct Unknown AnimGraphNode_TransitionResult_86; // 0x11E0 (40)
	struct Unknown AnimGraphNode_TransitionResult_85; // 0x1208 (40)
	struct Unknown AnimGraphNode_TransitionResult_84; // 0x1230 (40)
	struct Unknown AnimGraphNode_TransitionResult_83; // 0x1258 (40)
	struct Unknown AnimGraphNode_TransitionResult_82; // 0x1280 (40)
	struct Unknown AnimGraphNode_SequencePlayer_345; // 0x12A8 (120)
	struct Unknown AnimGraphNode_StateResult_61; // 0x1320 (48)
	struct Unknown AnimGraphNode_TransitionResult_81; // 0x1350 (40)
	struct Unknown AnimGraphNode_SequencePlayer_344; // 0x1378 (120)
	struct Unknown AnimGraphNode_StateResult_60; // 0x13F0 (48)
	struct Unknown AnimGraphNode_SequencePlayer_343; // 0x1420 (120)
	struct Unknown AnimGraphNode_StateResult_59; // 0x1498 (48)
	struct Unknown AnimGraphNode_StateMachine_19; // 0x14C8 (176)
	struct Unknown AnimGraphNode_StateResult_58; // 0x1578 (48)
	struct Unknown AnimGraphNode_TransitionResult_80; // 0x15A8 (40)
	struct Unknown AnimGraphNode_TransitionResult_79; // 0x15D0 (40)
	struct Unknown AnimGraphNode_TransitionResult_78; // 0x15F8 (40)
	struct Unknown AnimGraphNode_TransitionResult_77; // 0x1620 (40)
	struct Unknown AnimGraphNode_SequencePlayer_342; // 0x1648 (120)
	struct Unknown AnimGraphNode_StateResult_57; // 0x16C0 (48)
	struct Unknown AnimGraphNode_BlendSpacePlayer_116; // 0x16F0 (224)
	struct Unknown AnimGraphNode_StateResult_56; // 0x17D0 (48)
	struct Unknown AnimGraphNode_SequencePlayer_341; // 0x1800 (120)
	struct Unknown AnimGraphNode_StateResult_55; // 0x1878 (48)
	struct Unknown AnimGraphNode_StateMachine_18; // 0x18A8 (176)
	struct Unknown AnimGraphNode_StateResult_54; // 0x1958 (48)
	struct Unknown AnimGraphNode_TransitionResult_76; // 0x1988 (40)
	struct Unknown AnimGraphNode_TransitionResult_75; // 0x19B0 (40)
	struct Unknown AnimGraphNode_SequencePlayer_340; // 0x19D8 (120)
	struct Unknown AnimGraphNode_BlendListByBool_83; // 0x1A50 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_69; // 0x1AF0 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_115; // 0x1BA0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_114; // 0x1C80 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_97; // 0x1D60 (192)
	struct Unknown AnimGraphNode_SequencePlayer_339; // 0x1E20 (120)
	struct Unknown AnimGraphNode_StateResult_53; // 0x1E98 (48)
	struct Unknown AnimGraphNode_SequencePlayer_338; // 0x1EC8 (120)
	struct Unknown AnimGraphNode_BlendListByBool_82; // 0x1F40 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_68; // 0x1FE0 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_113; // 0x2090 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_112; // 0x2170 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_96; // 0x2250 (192)
	struct Unknown AnimGraphNode_SequencePlayer_337; // 0x2310 (120)
	struct Unknown AnimGraphNode_StateResult_52; // 0x2388 (48)
	struct Unknown AnimGraphNode_SequencePlayer_336; // 0x23B8 (120)
	struct Unknown AnimGraphNode_BlendListByBool_81; // 0x2430 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_67; // 0x24D0 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_111; // 0x2580 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_110; // 0x2660 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_95; // 0x2740 (192)
	struct Unknown AnimGraphNode_SequencePlayer_335; // 0x2800 (120)
	struct Unknown AnimGraphNode_StateResult_51; // 0x2878 (48)
	struct Unknown AnimGraphNode_StateMachine_17; // 0x28A8 (176)
	struct Unknown AnimGraphNode_StateResult_50; // 0x2958 (48)
	struct Unknown AnimGraphNode_TransitionResult_74; // 0x2988 (40)
	struct Unknown AnimGraphNode_TransitionResult_73; // 0x29B0 (40)
	struct Unknown AnimGraphNode_TransitionResult_72; // 0x29D8 (40)
	struct Unknown AnimGraphNode_TransitionResult_71; // 0x2A00 (40)
	struct Unknown AnimGraphNode_TransitionResult_70; // 0x2A28 (40)
	struct Unknown AnimGraphNode_TransitionResult_69; // 0x2A50 (40)
	struct Unknown AnimGraphNode_TransitionResult_68; // 0x2A78 (40)
	struct Unknown AnimGraphNode_TransitionResult_67; // 0x2AA0 (40)
	struct Unknown AnimGraphNode_TransitionResult_66; // 0x2AC8 (40)
	struct Unknown AnimGraphNode_BlendListByBool_80; // 0x2AF0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_334; // 0x2B90 (120)
	struct Unknown AnimGraphNode_BlendListByBool_79; // 0x2C08 (160)
	struct Unknown AnimGraphNode_SequencePlayer_333; // 0x2CA8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_94; // 0x2D20 (192)
	struct Unknown AnimGraphNode_SequencePlayer_332; // 0x2DE0 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_66; // 0x2E58 (176)
	struct Unknown AnimGraphNode_SequencePlayer_331; // 0x2F08 (120)
	struct Unknown AnimGraphNode_StateResult_49; // 0x2F80 (48)
	struct Unknown AnimGraphNode_BlendListByBool_78; // 0x2FB0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_330; // 0x3050 (120)
	struct Unknown AnimGraphNode_SequencePlayer_329; // 0x30C8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_93; // 0x3140 (192)
	struct Unknown AnimGraphNode_BlendListByBool_77; // 0x3200 (160)
	struct Unknown AnimGraphNode_BlendListByBool_76; // 0x32A0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_328; // 0x3340 (120)
	struct Unknown AnimGraphNode_SequencePlayer_327; // 0x33B8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_326; // 0x3430 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_65; // 0x34A8 (176)
	struct Unknown AnimGraphNode_StateResult_48; // 0x3558 (48)
	struct Unknown AnimGraphNode_BlendSpacePlayer_109; // 0x3588 (224)
	struct Unknown AnimGraphNode_TransitionResult_65; // 0x3668 (40)
	struct Unknown AnimGraphNode_TransitionResult_64; // 0x3690 (40)
	struct Unknown AnimGraphNode_TransitionResult_63; // 0x36B8 (40)
	struct Unknown AnimGraphNode_TransitionResult_62; // 0x36E0 (40)
	struct Unknown AnimGraphNode_TransitionResult_61; // 0x3708 (40)
	struct Unknown AnimGraphNode_TransitionResult_60; // 0x3730 (40)
	struct Unknown AnimGraphNode_SequencePlayer_325; // 0x3758 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_24; // 0x37D0 (200)
	struct Unknown AnimGraphNode_SequencePlayer_324; // 0x3898 (120)
	struct Unknown AnimGraphNode_StateResult_47; // 0x3910 (48)
	struct Unknown AnimGraphNode_TwoWayBlend_23; // 0x3940 (200)
	struct Unknown AnimGraphNode_SequencePlayer_323; // 0x3A08 (120)
	struct Unknown AnimGraphNode_SequencePlayer_322; // 0x3A80 (120)
	struct Unknown AnimGraphNode_StateResult_46; // 0x3AF8 (48)
	struct Unknown AnimGraphNode_SequencePlayer_321; // 0x3B28 (120)
	struct Unknown AnimGraphNode_StateResult_45; // 0x3BA0 (48)
	struct Unknown AnimGraphNode_StateMachine_16; // 0x3BD0 (176)
	struct Unknown AnimGraphNode_BlendListByBool_75; // 0x3C80 (160)
	struct Unknown AnimGraphNode_StateResult_44; // 0x3D20 (48)
	struct Unknown AnimGraphNode_SequencePlayer_320; // 0x3D50 (120)
	struct Unknown AnimGraphNode_StateResult_43; // 0x3DC8 (48)
	struct Unknown AnimGraphNode_StateMachine_15; // 0x3DF8 (176)
	struct Unknown AnimGraphNode_StateResult_42; // 0x3EA8 (48)
	struct Unknown AnimGraphNode_SequencePlayer_319; // 0x3ED8 (120)
	struct Unknown AnimGraphNode_StateResult_41; // 0x3F50 (48)
	struct Unknown AnimGraphNode_SequencePlayer_318; // 0x3F80 (120)
	struct Unknown AnimGraphNode_BlendListByBool_74; // 0x3FF8 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_108; // 0x4098 (224)
	struct Unknown AnimGraphNode_StateResult_40; // 0x4178 (48)
	struct Unknown AnimGraphNode_TransitionResult_59; // 0x41A8 (40)
	struct Unknown AnimGraphNode_ApplyAdditive_17; // 0x41D0 (200)
	struct Unknown AnimGraphNode_BlendSpacePlayer_107; // 0x4298 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_106; // 0x4378 (224)
	struct Unknown AnimGraphNode_BlendListByBool_73; // 0x4458 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_105; // 0x44F8 (224)
	struct Unknown AnimGraphNode_StateResult_39; // 0x45D8 (48)
	struct Unknown AnimGraphNode_TransitionResult_58; // 0x4608 (40)
	struct Unknown AnimGraphNode_TransitionResult_57; // 0x4630 (40)
	struct Unknown AnimGraphNode_TransitionResult_56; // 0x4658 (40)
	struct Unknown AnimGraphNode_TransitionResult_55; // 0x4680 (40)
	struct Unknown AnimGraphNode_BlendSpacePlayer_104; // 0x46A8 (224)
	struct Unknown AnimGraphNode_StateResult_38; // 0x4788 (48)
	struct Unknown AnimGraphNode_BlendSpacePlayer_103; // 0x47B8 (224)
	struct Unknown AnimGraphNode_StateResult_37; // 0x4898 (48)
	struct Unknown AnimGraphNode_StateMachine_14; // 0x48C8 (176)
	struct Unknown AnimGraphNode_StateResult_36; // 0x4978 (48)
	struct Unknown AnimGraphNode_TransitionResult_54; // 0x49A8 (40)
	struct Unknown AnimGraphNode_TransitionResult_53; // 0x49D0 (40)
	struct Unknown AnimGraphNode_SequencePlayer_317; // 0x49F8 (120)
	struct Unknown AnimGraphNode_StateResult_35; // 0x4A70 (48)
	struct Unknown AnimGraphNode_SequencePlayer_316; // 0x4AA0 (120)
	struct Unknown AnimGraphNode_StateResult_34; // 0x4B18 (48)
	struct Unknown AnimGraphNode_StateMachine_13; // 0x4B48 (176)
	struct Unknown AnimGraphNode_StateResult_33; // 0x4BF8 (48)
	struct Unknown AnimGraphNode_StateMachine_12; // 0x4C28 (176)
	struct Unknown AnimGraphNode_StateResult_32; // 0x4CD8 (48)
	struct Unknown AnimGraphNode_SequencePlayer_315; // 0x4D08 (120)
	struct Unknown AnimGraphNode_SequencePlayer_314; // 0x4D80 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_92; // 0x4DF8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_313; // 0x4EB8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_312; // 0x4F30 (120)
	struct Unknown AnimGraphNode_SequencePlayer_311; // 0x4FA8 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_64; // 0x5020 (176)
	struct Unknown AnimGraphNode_SequencePlayer_310; // 0x50D0 (120)
	struct Unknown AnimGraphNode_StateResult_31; // 0x5148 (48)
	struct Unknown AnimGraphNode_SequencePlayer_309; // 0x5178 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_91; // 0x51F0 (192)
	struct Unknown AnimGraphNode_SequencePlayer_308; // 0x52B0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_90; // 0x5328 (192)
	struct Unknown AnimGraphNode_SequencePlayer_307; // 0x53E8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_306; // 0x5460 (120)
	struct Unknown AnimGraphNode_SequencePlayer_305; // 0x54D8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_89; // 0x5550 (192)
	struct Unknown AnimGraphNode_SequenceEvaluator_6; // 0x5610 (72)
	struct Unknown AnimGraphNode_SequencePlayer_304; // 0x5658 (120)
	struct Unknown AnimGraphNode_SequencePlayer_303; // 0x56D0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_302; // 0x5748 (120)
	struct Unknown AnimGraphNode_SequencePlayer_301; // 0x57C0 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_63; // 0x5838 (176)
	struct Unknown AnimGraphNode_SequencePlayer_300; // 0x58E8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_299; // 0x5960 (120)
	struct Unknown AnimGraphNode_SequencePlayer_298; // 0x59D8 (120)
	struct Unknown AnimGraphNode_BlendListByBool_72; // 0x5A50 (160)
	struct Unknown AnimGraphNode_SequenceEvaluator_5; // 0x5AF0 (72)
	struct Unknown AnimGraphNode_BlendListByBool_71; // 0x5B38 (160)
	struct Unknown AnimGraphNode_SequencePlayer_297; // 0x5BD8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_88; // 0x5C50 (192)
	struct Unknown AnimGraphNode_SequencePlayer_296; // 0x5D10 (120)
	struct Unknown AnimGraphNode_SequencePlayer_295; // 0x5D88 (120)
	struct Unknown AnimGraphNode_SequencePlayer_294; // 0x5E00 (120)
	struct Unknown AnimGraphNode_SequencePlayer_293; // 0x5E78 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_87; // 0x5EF0 (192)
	struct Unknown AnimGraphNode_BlendListByBool_70; // 0x5FB0 (160)
	struct Unknown AnimGraphNode_SequenceEvaluator_4; // 0x6050 (72)
	struct Unknown AnimGraphNode_SequenceEvaluator_3; // 0x6098 (72)
	struct Unknown AnimGraphNode_SequenceEvaluator_2; // 0x60E0 (72)
	struct Unknown AnimGraphNode_BlendListByEnum_62; // 0x6128 (176)
	struct Unknown AnimGraphNode_SequencePlayer_292; // 0x61D8 (120)
	struct Unknown AnimGraphNode_Slot_35; // 0x6250 (72)
	struct Unknown AnimGraphNode_SequencePlayer_291; // 0x6298 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_86; // 0x6310 (192)
	struct Unknown AnimGraphNode_BlendListByBool_69; // 0x63D0 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_61; // 0x6470 (176)
	struct Unknown AnimGraphNode_SequencePlayer_290; // 0x6520 (120)
	struct Unknown AnimGraphNode_BlendListByBool_68; // 0x6598 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_102; // 0x6638 (224)
	struct Unknown AnimGraphNode_ApplyAdditive_16; // 0x6718 (200)
	struct Unknown AnimGraphNode_StateResult_30; // 0x67E0 (48)
	struct Unknown AnimGraphNode_TransitionResult_52; // 0x6810 (40)
	struct Unknown AnimGraphNode_BlendListByEnum_60; // 0x6838 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_59; // 0x68E8 (176)
	struct Unknown AnimGraphNode_UseCachedPose_60; // 0x6998 (40)
	struct Unknown AnimGraphNode_LocalRefPose; // 0x69C0 (24)
	struct Unknown AnimGraphNode_Slot_34; // 0x69D8 (72)
	struct Unknown AnimGraphNode_LayeredBoneBlend_85; // 0x6A20 (192)
	struct Unknown AnimGraphNode_SequencePlayer_289; // 0x6AE0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_67; // 0x6B58 (160)
	struct Unknown AnimGraphNode_TwoWayBlend_22; // 0x6BF8 (200)
	struct Unknown AnimGraphNode_SequencePlayer_288; // 0x6CC0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_287; // 0x6D38 (120)
	struct Unknown AnimGraphNode_SequencePlayer_286; // 0x6DB0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_84; // 0x6E28 (192)
	struct Unknown AnimGraphNode_SequencePlayer_285; // 0x6EE8 (120)
	struct Unknown AnimGraphNode_StateResult_29; // 0x6F60 (48)
	struct Unknown AnimGraphNode_StateMachine_11; // 0x6F90 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_26; // 0x7040 (184)
	struct Unknown AnimGraphNode_LayeredBoneBlend_83; // 0x70F8 (192)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_9; // 0x71B8 (392)
	struct Unknown AnimGraphNode_BlendListByBool_66; // 0x7340 (160)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_8; // 0x73E0 (392)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_7; // 0x7568 (32)
	struct Unknown AnimGraphNode_LocalToComponentSpace_7; // 0x7588 (32)
	struct Unknown AnimGraphNode_ModifyBone_3; // 0x75A8 (264)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_7; // 0x76B0 (392)
	struct Unknown AnimGraphNode_BlendListByEnum_58; // 0x7838 (176)
	struct Unknown AnimGraphNode_BlendListByBool_65; // 0x78E8 (160)
	struct Unknown AnimGraphNode_Slot_33; // 0x7988 (72)
	struct Unknown AnimGraphNode_BlendListByBool_64; // 0x79D0 (160)
	struct Unknown AnimGraphNode_SaveCachedPose_25; // 0x7A70 (184)
	struct Unknown AnimGraphNode_Slot_32; // 0x7B28 (72)
	struct Unknown AnimGraphNode_SaveCachedPose_24; // 0x7B70 (184)
	struct Unknown AnimGraphNode_SaveCachedPose_23; // 0x7C28 (184)
	struct Unknown AnimGraphNode_UseCachedPose_59; // 0x7CE0 (40)
	struct Unknown AnimGraphNode_UseCachedPose_58; // 0x7D08 (40)
	struct Unknown AnimGraphNode_UseCachedPose_57; // 0x7D30 (40)
	struct Unknown AnimGraphNode_UseCachedPose_56; // 0x7D58 (40)
	struct Unknown AnimGraphNode_LayeredBoneBlend_82; // 0x7D80 (192)
	struct Unknown AnimGraphNode_UseCachedPose_55; // 0x7E40 (40)
	struct Unknown AnimGraphNode_BlendListByBool_63; // 0x7E68 (160)
	struct Unknown AnimGraphNode_Slot_31; // 0x7F08 (72)
	struct Unknown AnimGraphNode_UseCachedPose_54; // 0x7F50 (40)
	struct Unknown AnimGraphNode_UseCachedPose_53; // 0x7F78 (40)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_6; // 0x7FA0 (392)
	struct Unknown AnimGraphNode_UseCachedPose_52; // 0x8128 (40)
	struct Unknown AnimGraphNode_BlendListByBool_62; // 0x8150 (160)
	struct Unknown AnimGraphNode_BlendListByBool_61; // 0x81F0 (160)
	struct Unknown AnimGraphNode_LayeredBoneBlend_81; // 0x8290 (192)
	struct Unknown AnimGraphNode_UseCachedPose_51; // 0x8350 (40)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_5; // 0x8378 (392)
	struct Unknown AnimGraphNode_UseCachedPose_50; // 0x8500 (40)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_4; // 0x8528 (392)
	struct Unknown AnimGraphNode_BlendListByBool_60; // 0x86B0 (160)
	struct Unknown AnimGraphNode_Slot_30; // 0x8750 (72)
	struct Unknown AnimGraphNode_LayeredBoneBlend_80; // 0x8798 (192)
	struct Unknown AnimGraphNode_Slot_29; // 0x8858 (72)
	struct Unknown AnimGraphNode_BlendListByBool_59; // 0x88A0 (160)
	struct Unknown AnimGraphNode_Slot_28; // 0x8940 (72)
	struct Unknown AnimGraphNode_LayeredBoneBlend_79; // 0x8988 (192)
	struct Unknown AnimGraphNode_Slot_27; // 0x8A48 (72)
	struct Unknown AnimGraphNode_Slot_26; // 0x8A90 (72)
	struct Unknown AnimGraphNode_UseCachedPose_49; // 0x8AD8 (40)
	struct Unknown AnimGraphNode_ApplyAdditive_15; // 0x8B00 (200)
	struct Unknown AnimGraphNode_SequencePlayer_284; // 0x8BC8 (120)
	struct Unknown AnimGraphNode_Slot_25; // 0x8C40 (72)
	struct Unknown AnimGraphNode_ApplyAdditive_14; // 0x8C88 (200)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_3; // 0x8D50 (392)
	struct Unknown AnimGraphNode_BlendListByBool_58; // 0x8ED8 (160)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_2; // 0x8F78 (392)
	struct Unknown AnimGraphNode_UseCachedPose_48; // 0x9100 (40)
	struct Unknown AnimGraphNode_LayeredBoneBlend_78; // 0x9128 (192)
	struct Unknown AnimGraphNode_LayeredBoneBlend_77; // 0x91E8 (192)
	struct Unknown AnimGraphNode_SaveCachedPose_22; // 0x92A8 (184)
	struct Unknown AnimGraphNode_UseCachedPose_47; // 0x9360 (40)
	struct Unknown AnimGraphNode_UseCachedPose_46; // 0x9388 (40)
	struct Unknown AnimGraphNode_UseCachedPose_45; // 0x93B0 (40)
	struct Unknown AnimGraphNode_BlendListByBool_57; // 0x93D8 (160)
	struct Unknown AnimGraphNode_Slot_24; // 0x9478 (72)
	struct Unknown AnimGraphNode_BlendSpacePlayer_101; // 0x94C0 (224)
	struct Unknown AnimGraphNode_SequenceEvaluator; // 0x95A0 (72)
	struct Unknown AnimGraphNode_LocalToComponentSpace_6; // 0x95E8 (32)
	struct Unknown AnimGraphNode_ModifyBone_2; // 0x9608 (264)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_6; // 0x9710 (32)
	struct Unknown AnimGraphNode_BlendListByBool_56; // 0x9730 (160)
	struct Unknown AnimGraphNode_IdentityPose_7; // 0x97D0 (24)
	struct Unknown AnimGraphNode_LayeredBoneBlend_76; // 0x97E8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_283; // 0x98A8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_75; // 0x9920 (192)
	struct Unknown AnimGraphNode_IdentityPose_6; // 0x99E0 (24)
	struct Unknown AnimGraphNode_SequencePlayer_282; // 0x99F8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_74; // 0x9A70 (192)
	struct Unknown AnimGraphNode_IdentityPose_5; // 0x9B30 (24)
	struct Unknown AnimGraphNode_BlendListByEnum_57; // 0x9B48 (176)
	struct Unknown AnimGraphNode_SequencePlayer_281; // 0x9BF8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_73; // 0x9C70 (192)
	struct Unknown AnimGraphNode_IdentityPose_4; // 0x9D30 (24)
	struct Unknown AnimGraphNode_StateResult_28; // 0x9D48 (48)
	struct Unknown AnimGraphNode_StateMachine_10; // 0x9D78 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_21; // 0x9E28 (184)
	struct Unknown AnimGraphNode_ApplyAdditive_13; // 0x9EE0 (200)
	struct Unknown AnimGraphNode_UseCachedPose_44; // 0x9FA8 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_20; // 0x9FD0 (184)
	struct Unknown AnimGraphNode_UseCachedPose_43; // 0xA088 (40)
	struct Unknown AnimGraphNode_BlendListByBool_55; // 0xA0B0 (160)
	struct Unknown AnimGraphNode_Slot_23; // 0xA150 (72)
	struct Unknown AnimGraphNode_SequencePlayer_280; // 0xA198 (120)
	struct Unknown AnimGraphNode_BlendListByBool_54; // 0xA210 (160)
	struct Unknown AnimGraphNode_BlendListByBool_53; // 0xA2B0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_279; // 0xA350 (120)
	struct Unknown AnimGraphNode_LocalToComponentSpace_5; // 0xA3C8 (32)
	struct Unknown AnimGraphNode_ModifyBone; // 0xA3E8 (264)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_5; // 0xA4F0 (32)
	struct Unknown AnimGraphNode_BlendListByBool_52; // 0xA510 (160)
	struct Unknown AnimGraphNode_Slot_22; // 0xA5B0 (72)
	struct Unknown AnimGraphNode_Slot_21; // 0xA5F8 (72)
	struct Unknown AnimGraphNode_Slot_20; // 0xA640 (72)
	struct Unknown AnimGraphNode_IdentityPose_3; // 0xA688 (24)
	struct Unknown AnimGraphNode_SequencePlayer_278; // 0xA6A0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_51; // 0xA718 (160)
	struct Unknown AnimGraphNode_BlendListByBool_50; // 0xA7B8 (160)
	struct Unknown AnimGraphNode_SequencePlayer_277; // 0xA858 (120)
	struct Unknown AnimGraphNode_StateResult_27; // 0xA8D0 (48)
	struct Unknown AnimGraphNode_StateMachine_9; // 0xA900 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_19; // 0xA9B0 (184)
	struct Unknown AnimGraphNode_UseCachedPose_42; // 0xAA68 (40)
	struct Unknown AnimGraphNode_UseCachedPose_41; // 0xAA90 (40)
	struct Unknown AnimGraphNode_BlendListByBool_49; // 0xAAB8 (160)
	struct Unknown AnimGraphNode_TwoWayBlend_21; // 0xAB58 (200)
	struct Unknown AnimGraphNode_Slot_19; // 0xAC20 (72)
	struct Unknown AnimGraphNode_BlendListByBool_48; // 0xAC68 (160)
	struct Unknown AnimGraphNode_Slot_18; // 0xAD08 (72)
	struct Unknown AnimGraphNode_LayeredBoneBlend_72; // 0xAD50 (192)
	struct Unknown AnimGraphNode_UseCachedPose_40; // 0xAE10 (40)
	struct Unknown AnimGraphNode_UseCachedPose_39; // 0xAE38 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_18; // 0xAE60 (184)
	struct Unknown AnimGraphNode_UseCachedPose_38; // 0xAF18 (40)
	struct Unknown AnimGraphNode_UseCachedPose_37; // 0xAF40 (40)
	struct Unknown AnimGraphNode_Slot_17; // 0xAF68 (72)
	struct Unknown AnimGraphNode_LayeredBoneBlend_71; // 0xAFB0 (192)
	struct Unknown AnimGraphNode_Slot_16; // 0xB070 (72)
	struct Unknown AnimGraphNode_UseCachedPose_36; // 0xB0B8 (40)
	struct Unknown AnimGraphNode_SequencePlayer_276; // 0xB0E0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_275; // 0xB158 (120)
	struct Unknown AnimGraphNode_BlendListByInt_20; // 0xB1D0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_274; // 0xB270 (120)
	struct Unknown AnimGraphNode_SequencePlayer_273; // 0xB2E8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_272; // 0xB360 (120)
	struct Unknown AnimGraphNode_BlendListByInt_19; // 0xB3D8 (160)
	struct Unknown AnimGraphNode_SequencePlayer_271; // 0xB478 (120)
	struct Unknown AnimGraphNode_SequencePlayer_270; // 0xB4F0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_269; // 0xB568 (120)
	struct Unknown AnimGraphNode_BlendListByInt_18; // 0xB5E0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_268; // 0xB680 (120)
	struct Unknown AnimGraphNode_SequencePlayer_267; // 0xB6F8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_266; // 0xB770 (120)
	struct Unknown AnimGraphNode_BlendListByInt_17; // 0xB7E8 (160)
	struct Unknown AnimGraphNode_SequencePlayer_265; // 0xB888 (120)
	struct Unknown AnimGraphNode_BlendListByBool_47; // 0xB900 (160)
	struct Unknown AnimGraphNode_BlendListByBool_46; // 0xB9A0 (160)
	struct Unknown AnimGraphNode_BlendListByBool_45; // 0xBA40 (160)
	struct Unknown AnimGraphNode_StateResult_26; // 0xBAE0 (48)
	struct Unknown AnimGraphNode_StateMachine_8; // 0xBB10 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_17; // 0xBBC0 (184)
	struct Unknown AnimGraphNode_ApplyAdditive_12; // 0xBC78 (200)
	struct Unknown AnimGraphNode_UseCachedPose_35; // 0xBD40 (40)
	struct Unknown AnimGraphNode_BlendListByBool_44; // 0xBD68 (160)
	struct Unknown AnimGraphNode_SequencePlayer_264; // 0xBE08 (120)
	struct Unknown AnimGraphNode_SequencePlayer_263; // 0xBE80 (120)
	struct Unknown AnimGraphNode_SequencePlayer_262; // 0xBEF8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_261; // 0xBF70 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_56; // 0xBFE8 (176)
	struct Unknown AnimGraphNode_StateResult_25; // 0xC098 (48)
	struct Unknown AnimGraphNode_StateMachine_7; // 0xC0C8 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_16; // 0xC178 (184)
	struct Unknown AnimGraphNode_LayeredBoneBlend_70; // 0xC230 (192)
	struct Unknown AnimGraphNode_UseCachedPose_34; // 0xC2F0 (40)
	struct Unknown AnimGraphNode_BlendListByBool_43; // 0xC318 (160)
	struct Unknown AnimGraphNode_BlendListByBool_42; // 0xC3B8 (160)
	struct Unknown AnimGraphNode_SequencePlayer_260; // 0xC458 (120)
	struct Unknown AnimGraphNode_SequencePlayer_259; // 0xC4D0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_41; // 0xC548 (160)
	struct Unknown AnimGraphNode_SequencePlayer_258; // 0xC5E8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_257; // 0xC660 (120)
	struct Unknown AnimGraphNode_StateResult_24; // 0xC6D8 (48)
	struct Unknown AnimGraphNode_StateMachine_6; // 0xC708 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_15; // 0xC7B8 (184)
	struct Unknown AnimGraphNode_BlendListByBool_40; // 0xC870 (160)
	struct Unknown AnimGraphNode_BlendListByBool_39; // 0xC910 (160)
	struct Unknown AnimGraphNode_UseCachedPose_33; // 0xC9B0 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_14; // 0xC9D8 (184)
	struct Unknown AnimGraphNode_UseCachedPose_32; // 0xCA90 (40)
	struct Unknown AnimGraphNode_Slot_15; // 0xCAB8 (72)
	struct Unknown AnimGraphNode_LayeredBoneBlend_69; // 0xCB00 (192)
	struct Unknown AnimGraphNode_UseCachedPose_31; // 0xCBC0 (40)
	struct Unknown AnimGraphNode_TwoBoneIK_11; // 0xCBF0 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_10; // 0xCDD0 (480)
	struct Unknown AnimGraphNode_LocalToComponentSpace_4; // 0xCFB0 (32)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_4; // 0xCFD0 (32)
	struct Unknown AnimGraphNode_SaveCachedPose_13; // 0xCFF0 (184)
	struct Unknown AnimGraphNode_UseCachedPose_30; // 0xD0A8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_29; // 0xD0D0 (40)
	struct Unknown AnimGraphNode_TwoBoneIK_9; // 0xD100 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_8; // 0xD2E0 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_7; // 0xD4C0 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_6; // 0xD6A0 (480)
	struct Unknown AnimGraphNode_LocalToComponentSpace_3; // 0xD880 (32)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_3; // 0xD8A0 (32)
	struct Unknown AnimGraphNode_TwoBoneIK_5; // 0xD8C0 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_4; // 0xDAA0 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_3; // 0xDC80 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_2; // 0xDE60 (480)
	struct Unknown AnimGraphNode_LocalToComponentSpace_2; // 0xE040 (32)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_2; // 0xE060 (32)
	struct Unknown AnimGraphNode_UseCachedPose_28; // 0xE080 (40)
	struct Unknown AnimGraphNode_UseCachedPose_27; // 0xE0A8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_26; // 0xE0D0 (40)
	struct Unknown AnimGraphNode_Slot_14; // 0xE0F8 (72)
	struct Unknown AnimGraphNode_BlendListByEnum_55; // 0xE140 (176)
	struct Unknown AnimGraphNode_BlendListByBool_38; // 0xE1F0 (160)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace; // 0xE290 (392)
	struct Unknown AnimGraphNode_UseCachedPose_25; // 0xE418 (40)
	struct Unknown AnimGraphNode_SequencePlayer_256; // 0xE440 (120)
	struct Unknown AnimGraphNode_BlendListByBool_37; // 0xE4B8 (160)
	struct Unknown AnimGraphNode_Slot_13; // 0xE558 (72)
	struct Unknown AnimGraphNode_Slot_12; // 0xE5A0 (72)
	struct Unknown AnimGraphNode_BlendListByBool_36; // 0xE5E8 (160)
	struct Unknown AnimGraphNode_SequencePlayer_255; // 0xE688 (120)
	struct Unknown AnimGraphNode_SequencePlayer_254; // 0xE700 (120)
	struct Unknown AnimGraphNode_BlendListByBool_35; // 0xE778 (160)
	struct Unknown AnimGraphNode_LayeredBoneBlend_68; // 0xE818 (192)
	struct Unknown AnimGraphNode_Slot_11; // 0xE8D8 (72)
	struct Unknown AnimGraphNode_BlendListByBool_34; // 0xE920 (160)
	struct Unknown AnimGraphNode_LayeredBoneBlend_67; // 0xE9C0 (192)
	struct Unknown AnimGraphNode_Slot_10; // 0xEA80 (72)
	struct Unknown AnimGraphNode_BlendListByBool_33; // 0xEAC8 (160)
	struct Unknown AnimGraphNode_ApplyAdditive_11; // 0xEB68 (200)
	struct Unknown AnimGraphNode_UseCachedPose_24; // 0xEC30 (40)
	struct Unknown AnimGraphNode_TransitionResult_51; // 0xEC58 (40)
	struct Unknown AnimGraphNode_TransitionResult_50; // 0xEC80 (40)
	struct Unknown AnimGraphNode_TransitionResult_49; // 0xECA8 (40)
	struct Unknown AnimGraphNode_TransitionResult_48; // 0xECD0 (40)
	struct Unknown AnimGraphNode_TransitionResult_47; // 0xECF8 (40)
	struct Unknown AnimGraphNode_TransitionResult_46; // 0xED20 (40)
	struct Unknown AnimGraphNode_TransitionResult_45; // 0xED48 (40)
	struct Unknown AnimGraphNode_TransitionResult_44; // 0xED70 (40)
	struct Unknown AnimGraphNode_TransitionResult_43; // 0xED98 (40)
	struct Unknown AnimGraphNode_TransitionResult_42; // 0xEDC0 (40)
	struct Unknown AnimGraphNode_TransitionResult_41; // 0xEDE8 (40)
	struct Unknown AnimGraphNode_TransitionResult_40; // 0xEE10 (40)
	struct Unknown AnimGraphNode_TransitionResult_39; // 0xEE38 (40)
	struct Unknown AnimGraphNode_TransitionResult_38; // 0xEE60 (40)
	struct Unknown AnimGraphNode_TransitionResult_37; // 0xEE88 (40)
	struct Unknown AnimGraphNode_TransitionResult_36; // 0xEEB0 (40)
	struct Unknown AnimGraphNode_TransitionResult_35; // 0xEED8 (40)
	struct Unknown AnimGraphNode_TransitionResult_34; // 0xEF00 (40)
	struct Unknown AnimGraphNode_TransitionResult_33; // 0xEF28 (40)
	struct Unknown AnimGraphNode_TransitionResult_32; // 0xEF50 (40)
	struct Unknown AnimGraphNode_TransitionResult_31; // 0xEF78 (40)
	struct Unknown AnimGraphNode_TransitionResult_30; // 0xEFA0 (40)
	struct Unknown AnimGraphNode_TransitionResult_29; // 0xEFC8 (40)
	struct Unknown AnimGraphNode_TransitionResult_28; // 0xEFF0 (40)
	struct Unknown AnimGraphNode_TransitionResult_27; // 0xF018 (40)
	struct Unknown AnimGraphNode_TransitionResult_26; // 0xF040 (40)
	struct Unknown AnimGraphNode_SequencePlayer_253; // 0xF068 (120)
	struct Unknown AnimGraphNode_SequencePlayer_252; // 0xF0E0 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_20; // 0xF158 (200)
	struct Unknown AnimGraphNode_LayeredBoneBlend_66; // 0xF220 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_100; // 0xF2E0 (224)
	struct Unknown AnimGraphNode_SequencePlayer_251; // 0xF3C0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_65; // 0xF438 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_99; // 0xF4F8 (224)
	struct Unknown AnimGraphNode_SequencePlayer_250; // 0xF5D8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_249; // 0xF650 (120)
	struct Unknown AnimGraphNode_SequencePlayer_248; // 0xF6C8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_247; // 0xF740 (120)
	struct Unknown AnimGraphNode_SequencePlayer_246; // 0xF7B8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_245; // 0xF830 (120)
	struct Unknown AnimGraphNode_SequencePlayer_244; // 0xF8A8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_243; // 0xF920 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_19; // 0xF998 (200)
	struct Unknown AnimGraphNode_SequencePlayer_242; // 0xFA60 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_64; // 0xFAD8 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_98; // 0xFB98 (224)
	struct Unknown AnimGraphNode_SequencePlayer_241; // 0xFC78 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_63; // 0xFCF0 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_97; // 0xFDB0 (224)
	struct Unknown AnimGraphNode_BlendListByBool_32; // 0xFE90 (160)
	struct Unknown AnimGraphNode_SequencePlayer_240; // 0xFF30 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_18; // 0xFFA8 (200)
	struct Unknown AnimGraphNode_BlendSpacePlayer_96; // 0x10070 (224)
	struct Unknown AnimGraphNode_SequencePlayer_239; // 0x10150 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_17; // 0x101C8 (200)
	struct Unknown AnimGraphNode_BlendSpacePlayer_95; // 0x10290 (224)
	struct Unknown AnimGraphNode_TwoWayBlend_16; // 0x10370 (200)
	struct Unknown AnimGraphNode_SequencePlayer_238; // 0x10438 (120)
	struct Unknown AnimGraphNode_SequencePlayer_237; // 0x104B0 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_15; // 0x10528 (200)
	struct Unknown AnimGraphNode_SequencePlayer_236; // 0x105F0 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_14; // 0x10668 (200)
	struct Unknown AnimGraphNode_SequencePlayer_235; // 0x10730 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_13; // 0x107A8 (200)
	struct Unknown AnimGraphNode_SequencePlayer_234; // 0x10870 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_12; // 0x108E8 (200)
	struct Unknown AnimGraphNode_SequencePlayer_233; // 0x109B0 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_11; // 0x10A28 (200)
	struct Unknown AnimGraphNode_BlendSpacePlayer_94; // 0x10AF0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_93; // 0x10BD0 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_62; // 0x10CB0 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_92; // 0x10D70 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_54; // 0x10E50 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_91; // 0x10F00 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_90; // 0x10FE0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_89; // 0x110C0 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_53; // 0x111A0 (176)
	struct Unknown AnimGraphNode_IdentityPose_2; // 0x11250 (24)
	struct Unknown AnimGraphNode_ApplyAdditive_10; // 0x11268 (200)
	struct Unknown AnimGraphNode_BlendListByEnum_52; // 0x11330 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_61; // 0x113E0 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_51; // 0x114A0 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_60; // 0x11550 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_88; // 0x11610 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_50; // 0x116F0 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_87; // 0x117A0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_86; // 0x11880 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_85; // 0x11960 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_84; // 0x11A40 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_83; // 0x11B20 (224)
	struct Unknown AnimGraphNode_ApplyAdditive_9; // 0x11C00 (200)
	struct Unknown AnimGraphNode_ApplyAdditive_8; // 0x11CC8 (200)
	struct Unknown AnimGraphNode_BlendListByBool_31; // 0x11D90 (160)
	struct Unknown AnimGraphNode_StateResult_23; // 0x11E30 (48)
	struct Unknown AnimGraphNode_SequencePlayer_232; // 0x11E60 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_59; // 0x11ED8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_231; // 0x11F98 (120)
	struct Unknown AnimGraphNode_SequencePlayer_230; // 0x12010 (120)
	struct Unknown AnimGraphNode_SequencePlayer_229; // 0x12088 (120)
	struct Unknown AnimGraphNode_SequencePlayer_228; // 0x12100 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_58; // 0x12178 (192)
	struct Unknown AnimGraphNode_LayeredBoneBlend_57; // 0x12238 (192)
	struct Unknown AnimGraphNode_SequencePlayer_227; // 0x122F8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_226; // 0x12370 (120)
	struct Unknown AnimGraphNode_SequencePlayer_225; // 0x123E8 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_49; // 0x12460 (176)
	struct Unknown AnimGraphNode_SequencePlayer_224; // 0x12510 (120)
	struct Unknown AnimGraphNode_StateResult_22; // 0x12588 (48)
	struct Unknown AnimGraphNode_SequencePlayer_223; // 0x125B8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_222; // 0x12630 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_56; // 0x126A8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_221; // 0x12768 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_55; // 0x127E0 (192)
	struct Unknown AnimGraphNode_SequencePlayer_220; // 0x128A0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_219; // 0x12918 (120)
	struct Unknown AnimGraphNode_SequencePlayer_218; // 0x12990 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_48; // 0x12A08 (176)
	struct Unknown AnimGraphNode_SequencePlayer_217; // 0x12AB8 (120)
	struct Unknown AnimGraphNode_StateResult_21; // 0x12B30 (48)
	struct Unknown AnimGraphNode_SequencePlayer_216; // 0x12B60 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_54; // 0x12BD8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_215; // 0x12C98 (120)
	struct Unknown AnimGraphNode_SequencePlayer_214; // 0x12D10 (120)
	struct Unknown AnimGraphNode_SequencePlayer_213; // 0x12D88 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_53; // 0x12E00 (192)
	struct Unknown AnimGraphNode_SequencePlayer_212; // 0x12EC0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_52; // 0x12F38 (192)
	struct Unknown AnimGraphNode_SequencePlayer_211; // 0x12FF8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_210; // 0x13070 (120)
	struct Unknown AnimGraphNode_SequencePlayer_209; // 0x130E8 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_47; // 0x13160 (176)
	struct Unknown AnimGraphNode_SequencePlayer_208; // 0x13210 (120)
	struct Unknown AnimGraphNode_StateResult_20; // 0x13288 (48)
	struct Unknown AnimGraphNode_StateMachine_5; // 0x132B8 (176)
	struct Unknown AnimGraphNode_StateResult_19; // 0x13368 (48)
	struct Unknown AnimGraphNode_LayeredBoneBlend_51; // 0x13398 (192)
	struct Unknown AnimGraphNode_SequencePlayer_207; // 0x13458 (120)
	struct Unknown AnimGraphNode_SequencePlayer_206; // 0x134D0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_205; // 0x13548 (120)
	struct Unknown AnimGraphNode_SequencePlayer_204; // 0x135C0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_203; // 0x13638 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_50; // 0x136B0 (192)
	struct Unknown AnimGraphNode_LayeredBoneBlend_49; // 0x13770 (192)
	struct Unknown AnimGraphNode_SequencePlayer_202; // 0x13830 (120)
	struct Unknown AnimGraphNode_SequencePlayer_201; // 0x138A8 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_46; // 0x13920 (176)
	struct Unknown AnimGraphNode_SequencePlayer_200; // 0x139D0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_199; // 0x13A48 (120)
	struct Unknown AnimGraphNode_StateResult_18; // 0x13AC0 (48)
	struct Unknown AnimGraphNode_LayeredBoneBlend_48; // 0x13AF0 (192)
	struct Unknown AnimGraphNode_SequencePlayer_198; // 0x13BB0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_197; // 0x13C28 (120)
	struct Unknown AnimGraphNode_SequencePlayer_196; // 0x13CA0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_195; // 0x13D18 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_47; // 0x13D90 (192)
	struct Unknown AnimGraphNode_SequencePlayer_194; // 0x13E50 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_46; // 0x13EC8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_193; // 0x13F88 (120)
	struct Unknown AnimGraphNode_SequencePlayer_192; // 0x14000 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_45; // 0x14078 (176)
	struct Unknown AnimGraphNode_SequencePlayer_191; // 0x14128 (120)
	struct Unknown AnimGraphNode_SequencePlayer_190; // 0x141A0 (120)
	struct Unknown AnimGraphNode_StateResult_17; // 0x14218 (48)
	struct Unknown AnimGraphNode_SequencePlayer_189; // 0x14248 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_45; // 0x142C0 (192)
	struct Unknown AnimGraphNode_SequencePlayer_188; // 0x14380 (120)
	struct Unknown AnimGraphNode_SequencePlayer_187; // 0x143F8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_186; // 0x14470 (120)
	struct Unknown AnimGraphNode_SequencePlayer_185; // 0x144E8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_184; // 0x14560 (120)
	struct Unknown AnimGraphNode_SequencePlayer_183; // 0x145D8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_182; // 0x14650 (120)
	struct Unknown AnimGraphNode_SequencePlayer_181; // 0x146C8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_44; // 0x14740 (192)
	struct Unknown AnimGraphNode_LayeredBoneBlend_43; // 0x14800 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_44; // 0x148C0 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_43; // 0x14970 (176)
	struct Unknown AnimGraphNode_SequencePlayer_180; // 0x14A20 (120)
	struct Unknown AnimGraphNode_SequencePlayer_179; // 0x14A98 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_42; // 0x14B10 (176)
	struct Unknown AnimGraphNode_SequencePlayer_178; // 0x14BC0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_177; // 0x14C38 (120)
	struct Unknown AnimGraphNode_StateResult_16; // 0x14CB0 (48)
	struct Unknown AnimGraphNode_SequencePlayer_176; // 0x14CE0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_42; // 0x14D58 (192)
	struct Unknown AnimGraphNode_SequencePlayer_175; // 0x14E18 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_41; // 0x14E90 (192)
	struct Unknown AnimGraphNode_SequencePlayer_174; // 0x14F50 (120)
	struct Unknown AnimGraphNode_SequencePlayer_173; // 0x14FC8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_172; // 0x15040 (120)
	struct Unknown AnimGraphNode_SequencePlayer_171; // 0x150B8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_170; // 0x15130 (120)
	struct Unknown AnimGraphNode_SequencePlayer_169; // 0x151A8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_168; // 0x15220 (120)
	struct Unknown AnimGraphNode_SequencePlayer_167; // 0x15298 (120)
	struct Unknown AnimGraphNode_SequencePlayer_166; // 0x15310 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_40; // 0x15388 (192)
	struct Unknown AnimGraphNode_SequencePlayer_165; // 0x15448 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_39; // 0x154C0 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_41; // 0x15580 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_40; // 0x15630 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_38; // 0x156E0 (192)
	struct Unknown AnimGraphNode_SequencePlayer_164; // 0x157A0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_163; // 0x15818 (120)
	struct Unknown AnimGraphNode_SequencePlayer_162; // 0x15890 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_39; // 0x15908 (176)
	struct Unknown AnimGraphNode_SequencePlayer_161; // 0x159B8 (120)
	struct Unknown AnimGraphNode_StateResult_15; // 0x15A30 (48)
	struct Unknown AnimGraphNode_TransitionResult_25; // 0x15A60 (40)
	struct Unknown AnimGraphNode_TransitionResult_24; // 0x15A88 (40)
	struct Unknown AnimGraphNode_TransitionResult_23; // 0x15AB0 (40)
	struct Unknown AnimGraphNode_TransitionResult_22; // 0x15AD8 (40)
	struct Unknown AnimGraphNode_TransitionResult_21; // 0x15B00 (40)
	struct Unknown AnimGraphNode_BlendListByBool_30; // 0x15B28 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_82; // 0x15BC8 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_81; // 0x15CA8 (224)
	struct Unknown AnimGraphNode_SequencePlayer_160; // 0x15D88 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_37; // 0x15E00 (192)
	struct Unknown AnimGraphNode_SequencePlayer_159; // 0x15EC0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_158; // 0x15F38 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_36; // 0x15FB0 (192)
	struct Unknown AnimGraphNode_BlendListByBool_29; // 0x16070 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_80; // 0x16110 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_79; // 0x161F0 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_35; // 0x162D0 (192)
	struct Unknown AnimGraphNode_BlendListByBool_28; // 0x16390 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_78; // 0x16430 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_77; // 0x16510 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_38; // 0x165F0 (176)
	struct Unknown AnimGraphNode_BlendListByBool_27; // 0x166A0 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_76; // 0x16740 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_75; // 0x16820 (224)
	struct Unknown AnimGraphNode_BlendListByBool_26; // 0x16900 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_74; // 0x169A0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_73; // 0x16A80 (224)
	struct Unknown AnimGraphNode_StateResult_14; // 0x16B60 (48)
	struct Unknown AnimGraphNode_BlendListByBool_25; // 0x16B90 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_72; // 0x16C30 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_71; // 0x16D10 (224)
	struct Unknown AnimGraphNode_SequencePlayer_157; // 0x16DF0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_156; // 0x16E68 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_34; // 0x16EE0 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_70; // 0x16FA0 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_33; // 0x17080 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_69; // 0x17140 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_68; // 0x17220 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_37; // 0x17300 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_67; // 0x173B0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_66; // 0x17490 (224)
	struct Unknown AnimGraphNode_StateResult_13; // 0x17570 (48)
	struct Unknown AnimGraphNode_SequencePlayer_155; // 0x175A0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_154; // 0x17618 (120)
	struct Unknown AnimGraphNode_SequencePlayer_153; // 0x17690 (120)
	struct Unknown AnimGraphNode_ComponentToLocalSpace; // 0x17708 (32)
	struct Unknown AnimGraphNode_LocalToComponentSpace; // 0x17728 (32)
	struct Unknown AnimGraphNode_TwoBoneIK; // 0x17750 (480)
	struct Unknown AnimGraphNode_SequencePlayer_152; // 0x17930 (120)
	struct Unknown AnimGraphNode_SequencePlayer_151; // 0x179A8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_32; // 0x17A20 (192)
	struct Unknown AnimGraphNode_SequencePlayer_150; // 0x17AE0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_31; // 0x17B58 (192)
	struct Unknown AnimGraphNode_SequencePlayer_149; // 0x17C18 (120)
	struct Unknown AnimGraphNode_SequencePlayer_148; // 0x17C90 (120)
	struct Unknown AnimGraphNode_BlendListByInt_16; // 0x17D08 (160)
	struct Unknown AnimGraphNode_SequencePlayer_147; // 0x17DA8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_146; // 0x17E20 (120)
	struct Unknown AnimGraphNode_SequencePlayer_145; // 0x17E98 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_36; // 0x17F10 (176)
	struct Unknown AnimGraphNode_SequencePlayer_144; // 0x17FC0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_24; // 0x18038 (160)
	struct Unknown AnimGraphNode_SequencePlayer_143; // 0x180D8 (120)
	struct Unknown AnimGraphNode_BlendListByBool_23; // 0x18150 (160)
	struct Unknown AnimGraphNode_SequencePlayer_142; // 0x181F0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_22; // 0x18268 (160)
	struct Unknown AnimGraphNode_SequencePlayer_141; // 0x18308 (120)
	struct Unknown AnimGraphNode_BlendListByBool_21; // 0x18380 (160)
	struct Unknown AnimGraphNode_SequencePlayer_140; // 0x18420 (120)
	struct Unknown AnimGraphNode_SequencePlayer_139; // 0x18498 (120)
	struct Unknown AnimGraphNode_SequencePlayer_138; // 0x18510 (120)
	struct Unknown AnimGraphNode_SequencePlayer_137; // 0x18588 (120)
	struct Unknown AnimGraphNode_BlendListByInt_15; // 0x18600 (160)
	struct Unknown AnimGraphNode_SequencePlayer_136; // 0x186A0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_135; // 0x18718 (120)
	struct Unknown AnimGraphNode_BlendListByInt_14; // 0x18790 (160)
	struct Unknown AnimGraphNode_SequencePlayer_134; // 0x18830 (120)
	struct Unknown AnimGraphNode_SequencePlayer_133; // 0x188A8 (120)
	struct Unknown AnimGraphNode_BlendListByInt_13; // 0x18920 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_35; // 0x189C0 (176)
	struct Unknown AnimGraphNode_SequencePlayer_132; // 0x18A70 (120)
	struct Unknown AnimGraphNode_SequencePlayer_131; // 0x18AE8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_130; // 0x18B60 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_34; // 0x18BD8 (176)
	struct Unknown AnimGraphNode_SequencePlayer_129; // 0x18C88 (120)
	struct Unknown AnimGraphNode_SequencePlayer_128; // 0x18D00 (120)
	struct Unknown AnimGraphNode_BlendListByBool_20; // 0x18D78 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_33; // 0x18E18 (176)
	struct Unknown AnimGraphNode_Slot_9; // 0x18EC8 (72)
	struct Unknown AnimGraphNode_SequencePlayer_127; // 0x18F10 (120)
	struct Unknown AnimGraphNode_StateResult_12; // 0x18F88 (48)
	struct Unknown AnimGraphNode_StateMachine_4; // 0x18FB8 (176)
	struct Unknown AnimGraphNode_StateResult_11; // 0x19068 (48)
	struct Unknown AnimGraphNode_TransitionResult_20; // 0x19098 (40)
	struct Unknown AnimGraphNode_TransitionResult_19; // 0x190C0 (40)
	struct Unknown AnimGraphNode_TransitionResult_18; // 0x190E8 (40)
	struct Unknown AnimGraphNode_TransitionResult_17; // 0x19110 (40)
	struct Unknown AnimGraphNode_TransitionResult_16; // 0x19138 (40)
	struct Unknown AnimGraphNode_SequencePlayer_126; // 0x19160 (120)
	struct Unknown AnimGraphNode_BlendSpacePlayer_65; // 0x191D8 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_64; // 0x192B8 (224)
	struct Unknown AnimGraphNode_BlendListByBool_19; // 0x19398 (160)
	struct Unknown AnimGraphNode_LayeredBoneBlend_30; // 0x19438 (192)
	struct Unknown AnimGraphNode_SequencePlayer_125; // 0x194F8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_124; // 0x19570 (120)
	struct Unknown AnimGraphNode_SequencePlayer_123; // 0x195E8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_122; // 0x19660 (120)
	struct Unknown AnimGraphNode_SequencePlayer_121; // 0x196D8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_120; // 0x19750 (120)
	struct Unknown AnimGraphNode_SequencePlayer_119; // 0x197C8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_118; // 0x19840 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_29; // 0x198B8 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_63; // 0x19978 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_62; // 0x19A58 (224)
	struct Unknown AnimGraphNode_BlendListByBool_18; // 0x19B38 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_32; // 0x19BD8 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_31; // 0x19C88 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_28; // 0x19D38 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_30; // 0x19DF8 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_61; // 0x19EA8 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_60; // 0x19F88 (224)
	struct Unknown AnimGraphNode_BlendListByBool_17; // 0x1A068 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_59; // 0x1A108 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_58; // 0x1A1E8 (224)
	struct Unknown AnimGraphNode_BlendListByBool_16; // 0x1A2C8 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_29; // 0x1A368 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_57; // 0x1A418 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_56; // 0x1A4F8 (224)
	struct Unknown AnimGraphNode_BlendListByBool_15; // 0x1A5D8 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_55; // 0x1A678 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_54; // 0x1A758 (224)
	struct Unknown AnimGraphNode_BlendListByBool_14; // 0x1A838 (160)
	struct Unknown AnimGraphNode_StateResult_10; // 0x1A8D8 (48)
	struct Unknown AnimGraphNode_BlendSpacePlayer_53; // 0x1A908 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_52; // 0x1A9E8 (224)
	struct Unknown AnimGraphNode_BlendListByBool_13; // 0x1AAC8 (160)
	struct Unknown AnimGraphNode_SequencePlayer_117; // 0x1AB68 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_27; // 0x1ABE0 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_51; // 0x1ACA0 (224)
	struct Unknown AnimGraphNode_SequencePlayer_116; // 0x1AD80 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_26; // 0x1ADF8 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_28; // 0x1AEB8 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_50; // 0x1AF68 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_49; // 0x1B048 (224)
	struct Unknown AnimGraphNode_SequencePlayer_115; // 0x1B128 (120)
	struct Unknown AnimGraphNode_SequencePlayer_114; // 0x1B1A0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_113; // 0x1B218 (120)
	struct Unknown AnimGraphNode_SequencePlayer_112; // 0x1B290 (120)
	struct Unknown AnimGraphNode_SequencePlayer_111; // 0x1B308 (120)
	struct Unknown AnimGraphNode_BlendSpacePlayer_48; // 0x1B380 (224)
	struct Unknown AnimGraphNode_BlendListByBool_12; // 0x1B460 (160)
	struct Unknown AnimGraphNode_SequencePlayer_110; // 0x1B500 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_25; // 0x1B578 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_47; // 0x1B638 (224)
	struct Unknown AnimGraphNode_SequencePlayer_109; // 0x1B718 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_24; // 0x1B790 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_27; // 0x1B850 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_46; // 0x1B900 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_45; // 0x1B9E0 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_23; // 0x1BAC0 (192)
	struct Unknown AnimGraphNode_LayeredBoneBlend_22; // 0x1BB80 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_26; // 0x1BC40 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_25; // 0x1BCF0 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_24; // 0x1BDA0 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_23; // 0x1BE50 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_21; // 0x1BF00 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_44; // 0x1BFC0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_43; // 0x1C0A0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_42; // 0x1C180 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_22; // 0x1C260 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_41; // 0x1C310 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_21; // 0x1C3F0 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_40; // 0x1C4A0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_39; // 0x1C580 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_38; // 0x1C660 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_37; // 0x1C740 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_36; // 0x1C820 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_35; // 0x1C900 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_34; // 0x1C9E0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_33; // 0x1CAC0 (224)
	struct Unknown AnimGraphNode_ApplyAdditive_7; // 0x1CBA0 (200)
	struct Unknown AnimGraphNode_ApplyAdditive_6; // 0x1CC68 (200)
	struct Unknown AnimGraphNode_BlendListByBool_11; // 0x1CD30 (160)
	struct Unknown AnimGraphNode_StateResult_9; // 0x1CDD0 (48)
	struct Unknown AnimGraphNode_Slot_8; // 0x1CE00 (72)
	struct Unknown AnimGraphNode_SequencePlayer_108; // 0x1CE48 (120)
	struct Unknown AnimGraphNode_SequencePlayer_107; // 0x1CEC0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_106; // 0x1CF38 (120)
	struct Unknown AnimGraphNode_BlendListByInt_12; // 0x1CFB0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_105; // 0x1D050 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_20; // 0x1D0C8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_104; // 0x1D188 (120)
	struct Unknown AnimGraphNode_SequencePlayer_103; // 0x1D200 (120)
	struct Unknown AnimGraphNode_SequencePlayer_102; // 0x1D278 (120)
	struct Unknown AnimGraphNode_BlendListByBool_10; // 0x1D2F0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_101; // 0x1D390 (120)
	struct Unknown AnimGraphNode_SequencePlayer_100; // 0x1D408 (120)
	struct Unknown AnimGraphNode_BlendListByInt_11; // 0x1D480 (160)
	struct Unknown AnimGraphNode_SequencePlayer_99; // 0x1D520 (120)
	struct Unknown AnimGraphNode_SequencePlayer_98; // 0x1D598 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_19; // 0x1D610 (192)
	struct Unknown AnimGraphNode_SequencePlayer_97; // 0x1D6D0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_96; // 0x1D748 (120)
	struct Unknown AnimGraphNode_BlendListByInt_10; // 0x1D7C0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_95; // 0x1D860 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_18; // 0x1D8D8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_94; // 0x1D998 (120)
	struct Unknown AnimGraphNode_SequencePlayer_93; // 0x1DA10 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_20; // 0x1DA88 (176)
	struct Unknown AnimGraphNode_SequencePlayer_92; // 0x1DB38 (120)
	struct Unknown AnimGraphNode_SequencePlayer_91; // 0x1DBB0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_90; // 0x1DC28 (120)
	struct Unknown AnimGraphNode_SequencePlayer_89; // 0x1DCA0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_88; // 0x1DD18 (120)
	struct Unknown AnimGraphNode_SequencePlayer_87; // 0x1DD90 (120)
	struct Unknown AnimGraphNode_BlendListByInt_9; // 0x1DE08 (160)
	struct Unknown AnimGraphNode_SequencePlayer_86; // 0x1DEA8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_85; // 0x1DF20 (120)
	struct Unknown AnimGraphNode_SequencePlayer_84; // 0x1DF98 (120)
	struct Unknown AnimGraphNode_BlendListByInt_8; // 0x1E010 (160)
	struct Unknown AnimGraphNode_BlendListByInt_7; // 0x1E0B0 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_19; // 0x1E150 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_18; // 0x1E200 (176)
	struct Unknown AnimGraphNode_SequencePlayer_83; // 0x1E2B0 (120)
	struct Unknown AnimGraphNode_Slot_7; // 0x1E328 (72)
	struct Unknown AnimGraphNode_StateResult_8; // 0x1E370 (48)
	struct Unknown AnimGraphNode_StateMachine_3; // 0x1E3A0 (176)
	struct Unknown AnimGraphNode_StateResult_7; // 0x1E450 (48)
	struct Unknown AnimGraphNode_Slot_6; // 0x1E480 (72)
	struct Unknown AnimGraphNode_TransitionResult_15; // 0x1E4C8 (40)
	struct Unknown AnimGraphNode_TransitionResult_14; // 0x1E4F0 (40)
	struct Unknown AnimGraphNode_TransitionResult_13; // 0x1E518 (40)
	struct Unknown AnimGraphNode_TransitionResult_12; // 0x1E540 (40)
	struct Unknown AnimGraphNode_TransitionResult_11; // 0x1E568 (40)
	struct Unknown AnimGraphNode_TransitionResult_10; // 0x1E590 (40)
	struct Unknown AnimGraphNode_TransitionResult_9; // 0x1E5B8 (40)
	struct Unknown AnimGraphNode_TransitionResult_8; // 0x1E5E0 (40)
	struct Unknown AnimGraphNode_TransitionResult_7; // 0x1E608 (40)
	struct Unknown AnimGraphNode_TransitionResult_6; // 0x1E630 (40)
	struct Unknown AnimGraphNode_TransitionResult_5; // 0x1E658 (40)
	struct Unknown AnimGraphNode_TransitionResult_4; // 0x1E680 (40)
	struct Unknown AnimGraphNode_TransitionResult_3; // 0x1E6A8 (40)
	struct Unknown AnimGraphNode_TransitionResult_2; // 0x1E6D0 (40)
	struct Unknown AnimGraphNode_TransitionResult; // 0x1E6F8 (40)
	struct Unknown AnimGraphNode_SequencePlayer_82; // 0x1E720 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_17; // 0x1E798 (192)
	struct Unknown AnimGraphNode_SequencePlayer_81; // 0x1E858 (120)
	struct Unknown AnimGraphNode_SequencePlayer_80; // 0x1E8D0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_9; // 0x1E948 (160)
	struct Unknown AnimGraphNode_SequencePlayer_79; // 0x1E9E8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_78; // 0x1EA60 (120)
	struct Unknown AnimGraphNode_SequencePlayer_77; // 0x1EAD8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_76; // 0x1EB50 (120)
	struct Unknown AnimGraphNode_SequencePlayer_75; // 0x1EBC8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_74; // 0x1EC40 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_17; // 0x1ECB8 (176)
	struct Unknown AnimGraphNode_StateResult_6; // 0x1ED68 (48)
	struct Unknown AnimGraphNode_SequencePlayer_73; // 0x1ED98 (120)
	struct Unknown AnimGraphNode_SequencePlayer_72; // 0x1EE10 (120)
	struct Unknown AnimGraphNode_SequencePlayer_71; // 0x1EE88 (120)
	struct Unknown AnimGraphNode_SequencePlayer_70; // 0x1EF00 (120)
	struct Unknown AnimGraphNode_SequencePlayer_69; // 0x1EF78 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_16; // 0x1EFF0 (176)
	struct Unknown AnimGraphNode_StateResult_5; // 0x1F0A0 (48)
	struct Unknown AnimGraphNode_SequencePlayer_68; // 0x1F0D0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_16; // 0x1F148 (192)
	struct Unknown AnimGraphNode_BlendListByBool_8; // 0x1F208 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_32; // 0x1F2A8 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_31; // 0x1F388 (224)
	struct Unknown AnimGraphNode_SequencePlayer_67; // 0x1F468 (120)
	struct Unknown AnimGraphNode_SequencePlayer_66; // 0x1F4E0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_65; // 0x1F558 (120)
	struct Unknown AnimGraphNode_SequencePlayer_64; // 0x1F5D0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_63; // 0x1F648 (120)
	struct Unknown AnimGraphNode_SequencePlayer_62; // 0x1F6C0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_61; // 0x1F738 (120)
	struct Unknown AnimGraphNode_SequencePlayer_60; // 0x1F7B0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_15; // 0x1F828 (192)
	struct Unknown AnimGraphNode_BlendListByBool_7; // 0x1F8E8 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_30; // 0x1F988 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_29; // 0x1FA68 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_15; // 0x1FB48 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_14; // 0x1FBF8 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_13; // 0x1FCA8 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_14; // 0x1FD58 (192)
	struct Unknown AnimGraphNode_BlendListByBool_6; // 0x1FE18 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_28; // 0x1FEB8 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_27; // 0x1FF98 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_12; // 0x20078 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_26; // 0x20128 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_25; // 0x20208 (224)
	struct Unknown AnimGraphNode_BlendListByBool_5; // 0x202E8 (160)
	struct Unknown AnimGraphNode_BlendListByBool_4; // 0x20388 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_24; // 0x20428 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_23; // 0x20508 (224)
	struct Unknown AnimGraphNode_BlendListByBool_3; // 0x205E8 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_22; // 0x20688 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_21; // 0x20768 (224)
	struct Unknown AnimGraphNode_StateResult_4; // 0x20848 (48)
	struct Unknown AnimGraphNode_SequencePlayer_59; // 0x20878 (120)
	struct Unknown AnimGraphNode_SequencePlayer_58; // 0x208F0 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_10; // 0x20968 (200)
	struct Unknown AnimGraphNode_LayeredBoneBlend_13; // 0x20A30 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_20; // 0x20AF0 (224)
	struct Unknown AnimGraphNode_SequencePlayer_57; // 0x20BD0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_12; // 0x20C48 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_19; // 0x20D08 (224)
	struct Unknown AnimGraphNode_SequencePlayer_56; // 0x20DE8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_55; // 0x20E60 (120)
	struct Unknown AnimGraphNode_SequencePlayer_54; // 0x20ED8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_53; // 0x20F50 (120)
	struct Unknown AnimGraphNode_SequencePlayer_52; // 0x20FC8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_51; // 0x21040 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_9; // 0x210B8 (200)
	struct Unknown AnimGraphNode_SequencePlayer_50; // 0x21180 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_11; // 0x211F8 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_18; // 0x212B8 (224)
	struct Unknown AnimGraphNode_SequencePlayer_49; // 0x21398 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_10; // 0x21410 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_17; // 0x214D0 (224)
	struct Unknown AnimGraphNode_BlendListByBool_2; // 0x215B0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_48; // 0x21650 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_8; // 0x216C8 (200)
	struct Unknown AnimGraphNode_BlendSpacePlayer_16; // 0x21790 (224)
	struct Unknown AnimGraphNode_SequencePlayer_47; // 0x21870 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_7; // 0x218E8 (200)
	struct Unknown AnimGraphNode_BlendSpacePlayer_15; // 0x219B0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_14; // 0x21A90 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_13; // 0x21B70 (224)
	struct Unknown AnimGraphNode_ApplyAdditive_5; // 0x21C50 (200)
	struct Unknown AnimGraphNode_ApplyAdditive_4; // 0x21D18 (200)
	struct Unknown AnimGraphNode_BlendListByEnum_11; // 0x21DE0 (176)
	struct Unknown AnimGraphNode_IdentityPose; // 0x21E90 (24)
	struct Unknown AnimGraphNode_ApplyAdditive_3; // 0x21EA8 (200)
	struct Unknown AnimGraphNode_SequencePlayer_46; // 0x21F70 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_6; // 0x21FE8 (200)
	struct Unknown AnimGraphNode_SequencePlayer_45; // 0x220B0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_44; // 0x22128 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_5; // 0x221A0 (200)
	struct Unknown AnimGraphNode_SequencePlayer_43; // 0x22268 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_4; // 0x222E0 (200)
	struct Unknown AnimGraphNode_SequencePlayer_42; // 0x223A8 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_3; // 0x22420 (200)
	struct Unknown AnimGraphNode_SequencePlayer_41; // 0x224E8 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_2; // 0x22560 (200)
	struct Unknown AnimGraphNode_SequencePlayer_40; // 0x22628 (120)
	struct Unknown AnimGraphNode_TwoWayBlend; // 0x226A0 (200)
	struct Unknown AnimGraphNode_BlendListByEnum_10; // 0x22768 (176)
	struct Unknown AnimGraphNode_SequencePlayer_39; // 0x22818 (120)
	struct Unknown AnimGraphNode_BlendSpacePlayer_12; // 0x22890 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_11; // 0x22970 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_9; // 0x22A50 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_9; // 0x22B10 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_8; // 0x22BC0 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_10; // 0x22C80 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_7; // 0x22D60 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_9; // 0x22E20 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_8; // 0x22F00 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_7; // 0x22FB0 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_8; // 0x23060 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_7; // 0x23140 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_6; // 0x23220 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_5; // 0x23300 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_4; // 0x233E0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_3; // 0x234C0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_2; // 0x235A0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer; // 0x23680 (224)
	struct Unknown AnimGraphNode_ApplyAdditive_2; // 0x23760 (200)
	struct Unknown AnimGraphNode_ApplyAdditive; // 0x23828 (200)
	struct Unknown AnimGraphNode_BlendListByBool; // 0x238F0 (160)
	struct Unknown AnimGraphNode_StateResult_3; // 0x23990 (48)
	struct Unknown AnimGraphNode_SequencePlayer_38; // 0x239C0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_37; // 0x23A38 (120)
	struct Unknown AnimGraphNode_SequencePlayer_36; // 0x23AB0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_35; // 0x23B28 (120)
	struct Unknown AnimGraphNode_SequencePlayer_34; // 0x23BA0 (120)
	struct Unknown AnimGraphNode_BlendListByInt_6; // 0x23C18 (160)
	struct Unknown AnimGraphNode_LayeredBoneBlend_6; // 0x23CB8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_33; // 0x23D78 (120)
	struct Unknown AnimGraphNode_SequencePlayer_32; // 0x23DF0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_31; // 0x23E68 (120)
	struct Unknown AnimGraphNode_SequencePlayer_30; // 0x23EE0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_29; // 0x23F58 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_5; // 0x23FD0 (192)
	struct Unknown AnimGraphNode_SequencePlayer_28; // 0x24090 (120)
	struct Unknown AnimGraphNode_SequencePlayer_27; // 0x24108 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_4; // 0x24180 (192)
	struct Unknown AnimGraphNode_SequencePlayer_26; // 0x24240 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_3; // 0x242B8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_25; // 0x24378 (120)
	struct Unknown AnimGraphNode_SequencePlayer_24; // 0x243F0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_23; // 0x24468 (120)
	struct Unknown AnimGraphNode_SequencePlayer_22; // 0x244E0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_21; // 0x24558 (120)
	struct Unknown AnimGraphNode_BlendListByInt_5; // 0x245D0 (160)
	struct Unknown AnimGraphNode_LayeredBoneBlend_2; // 0x24670 (192)
	struct Unknown AnimGraphNode_SequencePlayer_20; // 0x24730 (120)
	struct Unknown AnimGraphNode_SequencePlayer_19; // 0x247A8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_18; // 0x24820 (120)
	struct Unknown AnimGraphNode_SequencePlayer_17; // 0x24898 (120)
	struct Unknown AnimGraphNode_BlendListByInt_4; // 0x24910 (160)
	struct Unknown AnimGraphNode_SequencePlayer_16; // 0x249B0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_15; // 0x24A28 (120)
	struct Unknown AnimGraphNode_SequencePlayer_14; // 0x24AA0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend; // 0x24B18 (192)
	struct Unknown AnimGraphNode_SequencePlayer_13; // 0x24BD8 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_6; // 0x24C50 (176)
	struct Unknown AnimGraphNode_SequencePlayer_12; // 0x24D00 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_5; // 0x24D78 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_4; // 0x24E28 (176)
	struct Unknown AnimGraphNode_SequencePlayer_11; // 0x24ED8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_10; // 0x24F50 (120)
	struct Unknown AnimGraphNode_SequencePlayer_9; // 0x24FC8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_8; // 0x25040 (120)
	struct Unknown AnimGraphNode_SequencePlayer_7; // 0x250B8 (120)
	struct Unknown AnimGraphNode_BlendListByInt_3; // 0x25130 (160)
	struct Unknown AnimGraphNode_SequencePlayer_6; // 0x251D0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_5; // 0x25248 (120)
	struct Unknown AnimGraphNode_SequencePlayer_4; // 0x252C0 (120)
	struct Unknown AnimGraphNode_BlendListByInt_2; // 0x25338 (160)
	struct Unknown AnimGraphNode_SequencePlayer_3; // 0x253D8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_2; // 0x25450 (120)
	struct Unknown AnimGraphNode_SequencePlayer; // 0x254C8 (120)
	struct Unknown AnimGraphNode_BlendListByInt; // 0x25540 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_3; // 0x255E0 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_2; // 0x25690 (176)
	struct Unknown AnimGraphNode_Slot_5; // 0x25740 (72)
	struct Unknown AnimGraphNode_StateResult_2; // 0x25788 (48)
	struct Unknown AnimGraphNode_StateMachine_2; // 0x257B8 (176)
	struct Unknown AnimGraphNode_StateResult; // 0x25868 (48)
	struct Unknown AnimGraphNode_StateMachine; // 0x25898 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_12; // 0x25948 (184)
	struct Unknown AnimGraphNode_SaveCachedPose_11; // 0x25A00 (184)
	struct Unknown AnimGraphNode_UseCachedPose_23; // 0x25AB8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_22; // 0x25AE0 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_10; // 0x25B08 (184)
	struct Unknown AnimGraphNode_UseCachedPose_21; // 0x25BC0 (40)
	struct Unknown AnimGraphNode_UseCachedPose_20; // 0x25BE8 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_9; // 0x25C10 (184)
	struct Unknown AnimGraphNode_UseCachedPose_19; // 0x25CC8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_18; // 0x25CF0 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_8; // 0x25D18 (184)
	struct Unknown AnimGraphNode_UseCachedPose_17; // 0x25DD0 (40)
	struct Unknown AnimGraphNode_UseCachedPose_16; // 0x25DF8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_15; // 0x25E20 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_7; // 0x25E48 (184)
	struct Unknown AnimGraphNode_SaveCachedPose_6; // 0x25F00 (184)
	struct Unknown AnimGraphNode_UseCachedPose_14; // 0x25FB8 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_5; // 0x25FE0 (184)
	struct Unknown AnimGraphNode_UseCachedPose_13; // 0x26098 (40)
	struct Unknown AnimGraphNode_UseCachedPose_12; // 0x260C0 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_4; // 0x260E8 (184)
	struct Unknown AnimGraphNode_UseCachedPose_11; // 0x261A0 (40)
	struct Unknown AnimGraphNode_UseCachedPose_10; // 0x261C8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_9; // 0x261F0 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_3; // 0x26218 (184)
	struct Unknown AnimGraphNode_UseCachedPose_8; // 0x262D0 (40)
	struct Unknown AnimGraphNode_UseCachedPose_7; // 0x262F8 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_2; // 0x26320 (184)
	struct Unknown AnimGraphNode_UseCachedPose_6; // 0x263D8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_5; // 0x26400 (40)
	struct Unknown AnimGraphNode_Slot_4; // 0x26428 (72)
	struct Unknown AnimGraphNode_SaveCachedPose; // 0x26470 (184)
	struct Unknown AnimGraphNode_UseCachedPose_4; // 0x26528 (40)
	struct Unknown AnimGraphNode_UseCachedPose_3; // 0x26550 (40)
	struct Unknown AnimGraphNode_Slot_3; // 0x26578 (72)
	struct Unknown AnimGraphNode_Slot_2; // 0x265C0 (72)
	struct Unknown AnimGraphNode_BlendListByEnum; // 0x26608 (176)
	struct Unknown AnimGraphNode_UseCachedPose_2; // 0x266B8 (40)
	struct Unknown AnimGraphNode_UseCachedPose; // 0x266E0 (40)
	struct Unknown AnimGraphNode_Slot; // 0x26708 (72)
	struct Unknown StoppingAnimation; // 0x26750 (8)
	struct FName AdditiveLandingSlot; // 0x26758 (8)
	float StoppingDirection; // 0x26760 (4)
	struct Unknown CameraLagTimer; // 0x26768 (8)
	struct Unknown SavedCameraArmLocation; // 0x26770 (12)
	char TestSprinting : 0; // 0x2677C (1)

	void AnimGraph(struct Unknown& AnimGraph); // Function ABP-DefaultMan_Native.ABP-DefaultMan_Native_C.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	void ChooseStoppingAnim(struct Unknown& StoppingAnim); // Function ABP-DefaultMan_Native.ABP-DefaultMan_Native_C.ChooseStoppingAnim(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game_BE.exe+0x2B812B0>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-DefaultMan_Native_AnimGraphNode_TransitionResult_C088F08849AABF77B6110C8A6B219118(); // Function ABP-DefaultMan_Native.ABP-DefaultMan_Native_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-DefaultMan_Native_AnimGraphNode_TransitionResult_C088F08849AABF77B6110C8A6B219118(BlueprintEvent) // <Game_BE.exe+0x2B812B0>
