// AnimBlueprintGeneratedClass ABP-Quadski.ABP-Quadski_C
class UABP-Quadski_C : public UBravoHotelVehicleAnimInstance {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0xA30 (8)
	struct FAnimNode_Root AnimGraphNode_Root; // 0xA38 (48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xA68 (40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xA90 (40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xAB8 (40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xAE0 (40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0xB08 (40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xB30 (40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xB58 (40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xB80 (40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0xBA8 (120)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0xC20 (48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xC50 (120)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xCC8 (48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xCF8 (120)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xD70 (48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xDA0 (40)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0xDC8 (32)
	struct FAnimNode_MeshSpaceRefPose AnimGraphNode_MeshRefPose_2; // 0xDE8 (16)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0xDF8 (160)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xE98 (120)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xF10 (192)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0xFD0 (32)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0xFF0 (32)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x1010 (264)
	struct FAnimNode_WheelHandler AnimGraphNode_WheelHandler_2; // 0x1118 (224)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x11F8 (120)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x1270 (48)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_12; // 0x12A0 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_11; // 0x1390 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_10; // 0x1480 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_9; // 0x1570 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_8; // 0x1660 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_7; // 0x1750 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_6; // 0x1840 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_5; // 0x1930 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_4; // 0x1A20 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_3; // 0x1B10 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_2; // 0x1C00 (240)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1CF0 (240)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x1DE0 (32)
	struct FAnimNode_MeshSpaceRefPose AnimGraphNode_MeshRefPose; // 0x1E00 (16)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1E10 (160)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x1EB0 (1088)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x22F0 (32)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2310 (264)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2418 (32)
	struct FAnimNode_WheelHandler AnimGraphNode_WheelHandler; // 0x2438 (224)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2518 (120)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2590 (48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x25C0 (176)
	char bIsAmphibiousMode : 0; // 0x2670 (1)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP-Quadski.ABP-Quadski_C.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_C584BAB4475226CF5A96DA84563281E0(); // Function ABP-Quadski.ABP-Quadski_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_C584BAB4475226CF5A96DA84563281E0(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_5B320C8249FFAA1FF5372BA69A6E9633(); // Function ABP-Quadski.ABP-Quadski_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_5B320C8249FFAA1FF5372BA69A6E9633(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP-Quadski.ABP-Quadski_C.BlueprintUpdateAnimation(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void ExecuteUbergraph_ABP-Quadski(int32_t EntryPoint); // Function ABP-Quadski.ABP-Quadski_C.ExecuteUbergraph_ABP-Quadski(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
};

// Function ABP-Quadski.ABP-Quadski_C.AnimGraph
inline void UABP-Quadski_C::AnimGraph(struct FPoseLink& AnimGraph) {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Quadski.ABP-Quadski_C.AnimGraph");

	struct AnimGraph_Params {
		struct FPoseLink& AnimGraph;
	}; AnimGraph_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;

	AnimGraph = Params.AnimGraph;

}

// Function ABP-Quadski.ABP-Quadski_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_C584BAB4475226CF5A96DA84563281E0
inline void UABP-Quadski_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_C584BAB4475226CF5A96DA84563281E0() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Quadski.ABP-Quadski_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_C584BAB4475226CF5A96DA84563281E0");

	struct EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_C584BAB4475226CF5A96DA84563281E0_Params {
		
	}; EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_C584BAB4475226CF5A96DA84563281E0_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Quadski.ABP-Quadski_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_5B320C8249FFAA1FF5372BA69A6E9633
inline void UABP-Quadski_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_5B320C8249FFAA1FF5372BA69A6E9633() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Quadski.ABP-Quadski_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_5B320C8249FFAA1FF5372BA69A6E9633");

	struct EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_5B320C8249FFAA1FF5372BA69A6E9633_Params {
		
	}; EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-Quadski_AnimGraphNode_TransitionResult_5B320C8249FFAA1FF5372BA69A6E9633_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Quadski.ABP-Quadski_C.BlueprintUpdateAnimation
inline void UABP-Quadski_C::BlueprintUpdateAnimation(float DeltaTimeX) {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Quadski.ABP-Quadski_C.BlueprintUpdateAnimation");

	struct BlueprintUpdateAnimation_Params {
		float DeltaTimeX;
	}; BlueprintUpdateAnimation_Params Params;

	Params.DeltaTimeX = DeltaTimeX;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-Quadski.ABP-Quadski_C.ExecuteUbergraph_ABP-Quadski
inline void UABP-Quadski_C::ExecuteUbergraph_ABP-Quadski(int32_t EntryPoint) {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-Quadski.ABP-Quadski_C.ExecuteUbergraph_ABP-Quadski");

	struct ExecuteUbergraph_ABP-Quadski_Params {
		int32_t EntryPoint;
	}; ExecuteUbergraph_ABP-Quadski_Params Params;

	Params.EntryPoint = EntryPoint;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

