// AnimBlueprintGeneratedClass ABP-InventoryPawn.ABP-InventoryPawn_C
class UABP-InventoryPawn_C : public UAnimInstance {

public:

	struct Unknown UberGraphFrame; // 0x270 (8)
	struct Unknown AnimGraphNode_LayeredBoneBlend_8; // 0x278 (192)
	struct Unknown AnimGraphNode_SequencePlayer_33; // 0x338 (120)
	struct Unknown AnimGraphNode_SequencePlayer_32; // 0x3B0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_31; // 0x428 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_7; // 0x4A0 (192)
	struct Unknown AnimGraphNode_HandIKRetargeting_2; // 0x560 (288)
	struct Unknown AnimGraphNode_TwoBoneIK_4; // 0x680 (480)
	struct Unknown AnimGraphNode_LocalToComponentSpace_3; // 0x860 (32)
	struct Unknown AnimGraphNode_TwoBoneIK_3; // 0x880 (480)
	struct Unknown AnimGraphNode_ModifyBone_2; // 0xA60 (264)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_3; // 0xB68 (32)
	struct Unknown AnimGraphNode_SaveCachedPose_8; // 0xB88 (184)
	struct Unknown AnimGraphNode_ApplyAdditive_6; // 0xC40 (200)
	struct Unknown AnimGraphNode_SequencePlayer_30; // 0xD08 (120)
	struct Unknown AnimGraphNode_SequencePlayer_29; // 0xD80 (120)
	struct Unknown AnimGraphNode_SequencePlayer_28; // 0xDF8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_6; // 0xE70 (192)
	struct Unknown AnimGraphNode_SequencePlayer_27; // 0xF30 (120)
	struct Unknown AnimGraphNode_SequencePlayer_26; // 0xFA8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_5; // 0x1020 (192)
	struct Unknown AnimGraphNode_SequencePlayer_25; // 0x10E0 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_4; // 0x1158 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_7; // 0x1208 (184)
	struct Unknown AnimGraphNode_UseCachedPose_8; // 0x12C0 (40)
	struct Unknown AnimGraphNode_BlendListByBool_8; // 0x12E8 (160)
	struct Unknown AnimGraphNode_SequencePlayer_24; // 0x1388 (120)
	struct Unknown AnimGraphNode_SaveCachedPose_6; // 0x1400 (184)
	struct Unknown AnimGraphNode_SequencePlayer_23; // 0x14B8 (120)
	struct Unknown AnimGraphNode_BlendListByBool_7; // 0x1530 (160)
	struct Unknown AnimGraphNode_SequencePlayer_22; // 0x15D0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_6; // 0x1648 (160)
	struct Unknown AnimGraphNode_SaveCachedPose_5; // 0x16E8 (184)
	struct Unknown AnimGraphNode_SequencePlayer_21; // 0x17A0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_5; // 0x1818 (160)
	struct Unknown AnimGraphNode_SequencePlayer_20; // 0x18B8 (120)
	struct Unknown AnimGraphNode_SaveCachedPose_4; // 0x1930 (184)
	struct Unknown AnimGraphNode_SequencePlayer_19; // 0x19E8 (120)
	struct Unknown AnimGraphNode_BlendListByBool_4; // 0x1A60 (160)
	struct Unknown AnimGraphNode_SequencePlayer_18; // 0x1B00 (120)
	struct Unknown AnimGraphNode_BlendListByBool_3; // 0x1B78 (160)
	struct Unknown AnimGraphNode_UseCachedPose_7; // 0x1C18 (40)
	struct Unknown AnimGraphNode_UseCachedPose_6; // 0x1C40 (40)
	struct Unknown AnimGraphNode_UseCachedPose_5; // 0x1C68 (40)
	struct Unknown AnimGraphNode_HandIKRetargeting; // 0x1C90 (288)
	struct Unknown AnimGraphNode_TwoBoneIK_2; // 0x1DB0 (480)
	struct Unknown AnimGraphNode_LocalToComponentSpace_2; // 0x1F90 (32)
	struct Unknown AnimGraphNode_TwoBoneIK; // 0x1FB0 (480)
	struct Unknown AnimGraphNode_ModifyBone; // 0x2190 (264)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_2; // 0x2298 (32)
	struct Unknown AnimGraphNode_SequencePlayer_17; // 0x22B8 (120)
	struct Unknown AnimGraphNode_ApplyAdditive_5; // 0x2330 (200)
	struct Unknown AnimGraphNode_SequencePlayer_16; // 0x23F8 (120)
	struct Unknown AnimGraphNode_LocalToComponentSpace; // 0x2470 (32)
	struct Unknown AnimGraphNode_AnimDynamics_11; // 0x2490 (1088)
	struct Unknown AnimGraphNode_AnimDynamics_10; // 0x28D0 (1088)
	struct Unknown AnimGraphNode_ComponentToLocalSpace; // 0x2D10 (32)
	struct Unknown AnimGraphNode_AnimDynamics_9; // 0x2D30 (1088)
	struct Unknown AnimGraphNode_AnimDynamics_8; // 0x3170 (1088)
	struct Unknown AnimGraphNode_AnimDynamics_7; // 0x35B0 (1088)
	struct Unknown AnimGraphNode_AnimDynamics_6; // 0x39F0 (1088)
	struct Unknown AnimGraphNode_AnimDynamics_5; // 0x3E30 (1088)
	struct Unknown AnimGraphNode_AnimDynamics_4; // 0x4270 (1088)
	struct Unknown AnimGraphNode_AnimDynamics_3; // 0x46B0 (1088)
	struct Unknown AnimGraphNode_AnimDynamics_2; // 0x4AF0 (1088)
	struct Unknown AnimGraphNode_AnimDynamics; // 0x4F30 (1088)
	struct Unknown AnimGraphNode_SequencePlayer_15; // 0x5370 (120)
	struct Unknown AnimGraphNode_BlendListByBool_2; // 0x53E8 (160)
	struct Unknown AnimGraphNode_SequencePlayer_14; // 0x5488 (120)
	struct Unknown AnimGraphNode_SequencePlayer_13; // 0x5500 (120)
	struct Unknown AnimGraphNode_BlendListByBool; // 0x5578 (160)
	struct Unknown AnimGraphNode_SequencePlayer_12; // 0x5618 (120)
	struct Unknown AnimGraphNode_KawaiiPhysics_26; // 0x5690 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_25; // 0x58E0 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_24; // 0x5B30 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_23; // 0x5D80 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_22; // 0x5FD0 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_21; // 0x6220 (592)
	struct Unknown AnimGraphNode_SequencePlayer_11; // 0x6470 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_4; // 0x64E8 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_3; // 0x65A8 (176)
	struct Unknown AnimGraphNode_SequencePlayer_10; // 0x6658 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_2; // 0x66D0 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_3; // 0x6780 (192)
	struct Unknown AnimGraphNode_SequencePlayer_9; // 0x6840 (120)
	struct Unknown AnimGraphNode_ApplyAdditive_4; // 0x68B8 (200)
	struct Unknown AnimGraphNode_SequencePlayer_8; // 0x6980 (120)
	struct Unknown AnimGraphNode_SequencePlayer_7; // 0x69F8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_2; // 0x6A70 (192)
	struct Unknown AnimGraphNode_SequencePlayer_6; // 0x6B30 (120)
	struct Unknown AnimGraphNode_ApplyAdditive_3; // 0x6BA8 (200)
	struct Unknown AnimGraphNode_SequencePlayer_5; // 0x6C70 (120)
	struct Unknown AnimGraphNode_SequencePlayer_4; // 0x6CE8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_3; // 0x6D60 (120)
	struct Unknown AnimGraphNode_ApplyAdditive_2; // 0x6DD8 (200)
	struct Unknown AnimGraphNode_SequencePlayer_2; // 0x6EA0 (120)
	struct Unknown AnimGraphNode_BoneDrivenController_8; // 0x6F18 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_7; // 0x7030 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_6; // 0x7148 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_5; // 0x7260 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_4; // 0x7378 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_3; // 0x7490 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_2; // 0x75A8 (280)
	struct Unknown AnimGraphNode_BoneDrivenController; // 0x76C0 (280)
	struct Unknown AnimGraphNode_KawaiiPhysics_20; // 0x77E0 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_19; // 0x7A30 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_18; // 0x7C80 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_17; // 0x7ED0 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_16; // 0x8120 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_15; // 0x8370 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_14; // 0x85C0 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_13; // 0x8810 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_12; // 0x8A60 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_11; // 0x8CB0 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_10; // 0x8F00 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_9; // 0x9150 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_8; // 0x93A0 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_7; // 0x95F0 (592)
	struct Unknown AnimGraphNode_SequencePlayer; // 0x9840 (120)
	struct Unknown AnimGraphNode_ApplyAdditive; // 0x98B8 (200)
	struct Unknown AnimGraphNode_UseCachedPose_4; // 0x9980 (40)
	struct Unknown AnimGraphNode_UseCachedPose_3; // 0x99A8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_2; // 0x99D0 (40)
	struct Unknown AnimGraphNode_UseCachedPose; // 0x99F8 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_3; // 0x9A20 (184)
	struct Unknown AnimGraphNode_LayeredBoneBlend; // 0x9AD8 (192)
	struct Unknown AnimGraphNode_SaveCachedPose_2; // 0x9B98 (184)
	struct Unknown AnimGraphNode_SaveCachedPose; // 0x9C50 (184)
	struct Unknown AnimGraphNode_BlendListByEnum; // 0x9D08 (176)
	struct Unknown AnimGraphNode_Root; // 0x9DB8 (48)
	struct Unknown AnimGraphNode_KawaiiPhysics_6; // 0x9DF0 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_5; // 0xA040 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_4; // 0xA290 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_3; // 0xA4E0 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics_2; // 0xA730 (592)
	struct Unknown AnimGraphNode_KawaiiPhysics; // 0xA980 (592)
	struct Unknown Character; // 0xABD0 (8)
	enum class Unknow WeaponAnimType; // 0xABD8 (1)
	struct Unknown HandAnim; // 0xABE0 (8)
	struct Unknown HandL_Location; // 0xABE8 (12)
	struct Unknown HandL_Rotation; // 0xABF4 (12)
	struct Unknown Recorder; // 0xAC00 (8)
	enum class Unknow GripType; // 0xAC08 (1)
	char IsEquippingNormalGrip : 0; // 0xAC09 (1)
	struct Unknown UnarmedIdlePose; // 0xAC10 (8)
	int32_t IdleNum; // 0xAC18 (4)
	char bIsMale : 0; // 0xAC1C (1)
	char bIsEquippingGatling : 0; // 0xAC1D (1)
	char bIsEquippingRPG : 0; // 0xAC1E (1)
	struct Unknown InventoryCharacter; // 0xAC20 (8)
	struct Unknown AnimDynamicsForce; // 0xAC28 (12)
	float PrevMeshRotationYaw; // 0xAC34 (4)
	float BoneDrivenValue; // 0xAC38 (4)

	void AnimGraph(struct Unknown& AnimGraph); // Function ABP-InventoryPawn.ABP-InventoryPawn_C.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void UpdateAnimDynamicsForce(); // Function ABP-InventoryPawn.ABP-InventoryPawn_C.UpdateAnimDynamicsForce(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void Get Preview Character Mesh(struct Unknown& Skeletal Mesh Component); // Function ABP-InventoryPawn.ABP-InventoryPawn_C.Get Preview Character Mesh(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void Get Current Preview Weapon(struct Unknown& Current Preview Weapon); // Function ABP-InventoryPawn.ABP-InventoryPawn_C.Get Current Preview Weapon(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void Update References(); // Function ABP-InventoryPawn.ABP-InventoryPawn_C.Update References(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	char Get Is Equipping RPG(); // Function ABP-InventoryPawn.ABP-InventoryPawn_C.Get Is Equipping RPG(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	char Get Is Equipping Gatling(); // Function ABP-InventoryPawn.ABP-InventoryPawn_C.Get Is Equipping Gatling(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP-InventoryPawn.ABP-InventoryPawn_C.BlueprintUpdateAnimation(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void ExecuteUbergraph_ABP-InventoryPawn(int32_t EntryPoint); // Function ABP-InventoryPawn.ABP-InventoryPawn_C.ExecuteUbergraph_ABP-InventoryPawn(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
};

// Function ABP-InventoryPawn.ABP-InventoryPawn_C.AnimGraph
inline void UABP-InventoryPawn_C::AnimGraph(struct Unknown& AnimGraph) {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-InventoryPawn.ABP-InventoryPawn_C.AnimGraph");

	struct AnimGraph_Params {
		struct Unknown& AnimGraph;
	}; AnimGraph_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;

	AnimGraph = Params.AnimGraph;

}

// Function ABP-InventoryPawn.ABP-InventoryPawn_C.UpdateAnimDynamicsForce
inline void UABP-InventoryPawn_C::UpdateAnimDynamicsForce() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-InventoryPawn.ABP-InventoryPawn_C.UpdateAnimDynamicsForce");

	struct UpdateAnimDynamicsForce_Params {
		
	}; UpdateAnimDynamicsForce_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-InventoryPawn.ABP-InventoryPawn_C.Get Preview Character Mesh
inline void UABP-InventoryPawn_C::Get Preview Character Mesh(struct Unknown& Skeletal Mesh Component) {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-InventoryPawn.ABP-InventoryPawn_C.Get Preview Character Mesh");

	struct Get Preview Character Mesh_Params {
		struct Unknown& Skeletal Mesh Component;
	}; Get Preview Character Mesh_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;

	Skeletal Mesh Component = Params.Skeletal Mesh Component;

}

// Function ABP-InventoryPawn.ABP-InventoryPawn_C.Get Current Preview Weapon
inline void UABP-InventoryPawn_C::Get Current Preview Weapon(struct Unknown& Current Preview Weapon) {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-InventoryPawn.ABP-InventoryPawn_C.Get Current Preview Weapon");

	struct Get Current Preview Weapon_Params {
		struct Unknown& Current Preview Weapon;
	}; Get Current Preview Weapon_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;

	Current Preview Weapon = Params.Current Preview Weapon;

}

// Function ABP-InventoryPawn.ABP-InventoryPawn_C.Update References
inline void UABP-InventoryPawn_C::Update References() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-InventoryPawn.ABP-InventoryPawn_C.Update References");

	struct Update References_Params {
		
	}; Update References_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-InventoryPawn.ABP-InventoryPawn_C.Get Is Equipping RPG
inline char UABP-InventoryPawn_C::Get Is Equipping RPG() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-InventoryPawn.ABP-InventoryPawn_C.Get Is Equipping RPG");

	struct Get Is Equipping RPG_Params {
		
		char ReturnValue;

	}; Get Is Equipping RPG_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;

	return params.ReturnValue;
}

// Function ABP-InventoryPawn.ABP-InventoryPawn_C.Get Is Equipping Gatling
inline char UABP-InventoryPawn_C::Get Is Equipping Gatling() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-InventoryPawn.ABP-InventoryPawn_C.Get Is Equipping Gatling");

	struct Get Is Equipping Gatling_Params {
		
		char ReturnValue;

	}; Get Is Equipping Gatling_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;

	return params.ReturnValue;
}

// Function ABP-InventoryPawn.ABP-InventoryPawn_C.BlueprintUpdateAnimation
inline void UABP-InventoryPawn_C::BlueprintUpdateAnimation(float DeltaTimeX) {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-InventoryPawn.ABP-InventoryPawn_C.BlueprintUpdateAnimation");

	struct BlueprintUpdateAnimation_Params {
		float DeltaTimeX;
	}; BlueprintUpdateAnimation_Params Params;

	Params.DeltaTimeX = DeltaTimeX;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-InventoryPawn.ABP-InventoryPawn_C.ExecuteUbergraph_ABP-InventoryPawn
inline void UABP-InventoryPawn_C::ExecuteUbergraph_ABP-InventoryPawn(int32_t EntryPoint) {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-InventoryPawn.ABP-InventoryPawn_C.ExecuteUbergraph_ABP-InventoryPawn");

	struct ExecuteUbergraph_ABP-InventoryPawn_Params {
		int32_t EntryPoint;
	}; ExecuteUbergraph_ABP-InventoryPawn_Params Params;

	Params.EntryPoint = EntryPoint;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

