// AnimBlueprintGeneratedClass ABP-LobbyPawn.ABP-LobbyPawn_C
class UABP-LobbyPawn_C : public UAnimInstance {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x270 (8)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_11; // 0x280 (1088)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x6C0 (32)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_10; // 0x6E0 (1088)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_9; // 0xB20 (1088)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_8; // 0xF60 (1088)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7; // 0x13A0 (1088)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6; // 0x17E0 (1088)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0x1C20 (1088)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x2060 (1088)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x24A0 (1088)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x28E0 (32)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x2900 (40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x2928 (40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x2950 (40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2978 (40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x29A0 (120)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x2A18 (48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x2A48 (120)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x2AC0 (48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x2AF0 (120)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x2B68 (48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x2B98 (120)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2C10 (48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2C40 (176)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x2CF0 (184)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x2DA8 (40)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x2DD0 (40)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x2DF8 (40)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x2E20 (40)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x2E50 (1088)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x3290 (1088)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_12; // 0x36D0 (592)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_11; // 0x3920 (592)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_10; // 0x3B70 (592)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_9; // 0x3DC0 (592)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_8; // 0x4010 (592)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_7; // 0x4260 (592)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_8; // 0x44B0 (280)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_7; // 0x45C8 (280)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_6; // 0x46E0 (280)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_5; // 0x47F8 (280)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_4; // 0x4910 (280)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_3; // 0x4A28 (280)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_2; // 0x4B40 (280)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x4C58 (280)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x4D70 (184)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4E28 (176)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x4ED8 (120)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x4F50 (192)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x5010 (120)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x5088 (120)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x5100 (192)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x51C0 (120)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x5238 (120)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x52B0 (120)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x5328 (200)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x53F0 (40)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5418 (40)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5440 (184)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x54F8 (160)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x5598 (120)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x5610 (160)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x56B0 (48)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_6; // 0x56E0 (592)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_5; // 0x5930 (592)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_4; // 0x5B80 (592)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_3; // 0x5DD0 (592)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_2; // 0x6020 (592)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x6270 (592)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x64C0 (120)
	int32_t PawnIndex; // 0x6538 (4)
	int32_t IdleNum; // 0x653C (4)
	struct UAnimSequence IdleAnimSequence; // 0x6540 (8)
	struct ABP-LobbyPawn_C CharacterRef; // 0x6548 (8)
	char bIsMale : 0; // 0x6550 (1)
	char bIsEquippingWeapon : 0; // 0x6551 (1)
	enum class EWeaponAnimationType WeaponAnimType; // 0x6552 (1)
	struct UAnimSequence HandAnim; // 0x6558 (8)
	enum class EWeaponAttachmentGrip GripType; // 0x6560 (1)
	char bIsEquippingNormalGrip : 0; // 0x6561 (1)
	struct FVector HandL_Location; // 0x6564 (12)
	struct FRotator HandL_Rotation; // 0x6570 (12)
	float LeftHandIK_Alpha; // 0x657C (4)
	struct FVector AnimDynamicsForce; // 0x6580 (12)
	float PrevCharacterRotationYaw; // 0x658C (4)
	float RightHandIK_Alpha; // 0x6590 (4)
	char bReady : 0; // 0x6594 (1)
	struct UAnimSequence ReadyAnimSequence; // 0x6598 (8)
	struct UAnimSequence Readyon_AnimSequence; // 0x65A0 (8)
	struct UAnimSequence Readyoff_AnimSequence; // 0x65A8 (8)
	float DeltaTimeX; // 0x65B0 (4)
	float HairAnimDynamicsAlpha; // 0x65B4 (4)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void UpdateAnimDynamicsAlpha(); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.UpdateAnimDynamicsAlpha(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	char IsNeedToApplyLeftHandIK(); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.IsNeedToApplyLeftHandIK(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.BlueprintUpdateAnimation(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_B1938DBB4FA07527E591E291B7304361(); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_B1938DBB4FA07527E591E291B7304361(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_5F4429C24615D1D556AB4C92EB9C64DC(); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_5F4429C24615D1D556AB4C92EB9C64DC(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void ExecuteUbergraph_ABP-LobbyPawn(int32_t EntryPoint); // Function ABP-LobbyPawn.ABP-LobbyPawn_C.ExecuteUbergraph_ABP-LobbyPawn(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
};

// Function ABP-LobbyPawn.ABP-LobbyPawn_C.AnimGraph
inline void UABP-LobbyPawn_C::AnimGraph(struct FPoseLink& AnimGraph) {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-LobbyPawn.ABP-LobbyPawn_C.AnimGraph");

	struct AnimGraph_Params {
		struct FPoseLink& AnimGraph;
	}; AnimGraph_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;

	AnimGraph = Params.AnimGraph;

}

// Function ABP-LobbyPawn.ABP-LobbyPawn_C.UpdateAnimDynamicsAlpha
inline void UABP-LobbyPawn_C::UpdateAnimDynamicsAlpha() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-LobbyPawn.ABP-LobbyPawn_C.UpdateAnimDynamicsAlpha");

	struct UpdateAnimDynamicsAlpha_Params {
		
	}; UpdateAnimDynamicsAlpha_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-LobbyPawn.ABP-LobbyPawn_C.IsNeedToApplyLeftHandIK
inline char UABP-LobbyPawn_C::IsNeedToApplyLeftHandIK() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-LobbyPawn.ABP-LobbyPawn_C.IsNeedToApplyLeftHandIK");

	struct IsNeedToApplyLeftHandIK_Params {
		
		char ReturnValue;

	}; IsNeedToApplyLeftHandIK_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;

	return params.ReturnValue;
}

// Function ABP-LobbyPawn.ABP-LobbyPawn_C.BlueprintUpdateAnimation
inline void UABP-LobbyPawn_C::BlueprintUpdateAnimation(float DeltaTimeX) {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-LobbyPawn.ABP-LobbyPawn_C.BlueprintUpdateAnimation");

	struct BlueprintUpdateAnimation_Params {
		float DeltaTimeX;
	}; BlueprintUpdateAnimation_Params Params;

	Params.DeltaTimeX = DeltaTimeX;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-LobbyPawn.ABP-LobbyPawn_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_B1938DBB4FA07527E591E291B7304361
inline void UABP-LobbyPawn_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_B1938DBB4FA07527E591E291B7304361() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-LobbyPawn.ABP-LobbyPawn_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_B1938DBB4FA07527E591E291B7304361");

	struct EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_B1938DBB4FA07527E591E291B7304361_Params {
		
	}; EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_B1938DBB4FA07527E591E291B7304361_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-LobbyPawn.ABP-LobbyPawn_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_5F4429C24615D1D556AB4C92EB9C64DC
inline void UABP-LobbyPawn_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_5F4429C24615D1D556AB4C92EB9C64DC() {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-LobbyPawn.ABP-LobbyPawn_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_5F4429C24615D1D556AB4C92EB9C64DC");

	struct EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_5F4429C24615D1D556AB4C92EB9C64DC_Params {
		
	}; EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-LobbyPawn_AnimGraphNode_TransitionResult_5F4429C24615D1D556AB4C92EB9C64DC_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ABP-LobbyPawn.ABP-LobbyPawn_C.ExecuteUbergraph_ABP-LobbyPawn
inline void UABP-LobbyPawn_C::ExecuteUbergraph_ABP-LobbyPawn(int32_t EntryPoint) {
	static auto fn = UObject::FindObject<UFunction>("Function ABP-LobbyPawn.ABP-LobbyPawn_C.ExecuteUbergraph_ABP-LobbyPawn");

	struct ExecuteUbergraph_ABP-LobbyPawn_Params {
		int32_t EntryPoint;
	}; ExecuteUbergraph_ABP-LobbyPawn_Params Params;

	Params.EntryPoint = EntryPoint;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

