// AnimBlueprintGeneratedClass ABP-DefaultMan_Native.ABP-DefaultMan_Native_C
class UABP-DefaultMan_Native_C : public UBravoHotelAnimInstance {

public:

	struct Unknown UberGraphFrame; // 0xCA0 (8)
	struct Unknown AnimGraphNode_Root; // 0xCA8 (48)
	struct Unknown AnimGraphNode_TransitionResult_119; // 0xCD8 (40)
	struct Unknown AnimGraphNode_TransitionResult_118; // 0xD00 (40)
	struct Unknown AnimGraphNode_TransitionResult_117; // 0xD28 (40)
	struct Unknown AnimGraphNode_TransitionResult_116; // 0xD50 (40)
	struct Unknown AnimGraphNode_TransitionResult_115; // 0xD78 (40)
	struct Unknown AnimGraphNode_TransitionResult_114; // 0xDA0 (40)
	struct Unknown AnimGraphNode_TransitionResult_113; // 0xDC8 (40)
	struct Unknown AnimGraphNode_TransitionResult_112; // 0xDF0 (40)
	struct Unknown AnimGraphNode_TransitionResult_111; // 0xE18 (40)
	struct Unknown AnimGraphNode_TransitionResult_110; // 0xE40 (40)
	struct Unknown AnimGraphNode_TransitionResult_109; // 0xE68 (40)
	struct Unknown AnimGraphNode_TransitionResult_108; // 0xE90 (40)
	struct Unknown AnimGraphNode_TransitionResult_107; // 0xEB8 (40)
	struct Unknown AnimGraphNode_TransitionResult_106; // 0xEE0 (40)
	struct Unknown AnimGraphNode_TransitionResult_105; // 0xF08 (40)
	struct Unknown AnimGraphNode_TransitionResult_104; // 0xF30 (40)
	struct Unknown AnimGraphNode_TransitionResult_103; // 0xF58 (40)
	struct Unknown AnimGraphNode_TransitionResult_102; // 0xF80 (40)
	struct Unknown AnimGraphNode_TransitionResult_101; // 0xFA8 (40)
	struct Unknown AnimGraphNode_TransitionResult_100; // 0xFD0 (40)
	struct Unknown AnimGraphNode_TransitionResult_99; // 0xFF8 (40)
	struct Unknown AnimGraphNode_TransitionResult_98; // 0x1020 (40)
	struct Unknown AnimGraphNode_TransitionResult_97; // 0x1048 (40)
	struct Unknown AnimGraphNode_TransitionResult_96; // 0x1070 (40)
	struct Unknown AnimGraphNode_TransitionResult_95; // 0x1098 (40)
	struct Unknown AnimGraphNode_TransitionResult_94; // 0x10C0 (40)
	struct Unknown AnimGraphNode_TransitionResult_93; // 0x10E8 (40)
	struct Unknown AnimGraphNode_TransitionResult_92; // 0x1110 (40)
	struct Unknown AnimGraphNode_TransitionResult_91; // 0x1138 (40)
	struct Unknown AnimGraphNode_TransitionResult_90; // 0x1160 (40)
	struct Unknown AnimGraphNode_TransitionResult_89; // 0x1188 (40)
	struct Unknown AnimGraphNode_TransitionResult_88; // 0x11B0 (40)
	struct Unknown AnimGraphNode_TransitionResult_87; // 0x11D8 (40)
	struct Unknown AnimGraphNode_TransitionResult_86; // 0x1200 (40)
	struct Unknown AnimGraphNode_TransitionResult_85; // 0x1228 (40)
	struct Unknown AnimGraphNode_TransitionResult_84; // 0x1250 (40)
	struct Unknown AnimGraphNode_TransitionResult_83; // 0x1278 (40)
	struct Unknown AnimGraphNode_TransitionResult_82; // 0x12A0 (40)
	struct Unknown AnimGraphNode_SequencePlayer_345; // 0x12C8 (120)
	struct Unknown AnimGraphNode_StateResult_61; // 0x1340 (48)
	struct Unknown AnimGraphNode_TransitionResult_81; // 0x1370 (40)
	struct Unknown AnimGraphNode_SequencePlayer_344; // 0x1398 (120)
	struct Unknown AnimGraphNode_StateResult_60; // 0x1410 (48)
	struct Unknown AnimGraphNode_SequencePlayer_343; // 0x1440 (120)
	struct Unknown AnimGraphNode_StateResult_59; // 0x14B8 (48)
	struct Unknown AnimGraphNode_StateMachine_19; // 0x14E8 (176)
	struct Unknown AnimGraphNode_StateResult_58; // 0x1598 (48)
	struct Unknown AnimGraphNode_TransitionResult_80; // 0x15C8 (40)
	struct Unknown AnimGraphNode_TransitionResult_79; // 0x15F0 (40)
	struct Unknown AnimGraphNode_TransitionResult_78; // 0x1618 (40)
	struct Unknown AnimGraphNode_TransitionResult_77; // 0x1640 (40)
	struct Unknown AnimGraphNode_SequencePlayer_342; // 0x1668 (120)
	struct Unknown AnimGraphNode_StateResult_57; // 0x16E0 (48)
	struct Unknown AnimGraphNode_BlendSpacePlayer_116; // 0x1710 (224)
	struct Unknown AnimGraphNode_StateResult_56; // 0x17F0 (48)
	struct Unknown AnimGraphNode_SequencePlayer_341; // 0x1820 (120)
	struct Unknown AnimGraphNode_StateResult_55; // 0x1898 (48)
	struct Unknown AnimGraphNode_StateMachine_18; // 0x18C8 (176)
	struct Unknown AnimGraphNode_StateResult_54; // 0x1978 (48)
	struct Unknown AnimGraphNode_TransitionResult_76; // 0x19A8 (40)
	struct Unknown AnimGraphNode_TransitionResult_75; // 0x19D0 (40)
	struct Unknown AnimGraphNode_SequencePlayer_340; // 0x19F8 (120)
	struct Unknown AnimGraphNode_BlendListByBool_83; // 0x1A70 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_69; // 0x1B10 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_115; // 0x1BC0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_114; // 0x1CA0 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_97; // 0x1D80 (192)
	struct Unknown AnimGraphNode_SequencePlayer_339; // 0x1E40 (120)
	struct Unknown AnimGraphNode_StateResult_53; // 0x1EB8 (48)
	struct Unknown AnimGraphNode_SequencePlayer_338; // 0x1EE8 (120)
	struct Unknown AnimGraphNode_BlendListByBool_82; // 0x1F60 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_68; // 0x2000 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_113; // 0x20B0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_112; // 0x2190 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_96; // 0x2270 (192)
	struct Unknown AnimGraphNode_SequencePlayer_337; // 0x2330 (120)
	struct Unknown AnimGraphNode_StateResult_52; // 0x23A8 (48)
	struct Unknown AnimGraphNode_SequencePlayer_336; // 0x23D8 (120)
	struct Unknown AnimGraphNode_BlendListByBool_81; // 0x2450 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_67; // 0x24F0 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_111; // 0x25A0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_110; // 0x2680 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_95; // 0x2760 (192)
	struct Unknown AnimGraphNode_SequencePlayer_335; // 0x2820 (120)
	struct Unknown AnimGraphNode_StateResult_51; // 0x2898 (48)
	struct Unknown AnimGraphNode_StateMachine_17; // 0x28C8 (176)
	struct Unknown AnimGraphNode_StateResult_50; // 0x2978 (48)
	struct Unknown AnimGraphNode_TransitionResult_74; // 0x29A8 (40)
	struct Unknown AnimGraphNode_TransitionResult_73; // 0x29D0 (40)
	struct Unknown AnimGraphNode_TransitionResult_72; // 0x29F8 (40)
	struct Unknown AnimGraphNode_TransitionResult_71; // 0x2A20 (40)
	struct Unknown AnimGraphNode_TransitionResult_70; // 0x2A48 (40)
	struct Unknown AnimGraphNode_TransitionResult_69; // 0x2A70 (40)
	struct Unknown AnimGraphNode_TransitionResult_68; // 0x2A98 (40)
	struct Unknown AnimGraphNode_TransitionResult_67; // 0x2AC0 (40)
	struct Unknown AnimGraphNode_TransitionResult_66; // 0x2AE8 (40)
	struct Unknown AnimGraphNode_BlendListByBool_80; // 0x2B10 (160)
	struct Unknown AnimGraphNode_SequencePlayer_334; // 0x2BB0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_79; // 0x2C28 (160)
	struct Unknown AnimGraphNode_SequencePlayer_333; // 0x2CC8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_94; // 0x2D40 (192)
	struct Unknown AnimGraphNode_SequencePlayer_332; // 0x2E00 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_66; // 0x2E78 (176)
	struct Unknown AnimGraphNode_SequencePlayer_331; // 0x2F28 (120)
	struct Unknown AnimGraphNode_StateResult_49; // 0x2FA0 (48)
	struct Unknown AnimGraphNode_BlendListByBool_78; // 0x2FD0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_330; // 0x3070 (120)
	struct Unknown AnimGraphNode_SequencePlayer_329; // 0x30E8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_93; // 0x3160 (192)
	struct Unknown AnimGraphNode_BlendListByBool_77; // 0x3220 (160)
	struct Unknown AnimGraphNode_BlendListByBool_76; // 0x32C0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_328; // 0x3360 (120)
	struct Unknown AnimGraphNode_SequencePlayer_327; // 0x33D8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_326; // 0x3450 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_65; // 0x34C8 (176)
	struct Unknown AnimGraphNode_StateResult_48; // 0x3578 (48)
	struct Unknown AnimGraphNode_BlendSpacePlayer_109; // 0x35A8 (224)
	struct Unknown AnimGraphNode_TransitionResult_65; // 0x3688 (40)
	struct Unknown AnimGraphNode_TransitionResult_64; // 0x36B0 (40)
	struct Unknown AnimGraphNode_TransitionResult_63; // 0x36D8 (40)
	struct Unknown AnimGraphNode_TransitionResult_62; // 0x3700 (40)
	struct Unknown AnimGraphNode_TransitionResult_61; // 0x3728 (40)
	struct Unknown AnimGraphNode_TransitionResult_60; // 0x3750 (40)
	struct Unknown AnimGraphNode_SequencePlayer_325; // 0x3778 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_24; // 0x37F0 (200)
	struct Unknown AnimGraphNode_SequencePlayer_324; // 0x38B8 (120)
	struct Unknown AnimGraphNode_StateResult_47; // 0x3930 (48)
	struct Unknown AnimGraphNode_TwoWayBlend_23; // 0x3960 (200)
	struct Unknown AnimGraphNode_SequencePlayer_323; // 0x3A28 (120)
	struct Unknown AnimGraphNode_SequencePlayer_322; // 0x3AA0 (120)
	struct Unknown AnimGraphNode_StateResult_46; // 0x3B18 (48)
	struct Unknown AnimGraphNode_SequencePlayer_321; // 0x3B48 (120)
	struct Unknown AnimGraphNode_StateResult_45; // 0x3BC0 (48)
	struct Unknown AnimGraphNode_StateMachine_16; // 0x3BF0 (176)
	struct Unknown AnimGraphNode_BlendListByBool_75; // 0x3CA0 (160)
	struct Unknown AnimGraphNode_StateResult_44; // 0x3D40 (48)
	struct Unknown AnimGraphNode_SequencePlayer_320; // 0x3D70 (120)
	struct Unknown AnimGraphNode_StateResult_43; // 0x3DE8 (48)
	struct Unknown AnimGraphNode_StateMachine_15; // 0x3E18 (176)
	struct Unknown AnimGraphNode_StateResult_42; // 0x3EC8 (48)
	struct Unknown AnimGraphNode_SequencePlayer_319; // 0x3EF8 (120)
	struct Unknown AnimGraphNode_StateResult_41; // 0x3F70 (48)
	struct Unknown AnimGraphNode_SequencePlayer_318; // 0x3FA0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_74; // 0x4018 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_108; // 0x40B8 (224)
	struct Unknown AnimGraphNode_StateResult_40; // 0x4198 (48)
	struct Unknown AnimGraphNode_TransitionResult_59; // 0x41C8 (40)
	struct Unknown AnimGraphNode_ApplyAdditive_17; // 0x41F0 (200)
	struct Unknown AnimGraphNode_BlendSpacePlayer_107; // 0x42B8 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_106; // 0x4398 (224)
	struct Unknown AnimGraphNode_BlendListByBool_73; // 0x4478 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_105; // 0x4518 (224)
	struct Unknown AnimGraphNode_StateResult_39; // 0x45F8 (48)
	struct Unknown AnimGraphNode_TransitionResult_58; // 0x4628 (40)
	struct Unknown AnimGraphNode_TransitionResult_57; // 0x4650 (40)
	struct Unknown AnimGraphNode_TransitionResult_56; // 0x4678 (40)
	struct Unknown AnimGraphNode_TransitionResult_55; // 0x46A0 (40)
	struct Unknown AnimGraphNode_BlendSpacePlayer_104; // 0x46C8 (224)
	struct Unknown AnimGraphNode_StateResult_38; // 0x47A8 (48)
	struct Unknown AnimGraphNode_BlendSpacePlayer_103; // 0x47D8 (224)
	struct Unknown AnimGraphNode_StateResult_37; // 0x48B8 (48)
	struct Unknown AnimGraphNode_StateMachine_14; // 0x48E8 (176)
	struct Unknown AnimGraphNode_StateResult_36; // 0x4998 (48)
	struct Unknown AnimGraphNode_TransitionResult_54; // 0x49C8 (40)
	struct Unknown AnimGraphNode_TransitionResult_53; // 0x49F0 (40)
	struct Unknown AnimGraphNode_SequencePlayer_317; // 0x4A18 (120)
	struct Unknown AnimGraphNode_StateResult_35; // 0x4A90 (48)
	struct Unknown AnimGraphNode_SequencePlayer_316; // 0x4AC0 (120)
	struct Unknown AnimGraphNode_StateResult_34; // 0x4B38 (48)
	struct Unknown AnimGraphNode_StateMachine_13; // 0x4B68 (176)
	struct Unknown AnimGraphNode_StateResult_33; // 0x4C18 (48)
	struct Unknown AnimGraphNode_StateMachine_12; // 0x4C48 (176)
	struct Unknown AnimGraphNode_StateResult_32; // 0x4CF8 (48)
	struct Unknown AnimGraphNode_SequencePlayer_315; // 0x4D28 (120)
	struct Unknown AnimGraphNode_SequencePlayer_314; // 0x4DA0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_92; // 0x4E18 (192)
	struct Unknown AnimGraphNode_SequencePlayer_313; // 0x4ED8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_312; // 0x4F50 (120)
	struct Unknown AnimGraphNode_SequencePlayer_311; // 0x4FC8 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_64; // 0x5040 (176)
	struct Unknown AnimGraphNode_SequencePlayer_310; // 0x50F0 (120)
	struct Unknown AnimGraphNode_StateResult_31; // 0x5168 (48)
	struct Unknown AnimGraphNode_SequencePlayer_309; // 0x5198 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_91; // 0x5210 (192)
	struct Unknown AnimGraphNode_SequencePlayer_308; // 0x52D0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_90; // 0x5348 (192)
	struct Unknown AnimGraphNode_SequencePlayer_307; // 0x5408 (120)
	struct Unknown AnimGraphNode_SequencePlayer_306; // 0x5480 (120)
	struct Unknown AnimGraphNode_SequencePlayer_305; // 0x54F8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_89; // 0x5570 (192)
	struct Unknown AnimGraphNode_SequenceEvaluator_6; // 0x5630 (72)
	struct Unknown AnimGraphNode_SequencePlayer_304; // 0x5678 (120)
	struct Unknown AnimGraphNode_SequencePlayer_303; // 0x56F0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_302; // 0x5768 (120)
	struct Unknown AnimGraphNode_SequencePlayer_301; // 0x57E0 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_63; // 0x5858 (176)
	struct Unknown AnimGraphNode_SequencePlayer_300; // 0x5908 (120)
	struct Unknown AnimGraphNode_SequencePlayer_299; // 0x5980 (120)
	struct Unknown AnimGraphNode_SequencePlayer_298; // 0x59F8 (120)
	struct Unknown AnimGraphNode_BlendListByBool_72; // 0x5A70 (160)
	struct Unknown AnimGraphNode_SequenceEvaluator_5; // 0x5B10 (72)
	struct Unknown AnimGraphNode_BlendListByBool_71; // 0x5B58 (160)
	struct Unknown AnimGraphNode_SequencePlayer_297; // 0x5BF8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_88; // 0x5C70 (192)
	struct Unknown AnimGraphNode_SequencePlayer_296; // 0x5D30 (120)
	struct Unknown AnimGraphNode_SequencePlayer_295; // 0x5DA8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_294; // 0x5E20 (120)
	struct Unknown AnimGraphNode_SequencePlayer_293; // 0x5E98 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_87; // 0x5F10 (192)
	struct Unknown AnimGraphNode_BlendListByBool_70; // 0x5FD0 (160)
	struct Unknown AnimGraphNode_SequenceEvaluator_4; // 0x6070 (72)
	struct Unknown AnimGraphNode_SequenceEvaluator_3; // 0x60B8 (72)
	struct Unknown AnimGraphNode_SequenceEvaluator_2; // 0x6100 (72)
	struct Unknown AnimGraphNode_BlendListByEnum_62; // 0x6148 (176)
	struct Unknown AnimGraphNode_SequencePlayer_292; // 0x61F8 (120)
	struct Unknown AnimGraphNode_Slot_35; // 0x6270 (72)
	struct Unknown AnimGraphNode_SequencePlayer_291; // 0x62B8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_86; // 0x6330 (192)
	struct Unknown AnimGraphNode_BlendListByBool_69; // 0x63F0 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_61; // 0x6490 (176)
	struct Unknown AnimGraphNode_SequencePlayer_290; // 0x6540 (120)
	struct Unknown AnimGraphNode_BlendListByBool_68; // 0x65B8 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_102; // 0x6658 (224)
	struct Unknown AnimGraphNode_ApplyAdditive_16; // 0x6738 (200)
	struct Unknown AnimGraphNode_StateResult_30; // 0x6800 (48)
	struct Unknown AnimGraphNode_TransitionResult_52; // 0x6830 (40)
	struct Unknown AnimGraphNode_BlendListByEnum_60; // 0x6858 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_59; // 0x6908 (176)
	struct Unknown AnimGraphNode_UseCachedPose_60; // 0x69B8 (40)
	struct Unknown AnimGraphNode_LocalRefPose; // 0x69E0 (24)
	struct Unknown AnimGraphNode_Slot_34; // 0x69F8 (72)
	struct Unknown AnimGraphNode_LayeredBoneBlend_85; // 0x6A40 (192)
	struct Unknown AnimGraphNode_SequencePlayer_289; // 0x6B00 (120)
	struct Unknown AnimGraphNode_BlendListByBool_67; // 0x6B78 (160)
	struct Unknown AnimGraphNode_TwoWayBlend_22; // 0x6C18 (200)
	struct Unknown AnimGraphNode_SequencePlayer_288; // 0x6CE0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_287; // 0x6D58 (120)
	struct Unknown AnimGraphNode_SequencePlayer_286; // 0x6DD0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_84; // 0x6E48 (192)
	struct Unknown AnimGraphNode_SequencePlayer_285; // 0x6F08 (120)
	struct Unknown AnimGraphNode_StateResult_29; // 0x6F80 (48)
	struct Unknown AnimGraphNode_StateMachine_11; // 0x6FB0 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_26; // 0x7060 (184)
	struct Unknown AnimGraphNode_LayeredBoneBlend_83; // 0x7118 (192)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_9; // 0x71D8 (392)
	struct Unknown AnimGraphNode_BlendListByBool_66; // 0x7360 (160)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_8; // 0x7400 (392)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_7; // 0x7588 (32)
	struct Unknown AnimGraphNode_LocalToComponentSpace_7; // 0x75A8 (32)
	struct Unknown AnimGraphNode_ModifyBone_3; // 0x75C8 (264)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_7; // 0x76D0 (392)
	struct Unknown AnimGraphNode_BlendListByEnum_58; // 0x7858 (176)
	struct Unknown AnimGraphNode_BlendListByBool_65; // 0x7908 (160)
	struct Unknown AnimGraphNode_Slot_33; // 0x79A8 (72)
	struct Unknown AnimGraphNode_BlendListByBool_64; // 0x79F0 (160)
	struct Unknown AnimGraphNode_SaveCachedPose_25; // 0x7A90 (184)
	struct Unknown AnimGraphNode_Slot_32; // 0x7B48 (72)
	struct Unknown AnimGraphNode_SaveCachedPose_24; // 0x7B90 (184)
	struct Unknown AnimGraphNode_SaveCachedPose_23; // 0x7C48 (184)
	struct Unknown AnimGraphNode_UseCachedPose_59; // 0x7D00 (40)
	struct Unknown AnimGraphNode_UseCachedPose_58; // 0x7D28 (40)
	struct Unknown AnimGraphNode_UseCachedPose_57; // 0x7D50 (40)
	struct Unknown AnimGraphNode_UseCachedPose_56; // 0x7D78 (40)
	struct Unknown AnimGraphNode_LayeredBoneBlend_82; // 0x7DA0 (192)
	struct Unknown AnimGraphNode_UseCachedPose_55; // 0x7E60 (40)
	struct Unknown AnimGraphNode_BlendListByBool_63; // 0x7E88 (160)
	struct Unknown AnimGraphNode_Slot_31; // 0x7F28 (72)
	struct Unknown AnimGraphNode_UseCachedPose_54; // 0x7F70 (40)
	struct Unknown AnimGraphNode_UseCachedPose_53; // 0x7F98 (40)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_6; // 0x7FC0 (392)
	struct Unknown AnimGraphNode_UseCachedPose_52; // 0x8148 (40)
	struct Unknown AnimGraphNode_BlendListByBool_62; // 0x8170 (160)
	struct Unknown AnimGraphNode_BlendListByBool_61; // 0x8210 (160)
	struct Unknown AnimGraphNode_LayeredBoneBlend_81; // 0x82B0 (192)
	struct Unknown AnimGraphNode_UseCachedPose_51; // 0x8370 (40)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_5; // 0x8398 (392)
	struct Unknown AnimGraphNode_UseCachedPose_50; // 0x8520 (40)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_4; // 0x8548 (392)
	struct Unknown AnimGraphNode_BlendListByBool_60; // 0x86D0 (160)
	struct Unknown AnimGraphNode_Slot_30; // 0x8770 (72)
	struct Unknown AnimGraphNode_LayeredBoneBlend_80; // 0x87B8 (192)
	struct Unknown AnimGraphNode_Slot_29; // 0x8878 (72)
	struct Unknown AnimGraphNode_BlendListByBool_59; // 0x88C0 (160)
	struct Unknown AnimGraphNode_Slot_28; // 0x8960 (72)
	struct Unknown AnimGraphNode_LayeredBoneBlend_79; // 0x89A8 (192)
	struct Unknown AnimGraphNode_Slot_27; // 0x8A68 (72)
	struct Unknown AnimGraphNode_Slot_26; // 0x8AB0 (72)
	struct Unknown AnimGraphNode_UseCachedPose_49; // 0x8AF8 (40)
	struct Unknown AnimGraphNode_ApplyAdditive_15; // 0x8B20 (200)
	struct Unknown AnimGraphNode_SequencePlayer_284; // 0x8BE8 (120)
	struct Unknown AnimGraphNode_Slot_25; // 0x8C60 (72)
	struct Unknown AnimGraphNode_ApplyAdditive_14; // 0x8CA8 (200)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_3; // 0x8D70 (392)
	struct Unknown AnimGraphNode_BlendListByBool_58; // 0x8EF8 (160)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace_2; // 0x8F98 (392)
	struct Unknown AnimGraphNode_UseCachedPose_48; // 0x9120 (40)
	struct Unknown AnimGraphNode_LayeredBoneBlend_78; // 0x9148 (192)
	struct Unknown AnimGraphNode_LayeredBoneBlend_77; // 0x9208 (192)
	struct Unknown AnimGraphNode_SaveCachedPose_22; // 0x92C8 (184)
	struct Unknown AnimGraphNode_UseCachedPose_47; // 0x9380 (40)
	struct Unknown AnimGraphNode_UseCachedPose_46; // 0x93A8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_45; // 0x93D0 (40)
	struct Unknown AnimGraphNode_BlendListByBool_57; // 0x93F8 (160)
	struct Unknown AnimGraphNode_Slot_24; // 0x9498 (72)
	struct Unknown AnimGraphNode_BlendSpacePlayer_101; // 0x94E0 (224)
	struct Unknown AnimGraphNode_SequenceEvaluator; // 0x95C0 (72)
	struct Unknown AnimGraphNode_LocalToComponentSpace_6; // 0x9608 (32)
	struct Unknown AnimGraphNode_ModifyBone_2; // 0x9628 (264)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_6; // 0x9730 (32)
	struct Unknown AnimGraphNode_BlendListByBool_56; // 0x9750 (160)
	struct Unknown AnimGraphNode_IdentityPose_7; // 0x97F0 (24)
	struct Unknown AnimGraphNode_LayeredBoneBlend_76; // 0x9808 (192)
	struct Unknown AnimGraphNode_SequencePlayer_283; // 0x98C8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_75; // 0x9940 (192)
	struct Unknown AnimGraphNode_IdentityPose_6; // 0x9A00 (24)
	struct Unknown AnimGraphNode_SequencePlayer_282; // 0x9A18 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_74; // 0x9A90 (192)
	struct Unknown AnimGraphNode_IdentityPose_5; // 0x9B50 (24)
	struct Unknown AnimGraphNode_BlendListByEnum_57; // 0x9B68 (176)
	struct Unknown AnimGraphNode_SequencePlayer_281; // 0x9C18 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_73; // 0x9C90 (192)
	struct Unknown AnimGraphNode_IdentityPose_4; // 0x9D50 (24)
	struct Unknown AnimGraphNode_StateResult_28; // 0x9D68 (48)
	struct Unknown AnimGraphNode_StateMachine_10; // 0x9D98 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_21; // 0x9E48 (184)
	struct Unknown AnimGraphNode_ApplyAdditive_13; // 0x9F00 (200)
	struct Unknown AnimGraphNode_UseCachedPose_44; // 0x9FC8 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_20; // 0x9FF0 (184)
	struct Unknown AnimGraphNode_UseCachedPose_43; // 0xA0A8 (40)
	struct Unknown AnimGraphNode_BlendListByBool_55; // 0xA0D0 (160)
	struct Unknown AnimGraphNode_Slot_23; // 0xA170 (72)
	struct Unknown AnimGraphNode_SequencePlayer_280; // 0xA1B8 (120)
	struct Unknown AnimGraphNode_BlendListByBool_54; // 0xA230 (160)
	struct Unknown AnimGraphNode_BlendListByBool_53; // 0xA2D0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_279; // 0xA370 (120)
	struct Unknown AnimGraphNode_LocalToComponentSpace_5; // 0xA3E8 (32)
	struct Unknown AnimGraphNode_ModifyBone; // 0xA408 (264)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_5; // 0xA510 (32)
	struct Unknown AnimGraphNode_BlendListByBool_52; // 0xA530 (160)
	struct Unknown AnimGraphNode_Slot_22; // 0xA5D0 (72)
	struct Unknown AnimGraphNode_Slot_21; // 0xA618 (72)
	struct Unknown AnimGraphNode_Slot_20; // 0xA660 (72)
	struct Unknown AnimGraphNode_IdentityPose_3; // 0xA6A8 (24)
	struct Unknown AnimGraphNode_SequencePlayer_278; // 0xA6C0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_51; // 0xA738 (160)
	struct Unknown AnimGraphNode_BlendListByBool_50; // 0xA7D8 (160)
	struct Unknown AnimGraphNode_SequencePlayer_277; // 0xA878 (120)
	struct Unknown AnimGraphNode_StateResult_27; // 0xA8F0 (48)
	struct Unknown AnimGraphNode_StateMachine_9; // 0xA920 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_19; // 0xA9D0 (184)
	struct Unknown AnimGraphNode_UseCachedPose_42; // 0xAA88 (40)
	struct Unknown AnimGraphNode_UseCachedPose_41; // 0xAAB0 (40)
	struct Unknown AnimGraphNode_BlendListByBool_49; // 0xAAD8 (160)
	struct Unknown AnimGraphNode_TwoWayBlend_21; // 0xAB78 (200)
	struct Unknown AnimGraphNode_Slot_19; // 0xAC40 (72)
	struct Unknown AnimGraphNode_BlendListByBool_48; // 0xAC88 (160)
	struct Unknown AnimGraphNode_Slot_18; // 0xAD28 (72)
	struct Unknown AnimGraphNode_LayeredBoneBlend_72; // 0xAD70 (192)
	struct Unknown AnimGraphNode_UseCachedPose_40; // 0xAE30 (40)
	struct Unknown AnimGraphNode_UseCachedPose_39; // 0xAE58 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_18; // 0xAE80 (184)
	struct Unknown AnimGraphNode_UseCachedPose_38; // 0xAF38 (40)
	struct Unknown AnimGraphNode_UseCachedPose_37; // 0xAF60 (40)
	struct Unknown AnimGraphNode_Slot_17; // 0xAF88 (72)
	struct Unknown AnimGraphNode_LayeredBoneBlend_71; // 0xAFD0 (192)
	struct Unknown AnimGraphNode_Slot_16; // 0xB090 (72)
	struct Unknown AnimGraphNode_UseCachedPose_36; // 0xB0D8 (40)
	struct Unknown AnimGraphNode_SequencePlayer_276; // 0xB100 (120)
	struct Unknown AnimGraphNode_SequencePlayer_275; // 0xB178 (120)
	struct Unknown AnimGraphNode_BlendListByInt_20; // 0xB1F0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_274; // 0xB290 (120)
	struct Unknown AnimGraphNode_SequencePlayer_273; // 0xB308 (120)
	struct Unknown AnimGraphNode_SequencePlayer_272; // 0xB380 (120)
	struct Unknown AnimGraphNode_BlendListByInt_19; // 0xB3F8 (160)
	struct Unknown AnimGraphNode_SequencePlayer_271; // 0xB498 (120)
	struct Unknown AnimGraphNode_SequencePlayer_270; // 0xB510 (120)
	struct Unknown AnimGraphNode_SequencePlayer_269; // 0xB588 (120)
	struct Unknown AnimGraphNode_BlendListByInt_18; // 0xB600 (160)
	struct Unknown AnimGraphNode_SequencePlayer_268; // 0xB6A0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_267; // 0xB718 (120)
	struct Unknown AnimGraphNode_SequencePlayer_266; // 0xB790 (120)
	struct Unknown AnimGraphNode_BlendListByInt_17; // 0xB808 (160)
	struct Unknown AnimGraphNode_SequencePlayer_265; // 0xB8A8 (120)
	struct Unknown AnimGraphNode_BlendListByBool_47; // 0xB920 (160)
	struct Unknown AnimGraphNode_BlendListByBool_46; // 0xB9C0 (160)
	struct Unknown AnimGraphNode_BlendListByBool_45; // 0xBA60 (160)
	struct Unknown AnimGraphNode_StateResult_26; // 0xBB00 (48)
	struct Unknown AnimGraphNode_StateMachine_8; // 0xBB30 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_17; // 0xBBE0 (184)
	struct Unknown AnimGraphNode_ApplyAdditive_12; // 0xBC98 (200)
	struct Unknown AnimGraphNode_UseCachedPose_35; // 0xBD60 (40)
	struct Unknown AnimGraphNode_BlendListByBool_44; // 0xBD88 (160)
	struct Unknown AnimGraphNode_SequencePlayer_264; // 0xBE28 (120)
	struct Unknown AnimGraphNode_SequencePlayer_263; // 0xBEA0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_262; // 0xBF18 (120)
	struct Unknown AnimGraphNode_SequencePlayer_261; // 0xBF90 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_56; // 0xC008 (176)
	struct Unknown AnimGraphNode_StateResult_25; // 0xC0B8 (48)
	struct Unknown AnimGraphNode_StateMachine_7; // 0xC0E8 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_16; // 0xC198 (184)
	struct Unknown AnimGraphNode_LayeredBoneBlend_70; // 0xC250 (192)
	struct Unknown AnimGraphNode_UseCachedPose_34; // 0xC310 (40)
	struct Unknown AnimGraphNode_BlendListByBool_43; // 0xC338 (160)
	struct Unknown AnimGraphNode_BlendListByBool_42; // 0xC3D8 (160)
	struct Unknown AnimGraphNode_SequencePlayer_260; // 0xC478 (120)
	struct Unknown AnimGraphNode_SequencePlayer_259; // 0xC4F0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_41; // 0xC568 (160)
	struct Unknown AnimGraphNode_SequencePlayer_258; // 0xC608 (120)
	struct Unknown AnimGraphNode_SequencePlayer_257; // 0xC680 (120)
	struct Unknown AnimGraphNode_StateResult_24; // 0xC6F8 (48)
	struct Unknown AnimGraphNode_StateMachine_6; // 0xC728 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_15; // 0xC7D8 (184)
	struct Unknown AnimGraphNode_BlendListByBool_40; // 0xC890 (160)
	struct Unknown AnimGraphNode_BlendListByBool_39; // 0xC930 (160)
	struct Unknown AnimGraphNode_UseCachedPose_33; // 0xC9D0 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_14; // 0xC9F8 (184)
	struct Unknown AnimGraphNode_UseCachedPose_32; // 0xCAB0 (40)
	struct Unknown AnimGraphNode_Slot_15; // 0xCAD8 (72)
	struct Unknown AnimGraphNode_LayeredBoneBlend_69; // 0xCB20 (192)
	struct Unknown AnimGraphNode_UseCachedPose_31; // 0xCBE0 (40)
	struct Unknown AnimGraphNode_TwoBoneIK_11; // 0xCC10 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_10; // 0xCDF0 (480)
	struct Unknown AnimGraphNode_LocalToComponentSpace_4; // 0xCFD0 (32)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_4; // 0xCFF0 (32)
	struct Unknown AnimGraphNode_SaveCachedPose_13; // 0xD010 (184)
	struct Unknown AnimGraphNode_UseCachedPose_30; // 0xD0C8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_29; // 0xD0F0 (40)
	struct Unknown AnimGraphNode_TwoBoneIK_9; // 0xD120 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_8; // 0xD300 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_7; // 0xD4E0 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_6; // 0xD6C0 (480)
	struct Unknown AnimGraphNode_LocalToComponentSpace_3; // 0xD8A0 (32)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_3; // 0xD8C0 (32)
	struct Unknown AnimGraphNode_TwoBoneIK_5; // 0xD8E0 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_4; // 0xDAC0 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_3; // 0xDCA0 (480)
	struct Unknown AnimGraphNode_TwoBoneIK_2; // 0xDE80 (480)
	struct Unknown AnimGraphNode_LocalToComponentSpace_2; // 0xE060 (32)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_2; // 0xE080 (32)
	struct Unknown AnimGraphNode_UseCachedPose_28; // 0xE0A0 (40)
	struct Unknown AnimGraphNode_UseCachedPose_27; // 0xE0C8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_26; // 0xE0F0 (40)
	struct Unknown AnimGraphNode_Slot_14; // 0xE118 (72)
	struct Unknown AnimGraphNode_BlendListByEnum_55; // 0xE160 (176)
	struct Unknown AnimGraphNode_BlendListByBool_38; // 0xE210 (160)
	struct Unknown AnimGraphNode_RotationOffsetBlendSpace; // 0xE2B0 (392)
	struct Unknown AnimGraphNode_UseCachedPose_25; // 0xE438 (40)
	struct Unknown AnimGraphNode_SequencePlayer_256; // 0xE460 (120)
	struct Unknown AnimGraphNode_BlendListByBool_37; // 0xE4D8 (160)
	struct Unknown AnimGraphNode_Slot_13; // 0xE578 (72)
	struct Unknown AnimGraphNode_Slot_12; // 0xE5C0 (72)
	struct Unknown AnimGraphNode_BlendListByBool_36; // 0xE608 (160)
	struct Unknown AnimGraphNode_SequencePlayer_255; // 0xE6A8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_254; // 0xE720 (120)
	struct Unknown AnimGraphNode_BlendListByBool_35; // 0xE798 (160)
	struct Unknown AnimGraphNode_LayeredBoneBlend_68; // 0xE838 (192)
	struct Unknown AnimGraphNode_Slot_11; // 0xE8F8 (72)
	struct Unknown AnimGraphNode_BlendListByBool_34; // 0xE940 (160)
	struct Unknown AnimGraphNode_LayeredBoneBlend_67; // 0xE9E0 (192)
	struct Unknown AnimGraphNode_Slot_10; // 0xEAA0 (72)
	struct Unknown AnimGraphNode_BlendListByBool_33; // 0xEAE8 (160)
	struct Unknown AnimGraphNode_ApplyAdditive_11; // 0xEB88 (200)
	struct Unknown AnimGraphNode_UseCachedPose_24; // 0xEC50 (40)
	struct Unknown AnimGraphNode_TransitionResult_51; // 0xEC78 (40)
	struct Unknown AnimGraphNode_TransitionResult_50; // 0xECA0 (40)
	struct Unknown AnimGraphNode_TransitionResult_49; // 0xECC8 (40)
	struct Unknown AnimGraphNode_TransitionResult_48; // 0xECF0 (40)
	struct Unknown AnimGraphNode_TransitionResult_47; // 0xED18 (40)
	struct Unknown AnimGraphNode_TransitionResult_46; // 0xED40 (40)
	struct Unknown AnimGraphNode_TransitionResult_45; // 0xED68 (40)
	struct Unknown AnimGraphNode_TransitionResult_44; // 0xED90 (40)
	struct Unknown AnimGraphNode_TransitionResult_43; // 0xEDB8 (40)
	struct Unknown AnimGraphNode_TransitionResult_42; // 0xEDE0 (40)
	struct Unknown AnimGraphNode_TransitionResult_41; // 0xEE08 (40)
	struct Unknown AnimGraphNode_TransitionResult_40; // 0xEE30 (40)
	struct Unknown AnimGraphNode_TransitionResult_39; // 0xEE58 (40)
	struct Unknown AnimGraphNode_TransitionResult_38; // 0xEE80 (40)
	struct Unknown AnimGraphNode_TransitionResult_37; // 0xEEA8 (40)
	struct Unknown AnimGraphNode_TransitionResult_36; // 0xEED0 (40)
	struct Unknown AnimGraphNode_TransitionResult_35; // 0xEEF8 (40)
	struct Unknown AnimGraphNode_TransitionResult_34; // 0xEF20 (40)
	struct Unknown AnimGraphNode_TransitionResult_33; // 0xEF48 (40)
	struct Unknown AnimGraphNode_TransitionResult_32; // 0xEF70 (40)
	struct Unknown AnimGraphNode_TransitionResult_31; // 0xEF98 (40)
	struct Unknown AnimGraphNode_TransitionResult_30; // 0xEFC0 (40)
	struct Unknown AnimGraphNode_TransitionResult_29; // 0xEFE8 (40)
	struct Unknown AnimGraphNode_TransitionResult_28; // 0xF010 (40)
	struct Unknown AnimGraphNode_TransitionResult_27; // 0xF038 (40)
	struct Unknown AnimGraphNode_TransitionResult_26; // 0xF060 (40)
	struct Unknown AnimGraphNode_SequencePlayer_253; // 0xF088 (120)
	struct Unknown AnimGraphNode_SequencePlayer_252; // 0xF100 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_20; // 0xF178 (200)
	struct Unknown AnimGraphNode_LayeredBoneBlend_66; // 0xF240 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_100; // 0xF300 (224)
	struct Unknown AnimGraphNode_SequencePlayer_251; // 0xF3E0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_65; // 0xF458 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_99; // 0xF518 (224)
	struct Unknown AnimGraphNode_SequencePlayer_250; // 0xF5F8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_249; // 0xF670 (120)
	struct Unknown AnimGraphNode_SequencePlayer_248; // 0xF6E8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_247; // 0xF760 (120)
	struct Unknown AnimGraphNode_SequencePlayer_246; // 0xF7D8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_245; // 0xF850 (120)
	struct Unknown AnimGraphNode_SequencePlayer_244; // 0xF8C8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_243; // 0xF940 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_19; // 0xF9B8 (200)
	struct Unknown AnimGraphNode_SequencePlayer_242; // 0xFA80 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_64; // 0xFAF8 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_98; // 0xFBB8 (224)
	struct Unknown AnimGraphNode_SequencePlayer_241; // 0xFC98 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_63; // 0xFD10 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_97; // 0xFDD0 (224)
	struct Unknown AnimGraphNode_BlendListByBool_32; // 0xFEB0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_240; // 0xFF50 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_18; // 0xFFC8 (200)
	struct Unknown AnimGraphNode_BlendSpacePlayer_96; // 0x10090 (224)
	struct Unknown AnimGraphNode_SequencePlayer_239; // 0x10170 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_17; // 0x101E8 (200)
	struct Unknown AnimGraphNode_BlendSpacePlayer_95; // 0x102B0 (224)
	struct Unknown AnimGraphNode_TwoWayBlend_16; // 0x10390 (200)
	struct Unknown AnimGraphNode_SequencePlayer_238; // 0x10458 (120)
	struct Unknown AnimGraphNode_SequencePlayer_237; // 0x104D0 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_15; // 0x10548 (200)
	struct Unknown AnimGraphNode_SequencePlayer_236; // 0x10610 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_14; // 0x10688 (200)
	struct Unknown AnimGraphNode_SequencePlayer_235; // 0x10750 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_13; // 0x107C8 (200)
	struct Unknown AnimGraphNode_SequencePlayer_234; // 0x10890 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_12; // 0x10908 (200)
	struct Unknown AnimGraphNode_SequencePlayer_233; // 0x109D0 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_11; // 0x10A48 (200)
	struct Unknown AnimGraphNode_BlendSpacePlayer_94; // 0x10B10 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_93; // 0x10BF0 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_62; // 0x10CD0 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_92; // 0x10D90 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_54; // 0x10E70 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_91; // 0x10F20 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_90; // 0x11000 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_89; // 0x110E0 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_53; // 0x111C0 (176)
	struct Unknown AnimGraphNode_IdentityPose_2; // 0x11270 (24)
	struct Unknown AnimGraphNode_ApplyAdditive_10; // 0x11288 (200)
	struct Unknown AnimGraphNode_BlendListByEnum_52; // 0x11350 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_61; // 0x11400 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_51; // 0x114C0 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_60; // 0x11570 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_88; // 0x11630 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_50; // 0x11710 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_87; // 0x117C0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_86; // 0x118A0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_85; // 0x11980 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_84; // 0x11A60 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_83; // 0x11B40 (224)
	struct Unknown AnimGraphNode_ApplyAdditive_9; // 0x11C20 (200)
	struct Unknown AnimGraphNode_ApplyAdditive_8; // 0x11CE8 (200)
	struct Unknown AnimGraphNode_BlendListByBool_31; // 0x11DB0 (160)
	struct Unknown AnimGraphNode_StateResult_23; // 0x11E50 (48)
	struct Unknown AnimGraphNode_SequencePlayer_232; // 0x11E80 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_59; // 0x11EF8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_231; // 0x11FB8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_230; // 0x12030 (120)
	struct Unknown AnimGraphNode_SequencePlayer_229; // 0x120A8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_228; // 0x12120 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_58; // 0x12198 (192)
	struct Unknown AnimGraphNode_LayeredBoneBlend_57; // 0x12258 (192)
	struct Unknown AnimGraphNode_SequencePlayer_227; // 0x12318 (120)
	struct Unknown AnimGraphNode_SequencePlayer_226; // 0x12390 (120)
	struct Unknown AnimGraphNode_SequencePlayer_225; // 0x12408 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_49; // 0x12480 (176)
	struct Unknown AnimGraphNode_SequencePlayer_224; // 0x12530 (120)
	struct Unknown AnimGraphNode_StateResult_22; // 0x125A8 (48)
	struct Unknown AnimGraphNode_SequencePlayer_223; // 0x125D8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_222; // 0x12650 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_56; // 0x126C8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_221; // 0x12788 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_55; // 0x12800 (192)
	struct Unknown AnimGraphNode_SequencePlayer_220; // 0x128C0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_219; // 0x12938 (120)
	struct Unknown AnimGraphNode_SequencePlayer_218; // 0x129B0 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_48; // 0x12A28 (176)
	struct Unknown AnimGraphNode_SequencePlayer_217; // 0x12AD8 (120)
	struct Unknown AnimGraphNode_StateResult_21; // 0x12B50 (48)
	struct Unknown AnimGraphNode_SequencePlayer_216; // 0x12B80 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_54; // 0x12BF8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_215; // 0x12CB8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_214; // 0x12D30 (120)
	struct Unknown AnimGraphNode_SequencePlayer_213; // 0x12DA8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_53; // 0x12E20 (192)
	struct Unknown AnimGraphNode_SequencePlayer_212; // 0x12EE0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_52; // 0x12F58 (192)
	struct Unknown AnimGraphNode_SequencePlayer_211; // 0x13018 (120)
	struct Unknown AnimGraphNode_SequencePlayer_210; // 0x13090 (120)
	struct Unknown AnimGraphNode_SequencePlayer_209; // 0x13108 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_47; // 0x13180 (176)
	struct Unknown AnimGraphNode_SequencePlayer_208; // 0x13230 (120)
	struct Unknown AnimGraphNode_StateResult_20; // 0x132A8 (48)
	struct Unknown AnimGraphNode_StateMachine_5; // 0x132D8 (176)
	struct Unknown AnimGraphNode_StateResult_19; // 0x13388 (48)
	struct Unknown AnimGraphNode_LayeredBoneBlend_51; // 0x133B8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_207; // 0x13478 (120)
	struct Unknown AnimGraphNode_SequencePlayer_206; // 0x134F0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_205; // 0x13568 (120)
	struct Unknown AnimGraphNode_SequencePlayer_204; // 0x135E0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_203; // 0x13658 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_50; // 0x136D0 (192)
	struct Unknown AnimGraphNode_LayeredBoneBlend_49; // 0x13790 (192)
	struct Unknown AnimGraphNode_SequencePlayer_202; // 0x13850 (120)
	struct Unknown AnimGraphNode_SequencePlayer_201; // 0x138C8 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_46; // 0x13940 (176)
	struct Unknown AnimGraphNode_SequencePlayer_200; // 0x139F0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_199; // 0x13A68 (120)
	struct Unknown AnimGraphNode_StateResult_18; // 0x13AE0 (48)
	struct Unknown AnimGraphNode_LayeredBoneBlend_48; // 0x13B10 (192)
	struct Unknown AnimGraphNode_SequencePlayer_198; // 0x13BD0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_197; // 0x13C48 (120)
	struct Unknown AnimGraphNode_SequencePlayer_196; // 0x13CC0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_195; // 0x13D38 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_47; // 0x13DB0 (192)
	struct Unknown AnimGraphNode_SequencePlayer_194; // 0x13E70 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_46; // 0x13EE8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_193; // 0x13FA8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_192; // 0x14020 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_45; // 0x14098 (176)
	struct Unknown AnimGraphNode_SequencePlayer_191; // 0x14148 (120)
	struct Unknown AnimGraphNode_SequencePlayer_190; // 0x141C0 (120)
	struct Unknown AnimGraphNode_StateResult_17; // 0x14238 (48)
	struct Unknown AnimGraphNode_SequencePlayer_189; // 0x14268 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_45; // 0x142E0 (192)
	struct Unknown AnimGraphNode_SequencePlayer_188; // 0x143A0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_187; // 0x14418 (120)
	struct Unknown AnimGraphNode_SequencePlayer_186; // 0x14490 (120)
	struct Unknown AnimGraphNode_SequencePlayer_185; // 0x14508 (120)
	struct Unknown AnimGraphNode_SequencePlayer_184; // 0x14580 (120)
	struct Unknown AnimGraphNode_SequencePlayer_183; // 0x145F8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_182; // 0x14670 (120)
	struct Unknown AnimGraphNode_SequencePlayer_181; // 0x146E8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_44; // 0x14760 (192)
	struct Unknown AnimGraphNode_LayeredBoneBlend_43; // 0x14820 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_44; // 0x148E0 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_43; // 0x14990 (176)
	struct Unknown AnimGraphNode_SequencePlayer_180; // 0x14A40 (120)
	struct Unknown AnimGraphNode_SequencePlayer_179; // 0x14AB8 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_42; // 0x14B30 (176)
	struct Unknown AnimGraphNode_SequencePlayer_178; // 0x14BE0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_177; // 0x14C58 (120)
	struct Unknown AnimGraphNode_StateResult_16; // 0x14CD0 (48)
	struct Unknown AnimGraphNode_SequencePlayer_176; // 0x14D00 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_42; // 0x14D78 (192)
	struct Unknown AnimGraphNode_SequencePlayer_175; // 0x14E38 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_41; // 0x14EB0 (192)
	struct Unknown AnimGraphNode_SequencePlayer_174; // 0x14F70 (120)
	struct Unknown AnimGraphNode_SequencePlayer_173; // 0x14FE8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_172; // 0x15060 (120)
	struct Unknown AnimGraphNode_SequencePlayer_171; // 0x150D8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_170; // 0x15150 (120)
	struct Unknown AnimGraphNode_SequencePlayer_169; // 0x151C8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_168; // 0x15240 (120)
	struct Unknown AnimGraphNode_SequencePlayer_167; // 0x152B8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_166; // 0x15330 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_40; // 0x153A8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_165; // 0x15468 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_39; // 0x154E0 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_41; // 0x155A0 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_40; // 0x15650 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_38; // 0x15700 (192)
	struct Unknown AnimGraphNode_SequencePlayer_164; // 0x157C0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_163; // 0x15838 (120)
	struct Unknown AnimGraphNode_SequencePlayer_162; // 0x158B0 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_39; // 0x15928 (176)
	struct Unknown AnimGraphNode_SequencePlayer_161; // 0x159D8 (120)
	struct Unknown AnimGraphNode_StateResult_15; // 0x15A50 (48)
	struct Unknown AnimGraphNode_TransitionResult_25; // 0x15A80 (40)
	struct Unknown AnimGraphNode_TransitionResult_24; // 0x15AA8 (40)
	struct Unknown AnimGraphNode_TransitionResult_23; // 0x15AD0 (40)
	struct Unknown AnimGraphNode_TransitionResult_22; // 0x15AF8 (40)
	struct Unknown AnimGraphNode_TransitionResult_21; // 0x15B20 (40)
	struct Unknown AnimGraphNode_BlendListByBool_30; // 0x15B48 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_82; // 0x15BE8 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_81; // 0x15CC8 (224)
	struct Unknown AnimGraphNode_SequencePlayer_160; // 0x15DA8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_37; // 0x15E20 (192)
	struct Unknown AnimGraphNode_SequencePlayer_159; // 0x15EE0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_158; // 0x15F58 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_36; // 0x15FD0 (192)
	struct Unknown AnimGraphNode_BlendListByBool_29; // 0x16090 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_80; // 0x16130 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_79; // 0x16210 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_35; // 0x162F0 (192)
	struct Unknown AnimGraphNode_BlendListByBool_28; // 0x163B0 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_78; // 0x16450 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_77; // 0x16530 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_38; // 0x16610 (176)
	struct Unknown AnimGraphNode_BlendListByBool_27; // 0x166C0 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_76; // 0x16760 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_75; // 0x16840 (224)
	struct Unknown AnimGraphNode_BlendListByBool_26; // 0x16920 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_74; // 0x169C0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_73; // 0x16AA0 (224)
	struct Unknown AnimGraphNode_StateResult_14; // 0x16B80 (48)
	struct Unknown AnimGraphNode_BlendListByBool_25; // 0x16BB0 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_72; // 0x16C50 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_71; // 0x16D30 (224)
	struct Unknown AnimGraphNode_SequencePlayer_157; // 0x16E10 (120)
	struct Unknown AnimGraphNode_SequencePlayer_156; // 0x16E88 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_34; // 0x16F00 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_70; // 0x16FC0 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_33; // 0x170A0 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_69; // 0x17160 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_68; // 0x17240 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_37; // 0x17320 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_67; // 0x173D0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_66; // 0x174B0 (224)
	struct Unknown AnimGraphNode_StateResult_13; // 0x17590 (48)
	struct Unknown AnimGraphNode_SequencePlayer_155; // 0x175C0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_154; // 0x17638 (120)
	struct Unknown AnimGraphNode_SequencePlayer_153; // 0x176B0 (120)
	struct Unknown AnimGraphNode_ComponentToLocalSpace; // 0x17728 (32)
	struct Unknown AnimGraphNode_LocalToComponentSpace; // 0x17748 (32)
	struct Unknown AnimGraphNode_TwoBoneIK; // 0x17770 (480)
	struct Unknown AnimGraphNode_SequencePlayer_152; // 0x17950 (120)
	struct Unknown AnimGraphNode_SequencePlayer_151; // 0x179C8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_32; // 0x17A40 (192)
	struct Unknown AnimGraphNode_SequencePlayer_150; // 0x17B00 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_31; // 0x17B78 (192)
	struct Unknown AnimGraphNode_SequencePlayer_149; // 0x17C38 (120)
	struct Unknown AnimGraphNode_SequencePlayer_148; // 0x17CB0 (120)
	struct Unknown AnimGraphNode_BlendListByInt_16; // 0x17D28 (160)
	struct Unknown AnimGraphNode_SequencePlayer_147; // 0x17DC8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_146; // 0x17E40 (120)
	struct Unknown AnimGraphNode_SequencePlayer_145; // 0x17EB8 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_36; // 0x17F30 (176)
	struct Unknown AnimGraphNode_SequencePlayer_144; // 0x17FE0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_24; // 0x18058 (160)
	struct Unknown AnimGraphNode_SequencePlayer_143; // 0x180F8 (120)
	struct Unknown AnimGraphNode_BlendListByBool_23; // 0x18170 (160)
	struct Unknown AnimGraphNode_SequencePlayer_142; // 0x18210 (120)
	struct Unknown AnimGraphNode_BlendListByBool_22; // 0x18288 (160)
	struct Unknown AnimGraphNode_SequencePlayer_141; // 0x18328 (120)
	struct Unknown AnimGraphNode_BlendListByBool_21; // 0x183A0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_140; // 0x18440 (120)
	struct Unknown AnimGraphNode_SequencePlayer_139; // 0x184B8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_138; // 0x18530 (120)
	struct Unknown AnimGraphNode_SequencePlayer_137; // 0x185A8 (120)
	struct Unknown AnimGraphNode_BlendListByInt_15; // 0x18620 (160)
	struct Unknown AnimGraphNode_SequencePlayer_136; // 0x186C0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_135; // 0x18738 (120)
	struct Unknown AnimGraphNode_BlendListByInt_14; // 0x187B0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_134; // 0x18850 (120)
	struct Unknown AnimGraphNode_SequencePlayer_133; // 0x188C8 (120)
	struct Unknown AnimGraphNode_BlendListByInt_13; // 0x18940 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_35; // 0x189E0 (176)
	struct Unknown AnimGraphNode_SequencePlayer_132; // 0x18A90 (120)
	struct Unknown AnimGraphNode_SequencePlayer_131; // 0x18B08 (120)
	struct Unknown AnimGraphNode_SequencePlayer_130; // 0x18B80 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_34; // 0x18BF8 (176)
	struct Unknown AnimGraphNode_SequencePlayer_129; // 0x18CA8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_128; // 0x18D20 (120)
	struct Unknown AnimGraphNode_BlendListByBool_20; // 0x18D98 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_33; // 0x18E38 (176)
	struct Unknown AnimGraphNode_Slot_9; // 0x18EE8 (72)
	struct Unknown AnimGraphNode_SequencePlayer_127; // 0x18F30 (120)
	struct Unknown AnimGraphNode_StateResult_12; // 0x18FA8 (48)
	struct Unknown AnimGraphNode_StateMachine_4; // 0x18FD8 (176)
	struct Unknown AnimGraphNode_StateResult_11; // 0x19088 (48)
	struct Unknown AnimGraphNode_TransitionResult_20; // 0x190B8 (40)
	struct Unknown AnimGraphNode_TransitionResult_19; // 0x190E0 (40)
	struct Unknown AnimGraphNode_TransitionResult_18; // 0x19108 (40)
	struct Unknown AnimGraphNode_TransitionResult_17; // 0x19130 (40)
	struct Unknown AnimGraphNode_TransitionResult_16; // 0x19158 (40)
	struct Unknown AnimGraphNode_SequencePlayer_126; // 0x19180 (120)
	struct Unknown AnimGraphNode_BlendSpacePlayer_65; // 0x191F8 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_64; // 0x192D8 (224)
	struct Unknown AnimGraphNode_BlendListByBool_19; // 0x193B8 (160)
	struct Unknown AnimGraphNode_LayeredBoneBlend_30; // 0x19458 (192)
	struct Unknown AnimGraphNode_SequencePlayer_125; // 0x19518 (120)
	struct Unknown AnimGraphNode_SequencePlayer_124; // 0x19590 (120)
	struct Unknown AnimGraphNode_SequencePlayer_123; // 0x19608 (120)
	struct Unknown AnimGraphNode_SequencePlayer_122; // 0x19680 (120)
	struct Unknown AnimGraphNode_SequencePlayer_121; // 0x196F8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_120; // 0x19770 (120)
	struct Unknown AnimGraphNode_SequencePlayer_119; // 0x197E8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_118; // 0x19860 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_29; // 0x198D8 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_63; // 0x19998 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_62; // 0x19A78 (224)
	struct Unknown AnimGraphNode_BlendListByBool_18; // 0x19B58 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_32; // 0x19BF8 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_31; // 0x19CA8 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_28; // 0x19D58 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_30; // 0x19E18 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_61; // 0x19EC8 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_60; // 0x19FA8 (224)
	struct Unknown AnimGraphNode_BlendListByBool_17; // 0x1A088 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_59; // 0x1A128 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_58; // 0x1A208 (224)
	struct Unknown AnimGraphNode_BlendListByBool_16; // 0x1A2E8 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_29; // 0x1A388 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_57; // 0x1A438 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_56; // 0x1A518 (224)
	struct Unknown AnimGraphNode_BlendListByBool_15; // 0x1A5F8 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_55; // 0x1A698 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_54; // 0x1A778 (224)
	struct Unknown AnimGraphNode_BlendListByBool_14; // 0x1A858 (160)
	struct Unknown AnimGraphNode_StateResult_10; // 0x1A8F8 (48)
	struct Unknown AnimGraphNode_BlendSpacePlayer_53; // 0x1A928 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_52; // 0x1AA08 (224)
	struct Unknown AnimGraphNode_BlendListByBool_13; // 0x1AAE8 (160)
	struct Unknown AnimGraphNode_SequencePlayer_117; // 0x1AB88 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_27; // 0x1AC00 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_51; // 0x1ACC0 (224)
	struct Unknown AnimGraphNode_SequencePlayer_116; // 0x1ADA0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_26; // 0x1AE18 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_28; // 0x1AED8 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_50; // 0x1AF88 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_49; // 0x1B068 (224)
	struct Unknown AnimGraphNode_SequencePlayer_115; // 0x1B148 (120)
	struct Unknown AnimGraphNode_SequencePlayer_114; // 0x1B1C0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_113; // 0x1B238 (120)
	struct Unknown AnimGraphNode_SequencePlayer_112; // 0x1B2B0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_111; // 0x1B328 (120)
	struct Unknown AnimGraphNode_BlendSpacePlayer_48; // 0x1B3A0 (224)
	struct Unknown AnimGraphNode_BlendListByBool_12; // 0x1B480 (160)
	struct Unknown AnimGraphNode_SequencePlayer_110; // 0x1B520 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_25; // 0x1B598 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_47; // 0x1B658 (224)
	struct Unknown AnimGraphNode_SequencePlayer_109; // 0x1B738 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_24; // 0x1B7B0 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_27; // 0x1B870 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_46; // 0x1B920 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_45; // 0x1BA00 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_23; // 0x1BAE0 (192)
	struct Unknown AnimGraphNode_LayeredBoneBlend_22; // 0x1BBA0 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_26; // 0x1BC60 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_25; // 0x1BD10 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_24; // 0x1BDC0 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_23; // 0x1BE70 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_21; // 0x1BF20 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_44; // 0x1BFE0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_43; // 0x1C0C0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_42; // 0x1C1A0 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_22; // 0x1C280 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_41; // 0x1C330 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_21; // 0x1C410 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_40; // 0x1C4C0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_39; // 0x1C5A0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_38; // 0x1C680 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_37; // 0x1C760 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_36; // 0x1C840 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_35; // 0x1C920 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_34; // 0x1CA00 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_33; // 0x1CAE0 (224)
	struct Unknown AnimGraphNode_ApplyAdditive_7; // 0x1CBC0 (200)
	struct Unknown AnimGraphNode_ApplyAdditive_6; // 0x1CC88 (200)
	struct Unknown AnimGraphNode_BlendListByBool_11; // 0x1CD50 (160)
	struct Unknown AnimGraphNode_StateResult_9; // 0x1CDF0 (48)
	struct Unknown AnimGraphNode_Slot_8; // 0x1CE20 (72)
	struct Unknown AnimGraphNode_SequencePlayer_108; // 0x1CE68 (120)
	struct Unknown AnimGraphNode_SequencePlayer_107; // 0x1CEE0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_106; // 0x1CF58 (120)
	struct Unknown AnimGraphNode_BlendListByInt_12; // 0x1CFD0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_105; // 0x1D070 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_20; // 0x1D0E8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_104; // 0x1D1A8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_103; // 0x1D220 (120)
	struct Unknown AnimGraphNode_SequencePlayer_102; // 0x1D298 (120)
	struct Unknown AnimGraphNode_BlendListByBool_10; // 0x1D310 (160)
	struct Unknown AnimGraphNode_SequencePlayer_101; // 0x1D3B0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_100; // 0x1D428 (120)
	struct Unknown AnimGraphNode_BlendListByInt_11; // 0x1D4A0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_99; // 0x1D540 (120)
	struct Unknown AnimGraphNode_SequencePlayer_98; // 0x1D5B8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_19; // 0x1D630 (192)
	struct Unknown AnimGraphNode_SequencePlayer_97; // 0x1D6F0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_96; // 0x1D768 (120)
	struct Unknown AnimGraphNode_BlendListByInt_10; // 0x1D7E0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_95; // 0x1D880 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_18; // 0x1D8F8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_94; // 0x1D9B8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_93; // 0x1DA30 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_20; // 0x1DAA8 (176)
	struct Unknown AnimGraphNode_SequencePlayer_92; // 0x1DB58 (120)
	struct Unknown AnimGraphNode_SequencePlayer_91; // 0x1DBD0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_90; // 0x1DC48 (120)
	struct Unknown AnimGraphNode_SequencePlayer_89; // 0x1DCC0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_88; // 0x1DD38 (120)
	struct Unknown AnimGraphNode_SequencePlayer_87; // 0x1DDB0 (120)
	struct Unknown AnimGraphNode_BlendListByInt_9; // 0x1DE28 (160)
	struct Unknown AnimGraphNode_SequencePlayer_86; // 0x1DEC8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_85; // 0x1DF40 (120)
	struct Unknown AnimGraphNode_SequencePlayer_84; // 0x1DFB8 (120)
	struct Unknown AnimGraphNode_BlendListByInt_8; // 0x1E030 (160)
	struct Unknown AnimGraphNode_BlendListByInt_7; // 0x1E0D0 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_19; // 0x1E170 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_18; // 0x1E220 (176)
	struct Unknown AnimGraphNode_SequencePlayer_83; // 0x1E2D0 (120)
	struct Unknown AnimGraphNode_Slot_7; // 0x1E348 (72)
	struct Unknown AnimGraphNode_StateResult_8; // 0x1E390 (48)
	struct Unknown AnimGraphNode_StateMachine_3; // 0x1E3C0 (176)
	struct Unknown AnimGraphNode_StateResult_7; // 0x1E470 (48)
	struct Unknown AnimGraphNode_Slot_6; // 0x1E4A0 (72)
	struct Unknown AnimGraphNode_TransitionResult_15; // 0x1E4E8 (40)
	struct Unknown AnimGraphNode_TransitionResult_14; // 0x1E510 (40)
	struct Unknown AnimGraphNode_TransitionResult_13; // 0x1E538 (40)
	struct Unknown AnimGraphNode_TransitionResult_12; // 0x1E560 (40)
	struct Unknown AnimGraphNode_TransitionResult_11; // 0x1E588 (40)
	struct Unknown AnimGraphNode_TransitionResult_10; // 0x1E5B0 (40)
	struct Unknown AnimGraphNode_TransitionResult_9; // 0x1E5D8 (40)
	struct Unknown AnimGraphNode_TransitionResult_8; // 0x1E600 (40)
	struct Unknown AnimGraphNode_TransitionResult_7; // 0x1E628 (40)
	struct Unknown AnimGraphNode_TransitionResult_6; // 0x1E650 (40)
	struct Unknown AnimGraphNode_TransitionResult_5; // 0x1E678 (40)
	struct Unknown AnimGraphNode_TransitionResult_4; // 0x1E6A0 (40)
	struct Unknown AnimGraphNode_TransitionResult_3; // 0x1E6C8 (40)
	struct Unknown AnimGraphNode_TransitionResult_2; // 0x1E6F0 (40)
	struct Unknown AnimGraphNode_TransitionResult; // 0x1E718 (40)
	struct Unknown AnimGraphNode_SequencePlayer_82; // 0x1E740 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_17; // 0x1E7B8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_81; // 0x1E878 (120)
	struct Unknown AnimGraphNode_SequencePlayer_80; // 0x1E8F0 (120)
	struct Unknown AnimGraphNode_BlendListByBool_9; // 0x1E968 (160)
	struct Unknown AnimGraphNode_SequencePlayer_79; // 0x1EA08 (120)
	struct Unknown AnimGraphNode_SequencePlayer_78; // 0x1EA80 (120)
	struct Unknown AnimGraphNode_SequencePlayer_77; // 0x1EAF8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_76; // 0x1EB70 (120)
	struct Unknown AnimGraphNode_SequencePlayer_75; // 0x1EBE8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_74; // 0x1EC60 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_17; // 0x1ECD8 (176)
	struct Unknown AnimGraphNode_StateResult_6; // 0x1ED88 (48)
	struct Unknown AnimGraphNode_SequencePlayer_73; // 0x1EDB8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_72; // 0x1EE30 (120)
	struct Unknown AnimGraphNode_SequencePlayer_71; // 0x1EEA8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_70; // 0x1EF20 (120)
	struct Unknown AnimGraphNode_SequencePlayer_69; // 0x1EF98 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_16; // 0x1F010 (176)
	struct Unknown AnimGraphNode_StateResult_5; // 0x1F0C0 (48)
	struct Unknown AnimGraphNode_SequencePlayer_68; // 0x1F0F0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_16; // 0x1F168 (192)
	struct Unknown AnimGraphNode_BlendListByBool_8; // 0x1F228 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_32; // 0x1F2C8 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_31; // 0x1F3A8 (224)
	struct Unknown AnimGraphNode_SequencePlayer_67; // 0x1F488 (120)
	struct Unknown AnimGraphNode_SequencePlayer_66; // 0x1F500 (120)
	struct Unknown AnimGraphNode_SequencePlayer_65; // 0x1F578 (120)
	struct Unknown AnimGraphNode_SequencePlayer_64; // 0x1F5F0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_63; // 0x1F668 (120)
	struct Unknown AnimGraphNode_SequencePlayer_62; // 0x1F6E0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_61; // 0x1F758 (120)
	struct Unknown AnimGraphNode_SequencePlayer_60; // 0x1F7D0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_15; // 0x1F848 (192)
	struct Unknown AnimGraphNode_BlendListByBool_7; // 0x1F908 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_30; // 0x1F9A8 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_29; // 0x1FA88 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_15; // 0x1FB68 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_14; // 0x1FC18 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_13; // 0x1FCC8 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_14; // 0x1FD78 (192)
	struct Unknown AnimGraphNode_BlendListByBool_6; // 0x1FE38 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_28; // 0x1FED8 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_27; // 0x1FFB8 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_12; // 0x20098 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_26; // 0x20148 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_25; // 0x20228 (224)
	struct Unknown AnimGraphNode_BlendListByBool_5; // 0x20308 (160)
	struct Unknown AnimGraphNode_BlendListByBool_4; // 0x203A8 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_24; // 0x20448 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_23; // 0x20528 (224)
	struct Unknown AnimGraphNode_BlendListByBool_3; // 0x20608 (160)
	struct Unknown AnimGraphNode_BlendSpacePlayer_22; // 0x206A8 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_21; // 0x20788 (224)
	struct Unknown AnimGraphNode_StateResult_4; // 0x20868 (48)
	struct Unknown AnimGraphNode_SequencePlayer_59; // 0x20898 (120)
	struct Unknown AnimGraphNode_SequencePlayer_58; // 0x20910 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_10; // 0x20988 (200)
	struct Unknown AnimGraphNode_LayeredBoneBlend_13; // 0x20A50 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_20; // 0x20B10 (224)
	struct Unknown AnimGraphNode_SequencePlayer_57; // 0x20BF0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_12; // 0x20C68 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_19; // 0x20D28 (224)
	struct Unknown AnimGraphNode_SequencePlayer_56; // 0x20E08 (120)
	struct Unknown AnimGraphNode_SequencePlayer_55; // 0x20E80 (120)
	struct Unknown AnimGraphNode_SequencePlayer_54; // 0x20EF8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_53; // 0x20F70 (120)
	struct Unknown AnimGraphNode_SequencePlayer_52; // 0x20FE8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_51; // 0x21060 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_9; // 0x210D8 (200)
	struct Unknown AnimGraphNode_SequencePlayer_50; // 0x211A0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_11; // 0x21218 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_18; // 0x212D8 (224)
	struct Unknown AnimGraphNode_SequencePlayer_49; // 0x213B8 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_10; // 0x21430 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_17; // 0x214F0 (224)
	struct Unknown AnimGraphNode_BlendListByBool_2; // 0x215D0 (160)
	struct Unknown AnimGraphNode_SequencePlayer_48; // 0x21670 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_8; // 0x216E8 (200)
	struct Unknown AnimGraphNode_BlendSpacePlayer_16; // 0x217B0 (224)
	struct Unknown AnimGraphNode_SequencePlayer_47; // 0x21890 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_7; // 0x21908 (200)
	struct Unknown AnimGraphNode_BlendSpacePlayer_15; // 0x219D0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_14; // 0x21AB0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_13; // 0x21B90 (224)
	struct Unknown AnimGraphNode_ApplyAdditive_5; // 0x21C70 (200)
	struct Unknown AnimGraphNode_ApplyAdditive_4; // 0x21D38 (200)
	struct Unknown AnimGraphNode_BlendListByEnum_11; // 0x21E00 (176)
	struct Unknown AnimGraphNode_IdentityPose; // 0x21EB0 (24)
	struct Unknown AnimGraphNode_ApplyAdditive_3; // 0x21EC8 (200)
	struct Unknown AnimGraphNode_SequencePlayer_46; // 0x21F90 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_6; // 0x22008 (200)
	struct Unknown AnimGraphNode_SequencePlayer_45; // 0x220D0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_44; // 0x22148 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_5; // 0x221C0 (200)
	struct Unknown AnimGraphNode_SequencePlayer_43; // 0x22288 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_4; // 0x22300 (200)
	struct Unknown AnimGraphNode_SequencePlayer_42; // 0x223C8 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_3; // 0x22440 (200)
	struct Unknown AnimGraphNode_SequencePlayer_41; // 0x22508 (120)
	struct Unknown AnimGraphNode_TwoWayBlend_2; // 0x22580 (200)
	struct Unknown AnimGraphNode_SequencePlayer_40; // 0x22648 (120)
	struct Unknown AnimGraphNode_TwoWayBlend; // 0x226C0 (200)
	struct Unknown AnimGraphNode_BlendListByEnum_10; // 0x22788 (176)
	struct Unknown AnimGraphNode_SequencePlayer_39; // 0x22838 (120)
	struct Unknown AnimGraphNode_BlendSpacePlayer_12; // 0x228B0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_11; // 0x22990 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_9; // 0x22A70 (192)
	struct Unknown AnimGraphNode_BlendListByEnum_9; // 0x22B30 (176)
	struct Unknown AnimGraphNode_LayeredBoneBlend_8; // 0x22BE0 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_10; // 0x22CA0 (224)
	struct Unknown AnimGraphNode_LayeredBoneBlend_7; // 0x22D80 (192)
	struct Unknown AnimGraphNode_BlendSpacePlayer_9; // 0x22E40 (224)
	struct Unknown AnimGraphNode_BlendListByEnum_8; // 0x22F20 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_7; // 0x22FD0 (176)
	struct Unknown AnimGraphNode_BlendSpacePlayer_8; // 0x23080 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_7; // 0x23160 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_6; // 0x23240 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_5; // 0x23320 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_4; // 0x23400 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_3; // 0x234E0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer_2; // 0x235C0 (224)
	struct Unknown AnimGraphNode_BlendSpacePlayer; // 0x236A0 (224)
	struct Unknown AnimGraphNode_ApplyAdditive_2; // 0x23780 (200)
	struct Unknown AnimGraphNode_ApplyAdditive; // 0x23848 (200)
	struct Unknown AnimGraphNode_BlendListByBool; // 0x23910 (160)
	struct Unknown AnimGraphNode_StateResult_3; // 0x239B0 (48)
	struct Unknown AnimGraphNode_SequencePlayer_38; // 0x239E0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_37; // 0x23A58 (120)
	struct Unknown AnimGraphNode_SequencePlayer_36; // 0x23AD0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_35; // 0x23B48 (120)
	struct Unknown AnimGraphNode_SequencePlayer_34; // 0x23BC0 (120)
	struct Unknown AnimGraphNode_BlendListByInt_6; // 0x23C38 (160)
	struct Unknown AnimGraphNode_LayeredBoneBlend_6; // 0x23CD8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_33; // 0x23D98 (120)
	struct Unknown AnimGraphNode_SequencePlayer_32; // 0x23E10 (120)
	struct Unknown AnimGraphNode_SequencePlayer_31; // 0x23E88 (120)
	struct Unknown AnimGraphNode_SequencePlayer_30; // 0x23F00 (120)
	struct Unknown AnimGraphNode_SequencePlayer_29; // 0x23F78 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_5; // 0x23FF0 (192)
	struct Unknown AnimGraphNode_SequencePlayer_28; // 0x240B0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_27; // 0x24128 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_4; // 0x241A0 (192)
	struct Unknown AnimGraphNode_SequencePlayer_26; // 0x24260 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend_3; // 0x242D8 (192)
	struct Unknown AnimGraphNode_SequencePlayer_25; // 0x24398 (120)
	struct Unknown AnimGraphNode_SequencePlayer_24; // 0x24410 (120)
	struct Unknown AnimGraphNode_SequencePlayer_23; // 0x24488 (120)
	struct Unknown AnimGraphNode_SequencePlayer_22; // 0x24500 (120)
	struct Unknown AnimGraphNode_SequencePlayer_21; // 0x24578 (120)
	struct Unknown AnimGraphNode_BlendListByInt_5; // 0x245F0 (160)
	struct Unknown AnimGraphNode_LayeredBoneBlend_2; // 0x24690 (192)
	struct Unknown AnimGraphNode_SequencePlayer_20; // 0x24750 (120)
	struct Unknown AnimGraphNode_SequencePlayer_19; // 0x247C8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_18; // 0x24840 (120)
	struct Unknown AnimGraphNode_SequencePlayer_17; // 0x248B8 (120)
	struct Unknown AnimGraphNode_BlendListByInt_4; // 0x24930 (160)
	struct Unknown AnimGraphNode_SequencePlayer_16; // 0x249D0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_15; // 0x24A48 (120)
	struct Unknown AnimGraphNode_SequencePlayer_14; // 0x24AC0 (120)
	struct Unknown AnimGraphNode_LayeredBoneBlend; // 0x24B38 (192)
	struct Unknown AnimGraphNode_SequencePlayer_13; // 0x24BF8 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_6; // 0x24C70 (176)
	struct Unknown AnimGraphNode_SequencePlayer_12; // 0x24D20 (120)
	struct Unknown AnimGraphNode_BlendListByEnum_5; // 0x24D98 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_4; // 0x24E48 (176)
	struct Unknown AnimGraphNode_SequencePlayer_11; // 0x24EF8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_10; // 0x24F70 (120)
	struct Unknown AnimGraphNode_SequencePlayer_9; // 0x24FE8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_8; // 0x25060 (120)
	struct Unknown AnimGraphNode_SequencePlayer_7; // 0x250D8 (120)
	struct Unknown AnimGraphNode_BlendListByInt_3; // 0x25150 (160)
	struct Unknown AnimGraphNode_SequencePlayer_6; // 0x251F0 (120)
	struct Unknown AnimGraphNode_SequencePlayer_5; // 0x25268 (120)
	struct Unknown AnimGraphNode_SequencePlayer_4; // 0x252E0 (120)
	struct Unknown AnimGraphNode_BlendListByInt_2; // 0x25358 (160)
	struct Unknown AnimGraphNode_SequencePlayer_3; // 0x253F8 (120)
	struct Unknown AnimGraphNode_SequencePlayer_2; // 0x25470 (120)
	struct Unknown AnimGraphNode_SequencePlayer; // 0x254E8 (120)
	struct Unknown AnimGraphNode_BlendListByInt; // 0x25560 (160)
	struct Unknown AnimGraphNode_BlendListByEnum_3; // 0x25600 (176)
	struct Unknown AnimGraphNode_BlendListByEnum_2; // 0x256B0 (176)
	struct Unknown AnimGraphNode_Slot_5; // 0x25760 (72)
	struct Unknown AnimGraphNode_StateResult_2; // 0x257A8 (48)
	struct Unknown AnimGraphNode_StateMachine_2; // 0x257D8 (176)
	struct Unknown AnimGraphNode_StateResult; // 0x25888 (48)
	struct Unknown AnimGraphNode_StateMachine; // 0x258B8 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_12; // 0x25968 (184)
	struct Unknown AnimGraphNode_SaveCachedPose_11; // 0x25A20 (184)
	struct Unknown AnimGraphNode_UseCachedPose_23; // 0x25AD8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_22; // 0x25B00 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_10; // 0x25B28 (184)
	struct Unknown AnimGraphNode_UseCachedPose_21; // 0x25BE0 (40)
	struct Unknown AnimGraphNode_UseCachedPose_20; // 0x25C08 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_9; // 0x25C30 (184)
	struct Unknown AnimGraphNode_UseCachedPose_19; // 0x25CE8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_18; // 0x25D10 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_8; // 0x25D38 (184)
	struct Unknown AnimGraphNode_UseCachedPose_17; // 0x25DF0 (40)
	struct Unknown AnimGraphNode_UseCachedPose_16; // 0x25E18 (40)
	struct Unknown AnimGraphNode_UseCachedPose_15; // 0x25E40 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_7; // 0x25E68 (184)
	struct Unknown AnimGraphNode_SaveCachedPose_6; // 0x25F20 (184)
	struct Unknown AnimGraphNode_UseCachedPose_14; // 0x25FD8 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_5; // 0x26000 (184)
	struct Unknown AnimGraphNode_UseCachedPose_13; // 0x260B8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_12; // 0x260E0 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_4; // 0x26108 (184)
	struct Unknown AnimGraphNode_UseCachedPose_11; // 0x261C0 (40)
	struct Unknown AnimGraphNode_UseCachedPose_10; // 0x261E8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_9; // 0x26210 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_3; // 0x26238 (184)
	struct Unknown AnimGraphNode_UseCachedPose_8; // 0x262F0 (40)
	struct Unknown AnimGraphNode_UseCachedPose_7; // 0x26318 (40)
	struct Unknown AnimGraphNode_SaveCachedPose_2; // 0x26340 (184)
	struct Unknown AnimGraphNode_UseCachedPose_6; // 0x263F8 (40)
	struct Unknown AnimGraphNode_UseCachedPose_5; // 0x26420 (40)
	struct Unknown AnimGraphNode_Slot_4; // 0x26448 (72)
	struct Unknown AnimGraphNode_SaveCachedPose; // 0x26490 (184)
	struct Unknown AnimGraphNode_UseCachedPose_4; // 0x26548 (40)
	struct Unknown AnimGraphNode_UseCachedPose_3; // 0x26570 (40)
	struct Unknown AnimGraphNode_Slot_3; // 0x26598 (72)
	struct Unknown AnimGraphNode_Slot_2; // 0x265E0 (72)
	struct Unknown AnimGraphNode_BlendListByEnum; // 0x26628 (176)
	struct Unknown AnimGraphNode_UseCachedPose_2; // 0x266D8 (40)
	struct Unknown AnimGraphNode_UseCachedPose; // 0x26700 (40)
	struct Unknown AnimGraphNode_Slot; // 0x26728 (72)
	struct Unknown StoppingAnimation; // 0x26770 (8)
	struct FName AdditiveLandingSlot; // 0x26778 (8)
	float StoppingDirection; // 0x26780 (4)
	struct Unknown CameraLagTimer; // 0x26788 (8)
	struct Unknown SavedCameraArmLocation; // 0x26790 (12)
	char TestSprinting : 0; // 0x2679C (1)

	void AnimGraph(struct Unknown& AnimGraph); // Function ABP-DefaultMan_Native.ABP-DefaultMan_Native_C.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void ChooseStoppingAnim(struct Unknown& StoppingAnim); // Function ABP-DefaultMan_Native.ABP-DefaultMan_Native_C.ChooseStoppingAnim(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game_BE.exe+0x2B80160>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-DefaultMan_Native_AnimGraphNode_TransitionResult_C088F08849AABF77B6110C8A6B219118(); // Function ABP-DefaultMan_Native.ABP-DefaultMan_Native_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP-DefaultMan_Native_AnimGraphNode_TransitionResult_C088F08849AABF77B6110C8A6B219118(BlueprintEvent) // <Game_BE.exe+0x2B80160>
