// AnimBlueprintGeneratedClass ABP_Camaro.ABP_Camaro_C
struct UABP_Camaro_C : UBravoHotelVehicleAnimInstance {
	struct Unknown UberGraphFrame; // 0xA20 (8)
	struct Unknown AnimGraphNode_CopyBone_12; // 0xA28 (240)
	struct Unknown AnimGraphNode_LookAt_6; // 0xB20 (432)
	struct Unknown AnimGraphNode_CopyBone_11; // 0xCD0 (240)
	struct Unknown AnimGraphNode_LookAt_5; // 0xDC0 (432)
	struct Unknown AnimGraphNode_CopyBone_10; // 0xF70 (240)
	struct Unknown AnimGraphNode_LookAt_4; // 0x1060 (432)
	struct Unknown AnimGraphNode_CopyBone_9; // 0x1210 (240)
	struct Unknown AnimGraphNode_LookAt_3; // 0x1300 (432)
	struct Unknown AnimGraphNode_CopyBone_8; // 0x14B0 (240)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_3; // 0x15A0 (32)
	struct Unknown AnimGraphNode_CopyBone_7; // 0x15C0 (240)
	struct Unknown AnimGraphNode_MeshRefPose_2; // 0x16B0 (16)
	struct Unknown AnimGraphNode_BlendListByBool_2; // 0x16C0 (160)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_2; // 0x1760 (32)
	struct Unknown AnimGraphNode_CopyBone_6; // 0x1780 (240)
	struct Unknown AnimGraphNode_WheelHandler; // 0x1870 (224)
	struct Unknown AnimGraphNode_CopyBone_5; // 0x1950 (240)
	struct Unknown AnimGraphNode_Root; // 0x1A40 (48)
	struct Unknown AnimGraphNode_CopyBone_4; // 0x1A70 (240)
	struct Unknown AnimGraphNode_CopyBone_3; // 0x1B60 (240)
	struct Unknown AnimGraphNode_CopyBone_2; // 0x1C50 (240)
	struct Unknown AnimGraphNode_CopyBone; // 0x1D40 (240)
	struct Unknown AnimGraphNode_RotationMultiplier_2; // 0x1E30 (240)
	struct Unknown AnimGraphNode_LookAt_2; // 0x1F20 (432)
	struct Unknown AnimGraphNode_RotationMultiplier; // 0x20D0 (240)
	struct Unknown AnimGraphNode_LookAt; // 0x21C0 (432)
	struct Unknown AnimGraphNode_TransitionResult_12; // 0x2370 (40)
	struct Unknown AnimGraphNode_TransitionResult_11; // 0x2398 (40)
	struct Unknown AnimGraphNode_TransitionResult_10; // 0x23C0 (40)
	struct Unknown AnimGraphNode_TransitionResult_9; // 0x23E8 (40)
	struct Unknown AnimGraphNode_TransitionResult_8; // 0x2410 (40)
	struct Unknown AnimGraphNode_TransitionResult_7; // 0x2438 (40)
	struct Unknown AnimGraphNode_SequencePlayer_6; // 0x2460 (120)
	struct Unknown AnimGraphNode_StateResult_6; // 0x24D8 (48)
	struct Unknown AnimGraphNode_SequencePlayer_5; // 0x2508 (120)
	struct Unknown AnimGraphNode_StateResult_5; // 0x2580 (48)
	struct Unknown AnimGraphNode_SequencePlayer_4; // 0x25B0 (120)
	struct Unknown AnimGraphNode_StateResult_4; // 0x2628 (48)
	struct Unknown AnimGraphNode_StateMachine_2; // 0x2658 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_2; // 0x2708 (184)
	struct Unknown AnimGraphNode_TransitionResult_6; // 0x27C0 (40)
	struct Unknown AnimGraphNode_TransitionResult_5; // 0x27E8 (40)
	struct Unknown AnimGraphNode_TransitionResult_4; // 0x2810 (40)
	struct Unknown AnimGraphNode_TransitionResult_3; // 0x2838 (40)
	struct Unknown AnimGraphNode_TransitionResult_2; // 0x2860 (40)
	struct Unknown AnimGraphNode_TransitionResult; // 0x2888 (40)
	struct Unknown AnimGraphNode_SequencePlayer_3; // 0x28B0 (120)
	struct Unknown AnimGraphNode_StateResult_3; // 0x2928 (48)
	struct Unknown AnimGraphNode_SequencePlayer_2; // 0x2958 (120)
	struct Unknown AnimGraphNode_StateResult_2; // 0x29D0 (48)
	struct Unknown AnimGraphNode_SequencePlayer; // 0x2A00 (120)
	struct Unknown AnimGraphNode_StateResult; // 0x2A78 (48)
	struct Unknown AnimGraphNode_StateMachine; // 0x2AA8 (176)
	struct Unknown AnimGraphNode_SaveCachedPose; // 0x2B58 (184)
	struct Unknown AnimGraphNode_LayeredBoneBlend_2; // 0x2C10 (192)
	struct Unknown AnimGraphNode_UseCachedPose_4; // 0x2CD0 (40)
	struct Unknown AnimGraphNode_BlendListByBool; // 0x2CF8 (160)
	struct Unknown AnimGraphNode_TwoWayBlend; // 0x2D98 (200)
	struct Unknown AnimGraphNode_UseCachedPose_3; // 0x2E60 (40)
	struct Unknown AnimGraphNode_UseCachedPose_2; // 0x2E88 (40)
	struct Unknown AnimGraphNode_UseCachedPose; // 0x2EB0 (40)
	struct Unknown AnimGraphNode_MeshRefPose; // 0x2ED8 (16)
	struct Unknown AnimGraphNode_LayeredBoneBlend; // 0x2EE8 (192)
	struct Unknown AnimGraphNode_ComponentToLocalSpace; // 0x2FA8 (32)
	struct Unknown AnimGraphNode_LocalToComponentSpace; // 0x2FC8 (32)

	void AnimGraph(struct Unknown& AnimGraph); // Function ABP_Camaro.ABP_Camaro_C.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_B676CFA34CE7A52EF43EC0AB21A88407(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_B676CFA34CE7A52EF43EC0AB21A88407(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_ECCAF0444D5429883EF85DBFE6C87835(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_ECCAF0444D5429883EF85DBFE6C87835(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_8148B76C4329BC2F8A8243B4DC2EA5D6(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_8148B76C4329BC2F8A8243B4DC2EA5D6(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_D3A6CEB64500CBDDAC6731982AA2B8CB(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_D3A6CEB64500CBDDAC6731982AA2B8CB(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_631723E04832D92DC95F69A67AD9A02F(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_631723E04832D92DC95F69A67AD9A02F(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_4F07996042D4157DCD054DAA17CBAFC0(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_4F07996042D4157DCD054DAA17CBAFC0(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_09EF52904BA5FF006178DFBECCF4C9F1(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_09EF52904BA5FF006178DFBECCF4C9F1(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_4FA9353648610A2F305F4285607D767D(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_4FA9353648610A2F305F4285607D767D(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_6DFFB4074DD63F36D8B6A29A65886B11(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_6DFFB4074DD63F36D8B6A29A65886B11(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_991E42824386AA192671B1B4DC05B089(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_991E42824386AA192671B1B4DC05B089(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_C073E4914C688292A9D5FFAEB8F80989(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_C073E4914C688292A9D5FFAEB8F80989(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_6568699844C457EB1BC6FDB6052E5CB8(); // Function ABP_Camaro.ABP_Camaro_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camaro_AnimGraphNode_TransitionResult_6568699844C457EB1BC6FDB6052E5CB8(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_Camaro.ABP_Camaro_C.BlueprintUpdateAnimation(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void AnimNotify_FPP_Entered_Idle(); // Function ABP_Camaro.ABP_Camaro_C.AnimNotify_FPP_Entered_Idle(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void AnimNotify_FPP_Left_Idle(); // Function ABP_Camaro.ABP_Camaro_C.AnimNotify_FPP_Left_Idle(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ExecuteUbergraph_ABP_Camaro(int32_t EntryPoint); // Function ABP_Camaro.ABP_Camaro_C.ExecuteUbergraph_ABP_Camaro(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

