// AnimBlueprintGeneratedClass ABP_PlatedJeep.ABP_PlatedJeep_C
struct UABP_PlatedJeep_C : UBravoHotelVehicleAnimInstance {
	struct Unknown UberGraphFrame; //  0xa20 Size(8)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_3; //  0xa28 Size(20)
	struct Unknown AnimGraphNode_CopyBone_16; //  0xa48 Size(f0)
	struct Unknown AnimGraphNode_LookAt_2; //  0xb40 Size(1b0)
	struct Unknown AnimGraphNode_CopyBone_15; //  0xcf0 Size(f0)
	struct Unknown AnimGraphNode_MeshRefPose_2; //  0xde0 Size(10)
	struct Unknown AnimGraphNode_CopyBone_14; //  0xdf0 Size(f0)
	struct Unknown AnimGraphNode_LookAt; //  0xee0 Size(1b0)
	struct Unknown AnimGraphNode_CopyBone_13; //  0x1090 Size(f0)
	struct Unknown AnimGraphNode_BlendListByBool_2; //  0x1180 Size(a0)
	struct Unknown AnimGraphNode_CopyBone_12; //  0x1220 Size(f0)
	struct Unknown AnimGraphNode_CopyBone_11; //  0x1310 Size(f0)
	struct Unknown AnimGraphNode_CopyBone_10; //  0x1400 Size(f0)
	struct Unknown AnimGraphNode_CopyBone_9; //  0x14f0 Size(f0)
	struct Unknown AnimGraphNode_CopyBone_8; //  0x15e0 Size(f0)
	struct Unknown AnimGraphNode_CopyBone_7; //  0x16d0 Size(f0)
	struct Unknown AnimGraphNode_CopyBone_6; //  0x17c0 Size(f0)
	struct Unknown AnimGraphNode_CopyBone_5; //  0x18b0 Size(f0)
	struct Unknown AnimGraphNode_CopyBone_4; //  0x19a0 Size(f0)
	struct Unknown AnimGraphNode_CopyBone_3; //  0x1a90 Size(f0)
	struct Unknown AnimGraphNode_CopyBone_2; //  0x1b80 Size(f0)
	struct Unknown AnimGraphNode_CopyBone; //  0x1c70 Size(f0)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_2; //  0x1d60 Size(20)
	struct Unknown AnimGraphNode_Root; //  0x1d80 Size(30)
	struct Unknown AnimGraphNode_TransitionRes_12; //  0x1db0 Size(28)
	struct Unknown AnimGraphNode_TransitionRes_11; //  0x1dd8 Size(28)
	struct Unknown AnimGraphNode_TransitionResult_10; //  0x1e00 Size(28)
	struct Unknown AnimGraphNode_TransitionRes_9; //  0x1e28 Size(28)
	struct Unknown AnimGraphNode_TransitionRes_8; //  0x1e50 Size(28)
	struct Unknown AnimGraphNode_TransitionResult_7; //  0x1e78 Size(28)
	struct Unknown AnimGraphNode_SequencePlayer_6; //  0x1ea0 Size(78)
	struct Unknown AnimGraphNode_StateResult_6; //  0x1f18 Size(30)
	struct Unknown AnimGraphNode_SequencePlayer_5; //  0x1f48 Size(78)
	struct Unknown AnimGraphNode_StateResult_5; //  0x1fc0 Size(30)
	struct Unknown AnimGraphNode_SequencePlayer_4; //  0x1ff0 Size(78)
	struct Unknown AnimGraphNode_StateResult_4; //  0x2068 Size(30)
	struct Unknown AnimGraphNode_StateMachine_2; //  0x2098 Size(b0)
	struct Unknown AnimGraphNode_SaveCachedPosr_2; //  0x2148 Size(b8)
	struct Unknown AnimGraphNode_LocalToComponentSpace; //  0x2200 Size(20)
	struct Unknown AnimGraphNode_TransitionRes_6; //  0x2220 Size(28)
	struct Unknown AnimGraphNode_TransitionRes_5; //  0x2248 Size(28)
	struct Unknown AnimGraphNode_TransitionRes_4; //  0x2270 Size(28)
	struct Unknown AnimGraphNode_TransitionRes_3; //  0x2298 Size(28)
	struct Unknown AnimGraphNode_TransitionRes_2; //  0x22c0 Size(28)
	struct Unknown AnimGraphNode_TransitionRes; //  0x22e8 Size(28)
	struct Unknown AnimGraphNode_SequencePlayer_3; //  0x2310 Size(78)
	struct Unknown AnimGraphNode_StateResult_3; //  0x2388 Size(30)
	struct Unknown AnimGraphNode_SequencePlayer_2; //  0x23b8 Size(78)
	struct Unknown AnimGraphNode_StateResult_2; //  0x2430 Size(30)
	struct Unknown AnimGraphNode_SequencePlayer; //  0x2460 Size(78)
	struct Unknown AnimGraphNode_StateResult; //  0x24d8 Size(30)
	struct Unknown AnimGraphNode_StateMachine; //  0x2508 Size(b0)
	struct Unknown AnimGraphNode_SaveCachedPosr; //  0x25b8 Size(b8)
	struct Unknown AnimGraphNode_LayeredBoneBlend_2; //  0x2670 Size(c0)
	struct Unknown AnimGraphNode_UseCachedPose_4; //  0x2730 Size(28)
	struct Unknown AnimGraphNode_BlendListByBool; //  0x2758 Size(a0)
	struct Unknown AnimGraphNode_TwoWayBlend; //  0x27f8 Size(c8)
	struct Unknown AnimGraphNode_UseCachedPose_3; //  0x28c0 Size(28)
	struct Unknown AnimGraphNode_UseCachedPose_2; //  0x28e8 Size(28)
	struct Unknown AnimGraphNode_UseCachedPose; //  0x2910 Size(28)
	struct Unknown AnimGraphNode_WheelHandler; //  0x2938 Size(e0)
	struct Unknown AnimGraphNode_MeshRefPose; //  0x2a18 Size(10)
	struct Unknown AnimGraphNode_ComponentToLocalSpace; //  0x2a28 Size(20)
	struct Unknown AnimGraphNode_LayeredBoneBlend; //  0x2a48 Size(c0)

	void AnimGraph(struct Unknown& AnimGraph); // Function ABP_PlatedJeep.ABP_PlatedJeep_C.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

