// AnimBlueprintGeneratedClass ABP_PlatedJeep.ABP_PlatedJeep_C
class UABP_PlatedJeep_C : UBravoHotelVehicleAnimInstance {
	struct Unknown UberGraphFrame; // 0xA20 (8)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_3; // 0xA28 (32)
	struct Unknown AnimGraphNode_CopyBone_16; // 0xA48 (240)
	struct Unknown AnimGraphNode_LookAt_2; // 0xB40 (432)
	struct Unknown AnimGraphNode_CopyBone_15; // 0xCF0 (240)
	struct Unknown AnimGraphNode_MeshRefPose_2; // 0xDE0 (16)
	struct Unknown AnimGraphNode_CopyBone_14; // 0xDF0 (240)
	struct Unknown AnimGraphNode_LookAt; // 0xEE0 (432)
	struct Unknown AnimGraphNode_CopyBone_13; // 0x1090 (240)
	struct Unknown AnimGraphNode_BlendListByBool_2; // 0x1180 (160)
	struct Unknown AnimGraphNode_CopyBone_12; // 0x1220 (240)
	struct Unknown AnimGraphNode_CopyBone_11; // 0x1310 (240)
	struct Unknown AnimGraphNode_CopyBone_10; // 0x1400 (240)
	struct Unknown AnimGraphNode_CopyBone_9; // 0x14F0 (240)
	struct Unknown AnimGraphNode_CopyBone_8; // 0x15E0 (240)
	struct Unknown AnimGraphNode_CopyBone_7; // 0x16D0 (240)
	struct Unknown AnimGraphNode_CopyBone_6; // 0x17C0 (240)
	struct Unknown AnimGraphNode_CopyBone_5; // 0x18B0 (240)
	struct Unknown AnimGraphNode_CopyBone_4; // 0x19A0 (240)
	struct Unknown AnimGraphNode_CopyBone_3; // 0x1A90 (240)
	struct Unknown AnimGraphNode_CopyBone_2; // 0x1B80 (240)
	struct Unknown AnimGraphNode_CopyBone; // 0x1C70 (240)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_2; // 0x1D60 (32)
	struct Unknown AnimGraphNode_Root; // 0x1D80 (48)
	struct Unknown AnimGraphNode_TransitionResult_12; // 0x1DB0 (40)
	struct Unknown AnimGraphNode_TransitionResult_11; // 0x1DD8 (40)
	struct Unknown AnimGraphNode_TransitionResult_10; // 0x1E00 (40)
	struct Unknown AnimGraphNode_TransitionResult_9; // 0x1E28 (40)
	struct Unknown AnimGraphNode_TransitionResult_8; // 0x1E50 (40)
	struct Unknown AnimGraphNode_TransitionResult_7; // 0x1E78 (40)
	struct Unknown AnimGraphNode_SequencePlayer_6; // 0x1EA0 (120)
	struct Unknown AnimGraphNode_StateResult_6; // 0x1F18 (48)
	struct Unknown AnimGraphNode_SequencePlayer_5; // 0x1F48 (120)
	struct Unknown AnimGraphNode_StateResult_5; // 0x1FC0 (48)
	struct Unknown AnimGraphNode_SequencePlayer_4; // 0x1FF0 (120)
	struct Unknown AnimGraphNode_StateResult_4; // 0x2068 (48)
	struct Unknown AnimGraphNode_StateMachine_2; // 0x2098 (176)
	struct Unknown AnimGraphNode_SaveCachedPose_2; // 0x2148 (184)
	struct Unknown AnimGraphNode_LocalToComponentSpace; // 0x2200 (32)
	struct Unknown AnimGraphNode_TransitionResult_6; // 0x2220 (40)
	struct Unknown AnimGraphNode_TransitionResult_5; // 0x2248 (40)
	struct Unknown AnimGraphNode_TransitionResult_4; // 0x2270 (40)
	struct Unknown AnimGraphNode_TransitionResult_3; // 0x2298 (40)
	struct Unknown AnimGraphNode_TransitionResult_2; // 0x22C0 (40)
	struct Unknown AnimGraphNode_TransitionResult; // 0x22E8 (40)
	struct Unknown AnimGraphNode_SequencePlayer_3; // 0x2310 (120)
	struct Unknown AnimGraphNode_StateResult_3; // 0x2388 (48)
	struct Unknown AnimGraphNode_SequencePlayer_2; // 0x23B8 (120)
	struct Unknown AnimGraphNode_StateResult_2; // 0x2430 (48)
	struct Unknown AnimGraphNode_SequencePlayer; // 0x2460 (120)
	struct Unknown AnimGraphNode_StateResult; // 0x24D8 (48)
	struct Unknown AnimGraphNode_StateMachine; // 0x2508 (176)
	struct Unknown AnimGraphNode_SaveCachedPose; // 0x25B8 (184)
	struct Unknown AnimGraphNode_LayeredBoneBlend_2; // 0x2670 (192)
	struct Unknown AnimGraphNode_UseCachedPose_4; // 0x2730 (40)
	struct Unknown AnimGraphNode_BlendListByBool; // 0x2758 (160)
	struct Unknown AnimGraphNode_TwoWayBlend; // 0x27F8 (200)
	struct Unknown AnimGraphNode_UseCachedPose_3; // 0x28C0 (40)
	struct Unknown AnimGraphNode_UseCachedPose_2; // 0x28E8 (40)
	struct Unknown AnimGraphNode_UseCachedPose; // 0x2910 (40)
	struct Unknown AnimGraphNode_WheelHandler; // 0x2938 (224)
	struct Unknown AnimGraphNode_MeshRefPose; // 0x2A18 (16)
	struct Unknown AnimGraphNode_ComponentToLocalSpace; // 0x2A28 (32)
	struct Unknown AnimGraphNode_LayeredBoneBlend; // 0x2A48 (192)

	void AnimGraph(struct Unknown& AnimGraph); // Function ABP_PlatedJeep.ABP_PlatedJeep_C.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_Exec(); // Function ABP_PlatedJeep.ABP_PlatedJeep_C.EvaluateGraphExposedInputs_Exec(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_Exec(); // Function ABP_PlatedJeep.ABP_PlatedJeep_C.EvaluateGraphExposedInputs_Exec(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_Exec(); // Function ABP_PlatedJeep.ABP_PlatedJeep_C.EvaluateGraphExposedInputs_Exec(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_Exec(); // Function ABP_PlatedJeep.ABP_PlatedJeep_C.EvaluateGraphExposedInputs_Exec(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_Exec(); // Function ABP_PlatedJeep.ABP_PlatedJeep_C.EvaluateGraphExposedInputs_Exec(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_Exec(); // Function ABP_PlatedJeep.ABP_PlatedJeep_C.EvaluateGraphExposedInputs_Exec(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_Exec(); // Function ABP_PlatedJeep.ABP_PlatedJeep_C.EvaluateGraphExposedInputs_Exec(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_Exec(); // Function ABP_PlatedJeep.ABP_PlatedJeep_C.EvaluateGraphExposedInputs_Exec(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_Exec(); // Function ABP_PlatedJeep.ABP_PlatedJeep_C.EvaluateGraphExposedInputs_Exec(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_Exec(); // Function ABP_PlatedJeep.ABP_PlatedJeep_C.EvaluateGraphExposedInputs_Exec(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_Exec(); // Function ABP_PlatedJeep.ABP_PlatedJeep_C.EvaluateGraphExposedInputs_Exec(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EvaluateGraphExposedInputs_Exec(); // Function ABP_PlatedJeep.ABP_PlatedJeep_C.EvaluateGraphExposedInputs_Exec(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_PlatedJeep.ABP_PlatedJeep_C.BlueprintUpdateAnimation(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void AnimNotify_FPP_Entered_Idle(); // Function ABP_PlatedJeep.ABP_PlatedJeep_C.AnimNotify_FPP_Entered_Idle(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void AnimNotify_FPP_Left_Idle(); // Function ABP_PlatedJeep.ABP_PlatedJeep_C.AnimNotify_FPP_Left_Idle(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ExecuteUbergraph_ABP_PlatedJeep(int32_t EntryPoint); // Function ABP_PlatedJeep.ABP_PlatedJeep_C.ExecuteUbergraph_ABP_PlatedJeep(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

