// AnimBlueprintGeneratedClass ABP_StingRay.ABP_StingRay_C
class UABP_StingRay_C : public UBravoHotelVehicleAnimInstance {

public:

	struct Unknown UberGraphFrame; // 0xA20 (8)
	struct Unknown AnimGraphNode_ModifyBone; // 0xA28 (264)
	struct Unknown AnimGraphNode_BlendListByBool; // 0xB30 (160)
	struct Unknown AnimGraphNode_MeshRefPose_2; // 0xBD0 (16)
	struct Unknown AnimGraphNode_RotationMultiplier; // 0xBE0 (240)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_2; // 0xCD0 (32)
	struct Unknown AnimGraphNode_WheelHandler; // 0xCF0 (224)
	struct Unknown AnimGraphNode_ComponentToLocalSpace; // 0xDD0 (32)
	struct Unknown AnimGraphNode_MeshRefPose; // 0xDF0 (16)
	struct Unknown AnimGraphNode_Root; // 0xE00 (48)

	void AnimGraph(struct Unknown& AnimGraph); // Function ABP_StingRay.ABP_StingRay_C.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_StingRay.ABP_StingRay_C.BlueprintUpdateAnimation(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_ABP_StingRay(int32_t EntryPoint); // Function ABP_StingRay.ABP_StingRay_C.ExecuteUbergraph_ABP_StingRay(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

