// AnimBlueprintGeneratedClass ABP_StingRay.ABP_StingRay_C
struct UABP_StingRay_C : UBravoHotelVehicleAnimInstance {
	Unknown UberGraphFrame; //  0xa20 Size(8)
	Unknown AnimGraphNode_ModifyBone; //  0xa28 Size(108)
	Unknown AnimGraphNode_BlendListByBo; //  0xb30 Size(a0)
	Unknown AnimGraphNode_MeshRefPose_2; //  0xbd0 Size(10)
	Unknown AnimGraphNode_RotationMultiplier; //  0xbe0 Size(f0)
	Unknown AnimGraphNode_ComponentToLo_2; //  0xcd0 Size(20)
	Unknown AnimGraphNode_WheelHandler; //  0xcf0 Size(e0)
	Unknown AnimGraphNode_ComponentToLoplier; //  0xdd0 Size(20)
	Unknown AnimGraphNode_MeshRefPose; //  0xdf0 Size(10)
	Unknown AnimGraphNode_Root; //  0xe00 Size(30)

	void AnimGraph(Unknown& AnimGraph); // Function ABP_StingRay.ABP_StingRay_C.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

