// AnimBlueprintGeneratedClass ABP_StingRay.ABP_StingRay_C
struct UABP_StingRay_C : UBravoHotelVehicleAnimInstance {
	struct Unknown UberGraphFrame; //  0xa20 Size(8)
	struct Unknown AnimGraphNode_ModifyBone; //  0xa28 Size(108)
	struct Unknown AnimGraphNode_BlendListByBool; //  0xb30 Size(a0)
	struct Unknown AnimGraphNode_MeshRefPose_2; //  0xbd0 Size(10)
	struct Unknown AnimGraphNode_RotationMultiplier; //  0xbe0 Size(f0)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_2; //  0xcd0 Size(20)
	struct Unknown AnimGraphNode_WheelHandler; //  0xcf0 Size(e0)
	struct Unknown AnimGraphNode_ComponentToLocalSpace; //  0xdd0 Size(20)
	struct Unknown AnimGraphNode_MeshRefPose; //  0xdf0 Size(10)
	struct Unknown AnimGraphNode_Root; //  0xe00 Size(30)

	void AnimGraph(struct Unknown& AnimGraph); // Function ABP_StingRay.ABP_StingRay_C.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

