// AnimBlueprintGeneratedClass ABP_Camaro.ABP_Camaro_C
struct UABP_Camaro_C : UBravoHotelVehicleAnimInstance {
	struct Unknown UberGraphFrame; //  0xa20 Size(8)
	struct Unknown AnimGraphNode_CopyBone_12; //  0xa28 Size(f0)
	struct Unknown AnimGraphNode_LookAt_6; //  0xb20 Size(1b0)
	struct Unknown AnimGraphNode_CopyBone_11; //  0xcd0 Size(f0)
	struct Unknown AnimGraphNode_LookAt_5; //  0xdc0 Size(1b0)
	struct Unknown AnimGraphNode_CopyBone_10; //  0xf70 Size(f0)
	struct Unknown AnimGraphNode_LookAt_4; //  0x1060 Size(1b0)
	struct Unknown AnimGraphNode_CopyBone_9; //  0x1210 Size(f0)
	struct Unknown AnimGraphNode_LookAt_3; //  0x1300 Size(1b0)
	struct Unknown AnimGraphNode_CopyBone_8; //  0x14b0 Size(f0)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_3; //  0x15a0 Size(20)
	struct Unknown AnimGraphNode_CopyBone_7; //  0x15c0 Size(f0)
	struct Unknown AnimGraphNode_MeshRefPose_2; //  0x16b0 Size(10)
	struct Unknown AnimGraphNode_BlendListByBool_2; //  0x16c0 Size(a0)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_2; //  0x1760 Size(20)
	struct Unknown AnimGraphNode_CopyBone_6; //  0x1780 Size(f0)
	struct Unknown AnimGraphNode_WheelHandler; //  0x1870 Size(e0)
	struct Unknown AnimGraphNode_CopyBone_5; //  0x1950 Size(f0)
	struct Unknown AnimGraphNode_Root; //  0x1a40 Size(30)
	struct Unknown AnimGraphNode_CopyBone_4; //  0x1a70 Size(f0)
	struct Unknown AnimGraphNode_CopyBone_3; //  0x1b60 Size(f0)
	struct Unknown AnimGraphNode_CopyBone_2; //  0x1c50 Size(f0)
	struct Unknown AnimGraphNode_CopyBone; //  0x1d40 Size(f0)
	struct Unknown AnimGraphNode_RotationMultiplier_2; //  0x1e30 Size(f0)
	struct Unknown AnimGraphNode_LookAt_2; //  0x1f20 Size(1b0)
	struct Unknown AnimGraphNode_RotationMultiplier; //  0x20d0 Size(f0)
	struct Unknown AnimGraphNode_LookAt; //  0x21c0 Size(1b0)
	struct Unknown AnimGraphNode_TransitionRes_12; //  0x2370 Size(28)
	struct Unknown AnimGraphNode_TransitionResol_11; //  0x2398 Size(28)
	struct Unknown AnimGraphNode_TransitionRes_10; //  0x23c0 Size(28)
	struct Unknown AnimGraphNode_TransitionResult_9; //  0x23e8 Size(28)
	struct Unknown AnimGraphNode_TransitionResol_8; //  0x2410 Size(28)
	struct Unknown AnimGraphNode_TransitionRes_7; //  0x2438 Size(28)
	struct Unknown AnimGraphNode_SequencePlayer_6; //  0x2460 Size(78)
	struct Unknown AnimGraphNode_StateResult_6; //  0x24d8 Size(30)
	struct Unknown AnimGraphNode_SequencePlayer_5; //  0x2508 Size(78)
	struct Unknown AnimGraphNode_StateResult_5; //  0x2580 Size(30)
	struct Unknown AnimGraphNode_SequencePlayer_4; //  0x25b0 Size(78)
	struct Unknown AnimGraphNode_StateResult_4; //  0x2628 Size(30)
	struct Unknown AnimGraphNode_StateMachine_2; //  0x2658 Size(b0)
	struct Unknown AnimGraphNode_SaveCachedPos_2; //  0x2708 Size(b8)
	struct Unknown AnimGraphNode_TransitionRes_6; //  0x27c0 Size(28)
	struct Unknown AnimGraphNode_TransitionRes_5; //  0x27e8 Size(28)
	struct Unknown AnimGraphNode_TransitionRes_4; //  0x2810 Size(28)
	struct Unknown AnimGraphNode_TransitionRes_3; //  0x2838 Size(28)
	struct Unknown AnimGraphNode_TransitionRes_2; //  0x2860 Size(28)
	struct Unknown AnimGraphNode_TransitionResult; //  0x2888 Size(28)
	struct Unknown AnimGraphNode_SequencePlayer_3; //  0x28b0 Size(78)
	struct Unknown AnimGraphNode_StateResult_3; //  0x2928 Size(30)
	struct Unknown AnimGraphNode_SequencePlayer_2; //  0x2958 Size(78)
	struct Unknown AnimGraphNode_StateResult_2; //  0x29d0 Size(30)
	struct Unknown AnimGraphNode_SequencePlayer; //  0x2a00 Size(78)
	struct Unknown AnimGraphNode_StateResult; //  0x2a78 Size(30)
	struct Unknown AnimGraphNode_StateMachine; //  0x2aa8 Size(b0)
	struct Unknown AnimGraphNode_SaveCachedPos; //  0x2b58 Size(b8)
	struct Unknown AnimGraphNode_LayeredBoneBlend_2; //  0x2c10 Size(c0)
	struct Unknown AnimGraphNode_UseCachedPose_4; //  0x2cd0 Size(28)
	struct Unknown AnimGraphNode_BlendListByBool; //  0x2cf8 Size(a0)
	struct Unknown AnimGraphNode_TwoWayBlend; //  0x2d98 Size(c8)
	struct Unknown AnimGraphNode_UseCachedPose_3; //  0x2e60 Size(28)
	struct Unknown AnimGraphNode_UseCachedPose_2; //  0x2e88 Size(28)
	struct Unknown AnimGraphNode_UseCachedPose; //  0x2eb0 Size(28)
	struct Unknown AnimGraphNode_MeshRefPose; //  0x2ed8 Size(10)
	struct Unknown AnimGraphNode_LayeredBoneBlend; //  0x2ee8 Size(c0)
	struct Unknown AnimGraphNode_ComponentToLocalSpace; //  0x2fa8 Size(20)
	struct Unknown AnimGraphNode_LocalToComponentSpace; //  0x2fc8 Size(20)

	void AnimGraph(struct Unknown& AnimGraph); // Function ABP_Camaro.ABP_Camaro_C.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

