// UserDefinedStruct AdvancedEffectFeaturesNoCustomDepth.AdvancedEffectFeaturesNoCustomDepth
struct FAdvancedEffectFeaturesNoCustomDepth {
	char BlendMode_12_09737E6C44063CBE16D45A8896564C06; // 0x0 (1)
	struct UTexture2D BlendMask_15_664A106449FD3C01747ABC9174124057; // 0x8 (8)
	struct FVector2DN BlendMaskScale_18_615A76A449B11B7912A0AEA82EB64EA5; // 0x10 (8)
	float BlendDistance_23_BD484C304DC4B8E69152DA879158606B; // 0x18 (4)
	float BlendDistanceSharpness_24_17B5A9EF45A85808BD4C3DB4D7A1BDE3; // 0x1C (4)
	char BlendDistanceInvert_26_BAA4896D4DB1D15370EB73ABA02CBF01 : 0; // 0x20 (1)
	float BlendingOpacity_10_63DB57664274BA07E8C302A5DE11468B; // 0x24 (4)
	int32_t EffectPriority_11_EDF854034FC93238C76D8FA5C8F7CD2F; // 0x28 (4)
};

