// UserDefinedStruct AdvancedEffectFeatures.AdvancedEffectFeatures
struct FAdvancedEffectFeatures {
	char BlendMode_12_09737E6C44063CBE16D45A8896564C06; // 0x0 (1)
	struct Unknown BlendMask_21_9E705B66406A56FD3FFAF1A6942926D5; // 0x8 (8)
	struct Unknown BlendMaskScale_24_EA5846484DB94044F896A09A0BC2F6C0; // 0x10 (8)
	float BlendDistance_33_7594D9DD4D782916B58945895B32667E; // 0x18 (4)
	float BlendDistanceSharpness_35_6A828E614037A27B69EE71A96FC5821D; // 0x1C (4)
	char BlendDistanceInvert_37_D287DE844826F2359AAFE3858976F62A : 0; // 0x20 (1)
	float BlendingOpacity_10_63DB57664274BA07E8C302A5DE11468B; // 0x24 (4)
	int32_t EffectPriority_11_EDF854034FC93238C76D8FA5C8F7CD2F; // 0x28 (4)
	char CustomDepth_1_CCA4E6DA4D5BFFF130E4238E20DDB1B8 : 0; // 0x2C (1)
	char StencilBuffer_15_EA46BAF04C25E4D2EA4796B4C92C5FE6 : 0; // 0x2D (1)
	int32_t StencilMask_18_BF959A7242C50326D3AE65A973C5A5B1; // 0x30 (4)
};

