// Enum AIModule.EPathFollowingResult
enum class EPathFollowingResult : uint8 {
	EPathFollowingResult = 0
	EPathFollowingResult = 1
	EPathFollowingResult = 2
	EPathFollowingResult = 3
	EPathFollowingResult = 4
	EPathFollowingResult = 5
	EPathFollowingResult = 6
};

// Enum AIModule.EEnvQueryStatus
enum class EEnvQueryStatus : uint8 {
	EEnvQueryStatus = 0
	EEnvQueryStatus = 1
	EEnvQueryStatus = 2
	EEnvQueryStatus = 3
	EEnvQueryStatus = 4
	EEnvQueryStatus = 5
	EEnvQueryStatus = 6
};

// Enum AIModule.EAISenseNotifyType
enum class EAISenseNotifyType : uint8 {
	EAISenseNotifyType = 0
	EAISenseNotifyType = 1
	EAISenseNotifyType = 2
};

// Enum AIModule.EAITaskPriority
enum class EAITaskPriority : uint8 {
	EAITaskPriority = 0
	EAITaskPriority = 64
	EAITaskPriority = 127
	EAITaskPriority = 192
	EAITaskPriority = 254
	EAITaskPriority = 255
};

// Enum AIModule.EGenericAICheck
enum class EGenericAICheck : uint8 {
	EGenericAICheck = 0
	EGenericAICheck = 1
	EGenericAICheck = 2
	EGenericAICheck = 3
	EGenericAICheck = 4
	EGenericAICheck = 5
	EGenericAICheck = 6
	EGenericAICheck = 7
};

// Enum AIModule.EAILockSource
enum class EAILockSource : uint8 {
	EAILockSource = 0
	EAILockSource = 1
	EAILockSource = 2
	EAILockSource = 3
	EAILockSource = 4
};

// Enum AIModule.EAIRequestPriority
enum class EAIRequestPriority : uint8 {
	EAIRequestPriority = 0
	EAIRequestPriority = 1
	EAIRequestPriority = 2
	EAIRequestPriority = 3
	EAIRequestPriority = 4
	EAIRequestPriority = 5
};

// Enum AIModule.EPawnActionEventType
enum class EPawnActionEventType : uint8 {
	EPawnActionEventType = 0
	EPawnActionEventType = 1
	EPawnActionEventType = 2
	EPawnActionEventType = 3
	EPawnActionEventType = 4
	EPawnActionEventType = 5
	EPawnActionEventType = 6
};

// Enum AIModule.EPawnActionResult
enum class EPawnActionResult : uint8 {
	EPawnActionResult = 0
	EPawnActionResult = 1
	EPawnActionResult = 2
	EPawnActionResult = 3
	EPawnActionResult = 4
	EPawnActionResult = 5
};

// Enum AIModule.EPawnActionAbortState
enum class EPawnActionAbortState : uint8 {
	EPawnActionAbortState = 0
	EPawnActionAbortState = 1
	EPawnActionAbortState = 2
	EPawnActionAbortState = 3
	EPawnActionAbortState = 4
	EPawnActionAbortState = 5
};

// Enum AIModule.FAIDistanceType
enum class FAIDistanceType : uint8 {
	FAIDistanceType = 0
	FAIDistanceType = 1
	FAIDistanceType = 2
	FAIDistanceType = 3
};

// Enum AIModule.EAIOptionFlag
enum class EAIOptionFlag : uint8 {
	EAIOptionFlag = 0
	EAIOptionFlag = 1
	EAIOptionFlag = 2
	EAIOptionFlag = 3
};

// Enum AIModule.EBTFlowAbortMode
enum class EBTFlowAbortMode : uint8 {
	EBTFlowAbortMode = 0
	EBTFlowAbortMode = 1
	EBTFlowAbortMode = 2
	EBTFlowAbortMode = 3
	EBTFlowAbortMode = 4
};

// Enum AIModule.EBTNodeResult
enum class EBTNodeResult : uint8 {
	EBTNodeResult = 0
	EBTNodeResult = 1
	EBTNodeResult = 2
	EBTNodeResult = 3
	EBTNodeResult = 4
};

// Enum AIModule.ETextKeyOperation
enum class ETextKeyOperation : uint8 {
	ETextKeyOperation = 0
	ETextKeyOperation = 1
	ETextKeyOperation = 2
	ETextKeyOperation = 3
	ETextKeyOperation = 4
};

// Enum AIModule.EArithmeticKeyOperation
enum class EArithmeticKeyOperation : uint8 {
	EArithmeticKeyOperation = 0
	EArithmeticKeyOperation = 1
	EArithmeticKeyOperation = 2
	EArithmeticKeyOperation = 3
	EArithmeticKeyOperation = 4
	EArithmeticKeyOperation = 5
	EArithmeticKeyOperation = 6
};

// Enum AIModule.EBasicKeyOperation
enum class EBasicKeyOperation : uint8 {
	EBasicKeyOperation = 0
	EBasicKeyOperation = 1
	EBasicKeyOperation = 2
};

// Enum AIModule.EBTParallelMode
enum class EBTParallelMode : uint8 {
	EBTParallelMode = 0
	EBTParallelMode = 1
	EBTParallelMode = 2
};

// Enum AIModule.EBTDecoratorLogic
enum class EBTDecoratorLogic : uint8 {
	EBTDecoratorLogic = 0
	EBTDecoratorLogic = 1
	EBTDecoratorLogic = 2
	EBTDecoratorLogic = 3
	EBTDecoratorLogic = 4
	EBTDecoratorLogic = 5
};

// Enum AIModule.EBTChildIndex
enum class EBTChildIndex : uint8 {
	EBTChildIndex = 0
	EBTChildIndex = 1
	EBTChildIndex = 2
};

// Enum AIModule.EBTBlackboardRestart
enum class EBTBlackboardRestart : uint8 {
	EBTBlackboardRestart = 0
	EBTBlackboardRestart = 1
	EBTBlackboardRestart = 2
};

// Enum AIModule.EBlackBoardEntryComparison
enum class EBlackBoardEntryComparison : uint8 {
	EBlackBoardEntryComparison = 0
	EBlackBoardEntryComparison = 1
	EBlackBoardEntryComparison = 2
};

// Enum AIModule.EPathExistanceQueryType
enum class EPathExistanceQueryType : uint8 {
	EPathExistanceQueryType = 0
	EPathExistanceQueryType = 1
	EPathExistanceQueryType = 2
	EPathExistanceQueryType = 3
};

// Enum AIModule.EPointOnCircleSpacingMethod
enum class EPointOnCircleSpacingMethod : uint8 {
	EPointOnCircleSpacingMethod = 0
	EPointOnCircleSpacingMethod = 1
	EPointOnCircleSpacingMethod = 2
};

// Enum AIModule.EEQSNormalizationType
enum class EEQSNormalizationType : uint8 {
	EEQSNormalizationType = 0
	EEQSNormalizationType = 1
	EEQSNormalizationType = 2
};

// Enum AIModule.EEnvTestDistance
enum class EEnvTestDistance : uint8 {
	EEnvTestDistance = 0
	EEnvTestDistance = 1
	EEnvTestDistance = 2
	EEnvTestDistance = 3
	EEnvTestDistance = 4
};

// Enum AIModule.EEnvTestDot
enum class EEnvTestDot : uint8 {
	EEnvTestDot = 0
	EEnvTestDot = 1
	EEnvTestDot = 2
};

// Enum AIModule.EEnvTestPathfinding
enum class EEnvTestPathfinding : uint8 {
	EEnvTestPathfinding = 0
	EEnvTestPathfinding = 1
	EEnvTestPathfinding = 2
	EEnvTestPathfinding = 3
};

// Enum AIModule.EEnvQueryTestClamping
enum class EEnvQueryTestClamping : uint8 {
	EEnvQueryTestClamping = 0
	EEnvQueryTestClamping = 1
	EEnvQueryTestClamping = 2
	EEnvQueryTestClamping = 3
};

// Enum AIModule.EEnvDirection
enum class EEnvDirection : uint8 {
	EEnvDirection = 0
	EEnvDirection = 1
	EEnvDirection = 2
};

// Enum AIModule.EEnvOverlapShape
enum class EEnvOverlapShape : uint8 {
	EEnvOverlapShape = 0
	EEnvOverlapShape = 1
	EEnvOverlapShape = 2
	EEnvOverlapShape = 3
};

// Enum AIModule.EEnvTraceShape
enum class EEnvTraceShape : uint8 {
	EEnvTraceShape = 0
	EEnvTraceShape = 1
	EEnvTraceShape = 2
	EEnvTraceShape = 3
	EEnvTraceShape = 4
};

// Enum AIModule.EEnvQueryTrace
enum class EEnvQueryTrace : uint8 {
	EEnvQueryTrace = 0
	EEnvQueryTrace = 1
	EEnvQueryTrace = 2
	EEnvQueryTrace = 3
	EEnvQueryTrace = 4
};

// Enum AIModule.EAIParamType
enum class EAIParamType : uint8 {
	EAIParamType = 0
	EAIParamType = 1
	EAIParamType = 2
	EAIParamType = 3
};

// Enum AIModule.EEnvQueryParam
enum class EEnvQueryParam : uint8 {
	EEnvQueryParam = 0
	EEnvQueryParam = 1
	EEnvQueryParam = 2
	EEnvQueryParam = 3
};

// Enum AIModule.EEnvQueryRunMode
enum class EEnvQueryRunMode : uint8 {
	EEnvQueryRunMode = 0
	EEnvQueryRunMode = 1
	EEnvQueryRunMode = 2
	EEnvQueryRunMode = 3
	EEnvQueryRunMode = 4
};

// Enum AIModule.EEnvTestScoreOperator
enum class EEnvTestScoreOperator : uint8 {
	EEnvTestScoreOperator = 0
	EEnvTestScoreOperator = 1
	EEnvTestScoreOperator = 2
	EEnvTestScoreOperator = 3
	EEnvTestScoreOperator = 4
};

// Enum AIModule.EEnvTestFilterOperator
enum class EEnvTestFilterOperator : uint8 {
	EEnvTestFilterOperator = 0
	EEnvTestFilterOperator = 1
	EEnvTestFilterOperator = 2
};

// Enum AIModule.EEnvTestCost
enum class EEnvTestCost : uint8 {
	EEnvTestCost = 0
	EEnvTestCost = 1
	EEnvTestCost = 2
	EEnvTestCost = 3
};

// Enum AIModule.EEnvTestWeight
enum class EEnvTestWeight : uint8 {
	EEnvTestWeight = 0
	EEnvTestWeight = 1
	EEnvTestWeight = 2
	EEnvTestWeight = 3
	EEnvTestWeight = 4
	EEnvTestWeight = 5
	EEnvTestWeight = 6
};

// Enum AIModule.EEnvTestScoreEquation
enum class EEnvTestScoreEquation : uint8 {
	EEnvTestScoreEquation = 0
	EEnvTestScoreEquation = 1
	EEnvTestScoreEquation = 2
	EEnvTestScoreEquation = 3
	EEnvTestScoreEquation = 4
	EEnvTestScoreEquation = 5
};

// Enum AIModule.EEnvTestFilterType
enum class EEnvTestFilterType : uint8 {
	EEnvTestFilterType = 0
	EEnvTestFilterType = 1
	EEnvTestFilterType = 2
	EEnvTestFilterType = 3
	EEnvTestFilterType = 4
};

// Enum AIModule.EEnvTestPurpose
enum class EEnvTestPurpose : uint8 {
	EEnvTestPurpose = 0
	EEnvTestPurpose = 1
	EEnvTestPurpose = 2
	EEnvTestPurpose = 3
};

// Enum AIModule.EEnvQueryHightlightMode
enum class EEnvQueryHightlightMode : uint8 {
	EEnvQueryHightlightMode = 0
	EEnvQueryHightlightMode = 1
	EEnvQueryHightlightMode = 2
	EEnvQueryHightlightMode = 3
};

// Enum AIModule.ETeamAttitude
enum class ETeamAttitude : uint8 {
	ETeamAttitude = 0
	ETeamAttitude = 1
	ETeamAttitude = 2
	ETeamAttitude = 3
};

// Enum AIModule.EPathFollowingRequestResult
enum class EPathFollowingRequestResult : uint8 {
	EPathFollowingRequestResult = 0
	EPathFollowingRequestResult = 1
	EPathFollowingRequestResult = 2
	EPathFollowingRequestResult = 3
};

// Enum AIModule.EPathFollowingAction
enum class EPathFollowingAction : uint8 {
	EPathFollowingAction = 0
	EPathFollowingAction = 1
	EPathFollowingAction = 2
	EPathFollowingAction = 3
	EPathFollowingAction = 4
	EPathFollowingAction = 5
};

// Enum AIModule.EPathFollowingStatus
enum class EPathFollowingStatus : uint8 {
	EPathFollowingStatus = 0
	EPathFollowingStatus = 1
	EPathFollowingStatus = 2
	EPathFollowingStatus = 3
	EPathFollowingStatus = 4
};

// Enum AIModule.EPawnActionFailHandling
enum class EPawnActionFailHandling : uint8 {
	EPawnActionFailHandling = 0
	EPawnActionFailHandling = 1
	EPawnActionFailHandling = 2
};

// Enum AIModule.EPawnSubActionTriggeringPolicy
enum class EPawnSubActionTriggeringPolicy : uint8 {
	EPawnSubActionTriggeringPolicy = 0
	EPawnSubActionTriggeringPolicy = 1
	EPawnSubActionTriggeringPolicy = 2
};

// Enum AIModule.EPawnActionMoveMode
enum class EPawnActionMoveMode : uint8 {
	EPawnActionMoveMode = 0
	EPawnActionMoveMode = 1
	EPawnActionMoveMode = 2
};

// Class AIModule.BTNode
struct UBTNode : Object {
	struct FString NodeName; // 0x30 (16)
	struct Unknown TreeAsset; // 0x40 (8)
	struct Unknown ParentNode; // 0x48 (8)
};

// Class AIModule.BTTaskNode
struct UBTTaskNode : UBTNode {
	struct TArray<Unknown> Services; // 0x58 (16)
	char bIgnoreRestartSelf : 0; // 0x68 (1)
};

// Class AIModule.BTTask_BlackboardBase
struct UBTTask_BlackboardBase : UBTTaskNode {
	struct Unknown BlackboardKey; // 0x70 (40)
};

// Class AIModule.AIController
struct AAIController : AController {
	char bStartAILogicOnPossess : 0; // 0x3E8 (1)
	char bStopAILogicOnUnposses : 0; // 0x3E8 (1)
	char bLOSflag : 0; // 0x3E8 (1)
	char bSkipExtraLOSChecks : 0; // 0x3E8 (1)
	char bAllowStrafe : 0; // 0x3E8 (1)
	char bWantsPlayerState : 0; // 0x3E8 (1)
	char bSetControlRotationFromPawnOrientation : 0; // 0x3E8 (1)
	struct Unknown PathFollowingComponent; // 0x3F0 (8)
	struct Unknown BrainComponent; // 0x3F8 (8)
	struct Unknown PerceptionComponent; // 0x400 (8)
	struct Unknown ActionsComp; // 0x408 (8)
	struct Unknown Blackboard; // 0x410 (8)
	struct Unknown CachedGameplayTasksComponent; // 0x418 (8)
	struct Unknown* DefaultNavigationFilterClass; // 0x420 (8)
	struct FMulticastInlineDelegate ReceiveMoveCompleted; // 0x428 (16)

	char UseBlackboard(struct Unknown BlackboardAsset, struct Unknown& BlackboardComponent); // Function AIModule.AIController.UseBlackboard(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAC650>
	void UnclaimTaskResource(struct Unknown* ResourceClass); // Function AIModule.AIController.UnclaimTaskResource(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAC4C0>
	void SetPathFollowingComponent(struct Unknown NewPFComponent); // Function AIModule.AIController.SetPathFollowingComponent(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FABFF0>
	void SetMoveBlockDetection(char bEnable); // Function AIModule.AIController.SetMoveBlockDetection(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FABF60>
	char RunBehaviorTree(struct Unknown BTAsset); // Function AIModule.AIController.RunBehaviorTree(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FABD90>
	void OnUsingBlackBoard(struct Unknown BlackboardComp, struct Unknown BlackboardAsset); // Function AIModule.AIController.OnUsingBlackBoard(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnGameplayTaskResourcesClaimed(struct Unknown NewlyClaimed, struct Unknown FreshlyReleased); // Function AIModule.AIController.OnGameplayTaskResourcesClaimed(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FABB20>
	char MoveToLocation(struct Unknown& Dest, float AcceptanceRadius, char bStopOnOverlap, char bUsePathfinding, char bProjectDestinationToNavigation, char bCanStrafe, struct Unknown* FilterClass, char bAllowPartialPath); // Function AIModule.AIController.MoveToLocation(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAB8B0>
	char MoveToActor(struct Unknown Goal, float AcceptanceRadius, char bStopOnOverlap, char bUsePathfinding, char bCanStrafe, struct Unknown* FilterClass, char bAllowPartialPath); // Function AIModule.AIController.MoveToActor(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAB690>
	void K2_SetFocus(struct Unknown NewFocus); // Function AIModule.AIController.K2_SetFocus(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAB500>
	void K2_SetFocalPoint(struct Unknown FP); // Function AIModule.AIController.K2_SetFocalPoint(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAB470>
	void K2_ClearFocus(); // Function AIModule.AIController.K2_ClearFocus(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAB450>
	char HasPartialPath(); // Function AIModule.AIController.HasPartialPath(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAB270>
	struct Unknown GetPathFollowingComponent(); // Function AIModule.AIController.GetPathFollowingComponent(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAB0B0>
	char GetMoveStatus(); // Function AIModule.AIController.GetMoveStatus(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAB080>
	struct Unknown GetImmediateMoveDestination(); // Function AIModule.AIController.GetImmediateMoveDestination(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAAF50>
	struct Unknown GetFocusActor(); // Function AIModule.AIController.GetFocusActor(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAAF20>
	struct Unknown GetFocalPointOnActor(struct Unknown Actor); // Function AIModule.AIController.GetFocalPointOnActor(Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAAE70>
	struct Unknown GetFocalPoint(); // Function AIModule.AIController.GetFocalPoint(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAAE30>
	struct Unknown GetAIPerceptionComponent(); // Function AIModule.AIController.GetAIPerceptionComponent(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAAB20>
	void ClaimTaskResource(struct Unknown* ResourceClass); // Function AIModule.AIController.ClaimTaskResource(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAA840>
};

// Class AIModule.BTService
struct UBTService : UBTAuxiliaryNode {
	float Interval; // 0x60 (4)
	float RandomDeviation; // 0x64 (4)
	char bCallTickOnSearchStart : 0; // 0x68 (1)
	char b : 0; // 0x68 (1)
};

// Class AIModule.AIAsyncTaskBlueprintProxy
struct UAIAsyncTaskBlueprintProxy : Object {
	struct FMulticastInlineDelegate OnSuccess; // 0x28 (16)
	struct FMulticastInlineDelegate OnFail; // 0x38 (16)

	void OnMoveCompleted(struct Unknown RequestID, char MovementResult); // Function AIModule.AIAsyncTaskBlueprintProxy.OnMoveCompleted(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FABBF0>
};

// Class AIModule.AIDataProvider_QueryParams
struct UAIDataProvider_QueryParams : UAIDataProvider {
	struct FName ParamName; // 0x28 (8)
	float FloatValue; // 0x30 (4)
	int32_t IntValue; // 0x34 (4)
	char BoolValue : 0; // 0x38 (1)
};

// Class AIModule.AIDataProvider_Random
struct UAIDataProvider_Random : UAIDataProvider_QueryParams {
	float Min; // 0x40 (4)
	float MAX; // 0x44 (4)
	char bInteger : 0; // 0x48 (1)
};

// Class AIModule.AIPerceptionComponent
struct UAIPerceptionComponent : UActorComponent {
	struct TArray<Unknown> SensesConfig; // 0xB0 (16)
	struct Unknown* DominantSense; // 0xC0 (8)
	struct Unknown AIOwner; // 0xD8 (8)
	struct FMulticastInlineDelegate OnPerceptionUpdated; // 0x160 (16)
	struct FMulticastInlineDelegate OnTargetPerceptionUpdated; // 0x170 (16)

	void SetSenseEnabled(struct Unknown* SenseClass, char bEnable); // Function AIModule.AIPerceptionComponent.SetSenseEnabled(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAC070>
	void RequestStimuliListenerUpdate(); // Function AIModule.AIPerceptionComponent.RequestStimuliListenerUpdate(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FABD70>
	void OnOwnerEndPlay(struct Unknown Actor, char EndPlayReason); // Function AIModule.AIPerceptionComponent.OnOwnerEndPlay(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FABCB0>
	void GetPerceivedHostileActors(struct TArray<Unknown>& OutActors); // Function AIModule.AIPerceptionComponent.GetPerceivedHostileActors(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAB1C0>
	void GetPerceivedActors(struct Unknown* SenseToUse, struct TArray<Unknown>& OutActors); // Function AIModule.AIPerceptionComponent.GetPerceivedActors(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAB0D0>
	void GetKnownPerceivedActors(struct Unknown* SenseToUse, struct TArray<Unknown>& OutActors); // Function AIModule.AIPerceptionComponent.GetKnownPerceivedActors(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAAF90>
	void GetCurrentlyPerceiv(struct Unknown* SenseToUse, struct TArray<Unknown>& OutActors); // Function AIModule.AIPerceptionComponent.GetCurrentlyPerceivtors(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAAD40>
	char GetActorsPerception(struct Unknown Actor, struct Unknown& Info); // Function AIModule.AIPerceptionComponent.GetActorsPerception(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAAB40>
	void ForgetAll(); // Function AIModule.AIPerceptionComponent.ForgetAll(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FAAA80>
};

// Class AIModule.AIPerceptionStimuliSourceComponent
struct UAIPerceptionStimuliSourceComponent : UActorComponent {
	char bAutoRegisterAsSource : 0; // 0xB0 (1)
	struct TArray<Unknown> RegisterAsSourceForSenses; // 0xB8 (16)

	void UnregisterFromSense(struct Unknown* SenseClass); // Function AIModule.AIPerceptionStimuliSourceComponent.UnregisterFromSense(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB1040>
	void UnregisterFromPerceptionSystem(); // Function AIModule.AIPerceptionStimuliSourceComponent.UnregisterFromPerceptionSystem(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB1020>
	void RegisterWithPerceptionSystem(); // Function AIModule.AIPerceptionStimuliSourceComponent.RegisterWithPerceptionSystem(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB0940>
	void RegisterForSense(struct Unknown* SenseClass); // Function AIModule.AIPerceptionStimuliSourceComponent.RegisterForSense(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB07D0>
};

// Class AIModule.AISubsystem
struct UAISubsystem : Object {
	struct Unknown AISystem; // 0x30 (8)
};

// Class AIModule.AIPerceptionSystem
struct UAIPerceptionSystem : UAISubsystem {
	struct TArray<Unknown> Senses; // 0x88 (16)
	float PerceptionAgingRate; // 0x98 (4)

	void ReportPerceptionEvent(struct Unknown WorldContextObject, struct Unknown PerceptionEvent); // Function AIModule.AIPerceptionSystem.ReportPerceptionEvent(Final|Native|Static|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB0D70>
	void ReportEvent(struct Unknown PerceptionEvent); // Function AIModule.AIPerceptionSystem.ReportEvent(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB0B30>
	char RegisterPerceptionStimuliSource(struct Unknown WorldContextObject, struct Unknown* Sense, struct Unknown Target); // Function AIModule.AIPerceptionSystem.RegisterPerceptionStimuliSource(Final|Native|Static|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB0850>
	void OnPerceptionStimuliSourceEndPlay(struct Unknown Actor, char EndPlayReason); // Function AIModule.AIPerceptionSystem.OnPerceptionStimuliSourceEndPlay(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB0710>
	struct Unknown* GetSenseClassForStimulus(struct Unknown WorldContextObject, struct Unknown& Stimulus); // Function AIModule.AIPerceptionSystem.GetSenseClassForStimulus(Final|Native|Static|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB05E0>
};

// Class AIModule.AISense
struct UAISense : Object {
	float DefaultExpirationAge; // 0x28 (4)
	enum class Unknow NotifyType; // 0x2C (1)
	char bWantsNewPawnNotification : 0; // 0x30 (1)
	char bAutoRegisterAllPawnsAsSources : 0; // 0x30 (1)
	struct Unknown PerceptionSystemInstance; // 0x38 (8)
};

// Class AIModule.AISense_Blueprint
struct UAISense_Blueprint : UAISense {
	struct Unknown* ListenerDataType; // 0x80 (8)
	struct TArray<Unknown> ListenerContainer; // 0x88 (16)
	struct TArray<Unknown> UnprocessedEvents; // 0x98 (16)

	float OnUpdate(struct TArray<Unknown>& EventsToProcess); // Function AIModule.AISense_Blueprint.OnUpdate(Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnListenerUpdated(struct Unknown ActorListener, struct Unknown PerceptionComponent); // Function AIModule.AISense_Blueprint.OnListenerUpdated(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnListenerUnregistered(struct Unknown ActorListener, struct Unknown PerceptionComponent); // Function AIModule.AISense_Blueprint.OnListenerUnregistered(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnListenerRegistered(struct Unknown ActorListener, struct Unknown PerceptionComponent); // Function AIModule.AISense_Blueprint.OnListenerRegistered(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void K2_OnNewPawn(struct Unknown NewPawn); // Function AIModule.AISense_Blueprint.K2_OnNewPawn(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void GetAllListenerComponents(struct TArray<Unknown>& ListenerComponents); // Function AIModule.AISense_Blueprint.GetAllListenerComponents(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB0530>
	void GetAllListenerActors(struct TArray<Unknown>& ListenerActors); // Function AIModule.AISense_Blueprint.GetAllListenerActors(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB0480>
};

// Class AIModule.AISense_Damage
struct UAISense_Damage : UAISense {
	struct TArray<Unknown> RegisteredEvents; // 0x80 (16)

	void ReportDamageEvent(struct Unknown WorldContextObject, struct Unknown DamagedActor, struct Unknown Instigator, float DamageAmount, struct Unknown EventLocation, struct Unknown HitLocation); // Function AIModule.AISense_Damage.ReportDamageEvent(Final|Native|Static|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB0960>
};

// Class AIModule.AISense_Hearing
struct UAISense_Hearing : UAISense {
	struct TArray<Unknown> NoiseEvents; // 0x80 (16)
	float SpeedOfSoundSq; // 0x90 (4)

	void ReportNoiseEvent(struct Unknown WorldContextObject, struct Unknown NoiseLocation, float Loudness, struct Unknown Instigator, float MaxRange, struct FName Tag); // Function AIModule.AISense_Hearing.ReportNoiseEvent(Final|Native|Static|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB0BB0>
};

// Class AIModule.AISense_Prediction
struct UAISense_Prediction : UAISense {
	struct TArray<Unknown> RegisteredEvents; // 0x80 (16)

	void RequestPawnPredictionEvent(struct Unknown Requestor, struct Unknown PredictedActor, float PredictionTime); // Function AIModule.AISense_Prediction.RequestPawnPredictionEvent(Final|Native|Static|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB0F20>
	void RequestControllerPredictionEvent(struct Unknown Requestor, struct Unknown PredictedActor, float PredictionTime); // Function AIModule.AISense_Prediction.RequestControllerPredictionEvent(Final|Native|Static|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB0E20>
};

// Class AIModule.AISense_Sight
struct UAISense_Sight : UAISense {
	int32_t MaxTracesPerTick; // 0x148 (4)
	int32_t MinQueriesPerTimeSliceCheck; // 0x14C (4)
	double MaxTimeSlicePerTick; // 0x150 (8)
	float HighImportanceQueryDistanceThreshold; // 0x158 (4)
	float MaxQueryImportance; // 0x160 (4)
	float SightLimitQueryImportance; // 0x164 (4)
};

// Class AIModule.AISense_Team
struct UAISense_Team : UAISense {
	struct TArray<Unknown> RegisteredEvents; // 0x80 (16)
};

// Class AIModule.AISense_Touch
struct UAISense_Touch : UAISense {
	struct TArray<Unknown> RegisteredEvents; // 0x80 (16)
};

// Class AIModule.AISenseConfig
struct UAISenseConfig : Object {
	struct Unknown DebugColor; // 0x28 (4)
	float MaxAge; // 0x2C (4)
	char bStartsEnabled : 0; // 0x30 (1)
};

// Class AIModule.AISenseConfig_Blueprint
struct UAISenseConfig_Blueprint : UAISenseConfig {
	struct Unknown* Implementation; // 0x48 (8)
};

// Class AIModule.AISenseConfig_Damage
struct UAISenseConfig_Damage : UAISenseConfig {
	struct Unknown* Implementation; // 0x48 (8)
};

// Class AIModule.AISenseConfig_Hearing
struct UAISenseConfig_Hearing : UAISenseConfig {
	struct Unknown* Implementation; // 0x48 (8)
	float HearingRange; // 0x50 (4)
	float LoSHearingRange; // 0x54 (4)
	char bUseLoSHearing : 0; // 0x58 (1)
	struct Unknown DetectionByAffiliation; // 0x5C (4)
};

// Class AIModule.AISenseConfig_Sight
struct UAISenseConfig_Sight : UAISenseConfig {
	struct Unknown* Implementation; // 0x48 (8)
	float SightRadius; // 0x50 (4)
	float LoseSightRadius; // 0x54 (4)
	float PeripheralVisionAngleDegrees; // 0x58 (4)
	struct Unknown DetectionByAffiliation; // 0x5C (4)
	float AutoSuccessRangeFromLastSeenLocation; // 0x60 (4)
};

// Class AIModule.AISenseEvent_Damage
struct UAISenseEvent_Damage : UAISenseEvent {
	struct Unknown Event; // 0x28 (48)
};

// Class AIModule.AISenseEvent_Hearing
struct UAISenseEvent_Hearing : UAISenseEvent {
	struct Unknown Event; // 0x28 (48)
};

// Class AIModule.AISystem
struct UAISystem : UAISystemBase {
	struct Unknown PerceptionSystemClassName; // 0x58 (24)
	struct Unknown HotSpotManagerClassName; // 0x70 (24)
	float AcceptanceRadius; // 0x88 (4)
	float PathfollowingRegularPathPointAcceptanceRadius; // 0x8C (4)
	float PathfollowingNavLinkAcceptanceRadius; // 0x90 (4)
	char bFinishMoveOnGoalOv : 0; // 0x94 (1)
	char bAcceptPartialPaths : 0; // 0x95 (1)
	char bAllowStrafing : 0; // 0x96 (1)
	char bEnableBTAITasks : 0; // 0x97 (1)
	char bAllowControllersAsEQSQuerier : 0; // 0x98 (1)
	char bEnableDebuggerPlugin : 0; // 0x99 (1)
	char bForgetStaleActors : 0; // 0x9A (1)
	char DefaultSightCollisionChannel; // 0x9B (1)
	struct Unknown BehaviorTreeManager; // 0xA0 (8)
	struct Unknown EnvironmentQueryManager; // 0xA8 (8)
	struct Unknown PerceptionSystem; // 0xB0 (8)
	struct TArray<Unknown> AllProxyObjects; // 0xB8 (16)
	struct Unknown HotSpotManager; // 0xC8 (8)
	struct Unknown NavLocalGrids; // 0xD0 (8)

	void AILoggingVerbose(); // Function AIModule.AISystem.AILoggingVerbose(Exec|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EE1A20>
	void AIIgnorePlayers(); // Function AIModule.AISystem.AIIgnorePlayers(Exec|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x34D6640>
};

// Class AIModule.AITask
struct UAITask : UGameplayTask {
	struct Unknown OwnerController; // 0x68 (8)
};

// Class AIModule.AITask_MoveTo
struct UAITask_MoveTo : UAITask {
	struct FMulticastInlineDelegate OnRequestFailed; // 0x70 (16)
	struct FMulticastInlineDelegate OnMoveFinished; // 0x80 (16)
	struct Unknown MoveRequest; // 0x90 (64)

	struct Unknown AIMoveTo(struct Unknown Controller, struct Unknown GoalLocation, struct Unknown GoalActor, float AcceptanceRadius, char StopOnOverlap, char AcceptPartialPath, char bUsePathfinding, char bLockAILogic, char bUseContinuosGoalTracking, char ProjectGoalOnNavigation); // Function AIModule.AITask_MoveTo.AIMoveTo(Final|Native|Static|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB4ED0>
};

// Class AIModule.BehaviorTree
struct UBehaviorTree : Object {
	struct Unknown RootNode; // 0x30 (8)
	struct Unknown BlackboardAsset; // 0x38 (8)
	struct TArray<Unknown> RootDecorators; // 0x40 (16)
	struct TArray<Unknown> RootDecoratorOps; // 0x50 (16)
};

// Class AIModule.BrainComponent
struct UBrainComponent : UActorComponent {
	struct Unknown BlackboardComp; // 0xB8 (8)
	struct Unknown AIOwner; // 0xC0 (8)

	void StopLogic(struct FString reason); // Function AIModule.BrainComponent.StopLogic(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FBBC50>
	void StartLogic(); // Function AIModule.BrainComponent.StartLogic(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x204BA30>
	void RestartLogic(); // Function AIModule.BrainComponent.RestartLogic(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E538B0>
	char IsRunning(); // Function AIModule.BrainComponent.IsRunning(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FBAF50>
	char IsPaused(); // Function AIModule.BrainComponent.IsPaused(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FBAF20>
};

// Class AIModule.BehaviorTreeComponent
struct UBehaviorTreeComponent : UBrainComponent {
	struct TArray<Unknown> NodeInstances; // 0x130 (16)
	struct Unknown DefaultBehaviorTreeAsset; // 0x268 (8)

	void SetDynamicSubtree(struct Unknown InjectTag, struct Unknown BehaviorAsset); // Function AIModule.BehaviorTreeComponent.SetDynamicSubtree(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB5DD0>
	float GetTagCooldownEndTime(struct Unknown CooldownTag); // Function AIModule.BehaviorTreeComponent.GetTagCooldownEndTime(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB5520>
	void AddCooldownTagDuration(struct Unknown CooldownTag, float CooldownDuration, char bAddToExistingDuration); // Function AIModule.BehaviorTreeComponent.AddCooldownTagDuration(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB51A0>
};

// Class AIModule.BehaviorTreeManager
struct UBehaviorTreeManager : Object {
	int32_t MaxDebuggerSteps; // 0x28 (4)
	struct TArray<Unknown> LoadedTemplates; // 0x30 (16)
	struct TArray<Unknown> ActiveComponents; // 0x40 (16)
};

// Class AIModule.BlackboardComponent
struct UBlackboardComponent : UActorComponent {
	struct Unknown BrainComp; // 0xB0 (8)
	struct Unknown DefaultBlackboardAsset; // 0xB8 (8)
	struct Unknown BlackboardAsset; // 0xC0 (8)
	struct TArray<Unknown> KeyInstances; // 0xE8 (16)

	void SetValueAsVector(struct FName& KeyName, struct Unknown VectorValue); // Function AIModule.BlackboardComponent.SetValueAsVector(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB6690>
	void SetValueAsString(struct FName& KeyName, struct FString StringValue); // Function AIModule.BlackboardComponent.SetValueAsString(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB6540>
	void SetValueAsRotator(struct FName& KeyName, struct Unknown VectorValue); // Function AIModule.BlackboardComponent.SetValueAsRotator(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB6450>
	void SetValueAsObject(struct FName& KeyName, struct Unknown ObjectValue); // Function AIModule.BlackboardComponent.SetValueAsObject(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB6380>
	void SetValueAsName(struct FName& KeyName, struct FName NameValue); // Function AIModule.BlackboardComponent.SetValueAsName(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB62B0>
	void SetValueAsInt(struct FName& KeyName, int32_t IntValue); // Function AIModule.BlackboardComponent.SetValueAsInt(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB61E0>
	void SetValueAsFloat(struct FName& KeyName, float FloatValue); // Function AIModule.BlackboardComponent.SetValueAsFloat(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB6110>
	void SetValueAsEnum(struct FName& KeyName, char EnumValue); // Function AIModule.BlackboardComponent.SetValueAsEnum(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB6040>
	void SetValueAsClass(struct FName& KeyName, struct Unknown* ClassValue); // Function AIModule.BlackboardComponent.SetValueAsClass(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB5F70>
	void SetValueAsBool(struct FName& KeyName, char BoolValue); // Function AIModule.BlackboardComponent.SetValueAsBool(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB5EA0>
	char IsVectorValueSet(struct FName& KeyName); // Function AIModule.BlackboardComponent.IsVectorValueSet(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB5C70>
	struct Unknown GetValueAsVector(struct FName& KeyName); // Function AIModule.BlackboardComponent.GetValueAsVector(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB5BC0>
	struct FString GetValueAsString(struct FName& KeyName); // Function AIModule.BlackboardComponent.GetValueAsString(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB5AD0>
	struct Unknown GetValueAsRotator(struct FName& KeyName); // Function AIModule.BlackboardComponent.GetValueAsRotator(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB5A20>
	struct Unknown GetValueAsObject(struct FName& KeyName); // Function AIModule.BlackboardComponent.GetValueAsObject(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB5980>
	struct FName GetValueAsName(struct FName& KeyName); // Function AIModule.BlackboardComponent.GetValueAsName(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB58E0>
	int32_t GetValueAsInt(struct FName& KeyName); // Function AIModule.BlackboardComponent.GetValueAsInt(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB5840>
	float GetValueAsFloat(struct FName& KeyName); // Function AIModule.BlackboardComponent.GetValueAsFloat(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB57A0>
	char GetValueAsEnum(struct FName& KeyName); // Function AIModule.BlackboardComponent.GetValueAsEnum(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB5700>
	struct Unknown* GetValueAsClass(struct FName& KeyName); // Function AIModule.BlackboardComponent.GetValueAsClass(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB5660>
	char GetValueAsBool(struct FName& KeyName); // Function AIModule.BlackboardComponent.GetValueAsBool(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB55C0>
	char GetRotationFromEntry(struct FName& KeyName, struct Unknown& ResultRotation); // Function AIModule.BlackboardComponent.GetRotationFromEntry(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB5430>
	char GetLocationFromEntry(struct FName& KeyName, struct Unknown& ResultLocation); // Function AIModule.BlackboardComponent.GetLocationFromEntry(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB5340>
	void ClearValue(struct FName& KeyName); // Function AIModule.BlackboardComponent.ClearValue(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FB52B0>
};

// Class AIModule.BlackboardData
struct UBlackboardData : UDataAsset {
	struct Unknown Parent; // 0x30 (8)
	struct TArray<Unknown> Keys; // 0x38 (16)
	char bHasSynchronizedKeys : 0; // 0x48 (1)
};

// Class AIModule.BlackboardKeyType_Class
struct UBlackboardKeyType_Class : UBlackboardKeyType {
	struct Unknown* BaseClass; // 0x30 (8)
};

// Class AIModule.BlackboardKeyType_Enum
struct UBlackboardKeyType_Enum : UBlackboardKeyType {
	struct Unknown EnumType; // 0x30 (8)
	struct FString EnumName; // 0x38 (16)
	char bIsEnumNameValid : 0; // 0x48 (1)
};

// Class AIModule.BlackboardKeyType_NativeEnum
struct UBlackboardKeyType_NativeEnum : UBlackboardKeyType {
	struct FString EnumName; // 0x30 (16)
	struct Unknown EnumType; // 0x40 (8)
};

// Class AIModule.BlackboardKeyType_Object
struct UBlackboardKeyType_Object : UBlackboardKeyType {
	struct Unknown* BaseClass; // 0x30 (8)
};

// Class AIModule.BlackboardKeyType_String
struct UBlackboardKeyType_String : UBlackboardKeyType {
	struct FString StringValue; // 0x30 (16)
};

// Class AIModule.BTCompositeNode
struct UBTCompositeNode : UBTNode {
	struct TArray<Unknown> Children; // 0x58 (16)
	struct TArray<Unknown> Services; // 0x68 (16)
	char bApplyDecoratorScope : 0; // 0x88 (1)
};

// Class AIModule.BTComposite_SimpleParallel
struct UBTComposite_SimpleParallel : UBTCompositeNode {
	char FinishMode; // 0x90 (1)
};

// Class AIModule.BTDecorator
struct UBTDecorator : UBTAuxiliaryNode {
	char bInverseCondition : 0; // 0x60 (1)
	char FlowAbortMode; // 0x64 (1)
};

// Class AIModule.BTDecorator_BlackboardBase
struct UBTDecorator_BlackboardBase : UBTDecorator {
	struct Unknown BlackboardKey; // 0x68 (40)
};

// Class AIModule.BTDecorator_Blackboard
struct UBTDecorator_Blackboard : UBTDecorator_BlackboardBase {
	int32_t IntValue; // 0x90 (4)
	float FloatValue; // 0x94 (4)
	struct FString StringValue; // 0x98 (16)
	struct FString CachedDescription; // 0xA8 (16)
	char OperationType; // 0xB8 (1)
	char NotifyObserver; // 0xB9 (1)
};

// Class AIModule.BTDecorator_BlueprintBase
struct UBTDecorator_BlueprintBase : UBTDecorator {
	struct Unknown AIOwner; // 0x68 (8)
	struct Unknown ActorOwner; // 0x70 (8)
	struct TArray<Unknown> ObservedKeyNames; // 0x78 (16)
	char bShowPropertyDetails : 0; // 0x98 (1)
	char bCheckConditionOnlyBlackBoardChanges : 0; // 0x98 (1)
	char bIsObservingBB : 0; // 0x98 (1)

	void ReceiveTickAI(struct Unknown OwnerController, struct Unknown ControlledPawn, float DeltaSeconds); // Function AIModule.BTDecorator_BlueprintBase.ReceiveTickAI(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveTick(struct Unknown OwnerActor, float DeltaSeconds); // Function AIModule.BTDecorator_BlueprintBase.ReceiveTick(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveObserverDeactivatedAI(struct Unknown OwnerController, struct Unknown ControlledPawn); // Function AIModule.BTDecorator_BlueprintBase.ReceiveObserverDeactivatedAI(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveObserverDeactivated(struct Unknown OwnerActor); // Function AIModule.BTDecorator_BlueprintBase.ReceiveObserverDeactivated(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveObserverActivatedAI(struct Unknown OwnerController, struct Unknown ControlledPawn); // Function AIModule.BTDecorator_BlueprintBase.ReceiveObserverActivatedAI(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveObserverActivated(struct Unknown OwnerActor); // Function AIModule.BTDecorator_BlueprintBase.ReceiveObserverActivated(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveExecutionStartAI(struct Unknown OwnerController, struct Unknown ControlledPawn); // Function AIModule.BTDecorator_BlueprintBase.ReceiveExecutionStartAI(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveExecutionStart(struct Unknown OwnerActor); // Function AIModule.BTDecorator_BlueprintBase.ReceiveExecutionStart(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveExecutionFinishAI(struct Unknown OwnerController, struct Unknown ControlledPawn, char NodeResult); // Function AIModule.BTDecorator_BlueprintBase.ReceiveExecutionFinishAI(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveExecutionFinish(struct Unknown OwnerActor, char NodeResult); // Function AIModule.BTDecorator_BlueprintBase.ReceiveExecutionFinish(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	char PerformConditionCheckAI(struct Unknown OwnerController, struct Unknown ControlledPawn); // Function AIModule.BTDecorator_BlueprintBase.PerformConditionCheckAI(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	char PerformConditionCheck(struct Unknown OwnerActor); // Function AIModule.BTDecorator_BlueprintBase.PerformConditionCheck(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	char IsDecoratorObserverActive(); // Function AIModule.BTDecorator_BlueprintBase.IsDecoratorObserverActive(Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FBAEF0>
	char IsDecoratorExecutionActive(); // Function AIModule.BTDecorator_BlueprintBase.IsDecoratorExecutionActive(Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FBAEC0>
};

// Class AIModule.BTDecorator_CheckGameplayTagsOnActor
struct UBTDecorator_CheckGameplayTagsOnActor : UBTDecorator {
	struct Unknown ActorToCheck; // 0x68 (40)
	enum class Unknow TagsToMatch; // 0x90 (1)
	struct Unknown GameplayTags; // 0x98 (32)
	struct FString CachedDescription; // 0xB8 (16)
};

// Class AIModule.BTDecorator_CompareBBEntries
struct UBTDecorator_CompareBBEntries : UBTDecorator {
	char Operator; // 0x68 (1)
	struct Unknown BlackboardKeyA; // 0x70 (40)
	struct Unknown BlackboardKeyB; // 0x98 (40)
};

// Class AIModule.BTDecorator_ConeCheck
struct UBTDecorator_ConeCheck : UBTDecorator {
	float ConeHalfAngle; // 0x68 (4)
	struct Unknown ConeOrigin; // 0x70 (40)
	struct Unknown ConeDirection; // 0x98 (40)
	struct Unknown Observed; // 0xC0 (40)
};

// Class AIModule.BTDecorator_Cooldown
struct UBTDecorator_Cooldown : UBTDecorator {
	float CoolDownTime; // 0x68 (4)
};

// Class AIModule.BTDecorator_DoesPathExist
struct UBTDecorator_DoesPathExist : UBTDecorator {
	struct Unknown BlackboardKeyA; // 0x68 (40)
	struct Unknown BlackboardKeyB; // 0x90 (40)
	char bUseSelf : 0; // 0xB8 (1)
	char PathQueryType; // 0xBC (1)
	struct Unknown* FilterClass; // 0xC0 (8)
};

// Class AIModule.BTDecorator_IsAtLocation
struct UBTDecorator_IsAtLocation : UBTDecorator_BlackboardBase {
	float AcceptableRadius; // 0x90 (4)
	struct Unknown ParametrizedAcceptableRadius; // 0x98 (56)
	enum class Unknow GeometricDistanceType; // 0xD0 (1)
	char bUseParametrizedRadius : 0; // 0xD4 (1)
	char bUseNavAgentGoalLocation : 0; // 0xD4 (1)
	char bPathFindingBasedTest : 0; // 0xD4 (1)
};

// Class AIModule.BTDecorator_IsBBEntryOfClass
struct UBTDecorator_IsBBEntryOfClass : UBTDecorator_BlackboardBase {
	struct Unknown* TestClass; // 0x90 (8)
};

// Class AIModule.BTDecorator_KeepInCone
struct UBTDecorator_KeepInCone : UBTDecorator {
	float ConeHalfAngle; // 0x68 (4)
	struct Unknown ConeOrigin; // 0x70 (40)
	struct Unknown Observed; // 0x98 (40)
	char bUseSelfAsOrigin : 0; // 0xC0 (1)
	char bUseSelfAsObserved : 0; // 0xC0 (1)
};

// Class AIModule.BTDecorator_Loop
struct UBTDecorator_Loop : UBTDecorator {
	int32_t NumLoops; // 0x68 (4)
	char bInfiniteLoop : 0; // 0x6C (1)
	float InfiniteLoopTimeoutTime; // 0x70 (4)
};

// Class AIModule.BTDecorator_SetTagCooldown
struct UBTDecorator_SetTagCooldown : UBTDecorator {
	struct Unknown CooldownTag; // 0x68 (8)
	float CooldownDuration; // 0x70 (4)
	char bAddToExistingDuration : 0; // 0x74 (1)
};

// Class AIModule.BTDecorator_TagCooldown
struct UBTDecorator_TagCooldown : UBTDecorator {
	struct Unknown CooldownTag; // 0x68 (8)
	float CooldownDuration; // 0x70 (4)
	char bAddToExistingDuration : 0; // 0x74 (1)
	char bActivatesCooldown : 0; // 0x75 (1)
};

// Class AIModule.BTDecorator_TimeLimit
struct UBTDecorator_TimeLimit : UBTDecorator {
	float TimeLimit; // 0x68 (4)
};

// Class AIModule.BTService_BlackboardBase
struct UBTService_BlackboardBase : UBTService {
	struct Unknown BlackboardKey; // 0x70 (40)
};

// Class AIModule.BTService_BlueprintBase
struct UBTService_BlueprintBase : UBTService {
	struct Unknown AIOwner; // 0x70 (8)
	struct Unknown ActorOwner; // 0x78 (8)
	char bShowPropertyDetails : 0; // 0x90 (1)
	char bShowEventDetails : 0; // 0x90 (1)

	void ReceiveTickAI(struct Unknown OwnerController, struct Unknown ControlledPawn, float DeltaSeconds); // Function AIModule.BTService_BlueprintBase.ReceiveTickAI(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveTick(struct Unknown OwnerActor, float DeltaSeconds); // Function AIModule.BTService_BlueprintBase.ReceiveTick(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveSearchStartAI(struct Unknown OwnerController, struct Unknown ControlledPawn); // Function AIModule.BTService_BlueprintBase.ReceiveSearchStartAI(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveSearchStart(struct Unknown OwnerActor); // Function AIModule.BTService_BlueprintBase.ReceiveSearchStart(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveDeactivationAI(struct Unknown OwnerController, struct Unknown ControlledPawn); // Function AIModule.BTService_BlueprintBase.ReceiveDeactivationAI(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveDeactivation(struct Unknown OwnerActor); // Function AIModule.BTService_BlueprintBase.ReceiveDeactivation(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveActivationAI(struct Unknown OwnerController, struct Unknown ControlledPawn); // Function AIModule.BTService_BlueprintBase.ReceiveActivationAI(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveActivation(struct Unknown OwnerActor); // Function AIModule.BTService_BlueprintBase.ReceiveActivation(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	char IsServiceActive(); // Function AIModule.BTService_BlueprintBase.IsServiceActive(Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FBEA40>
};

// Class AIModule.BTService_DefaultFocus
struct UBTService_DefaultFocus : UBTService_BlackboardBase {
	char FocusPriority; // 0x98 (1)
};

// Class AIModule.BTService_RunEQS
struct UBTService_RunEQS : UBTService_BlackboardBase {
	struct Unknown EQSRequest; // 0x98 (72)
};

// Class AIModule.BTTask_BlueprintBase
struct UBTTask_BlueprintBase : UBTTaskNode {
	struct Unknown AIOwner; // 0x70 (8)
	struct Unknown ActorOwner; // 0x78 (8)
	struct Unknown TickInterval; // 0x80 (8)
	char bShowPropertyDetails : 0; // 0xA0 (1)

	void SetFinishOnMessageWithId(struct FName MessageName, int32_t RequestID); // Function AIModule.BTTask_BlueprintBase.SetFinishOnMessageWithId(Final|Native|Protected|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FBEB50>
	void SetFinishOnMessage(struct FName MessageName); // Function AIModule.BTTask_BlueprintBase.SetFinishOnMessage(Final|Native|Protected|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FBEAD0>
	void ReceiveTickAI(struct Unknown OwnerController, struct Unknown ControlledPawn, float DeltaSeconds); // Function AIModule.BTTask_BlueprintBase.ReceiveTickAI(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveTick(struct Unknown OwnerActor, float DeltaSeconds); // Function AIModule.BTTask_BlueprintBase.ReceiveTick(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveExecuteAI(struct Unknown OwnerController, struct Unknown ControlledPawn); // Function AIModule.BTTask_BlueprintBase.ReceiveExecuteAI(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveExecute(struct Unknown OwnerActor); // Function AIModule.BTTask_BlueprintBase.ReceiveExecute(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveAbortAI(struct Unknown OwnerController, struct Unknown ControlledPawn); // Function AIModule.BTTask_BlueprintBase.ReceiveAbortAI(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveAbort(struct Unknown OwnerActor); // Function AIModule.BTTask_BlueprintBase.ReceiveAbort(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	char IsTaskExecuting(); // Function AIModule.BTTask_BlueprintBase.IsTaskExecuting(Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FBEAA0>
	char IsTaskAborting(); // Function AIModule.BTTask_BlueprintBase.IsTaskAborting(Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FBEA70>
	void FinishExecute(char bSuccess); // Function AIModule.BTTask_BlueprintBase.FinishExecute(Final|Native|Protected|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FBE9B0>
	void FinishAbort(); // Function AIModule.BTTask_BlueprintBase.FinishAbort(Final|Native|Protected|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FBE990>
};

// Class AIModule.BTTask_FinishWithResult
struct UBTTask_FinishWithResult : UBTTaskNode {
	char Result; // 0x70 (1)
};

// Class AIModule.BTTask_GameplayTaskBase
struct UBTTask_GameplayTaskBase : UBTTaskNode {
	char bWaitForGameplayTask : 0; // 0x70 (1)
};

// Class AIModule.BTTask_MakeNoise
struct UBTTask_MakeNoise : UBTTaskNode {
	float Loudnes; // 0x70 (4)
};

// Class AIModule.BTTask_MoveTo
struct UBTTask_MoveTo : UBTTask_BlackboardBase {
	float AcceptableRadius; // 0x98 (4)
	struct Unknown* FilterClass; // 0xA0 (8)
	float ObservedBlackboardValueTolerance; // 0xA8 (4)
	char bObserveBlackboardValue : 0; // 0xAC (1)
	char bAllowStrafe : 0; // 0xAC (1)
	char bAllowPartialPath : 0; // 0xAC (1)
	char bTrackMovingGoal : 0; // 0xAC (1)
	char bProjectGoalLocation : 0; // 0xAC (1)
	char b : 0; // 0xAC (1)
	char b : 0; // 0xAC (1)
	char bStopOnOverlap : 0; // 0xAC (1)
	char bStopOnOverlapNeedsUpdate : 0; // 0xAD (1)
};

// Class AIModule.BTTask_MoveDirectlyToward
struct UBTTask_MoveDirectlyToward : UBTTask_MoveTo {
	char bDisablePathUpdateOnGoalLocationChange : 0; // 0xB0 (1)
	char bProjectVectorGoalToNavigation : 0; // 0xB0 (1)
	char bUpdatedDeprecatedProperties : 0; // 0xB0 (1)
};

// Class AIModule.BTTask_PlayAnimation
struct UBTTask_PlayAnimation : UBTTaskNode {
	struct Unknown AnimationToPlay; // 0x70 (8)
	char bLooping : 0; // 0x78 (1)
	char bNonBlocking : 0; // 0x78 (1)
	struct Unknown MyOwnerComp; // 0x80 (8)
	struct Unknown CachedSkelMesh; // 0x88 (8)
};

// Class AIModule.BTTask_PlaySound
struct UBTTask_PlaySound : UBTTaskNode {
	struct Unknown SoundToPlay; // 0x70 (8)
};

// Class AIModule.BTTask_PushPawnAction
struct UBTTask_PushPawnAction : UBTTask_PawnActionBase {
	struct Unknown Action; // 0x70 (8)
};

// Class AIModule.BTTask_RotateToFaceBBEntry
struct UBTTask_RotateToFaceBBEntry : UBTTask_BlackboardBase {
	float Precision; // 0x98 (4)
};

// Class AIModule.BTTask_RunBehavior
struct UBTTask_RunBehavior : UBTTaskNode {
	struct Unknown BehaviorAsset; // 0x70 (8)
};

// Class AIModule.BTTask_RunBehaviorDynamic
struct UBTTask_RunBehaviorDynamic : UBTTaskNode {
	struct Unknown InjectionTag; // 0x70 (8)
	struct Unknown DefaultBehaviorAsset; // 0x78 (8)
	struct Unknown BehaviorAsset; // 0x80 (8)
};

// Class AIModule.BTTask_RunEQSQuery
struct UBTTask_RunEQSQuery : UBTTask_BlackboardBase {
	struct Unknown QueryTemplate; // 0x98 (8)
	struct TArray<Unknown> QueryParams; // 0xA0 (16)
	struct TArray<Unknown> QueryConfig; // 0xB0 (16)
	char RunMode; // 0xC0 (1)
	struct Unknown EQSQueryBlackboardKey; // 0xC8 (40)
	char bUseBBKey : 0; // 0xF0 (1)
	struct Unknown EQSRequest; // 0xF8 (72)
};

// Class AIModule.BTTask_SetTagCooldown
struct UBTTask_SetTagCooldown : UBTTaskNode {
	struct Unknown CooldownTag; // 0x70 (8)
	char bAddToExistingDuration : 0; // 0x78 (1)
	float CooldownDuration; // 0x7C (4)
};

// Class AIModule.BTTask_Wait
struct UBTTask_Wait : UBTTaskNode {
	float WaitTime; // 0x70 (4)
	float RandomDeviation; // 0x74 (4)
};

// Class AIModule.BTTask_WaitBlackboardTime
struct UBTTask_WaitBlackboardTime : UBTTask_Wait {
	struct Unknown BlackboardKey; // 0x78 (40)
};

// Class AIModule.PathFollowingComponent
struct UPathFollowingComponent : UActorComponent {
	struct Unknown MovementComp; // 0xE8 (8)
	struct Unknown MyNavData; // 0xF8 (8)

	void OnNavDataRegistered(struct Unknown NavData); // Function AIModule.PathFollowingComponent.OnNavDataRegistered(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FCA000>
	void OnActorBump(struct Unknown SelfActor, struct Unknown OtherActor, struct Unknown NormalImpulse, struct Unknown& Hit); // Function AIModule.PathFollowingComponent.OnActorBump(Native|Public|HasOutParms|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC9E70>
	struct Unknown GetPathDestination(); // Function AIModule.PathFollowingComponent.GetPathDestination(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC9AE0>
	char GetPathActionType(); // Function AIModule.PathFollowingComponent.GetPathActionType(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC9AB0>
};

// Class AIModule.CrowdFollowingComponent
struct UCrowdFollowingComponent : UPathFollowingComponent {
	struct Unknown CharacterMovement; // 0x260 (8)
	struct Unknown CrowdAgentMoveDirection; // 0x268 (12)

	void SuspendCrowdSteering(char bSuspend); // Function AIModule.CrowdFollowingComponent.SuspendCrowdSteering(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FBEC10>
};

// Class AIModule.CrowdManager
struct UCrowdManager : UCrowdManagerBase {
	struct Unknown MyNavData; // 0x28 (8)
	struct TArray<Unknown> AvoidanceConfig; // 0x30 (16)
	struct TArray<Unknown> SamplingPatterns; // 0x40 (16)
	int32_t MaxAgents; // 0x50 (4)
	float MaxAgentRadius; // 0x54 (4)
	int32_t MaxAvoidedAgents; // 0x58 (4)
	int32_t MaxAvoidedWalls; // 0x5C (4)
	float NavmeshCheckInterval; // 0x60 (4)
	float PathOptimizationInterval; // 0x64 (4)
	float SeparationDirClamp; // 0x68 (4)
	float PathOffsetRadiusMultiplier; // 0x6C (4)
	char b : 0; // 0x70 (1)
};

// Class AIModule.EnvQuery
struct UEnvQuery : UDataAsset {
	struct FName QueryName; // 0x30 (8)
	struct TArray<Unknown> options; // 0x38 (16)
};

// Class AIModule.EnvQueryNode
struct UEnvQueryNode : Object {
	int32_t VerNum; // 0x28 (4)
};

// Class AIModule.EnvQueryGenerator
struct UEnvQueryGenerator : UEnvQueryNode {
	struct FString OptionName; // 0x30 (16)
	struct Unknown* ItemType; // 0x40 (8)
	char bAutoSortTests : 0; // 0x48 (1)
};

// Class AIModule.EnvQueryGenerator_ActorsOfClass
struct UEnvQueryGenerator_ActorsOfClass : UEnvQueryGenerator {
	struct Unknown* SearchedActorClass; // 0x50 (8)
	struct Unknown GenerateOnlyActorsInRadius; // 0x58 (56)
	struct Unknown SearchRadius; // 0x90 (56)
	struct Unknown* SearchCenter; // 0xC8 (8)
};

// Class AIModule.EnvQueryGenerator_BlueprintBase
struct UEnvQueryGenerator_BlueprintBase : UEnvQueryGenerator {
	struct FText GeneratorsActionDescription; // 0x50 (24)
	struct Unknown* Context; // 0x68 (8)
	struct Unknown* GeneratedItemType; // 0x70 (8)

	struct Unknown GetQuerier(); // Function AIModule.EnvQueryGenerator_BlueprintBase.GetQuerier(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC22B0>
	void DoItemGeneration(struct TArray<Unknown>& ContextLocations); // Function AIModule.EnvQueryGenerator_BlueprintBase.DoItemGeneration(Event|Public|HasOutParms|BlueprintEvent|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void AddGeneratedVector(struct Unknown GeneratedVector); // Function AIModule.EnvQueryGenerator_BlueprintBase.AddGeneratedVector(Final|Native|Public|HasDefaults|BlueprintCallable|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC2190>
	void AddGeneratedActor(struct Unknown GeneratedActor); // Function AIModule.EnvQueryGenerator_BlueprintBase.AddGeneratedActor(Final|Native|Public|BlueprintCallable|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC2110>
};

// Class AIModule.EnvQueryGenerator_Composite
struct UEnvQueryGenerator_Composite : UEnvQueryGenerator {
	struct TArray<Unknown> Generators; // 0x50 (16)
	char bAllowDifferentItemTypes : 0; // 0x60 (1)
	char bHasMatchingItemType : 0; // 0x60 (1)
	struct Unknown* ForcedItemType; // 0x68 (8)
};

// Class AIModule.EnvQueryGenerator_ProjectedPoints
struct UEnvQueryGenerator_ProjectedPoints : UEnvQueryGenerator {
	struct Unknown ProjectionData; // 0x50 (48)
};

// Class AIModule.EnvQueryGenerator_Cone
struct UEnvQueryGenerator_Cone : UEnvQueryGenerator_ProjectedPoints {
	struct Unknown AlignedPointsDistance; // 0x80 (56)
	struct Unknown ConeDegrees; // 0xB8 (56)
	struct Unknown AngleStep; // 0xF0 (56)
	struct Unknown Range; // 0x128 (56)
	struct Unknown* CenterActor; // 0x160 (8)
	char bIncludeContextLocation : 0; // 0x168 (1)
};

// Class AIModule.EnvQueryGenerator_CurrentLocation
struct UEnvQueryGenerator_CurrentLocation : UEnvQueryGenerator {
	struct Unknown* QueryContext; // 0x50 (8)
};

// Class AIModule.EnvQueryGenerator_Donut
struct UEnvQueryGenerator_Donut : UEnvQueryGenerator_ProjectedPoints {
	struct Unknown InnerRadius; // 0x80 (56)
	struct Unknown OuterRadius; // 0xB8 (56)
	struct Unknown NumberOfRings; // 0xF0 (56)
	struct Unknown PointsPerRing; // 0x128 (56)
	struct Unknown ArcDirection; // 0x160 (32)
	struct Unknown ArcAngle; // 0x180 (56)
	char bUseSpiralPattern : 0; // 0x1B8 (1)
	struct Unknown* Center; // 0x1C0 (8)
	char bDefineArc : 0; // 0x1C8 (1)
};

// Class AIModule.EnvQueryGenerator_OnCircle
struct UEnvQueryGenerator_OnCircle : UEnvQueryGenerator_ProjectedPoints {
	struct Unknown CircleRadius; // 0x80 (56)
	struct Unknown SpaceBetween; // 0xB8 (56)
	struct Unknown NumberOfPoints; // 0xF0 (56)
	enum class Unknow PointOnCircleSpacingMethod; // 0x128 (1)
	struct Unknown ArcDirection; // 0x130 (32)
	struct Unknown ArcAngle; // 0x150 (56)
	float AngleRadians; // 0x188 (4)
	struct Unknown* CircleCenter; // 0x190 (8)
	char bIgnoreAnyContextActorsWhenGeneratingCircle : 0; // 0x198 (1)
	struct Unknown CircleCenterZOffset; // 0x1A0 (56)
	struct Unknown TraceData; // 0x1D8 (48)
	char bDefineArc : 0; // 0x208 (1)
};

// Class AIModule.EnvQueryGenerator_SimpleGrid
struct UEnvQueryGenerator_SimpleGrid : UEnvQueryGenerator_ProjectedPoints {
	struct Unknown GridSize; // 0x80 (56)
	struct Unknown SpaceBetween; // 0xB8 (56)
	struct Unknown* GenerateAround; // 0xF0 (8)
};

// Class AIModule.EnvQueryGenerator_PathingGrid
struct UEnvQueryGenerator_PathingGrid : UEnvQueryGenerator_SimpleGrid {
	struct Unknown PathToItem; // 0xF8 (56)
	struct Unknown* NavigationFilter; // 0x130 (8)
	struct Unknown ScanRangeMultiplier; // 0x138 (56)
};

// Class AIModule.EnvQueryInstanceBlueprintWrapper
struct UEnvQueryInstanceBlueprintWrapper : Object {
	int32_t QueryID; // 0x30 (4)
	struct Unknown* ItemType; // 0x58 (8)
	int32_t OptionIndex; // 0x60 (4)
	struct FMulticastInlineDelegate OnQueryFinishedEvent; // 0x68 (16)

	void SetNamedParam(struct FName ParamName, float Value); // Function AIModule.EnvQueryInstanceBlueprintWrapper.SetNamedParam(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC26E0>
	struct TArray<Unknown> GetResultsAsLocations(); // Function AIModule.EnvQueryInstanceBlueprintWrapper.GetResultsAsLocations(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC24E0>
	struct TArray<Unknown> GetResultsAsActors(); // Function AIModule.EnvQueryInstanceBlueprintWrapper.GetResultsAsActors(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC2460>
	char GetQueryResultsAsLocations(struct TArray<Unknown>& ResultLocations); // Function AIModule.EnvQueryInstanceBlueprintWrapper.GetQueryResultsAsLocations(Final|Native|Public|HasOutParms|BlueprintCallable|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC23A0>
	char GetQueryResultsAsActors(struct TArray<Unknown>& ResultActors); // Function AIModule.EnvQueryInstanceBlueprintWrapper.GetQueryResultsAsActors(Final|Native|Public|HasOutParms|BlueprintCallable|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC22E0>
	float GetItemScore(int32_t ItemIndex); // Function AIModule.EnvQueryInstanceBlueprintWrapper.GetItemScore(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC2220>
	void EQSQueryDoneSignature__DelegateSignature(struct Unknown QueryInstance, char QueryStatus); // DelegateFunction AIModule.EnvQueryInstanceBlueprintWrapper.EQSQueryDoneSignature__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// Class AIModule.EnvQueryManager
struct UEnvQueryManager : UAISubsystem {
	struct TArray<Unknown> InstanceCache; // 0xA8 (16)
	struct TArray<Unknown> LocalContexts; // 0xB8 (16)
	struct TArray<Unknown> GCShieldedWrappers; // 0xC8 (16)
	float MaxAllowedTestingTime; // 0x12C (4)
	char bTestQueriesUsingBreadth : 0; // 0x130 (1)
	int32_t QueryCountWarningThreshold; // 0x134 (4)
	double QueryCountWarningInterval; // 0x138 (8)

	struct Unknown RunEQSQuery(struct Unknown WorldContextObject, struct Unknown QueryTemplate, struct Unknown Querier, char RunMode, struct Unknown* WrapperClass); // Function AIModule.EnvQueryManager.RunEQSQuery(Final|Native|Static|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC2560>
};

// Class AIModule.EnvQueryOption
struct UEnvQueryOption : Object {
	struct Unknown Generator; // 0x28 (8)
	struct TArray<Unknown> Tests; // 0x30 (16)
};

// Class AIModule.EnvQueryTest
struct UEnvQueryTest : UEnvQueryNode {
	int32_t TestOrder; // 0x30 (4)
	char TestPurpose; // 0x34 (1)
	struct FString TestComment; // 0x38 (16)
	char MultipleContextFilterOp; // 0x48 (1)
	char MultipleContextScoreOp; // 0x49 (1)
	char FilterType; // 0x4A (1)
	struct Unknown BoolValue; // 0x50 (56)
	struct Unknown FloatValueMin; // 0x88 (56)
	struct Unknown FloatValueMax; // 0xC0 (56)
	char ScoringEquation; // 0xF9 (1)
	char ClampMinType; // 0xFA (1)
	char ClampMaxType; // 0xFB (1)
	enum class Unknow NormalizationType; // 0xFC (1)
	struct Unknown ScoreClampMin; // 0x100 (56)
	struct Unknown ScoreClampMax; // 0x138 (56)
	struct Unknown ScoringFactor; // 0x170 (56)
	struct Unknown ReferenceValue; // 0x1A8 (56)
	char bDefineReferenceValue : 0; // 0x1E0 (1)
	char bWorkOnFloatValues : 0; // 0x1F0 (1)
};

// Class AIModule.EnvQueryTest_Distance
struct UEnvQueryTest_Distance : UEnvQueryTest {
	char TestMode; // 0x1F8 (1)
	struct Unknown* DistanceTo; // 0x200 (8)
};

// Class AIModule.EnvQueryTest_Dot
struct UEnvQueryTest_Dot : UEnvQueryTest {
	struct Unknown LineA; // 0x1F8 (32)
	struct Unknown LineB; // 0x218 (32)
	enum class Unknow TestMode; // 0x238 (1)
	char bAbsoluteValue : 0; // 0x239 (1)
};

// Class AIModule.EnvQueryTest_GameplayTags
struct UEnvQueryTest_GameplayTags : UEnvQueryTest {
	struct Unknown TagQueryToMatch; // 0x1F8 (72)
	char bUpdatedToUseQuery : 0; // 0x240 (1)
	enum class Unknow TagsToMatch; // 0x241 (1)
	struct Unknown GameplayTags; // 0x248 (32)
};

// Class AIModule.EnvQueryTest_Overlap
struct UEnvQueryTest_Overlap : UEnvQueryTest {
	struct Unknown OverlapData; // 0x1F8 (32)
};

// Class AIModule.EnvQueryTest_Pathfinding
struct UEnvQueryTest_Pathfinding : UEnvQueryTest {
	char TestMode; // 0x1F8 (1)
	struct Unknown* Context; // 0x200 (8)
	struct Unknown PathFromContext; // 0x208 (56)
	struct Unknown SkipUnreachable; // 0x240 (56)
	struct Unknown* FilterClass; // 0x278 (8)
};

// Class AIModule.EnvQueryTest_PathfindingBatch
struct UEnvQueryTest_PathfindingBatch : UEnvQueryTest_Pathfinding {
	struct Unknown ScanRangeMultiplier; // 0x280 (56)
};

// Class AIModule.EnvQueryTest_Project
struct UEnvQueryTest_Project : UEnvQueryTest {
	struct Unknown ProjectionData; // 0x1F8 (48)
};

// Class AIModule.EnvQueryTest_Trace
struct UEnvQueryTest_Trace : UEnvQueryTest {
	struct Unknown TraceData; // 0x1F8 (48)
	struct Unknown TraceFromContext; // 0x228 (56)
	struct Unknown ItemHeightOffset; // 0x260 (56)
	struct Unknown ContextHeightOffset; // 0x298 (56)
	struct Unknown* Context; // 0x2D0 (8)
};

// Class AIModule.EnvQueryTest_Volume
struct UEnvQueryTest_Volume : UEnvQueryTest {
	struct Unknown* VolumeContext; // 0x1F8 (8)
	struct Unknown* VolumeClass; // 0x200 (8)
	char bDoComplexVolumeTest : 0; // 0x208 (1)
};

// Class AIModule.EQSTestingPawn
struct AEQSTestingPawn : ACharacter {
	struct Unknown QueryTemplate; // 0x5E0 (8)
	struct TArray<Unknown> QueryParams; // 0x5E8 (16)
	struct TArray<Unknown> QueryConfig; // 0x5F8 (16)
	float TimeLimitPerStep; // 0x608 (4)
	int32_t StepToDebugDraw; // 0x60C (4)
	enum class Unknow HighlightMode; // 0x610 (1)
	char bDrawLabels : 0; // 0x614 (1)
	char bDrawFailedItems : 0; // 0x614 (1)
	char b : 0; // 0x614 (1)
	char bShouldBeVisibleInGame : 0; // 0x614 (1)
	char bTickDuringGame : 0; // 0x614 (1)
	char QueryingMode; // 0x618 (1)
	struct Unknown NavAgentProperties; // 0x620 (48)
};

// Class AIModule.GridPathFollowingComponent
struct UGridPathFollowingComponent : UPathFollowingComponent {
	struct Unknown GridManager; // 0x258 (8)
};

// Class AIModule.NavLinkProxy
struct ANavLinkProxy : UActor {
	struct TArray<Unknown> PointLinks; // 0x320 (16)
	struct TArray<Unknown> SegmentLinks; // 0x330 (16)
	struct Unknown SmartLinkComp; // 0x340 (8)
	char bSmartLinkIsRelevant : 0; // 0x348 (1)
	struct FMulticastInlineDelegate OnSmartLinkReached; // 0x350 (16)

	void SetSmartLinkEnabled(char bEnabled); // Function AIModule.NavLinkProxy.SetSmartLinkEnabled(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC7A30>
	void ResumePathFollowing(struct Unknown Agent); // Function AIModule.NavLinkProxy.ResumePathFollowing(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC78E0>
	void ReceiveSmartLinkReached(struct Unknown Agent, struct Unknown& Destination); // Function AIModule.NavLinkProxy.ReceiveSmartLinkReached(Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	char IsSmartLinkEnabled(); // Function AIModule.NavLinkProxy.IsSmartLinkEnabled(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC77C0>
	char HasMovingAgents(); // Function AIModule.NavLinkProxy.HasMovingAgents(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC7790>
};

// Class AIModule.PawnAction
struct UPawnAction : Object {
	struct Unknown ChildAction; // 0x28 (8)
	struct Unknown ParentAction; // 0x30 (8)
	struct Unknown OwnerComponent; // 0x38 (8)
	struct Unknown Instigator; // 0x40 (8)
	struct Unknown BrainComp; // 0x48 (8)
	char bAllowNewSameClassInstance : 0; // 0x80 (1)
	char b : 0; // 0x80 (1)
	char bShouldPauseMovement : 0; // 0x80 (1)
	char bAlwaysNotifyOnFinished : 0; // 0x80 (1)

	char GetActionPriority(); // Function AIModule.PawnAction.GetActionPriority(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1895B80>
	void Finish(char WithResult); // Function AIModule.PawnAction.Finish(Native|Protected|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x338B6E0>
	struct Unknown CreateActionInstance(struct Unknown WorldContextObject, struct Unknown* ActionClass); // Function AIModule.PawnAction.CreateActionInstance(Final|Native|Static|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC99F0>
};

// Class AIModule.PawnAction_Move
struct UPawnAction_Move : UPawnAction {
	struct Unknown GoalActor; // 0x98 (8)
	struct Unknown GoalLocation; // 0xA0 (12)
	float AcceptableRadius; // 0xAC (4)
	struct Unknown* FilterClass; // 0xB0 (8)
	char bAllowStrafe : 0; // 0xB8 (1)
	char bFinishOnOverlap : 0; // 0xB8 (1)
	char bUsePathfinding : 0; // 0xB8 (1)
	char bAllowPartialPath : 0; // 0xB8 (1)
	char bProjectGoalToNavigation : 0; // 0xB8 (1)
	char bUpdatePathToGoal : 0; // 0xB8 (1)
	char bAbortChildActionOnPathChange : 0; // 0xB8 (1)
};

// Class AIModule.PawnAction_Repeat
struct UPawnAction_Repeat : UPawnAction {
	struct Unknown ActionToRepeat; // 0x98 (8)
	struct Unknown RecentActionCopy; // 0xA0 (8)
	char ChildFailureHandlingMode; // 0xA8 (1)
};

// Class AIModule.PawnAction_Sequence
struct UPawnAction_Sequence : UPawnAction {
	struct TArray<Unknown> ActionSequence; // 0x98 (16)
	char ChildFailureHandlingMode; // 0xA8 (1)
	struct Unknown RecentActionCopy; // 0xB0 (8)
};

// Class AIModule.PawnAction_Wait
struct UPawnAction_Wait : UPawnAction {
	float TimeToWait; // 0x98 (4)
};

// Class AIModule.PawnActionsComponent
struct UPawnActionsComponent : UActorComponent {
	struct Unknown ControlledPawn; // 0xB0 (8)
	struct TArray<Unknown> ActionStacks; // 0xB8 (16)
	struct TArray<Unknown> ActionEvents; // 0xC8 (16)
	struct Unknown CurrentAction; // 0xD8 (8)

	char K2_PushAction(struct Unknown NewAction, char Priority, struct Unknown Instigator); // Function AIModule.PawnActionsComponent.K2_PushAction(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC9D70>
	char K2_PerformAction(struct Unknown Pawn, struct Unknown Action, char Priority); // Function AIModule.PawnActionsComponent.K2_PerformAction(Final|Native|Static|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC9C80>
	char K2_ForceAbortAction(struct Unknown ActionToAbort); // Function AIModule.PawnActionsComponent.K2_ForceAbortAction(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC9BF0>
	char K2_AbortAction(struct Unknown ActionToAbort); // Function AIModule.PawnActionsComponent.K2_AbortAction(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FC9B60>
};

// Class AIModule.PawnSensingComponent
struct UPawnSensingComponent : UActorComponent {
	float HearingThreshold; // 0xB0 (4)
	float LOSHearingThreshold; // 0xB4 (4)
	float SightRadius; // 0xB8 (4)
	float SensingInterval; // 0xBC (4)
	float HearingMaxSoundAge; // 0xC0 (4)
	char bEnableSensingUpdates : 0; // 0xC4 (1)
	char bOnlySensePlayers : 0; // 0xC4 (1)
	char bSeePawns : 0; // 0xC4 (1)
	char bHearNoises : 0; // 0xC4 (1)
	struct FMulticastInlineDelegate OnSeePawn; // 0xD0 (16)
	struct FMulticastInlineDelegate OnHearNoise; // 0xE0 (16)
	float PeripheralVisionAngle; // 0xF0 (4)
	float PeripheralVisionCosine; // 0xF4 (4)

	void SetSensingUpdatesEnabled(char bEnabled); // Function AIModule.PawnSensingComponent.SetSensingUpdatesEnabled(BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FCA180>
	void SetSensingInterval(float NewSensingInterval); // Function AIModule.PawnSensingComponent.SetSensingInterval(BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FCA100>
	void SetPeripheralVisionAngle(float NewPeripheralVisionAngle); // Function AIModule.PawnSensingComponent.SetPeripheralVisionAngle(BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3FCA080>
	void SeePawnDelegate__DelegateSignature(struct Unknown Pawn); // DelegateFunction AIModule.PawnSensingComponent.SeePawnDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
