// Enum AIModule.EPathFollowingResult
enum class EPathFollowingResult : uint8 {
	EPathFollowingResult = 0,
	EPathFollowingResult = 1,
	EPathFollowingResult = 2,
	EPathFollowingResult = 3,
	EPathFollowingResult = 4,
	EPathFollowingResult = 5,
	EPathFollowingResult = 6
};

// Enum AIModule.EEnvQueryStatus
enum class EEnvQueryStatus : uint8 {
	EEnvQueryStatus = 0,
	EEnvQueryStatus = 1,
	EEnvQueryStatus = 2,
	EEnvQueryStatus = 3,
	EEnvQueryStatus = 4,
	EEnvQueryStatus = 5,
	EEnvQueryStatus = 6
};

// Enum AIModule.EAISenseNotifyType
enum class EAISenseNotifyType : uint8 {
	EAISenseNotifyType = 0,
	EAISenseNotifyType = 1,
	EAISenseNotifyType = 2
};

// Enum AIModule.EAITaskPriority
enum class EAITaskPriority : uint8 {
	EAITaskPriority = 0,
	EAITaskPriority = 64,
	EAITaskPriority = 127,
	EAITaskPriority = 192,
	EAITaskPriority = 254,
	EAITaskPriority = 255
};

// Enum AIModule.EGenericAICheck
enum class EGenericAICheck : uint8 {
	EGenericAICheck = 0,
	EGenericAICheck = 1,
	EGenericAICheck = 2,
	EGenericAICheck = 3,
	EGenericAICheck = 4,
	EGenericAICheck = 5,
	EGenericAICheck = 6,
	EGenericAICheck = 7
};

// Enum AIModule.EAILockSource
enum class EAILockSource : uint8 {
	EAILockSource = 0,
	EAILockSource = 1,
	EAILockSource = 2,
	EAILockSource = 3,
	EAILockSource = 4
};

// Enum AIModule.EAIRequestPriority
enum class EAIRequestPriority : uint8 {
	EAIRequestPriority = 0,
	EAIRequestPriority = 1,
	EAIRequestPriority = 2,
	EAIRequestPriority = 3,
	EAIRequestPriority = 4,
	EAIRequestPriority = 5
};

// Enum AIModule.EPawnActionEventType
enum class EPawnActionEventType : uint8 {
	EPawnActionEventType = 0,
	EPawnActionEventType = 1,
	EPawnActionEventType = 2,
	EPawnActionEventType = 3,
	EPawnActionEventType = 4,
	EPawnActionEventType = 5,
	EPawnActionEventType = 6
};

// Enum AIModule.EPawnActionResult
enum class EPawnActionResult : uint8 {
	EPawnActionResult = 0,
	EPawnActionResult = 1,
	EPawnActionResult = 2,
	EPawnActionResult = 3,
	EPawnActionResult = 4,
	EPawnActionResult = 5
};

// Enum AIModule.EPawnActionAbortState
enum class EPawnActionAbortState : uint8 {
	EPawnActionAbortState = 0,
	EPawnActionAbortState = 1,
	EPawnActionAbortState = 2,
	EPawnActionAbortState = 3,
	EPawnActionAbortState = 4,
	EPawnActionAbortState = 5
};

// Enum AIModule.FAIDistanceType
enum class FAIDistanceType : uint8 {
	FAIDistanceType = 0,
	FAIDistanceType = 1,
	FAIDistanceType = 2,
	FAIDistanceType = 3
};

// Enum AIModule.EAIOptionFlag
enum class EAIOptionFlag : uint8 {
	EAIOptionFlag = 0,
	EAIOptionFlag = 1,
	EAIOptionFlag = 2,
	EAIOptionFlag = 3
};

// Enum AIModule.EBTFlowAbortMode
enum class EBTFlowAbortMode : uint8 {
	EBTFlowAbortMode = 0,
	EBTFlowAbortMode = 1,
	EBTFlowAbortMode = 2,
	EBTFlowAbortMode = 3,
	EBTFlowAbortMode = 4
};

// Enum AIModule.EBTNodeResult
enum class EBTNodeResult : uint8 {
	EBTNodeResult = 0,
	EBTNodeResult = 1,
	EBTNodeResult = 2,
	EBTNodeResult = 3,
	EBTNodeResult = 4
};

// Enum AIModule.ETextKeyOperation
enum class ETextKeyOperation : uint8 {
	ETextKeyOperation = 0,
	ETextKeyOperation = 1,
	ETextKeyOperation = 2,
	ETextKeyOperation = 3,
	ETextKeyOperation = 4
};

// Enum AIModule.EArithmeticKeyOperation
enum class EArithmeticKeyOperation : uint8 {
	EArithmeticKeyOperation = 0,
	EArithmeticKeyOperation = 1,
	EArithmeticKeyOperation = 2,
	EArithmeticKeyOperation = 3,
	EArithmeticKeyOperation = 4,
	EArithmeticKeyOperation = 5,
	EArithmeticKeyOperation = 6
};

// Enum AIModule.EBasicKeyOperation
enum class EBasicKeyOperation : uint8 {
	EBasicKeyOperation = 0,
	EBasicKeyOperation = 1,
	EBasicKeyOperation = 2
};

// Enum AIModule.EBTParallelMode
enum class EBTParallelMode : uint8 {
	EBTParallelMode = 0,
	EBTParallelMode = 1,
	EBTParallelMode = 2
};

// Enum AIModule.EBTDecoratorLogic
enum class EBTDecoratorLogic : uint8 {
	EBTDecoratorLogic = 0,
	EBTDecoratorLogic = 1,
	EBTDecoratorLogic = 2,
	EBTDecoratorLogic = 3,
	EBTDecoratorLogic = 4,
	EBTDecoratorLogic = 5
};

// Enum AIModule.EBTChildIndex
enum class EBTChildIndex : uint8 {
	EBTChildIndex = 0,
	EBTChildIndex = 1,
	EBTChildIndex = 2
};

// Enum AIModule.EBTBlackboardRestart
enum class EBTBlackboardRestart : uint8 {
	EBTBlackboardRestart = 0,
	EBTBlackboardRestart = 1,
	EBTBlackboardRestart = 2
};

// Enum AIModule.EBlackBoardEntryComparison
enum class EBlackBoardEntryComparison : uint8 {
	EBlackBoardEntryComparison = 0,
	EBlackBoardEntryComparison = 1,
	EBlackBoardEntryComparison = 2
};

// Enum AIModule.EPathExistanceQueryType
enum class EPathExistanceQueryType : uint8 {
	EPathExistanceQueryType = 0,
	EPathExistanceQueryType = 1,
	EPathExistanceQueryType = 2,
	EPathExistanceQueryType = 3
};

// Enum AIModule.EPointOnCircleSpacingMethod
enum class EPointOnCircleSpacingMethod : uint8 {
	EPointOnCircleSpacingMethod = 0,
	EPointOnCircleSpacingMethod = 1,
	EPointOnCircleSpacingMethod = 2
};

// Enum AIModule.EEQSNormalizationType
enum class EEQSNormalizationType : uint8 {
	EEQSNormalizationType = 0,
	EEQSNormalizationType = 1,
	EEQSNormalizationType = 2
};

// Enum AIModule.EEnvTestDistance
enum class EEnvTestDistance : uint8 {
	EEnvTestDistance = 0,
	EEnvTestDistance = 1,
	EEnvTestDistance = 2,
	EEnvTestDistance = 3,
	EEnvTestDistance = 4
};

// Enum AIModule.EEnvTestDot
enum class EEnvTestDot : uint8 {
	EEnvTestDot = 0,
	EEnvTestDot = 1,
	EEnvTestDot = 2
};

// Enum AIModule.EEnvTestPathfinding
enum class EEnvTestPathfinding : uint8 {
	EEnvTestPathfinding = 0,
	EEnvTestPathfinding = 1,
	EEnvTestPathfinding = 2,
	EEnvTestPathfinding = 3
};

// Enum AIModule.EEnvQueryTestClamping
enum class EEnvQueryTestClamping : uint8 {
	EEnvQueryTestClamping = 0,
	EEnvQueryTestClamping = 1,
	EEnvQueryTestClamping = 2,
	EEnvQueryTestClamping = 3
};

// Enum AIModule.EEnvDirection
enum class EEnvDirection : uint8 {
	EEnvDirection = 0,
	EEnvDirection = 1,
	EEnvDirection = 2
};

// Enum AIModule.EEnvOverlapShape
enum class EEnvOverlapShape : uint8 {
	EEnvOverlapShape = 0,
	EEnvOverlapShape = 1,
	EEnvOverlapShape = 2,
	EEnvOverlapShape = 3
};

// Enum AIModule.EEnvTraceShape
enum class EEnvTraceShape : uint8 {
	EEnvTraceShape = 0,
	EEnvTraceShape = 1,
	EEnvTraceShape = 2,
	EEnvTraceShape = 3,
	EEnvTraceShape = 4
};

// Enum AIModule.EEnvQueryTrace
enum class EEnvQueryTrace : uint8 {
	EEnvQueryTrace = 0,
	EEnvQueryTrace = 1,
	EEnvQueryTrace = 2,
	EEnvQueryTrace = 3,
	EEnvQueryTrace = 4
};

// Enum AIModule.EAIParamType
enum class EAIParamType : uint8 {
	EAIParamType = 0,
	EAIParamType = 1,
	EAIParamType = 2,
	EAIParamType = 3
};

// Enum AIModule.EEnvQueryParam
enum class EEnvQueryParam : uint8 {
	EEnvQueryParam = 0,
	EEnvQueryParam = 1,
	EEnvQueryParam = 2,
	EEnvQueryParam = 3
};

// Enum AIModule.EEnvQueryRunMode
enum class EEnvQueryRunMode : uint8 {
	EEnvQueryRunMode = 0,
	EEnvQueryRunMode = 1,
	EEnvQueryRunMode = 2,
	EEnvQueryRunMode = 3,
	EEnvQueryRunMode = 4
};

// Enum AIModule.EEnvTestScoreOperator
enum class EEnvTestScoreOperator : uint8 {
	EEnvTestScoreOperator = 0,
	EEnvTestScoreOperator = 1,
	EEnvTestScoreOperator = 2,
	EEnvTestScoreOperator = 3,
	EEnvTestScoreOperator = 4
};

// Enum AIModule.EEnvTestFilterOperator
enum class EEnvTestFilterOperator : uint8 {
	EEnvTestFilterOperator = 0,
	EEnvTestFilterOperator = 1,
	EEnvTestFilterOperator = 2
};

// Enum AIModule.EEnvTestCost
enum class EEnvTestCost : uint8 {
	EEnvTestCost = 0,
	EEnvTestCost = 1,
	EEnvTestCost = 2,
	EEnvTestCost = 3
};

// Enum AIModule.EEnvTestWeight
enum class EEnvTestWeight : uint8 {
	EEnvTestWeight = 0,
	EEnvTestWeight = 1,
	EEnvTestWeight = 2,
	EEnvTestWeight = 3,
	EEnvTestWeight = 4,
	EEnvTestWeight = 5,
	EEnvTestWeight = 6
};

// Enum AIModule.EEnvTestScoreEquation
enum class EEnvTestScoreEquation : uint8 {
	EEnvTestScoreEquation = 0,
	EEnvTestScoreEquation = 1,
	EEnvTestScoreEquation = 2,
	EEnvTestScoreEquation = 3,
	EEnvTestScoreEquation = 4,
	EEnvTestScoreEquation = 5
};

// Enum AIModule.EEnvTestFilterType
enum class EEnvTestFilterType : uint8 {
	EEnvTestFilterType = 0,
	EEnvTestFilterType = 1,
	EEnvTestFilterType = 2,
	EEnvTestFilterType = 3,
	EEnvTestFilterType = 4
};

// Enum AIModule.EEnvTestPurpose
enum class EEnvTestPurpose : uint8 {
	EEnvTestPurpose = 0,
	EEnvTestPurpose = 1,
	EEnvTestPurpose = 2,
	EEnvTestPurpose = 3
};

// Enum AIModule.EEnvQueryHightlightMode
enum class EEnvQueryHightlightMode : uint8 {
	EEnvQueryHightlightMode = 0,
	EEnvQueryHightlightMode = 1,
	EEnvQueryHightlightMode = 2,
	EEnvQueryHightlightMode = 3
};

// Enum AIModule.ETeamAttitude
enum class ETeamAttitude : uint8 {
	ETeamAttitude = 0,
	ETeamAttitude = 1,
	ETeamAttitude = 2,
	ETeamAttitude = 3
};

// Enum AIModule.EPathFollowingRequestResult
enum class EPathFollowingRequestResult : uint8 {
	EPathFollowingRequestResult = 0,
	EPathFollowingRequestResult = 1,
	EPathFollowingRequestResult = 2,
	EPathFollowingRequestResult = 3
};

// Enum AIModule.EPathFollowingAction
enum class EPathFollowingAction : uint8 {
	EPathFollowingAction = 0,
	EPathFollowingAction = 1,
	EPathFollowingAction = 2,
	EPathFollowingAction = 3,
	EPathFollowingAction = 4,
	EPathFollowingAction = 5
};

// Enum AIModule.EPathFollowingStatus
enum class EPathFollowingStatus : uint8 {
	EPathFollowingStatus = 0,
	EPathFollowingStatus = 1,
	EPathFollowingStatus = 2,
	EPathFollowingStatus = 3,
	EPathFollowingStatus = 4
};

// Enum AIModule.EPawnActionFailHandling
enum class EPawnActionFailHandling : uint8 {
	EPawnActionFailHandling = 0,
	EPawnActionFailHandling = 1,
	EPawnActionFailHandling = 2
};

// Enum AIModule.EPawnSubActionTriggeringPolicy
enum class EPawnSubActionTriggeringPolicy : uint8 {
	EPawnSubActionTriggeringPolicy = 0,
	EPawnSubActionTriggeringPolicy = 1,
	EPawnSubActionTriggeringPolicy = 2
};

// Enum AIModule.EPawnActionMoveMode
enum class EPawnActionMoveMode : uint8 {
	EPawnActionMoveMode = 0,
	EPawnActionMoveMode = 1,
	EPawnActionMoveMode = 2
};

// Class AIModule.BTNode
struct UBTNode : Object {
	struct FString NodeName; //  0x30 Size(10)
	Unknown TreeAsset; //  0x40 Size(8)
	Unknown ParentNode; //  0x48 Size(8)
};

// Class AIModule.BTTaskNode
struct UBTTaskNode : UBTNode {
	Unknown Services; //  0x58 Size(10)
	char bIgnoreRestartSelf; //  0x68 Size(1)
};

// Class AIModule.BTTask_BlackboardBase
struct UBTTask_BlackboardBase : UBTTaskNode {
	Unknown BlackboardKey; //  0x70 Size(28)
};

// Class AIModule.AIController
struct AAIController : AController {
	char bStartAILogicOnPossess; //  0x3e8 Size(1)
	char bStopAILogicOnUnposses; //  0x3e8 Size(1)
	char bLOSflag; //  0x3e8 Size(1)
	char bSkipExtraLOSChecks; //  0x3e8 Size(1)
	char bAllowStrafe; //  0x3e8 Size(1)
	char bWantsPlayerState; //  0x3e8 Size(1)
	char bSetControlRotationFromPawnOrientation; //  0x3e8 Size(1)
	Unknown PathFollowingComponent; //  0x3f0 Size(8)
	Unknown BrainComponent; //  0x3f8 Size(8)
	Unknown PerceptionComponent; //  0x400 Size(8)
	Unknown ActionsComp; //  0x408 Size(8)
	Unknown Blackboard; //  0x410 Size(8)
	Unknown CachedGameplayTasksComponent; //  0x418 Size(8)
	Unknown DefaultNavigationFilterClass; //  0x420 Size(8)
	struct FMulticastInlineDelegate ReceiveMoveCompleted; //  0x428 Size(10)

	char UseBlackboard(Unknown BlackboardAsset, Unknown& BlackboardComponent); // Function AIModule.AIController.UseBlackboard(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x3f9eea0>
};

// Class AIModule.BTService
struct UBTService : UBTAuxiliaryNode {
	float Interval; //  0x60 Size(4)
	float RandomDeviation; //  0x64 Size(4)
	char bCallTickOnSearchStart; //  0x68 Size(1)
	char bRestartTimerOnEachActivation; //  0x68 Size(1)
};

// Class AIModule.AIAsyncTaskBlueprintProxy
struct UAIAsyncTaskBlueprintProxy : Object {
	struct FMulticastInlineDelegate OnSuccess; //  0x28 Size(10)
	struct FMulticastInlineDelegate OnFail; //  0x38 Size(10)

	void OnMoveCompleted(Unknown RequestID, Unknown MovementResult); // Function AIModule.AIAsyncTaskBlueprintProxy.OnMoveCompleted(Final|Native|Public) // <Game+0x3f9e440>
};

// Class AIModule.AIDataProvider_QueryParams
struct UAIDataProvider_QueryParams : UAIDataProvider {
	struct FName ParamName; //  0x28 Size(8)
	float FloatValue; //  0x30 Size(4)
	int32_t IntValue; //  0x34 Size(4)
	char BoolValue; //  0x38 Size(1)
};

// Class AIModule.AIDataProvider_Random
struct UAIDataProvider_Random : UAIDataProvider_QueryParams {
	float Min; //  0x40 Size(4)
	float MAX; //  0x44 Size(4)
	char bInteger; //  0x48 Size(1)
};

// Class AIModule.AIPerceptionComponent
struct UAIPerceptionComponent : UActorComponent {
	Unknown SensesConfig; //  0xb0 Size(10)
	Unknown DominantSense; //  0xc0 Size(8)
	Unknown AIOwner; //  0xd8 Size(8)
	struct FMulticastInlineDelegate OnPerceptionUpdated; //  0x160 Size(10)
	struct FMulticastInlineDelegate OnTargetPerceptionUpdated; //  0x170 Size(10)

	void SetSenseEnabled(Unknown SenseClass, char bEnable); // Function AIModule.AIPerceptionComponent.SetSenseEnabled(Final|Native|Public|BlueprintCallable) // <Game+0x3f9e8c0>
};

// Class AIModule.AIPerceptionStimuliSourceCo
struct UAIPerceptionStimuliSourceCot : UActorComponent {
	char bAutoRegisterAsSource; //  0xb0 Size(1)
	Unknown RegisterAsSourceForSenses; //  0xb8 Size(10)

	void UnregisterFromSense(Unknown SenseClass); // Function AIModule.AIPerceptionStimuliSourceCot.UnregisterFromSense(Final|Native|Public|BlueprintCallable) // <Game+0x3fa3810>
};

// Class AIModule.AISubsystem
struct UAISubsystem : Object {
	Unknown AISystem; //  0x30 Size(8)
};

// Class AIModule.AIPerceptionSystem
struct UAIPerceptionSystem : UAISubsystem {
	Unknown Senses; //  0x88 Size(10)
	float PerceptionAgingRate; //  0x98 Size(4)

	void ReportPerceptionEvent(Unknown WorldContextObject, Unknown PerceptionEvent); // Function AIModule.AIPerceptionSystem.ReportPerceptionEvent(Final|Native|Static|Public|BlueprintCallable) // <Game+0x3fa3540>
};

// Class AIModule.AISense
struct UAISense : Object {
	float DefaultExpirationAge; //  0x28 Size(4)
	Unknown NotifyType; //  0x2c Size(1)
	char bWantsNewPawnNotification; //  0x30 Size(1)
	char bAutoRegisterAllPawnsAsSources; //  0x30 Size(1)
	Unknown PerceptionSystemInstance; //  0x38 Size(8)
};

// Class AIModule.AISense_Blueprint
struct UAISense_Blueprint : UAISense {
	Unknown ListenerDataType; //  0x80 Size(8)
	Unknown ListenerContainer; //  0x88 Size(10)
	Unknown UnprocessedEvents; //  0x98 Size(10)

	float OnUpdate(Unknown& EventsToProcess); // Function AIModule.AISense_Blueprint.OnUpdate(Event|Public|HasOutParms|BlueprintEvent) // <Game+0x23a73f0>
};

// Class AIModule.AISense_Damage
struct UAISense_Damage : UAISense {
	Unknown RegisteredEvents; //  0x80 Size(10)

	void ReportDamageEvent(Unknown WorldContextObject, Unknown DamagedActor, Unknown Instigator, float DamageAmount, Unknown EventLocation, Unknown HitLocation); // Function AIModule.AISense_Damage.ReportDamageEvent(Final|Native|Static|Public|HasDefaults|BlueprintCallable) // <Game+0x3fa3130>
};

// Class AIModule.AISense_Hearing
struct UAISense_Hearing : UAISense {
	Unknown NoiseEvents; //  0x80 Size(10)
	float SpeedOfSoundSq; //  0x90 Size(4)

	void ReportNoiseEvent(Unknown WorldContextObject, Unknown NoiseLocation, float Loudness, Unknown Instigator, float MaxRange, struct FName Tag); // Function AIModule.AISense_Hearing.ReportNoiseEvent(Final|Native|Static|Public|HasDefaults|BlueprintCallable) // <Game+0x3fa3380>
};

// Class AIModule.AISense_Prediction
struct UAISense_Prediction : UAISense {
	Unknown RegisteredEvents; //  0x80 Size(10)

	void RequestPawnPredictionEvent(Unknown Requestor, Unknown PredictedActor, float PredictionTime); // Function AIModule.AISense_Prediction.RequestPawnPredictionEvent(Final|Native|Static|Public|BlueprintCallable) // <Game+0x3fa36f0>
};

// Class AIModule.AISense_Sight
struct UAISense_Sight : UAISense {
	int32_t MaxTracesPerTick; //  0x148 Size(4)
	int32_t MinQueriesPerTimeSliceCheck; //  0x14c Size(4)
	Unknown MaxTimeSlicePerTick; //  0x150 Size(8)
	float HighImportanceQueryDistanceThreshold; //  0x158 Size(4)
	float MaxQueryImportance; //  0x160 Size(4)
	float SightLimitQueryImportance; //  0x164 Size(4)
};

// Class AIModule.AISense_Team
struct UAISense_Team : UAISense {
	Unknown RegisteredEvents; //  0x80 Size(10)
};

// Class AIModule.AISense_Touch
struct UAISense_Touch : UAISense {
	Unknown RegisteredEvents; //  0x80 Size(10)
};

// Class AIModule.AISenseConfig
struct UAISenseConfig : Object {
	Unknown DebugColor; //  0x28 Size(4)
	float MaxAge; //  0x2c Size(4)
	char bStartsEnabled; //  0x30 Size(1)
};

// Class AIModule.AISenseConfig_Blueprint
struct UAISenseConfig_Blueprint : UAISenseConfig {
	Unknown Implementation; //  0x48 Size(8)
};

// Class AIModule.AISenseConfig_Damage
struct UAISenseConfig_Damage : UAISenseConfig {
	Unknown Implementation; //  0x48 Size(8)
};

// Class AIModule.AISenseConfig_Hearing
struct UAISenseConfig_Hearing : UAISenseConfig {
	Unknown Implementation; //  0x48 Size(8)
	float HearingRange; //  0x50 Size(4)
	float LoSHearingRange; //  0x54 Size(4)
	char bUseLoSHearing; //  0x58 Size(1)
	Unknown DetectionByAffiliation; //  0x5c Size(4)
};

// Class AIModule.AISenseConfig_Sight
struct UAISenseConfig_Sight : UAISenseConfig {
	Unknown Implementation; //  0x48 Size(8)
	float SightRadius; //  0x50 Size(4)
	float LoseSightRadius; //  0x54 Size(4)
	float PeripheralVisionAngleDegrees; //  0x58 Size(4)
	Unknown DetectionByAffiliation; //  0x5c Size(4)
	float AutoSuccessRangeFromLastSeenLocation; //  0x60 Size(4)
};

// Class AIModule.AISenseEvent_Damage
struct UAISenseEvent_Damage : UAISenseEvent {
	Unknown Event; //  0x28 Size(30)
};

// Class AIModule.AISenseEvent_Hearing
struct UAISenseEvent_Hearing : UAISenseEvent {
	Unknown Event; //  0x28 Size(30)
};

// Class AIModule.AISystem
struct UAISystem : UAISystemBase {
	Unknown PerceptionSystemClassName; //  0x58 Size(18)
	Unknown HotSpotManagerClassName; //  0x70 Size(18)
	float AcceptanceRadius; //  0x88 Size(4)
	float PathfollowingRegularPathPointAcceptanceRadius; //  0x8c Size(4)
	float PathfollowingNavLinkAcceptanceRadius; //  0x90 Size(4)
	char bFinishMoveOnGoalOv; //  0x94 Size(1)
	char bAcceptPartialPaths; //  0x95 Size(1)
	char bAllowStrafing; //  0x96 Size(1)
	char bEnableBTAITasks; //  0x97 Size(1)
	char bAllowControllersAsEQSQuerier; //  0x98 Size(1)
	char bEnableDebuggerPlugin; //  0x99 Size(1)
	char bForgetStaleActors; //  0x9a Size(1)
	Unknown DefaultSightCollisionChannel; //  0x9b Size(1)
	Unknown BehaviorTreeManager; //  0xa0 Size(8)
	Unknown EnvironmentQueryManager; //  0xa8 Size(8)
	Unknown PerceptionSystem; //  0xb0 Size(8)
	Unknown AllProxyObjects; //  0xb8 Size(10)
	Unknown HotSpotManager; //  0xc8 Size(8)
	Unknown NavLocalGrids; //  0xd0 Size(8)

	void AILoggingVerbose(); // Function AIModule.AISystem.AILoggingVerbose(Exec|Native|Public) // <Game+0x2ed6cc0>
};

// Class AIModule.AITask
struct UAITask : UGameplayTask {
	Unknown OwnerController; //  0x68 Size(8)
};

// Class AIModule.AITask_MoveTo
struct UAITask_MoveTo : UAITask {
	struct FMulticastInlineDelegate OnRequestFailed; //  0x70 Size(10)
	struct FMulticastInlineDelegate OnMoveFinished; //  0x80 Size(10)
	Unknown MoveRequest; //  0x90 Size(40)

	Unknown AIMoveTo(Unknown Controller, Unknown GoalLocation, Unknown GoalActor, float AcceptanceRadius, Unknown StopOnOverlap, Unknown AcceptPartialPath, char bUsePathfinding, char bLockAILogic, char bUseContinuosGoalTracking, Unknown ProjectGoalOnNavigation); // Function AIModule.AITask_MoveTo.AIMoveTo(Final|Native|Static|Public|HasDefaults|BlueprintCallable) // <Game+0x3fa7660>
};

// Class AIModule.BehaviorTree
struct UBehaviorTree : Object {
	Unknown RootNode; //  0x30 Size(8)
	Unknown BlackboardAsset; //  0x38 Size(8)
	Unknown RootDecorators; //  0x40 Size(10)
	Unknown RootDecoratorOps; //  0x50 Size(10)
};

// Class AIModule.BrainComponent
struct UBrainComponent : UActorComponent {
	Unknown BlackboardComp; //  0xb8 Size(8)
	Unknown AIOwner; //  0xc0 Size(8)

	void StopLogic(struct FString reason); // Function AIModule.BrainComponent.StopLogic(Native|Public|BlueprintCallable) // <Game+0x3fae3c0>
};

// Class AIModule.BehaviorTreeComponent
struct UBehaviorTreeComponent : UBrainComponent {
	Unknown NodeInstances; //  0x130 Size(10)
	Unknown DefaultBehaviorTreeAsset; //  0x268 Size(8)

	void SetDynamicSubtree(Unknown InjectTag, Unknown BehaviorAsset); // Function AIModule.BehaviorTreeComponent.SetDynamicSubtree(Native|Public|BlueprintCallable) // <Game+0x3fa8560>
};

// Class AIModule.BehaviorTreeManager
struct UBehaviorTreeManager : Object {
	int32_t MaxDebuggerSteps; //  0x28 Size(4)
	Unknown LoadedTemplates; //  0x30 Size(10)
	Unknown ActiveComponents; //  0x40 Size(10)
};

// Class AIModule.BlackboardComponent
struct UBlackboardComponent : UActorComponent {
	Unknown BrainComp; //  0xb0 Size(8)
	Unknown DefaultBlackboardAsset; //  0xb8 Size(8)
	Unknown BlackboardAsset; //  0xc0 Size(8)
	Unknown KeyInstances; //  0xe8 Size(10)

	void SetValueAsVector(struct FName& KeyName, Unknown VectorValue); // Function AIModule.BlackboardComponent.SetValueAsVector(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <Game+0x3fa8e20>
};

// Class AIModule.BlackboardData
struct UBlackboardData : UDataAsset {
	Unknown Parent; //  0x30 Size(8)
	Unknown Keys; //  0x38 Size(10)
	char bHasSynchronizedKeys; //  0x48 Size(1)
};

// Class AIModule.BlackboardKeyType_Class
struct UBlackboardKeyType_Class : UBlackboardKeyType {
	Unknown BaseClass; //  0x30 Size(8)
};

// Class AIModule.BlackboardKeyType_Enum
struct UBlackboardKeyType_Enum : UBlackboardKeyType {
	Unknown EnumType; //  0x30 Size(8)
	struct FString EnumName; //  0x38 Size(10)
	char bIsEnumNameValid; //  0x48 Size(1)
};

// Class AIModule.BlackboardKeyType_NativeEnum
struct UBlackboardKeyType_NativeEnum : UBlackboardKeyType {
	struct FString EnumName; //  0x30 Size(10)
	Unknown EnumType; //  0x40 Size(8)
};

// Class AIModule.BlackboardKeyType_Object
struct UBlackboardKeyType_Object : UBlackboardKeyType {
	Unknown BaseClass; //  0x30 Size(8)
};

// Class AIModule.BlackboardKeyType_String
struct UBlackboardKeyType_String : UBlackboardKeyType {
	struct FString StringValue; //  0x30 Size(10)
};

// Class AIModule.BTCompositeNode
struct UBTCompositeNode : UBTNode {
	Unknown Children; //  0x58 Size(10)
	Unknown Services; //  0x68 Size(10)
	char bApplyDecoratorScope; //  0x88 Size(1)
};

// Class AIModule.BTComposite_SimpleParallel
struct UBTComposite_SimpleParallel : UBTCompositeNode {
	Unknown FinishMode; //  0x90 Size(1)
};

// Class AIModule.BTDecorator
struct UBTDecorator : UBTAuxiliaryNode {
	char bInverseCondition; //  0x60 Size(1)
	Unknown FlowAbortMode; //  0x64 Size(1)
};

// Class AIModule.BTDecorator_BlackboardBase
struct UBTDecorator_BlackboardBase : UBTDecorator {
	Unknown BlackboardKey; //  0x68 Size(28)
};

// Class AIModule.BTDecorator_Blackboard
struct UBTDecorator_Blackboard : UBTDecorator_BlackboardBase {
	int32_t IntValue; //  0x90 Size(4)
	float FloatValue; //  0x94 Size(4)
	struct FString StringValue; //  0x98 Size(10)
	struct FString CachedDescription; //  0xa8 Size(10)
	Unknown OperationType; //  0xb8 Size(1)
	Unknown NotifyObserver; //  0xb9 Size(1)
};

// Class AIModule.BTDecorator_BlueprintBase
struct UBTDecorator_BlueprintBase : UBTDecorator {
	Unknown AIOwner; //  0x68 Size(8)
	Unknown ActorOwner; //  0x70 Size(8)
	Unknown ObservedKeyNames; //  0x78 Size(10)
	char bShowPropertyDetails; //  0x98 Size(1)
	char bCheckConditionOnlyBlackBoardChanges; //  0x98 Size(1)
	char bIsObservingBB; //  0x98 Size(1)

	void ReceiveTickAI(Unknown OwnerController, Unknown ControlledPawn, float DeltaSeconds); // Function AIModule.BTDecorator_BlueprintBase.ReceiveTickAI(Event|Protected|BlueprintEvent) // <Game+0x23a73f0>
};

// Class AIModule.BTDecorator_CheckGameplayTagsOnActor
struct UBTDecorator_CheckGameplayTagsOnActor : UBTDecorator {
	Unknown ActorToCheck; //  0x68 Size(28)
	Unknown TagsToMatch; //  0x90 Size(1)
	Unknown GameplayTags; //  0x98 Size(20)
	struct FString CachedDescription; //  0xb8 Size(10)
};

// Class AIModule.BTDecorator_CompareBBEntries
struct UBTDecorator_CompareBBEntries : UBTDecorator {
	Unknown Operator; //  0x68 Size(1)
	Unknown BlackboardKeyA; //  0x70 Size(28)
	Unknown BlackboardKeyB; //  0x98 Size(28)
};

// Class AIModule.BTDecorator_ConeCheck
struct UBTDecorator_ConeCheck : UBTDecorator {
	float ConeHalfAngle; //  0x68 Size(4)
	Unknown ConeOrigin; //  0x70 Size(28)
	Unknown ConeDirection; //  0x98 Size(28)
	Unknown Observed; //  0xc0 Size(28)
};

// Class AIModule.BTDecorator_Cooldown
struct UBTDecorator_Cooldown : UBTDecorator {
	float CoolDownTime; //  0x68 Size(4)
};

// Class AIModule.BTDecorator_DoesPathExist
struct UBTDecorator_DoesPathExist : UBTDecorator {
	Unknown BlackboardKeyA; //  0x68 Size(28)
	Unknown BlackboardKeyB; //  0x90 Size(28)
	char bUseSelf; //  0xb8 Size(1)
	Unknown PathQueryType; //  0xbc Size(1)
	Unknown FilterClass; //  0xc0 Size(8)
};

// Class AIModule.BTDecorator_IsAtLocation
struct UBTDecorator_IsAtLocation : UBTDecorator_BlackboardBase {
	float AcceptableRadius; //  0x90 Size(4)
	Unknown ParametrizedAcceptableRadius; //  0x98 Size(38)
	Unknown GeometricDistanceType; //  0xd0 Size(1)
	char bUseParametrizedRadius; //  0xd4 Size(1)
	char bUseNavAgentGoalLocation; //  0xd4 Size(1)
	char bPathFindingBasedTest; //  0xd4 Size(1)
};

// Class AIModule.BTDecorator_IsBBEntryOfClass
struct UBTDecorator_IsBBEntryOfClass : UBTDecorator_BlackboardBase {
	Unknown TestClass; //  0x90 Size(8)
};

// Class AIModule.BTDecorator_KeepInCone
struct UBTDecorator_KeepInCone : UBTDecorator {
	float ConeHalfAngle; //  0x68 Size(4)
	Unknown ConeOrigin; //  0x70 Size(28)
	Unknown Observed; //  0x98 Size(28)
	char bUseSelfAsOrigin; //  0xc0 Size(1)
	char bUseSelfAsObserved; //  0xc0 Size(1)
};

// Class AIModule.BTDecorator_Loop
struct UBTDecorator_Loop : UBTDecorator {
	int32_t NumLoops; //  0x68 Size(4)
	char bInfiniteLoop; //  0x6c Size(1)
	float InfiniteLoopTimeoutTime; //  0x70 Size(4)
};

// Class AIModule.BTDecorator_SetTagCooldown
struct UBTDecorator_SetTagCooldown : UBTDecorator {
	Unknown CooldownTag; //  0x68 Size(8)
	float CooldownDuration; //  0x70 Size(4)
	char bAddToExistingDuration; //  0x74 Size(1)
};

// Class AIModule.BTDecorator_TagCooldown
struct UBTDecorator_TagCooldown : UBTDecorator {
	Unknown CooldownTag; //  0x68 Size(8)
	float CooldownDuration; //  0x70 Size(4)
	char bAddToExistingDuration; //  0x74 Size(1)
	char bActivatesCooldown; //  0x75 Size(1)
};

// Class AIModule.BTDecorator_TimeLimit
struct UBTDecorator_TimeLimit : UBTDecorator {
	float TimeLimit; //  0x68 Size(4)
};

// Class AIModule.BTService_BlackboardBase
struct UBTService_BlackboardBase : UBTService {
	Unknown BlackboardKey; //  0x70 Size(28)
};

// Class AIModule.BTService_BlueprintBase
struct UBTService_BlueprintBase : UBTService {
	Unknown AIOwner; //  0x70 Size(8)
	Unknown ActorOwner; //  0x78 Size(8)
	char bShowPropertyDetails; //  0x90 Size(1)
	char bShowEventDetails; //  0x90 Size(1)

	void ReceiveTickAI(Unknown OwnerController, Unknown ControlledPawn, float DeltaSeconds); // Function AIModule.BTService_BlueprintBase.ReceiveTickAI(Event|Protected|BlueprintEvent) // <Game+0x23a73f0>
};

// Class AIModule.BTService_DefaultFocus
struct UBTService_DefaultFocus : UBTService_BlackboardBase {
	Unknown FocusPriority; //  0x98 Size(1)
};

// Class AIModule.BTService_RunEQS
struct UBTService_RunEQS : UBTService_BlackboardBase {
	Unknown EQSRequest; //  0x98 Size(48)
};

// Class AIModule.BTTask_BlueprintBase
struct UBTTask_BlueprintBase : UBTTaskNode {
	Unknown AIOwner; //  0x70 Size(8)
	Unknown ActorOwner; //  0x78 Size(8)
	Unknown TickInterval; //  0x80 Size(8)
	char bShowPropertyDetails; //  0xa0 Size(1)

	void SetFinishOnMessageWithId(struct FName MessageName, int32_t RequestID); // Function AIModule.BTTask_BlueprintBase.SetFinishOnMessageWithId(Final|Native|Protected|BlueprintCallable) // <Game+0x3fb12c0>
};

// Class AIModule.BTTask_FinishWithResult
struct UBTTask_FinishWithResult : UBTTaskNode {
	Unknown Result; //  0x70 Size(1)
};

// Class AIModule.BTTask_GameplayTaskBase
struct UBTTask_GameplayTaskBase : UBTTaskNode {
	char bWaitForGameplayTask; //  0x70 Size(1)
};

// Class AIModule.BTTask_MakeNoise
struct UBTTask_MakeNoise : UBTTaskNode {
	float Loudnes; //  0x70 Size(4)
};

// Class AIModule.BTTask_MoveTo
struct UBTTask_MoveTo : UBTTask_BlackboardBase {
	float AcceptableRadius; //  0x98 Size(4)
	Unknown FilterClass; //  0xa0 Size(8)
	float ObservedBlackboardValueTolerance; //  0xa8 Size(4)
	char bObserveBlackboardValue; //  0xac Size(1)
	char bAllowStrafe; //  0xac Size(1)
	char bAllowPartialPath; //  0xac Size(1)
	char bTrackMovingGoal; //  0xac Size(1)
	char bProjectGoalLocation; //  0xac Size(1)
	char bReachTestIncludesAgentRadius; //  0xac Size(1)
	char bReachTestIncludesGoalRadius; //  0xac Size(1)
	char bStopOnOverlap; //  0xac Size(1)
	char bStopOnOverlapNeedsUpdate; //  0xad Size(1)
};

// Class AIModule.BTTask_MoveDirectlyToward
struct UBTTask_MoveDirectlyToward : UBTTask_MoveTo {
	char bDisablePathUpdateOnGoalLocation; //  0xb0 Size(1)
	char bProjectVectorGoalToNavigation; //  0xb0 Size(1)
	char bUpdatedDeprecatedProperties; //  0xb0 Size(1)
};

// Class AIModule.BTTask_PlayAnimation
struct UBTTask_PlayAnimation : UBTTaskNode {
	Unknown AnimationToPlay; //  0x70 Size(8)
	char bLooping; //  0x78 Size(1)
	char bNonBlocking; //  0x78 Size(1)
	Unknown MyOwnerComp; //  0x80 Size(8)
	Unknown CachedSkelMesh; //  0x88 Size(8)
};

// Class AIModule.BTTask_PlaySound
struct UBTTask_PlaySound : UBTTaskNode {
	Unknown SoundToPlay; //  0x70 Size(8)
};

// Class AIModule.BTTask_PushPawnAction
struct UBTTask_PushPawnAction : UBTTask_PawnActionBase {
	Unknown Action; //  0x70 Size(8)
};

// Class AIModule.BTTask_RotateToFaceBBEntry
struct UBTTask_RotateToFaceBBEntry : UBTTask_BlackboardBase {
	float Precision; //  0x98 Size(4)
};

// Class AIModule.BTTask_RunBehavior
struct UBTTask_RunBehavior : UBTTaskNode {
	Unknown BehaviorAsset; //  0x70 Size(8)
};

// Class AIModule.BTTask_RunBehaviorDynamic
struct UBTTask_RunBehaviorDynamic : UBTTaskNode {
	Unknown InjectionTag; //  0x70 Size(8)
	Unknown DefaultBehaviorAsset; //  0x78 Size(8)
	Unknown BehaviorAsset; //  0x80 Size(8)
};

// Class AIModule.BTTask_RunEQSQuery
struct UBTTask_RunEQSQuery : UBTTask_BlackboardBase {
	Unknown QueryTemplate; //  0x98 Size(8)
	Unknown QueryParams; //  0xa0 Size(10)
	Unknown QueryConfig; //  0xb0 Size(10)
	Unknown RunMode; //  0xc0 Size(1)
	Unknown EQSQueryBlackboardKey; //  0xc8 Size(28)
	char bUseBBKey; //  0xf0 Size(1)
	Unknown EQSRequest; //  0xf8 Size(48)
};

// Class AIModule.BTTask_SetTagCooldown
struct UBTTask_SetTagCooldown : UBTTaskNode {
	Unknown CooldownTag; //  0x70 Size(8)
	char bAddToExistingDuration; //  0x78 Size(1)
	float CooldownDuration; //  0x7c Size(4)
};

// Class AIModule.BTTask_Wait
struct UBTTask_Wait : UBTTaskNode {
	float WaitTime; //  0x70 Size(4)
	float RandomDeviation; //  0x74 Size(4)
};

// Class AIModule.BTTask_WaitBlackboardTime
struct UBTTask_WaitBlackboardTime : UBTTask_Wait {
	Unknown BlackboardKey; //  0x78 Size(28)
};

// Class AIModule.PathFollowingComponent
struct UPathFollowingComponent : UActorComponent {
	Unknown MovementComp; //  0xe8 Size(8)
	Unknown MyNavData; //  0xf8 Size(8)

	void OnNavDataRegistered(Unknown NavData); // Function AIModule.PathFollowingComponent.OnNavDataRegistered(Final|Native|Protected) // <Game+0x3fbc6f0>
};

// Class AIModule.CrowdFollowingComponent
struct UCrowdFollowingComponent : UPathFollowingComponent {
	Unknown CharacterMovement; //  0x260 Size(8)
	Unknown CrowdAgentMoveDirection; //  0x268 Size(c)

	void SuspendCrowdSteering(char bSuspend); // Function AIModule.CrowdFollowingComponent.SuspendCrowdSteering(Native|Public|BlueprintCallable) // <Game+0x3fb1380>
};

// Class AIModule.CrowdManager
struct UCrowdManager : UCrowdManagerBase {
	Unknown MyNavData; //  0x28 Size(8)
	Unknown AvoidanceConfig; //  0x30 Size(10)
	Unknown SamplingPatterns; //  0x40 Size(10)
	int32_t MaxAgents; //  0x50 Size(4)
	float MaxAgentRadius; //  0x54 Size(4)
	int32_t MaxAvoidedAgents; //  0x58 Size(4)
	int32_t MaxAvoidedWalls; //  0x5c Size(4)
	float NavmeshCheckInterval; //  0x60 Size(4)
	float PathOptimizationInterval; //  0x64 Size(4)
	float SeparationDirClamp; //  0x68 Size(4)
	float PathOffsetRadiusMultiplier; //  0x6c Size(4)
	char bResolveCollisions; //  0x70 Size(1)
};

// Class AIModule.EnvQuery
struct UEnvQuery : UDataAsset {
	struct FName QueryName; //  0x30 Size(8)
	Unknown options; //  0x38 Size(10)
};

// Class AIModule.EnvQueryNode
struct UEnvQueryNode : Object {
	int32_t VerNum; //  0x28 Size(4)
};

// Class AIModule.EnvQueryGenerator
struct UEnvQueryGenerator : UEnvQueryNode {
	struct FString OptionName; //  0x30 Size(10)
	Unknown ItemType; //  0x40 Size(8)
	char bAutoSortTests; //  0x48 Size(1)
};

// Class AIModule.EnvQueryGenerator_ActorsOfClass
struct UEnvQueryGenerator_ActorsOfClass : UEnvQueryGenerator {
	Unknown SearchedActorClass; //  0x50 Size(8)
	Unknown GenerateOnlyActorsInRadius; //  0x58 Size(38)
	Unknown SearchRadius; //  0x90 Size(38)
	Unknown SearchCenter; //  0xc8 Size(8)
};

// Class AIModule.EnvQueryGenerator_BlueprintBase
struct UEnvQueryGenerator_BlueprintBase : UEnvQueryGenerator {
	struct FText GeneratorsActionDescription; //  0x50 Size(18)
	Unknown Context; //  0x68 Size(8)
	Unknown GeneratedItemType; //  0x70 Size(8)

	Unknown GetQuerier(); // Function AIModule.EnvQueryGenerator_BlueprintBase.GetQuerier(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game+0x3fb4a10>
};

// Class AIModule.EnvQueryGenerator_Composite
struct UEnvQueryGenerator_Composite : UEnvQueryGenerator {
	Unknown Generators; //  0x50 Size(10)
	char bAllowDifferentItemTypes; //  0x60 Size(1)
	char bHasMatchingItemType; //  0x60 Size(1)
	Unknown ForcedItemType; //  0x68 Size(8)
};

// Class AIModule.EnvQueryGenerator_ProjectedPoints
struct UEnvQueryGenerator_ProjectedPoints : UEnvQueryGenerator {
	Unknown ProjectionData; //  0x50 Size(30)
};

// Class AIModule.EnvQueryGenerator_Cone
struct UEnvQueryGenerator_Cone : UEnvQueryGenerator_ProjectedPoints {
	Unknown AlignedPointsDistance; //  0x80 Size(38)
	Unknown ConeDegrees; //  0xb8 Size(38)
	Unknown AngleStep; //  0xf0 Size(38)
	Unknown Range; //  0x128 Size(38)
	Unknown CenterActor; //  0x160 Size(8)
	char bIncludeContextLocation; //  0x168 Size(1)
};

// Class AIModule.EnvQueryGenerator_CurrentLo
struct UEnvQueryGenerator_CurrentLot : UEnvQueryGenerator {
	Unknown QueryContext; //  0x50 Size(8)
};

// Class AIModule.EnvQueryGenerator_Donut
struct UEnvQueryGenerator_Donut : UEnvQueryGenerator_ProjectedPoints {
	Unknown InnerRadius; //  0x80 Size(38)
	Unknown OuterRadius; //  0xb8 Size(38)
	Unknown Numb; //  0xf0 Size(38)
	Unknown PointsPerRing; //  0x128 Size(38)
	Unknown ArcDirection; //  0x160 Size(20)
	Unknown ArcAngle; //  0x180 Size(38)
	char bUseSpiralPattern; //  0x1b8 Size(1)
	Unknown Center; //  0x1c0 Size(8)
	char bDefineArc; //  0x1c8 Size(1)
};

// Class AIModule.EnvQueryGenerator_OnCircle
struct UEnvQueryGenerator_OnCircle : UEnvQueryGenerator_ProjectedPoints {
	Unknown CircleRadius; //  0x80 Size(38)
	Unknown SpaceBetween; //  0xb8 Size(38)
	Unknown Numb; //  0xf0 Size(38)
	Unknown PointOnCircleSpacingMethod; //  0x128 Size(1)
	Unknown ArcDirection; //  0x130 Size(20)
	Unknown ArcAngle; //  0x150 Size(38)
	float AngleRadians; //  0x188 Size(4)
	Unknown CircleCenter; //  0x190 Size(8)
	char bIgnoreAnyContextActorsWhenGeneratingCircle; //  0x198 Size(1)
	Unknown CircleCenterZOffset; //  0x1a0 Size(38)
	Unknown TraceData; //  0x1d8 Size(30)
	char bDefineArc; //  0x208 Size(1)
};

// Class AIModule.EnvQueryGenerator_SimpleGrid
struct UEnvQueryGenerator_SimpleGrid : UEnvQueryGenerator_ProjectedPoints {
	Unknown GridSize; //  0x80 Size(38)
	Unknown SpaceBetween; //  0xb8 Size(38)
	Unknown GenerateAround; //  0xf0 Size(8)
};

// Class AIModule.EnvQueryGenerator_PathingGrid
struct UEnvQueryGenerator_PathingGrid : UEnvQueryGenerator_SimpleGrid {
	Unknown PathToItem; //  0xf8 Size(38)
	Unknown NavigationFilter; //  0x130 Size(8)
	Unknown ScanRangeMultiplier; //  0x138 Size(38)
};

// Class AIModule.EnvQueryInstanceBlueprintWrapper
struct UEnvQueryInstanceBlueprintWrapper : Object {
	int32_t QueryID; //  0x30 Size(4)
	Unknown ItemType; //  0x58 Size(8)
	int32_t OptionIndex; //  0x60 Size(4)
	struct FMulticastInlineDelegate OnQueryFinishedEvent; //  0x68 Size(10)

	void SetNamedParam(struct FName ParamName, float Value); // Function AIModule.EnvQueryInstanceBlueprintWrapper.SetNamedParam(Final|Native|Public|BlueprintCallable) // <Game+0x3fb4e40>
};

// Class AIModule.EnvQueryManager
struct UEnvQueryManager : UAISubsystem {
	Unknown InstanceCache; //  0xa8 Size(10)
	Unknown LocalContexts; //  0xb8 Size(10)
	Unknown GCShieldedWrappers; //  0xc8 Size(10)
	float MaxAllowedTestingTime; //  0x12c Size(4)
	char bTestQueriesUsingBreadth; //  0x130 Size(1)
	int32_t QueryCountWarningThreshold; //  0x134 Size(4)
	Unknown QueryCountWarningInterval; //  0x138 Size(8)

	Unknown RunEQSQuery(Unknown WorldContextObject, Unknown QueryTemplate, Unknown Querier, Unknown RunMode, Unknown WrapperClass); // Function AIModule.EnvQueryManager.RunEQSQuery(Final|Native|Static|Public|BlueprintCallable) // <Game+0x3fb4cc0>
};

// Class AIModule.EnvQueryOption
struct UEnvQueryOption : Object {
	Unknown Generator; //  0x28 Size(8)
	Unknown Tests; //  0x30 Size(10)
};

// Class AIModule.EnvQueryTest
struct UEnvQueryTest : UEnvQueryNode {
	int32_t TestOrder; //  0x30 Size(4)
	Unknown TestPurpose; //  0x34 Size(1)
	struct FString TestComment; //  0x38 Size(10)
	Unknown MultipleContextFilterOp; //  0x48 Size(1)
	Unknown MultipleContextScoreOp; //  0x49 Size(1)
	Unknown FilterType; //  0x4a Size(1)
	Unknown BoolValue; //  0x50 Size(38)
	Unknown FloatValueMin; //  0x88 Size(38)
	Unknown FloatValueMax; //  0xc0 Size(38)
	Unknown ScoringEquation; //  0xf9 Size(1)
	Unknown ClampMinType; //  0xfa Size(1)
	Unknown ClampMaxType; //  0xfb Size(1)
	Unknown NormalizationType; //  0xfc Size(1)
	Unknown ScoreClampMin; //  0x100 Size(38)
	Unknown ScoreClampMax; //  0x138 Size(38)
	Unknown ScoringFactor; //  0x170 Size(38)
	Unknown ReferenceValue; //  0x1a8 Size(38)
	char bDefineReferenceValue; //  0x1e0 Size(1)
	char bWorkOnFloatValues; //  0x1f0 Size(1)
};

// Class AIModule.EnvQueryTest_Distance
struct UEnvQueryTest_Distance : UEnvQueryTest {
	Unknown TestMode; //  0x1f8 Size(1)
	Unknown DistanceTo; //  0x200 Size(8)
};

// Class AIModule.EnvQueryTest_Dot
struct UEnvQueryTest_Dot : UEnvQueryTest {
	Unknown LineA; //  0x1f8 Size(20)
	Unknown LineB; //  0x218 Size(20)
	Unknown TestMode; //  0x238 Size(1)
	char bAbsoluteValue; //  0x239 Size(1)
};

// Class AIModule.EnvQueryTest_GameplayTags
struct UEnvQueryTest_GameplayTags : UEnvQueryTest {
	Unknown TagQueryToMatch; //  0x1f8 Size(48)
	char bUpdatedToUseQuery; //  0x240 Size(1)
	Unknown TagsToMatch; //  0x241 Size(1)
	Unknown GameplayTags; //  0x248 Size(20)
};

// Class AIModule.EnvQueryTest_Overlap
struct UEnvQueryTest_Overlap : UEnvQueryTest {
	Unknown OverlapData; //  0x1f8 Size(20)
};

// Class AIModule.EnvQueryTest_Pathfinding
struct UEnvQueryTest_Pathfinding : UEnvQueryTest {
	Unknown TestMode; //  0x1f8 Size(1)
	Unknown Context; //  0x200 Size(8)
	Unknown PathFromContext; //  0x208 Size(38)
	Unknown SkipUnreachable; //  0x240 Size(38)
	Unknown FilterClass; //  0x278 Size(8)
};

// Class AIModule.EnvQueryTest_PathfindingBatch
struct UEnvQueryTest_PathfindingBatch : UEnvQueryTest_Pathfinding {
	Unknown ScanRangeMultiplier; //  0x280 Size(38)
};

// Class AIModule.EnvQueryTest_Project
struct UEnvQueryTest_Project : UEnvQueryTest {
	Unknown ProjectionData; //  0x1f8 Size(30)
};

// Class AIModule.EnvQueryTest_Trace
struct UEnvQueryTest_Trace : UEnvQueryTest {
	Unknown TraceData; //  0x1f8 Size(30)
	Unknown TraceFromContext; //  0x228 Size(38)
	Unknown ItemHeightOffset; //  0x260 Size(38)
	Unknown ContextHeightOffset; //  0x298 Size(38)
	Unknown Context; //  0x2d0 Size(8)
};

// Class AIModule.EnvQueryTest_Volume
struct UEnvQueryTest_Volume : UEnvQueryTest {
	Unknown VolumeContext; //  0x1f8 Size(8)
	Unknown VolumeClass; //  0x200 Size(8)
	char bDoComplexVolumeTest; //  0x208 Size(1)
};

// Class AIModule.EQSTestingPawn
struct AEQSTestingPawn : ACharacter {
	Unknown QueryTemplate; //  0x5e0 Size(8)
	Unknown QueryParams; //  0x5e8 Size(10)
	Unknown QueryConfig; //  0x5f8 Size(10)
	float TimeLimitPerStep; //  0x608 Size(4)
	int32_t StepToDebugDraw; //  0x60c Size(4)
	Unknown HighlightMode; //  0x610 Size(1)
	char bDrawLabels; //  0x614 Size(1)
	char bDrawFailedItems; //  0x614 Size(1)
	char bReRunQueryOnlyOnFinishedMo; //  0x614 Size(1)
	char bShouldBeVisibleInGame; //  0x614 Size(1)
	char bTickDuringGame; //  0x614 Size(1)
	Unknown QueryingMode; //  0x618 Size(1)
	Unknown NavAgentProperties; //  0x620 Size(30)
};

// Class AIModule.GridPathFollowingComponent
struct UGridPathFollowingComponent : UPathFollowingComponent {
	Unknown GridManager; //  0x258 Size(8)
};

// Class AIModule.NavLinkProxy
struct ANavLinkProxy : UActor {
	Unknown PointLinks; //  0x320 Size(10)
	Unknown SegmentLinks; //  0x330 Size(10)
	Unknown SmartLinkComp; //  0x340 Size(8)
	char bSmartLinkIsRelevant; //  0x348 Size(1)
	struct FMulticastInlineDelegate OnSmartLinkReached; //  0x350 Size(10)

	void SetSmartLinkEnabled(char bEnabled); // Function AIModule.NavLinkProxy.SetSmartLinkEnabled(Final|Native|Public|BlueprintCallable) // <Game+0x3fba120>
};

// Class AIModule.PawnAction
struct UPawnAction : Object {
	Unknown ChildAction; //  0x28 Size(8)
	Unknown ParentAction; //  0x30 Size(8)
	Unknown OwnerComponent; //  0x38 Size(8)
	Unknown Instigator; //  0x40 Size(8)
	Unknown BrainComp; //  0x48 Size(8)
	char bAllowNewSameClassInstance; //  0x80 Size(1)
	char bReplaceActiveSameClassInstance; //  0x80 Size(1)
	char bShouldPauseMovement; //  0x80 Size(1)
	char bAlwaysNotifyOnFinished; //  0x80 Size(1)

	Unknown GetActionPriority(); // Function AIModule.PawnAction.GetActionPriority(Final|Native|Public|BlueprintCallable|BlueprintPure) // <Game+0x1894d80>
};

// Class AIModule.PawnAction_Move
struct UPawnAction_Move : UPawnAction {
	Unknown GoalActor; //  0x98 Size(8)
	Unknown GoalLocation; //  0xa0 Size(c)
	float AcceptableRadius; //  0xac Size(4)
	Unknown FilterClass; //  0xb0 Size(8)
	char bAllowStrafe; //  0xb8 Size(1)
	char bFinishOnOverlap; //  0xb8 Size(1)
	char bUsePathfinding; //  0xb8 Size(1)
	char bAllowPartialPath; //  0xb8 Size(1)
	char bProjectGoalToNavigation; //  0xb8 Size(1)
	char bUpdatePathToGoal; //  0xb8 Size(1)
	char bAbortChildActionOnPathChange; //  0xb8 Size(1)
};

// Class AIModule.PawnAction_Repeat
struct UPawnAction_Repeat : UPawnAction {
	Unknown ActionToRepeat; //  0x98 Size(8)
	Unknown RecentActionCopy; //  0xa0 Size(8)
	Unknown ChildFailureHandlingMode; //  0xa8 Size(1)
};

// Class AIModule.PawnAction_Sequence
struct UPawnAction_Sequence : UPawnAction {
	Unknown ActionSequence; //  0x98 Size(10)
	Unknown ChildFailureHandlingMode; //  0xa8 Size(1)
	Unknown RecentActionCopy; //  0xb0 Size(8)
};

// Class AIModule.PawnAction_Wait
struct UPawnAction_Wait : UPawnAction {
	float TimeToWait; //  0x98 Size(4)
};

// Class AIModule.PawnActionsComponent
struct UPawnActionsComponent : UActorComponent {
	Unknown ControlledPawn; //  0xb0 Size(8)
	Unknown ActionStacks; //  0xb8 Size(10)
	Unknown ActionEvents; //  0xc8 Size(10)
	Unknown CurrentAction; //  0xd8 Size(8)

	char K2_PushAction(Unknown NewAction, Unknown Priority, Unknown Instigator); // Function AIModule.PawnActionsComponent.K2_PushAction(Final|Native|Public|BlueprintCallable) // <Game+0x3fbc460>
};

// Class AIModule.PawnSensingComponent
struct UPawnSensingComponent : UActorComponent {
	float HearingThreshold; //  0xb0 Size(4)
	float LOSHearingThreshold; //  0xb4 Size(4)
	float SightRadius; //  0xb8 Size(4)
	float SensingInterval; //  0xbc Size(4)
	float HearingMaxSoundAge; //  0xc0 Size(4)
	char bEnableSensingUpdates; //  0xc4 Size(1)
	char bOnlySensePlayers; //  0xc4 Size(1)
	char bSeePawns; //  0xc4 Size(1)
	char bHearNoises; //  0xc4 Size(1)
	struct FMulticastInlineDelegate OnSeePawn; //  0xd0 Size(10)
	struct FMulticastInlineDelegate OnHearNoise; //  0xe0 Size(10)
	float PeripheralVisionAngle; //  0xf0 Size(4)
	float PeripheralVisionCosine; //  0xf4 Size(4)

	void SetSensingUpdatesEnabled(char bEnabled); // Function AIModule.PawnSensingComponent.SetSensingUpdatesEnabled(BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // <Game+0x3fbc870>
};

