// Enum AkAudio.EAkCallbackType
enum class EAkCallbackType : uint8_t {
	EAkCallbackType = 0,
	EAkCallbackType = 2,
	EAkCallbackType = 3,
	EAkCallbackType = 5,
	EAkCallbackType = 7,
	EAkCallbackType = 8,
	EAkCallbackType = 9,
	EAkCallbackType = 10,
	EAkCallbackType = 11,
	EAkCallbackType = 12,
	EAkCallbackType = 13,
	EAkCallbackType = 14,
	EAkCallbackType = 16,
	EAkCallbackType = 17,
};

// Enum AkAudio.EAkResult
enum class EAkResult : uint8_t {
	EAkResult = 0,
	EAkResult = 1,
	EAkResult = 2,
	EAkResult = 3,
	EAkResult = 4,
	EAkResult = 5,
	EAkResult = 7,
	EAkResult = 8,
	EAkResult = 9,
	EAkResult = 14,
	EAkResult = 15,
	EAkResult = 16,
	EAkResult = 17,
	EAkResult = 20,
	EAkResult = 21,
	EAkResult = 22,
	EAkResult = 23,
	EAkResult = 31,
	EAkResult = 35,
	EAkResult = 36,
	EAkResult = 37,
	EAkResult = 38,
	EAkResult = 39,
	EAkResult = 40,
	EAkResult = 41,
	EAkResult = 43,
	EAkResult = 44,
	EAkResult = 45,
	EAkResult = 46,
	EAkResult = 52,
	EAkResult = 53,
	EAkResult = 54,
	EAkResult = 56,
	EAkResult = 57,
	EAkResult = 63,
	EAkResult = 64,
	EAkResult = 66,
	EAkResult = 67,
	EAkResult = 69,
	EAkResult = 71,
	EAkResult = 72,
	EAkResult = 73,
	EAkResult = 74,
	EAkResult = 75,
	EAkResult = 76,
	EAkResult = 77,
	EAkResult = 78,
	EAkResult = 79,
	EAkResult = 80,
	EAkResult = 81,
	EAkResult = 82,
	EAkResult = 83,
	EAkResult = 84,
	EAkResult = 85,
	EAkResult = 86,
	EAkResult = 87,
	EAkResult = 88,
	EAkResult = 89,
	EAkResult = 90,
};

// Enum AkAudio.EAkAndroidAudioAPI
enum class EAkAndroidAudioAPI : uint8_t {
	EAkAndroidAudioAP = 0,
	EAkAndroidAudioAP = 1,
	EAkAndroidAudioAP = 2,
};

// Enum AkAudio.EAkAudioSessionMode
enum class EAkAudioSessionMode : uint8_t {
	EAkAudioSessionMode = 0,
	EAkAudioSessionMode = 1,
	EAkAudioSessionMode = 2,
	EAkAudioSessionMode = 3,
	EAkAudioSessionMode = 4,
	EAkAudioSessionMode = 5,
	EAkAudioSessionMode = 6,
	EAkAudioSessionMode = 7,
};

// Enum AkAudio.EAkAudioSessionCategoryOptions
enum class EAkAudioSessionCategoryOptions : uint8_t {
	EAkAudioSessionCategoryOptions = 0,
	EAkAudioSessionCategoryOptions = 1,
	EAkAudioSessionCategoryOptions = 2,
	EAkAudioSessionCategoryOptions = 3,
	EAkAudioSessionCategoryOptions = 4,
};

// Enum AkAudio.EAkAudioSessionCategory
enum class EAkAudioSessionCategory : uint8_t {
	EAkAudioSessionCategory = 0,
	EAkAudioSessionCategory = 1,
	EAkAudioSessionCategory = 2,
	EAkAudioSessionCategory = 3,
};

// Enum AkAudio.EReflectionFilterBits
enum class EReflectionFilterBits : uint8_t {
	EReflectionFilterBits = 0,
	EReflectionFilterBits = 1,
	EReflectionFilterBits = 2,
	EReflectionFilterBits = 3,
};

// Enum AkAudio.AkCodecId
enum class AkCodecId : uint8_t {
	AkCodecId = 0,
	AkCodecId = 1,
	AkCodecId = 2,
	AkCodecId = 3,
	AkCodecId = 4,
	AkCodecId = 10,
	AkCodecId = 12,
	AkCodecId = 17,
	AkCodecId = 19,
	AkCodecId = 20,
	AkCodecId = 21,
};

// Enum AkAudio.EAkMidiCcValues
enum class EAkMidiCcValues : uint8_t {
	EAkMidiCcValues = 0,
	EAkMidiCcValues = 1,
	EAkMidiCcValues = 2,
	EAkMidiCcValues = 3,
	EAkMidiCcValues = 4,
	EAkMidiCcValues = 5,
	EAkMidiCcValues = 6,
	EAkMidiCcValues = 7,
	EAkMidiCcValues = 8,
	EAkMidiCcValues = 9,
	EAkMidiCcValues = 10,
	EAkMidiCcValues = 11,
	EAkMidiCcValues = 12,
	EAkMidiCcValues = 13,
	EAkMidiCcValues = 14,
	EAkMidiCcValues = 15,
	EAkMidiCcValues = 16,
	EAkMidiCcValues = 17,
	EAkMidiCcValues = 18,
	EAkMidiCcValues = 19,
	EAkMidiCcValues = 20,
	EAkMidiCcValues = 21,
	EAkMidiCcValues = 22,
	EAkMidiCcValues = 23,
	EAkMidiCcValues = 24,
	EAkMidiCcValues = 25,
	EAkMidiCcValues = 26,
	EAkMidiCcValues = 27,
	EAkMidiCcValues = 28,
	EAkMidiCcValues = 29,
	EAkMidiCcValues = 30,
	EAkMidiCcValues = 31,
	EAkMidiCcValues = 32,
	EAkMidiCcValues = 33,
	EAkMidiCcValues = 34,
	EAkMidiCcValues = 35,
	EAkMidiCcValues = 36,
	EAkMidiCcValues = 37,
	EAkMidiCcValues = 38,
	EAkMidiCcValues = 39,
	EAkMidiCcValues = 40,
	EAkMidiCcValues = 41,
	EAkMidiCcValues = 42,
	EAkMidiCcValues = 43,
	EAkMidiCcValues = 44,
	EAkMidiCcValues = 45,
	EAkMidiCcValues = 46,
	EAkMidiCcValues = 47,
	EAkMidiCcValues = 52,
	EAkMidiCcValues = 53,
	EAkMidiCcValues = 54,
	EAkMidiCcValues = 55,
	EAkMidiCcValues = 56,
	EAkMidiCcValues = 57,
	EAkMidiCcValues = 58,
	EAkMidiCcValues = 59,
	EAkMidiCcValues = 60,
	EAkMidiCcValues = 61,
	EAkMidiCcValues = 62,
	EAkMidiCcValues = 63,
	EAkMidiCcValues = 64,
	EAkMidiCcValues = 65,
	EAkMidiCcValues = 66,
	EAkMidiCcValues = 67,
	EAkMidiCcValues = 68,
	EAkMidiCcValues = 69,
	EAkMidiCcValues = 70,
	EAkMidiCcValues = 71,
	EAkMidiCcValues = 72,
	EAkMidiCcValues = 73,
	EAkMidiCcValues = 74,
	EAkMidiCcValues = 75,
	EAkMidiCcValues = 76,
	EAkMidiCcValues = 77,
	EAkMidiCcValues = 78,
	EAkMidiCcValues = 79,
	EAkMidiCcValues = 80,
	EAkMidiCcValues = 81,
	EAkMidiCcValues = 82,
	EAkMidiCcValues = 83,
	EAkMidiCcValues = 91,
	EAkMidiCcValues = 92,
	EAkMidiCcValues = 93,
	EAkMidiCcValues = 94,
	EAkMidiCcValues = 95,
	EAkMidiCcValues = 96,
	EAkMidiCcValues = 97,
	EAkMidiCcValues = 98,
	EAkMidiCcValues = 99,
	EAkMidiCcValues = 120,
	EAkMidiCcValues = 121,
	EAkMidiCcValues = 122,
	EAkMidiCcValues = 123,
	EAkMidiCcValues = 124,
	EAkMidiCcValues = 125,
	EAkMidiCcValues = 126,
	EAkMidiCcValues = 127,
	EAkMidiCcValues = 128,
};

// Enum AkAudio.EAkMidiEventType
enum class EAkMidiEventType : uint8_t {
	EAkMidiEventType = 0,
	EAkMidiEventType = 128,
	EAkMidiEventType = 144,
	EAkMidiEventType = 160,
	EAkMidiEventType = 176,
	EAkMidiEventType = 192,
	EAkMidiEventType = 208,
	EAkMidiEventType = 224,
	EAkMidiEventType = 240,
	EAkMidiEventType = 247,
	EAkMidiEventType = 255,
	EAkMidiEventType = 256,
};

// Enum AkAudio.ERTPCValueType
enum class ERTPCValueType : uint8_t {
	ERTPCValueType = 0,
	ERTPCValueType = 1,
	ERTPCValueType = 2,
	ERTPCValueType = 3,
	ERTPCValueType = 4,
	ERTPCValueType = 5,
};

// Enum AkAudio.EAkCurveInterpolation
enum class EAkCurveInterpolation : uint8_t {
	EAkCurveInterpolation = 0,
	EAkCurveInterpolation = 1,
	EAkCurveInterpolation = 2,
	EAkCurveInterpolation = 3,
	EAkCurveInterpolation = 4,
	EAkCurveInterpolation = 5,
	EAkCurveInterpolation = 6,
	EAkCurveInterpolation = 7,
	EAkCurveInterpolation = 8,
	EAkCurveInterpolation = 8,
	EAkCurveInterpolation = 9,
	EAkCurveInterpolation = 10,
};

// Enum AkAudio.AkActionOnEventType
enum class AkActionOnEventType : uint8_t {
	AkActionOnEventType = 0,
	AkActionOnEventType = 1,
	AkActionOnEventType = 2,
	AkActionOnEventType = 3,
	AkActionOnEventType = 4,
	AkActionOnEventType = 5,
};

// Enum AkAudio.AkMultiPositionType
enum class AkMultiPositionType : uint8_t {
	AkMultiPositionType = 0,
	AkMultiPositionType = 1,
	AkMultiPositionType = 2,
	AkMultiPositionType = 3,
};

// Enum AkAudio.AkSpeakerConfiguration
enum class AkSpeakerConfiguration : int32_t {
	AkSpeakerConfiguration = 1,
	AkSpeakerConfiguration = 2,
	AkSpeakerConfiguration = 4,
	AkSpeakerConfiguration = 8,
	AkSpeakerConfiguration = 16,
	AkSpeakerConfiguration = 32,
	AkSpeakerConfiguration = 256,
	AkSpeakerConfiguration = 512,
	AkSpeakerConfiguration = 1024,
	AkSpeakerConfiguration = 2048,
	AkSpeakerConfiguration = 4096,
	AkSpeakerConfiguration = 8192,
	AkSpeakerConfiguration = 16384,
	AkSpeakerConfiguration = 32768,
	AkSpeakerConfiguration = 65536,
	AkSpeakerConfiguration = 131072,
	AkSpeakerConfiguration = 131073,
};

// Enum AkAudio.AkChannelConfiguration
enum class AkChannelConfiguration : uint8_t {
	AkChannelConfiguration = 0,
	AkChannelConfiguration = 1,
	AkChannelConfiguration_1 = 2,
	AkChannelConfiguration_1 = 3,
	AkChannelConfiguration_2 = 4,
	AkChannelConfiguration_1 = 5,
	AkChannelConfiguration_2 = 6,
	AkChannelConfiguration_1 = 7,
	AkChannelConfiguration_2 = 8,
	AkChannelConfiguration_1 = 9,
	AkChannelConfiguration_2 = 10,
	AkChannelConfiguration_2 = 11,
	AkChannelConfiguration_3 = 12,
	AkChannelConfiguration_3 = 13,
	AkChannelConfiguration_5 = 14,
	AkChannelConfiguration_2 = 15,
	AkChannelConfiguration_2 = 16,
	AkChannelConfiguration_2 = 17,
	AkChannelConfiguration_2 = 18,
	AkChannelConfiguration = 19,
	AkChannelConfiguration = 20,
	AkChannelConfiguration = 21,
	AkChannelConfiguration = 22,
};

// Enum AkAudio.AkAcousticPortalState
enum class AkAcousticPortalState : uint8_t {
	AkAcousticPortalState = 0,
	AkAcousticPortalState = 1,
	AkAcousticPortalState = 2,
};

// Enum AkAudio.PanningRule
enum class PanningRule : uint8_t {
	PanningRule = 0,
	PanningRule = 1,
	PanningRule = 2,
};

// Enum AkAudio.AkMeshType
enum class AkMeshType : uint8_t {
	AkMeshType = 0,
	AkMeshType = 1,
	AkMeshType = 2,
};

// Enum AkAudio.EAkHololensAudioAPI
enum class EAkHololensAudioAPI : uint8_t {
	EAkHololensAudioAP = 0,
	EAkHololensAudioAP = 1,
	EAkHololensAudioAP = 2,
	EAkHololensAudioAP = 3,
};

// Enum AkAudio.EAkCommSystem
enum class EAkCommSystem : uint8_t {
	EAkCommSystem = 0,
	EAkCommSystem = 1,
	EAkCommSystem = 2,
};

// Enum AkAudio.EAkChannelMask
enum class EAkChannelMask : uint8_t {
	EAkChannelMask = 0,
	EAkChannelMask = 1,
	EAkChannelMask = 2,
	EAkChannelMask = 3,
	EAkChannelMask = 4,
	EAkChannelMask = 5,
	EAkChannelMask = 8,
	EAkChannelMask = 9,
	EAkChannelMask = 10,
	EAkChannelMask = 11,
	EAkChannelMask = 12,
	EAkChannelMask = 13,
	EAkChannelMask = 14,
	EAkChannelMask = 15,
	EAkChannelMask = 16,
	EAkChannelMask = 17,
	EAkChannelMask = 18,
};

// Enum AkAudio.EAkChannelConfigType
enum class EAkChannelConfigType : uint8_t {
	EAkChannelConfigType = 0,
	EAkChannelConfigType = 1,
	EAkChannelConfigType = 2,
	EAkChannelConfigType = 3,
};

// Enum AkAudio.EAkDiffractionFlags
enum class EAkDiffractionFlags : uint8_t {
	EAkDiffractionFlags = 0,
	EAkDiffractionFlags = 1,
	EAkDiffractionFlags = 3,
	EAkDiffractionFlags = 4,
};

// Enum AkAudio.EAkPanningRule
enum class EAkPanningRule : uint8_t {
	EAkPanningRule = 0,
	EAkPanningRule = 1,
	EAkPanningRule = 2,
};

// Enum AkAudio.EAk
enum class EAk : uint8_t {
	EAk = 0,
	EAk = 1,
	EAk = 2,
	EAk = 3,
};

// Class AkAudio.AkAcousticPortal
class AAkAcousticPortal : public AVolume {

public:

	enum class Unknow InitialState; // 0x348 (1)
	float ObstructionRefreshInterval; // 0x34C (4)
	char ObstructionCollisionChannel; // 0x350 (1)

	void OpenPortal(); // Function AkAudio.AkAcousticPortal.OpenPortal(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FC090>
	enum class Unknow GetCurrentState(); // Function AkAudio.AkAcousticPortal.GetCurrentState(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FBC60>
	void ClosePortal(); // Function AkAudio.AkAcousticPortal.ClosePortal(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FBB50>
};

// Class AkAudio.AkAudioType
class UAkAudioType : public Object {

public:

	uint32_t ShortID; // 0x28 (4)
	struct TArray<Unknown> UserData; // 0x30 (16)
};

// Class AkAudio.AkAmbientSound
class AAkAmbientSound : public UActor {

public:

	struct Unknown AkAudioEvent; // 0x310 (8)
	struct Unknown AkComponent; // 0x318 (8)
	char StopWhenOwnerIsDestroyed : 0; // 0x320 (1)
	char AutoPost : 0; // 0x321 (1)

	void StopAmbientSound(); // Function AkAudio.AkAmbientSound.StopAmbientSound(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FD2D0>
	void StartAmbientSound(); // Function AkAudio.AkAmbientSound.StartAmbientSound(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FD2B0>
};

// Class AkAudio.AkAndroidInitializationSetting
class UAkAndroidInitializationSetting : public Object {

public:

	struct Unknown CommonSettings; // 0x28 (104)
	struct Unknown CommunicationSettings; // 0x90 (40)
	struct Unknown AdvancedSettings; // 0xB8 (64)

	void MigrateMultiCoreRendering(char NewValue); // Function AkAudio.AkAndroidInitializationSetting.MigrateMultiCoreRendering(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FC010>
};

// Class AkAudio.AkAssetData
class UAkAssetData : public Object {

public:

	uint32_t CachedHash; // 0x28 (4)
};

// Class AkAudio.AkAssetDataWithMedia
class UAkAssetDataWithMedia : public UAkAssetData {

public:

	struct TArray<Unknown> MediaList; // 0x60 (16)
};

// Class AkAudio.AkAssetPlatformData
class UAkAssetPlatformData : public Object {

public:

	struct Unknown CurrentAssetData; // 0x28 (8)
};

// Class AkAudio.AkAssetBase
class UAkAssetBase : public UAkAudioType {

public:

	struct Unknown PlatformAssetData; // 0x40 (8)
};

// Class AkAudio.AkAudioBank
class UAkAudioBank : public UAkAssetBase {

public:

	char AutoLoad : 0; // 0x50 (1)
	struct TMap<Unknown, Unknown> LocalizedPlatformAssetDataMap; // 0x58 (80)
	struct TSet<Unknown> LinkedAkEvents; // 0xA8 (80)
	struct Unknown CurrentLocalizedPlatformAssetData; // 0xF8 (8)
};

// Class AkAudio.AkAssetDataSwitchContainerData
class UAkAssetDataSwitchContainerData : public Object {

public:

	struct Unknown GroupValue; // 0x28 (40)
	struct Unknown DefaultGroupValue; // 0x50 (8)
	struct TArray<Unknown> MediaList; // 0x58 (16)
	struct TArray<Unknown> Children; // 0x68 (16)
};

// Class AkAudio.AkAssetDataSwitchContainer
class UAkAssetDataSwitchContainer : public UAkAssetDataWithMedia {

public:

	struct TArray<Unknown> SwitchContainers; // 0x70 (16)
	struct Unknown DefaultGroupValue; // 0x80 (8)
};

// Class AkAudio.AkAudioEventData
class UAkAudioEventData : public UAkAssetDataSwitchContainer {

public:

	float MaxAttenuationRadius; // 0x88 (4)
	char IsInfinite : 0; // 0x8C (1)
	float MinimumDuration; // 0x90 (4)
	float MaximumDuration; // 0x94 (4)
	struct TMap<Unknown, Unknown> LocalizedMedia; // 0x98 (80)
	struct TSet<Unknown> PostedEvents; // 0xE8 (80)
	struct TSet<Unknown> UserDefinedSends; // 0x138 (80)
	struct TSet<Unknown> PostedTriggers; // 0x188 (80)
	struct TSet<Unknown> GroupValues; // 0x1D8 (80)
};

// Class AkAudio.AkAudioEvent
class UAkAudioEvent : public UAkAssetBase {

public:

	struct TMap<Unknown, Unknown> LocalizedPlatformAssetDataMap; // 0x50 (80)
	struct Unknown RequiredBank; // 0xA0 (8)
	struct Unknown CurrentLocalizedPlatformData; // 0xB0 (8)
	float MaxAttenuationRadius; // 0xB8 (4)
	char IsInfinite : 0; // 0xBC (1)
	float MinimumDuration; // 0xC0 (4)
	float MaximumDuration; // 0xC4 (4)

	float GetMinimumDuration(); // Function AkAudio.AkAudioEvent.GetMinimumDuration(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FBD20>
	float GetMaximumDuration(); // Function AkAudio.AkAudioEvent.GetMaximumDuration(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FBCF0>
	float GetMaxAttenuationRadius(); // Function AkAudio.AkAudioEvent.GetMaxAttenuationRadius(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FBCC0>
	char GetIsInfinite(); // Function AkAudio.AkAudioEvent.GetIsInfinite(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FBC90>
};

// Class AkAudio.AkGameObject
class UAkGameObject : public USceneComponent {

public:

	struct Unknown AkAudioEvent; // 0x238 (8)
	struct FString EventName; // 0x240 (16)
	char bAutoRegisterWithWwise : 0; // 0x250 (1)

	void Stop(); // Function AkAudio.AkGameObject.Stop(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x16022F0>
	void PostAssociatedAkEventAsync(struct Unknown WorldContextObject, int32_t CallbackMask, struct FDelegate& PostEventCallback, struct TArray<Unknown>& ExternalSources, struct Unknown LatentInfo, int32_t& PlayingID); // Function AkAudio.AkGameObject.PostAssociatedAkEventAsync(BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x16002B0>
	int32_t PostAssociatedAkEvent(int32_t CallbackMask, struct FDelegate& PostEventCallback, struct TArray<Unknown>& ExternalSources); // Function AkAudio.AkGameObject.PostAssociatedAkEvent(BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1600110>
	void PostAkEventAsync(struct Unknown WorldContextObject, struct Unknown AkEvent, int32_t& PlayingID, int32_t CallbackMask, struct FDelegate& PostEventCallback, struct TArray<Unknown>& ExternalSources, struct Unknown LatentInfo); // Function AkAudio.AkGameObject.PostAkEventAsync(BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FF970>
	int32_t PostAkEvent(struct Unknown AkEvent, int32_t CallbackMask, struct FDelegate& PostEventCallback, struct TArray<Unknown>& ExternalSources, struct FString in_EventName); // Function AkAudio.AkGameObject.PostAkEvent(BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FF740>
};

// Class AkAudio.AkComponent
class UAkComponent : public UAkGameObject {

public:

	char bUseSpatialAudio : 0; // 0x258 (1)
	char OcclusionCollisionChannel; // 0x260 (1)
	char EnableSpotReflectors : 0; // 0x264 (1)
	struct Unknown EarlyReflectionAuxBus; // 0x268 (8)
	struct FString EarlyReflectionAuxBusName; // 0x270 (16)
	int32_t EarlyReflectionOrder; // 0x280 (4)
	float EarlyReflectionBusSendGain; // 0x284 (4)
	float EarlyReflectionMaxPathLength; // 0x288 (4)
	float roomReverbAuxBusGain; // 0x28C (4)
	int32_t diffractionMaxEdges; // 0x290 (4)
	int32_t diffractionMaxPaths; // 0x294 (4)
	float diffractionMaxPathLength; // 0x298 (4)
	char DrawFirstOrderReflections : 0; // 0x29C (1)
	char DrawSecondOrderReflections : 0; // 0x29C (1)
	char DrawHigherOrderReflections : 0; // 0x29C (1)
	char DrawDiffraction : 0; // 0x29C (1)
	char StopWhenOwnerDestroyed : 0; // 0x2A0 (1)
	float RoomIterationInterv; // 0x2A4 (4)
	float AttenuationScalingFactor; // 0x2A8 (4)
	float OcclusionRefreshInterval; // 0x2AC (4)
	char bUseReverbVolumes : 0; // 0x2B0 (1)
	struct TSet<Unknown> Listeners; // 0x3A0 (80)
	struct TSet<Unknown> Emitters; // 0x3F0 (80)

	void UseReverbVolumes(char inUseReverbVolumes); // Function AkAudio.AkComponent.UseReverbVolumes(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FD4D0>
	void UseEarlyReflections(struct Unknown AuxBus, int32_t Order, float BusSendGain, float MaxPathLength, char SpotReflectors, struct FString AuxBusName); // Function AkAudio.AkComponent.UseEarlyReflections(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FD2F0>
	void SetSwitch(struct Unknown SwitchValue, struct FString SwitchGroup, struct FString SwitchState); // Function AkAudio.AkComponent.SetSwitch(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FD0E0>
	void SetStopWhenOwnerDestroyed(char bStopWhenOwnerDestroyed); // Function AkAudio.AkComponent.SetStopWhenOwnerDestroyed(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FD050>
	void SetRTPCValue(struct Unknown RTPCValue, float Value, int32_t InterpolationTimeMs, struct FString RTPC); // Function AkAudio.AkComponent.SetRTPCValue(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FCEA0>
	void SetOutputBusVolume(float BusVolume); // Function AkAudio.AkComponent.SetOutputBusVolume(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FCE20>
	void SetListeners(struct TArray<Unknown>& Listeners); // Function AkAudio.AkComponent.SetListeners(Final|BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FCD70>
	void SetEarlyReflectionsVolume(float SendVolume); // Function AkAudio.AkComponent.SetEarlyReflectionsVolume(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FCC60>
	void SetEarlyReflectionsAuxBus(struct FString AuxBusName); // Function AkAudio.AkComponent.SetEarlyReflectionsAuxBus(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FCBC0>
	void SetAttenuationScalingFactor(float Value); // Function AkAudio.AkComponent.SetAttenuationScalingFactor(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FCAC0>
	void PostTrigger(struct Unknown TriggerValue, struct FString Trigger); // Function AkAudio.AkComponent.PostTrigger(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FC850>
	void PostAssociatedAkEventAndWaitForEndAsync(int32_t& PlayingID, struct TArray<Unknown>& ExternalSources, struct Unknown LatentInfo); // Function AkAudio.AkComponent.PostAssociatedAkEventAndWaitForEndAsync(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FC680>
	int32_t PostAssociatedAkEventAndWaitForEnd(struct TArray<Unknown>& ExternalSources, struct Unknown LatentInfo); // Function AkAudio.AkComponent.PostAssociatedAkEventAndWaitForEnd(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FC520>
	int32_t PostAkEventByName(struct FString in_EventName); // Function AkAudio.AkComponent.PostAkEventByName(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FC470>
	void PostAkEventAndWaitForEndAsync(struct Unknown AkEvent, int32_t& PlayingID, struct TArray<Unknown>& ExternalSources, struct Unknown LatentInfo); // Function AkAudio.AkComponent.PostAkEventAndWaitForEndAsync(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FC2A0>
	int32_t PostAkEventAndWaitForEnd(struct Unknown AkEvent, struct FString in_EventName, struct TArray<Unknown>& ExternalSources, struct Unknown LatentInfo); // Function AkAudio.AkComponent.PostAkEventAndWaitForEnd(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FC0B0>
	void GetRTPCValue(struct Unknown RTPCValue, enum class Unknow InputValueType, float& Value, enum class Unknow& OutputValueType, struct FString RTPC, int32_t PlayingID); // Function AkAudio.AkComponent.GetRTPCValue(Final|BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FBD50>
	float GetAttenuationRadius(); // Function AkAudio.AkComponent.GetAttenuationRadius(Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FBC00>
};

// Class AkAudio.AkAuxBus
class UAkAuxBus : public UAkAssetBase {

public:

	struct Unknown RequiredBank; // 0x50 (8)
};

// Class AkAudio.AkCheckBox
class UAkCheckBox : public UContentWidget {

public:

	enum class Unknow CheckedState; // 0x4D0 (1)
	struct FDelegate CheckedStateDelegate; // 0x4D4 (16)
	struct Unknown WidgetStyle; // 0x4E8 (1408)
	char HorizontalAlignment; // 0xA68 (1)
	char IsFocusable : 0; // 0xA69 (1)
	struct Unknown ThePropertyToControl; // 0xA70 (16)
	struct Unknown ItemToControl; // 0xA80 (64)
	struct FMulticastInlineDelegate AkOnCheckStateChanged; // 0xAC0 (16)
	struct FMulticastInlineDelegate OnItemDropped; // 0xAD0 (16)
	struct FMulticastInlineDelegate OnPropertyDropped; // 0xAE0 (16)

	void SetIsChecked(char InIsChecked); // Function AkAudio.AkCheckBox.SetIsChecked(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FCCE0>
	void SetCheckedState(enum class Unknow InCheckedState); // Function AkAudio.AkCheckBox.SetCheckedState(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FCB40>
	void SetAkItemId(struct Unknown& ItemId); // Function AkAudio.AkCheckBox.SetAkItemId(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FCA20>
	void SetAkBoolProperty(struct FString ItemProperty); // Function AkAudio.AkCheckBox.SetAkBoolProperty(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FC980>
	char IsPressed(); // Function AkAudio.AkCheckBox.IsPressed(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FBFE0>
	char IsChecked(); // Function AkAudio.AkCheckBox.IsChecked(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FBFB0>
	enum class Unknow GetCheckedState(); // Function AkAudio.AkCheckBox.GetCheckedState(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FBC30>
	struct FString GetAkProperty(); // Function AkAudio.AkCheckBox.GetAkProperty(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FBBB0>
	struct Unknown GetAkItemId(); // Function AkAudio.AkCheckBox.GetAkItemId(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FBB70>
};

// Class AkAudio.AkFolder
class UAkFolder : public UAkAudioType {

public:

	struct FString UnrealFolderPath; // 0x40 (16)
	struct FString WwiseFolderPath; // 0x50 (16)
};

// Class AkAudio.AkCallbackInfo
class UAkCallbackInfo : public Object {

public:

	struct Unknown AkComponent; // 0x28 (8)
};

// Class AkAudio.AkEventCallbackInfo
class UAkEventCallbackInfo : public UAkCallbackInfo {

public:

	int32_t PlayingID; // 0x30 (4)
	int32_t EventID; // 0x34 (4)
};

// Class AkAudio.AkMarkerCallbackInfo
class UAkMarkerCallbackInfo : public UAkEventCallbackInfo {

public:

	int32_t Identifier; // 0x38 (4)
	int32_t Position; // 0x3C (4)
	struct FString Label; // 0x40 (16)
};

// Class AkAudio.AkDurationCallbackInfo
class UAkDurationCallbackInfo : public UAkEventCallbackInfo {

public:

	float Duration; // 0x38 (4)
	float EstimatedDuration; // 0x3C (4)
	int32_t AudioNodeID; // 0x40 (4)
	int32_t MediaID; // 0x44 (4)
	char bStreaming : 0; // 0x48 (1)
};

// Class AkAudio.AkMusicSyncCallbackInfo
class UAkMusicSyncCallbackInfo : public UAkCallbackInfo {

public:

	int32_t PlayingID; // 0x30 (4)
	struct Unknown SegmentInfo; // 0x34 (36)
	enum class Unknow MusicSyncType; // 0x58 (1)
	struct FString UserCueName; // 0x60 (16)
};

// Class AkAudio.AkGeometryComponent
class UAkGeometryComponent : public USceneComponent {

public:

	enum class Unknow MeshType; // 0x238 (1)
	int32_t LOD; // 0x23C (4)
	float WeldingThreshold; // 0x240 (4)
	struct TMap<Unknown, Unknown> StaticMeshSurfaceOv; // 0x248 (80)
	struct Unknown CollisionMeshSurfaceOverride; // 0x298 (16)
	char bEnableDiffraction : 0; // 0x2A8 (1)
	char bEnableDiffractionOnBoundaryEdges : 0; // 0x2A8 (1)
	struct Unknown AssociatedRoom; // 0x2B0 (8)
	struct Unknown GeometryData; // 0x2C8 (80)

	void UpdateGeometry(); // Function AkAudio.AkGeometryComponent.UpdateGeometry(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1607BD0>
	void RemoveGeometry(); // Function AkAudio.AkGeometryComponent.RemoveGeometry(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1607BB0>
	void ConvertMesh(); // Function AkAudio.AkGeometryComponent.ConvertMesh(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x16075B0>
};

// Class AkAudio.AkGroupValue
class UAkGroupValue : public UAkAudioType {

public:

	struct TArray<Unknown> MediaDependencies; // 0x40 (16)
	uint32_t GroupShortID; // 0x50 (4)
};

// Class AkAudio.AkHololensInitializationSettings
class UAkHololensInitializationSettings : public Object {

public:

	struct Unknown CommonSettings; // 0x28 (104)
	struct Unknown CommunicationSettings; // 0x90 (40)
	struct Unknown AdvancedSettings; // 0xB8 (64)

	void MigrateMultiCoreRendering(char NewValue); // Function AkAudio.AkHololensInitializationSettings.MigrateMultiCoreRendering(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FC010>
};

// Class AkAudio.AkInitBankAssetData
class UAkInitBankAssetData : public UAkAssetDataWithMedia {

public:

	struct TArray<Unknown> PluginInfos; // 0x70 (16)
};

// Class AkAudio.AkInitBank
class UAkInitBank : public UAkAssetBase {

public:

	struct TArray<Unknown> AvailableAudioCultures; // 0x50 (16)
	struct FString DefaultLanguage; // 0x60 (16)
};

// Class AkAudio.AkIOSInitializationSettings
class UAkIOSInitializationSettings : public Object {

public:

	struct Unknown CommonSettings; // 0x28 (104)
	struct Unknown AudioSession; // 0x90 (12)
	struct Unknown CommunicationSettings; // 0xA0 (40)
	struct Unknown AdvancedSettings; // 0xC8 (52)
};

// Class AkAudio.AkItemBoolProperties
class UAkItemBoolProperties : public UWidget {

public:

	struct FMulticastInlineDelegate OnSelectionChanged; // 0x108 (16)
	struct FMulticastInlineDelegate OnPropertyDragged; // 0x118 (16)

	void SetSearchText(struct FString newText); // Function AkAudio.AkItemBoolProperties.SetSearchText(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x160E810>
	struct FString GetSelectedProperty(); // Function AkAudio.AkItemBoolProperties.GetSelectedProperty(Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x160E690>
	struct FString GetSearchText(); // Function AkAudio.AkItemBoolProperties.GetSearchText(Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x160E610>
};

// Class AkAudio.AkItemProperties
class UAkItemProperties : public UWidget {

public:

	struct FMulticastInlineDelegate OnSelectionChanged; // 0x108 (16)
	struct FMulticastInlineDelegate OnPropertyDragged; // 0x118 (16)

	void SetSearchText(struct FString newText); // Function AkAudio.AkItemProperties.SetSearchText(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x160E810>
	struct FString GetSelectedProperty(); // Function AkAudio.AkItemProperties.GetSelectedProperty(Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x160E710>
	struct FString GetSearchText(); // Function AkAudio.AkItemProperties.GetSearchText(Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x160E610>
};

// Class AkAudio.AkLateReverbComponent
class UAkLateReverbComponent : public USceneComponent {

public:

	char bEnable : 0; // 0x238 (1)
	struct Unknown AuxBus; // 0x240 (8)
	struct FString AuxBusName; // 0x248 (16)
	float SendLevel; // 0x258 (4)
	float FadeRate; // 0x25C (4)
	float Priority; // 0x260 (4)
	struct Unknown NextLowerPriorityComponent; // 0x268 (8)
};

// Class AkAudio.AkLinuxInitializationSettings
class UAkLinuxInitializationSettings : public Object {

public:

	struct Unknown CommonSettings; // 0x28 (104)
	struct Unknown CommunicationSettings; // 0x90 (40)
	struct Unknown AdvancedSettings; // 0xB8 (56)

	void MigrateMultiCoreRendering(char NewValue); // Function AkAudio.AkLinuxInitializationSettings.MigrateMultiCoreRendering(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FC010>
};

// Class AkAudio.AkLuminInitializationSettings
class UAkLuminInitializationSettings : public Object {

public:

	struct Unknown CommonSettings; // 0x28 (104)
	struct Unknown CommunicationSettings; // 0x90 (40)
	struct Unknown AdvancedSettings; // 0xB8 (56)

	void MigrateMultiCoreRendering(char NewValue); // Function AkAudio.AkLuminInitializationSettings.MigrateMultiCoreRendering(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FC010>
};

// Class AkAudio.AkMacInitializationSettings
class UAkMacInitializationSettings : public Object {

public:

	struct Unknown CommonSettings; // 0x28 (104)
	struct Unknown CommunicationSettings; // 0x90 (40)
	struct Unknown AdvancedSettings; // 0xB8 (56)

	void MigrateMultiCoreRendering(char NewValue); // Function AkAudio.AkMacInitializationSettings.MigrateMultiCoreRendering(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FC010>
};

// Class AkAudio.AkMediaAssetData
class UAkMediaAssetData : public Object {

public:

	char IsStreamed : 0; // 0x28 (1)
	char UseDeviceMemory : 0; // 0x29 (1)
};

// Class AkAudio.AkMediaAsset
class UAkMediaAsset : public Object {

public:

	uint32_t ID; // 0x28 (4)
	char AutoLoad : 0; // 0x2C (1)
	struct TArray<Unknown> UserData; // 0x30 (16)
	struct Unknown CurrentMediaAssetData; // 0x40 (8)
};

// Class AkAudio.AkPS4InitializationSettings
class UAkPS4InitializationSettings : public Object {

public:

	struct Unknown CommonSettings; // 0x28 (96)
	struct Unknown CommunicationSettings; // 0x88 (40)
	struct Unknown AdvancedSettings; // 0xB0 (64)

	void MigrateMultiCoreRendering(char NewValue); // Function AkAudio.AkPS4InitializationSettings.MigrateMultiCoreRendering(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x160E790>
};

// Class AkAudio.AkReverbVolume
class AAkReverbVolume : public AVolume {

public:

	char bEnabled : 0; // 0x348 (1)
	struct Unknown AuxBus; // 0x350 (8)
	struct FString AuxBusName; // 0x358 (16)
	float SendLevel; // 0x368 (4)
	float FadeRate; // 0x36C (4)
	float Priority; // 0x370 (4)
	struct Unknown LateReverbComponent; // 0x378 (8)
};

// Class AkAudio.AkRoomComponent
class UAkRoomComponent : public UAkGameObject {

public:

	char bEnable : 0; // 0x258 (1)
	struct Unknown NextLowerPriorityComponent; // 0x260 (8)
	float Priority; // 0x268 (4)
	float WallOcclusion; // 0x26C (4)
	float AuxSendLevel; // 0x270 (4)
	char AutoPost : 0; // 0x274 (1)
};

// Class AkAudio.AkSettings
class UAkSettings : public Object {

public:

	char MaxSimultaneousReverbVolumes; // 0x28 (1)
	struct Unknown WwiseProjectPath; // 0x30 (16)
	struct Unknown WwiseSoundDataFolder; // 0x40 (16)
	char bAutoConnectToWAAPI : 0; // 0x50 (1)
	char DefaultOcclusionCollisionChannel; // 0x51 (1)
	struct TMap<Unknown, Unknown> AkGeometryMap; // 0x58 (80)
	char SplitSwitchContainerMedia : 0; // 0xA8 (1)
	char SplitMediaPerFolder : 0; // 0xA9 (1)
	char UseEventBasedPackaging : 0; // 0xAA (1)
	char EnableAutomaticAssetSynchronization : 0; // 0xAB (1)
	struct TSoftClassPtr<UObject> ComponentClass; // 0xB0 (40)
	struct FString CommandletCommitMessage; // 0xD8 (16)
	struct TMap<Unknown, Unknown> UnrealCultureToWwiseCulture; // 0xE8 (80)
	char AskedToUseNewAssetManagement : 0; // 0x138 (1)
	char bEnableMultiCoreRendering : 0; // 0x139 (1)
	char MigratedEnableMultiCoreRendering : 0; // 0x13A (1)
	char FixupRedirectorsDuringMigration : 0; // 0x13B (1)
	struct Unknown WwiseWindowsInstallationPath; // 0x140 (16)
	struct Unknown WwiseMacInstallationPath; // 0x150 (16)
};

// Class AkAudio.AkSettingsPerUser
class UAkSettingsPerUser : public Object {

public:

	struct Unknown WwiseProjectPath; // 0x28 (16)
	struct Unknown WwiseWindowsInstallationPath; // 0x38 (16)
	struct Unknown WwiseMacInstallationPath; // 0x48 (16)
	char EnableAutomaticAssetSynchronization : 0; // 0x58 (1)
	struct FString WaapiIPAddress; // 0x60 (16)
	uint32_t WaapiPort; // 0x70 (4)
	char bAutoConnectToWAAPI : 0; // 0x74 (1)
	char AutoSyncSelection : 0; // 0x75 (1)
	char SuppressWwiseProjectPathWarnings : 0; // 0x76 (1)
	char SoundDataGenerationSkipLanguag : 0; // 0x77 (1)
};

// Class AkAudio.AkSlider
class UAkSlider : public UWidget {

public:

	float Value; // 0x108 (4)
	struct FDelegate ValueDelegate; // 0x10C (16)
	struct Unknown WidgetStyle; // 0x120 (832)
	char Orientation; // 0x460 (1)
	struct Unknown SliderBarColor; // 0x464 (16)
	struct Unknown SliderHandleColor; // 0x474 (16)
	char IndentHandle : 0; // 0x484 (1)
	char Locked : 0; // 0x485 (1)
	float StepSize; // 0x488 (4)
	char IsFocusable : 0; // 0x48C (1)
	struct Unknown ThePropertyToControl; // 0x490 (16)
	struct Unknown ItemToControl; // 0x4A0 (64)
	struct FMulticastInlineDelegate OnValueChanged; // 0x4E0 (16)
	struct FMulticastInlineDelegate OnItemDropped; // 0x4F0 (16)
	struct FMulticastInlineDelegate OnPropertyDropped; // 0x500 (16)

	void SetValue(float InValue); // Function AkAudio.AkSlider.SetValue(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1612A10>
	void SetStepSize(float InValue); // Function AkAudio.AkSlider.SetStepSize(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x16128C0>
	void SetSliderHandleColor(struct Unknown InValue); // Function AkAudio.AkSlider.SetSliderHandleColor(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1612840>
	void SetSliderBarColor(struct Unknown InValue); // Function AkAudio.AkSlider.SetSliderBarColor(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x16127C0>
	void SetLocked(char InValue); // Function AkAudio.AkSlider.SetLocked(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1612730>
	void SetIndentHandle(char InValue); // Function AkAudio.AkSlider.SetIndentHandle(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x16126A0>
	void SetAkSliderItemProperty(struct FString ItemProperty); // Function AkAudio.AkSlider.SetAkSliderItemProperty(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1612600>
	void SetAkSliderItemId(struct Unknown& ItemId); // Function AkAudio.AkSlider.SetAkSliderItemId(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1612560>
	float GetValue(); // Function AkAudio.AkSlider.GetValue(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1612390>
	struct FString GetAkSliderItemProperty(); // Function AkAudio.AkSlider.GetAkSliderItemProperty(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x16122B0>
	struct Unknown GetAkSliderItemId(); // Function AkAudio.AkSlider.GetAkSliderItemId(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1612270>
};

// Class AkAudio.AkSpatialAudioVolume
class AAkSpatialAudioVolume : public AVolume {

public:

	struct Unknown SurfaceReflectorSet; // 0x348 (8)
	struct Unknown LateReverb; // 0x350 (8)
	struct Unknown Room; // 0x358 (8)
};

// Class AkAudio.AkSpotReflector
class AAkSpotReflector : public UActor {

public:

	struct Unknown EarlyReflectionAuxBus; // 0x310 (8)
	struct FString EarlyReflectionAuxBusName; // 0x318 (16)
	struct Unknown AcousticTexture; // 0x328 (8)
	float DistanceScalingFactor; // 0x330 (4)
	float Level; // 0x334 (4)
};

// Class AkAudio.AkSurfaceReflectorSetComponent
class UAkSurfaceReflectorSetComponent : public USceneComponent {

public:

	char bEnableSurfaceReflectors : 0; // 0x238 (1)
	struct TArray<Unknown> AcousticPolys; // 0x240 (16)
	char bEnableDiffraction : 0; // 0x250 (1)
	char bEnableDiffractionOnBoundaryEdges : 0; // 0x250 (1)
	struct Unknown AssociatedRoom; // 0x258 (8)

	void UpdateSurfaceReflectorSet(); // Function AkAudio.AkSurfaceReflectorSetComponent.UpdateSurfaceReflectorSet(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1612E30>
	void SendSurfaceReflectorSet(); // Function AkAudio.AkSurfaceReflectorSetComponent.SendSurfaceReflectorSet(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1612540>
	void RemoveSurfaceReflectorSet(); // Function AkAudio.AkSurfaceReflectorSetComponent.RemoveSurfaceReflectorSet(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1612520>
};

// Class AkAudio.AkSwitchInitializationSettings
class UAkSwitchInitializationSettings : public Object {

public:

	struct Unknown CommonSettings; // 0x28 (104)
	struct Unknown CommunicationSettings; // 0x90 (40)
	struct Unknown AdvancedSettings; // 0xB8 (56)

	void MigrateMultiCoreRendering(char NewValue); // Function AkAudio.AkSwitchInitializationSettings.MigrateMultiCoreRendering(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FC010>
};

// Class AkAudio.AkTVOSInitializationSettings
class UAkTVOSInitializationSettings : public Object {

public:

	struct Unknown CommonSettings; // 0x28 (104)
	struct Unknown AudioSession; // 0x90 (12)
	struct Unknown CommunicationSettings; // 0xA0 (40)
	struct Unknown AdvancedSettings; // 0xC8 (52)
};

// Class AkAudio.AkWindowsInitializationSetting
class UAkWindowsInitializationSetting : public Object {

public:

	struct Unknown CommonSettings; // 0x28 (104)
	struct Unknown CommunicationSettings; // 0x90 (40)
	struct Unknown AdvancedSettings; // 0xB8 (64)

	void MigrateMultiCoreRendering(char NewValue); // Function AkAudio.AkWindowsInitializationSettings.MigrateMultiCoreRendering(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FC010>
};

// Class AkAudio.AkWwiseTree
class UAkWwiseTree : public UWidget {

public:

	struct FMulticastInlineDelegate OnSelectionChanged; // 0x108 (16)
	struct FMulticastInlineDelegate OnItemDragged; // 0x118 (16)

	void SetSearchText(struct FString newText); // Function AkAudio.AkWwiseTree.SetSearchText(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x160E810>
	struct Unknown GetSelectedItem(); // Function AkAudio.AkWwiseTree.GetSelectedItem(Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1619100>
	struct FString GetSearchText(); // Function AkAudio.AkWwiseTree.GetSearchText(Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1619080>
};

// Class AkAudio.AkWwiseTreeSelector
class UAkWwiseTreeSelector : public UWidget {

public:

	struct FMulticastInlineDelegate OnSelectionChanged; // 0x108 (16)
	struct FMulticastInlineDelegate OnItemDragged; // 0x118 (16)
};

// Class AkAudio.AkXboxOneInitializationSetting
class UAkXboxOneInitializationSetting : public Object {

public:

	struct Unknown CommonSettings; // 0x28 (96)
	struct Unknown ApuHeapSettings; // 0x88 (8)
	struct Unknown CommunicationSettings; // 0x90 (40)
	struct Unknown AdvancedSettings; // 0xB8 (60)

	void MigrateMultiCoreRendering(char NewValue); // Function AkAudio.AkXboxOneInitializationSetting.MigrateMultiCoreRendering(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15FC010>
};

// Class AkAudio.InterpTrackAkAudioEvent
class UInterpTrackAkAudioEvent : public UInterpTrackVectorBase {

public:

	struct TArray<Unknown> Events; // 0x90 (16)
	char bContinueEventOnMatineeEnd : 0; // 0xA0 (1)
};

// Class AkAudio.InterpTrackAkAudioRTPC
class UInterpTrackAkAudioRTPC : public UInterpTrackFloatBase {

public:

	struct FString Param; // 0x90 (16)
	char bPlayOnReverse : 0; // 0xA0 (1)
	char bContinueRTPCOnMatineeEnd : 0; // 0xA0 (1)
};

// Class AkAudio.InterpTrackInstAkAudioEvent
class UInterpTrackInstAkAudioEvent : public UInterpTrackInst {

public:

	float LastUpdatePosition; // 0x28 (4)
};

// Class AkAudio.InterpTrackInstAkAudioRTPC
class UInterpTrackInstAkAudioRTPC : public UInterpTrackInst {

public:

	float LastUpdatePosition; // 0x28 (4)
};

// Class AkAudio.MovieSceneAkAudioEv
class UMovieSceneAkAudioEvjectToText : public UMovieSceneSection {

public:

	struct Unknown Event; // 0x120 (8)
	char RetriggerEvent : 0; // 0x128 (1)
	int32_t ScrubTailLengthMs; // 0x12C (4)
	char StopAtSectionEnd : 0; // 0x130 (1)
	struct FString EventName; // 0x138 (16)
	float MaxSourceDuration; // 0x168 (4)
	struct FString MaxDurationSourceID; // 0x170 (16)
};

// Class AkAudio.MovieSceneAkTrack
class UMovieSceneAkTrack : public UMovieSceneTrack {

public:

	struct TArray<Unknown> Sections; // 0x58 (16)
	char bIsAMasterTrack : 0; // 0x68 (1)
};

// Class AkAudio.MovieSceneAkAudioRTPCSection
class UMovieSceneAkAudioRTPCSection : public UMovieSceneSection {

public:

	struct Unknown RTPC; // 0xE0 (8)
	struct FString Name; // 0xE8 (16)
	struct Unknown FloatCurve; // 0xF8 (128)
	struct Unknown FloatChannelSerializationHelper; // 0x178 (48)
	struct Unknown RTPCChannel; // 0x1A8 (160)
};

// Class AkAudio.PostEventAsync
class UPostEventAsync : public UBlueprintAsyncActionBase {

public:

	struct FMulticastInlineDelegate Completed; // 0x30 (16)

	struct Unknown PostEventAsync(struct Unknown WorldContextObject, struct Unknown AkEvent, struct Unknown Actor, int32_t CallbackMask, struct FDelegate& PostEventCallback, struct TArray<Unknown>& ExternalSources, char bStopWhenAttachedToDestroyed); // Function AkAudio.PostEventAsync.PostEventAsync(Final|BlueprintCosmetic|Native|Static|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x16193D0>
	void PollPostEventFuture(); // Function AkAudio.PostEventAsync.PollPostEventFuture(Final|Native|Private) // <BravoHotelClient-Win64-Shipping.protected.exe+0x16193B0>
};

// Class AkAudio.PostEventAtLocationAsync
class UPostEventAtLocationAsync : public UBlueprintAsyncActionBase {

public:

	struct FMulticastInlineDelegate Completed; // 0x30 (16)

	struct Unknown PostEventAtLocationAsync(struct Unknown WorldContextObject, struct Unknown AkEvent, struct Unknown Location, struct Unknown Orientation); // Function AkAudio.PostEventAtLocationAsync.PostEventAtLocationAsync(Final|BlueprintCosmetic|Native|Static|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x161A4C0>
	void PollPostEventFuture(); // Function AkAudio.PostEventAtLocationAsync.PollPostEventFuture(Final|Native|Private) // <BravoHotelClient-Win64-Shipping.protected.exe+0x161A4A0>
};

// ScriptStruct AkAudio.AkExternalSourceInfo
struct FAkExternalSourceInfo {
	struct FString ExternalSrcName; // 0x0 (16)
	enum class Unknow CodecID; // 0x10 (1)
	struct FString Filename; // 0x18 (16)
	struct Unknown ExternalSourceAsset; // 0x28 (8)
	char IsStreamed : 0; // 0x30 (1)
};

// ScriptStruct AkAudio.AkAmbSoundCheckpointRecord
struct FAkAmbSoundCheckpointRecord {
	char bCurrentlyPlaying : 0; // 0x0 (1)
};

// ScriptStruct AkAudio.AkAdvancedInitializationSettings
struct FAkAdvancedInitializationSettings {
	uint32_t IO_MemorySize; // 0x0 (4)
	uint32_t IO_Granularity; // 0x4 (4)
	float TargetAutoStreamBufferLength; // 0x8 (4)
	char UseStreamCache : 0; // 0xC (1)
	uint32_t MaximumPinnedBytesInCache; // 0x10 (4)
	char EnableGameSyncPreparation : 0; // 0x14 (1)
	uint32_t ContinuousPlaybackLookAhead; // 0x18 (4)
	uint32_t MonitorQueuePoolSize; // 0x1C (4)
	uint32_t MaximumHardwareTimeoutMs; // 0x20 (4)
	char DebugOutOfRangeCheckEnabled : 0; // 0x24 (1)
	float DebugOutOfRangeLimit; // 0x28 (4)
	struct Unknown SpatialAudioSettings; // 0x2C (8)
};

// ScriptStruct AkAudio.AkAdvancedSpatialAudioSettings
struct FAkAdvancedSpatialAudioSettings {
	float DiffractionShadowAttenuationFactor; // 0x0 (4)
	float DiffractionShadowDegrees; // 0x4 (4)
};

// ScriptStruct AkAudio.AkAdvancedInitializationSettingsWithMultiCoreRendering
struct FAkAdvancedInitializationSettingsWithMultiCoreRendering : FAkAdvancedInitializationSettings {
	char EnableMultiCoreRendering : 0; // 0x34 (1)
};

// ScriptStruct AkAudio.AkAndroidAdvancedInitializationSetting
struct FAkAndroidAdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering {
	uint32_t AudioAPI; // 0x38 (4)
	char RoundFrameSizeToHardwareSize : 0; // 0x3C (1)
};

// ScriptStruct AkAudio.AkAudioSession
struct FAkAudioSession {
	enum class Unknow AudioSessionCategory; // 0x0 (4)
	uint32_t AudioSessionCategoryOptions; // 0x4 (4)
	enum class Unknow AudioSessionMode; // 0x8 (4)
};

// ScriptStruct AkAudio.AkSegmentInfo
struct FAkSegmentInfo {
	int32_t CurrentPosition; // 0x0 (4)
	int32_t PreEntryDuration; // 0x4 (4)
	int32_t ActiveDuration; // 0x8 (4)
	int32_t PostExitDuration; // 0xC (4)
	int32_t RemainingLookAheadTime; // 0x10 (4)
	float BeatDuration; // 0x14 (4)
	float BarDuration; // 0x18 (4)
	float GridDuration; // 0x1C (4)
	float GridOffset; // 0x20 (4)
};

// ScriptStruct AkAudio.AkMidiEventBase
struct FAkMidiEventBase {
	enum class Unknow Type; // 0x0 (1)
	char Chan; // 0x1 (1)
};

// ScriptStruct AkAudio.AkMidiProgramChange
struct FAkMidiProgramChange : FAkMidiEventBase {
	char ProgramNum; // 0x2 (1)
};

// ScriptStruct AkAudio.AkMidiChannelAftertouch
struct FAkMidiChannelAftertouch : FAkMidiEventBase {
	char Value; // 0x2 (1)
};

// ScriptStruct AkAudio.AkMidiNoteAftertouch
struct FAkMidiNoteAftertouch : FAkMidiEventBase {
	char Note; // 0x2 (1)
	char Value; // 0x3 (1)
};

// ScriptStruct AkAudio.AkMidiPitchBend
struct FAkMidiPitchBend : FAkMidiEventBase {
	char ValueLsb; // 0x2 (1)
	char ValueMsb; // 0x3 (1)
	int32_t FullValue; // 0x4 (4)
};

// ScriptStruct AkAudio.AkMidiCc
struct FAkMidiCc : FAkMidiEventBase {
	enum class Unknow Cc; // 0x2 (1)
	char Value; // 0x3 (1)
};

// ScriptStruct AkAudio.AkMidiNoteOnOff
struct FAkMidiNoteOnOff : FAkMidiEventBase {
	char Note; // 0x2 (1)
	char Velocity; // 0x3 (1)
};

// ScriptStruct AkAudio.AkMidiGeneric
struct FAkMidiGeneric : FAkMidiEventBase {
	char Param1; // 0x2 (1)
	char Param2; // 0x3 (1)
};

// ScriptStruct AkAudio.AkChannelMask
struct FAkChannelMask {
	int32_t ChannelMask; // 0x0 (4)
};

// ScriptStruct AkAudio.AkGeometrySurfaceOv
struct FAkGeometrySurfaceOv {
	struct Unknown AcousticTexture; // 0x0 (8)
	char bEnableOcclusionOverride : 0; // 0x8 (1)
	float OcclusionValue; // 0xC (4)
};

// ScriptStruct AkAudio.AkGeometryData
struct FAkGeometryData {
	struct TArray<Unknown> Vertices; // 0x0 (16)
	struct TArray<Unknown> Surfaces; // 0x10 (16)
	struct TArray<Unknown> Triangles; // 0x20 (16)
	struct TArray<Unknown> ToOverrideAcousticTexture; // 0x30 (16)
	struct TArray<Unknown> ToOverrideOcclusion; // 0x40 (16)
};

// ScriptStruct AkAudio.AkTriangle
struct FAkTriangle {
	uint16_t Point0; // 0x0 (2)
	uint16_t Point1; // 0x2 (2)
	uint16_t Point2; // 0x4 (2)
	uint16_t Surface; // 0x6 (2)
};

// ScriptStruct AkAudio.AkAcousticSurface
struct FAkAcousticSurface {
	uint32_t Texture; // 0x0 (4)
	float Occlusion; // 0x4 (4)
	struct FString Name; // 0x8 (16)
};

// ScriptStruct AkAudio.AkHololensAdvancedInitializationSettings
struct FAkHololensAdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering {
	uint32_t AudioAPI; // 0x38 (4)
	char GlobalFocus : 0; // 0x3C (1)
	char UseHeadMountedDisplayAudioDevice : 0; // 0x3D (1)
};

// ScriptStruct AkAudio.AkPluginInfo
struct FAkPluginInfo {
	struct FString Name; // 0x0 (16)
	uint32_t PluginID; // 0x10 (4)
	struct FString dll; // 0x18 (16)
};

// ScriptStruct AkAudio.AkCommonInitializationSettings
struct FAkCommonInitializationSettings {
	uint32_t MaximumNumberOfMemoryPools; // 0x0 (4)
	uint32_t MaximumNumberOfPositioningPaths; // 0x4 (4)
	uint32_t CommandQueueSize; // 0x8 (4)
	uint32_t SamplesPerFrame; // 0xC (4)
	struct Unknown MainOutputSettings; // 0x10 (40)
	float StreamingLookAheadRatio; // 0x38 (4)
	uint16_t NumberOfRefillsInVoice; // 0x3C (2)
	struct Unknown SpatialAudioSettings; // 0x40 (32)
};

// ScriptStruct AkAudio.AkSpatialAudioSettings
struct FAkSpatialAudioSettings {
	uint32_t MaxSoundPropagationDepth; // 0x0 (4)
	uint32_t DiffractionFlags; // 0x4 (4)
	float MovementThreshold; // 0x8 (4)
	uint32_t NumberOfPrimaryRays; // 0xC (4)
	uint32_t ReflectionOrder; // 0x10 (4)
	char EnableDiffractionOnReflections : 0; // 0x14 (1)
	char EnableDirectPathDiffraction : 0; // 0x15 (1)
	float MaximumPathLength; // 0x18 (4)
	char EnableTransmission : 0; // 0x1C (1)
};

// ScriptStruct AkAudio.AkMainOutputSettings
struct FAkMainOutputSettings {
	struct FString AudioDeviceShareset; // 0x0 (16)
	uint32_t DeviceID; // 0x10 (4)
	enum class Unknow PanningRule; // 0x14 (4)
	enum class Unknow ChannelConfigType; // 0x18 (4)
	uint32_t ChannelMask; // 0x1C (4)
	uint32_t NumberOfChannels; // 0x20 (4)
};

// ScriptStruct AkAudio.AkCommonInitializationSettingsWithSampleRate
struct FAkCommonInitializationSettingsWithSampleRate : FAkCommonInitializationSettings {
	uint32_t SampleRate; // 0x60 (4)
};

// ScriptStruct AkAudio.AkCommunicationSettings
struct FAkCommunicationSettings {
	uint32_t PoolSize; // 0x0 (4)
	uint16_t DiscoveryBroadcastPort; // 0x4 (2)
	uint16_t CommandPort; // 0x6 (2)
	uint16_t NotificationPort; // 0x8 (2)
	struct FString NetworkName; // 0x10 (16)
};

// ScriptStruct AkAudio.AkCommunicationSettingsWithCommSelection
struct FAkCommunicationSettingsWithCommSelection : FAkCommunicationSettings {
	enum class Unknow CommunicationSystem; // 0x20 (4)
};

// ScriptStruct AkAudio.AkCommunicationSettingsWithSystemInitialization
struct FAkCommunicationSettingsWithSystemInitialization : FAkCommunicationSettings {
	char InitializeSystemComms : 0; // 0x20 (1)
};

// ScriptStruct AkAudio.AkBoolPropertyToControl
struct FAkBoolPropertyToControl {
	struct FString ItemProperty; // 0x0 (16)
};

// ScriptStruct AkAudio.AkPropertyToControl
struct FAkPropertyToControl {
	struct FString ItemProperty; // 0x0 (16)
};

// ScriptStruct AkAudio.AkPS4AdvancedInitializationSettings
struct FAkPS4AdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering {
	uint32_t ACPBatchBufferSize; // 0x38 (4)
	char UseHardwareCodecLowLatencyMode : 0; // 0x3C (1)
};

// ScriptStruct AkAudio.AkGeometrySurfacePropertiesToMap
struct FAkGeometrySurfacePropertiesToMap {
	struct Unknown AcousticTexture; // 0x0 (40)
	float OcclusionValue; // 0x28 (4)
};

// ScriptStruct AkAudio.AkWwiseItemToControl
struct FAkWwiseItemToControl {
	struct Unknown ItemPicked; // 0x0 (48)
	struct FString ItemPath; // 0x30 (16)
};

// ScriptStruct AkAudio.AkWwiseObjectDetails
struct FAkWwiseObjectDetails {
	struct FString ItemName; // 0x0 (16)
	struct FString ItemPath; // 0x10 (16)
	struct FString ItemId; // 0x20 (16)
};

// ScriptStruct AkAudio.AkPoly
struct FAkPoly {
	struct Unknown Texture; // 0x0 (8)
	float Occlusion; // 0x8 (4)
	char EnableSurface : 0; // 0xC (1)
};

// ScriptStruct AkAudio.AkWaapiFieldNames
struct FAkWaapiFieldNames {
	struct FString FieldName; // 0x0 (16)
};

// ScriptStruct AkAudio.AkWaapiUri
struct FAkWaapiUri {
	struct FString Uri; // 0x0 (16)
};

// ScriptStruct AkAudio.AkWindowsAdvancedInitializationSettingl
struct FAkWindowsAdvancedInitializationSettingl : FAkAdvancedInitializationSettingsWithMultiCoreRendering {
	uint32_t AudioAPI; // 0x38 (4)
	char GlobalFocus : 0; // 0x3C (1)
	char UseHeadMountedDisplayAudioDevice : 0; // 0x3D (1)
};

// ScriptStruct AkAudio.AkXboxOneApuHeapInitializationSettings
struct FAkXboxOneApuHeapInitializationSettings {
	uint32_t CachedSize; // 0x0 (4)
	uint32_t NonCachedSize; // 0x4 (4)
};

// ScriptStruct AkAudio.AkXboxOneAdvancedInitializationSettinga
struct FAkXboxOneAdvancedInitializationSetting : FAkAdvancedInitializationSettingsWithMultiCoreRendering {
	uint16_t MaximumNumberOfXMAVoices; // 0x38 (2)
	char UseHardwareCodecLowLatencyMode : 0; // 0x3A (1)
};

// ScriptStruct AkAudio.AkAudioEventTrackKey
struct FAkAudioEventTrackKey {
	float Time; // 0x0 (4)
	struct Unknown AkAudioEvent; // 0x8 (8)
	struct FString EventName; // 0x10 (16)
};

// ScriptStruct AkAudio.MovieSceneAkAudioEv
struct FMovieSceneAkAudioEv : FMovieSceneEvalTemplate {
	struct Unknown Section; // 0x20 (8)
};

// ScriptStruct AkAudio.MovieSceneAkAudioRTPCTemplate
struct FMovieSceneAkAudioRTPCTemplate : FMovieSceneEvalTemplate {
	struct Unknown Section; // 0x20 (8)
};

// ScriptStruct AkAudio.MovieSceneFloatChannelSerializationHelper
struct FMovieSceneFloatChannelSerializationHelper {
	char PreInfinityExtrap; // 0x0 (1)
	char PostInfinityExtrap; // 0x1 (1)
	struct TArray<Unknown> Times; // 0x8 (16)
	struct TArray<Unknown> Values; // 0x18 (16)
	float DefaultValue; // 0x28 (4)
	char bHasDefaultValue : 0; // 0x2C (1)
};

// ScriptStruct AkAudio.MovieSceneFloatValueSerializationHelper
struct FMovieSceneFloatValueSerializationHelper {
	float Value; // 0x0 (4)
	char InterpMode; // 0x4 (1)
	char TangentMode; // 0x5 (1)
	struct Unknown Tangent; // 0x8 (20)
};

// ScriptStruct AkAudio.MovieSceneTangentDataSerializationHelper
struct FMovieSceneTangentDataSerializationHelper {
	float ArriveTangent; // 0x0 (4)
	float LeaveTangent; // 0x4 (4)
	char TangentWeightMode; // 0x8 (1)
	float ArriveTangentWeight; // 0xC (4)
	float LeaveTangentWeight; // 0x10 (4)
};

// Function AkAudio.AkAcousticPortal.OpenPortal
inline void AAkAcousticPortal::OpenPortal() {
	static auto fn = UObject::FindObject<UFunction>("Function AkAudio.AkAcousticPortal.OpenPortal");

	struct OpenPortal_Params {
		
	}; OpenPortal_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function AkAudio.AkAcousticPortal.GetCurrentState
inline enum class Unknow AAkAcousticPortal::GetCurrentState() {
	static auto fn = UObject::FindObject<UFunction>("Function AkAudio.AkAcousticPortal.GetCurrentState");

	struct GetCurrentState_Params {
		
		enum class Unknow ReturnValue;

	}; GetCurrentState_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;

	return params.ReturnValue;
}

// Function AkAudio.AkAcousticPortal.ClosePortal
inline void AAkAcousticPortal::ClosePortal() {
