// Enum AkAudio.EAkCallbackType
enum class EAkCallbackType : uint8 {
	EAkCallbackType = 0,
	EAkCallbackType = 2,
	EAkCallbackType = 3,
	EAkCallbackType = 5,
	EAkCallbackType = 7,
	EAkCallbackType = 8,
	EAkCallbackType = 9,
	EAkCallbackType = 10,
	EAkCallbackType = 11,
	EAkCallbackType = 12,
	EAkCallbackType = 13,
	EAkCallbackType = 14,
	EAkCallbackType = 16,
	EAkCallbackType = 17
};

// Enum AkAudio.EAkResult
enum class EAkResult : uint8 {
	EAkResult = 0,
	EAkResult = 1,
	EAkResult = 2,
	EAkResult = 3,
	EAkResult = 4,
	EAkResult = 5,
	EAkResult = 7,
	EAkResult = 8,
	EAkResult = 9,
	EAkResult = 14,
	EAkResult = 15,
	EAkResult = 16,
	EAkResult = 17,
	EAkResult = 20,
	EAkResult = 21,
	EAkResult = 22,
	EAkResult = 23,
	EAkResult = 31,
	EAkResult = 35,
	EAkResult = 36,
	EAkResult = 37,
	EAkResult = 38,
	EAkResult = 39,
	EAkResult = 40,
	EAkResult = 41,
	EAkResult = 43,
	EAkResult = 44,
	EAkResult = 45,
	EAkResult = 46,
	EAkResult = 52,
	EAkResult = 53,
	EAkResult = 54,
	EAkResult = 56,
	EAkResult = 57,
	EAkResult = 63,
	EAkResult = 64,
	EAkResult = 66,
	EAkResult = 67,
	EAkResult = 69,
	EAkResult = 71,
	EAkResult = 72,
	EAkResult = 73,
	EAkResult = 74,
	EAkResult = 75,
	EAkResult = 76,
	EAkResult = 77,
	EAkResult = 78,
	EAkResult = 79,
	EAkResult = 80,
	EAkResult = 81,
	EAkResult = 82,
	EAkResult = 83,
	EAkResult = 84,
	EAkResult = 85,
	EAkResult = 86,
	EAkResult = 87,
	EAkResult = 88,
	EAkResult = 89,
	EAkResult = 90
};

// Enum AkAudio.EAkAndroidAudioAPI
enum class EAkAndroidAudioAPI : uint8 {
	EAkAndroidAudioAP = 0,
	EAkAndroidAudioAP = 1,
	EAkAndroidAudioAP = 2
};

// Enum AkAudio.EAkAudioSessionMode
enum class EAkAudioSessionMode : uint8 {
	EAkAudioSessionMode = 0,
	EAkAudioSessionMode = 1,
	EAkAudioSessionMode = 2,
	EAkAudioSessionMode = 3,
	EAkAudioSessionMode = 4,
	EAkAudioSessionMode = 5,
	EAkAudioSessionMode = 6,
	EAkAudioSessionMode = 7
};

// Enum AkAudio.EAkAudioSessionCategoryOptions
enum class EAkAudioSessionCategoryOptions : uint8 {
	EAkAudioSessionCategoryOptions = 0,
	EAkAudioSessionCategoryOptions = 1,
	EAkAudioSessionCategoryOptions = 2,
	EAkAudioSessionCategoryOptions = 3,
	EAkAudioSessionCategoryOptions = 4
};

// Enum AkAudio.EAkAudioSessionCategory
enum class EAkAudioSessionCategory : uint8 {
	EAkAudioSessionCategory = 0,
	EAkAudioSessionCategory = 1,
	EAkAudioSessionCategory = 2,
	EAkAudioSessionCategory = 3
};

// Enum AkAudio.EReflectionFilterBits
enum class EReflectionFilterBits : uint8 {
	EReflectionFilterBits = 0,
	EReflectionFilterBits = 1,
	EReflectionFilterBits = 2,
	EReflectionFilterBits = 3
};

// Enum AkAudio.AkCodecId
enum class AkCodecId : uint8 {
	AkCodecId = 0,
	AkCodecId = 1,
	AkCodecId = 2,
	AkCodecId = 3,
	AkCodecId = 4,
	AkCodecId = 10,
	AkCodecId = 12,
	AkCodecId = 17,
	AkCodecId = 19,
	AkCodecId = 20,
	AkCodecId = 21
};

// Enum AkAudio.EAkMidiCcValues
enum class EAkMidiCcValues : uint8 {
	EAkMidiCcValues = 0,
	EAkMidiCcValues = 1,
	EAkMidiCcValues = 2,
	EAkMidiCcValues = 3,
	EAkMidiCcValues = 4,
	EAkMidiCcValues = 5,
	EAkMidiCcValues = 6,
	EAkMidiCcValues = 7,
	EAkMidiCcValues = 8,
	EAkMidiCcValues = 9,
	EAkMidiCcValues = 10,
	EAkMidiCcValues = 11,
	EAkMidiCcValues = 12,
	EAkMidiCcValues = 13,
	EAkMidiCcValues = 14,
	EAkMidiCcValues = 15,
	EAkMidiCcValues = 16,
	EAkMidiCcValues = 17,
	EAkMidiCcValues = 18,
	EAkMidiCcValues = 19,
	EAkMidiCcValues = 20,
	EAkMidiCcValues = 21,
	EAkMidiCcValues = 22,
	EAkMidiCcValues = 23,
	EAkMidiCcValues = 24,
	EAkMidiCcValues = 25,
	EAkMidiCcValues = 26,
	EAkMidiCcValues = 27,
	EAkMidiCcValues = 28,
	EAkMidiCcValues = 29,
	EAkMidiCcValues = 30,
	EAkMidiCcValues = 31,
	EAkMidiCcValues = 32,
	EAkMidiCcValues = 33,
	EAkMidiCcValues = 34,
	EAkMidiCcValues = 35,
	EAkMidiCcValues = 36,
	EAkMidiCcValues = 37,
	EAkMidiCcValues = 38,
	EAkMidiCcValues = 39,
	EAkMidiCcValues = 40,
	EAkMidiCcValues = 41,
	EAkMidiCcValues = 42,
	EAkMidiCcValues = 43,
	EAkMidiCcValues = 44,
	EAkMidiCcValues = 45,
	EAkMidiCcValues = 46,
	EAkMidiCcValues = 47,
	EAkMidiCcValues = 52,
	EAkMidiCcValues = 53,
	EAkMidiCcValues = 54,
	EAkMidiCcValues = 55,
	EAkMidiCcValues = 56,
	EAkMidiCcValues = 57,
	EAkMidiCcValues = 58,
	EAkMidiCcValues = 59,
	EAkMidiCcValues = 60,
	EAkMidiCcValues = 61,
	EAkMidiCcValues = 62,
	EAkMidiCcValues = 63,
	EAkMidiCcValues = 64,
	EAkMidiCcValues = 65,
	EAkMidiCcValues = 66,
	EAkMidiCcValues = 67,
	EAkMidiCcValues = 68,
	EAkMidiCcValues = 69,
	EAkMidiCcValues = 70,
	EAkMidiCcValues = 71,
	EAkMidiCcValues = 72,
	EAkMidiCcValues = 73,
	EAkMidiCcValues = 74,
	EAkMidiCcValues = 75,
	EAkMidiCcValues = 76,
	EAkMidiCcValues = 77,
	EAkMidiCcValues = 78,
	EAkMidiCcValues = 79,
	EAkMidiCcValues = 80,
	EAkMidiCcValues = 81,
	EAkMidiCcValues = 82,
	EAkMidiCcValues = 83,
	EAkMidiCcValues = 91,
	EAkMidiCcValues = 92,
	EAkMidiCcValues = 93,
	EAkMidiCcValues = 94,
	EAkMidiCcValues = 95,
	EAkMidiCcValues = 96,
	EAkMidiCcValues = 97,
	EAkMidiCcValues = 98,
	EAkMidiCcValues = 99,
	EAkMidiCcValues = 120,
	EAkMidiCcValues = 121,
	EAkMidiCcValues = 122,
	EAkMidiCcValues = 123,
	EAkMidiCcValues = 124,
	EAkMidiCcValues = 125,
	EAkMidiCcValues = 126,
	EAkMidiCcValues = 127,
	EAkMidiCcValues = 128
};

// Enum AkAudio.EAkMidiEventType
enum class EAkMidiEventType : uint8 {
	EAkMidiEventType = 0,
	EAkMidiEventType = 128,
	EAkMidiEventType = 144,
	EAkMidiEventType = 160,
	EAkMidiEventType = 176,
	EAkMidiEventType = 192,
	EAkMidiEventType = 208,
	EAkMidiEventType = 224,
	EAkMidiEventType = 240,
	EAkMidiEventType = 247,
	EAkMidiEventType = 255,
	EAkMidiEventType = 256
};

// Enum AkAudio.ERTPCValueType
enum class ERTPCValueType : uint8 {
	ERTPCValueType = 0,
	ERTPCValueType = 1,
	ERTPCValueType = 2,
	ERTPCValueType = 3,
	ERTPCValueType = 4,
	ERTPCValueType = 5
};

// Enum AkAudio.EAkCurveInterpolation
enum class EAkCurveInterpolation : uint8 {
	EAkCurveInterpolation = 0,
	EAkCurveInterpolation = 1,
	EAkCurveInterpolation = 2,
	EAkCurveInterpolation = 3,
	EAkCurveInterpolation = 4,
	EAkCurveInterpolation = 5,
	EAkCurveInterpolation = 6,
	EAkCurveInterpolation = 7,
	EAkCurveInterpolation = 8,
	EAkCurveInterpolation = 8,
	EAkCurveInterpolation = 9,
	EAkCurveInterpolation = 10
};

// Enum AkAudio.AkActionOnEventType
enum class AkActionOnEventType : uint8 {
	AkActionOnEventType = 0,
	AkActionOnEventType = 1,
	AkActionOnEventType = 2,
	AkActionOnEventType = 3,
	AkActionOnEventType = 4,
	AkActionOnEventType = 5
};

// Enum AkAudio.AkMultiPositionType
enum class AkMultiPositionType : uint8 {
	AkMultiPositionType = 0,
	AkMultiPositionType = 1,
	AkMultiPositionType = 2,
	AkMultiPositionType = 3
};

// Enum AkAudio.AkSpeakerConfiguration
enum class AkSpeakerConfiguration : int32 {
	AkSpeakerConfiguration = 1,
	AkSpeakerConfiguration = 2,
	AkSpeakerConfiguration = 4,
	AkSpeakerConfiguration = 8,
	AkSpeakerConfiguration = 16,
	AkSpeakerConfiguration = 32,
	AkSpeakerConfiguration = 256,
	AkSpeakerConfiguration = 512,
	AkSpeakerConfiguration = 1024,
	AkSpeakerConfiguration = 2048,
	AkSpeakerConfiguration = 4096,
	AkSpeakerConfiguration = 8192,
	AkSpeakerConfiguration = 16384,
	AkSpeakerConfiguration = 32768,
	AkSpeakerConfiguration = 65536,
	AkSpeakerConfiguration = 131072,
	AkSpeakerConfiguration = 131073
};

// Enum AkAudio.AkChannelConfiguration
enum class AkChannelConfiguration : uint8 {
	AkChannelConfiguration = 0,
	AkChannelConfiguration = 1,
	AkChannelConfiguration_1 = 2,
	AkChannelConfiguration_1 = 3,
	AkChannelConfiguration_2 = 4,
	AkChannelConfiguration_1 = 5,
	AkChannelConfiguration_2 = 6,
	AkChannelConfiguration_1 = 7,
	AkChannelConfiguration_2 = 8,
	AkChannelConfiguration_1 = 9,
	AkChannelConfiguration_2 = 10,
	AkChannelConfiguration_2 = 11,
	AkChannelConfiguration_3 = 12,
	AkChannelConfiguration_3 = 13,
	AkChannelConfiguration_5 = 14,
	AkChannelConfiguration_2 = 15,
	AkChannelConfiguration_2 = 16,
	AkChannelConfiguration_2 = 17,
	AkChannelConfiguration_2 = 18,
	AkChannelConfiguration = 19,
	AkChannelConfiguration = 20,
	AkChannelConfiguration = 21,
	AkChannelConfiguration = 22
};

// Enum AkAudio.AkAcousticPortalState
enum class AkAcousticPortalState : uint8 {
	AkAcousticPortalState = 0,
	AkAcousticPortalState = 1,
	AkAcousticPortalState = 2
};

// Enum AkAudio.PanningRule
enum class PanningRule : uint8 {
	PanningRule = 0,
	PanningRule = 1,
	PanningRule = 2
};

// Enum AkAudio.AkMeshType
enum class AkMeshType : uint8 {
	AkMeshType = 0,
	AkMeshType = 1,
	AkMeshType = 2
};

// Enum AkAudio.EAkHololensAudioAPI
enum class EAkHololensAudioAPI : uint8 {
	EAkHololensAudioAP = 0,
	EAkHololensAudioAP = 1,
	EAkHololensAudioAP = 2,
	EAkHololensAudioAP = 3
};

// Enum AkAudio.EAkCommSystem
enum class EAkCommSystem : uint8 {
	EAkCommSystem = 0,
	EAkCommSystem = 1,
	EAkCommSystem = 2
};

// Enum AkAudio.EAkChannelMask
enum class EAkChannelMask : uint8 {
	EAkChannelMask = 0,
	EAkChannelMask = 1,
	EAkChannelMask = 2,
	EAkChannelMask = 3,
	EAkChannelMask = 4,
	EAkChannelMask = 5,
	EAkChannelMask = 8,
	EAkChannelMask = 9,
	EAkChannelMask = 10,
	EAkChannelMask = 11,
	EAkChannelMask = 12,
	EAkChannelMask = 13,
	EAkChannelMask = 14,
	EAkChannelMask = 15,
	EAkChannelMask = 16,
	EAkChannelMask = 17,
	EAkChannelMask = 18
};

// Enum AkAudio.EAkChannelConfigType
enum class EAkChannelConfigType : uint8 {
	EAkChannelConfigType = 0,
	EAkChannelConfigType = 1,
	EAkChannelConfigType = 2,
	EAkChannelConfigType = 3
};

// Enum AkAudio.EAkDiffractionFlags
enum class EAkDiffractionFlags : uint8 {
	EAkDiffractionFlags = 0,
	EAkDiffractionFlags = 1,
	EAkDiffractionFlags = 3,
	EAkDiffractionFlags = 4
};

// Enum AkAudio.EAkPanningRule
enum class EAkPanningRule : uint8 {
	EAkPanningRule = 0,
	EAkPanningRule = 1,
	EAkPanningRule = 2
};

// Enum AkAudio.EAkWindowsAudioAPI
enum class EAkWindowsAudioAPI : uint8 {
	EAkWindowsAudioAP = 0,
	EAkWindowsAudioAP = 1,
	EAkWindowsAudioAP = 2,
	EAkWindowsAudioAP = 3
};

// Class AkAudio.AkAcousticPortal
struct AAkAcousticPortal : AVolume {
	enum class Unknow InitialState; //  0x348 Size(1)
	float ObstructionRefreshInterval; //  0x34c Size(4)
	char ObstructionCollisionChannel; //  0x350 Size(1)

	void OpenPortal(); // Function AkAudio.AkAcousticPortal.OpenPortal(Final|Native|Public|BlueprintCallable) // <Game+0x15fac20>
};

// Class AkAudio.AkAudioType
struct UAkAudioType : Object {
	uint32_t ShortID; //  0x28 Size(4)
	struct TArray<Unknown> User; //  0x30 Size(10)
};

// Class AkAudio.AkAmbientSound
struct AAkAmbientSound : UActor {
	struct Unknown AkAudioEvent; //  0x310 Size(8)
	struct Unknown AkComponent; //  0x318 Size(8)
	char StopWhenOwnerIsDestroyed; //  0x320 Size(1)
	char AutoPost; //  0x321 Size(1)

	void StopAmbientSound(); // Function AkAudio.AkAmbientSound.StopAmbientSound(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <Game+0x15fbe60>
};

// Class AkAudio.AkAndroidInitializationSettings
struct UAkAndroidInitializationSettings : Object {
	struct Unknown CommonSettings; //  0x28 Size(68)
	struct Unknown CommunicationSettings; //  0x90 Size(28)
	struct Unknown AdvancedSettings; //  0xb8 Size(40)

	void MigrateMultiCoreRendering(char NewValue); // Function AkAudio.AkAndroidInitializationSettings.MigrateMultiCoreRendering(Final|Native|Public) // <Game+0x15faba0>
};

// Class AkAudio.AkAssetData
struct UAkAssetData : Object {
	uint32_t CachedHash; //  0x28 Size(4)
};

// Class AkAudio.AkAssetDataWithMedia
struct UAkAssetDataWithMedia : UAkAssetData {
	struct TArray<Unknown> MediaList; //  0x60 Size(10)
};

// Class AkAudio.AkAssetPlatformData
struct UAkAssetPlatformData : Object {
	struct Unknown CurrentAsset; //  0x28 Size(8)
};

// Class AkAudio.AkAssetBase
struct UAkAssetBase : UAkAudioType {
	struct Unknown PlatformAssetData; //  0x40 Size(8)
};

// Class AkAudio.AkAudioBank
struct UAkAudioBank : UAkAssetBase {
	char AutoLoad; //  0x50 Size(1)
	struct TMap<{}, {}>Unknown LocalizedPlatformAssetDataMap; //  0x58 Size(50)
	struct TSet<Unknown> LinkedAkEvents; //  0xa8 Size(50)
	struct Unknown CurrentLocalizedPlatformAss; //  0xf8 Size(8)
};

// Class AkAudio.AkAssetDataSwitchContainerData
struct UAkAssetDataSwitchContainerData : Object {
	struct TSoftObjectPtr<Unknown> GroupValue; //  0x28 Size(28)
	struct Unknown DefaultGroupValue; //  0x50 Size(8)
	struct TArray<Unknown> MediaList; //  0x58 Size(10)
	struct TArray<Unknown> Children; //  0x68 Size(10)
};

// Class AkAudio.AkAssetDataSwitchContainer
struct UAkAssetDataSwitchContainer : UAkAssetDataWithMedia {
	struct TArray<Unknown> SwitchContainers; //  0x70 Size(10)
	struct Unknown DefaultGroupValue; //  0x80 Size(8)
};

// Class AkAudio.AkAudioEventDio
struct UAkAudioEvent : UAkAssetDataSwitchContainer {
	float MaxAttenuationRadius; //  0x88 Size(4)
	char IsInfinite; //  0x8c Size(1)
	float MinimumDuration; //  0x90 Size(4)
	float MaximumDuration; //  0x94 Size(4)
	struct TMap<{}, {}>Unknown LocalizedMedia; //  0x98 Size(50)
	struct TSet<Unknown> PostedEvents; //  0xe8 Size(50)
	struct TSet<Unknown> User; //  0x138 Size(50)
	struct TSet<Unknown> PostedTriggers; //  0x188 Size(50)
	struct TSet<Unknown> GroupValues; //  0x1d8 Size(50)
};

// Class AkAudio.AkAudioEvent
struct UAkAudioEvent : UAkAssetBase {
	struct TMap<{}, {}>Unknown LocalizedPlatformAssetDataMap; //  0x50 Size(50)
	struct Unknown RequiredBank; //  0xa0 Size(8)
	struct Unknown CurrentLocalizedPlatformData; //  0xb0 Size(8)
	float MaxAttenuationRadius; //  0xb8 Size(4)
	char IsInfinite; //  0xbc Size(1)
	float MinimumDuration; //  0xc0 Size(4)
	float MaximumDuration; //  0xc4 Size(4)

	float GetMinimumDuration(); // Function AkAudio.AkAudioEvent.GetMinimumDuration(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game+0x15fa8b0>
};

// Class AkAudio.AkGameObject
struct UAkGameObject : USceneComponent {
	struct Unknown AkAudioEvent; //  0x238 Size(8)
	struct FString EventName; //  0x240 Size(10)
	char bAutoRegisterWithWwise; //  0x250 Size(1)

	void Stop(); // Function AkAudio.AkGameObject.Stop(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <Game+0x1600e80>
};

// Class AkAudio.AkComponent
struct UAkComponent : UAkGameObject {
	char bUseSpatialAudio; //  0x258 Size(1)
	char OcclusionCollisionChannel; //  0x260 Size(1)
	char EnableSpotReflectors; //  0x264 Size(1)
	struct Unknown EarlyReflectionAuxBus; //  0x268 Size(8)
	struct FString EarlyReflectionAuxBusName; //  0x270 Size(10)
	int32_t EarlyReflectionOrder; //  0x280 Size(4)
	float EarlyReflectionBusSendGain; //  0x284 Size(4)
	float EarlyReflectionMaxPathLength; //  0x288 Size(4)
	float roomReverbAuxBusGain; //  0x28c Size(4)
	int32_t diffractionMaxEdges; //  0x290 Size(4)
	int32_t diffractionMaxPaths; //  0x294 Size(4)
	float diffractionMaxPathLength; //  0x298 Size(4)
	char DrawFirstOrderReflections; //  0x29c Size(1)
	char DrawSecondOrderReflections; //  0x29c Size(1)
	char DrawHigherOrderReflections; //  0x29c Size(1)
	char Draw; //  0x29c Size(1)
	char StopWhenOwnerDestroyed; //  0x2a0 Size(1)
	float RoomIterationIntervye; //  0x2a4 Size(4)
	float AttenuationScalingFactor; //  0x2a8 Size(4)
	float OcclusionRefreshInterval; //  0x2ac Size(4)
	char bUseReverbVolumes; //  0x2b0 Size(1)
	struct TSet<Unknown> Listeners; //  0x3a0 Size(50)
	struct TSet<Unknown> Emitters; //  0x3f0 Size(50)

	void UseReverbVolumes(char inUseReverbVolumes); // Function AkAudio.AkComponent.UseReverbVolumes(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <Game+0x15fc060>
};

// Class AkAudio.AkAuxBus
struct UAkAuxBus : UAkAssetBase {
	struct Unknown RequiredBank; //  0x50 Size(8)
};

// Class AkAudio.AkCheckBox
struct UAkCheckBox : UContentWidget {
	enum class Unknow CheckedState; //  0x4d0 Size(1)
	struct FDelegate CheckedState; //  0x4d4 Size(10)
	struct Unknown WidgetStyle; //  0x4e8 Size(580)
	char HorizontalAlignment; //  0xa68 Size(1)
	char IsFocusable; //  0xa69 Size(1)
	struct Unknown ThePropertyToControl; //  0xa70 Size(10)
	struct Unknown ItemToControl; //  0xa80 Size(40)
	struct FMulticastInlineDelegate AkOnCheckStateChanged; //  0xac0 Size(10)
	struct FMulticastInlineDelegate OnItemDropped; //  0xad0 Size(10)
	struct FMulticastInlineDelegate OnPropertyDropped; //  0xae0 Size(10)

	void SetIsChecked(char InIsChecked); // Function AkAudio.AkCheckBox.SetIsChecked(Final|Native|Public|BlueprintCallable) // <Game+0x15fb870>
};

// Class AkAudio.AkFolder
struct UAkFolder : UAkAudioType {
	struct FString UnrealFolderPath; //  0x40 Size(10)
	struct FString WwiseFolderPath; //  0x50 Size(10)
};

// Class AkAudio.AkCallbackInfo
struct UAkCallbackInfo : Object {
	struct Unknown AkComponent; //  0x28 Size(8)
};

// Class AkAudio.AkEventCallbackInfo
struct UAkEventCallbackInfo : UAkCallbackInfo {
	int32_t PlayingID; //  0x30 Size(4)
	int32_t EventID; //  0x34 Size(4)
};

// Class AkAudio.AkMarkerCallbackInfo
struct UAkMarkerCallbackInfo : UAkEventCallbackInfo {
	int32_t Identifier; //  0x38 Size(4)
	int32_t Position; //  0x3c Size(4)
	struct FString Label; //  0x40 Size(10)
};

// Class AkAudio.AkDurationCallbackInfo
struct UAkDurationCallbackInfo : UAkEventCallbackInfo {
	float Duration; //  0x38 Size(4)
	float EstimatedDuration; //  0x3c Size(4)
	int32_t AudioNodeID; //  0x40 Size(4)
	int32_t MediaID; //  0x44 Size(4)
	char bStreaming; //  0x48 Size(1)
};

// Class AkAudio.AkMusicSyncCallbackInfo
struct UAkMusicSyncCallbackInfo : UAkCallbackInfo {
	int32_t PlayingID; //  0x30 Size(4)
	struct Unknown SegmentInfo; //  0x34 Size(24)
	enum class Unknow MusicSyncType; //  0x58 Size(1)
	struct FString UserCueName; //  0x60 Size(10)
};

// Class AkAudio.AkGeometryComponent
struct UAkGeometryComponent : USceneComponent {
	enum class Unknow MeshType; //  0x238 Size(1)
	int32_t LOD; //  0x23c Size(4)
	float WeldingThreshold; //  0x240 Size(4)
	struct TMap<{}, {}>Unknown StaticMeshSurfaceOv; //  0x248 Size(50)
	struct Unknown CollisionMeshSurfaceOverride; //  0x298 Size(10)
	char bEnableDiffraction; //  0x2a8 Size(1)
	char bEnableDiffractionOnBoundaryEdges; //  0x2a8 Size(1)
	struct Unknown AssociatedRoom; //  0x2b0 Size(8)
	struct Unknown GeometryData; //  0x2c8 Size(50)

	void UpdateGeometry(); // Function AkAudio.AkGeometryComponent.UpdateGeometry(Final|Native|Public|BlueprintCallable) // <Game+0x1606760>
};

// Class AkAudio.AkGroupValue
struct UAkGroupValue : UAkAudioType {
	struct TArray<Unknown> MediaDependencies; //  0x40 Size(10)
	uint32_t GroupShortID; //  0x50 Size(4)
};

// Class AkAudio.AkHololensInitializationSettings
struct UAkHololensInitializationSettings : Object {
	struct Unknown CommonSettings; //  0x28 Size(68)
	struct Unknown CommunicationSettings; //  0x90 Size(28)
	struct Unknown AdvancedSettings; //  0xb8 Size(40)

	void MigrateMultiCoreRendering(char NewValue); // Function AkAudio.AkHololensInitializationSettings.MigrateMultiCoreRendering(Final|Native|Public) // <Game+0x15faba0>
};

// Class AkAudio.AkInitBankAssetData
struct UAkInitBankAssetData : UAkAssetDataWithMedia {
	struct TArray<Unknown> PluginInfos; //  0x70 Size(10)
};

// Class AkAudio.AkInitBank
struct UAkInitBank : UAkAssetBase {
	struct TArray<Unknown> AvailableAudioCultures; //  0x50 Size(10)
	struct FString DefaultLanguage; //  0x60 Size(10)
};

// Class AkAudio.AkIOSInitializationSettings
struct UAkIOSInitializationSettings : Object {
	struct Unknown CommonSettings; //  0x28 Size(68)
	struct Unknown AudioSession; //  0x90 Size(c)
	struct Unknown CommunicationSettings; //  0xa0 Size(28)
	struct Unknown AdvancedSettings; //  0xc8 Size(34)
};

// Class AkAudio.AkItemBoolProperties
struct UAkItemBoolProperties : UWidget {
	struct FMulticastInlineDelegate OnSelectionChanged; //  0x108 Size(10)
	struct FMulticastInlineDelegate OnPropertyDragged; //  0x118 Size(10)

	void SetSearchText(struct FString newText); // Function AkAudio.AkItemBoolProperties.SetSearchText(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <Game+0x160d3a0>
};

// Class AkAudio.AkItemProperties
struct UAkItemProperties : UWidget {
	struct FMulticastInlineDelegate OnSelectionChanged; //  0x108 Size(10)
	struct FMulticastInlineDelegate OnPropertyDragged; //  0x118 Size(10)

	void SetSearchText(struct FString newText); // Function AkAudio.AkItemProperties.SetSearchText(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <Game+0x160d3a0>
};

// Class AkAudio.AkLateReverbComponent
struct UAkLateReverbComponent : USceneComponent {
	char bEnable; //  0x238 Size(1)
	struct Unknown AuxBus; //  0x240 Size(8)
	struct FString AuxBusName; //  0x248 Size(10)
	float SendLevel; //  0x258 Size(4)
	float FadeRate; //  0x25c Size(4)
	float Priority; //  0x260 Size(4)
	struct Unknown NextLowerPriorityComponent; //  0x268 Size(8)
};

// Class AkAudio.AkLinuxInitializationSettings
struct UAkLinuxInitializationSettings : Object {
	struct Unknown CommonSettings; //  0x28 Size(68)
	struct Unknown CommunicationSettings; //  0x90 Size(28)
	struct Unknown AdvancedSettings; //  0xb8 Size(38)

	void MigrateMultiCoreRendering(char NewValue); // Function AkAudio.AkLinuxInitializationSettings.MigrateMultiCoreRendering(Final|Native|Public) // <Game+0x15faba0>
};

// Class AkAudio.AkLuminInitializationSettings
struct UAkLuminInitializationSettings : Object {
	struct Unknown CommonSettings; //  0x28 Size(68)
	struct Unknown CommunicationSettings; //  0x90 Size(28)
	struct Unknown AdvancedSettings; //  0xb8 Size(38)

	void MigrateMultiCoreRendering(char NewValue); // Function AkAudio.AkLuminInitializationSettings.MigrateMultiCoreRendering(Final|Native|Public) // <Game+0x15faba0>
};

// Class AkAudio.AkMacInitializationSettings
struct UAkMacInitializationSettings : Object {
	struct Unknown CommonSettings; //  0x28 Size(68)
	struct Unknown CommunicationSettings; //  0x90 Size(28)
	struct Unknown AdvancedSettings; //  0xb8 Size(38)

	void MigrateMultiCoreRendering(char NewValue); // Function AkAudio.AkMacInitializationSettings.MigrateMultiCoreRendering(Final|Native|Public) // <Game+0x15faba0>
};

// Class AkAudio.AkMediaAssetDio
struct UAkMediaAsset : Object {
	char IsStreamed; //  0x28 Size(1)
	char UseDeviceMemory; //  0x29 Size(1)
};

// Class AkAudio.AkMediaAsset
struct UAkMediaAsset : Object {
	uint32_t ID; //  0x28 Size(4)
	char AutoLoad; //  0x2c Size(1)
	struct TArray<Unknown> User; //  0x30 Size(10)
	struct Unknown CurrentMediaAssetData; //  0x40 Size(8)
};

// Class AkAudio.AkPS4InitializationSettings
struct UAkPS4InitializationSettings : Object {
	struct Unknown CommonSettings; //  0x28 Size(60)
	struct Unknown CommunicationSettings; //  0x88 Size(28)
	struct Unknown AdvancedSettings; //  0xb0 Size(40)

	void MigrateMultiCoreRendering(char NewValue); // Function AkAudio.AkPS4InitializationSettings.MigrateMultiCoreRendering(Final|Native|Public) // <Game+0x160d320>
};

// Class AkAudio.AkReverbVolume
struct AAkReverbVolume : AVolume {
	char bEnabled; //  0x348 Size(1)
	struct Unknown AuxBus; //  0x350 Size(8)
	struct FString AuxBusName; //  0x358 Size(10)
	float SendLevel; //  0x368 Size(4)
	float FadeRate; //  0x36c Size(4)
	float Priority; //  0x370 Size(4)
	struct Unknown LateReverbComponent; //  0x378 Size(8)
};

// Class AkAudio.AkRoomComponent
struct UAkRoomComponent : UAkGameObject {
	char bEnable; //  0x258 Size(1)
	struct Unknown NextLowerPriorityComponent; //  0x260 Size(8)
	float Priority; //  0x268 Size(4)
	float WallOcclusion; //  0x26c Size(4)
	float AuxSendLevel; //  0x270 Size(4)
	char AutoPost; //  0x274 Size(1)
};

// Class AkAudio.AkSettings
struct UAkSettings : Object {
	char MaxSimultaneousReverbVolumes; //  0x28 Size(1)
	struct Unknown WwiseProjectPath; //  0x30 Size(10)
	struct Unknown WwiseSoundDataFolder; //  0x40 Size(10)
	char bAutoConnectToWAAPI; //  0x50 Size(1)
	char DefaultOcclusionCollisionChannel; //  0x51 Size(1)
	struct TMap<{}, {}>Unknown AkGeometryMap; //  0x58 Size(50)
	char SplitSwitchContainerMedia; //  0xa8 Size(1)
	char SplitMediaPerFolder; //  0xa9 Size(1)
	char UseEventBasedPackaging; //  0xaa Size(1)
	char EnableAutomaticAssetSynchronization; //  0xab Size(1)
	struct TSoftClassPtr<UObject> ComponentClass; //  0xb0 Size(28)
	struct FString CommandletCommitMessage; //  0xd8 Size(10)
	struct TMap<{}, {}>Unknown UnrealCultureToWwiseCulture; //  0xe8 Size(50)
	char AskedToUseNewAssetManagement; //  0x138 Size(1)
	char bEnableMultiCoreRendering; //  0x139 Size(1)
	char MigratedEnableMultiCoreRendering; //  0x13a Size(1)
	char FixupRedirectorsDuringMigration; //  0x13b Size(1)
	struct Unknown WwiseWindowsInstallationPath; //  0x140 Size(10)
	struct Unknown WwiseMacInstallationPath; //  0x150 Size(10)
};

// Class AkAudio.AkSettingsPerUser
struct UAkSettingsPerUser : Object {
	struct Unknown WwiseProjectPath; //  0x28 Size(10)
	struct Unknown WwiseWindowsInstallationPath; //  0x38 Size(10)
	struct Unknown WwiseMacInstallationPath; //  0x48 Size(10)
	char EnableAutomaticAssetSynchronization; //  0x58 Size(1)
	struct FString WaapiIPAddress; //  0x60 Size(10)
	uint32_t WaapiPort; //  0x70 Size(4)
	char bAutoConnectToWAAPI; //  0x74 Size(1)
	char AutoSyncSelection; //  0x75 Size(1)
	char SuppressWwiseProjectPathWarnings; //  0x76 Size(1)
	char SoundDataGenerationSkipLanguage; //  0x77 Size(1)
};

// Class AkAudio.AkSlider
struct UAkSlider : UWidget {
	float Value; //  0x108 Size(4)
	struct FDelegate ValueDelegate; //  0x10c Size(10)
	struct Unknown WidgetStyle; //  0x120 Size(340)
	char Orientation; //  0x460 Size(1)
	struct Unknown SliderBarColor; //  0x464 Size(10)
	struct Unknown SliderHandleColor; //  0x474 Size(10)
	char IndentHandle; //  0x484 Size(1)
	char Locked; //  0x485 Size(1)
	float StepSize; //  0x488 Size(4)
	char IsFocusable; //  0x48c Size(1)
	struct Unknown ThePropertyToControl; //  0x490 Size(10)
	struct Unknown ItemToControl; //  0x4a0 Size(40)
	struct FMulticastInlineDelegate OnValueChanged; //  0x4e0 Size(10)
	struct FMulticastInlineDelegate OnItemDropped; //  0x4f0 Size(10)
	struct FMulticastInlineDelegate OnPropertyDropped; //  0x500 Size(10)

	void SetValue(float InValue); // Function AkAudio.AkSlider.SetValue(Final|Native|Public|BlueprintCallable) // <Game+0x16115a0>
};

// Class AkAudio.AkSpatialAudioVolume
struct AAkSpatialAudioVolume : AVolume {
	struct Unknown SurfaceReflectorSet; //  0x348 Size(8)
	struct Unknown LateReverb; //  0x350 Size(8)
	struct Unknown Room; //  0x358 Size(8)
};

// Class AkAudio.AkSpotReflector
struct AAkSpotReflector : UActor {
	struct Unknown EarlyReflectionAuxBus; //  0x310 Size(8)
	struct FString EarlyReflectionAuxBusName; //  0x318 Size(10)
	struct Unknown AcousticTexture; //  0x328 Size(8)
	float DistanceScalingFactor; //  0x330 Size(4)
	float Level; //  0x334 Size(4)
};

// Class AkAudio.AkSurfaceReflectorSetComponent
struct UAkSurfaceReflectorSetComponent : USceneComponent {
	char bEnableSurfaceReflectors; //  0x238 Size(1)
	struct TArray<Unknown> AcousticPolys; //  0x240 Size(10)
	char bEnableDiffraction; //  0x250 Size(1)
	char bEnableDiffractionOnBoundaryEdges; //  0x250 Size(1)
	struct Unknown AssociatedRoom; //  0x258 Size(8)

	void UpdateSurfaceReflectorSet(); // Function AkAudio.AkSurfaceReflectorSetComponent.UpdateSurfaceReflectorSet(Final|Native|Public|BlueprintCallable) // <Game+0x16119c0>
};

// Class AkAudio.AkSwitchInitializationSettings
struct UAkSwitchInitializationSettings : Object {
	struct Unknown CommonSettings; //  0x28 Size(68)
	struct Unknown CommunicationSettings; //  0x90 Size(28)
	struct Unknown AdvancedSettings; //  0xb8 Size(38)

	void MigrateMultiCoreRendering(char NewValue); // Function AkAudio.AkSwitchInitializationSettings.MigrateMultiCoreRendering(Final|Native|Public) // <Game+0x15faba0>
};

// Class AkAudio.AkTVOSInitializationSettings
struct UAkTVOSInitializationSettings : Object {
	struct Unknown CommonSettings; //  0x28 Size(68)
	struct Unknown AudioSession; //  0x90 Size(c)
	struct Unknown CommunicationSettings; //  0xa0 Size(28)
	struct Unknown AdvancedSettings; //  0xc8 Size(34)
};

// Class AkAudio.AkWindowsInitializationSettings
struct UAkWindowsInitializationSettings : Object {
	struct Unknown CommonSettings; //  0x28 Size(68)
	struct Unknown CommunicationSettings; //  0x90 Size(28)
	struct Unknown AdvancedSettings; //  0xb8 Size(40)

	void MigrateMultiCoreRendering(char NewValue); // Function AkAudio.AkWindowsInitializationSettings.MigrateMultiCoreRendering(Final|Native|Public) // <Game+0x15faba0>
};

// Class AkAudio.AkWwiseTree
struct UAkWwiseTree : UWidget {
	struct FMulticastInlineDelegate OnSelectionChanged; //  0x108 Size(10)
	struct FMulticastInlineDelegate OnItemDragged; //  0x118 Size(10)

	void SetSearchText(struct FString newText); // Function AkAudio.AkWwiseTree.SetSearchText(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <Game+0x160d3a0>
};

// Class AkAudio.AkWwiseTreeSelector
struct UAkWwiseTreeSelector : UWidget {
	struct FMulticastInlineDelegate OnSelectionChanged; //  0x108 Size(10)
	struct FMulticastInlineDelegate OnItemDragged; //  0x118 Size(10)
};

// Class AkAudio.AkXboxOneInitializationSettings
struct UAkXboxOneInitializationSettings : Object {
	struct Unknown CommonSettings; //  0x28 Size(60)
	struct Unknown ApuHeapSettings; //  0x88 Size(8)
	struct Unknown CommunicationSettings; //  0x90 Size(28)
	struct Unknown AdvancedSettings; //  0xb8 Size(3c)

	void MigrateMultiCoreRendering(char NewValue); // Function AkAudio.AkXboxOneInitializationSettings.MigrateMultiCoreRendering(Final|Native|Public) // <Game+0x15faba0>
};

// Class AkAudio.InterpTrackAkAudioEvent
struct UInterpTrackAkAudioEvent : UInterpTrackVectorBase {
	struct TArray<Unknown> Events; //  0x90 Size(10)
	char bContinueEventOnMatineeEnd; //  0xa0 Size(1)
};

// Class AkAudio.InterpTrackAkAudioRTPC
struct UInterpTrackAkAudioRTPC : UInterpTrackFloatBase {
	struct FString Param; //  0x90 Size(10)
	char bPlayOnReverse; //  0xa0 Size(1)
	char bContinueRTPCOnMatineeEnd; //  0xa0 Size(1)
};

// Class AkAudio.InterpTrackInstAkAudioEvent
struct UInterpTrackInstAkAudioEvent : UInterpTrackInst {
	float LastUpdatePosition; //  0x28 Size(4)
};

// Class AkAudio.InterpTrackInstAkAudioRTPC
struct UInterpTrackInstAkAudioRTPC : UInterpTrackInst {
	float LastUpdatePosition; //  0x28 Size(4)
};

// Class AkAudio.MovieSceneAkAudioEv
struct UMovieSceneAkAudioEv : UMovieSceneSection {
	struct Unknown Event; //  0x120 Size(8)
	char RetriggerEvent; //  0x128 Size(1)
	int32_t ScrubTailLengthMs; //  0x12c Size(4)
	char StopAtSectionEnd; //  0x130 Size(1)
	struct FString EventName; //  0x138 Size(10)
	float MaxSourceDuration; //  0x168 Size(4)
	struct FString MaxDurationSourceID; //  0x170 Size(10)
};

// Class AkAudio.MovieSceneAkTrack
struct UMovieSceneAkTrack : UMovieSceneTrack {
	struct TArray<Unknown> Sections; //  0x58 Size(10)
	char bIsAMasterTrack; //  0x68 Size(1)
};

// Class AkAudio.MovieSceneAkAudioRTPCSection
struct UMovieSceneAkAudioRTPCSection : UMovieSceneSection {
	struct Unknown RTPC; //  0xe0 Size(8)
	struct FString Name; //  0xe8 Size(10)
	struct Unknown FloatCurve; //  0xf8 Size(80)
	struct Unknown FloatChannelSerializationHelper; //  0x178 Size(30)
	struct Unknown RTPCChannel; //  0x1a8 Size(a0)
};

// Class AkAudio.PostEventAsync
struct UPostEventAsync : UBlueprintAsyncActionBase {
	struct FMulticastInlineDelegate Completed; //  0x30 Size(10)

	struct Unknown PostEventAsync(struct Unknown WorldContextObject, struct Unknown AkEvent, struct Unknown Actor, int32_t CallbackMask, struct FDelegate& PostEventCallback, struct TArray<Unknown>& ExternalSources, char bStopWhenAttachedToDestroyed); // Function AkAudio.PostEventAsync.PostEventAsync(Final|BlueprintCosmetic|Native|Static|Public|HasOutParms|BlueprintCallable) // <Game+0x1617f60>
};

// Class AkAudio.PostEventAtLocationAsync
struct UPostEventAtLocationAsync : UBlueprintAsyncActionBase {
	struct FMulticastInlineDelegate Completed; //  0x30 Size(10)

	struct Unknown PostEventAtLocationAsync(struct Unknown WorldContextObject, struct Unknown AkEvent, struct Unknown Location, struct Unknown Orientation); // Function AkAudio.PostEventAtLocationAsync.PostEventAtLocationAsync(Final|BlueprintCosmetic|Native|Static|Public|HasDefaults|BlueprintCallable) // <Game+0x1619050>
};

