// AnimNotify Engine.AnimNotify
// Size: 0x00 (Inherited: 0x28)
struct UAnimNotify : Object {
	None AnimGraphNode_Root; // 0x10f8(0x40)
	None AnimGraphNode_TransitionResult_37; // 0x1138(0x38)
	None AnimGraphNode_TransitionResult_36; // 0x1170(0x38)
	None AnimGraphNode_TransitionResult_35; // 0x11a8(0x38)
	None AnimGraphNode_TransitionResult_34; // 0x11e0(0x38)
	None AnimGraphNode_TransitionResult_33; // 0x1218(0x38)
	None AnimGraphNode_TransitionResult_32; // 0x1250(0x38)
	None AnimGraphNode_TransitionResult_31; // 0x1288(0x38)
	None AnimGraphNode_TransitionResult_30; // 0x12c0(0x38)
	None AnimGraphNode_TransitionResult_29; // 0x12f8(0x38)
	None AnimGraphNode_TransitionResult_28; // 0x1330(0x38)
	None AnimGraphNode_TransitionResult_27; // 0x1368(0x38)
	None AnimGraphNode_TransitionResult_26; // 0x13a0(0x38)
	None AnimGraphNode_TransitionResult_25; // 0x13d8(0x38)
	None AnimGraphNode_TransitionResult_24; // 0x1410(0x38)
	None AnimGraphNode_TransitionResult_23; // 0x1448(0x38)
	None AnimGraphNode_TransitionResult_22; // 0x1480(0x38)
	None AnimGraphNode_TransitionResult_21; // 0x14b8(0x38)
	None AnimGraphNode_TransitionResult_20; // 0x14f0(0x38)
	None AnimGraphNode_TransitionResult_19; // 0x1528(0x38)
	None AnimGraphNode_TransitionResult_18; // 0x1560(0x38)
	None AnimGraphNode_TransitionResult_17; // 0x1598(0x38)
	None AnimGraphNode_TransitionResult_16; // 0x15d0(0x38)
	None AnimGraphNode_TransitionResult_15; // 0x1608(0x38)
	None AnimGraphNode_TransitionResult_14; // 0x1640(0x38)
	None AnimGraphNode_TransitionResult_13; // 0x1678(0x38)
	None AnimGraphNode_TransitionResult_12; // 0x16b0(0x38)
	None AnimGraphNode_TransitionResult_11; // 0x16e8(0x38)
	None AnimGraphNode_TransitionResult_10; // 0x1720(0x38)
	None AnimGraphNode_TransitionResult_9; // 0x1758(0x38)
	None AnimGraphNode_TransitionResult_8; // 0x1790(0x38)
	None AnimGraphNode_TransitionResult_7; // 0x17c8(0x38)
	None AnimGraphNode_TransitionResult_6; // 0x1800(0x38)
	None AnimGraphNode_TransitionResult_5; // 0x1838(0x38)
	None AnimGraphNode_TransitionResult_4; // 0x1870(0x38)
	None AnimGraphNode_TransitionResult_3; // 0x18a8(0x38)
	None AnimGraphNode_TransitionResult_2; // 0x18e0(0x38)
	None AnimGraphNode_TransitionResult; // 0x1918(0x38)
	None AnimGraphNode_SequenceSkinned_13; // 0x1950(0x160)
	None AnimGraphNode_SequencePlayer_13; // 0x1ab0(0x88)
	None AnimGraphNode_StateResult_9; // 0x1b38(0x40)
	None AnimGraphNode_SequenceSkinned_12; // 0x1b78(0x160)
	None AnimGraphNode_SequenceSkinned_11; // 0x1cd8(0x160)
	None AnimGraphNode_SequenceSkinned_10; // 0x1e38(0x160)
	None AnimGraphNode_SequenceSkinned_9; // 0x1f98(0x160)
	None AnimGraphNode_SequencePlayer_12; // 0x20f8(0x88)
	None AnimGraphNode_BlendListByInt_2; // 0x2180(0xb0)
	None AnimGraphNode_SequencePlayer_11; // 0x2230(0x88)
	None AnimGraphNode_SequencePlayer_10; // 0x22b8(0x88)
	None AnimGraphNode_BlendListByInt; // 0x2340(0xb0)
	None AnimGraphNode_SequencePlayer_9; // 0x23f0(0x88)
	None AnimGraphNode_BlendListByBool_11; // 0x2478(0xb0)
	None AnimGraphNode_StateResult_8; // 0x2528(0x40)
	None AnimGraphNode_SequenceSkinned_8; // 0x2568(0x160)
	None AnimGraphNode_SequenceSkinned_7; // 0x26c8(0x160)
	None AnimGraphNode_BlendSpaceSkinned_6; // 0x2828(0x200)
	None AnimGraphNode_BlendSpacePlayer_6; // 0x2a28(0xf0)
	None AnimGraphNode_SequencePlayer_8; // 0x2b18(0x88)
	None AnimGraphNode_BlendListByBool_10; // 0x2ba0(0xb0)
	None AnimGraphNode_BlendListByBool_9; // 0x2c50(0xb0)
	None AnimGraphNode_SequencePlayer_7; // 0x2d00(0x88)
	None AnimGraphNode_StateResult_7; // 0x2d88(0x40)
	None AnimGraphNode_SequenceEvaluator_2; // 0x2dc8(0x58)
	None AnimGraphNode_SequenceEvaluator; // 0x2e20(0x58)
	None AnimGraphNode_BlendListByBool_8; // 0x2e78(0xb0)
	None AnimGraphNode_StateResult_6; // 0x2f28(0x40)
	None AnimGraphNode_BlendSpaceSkinned_5; // 0x2f68(0x200)
	None AnimGraphNode_BlendSpaceSkinned_4; // 0x3168(0x200)
	None AnimGraphNode_BlendSpacePlayer_5; // 0x3368(0xf0)
	None AnimGraphNode_BlendListByBool_7; // 0x3458(0xb0)
	None AnimGraphNode_BlendSpacePlayer_4; // 0x3508(0xf0)
	None AnimGraphNode_StateResult_5; // 0x35f8(0x40)
	None AnimGraphNode_SequenceSkinned_6; // 0x3638(0x160)
	None AnimGraphNode_SequenceSkinned_5; // 0x3798(0x160)
	None AnimGraphNode_SequenceSkinned_4; // 0x38f8(0x160)
	None AnimGraphNode_SequenceSkinned_3; // 0x3a58(0x160)
	None AnimGraphNode_BlendSpaceSkinned_3; // 0x3bb8(0x200)
	None AnimGraphNode_SequencePlayer_6; // 0x3db8(0x88)
	None AnimGraphNode_SequencePlayer_5; // 0x3e40(0x88)
	None AnimGraphNode_SequencePlayer_4; // 0x3ec8(0x88)
	None AnimGraphNode_SequencePlayer_3; // 0x3f50(0x88)
	None AnimGraphNode_BlendListByEnum; // 0x3fd8(0xc0)
	None AnimGraphNode_BlendListByBool_6; // 0x4098(0xb0)
	None AnimGraphNode_BlendSpacePlayer_3; // 0x4148(0xf0)
	None AnimGraphNode_StateResult_4; // 0x4238(0x40)
	None AnimGraphNode_BlendSpaceSkinned_2; // 0x4278(0x200)
	None AnimGraphNode_BlendSpaceSkinned; // 0x4478(0x200)
	None AnimGraphNode_BlendSpacePlayer_2; // 0x4678(0xf0)
	None AnimGraphNode_BlendListByBool_5; // 0x4768(0xb0)
	None AnimGraphNode_BlendSpacePlayer; // 0x4818(0xf0)
	None AnimGraphNode_StateResult_3; // 0x4908(0x40)
	None AnimGraphNode_SequenceSkinned_2; // 0x4948(0x160)
	None AnimGraphNode_SequenceSkinned; // 0x4aa8(0x160)
	None AnimGraphNode_SequencePlayer_2; // 0x4c08(0x88)
	None AnimGraphNode_RandomPlayer; // 0x4c90(0x88)
	None AnimGraphNode_BlendListByBool_4; // 0x4d18(0xb0)
	None AnimGraphNode_StateResult_2; // 0x4dc8(0x40)
	None AnimGraphNode_StateMachine_2; // 0x4e08(0xc0)
	None AnimGraphNode_SequencePlayer; // 0x4ec8(0x88)
	None AnimGraphNode_StateResult; // 0x4f50(0x40)
	None AnimGraphNode_StateMachine; // 0x4f90(0xc0)
	None AnimGraphNode_BlendListByBool_3; // 0x5050(0xb0)
	None AnimGraphNode_BlendListByBool_2; // 0x5100(0xb0)
	None AnimGraphNode_LocalToComponentSpace; // 0x51b0(0x30)
	None AnimGraphNode_ComponentToLocalSpace; // 0x51e0(0x30)
	None AnimGraphNode_ModifyBone; // 0x5210(0x118)
	None AnimGraphNode_BlendListByBool; // 0x5328(0xb0)
	None AnimGraphNode_AimOffsetSkinned; // 0x53d8(0x1c0)
	None AnimGraphNode_SaveCachedPose; // 0x5598(0xc8)
	None AnimGraphNode_UseCachedPose_3; // 0x5660(0x38)
	None AnimGraphNode_UseCachedPose_2; // 0x5698(0x38)
	None AnimGraphNode_UseCachedPose; // 0x56d0(0x38)
	None MaxMantleHt; // 0x5708(0x04)
	None Max2StoryMantleHt; // 0x570c(0x04)
	None StringMantlesTogether; // 0x5710(0x01)
	None Start Swim Moving; // 0x5718(0x08)
	None Start Swim Moving B; // 0x5720(0x08)
	None Start Swim Moving A; // 0x5728(0x08)
	None Cached Angle; // 0x5730(0x04)
	None Stop Swim Moving A; // 0x5738(0x08)
	None Stop Swim Moving B; // 0x5740(0x08)
	None Stop Swim Moving; // 0x5748(0x08)
	None Cached Stop Angle; // 0x5750(0x04)
	None locoStartDir; // 0x5754(0x01)
	None locoStopDir; // 0x5755(0x01)
	None TurnVal; // 0x5758(0x04)
	None Transition_Downed; // 0x575c(0x01)
	None Transition_Pivot; // 0x575d(0x01)
	None IsFallingToWater; // 0x575e(0x01)
	None Replace with code; // 0x5760(0x0c)
	None Character; // 0x5770(0x08)
	None Transition State Lock; // 0x5778(0x01)
	None CallFunc_BreakRotator_Roll; // 0x577c(0x04)
	None CallFunc_BreakRotator_Pitch; // 0x5780(0x04)
	None CallFunc_BreakRotator_Yaw; // 0x5784(0x04)
	None CallFunc_BreakRotator_Roll_2; // 0x5788(0x04)
	None CallFunc_BreakRotator_Pitch_2; // 0x578c(0x04)
	None CallFunc_BreakRotator_Yaw_2; // 0x5790(0x04)
	None CallFunc_BreakRotator_Roll_3; // 0x5794(0x04)
	None CallFunc_BreakRotator_Pitch_3; // 0x5798(0x04)
	None CallFunc_BreakRotator_Yaw_3; // 0x579c(0x04)
	None CallFunc_BreakRotator_Roll_4; // 0x57a0(0x04)
	None CallFunc_BreakRotator_Pitch_4; // 0x57a4(0x04)
	None CallFunc_BreakRotator_Yaw_4; // 0x57a8(0x04)
	None CallFunc_BreakRotator_Roll_5; // 0x57ac(0x04)
	None CallFunc_BreakRotator_Pitch_5; // 0x57b0(0x04)
	None CallFunc_BreakRotator_Yaw_5; // 0x57b4(0x04)
	None CallFunc_BreakVector_X; // 0x57b8(0x04)
	None CallFunc_BreakVector_Y; // 0x57bc(0x04)
	None CallFunc_BreakVector_Z; // 0x57c0(0x04)
	None CallFunc_BreakRotator_Roll_6; // 0x57c4(0x04)
	None CallFunc_BreakRotator_Pitch_6; // 0x57c8(0x04)
	None CallFunc_BreakRotator_Yaw_6; // 0x57cc(0x04)
	None Temp_bool_Variable; // 0x57d0(0x01)
	None K2Node_Select_Default; // 0x57d4(0x0c)
	None CallFunc_BreakVector_X_2; // 0x57e0(0x04)
	None CallFunc_BreakVector_Y_2; // 0x57e4(0x04)
	None CallFunc_BreakVector_Z_2; // 0x57e8(0x04)
	None Temp_bool_Variable_2; // 0x57ec(0x01)
	None K2Node_Select_Default_2; // 0x57f0(0x0c)
	None Temp_bool_Variable_3; // 0x57fc(0x01)
	None Temp_bool_Variable_4; // 0x57fd(0x01)
	None K2Node_Select_Default_3; // 0x5800(0x0c)
	None K2Node_Event_DeltaTimeX; // 0x580c(0x04)
	None K2Node_Select_Default_4; // 0x5810(0x0c)
	None K2Node_Event_StartLocation; // 0x581c(0x0c)
	None CallFunc_BreakVector_X_3; // 0x5828(0x04)
	None CallFunc_BreakVector_Y_3; // 0x582c(0x04)
	None CallFunc_BreakVector_Z_3; // 0x5830(0x04)
	None K2Node_Event_StopLocation; // 0x5834(0x0c)
	None K2Node_Event_AnimationVariant; // 0x5840(0x01)
	None K2Node_Event_DelayTime; // 0x5844(0x04)
	None K2Node_SwitchEnum_CmpSuccess; // 0x5848(0x01)
	None K2Node_DynamicCast_AsKSCharacter; // 0x5850(0x08)
	None K2Node_DynamicCast_bSuccess; // 0x5858(0x01)
	None K2Node_Event_PivotLocation; // 0x585c(0x0c)
	None K2Node_Event_bShouldLock; // 0x5868(0x01)
	None BaseBar; // 0x238(0x08)
	None ProgressBarFill; // 0x240(0x08)
	None UberGraphFrame; // 0x238(0x08)
	None FadeOut; // 0x240(0x08)
	None Show; // 0x248(0x08)
	None NameButton; // 0x250(0x08)
	None NameText; // 0x258(0x08)
	None Panel; // 0x260(0x08)
	None Text; // 0x268(0x08)
	None ChatDataCopy; // 0x270(0x40)
	None IsWindowCollapsed; // 0x2b0(0x01)
	None IsInitialShowFinished; // 0x2b1(0x01)
	None ChatMessageDisplayDuration; // 0x2b4(0x04)
	None LobbyState; // 0x2b0(0x08)
	None PlayerState; // 0x2b8(0x08)
	None LobbyJoinServerState; // 0x2c1(0x01)
	None LobbyStateClass; // 0x250(0x28)
	None LobbyState; // 0x278(0x08)
	None DisplayName; // 0x220(0x18)
	None UniqueId; // 0x238(0x28)
	None PartyOwnerUniqueId; // 0x260(0x28)
	None bInLobby; // 0x288(0x01)
	None ClientActor; // 0x290(0x08)
	None MaxPlayers; // 0x220(0x04)
	None LobbyBeaconPlayerStateClass; // 0x228(0x08)
	None bLobbyStarted; // 0x238(0x01)
	None WaitForPlayersTimeRemaining; // 0x23c(0x04)
	None Players; // 0x240(0x120)
	None LastKnownStatus; // 0x28(0x01)
	None bRejoinAfterCheck; // 0x29(0x01)
	None bAttemptingRejoin; // 0x2a(0x01)
	None DestructibleComponent; // 0x220(0x08)
	None OnActorFracture; // 0x228(0x10)
	None bFractureEffectOverride; // 0x670(0x01)
	None FractureEffects; // 0x678(0x10)
	None bEnableHardSleeping; // 0x688(0x01)
	None LargeChunkThreshold; // 0x68c(0x04)
	None OnComponentFracture; // 0x6a0(0x10)
	None CellSiteCount; // 0x28(0x04)
	None FractureMaterialDesc; // 0x2c(0x24)
	None RandomSeed; // 0x50(0x04)
	None VoronoiSites; // 0x58(0x10)
	None OriginalSubmeshCount; // 0x68(0x04)
	None Materials; // 0x70(0x10)
	None ChunkParameters; // 0x80(0x10)
	None DefaultDestructibleParameters; // 0x388(0x88)
	None FractureEffects; // 0x410(0x10)
	None OSSName; // 0x1e0(0x10)
	None HotfixManagerClassName; // 0x1f0(0x10)
	None DebugPrefix; // 0x200(0x10)
	None AssetsHotfixedFromIniFiles; // 0x210(0x10)
	None HotfixCheckCompleteDelay; // 0x88(0x04)
	None UpdateCheckCompleteDelay; // 0x8c(0x04)
	None HotfixAvailabilityCheckCompleteDelay; // 0x90(0x04)
	None UpdateCheckAvailabilityCompleteDelay; // 0x94(0x04)
	None bCheckPlatformOSSForUpdate; // 0x98(0x01)
	None bCheckOSSForUpdate; // 0x99(0x01)
	None AppSuspendedUpdateCheckTimeSeconds; // 0x9c(0x04)
	None bPlatformEnvironmentDetected; // 0xa8(0x01)
	None bInitialUpdateFinished; // 0xa9(0x01)
	None bCheckHotfixAvailabilityOnly; // 0xaa(0x01)
	None CurrentUpdateState; // 0xab(0x01)
	None WorstNumFilesPendingLoadViewed; // 0xac(0x04)
	None LastPatchCheckResult; // 0xb0(0x01)
	None LastHotfixResult; // 0xb1(0x01)
	None LastUpdateCheck; // 0xe0(0x10)
	None LastCompletionResult; // 0xf0(0x02)
	None UpdateStateEnum; // 0x108(0x08)
	None UpdateCompletionEnum; // 0x110(0x08)
	None PrimaryActorTick; // 0x28(0x30)
	None bNetTemporary; // 0x58(0x01)
	None bNetStartup; // 0x58(0x01)
	None bOnlyRelevantToOwner; // 0x58(0x01)
	None bAlwaysRelevant; // 0x58(0x01)
	None bReplicateMovement; // 0x58(0x01)
	None bHidden; // 0x58(0x01)
	None bTearOff; // 0x58(0x01)
	None bExchangedRoles; // 0x58(0x01)
	None bNetLoadOnClient; // 0x59(0x01)
	None bNetUseOwnerRelevancy; // 0x59(0x01)
	None bRelevantForNetworkReplays; // 0x59(0x01)
	None bRelevantForLevelBounds; // 0x59(0x01)
	None bReplayRewindable; // 0x59(0x01)
	None bAllowTickBeforeBeginPlay; // 0x59(0x01)
	None bAutoDestroyWhenFinished; // 0x59(0x01)
	None bCanBeDamaged; // 0x59(0x01)
	None bBlockInput; // 0x5a(0x01)
	None bCollideWhenPlacing; // 0x5a(0x01)
	None bFindCameraComponentWhenViewTarget; // 0x5a(0x01)
	None bGenerateOverlapEventsDuringLevelStreaming; // 0x5a(0x01)
	None bIgnoresOriginShifting; // 0x5a(0x01)
	None bEnableAutoLODGeneration; // 0x5a(0x01)
	None bIsEditorOnlyActor; // 0x5a(0x01)
	None bActorSeamlessTraveled; // 0x5a(0x01)
	None bReplicates; // 0x5b(0x01)
	None bCanBeInCluster; // 0x5b(0x01)
	None bAllowReceiveTickEventOnDedicatedServer; // 0x5b(0x01)
	None bActorEnableCollision; // 0x5c(0x01)
	None bActorIsBeingDestroyed; // 0x5c(0x01)
	None UpdateOverlapsMethodDuringLevelStreaming; // 0x5d(0x01)
	None DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x5e(0x01)
	None RemoteRole; // 0x5f(0x01)
	None ReplicatedMovement; // 0x60(0x34)
	None InitialLifeSpan; // 0x94(0x04)
	None CustomTimeDilation; // 0x98(0x04)
	None AttachmentReplication; // 0xa0(0x40)
	None Owner; // 0xe0(0x08)
	None NetDriverName; // 0xe8(0x08)
	None Role; // 0xf0(0x01)
	None NetDormancy; // 0xf1(0x01)
	None SpawnCollisionHandlingMethod; // 0xf2(0x01)
	None AutoReceiveInput; // 0xf3(0x01)
	None InputPriority; // 0xf4(0x04)
	None InputComponent; // 0xf8(0x08)
	None NetCullDistanceSquared; // 0x100(0x04)
	None NetTag; // 0x104(0x04)
	None NetUpdateFrequency; // 0x108(0x04)
	None MinNetUpdateFrequency; // 0x10c(0x04)
	None NetPriority; // 0x110(0x04)
	None Instigator; // 0x118(0x08)
	None Children; // 0x120(0x10)
	None RootComponent; // 0x130(0x08)
	None ControllingMatineeActors; // 0x138(0x10)
	None Layers; // 0x150(0x10)
	None ParentComponent; // 0x160(0x08)
	None Tags; // 0x170(0x10)
	None OnTakeAnyDamage; // 0x180(0x01)
	None OnTakePointDamage; // 0x181(0x01)
	None OnTakeRadialDamage; // 0x182(0x01)
	None OnActorBeginOverlap; // 0x183(0x01)
	None OnActorEndOverlap; // 0x184(0x01)
	None OnBeginCursorOver; // 0x185(0x01)
	None OnEndCursorOver; // 0x186(0x01)
	None OnClicked; // 0x187(0x01)
	None OnReleased; // 0x188(0x01)
	None OnInputTouchBegin; // 0x189(0x01)
	None OnInputTouchEnd; // 0x18a(0x01)
	None OnInputTouchEnter; // 0x18b(0x01)
	None OnInputTouchLeave; // 0x18c(0x01)
	None OnActorHit; // 0x18d(0x01)
	None OnDestroyed; // 0x18e(0x01)
	None OnEndPlay; // 0x18f(0x01)
	None InstanceComponents; // 0x1f0(0x10)
	None BlueprintCreatedComponents; // 0x200(0x10)
	None PrimaryComponentTick; // 0x30(0x30)
	None ComponentTags; // 0x60(0x10)
	None AssetUserData; // 0x70(0x10)
	None UCSSerializationIndex; // 0x84(0x04)
	None bNetAddressable; // 0x88(0x01)
	None bReplicates; // 0x88(0x01)
	None bAutoActivate; // 0x89(0x01)
	None bIsActive; // 0x8a(0x01)
	None bEditableWhenInherited; // 0x8a(0x01)
	None bCanEverAffectNavigation; // 0x8a(0x01)
	None bIsEditorOnly; // 0x8a(0x01)
	None CreationMethod; // 0x8c(0x01)
	None OnComponentActivated; // 0x8d(0x01)
	None OnComponentDeactivated; // 0x8e(0x01)
	None UCSModifiedProperties; // 0x90(0x10)
	None PhysicsVolume; // 0xb8(0x08)
	None AttachParent; // 0xc0(0x08)
	None AttachSocketName; // 0xc8(0x08)
	None AttachChildren; // 0xd0(0x10)
	None ClientAttachedChildren; // 0xe0(0x10)
	None RelativeLocation; // 0x11c(0x0c)
	None RelativeRotation; // 0x128(0x0c)
	None RelativeScale3D; // 0x134(0x0c)
	None ComponentVelocity; // 0x140(0x0c)
	None bComponentToWorldUpdated; // 0x14c(0x01)
	None bAbsoluteLocation; // 0x14c(0x01)
	None bAbsoluteRotation; // 0x14c(0x01)
	None bAbsoluteScale; // 0x14c(0x01)
	None bVisible; // 0x14c(0x01)
	None bShouldBeAttached; // 0x14c(0x01)
	None bShouldSnapLocationWhenAttached; // 0x14c(0x01)
	None bShouldSnapRotationWhenAttached; // 0x14d(0x01)
	None bShouldUpdatePhysicsVolume; // 0x14d(0x01)
	None bHiddenInGame; // 0x14d(0x01)
	None bBoundsChangeTriggersStreamingDataRebuild; // 0x14d(0x01)
	None bUseAttachParentBound; // 0x14d(0x01)
	None Mobility; // 0x14f(0x01)
	None DetailMode; // 0x150(0x01)
	None PhysicsVolumeChangedDelegate; // 0x151(0x01)
	None MinDrawDistance; // 0x210(0x04)
	None LDMaxDrawDistance; // 0x214(0x04)
	None CachedMaxDrawDistance; // 0x218(0x04)
	None DepthPriorityGroup; // 0x21c(0x01)
	None ViewOwnerDepthPriorityGroup; // 0x21d(0x01)
	None IndirectLightingCacheQuality; // 0x21e(0x01)
	None LightmapType; // 0x21f(0x01)
	None bUseMaxLODAsImposter; // 0x220(0x01)
	None bBatchImpostersAsInstances; // 0x220(0x01)
	None bNeverDistanceCull; // 0x220(0x01)
	None bForceLocalLighting; // 0x220(0x01)
	None bAlwaysCreatePhysicsState; // 0x221(0x01)
	None bGenerateOverlapEvents; // 0x221(0x01)
	None bMultiBodyOverlap; // 0x221(0x01)
	None bTraceComplexOnMove; // 0x221(0x01)
	None bReturnMaterialOnMove; // 0x221(0x01)
	None bUseViewOwnerDepthPriorityGroup; // 0x221(0x01)
	None bAllowCullDistanceVolume; // 0x221(0x01)
	None bHasMotionBlurVelocityMeshes; // 0x221(0x01)
	None bVisibleInReflectionCaptures; // 0x222(0x01)
	None bVisibleInRayTracing; // 0x222(0x01)
	None bRenderInMainPass; // 0x222(0x01)
	None bRenderInDepthPass; // 0x222(0x01)
	None bReceivesDecals; // 0x222(0x01)
	None bOwnerNoSee; // 0x222(0x01)
	None bOnlyOwnerSee; // 0x222(0x01)
	None bTreatAsBackgroundForOcclusion; // 0x222(0x01)
	None bUseAsOccluder; // 0x223(0x01)
	None bSelectable; // 0x223(0x01)
	None bForceMipStreaming; // 0x223(0x01)
	None bHasPerInstanceHitProxies; // 0x223(0x01)
	None CastShadow; // 0x223(0x01)
	None bAffectDynamicIndirectLighting; // 0x223(0x01)
	None bAffectDistanceFieldLighting; // 0x223(0x01)
	None bCastDynamicShadow; // 0x223(0x01)
	None bCastStaticShadow; // 0x224(0x01)
	None bCastVolumetricTranslucentShadow; // 0x224(0x01)
	None bSelfShadowOnly; // 0x224(0x01)
	None bCastFarShadow; // 0x224(0x01)
	None bCastInsetShadow; // 0x224(0x01)
	None bCastCinematicShadow; // 0x224(0x01)
	None bCastHiddenShadow; // 0x224(0x01)
	None bCastShadowAsTwoSided; // 0x224(0x01)
	None bShouldNotReceiveCapsuleShadows; // 0x225(0x01)
	None bLightAsIfStatic; // 0x225(0x01)
	None bLightAttachmentsAsGroup; // 0x225(0x01)
	None bExcludeFromLightAttachmentGroup; // 0x225(0x01)
	None bReceiveMobileCSMShadows; // 0x225(0x01)
	None bSingleSampleShadowFromStationaryLights; // 0x225(0x01)
	None bIgnoreRadialImpulse; // 0x225(0x01)
	None bIgnoreRadialForce; // 0x225(0x01)
	None bApplyImpulseOnDamage; // 0x226(0x01)
	None bReplicatePhysicsToAutonomousProxy; // 0x226(0x01)
	None bFillCollisionUnderneathForNavmesh; // 0x226(0x01)
	None AlwaysLoadOnClient; // 0x226(0x01)
	None AlwaysLoadOnServer; // 0x226(0x01)
	None bUseEditorCompositing; // 0x226(0x01)
	None bRenderCustomDepth; // 0x226(0x01)
	None bExcludeFromContributionCulling; // 0x226(0x01)
	None bHasCustomNavigableGeometry; // 0x228(0x01)
	None OutlineDepthMode; // 0x229(0x01)
	None CanCharacterStepUpOn; // 0x22b(0x01)
	None LightingChannels; // 0x22c(0x01)
	None CustomDepthStencilWriteMask; // 0x22d(0x01)
	None CustomDepthStencilValue; // 0x230(0x04)
	None CustomPrimitiveData; // 0x238(0x10)
	None CustomPrimitiveDataInternal; // 0x248(0x10)
	None TranslucencySortPriority; // 0x260(0x04)
	None VisibilityId; // 0x264(0x04)
	None RuntimeVirtualTextures; // 0x268(0x10)
	None VirtualTextureLodBias; // 0x278(0x01)
	None VirtualTextureCullMips; // 0x279(0x01)
	None VirtualTextureMinCoverage; // 0x27a(0x01)
	None VirtualTextureRenderPassType; // 0x27b(0x01)
	None LpvBiasMultiplier; // 0x280(0x04)
	None OutlineThicknessMultiplier; // 0x284(0x04)
	None OutlineColor; // 0x288(0x10)
	None OutlineZFadeMin; // 0x298(0x04)
	None OutlineZFadeMax; // 0x29c(0x04)
	None BoundsScale; // 0x2a8(0x04)
	None MoveIgnoreActors; // 0x2b8(0x10)
	None MoveIgnoreComponents; // 0x2c8(0x10)
	None BodyInstance; // 0x2e8(0x110)
	None OnComponentHit; // 0x3f8(0x01)
	None OnComponentBeginOverlap; // 0x3f9(0x01)
	None OnComponentEndOverlap; // 0x3fa(0x01)
	None OnComponentWake; // 0x3fb(0x01)
	None OnComponentSleep; // 0x3fc(0x01)
	None OnBeginCursorOver; // 0x3fe(0x01)
	None OnEndCursorOver; // 0x3ff(0x01)
	None OnClicked; // 0x400(0x01)
	None OnReleased; // 0x401(0x01)
	None OnInputTouchBegin; // 0x402(0x01)
	None OnInputTouchEnd; // 0x403(0x01)
	None OnInputTouchEnter; // 0x404(0x01)
	None OnInputTouchLeave; // 0x405(0x01)
	None LODParentPrimitive; // 0x420(0x08)
	None CustomFOV; // 0x428(0x04)
	None OverrideMaterials; // 0x430(0x10)
	None bEnableMaterialParameterCaching; // 0x450(0x01)
	None SkeletalMesh; // 0x458(0x08)
	None MasterPoseComponent; // 0x460(0x08)
	None SkinCacheUsage; // 0x468(0x10)
	None bSuppressSocketByNameWarnings; // 0x548(0x01)
	None PhysicsAssetOverride; // 0x578(0x08)
	None ForcedLodModel; // 0x580(0x04)
	None MinLodModel; // 0x584(0x04)
	None StreamingDistanceMultiplier; // 0x590(0x04)
	None LODInfo; // 0x5a0(0x10)
	None VisibilityBasedAnimTickOption; // 0x5d4(0x01)
	None bOverrideMinLod; // 0x5d6(0x01)
	None bUseBoundsFromMasterPoseComponent; // 0x5d6(0x01)
	None bForceWireframe; // 0x5d6(0x01)
	None bDisplayBones; // 0x5d6(0x01)
	None bDisableMorphTarget; // 0x5d6(0x01)
	None bHideSkin; // 0x5d6(0x01)
	None bPerBoneMotionBlur; // 0x5d7(0x01)
	None bComponentUseFixedSkelBounds; // 0x5d7(0x01)
	None bConsiderAllBodiesForBounds; // 0x5d7(0x01)
	None bSyncAttachParentLOD; // 0x5d7(0x01)
	None bCanHighlightSelectedSections; // 0x5d7(0x01)
	None bRecentlyRendered; // 0x5d7(0x01)
	None bCastCapsuleDirectShadow; // 0x5d7(0x01)
	None bCastCapsuleIndirectShadow; // 0x5d7(0x01)
	None bCPUSkinning; // 0x5d8(0x01)
	None bEnableUpdateRateOptimizations; // 0x5d8(0x01)
	None bDisplayDebugUpdateRateOptimizations; // 0x5d8(0x01)
	None bRenderStatic; // 0x5d8(0x01)
	None bIgnoreMasterPoseComponentLOD; // 0x5d8(0x01)
	None bCachedLocalBoundsUpToDate; // 0x5d8(0x01)
	None bForceMeshObjectUpdate; // 0x5d9(0x01)
	None CapsuleIndirectShadowMinVisibility; // 0x5dc(0x04)
	None CachedWorldSpaceBounds; // 0x5f0(0x1c)
	None CachedWorldToLocalTransform; // 0x610(0x40)
	None ForceMipLevelsToBeResidentTimestamp; // 0x28(0x08)
	None NumCinematicMipLevels; // 0x30(0x04)
	None StreamingIndex; // 0x34(0x04)
	None CachedCombinedLODBias; // 0x38(0x04)
	None CachedNumResidentLODs; // 0x3c(0x01)
	None bCachedReadyForStreaming; // 0x3d(0x01)
	None NeverStream; // 0x3d(0x01)
	None bGlobalForceMipLevelsToBeResident; // 0x3d(0x01)
	None bIsStreamable; // 0x3d(0x01)
	None bHasStreamingUpdatePending; // 0x3d(0x01)
	None bForceMiplevelsToBeResident; // 0x3d(0x01)
	None bIgnoreStreamingMipBias; // 0x3d(0x01)
	None bUseCinematicMipLevels; // 0x3d(0x01)
	None Skeleton; // 0x60(0x08)
	None ImportedBounds; // 0x68(0x1c)
	None ExtendedBounds; // 0x84(0x1c)
	None PositiveBoundsExtension; // 0xa0(0x0c)
	None NegativeBoundsExtension; // 0xac(0x0c)
	None Materials; // 0xb8(0x10)
	None SkelMirrorTable; // 0xc8(0x10)
	None LODInfo; // 0xd8(0x10)
	None MinLOD; // 0x138(0x04)
	None MaxLod; // 0x13c(0x04)
	None DisableBelowMinLodStripping; // 0x140(0x01)
	None SkelMirrorAxis; // 0x141(0x01)
	None SkelMirrorFlipAxis; // 0x142(0x01)
	None bWillNeverMergeMesh; // 0x143(0x01)
	None bUseFullPrecisionUVs; // 0x143(0x01)
	None bUseHighPrecisionTangentBasis; // 0x143(0x01)
	None bSmoothNormalsInVertexColor; // 0x143(0x01)
	None bVertexCurvature; // 0x143(0x01)
	None bHasBeenSimplified; // 0x143(0x01)
	None bHasVertexColors; // 0x143(0x01)
	None bEnablePerPolyCollision; // 0x144(0x01)
	None BodySetup; // 0x148(0x08)
	None PhysicsAsset; // 0x150(0x08)
	None ShadowPhysicsAsset; // 0x158(0x08)
	None NodeMappingData; // 0x160(0x10)
	None MorphTargets; // 0x170(0x10)
	None PostProcessAnimBlueprint; // 0x2f8(0x08)
	None MeshClothingAssets; // 0x300(0x10)
	None SamplingInfo; // 0x310(0x30)
	None AssetUserData; // 0x340(0x10)
	None Sockets; // 0x358(0x10)
	None SkinWeightProfiles; // 0x378(0x10)
	None TinyFont; // 0x30(0x08)
	None TinyFontName; // 0x38(0x18)
	None SmallFont; // 0x50(0x08)
	None SmallFontName; // 0x58(0x18)
	None MediumFont; // 0x70(0x08)
	None MediumFontName; // 0x78(0x18)
	None LargeFont; // 0x90(0x08)
	None LargeFontName; // 0x98(0x18)
	None SubtitleFont; // 0xb0(0x08)
	None SubtitleFontName; // 0xb8(0x18)
	None AdditionalFonts; // 0xd0(0x10)
	None AdditionalFontNames; // 0xe8(0x10)
	None ConsoleClass; // 0xf8(0x08)
	None ShippingConsoleClass; // 0x100(0x08)
	None ConsoleClassName; // 0x108(0x18)
	None ShippingConsoleClassName; // 0x120(0x18)
	None GameViewportClientClass; // 0x138(0x08)
	None GameViewportClientClassName; // 0x140(0x18)
	None LocalPlayerClass; // 0x158(0x08)
	None LocalPlayerClassName; // 0x160(0x18)
	None WorldSettingsClass; // 0x178(0x08)
	None WorldSettingsClassName; // 0x180(0x18)
	None NavigationSystemClassName; // 0x198(0x18)
	None NavigationSystemClass; // 0x1b0(0x08)
	None NavigationSystemConfigClassName; // 0x1b8(0x18)
	None NavigationSystemConfigClass; // 0x1d0(0x08)
	None AvoidanceManagerClassName; // 0x1d8(0x18)
	None AvoidanceManagerClass; // 0x1f0(0x08)
	None PhysicsCollisionHandlerClass; // 0x1f8(0x08)
	None PhysicsCollisionHandlerClassName; // 0x200(0x18)
	None GameUserSettingsClassName; // 0x218(0x18)
	None GameUserSettingsClass; // 0x230(0x08)
	None AIControllerClassName; // 0x238(0x18)
	None GameUserSettings; // 0x250(0x08)
	None LevelScriptActorClass; // 0x258(0x08)
	None LevelScriptActorClassName; // 0x260(0x18)
	None DefaultBlueprintBaseClassName; // 0x278(0x18)
	None GameSingletonClassName; // 0x290(0x18)
	None GameSingleton; // 0x2a8(0x08)
	None AssetManagerClassName; // 0x2b0(0x18)
	None AssetManager; // 0x2c8(0x08)
	None DefaultTexture; // 0x2d0(0x08)
	None DefaultTextureName; // 0x2d8(0x18)
	None DefaultDiffuseTexture; // 0x2f0(0x08)
	None DefaultDiffuseTextureName; // 0x2f8(0x18)
	None DefaultBSPVertexTexture; // 0x310(0x08)
	None DefaultBSPVertexTextureName; // 0x318(0x18)
	None HighFrequencyNoiseTexture; // 0x330(0x08)
	None HighFrequencyNoiseTextureName; // 0x338(0x18)
	None DefaultBokehTexture; // 0x350(0x08)
	None DefaultBokehTextureName; // 0x358(0x18)
	None DefaultBloomKernelTexture; // 0x370(0x08)
	None DefaultBloomKernelTextureName; // 0x378(0x18)
	None WireframeMaterial; // 0x390(0x08)
	None WireframeMaterialName; // 0x398(0x10)
	None DebugMeshMaterial; // 0x3a8(0x08)
	None DebugMeshMaterialName; // 0x3b0(0x18)
	None EmissiveMeshMaterial; // 0x3c8(0x08)
	None EmissiveMeshMaterialName; // 0x3d0(0x18)
	None LevelColorationLitMaterial; // 0x3e8(0x08)
	None LevelColorationLitMaterialName; // 0x3f0(0x10)
	None LevelColorationUnlitMaterial; // 0x400(0x08)
	None LevelColorationUnlitMaterialName; // 0x408(0x10)
	None LightingTexelDensityMaterial; // 0x418(0x08)
	None WorldNormalsMaterialName; // 0x420(0x10)
	None WorldNormalsMaterial; // 0x430(0x08)
	None LightingTexelDensityName; // 0x438(0x10)
	None ShadedLevelColorationLitMaterial; // 0x448(0x08)
	None ShadedLevelColorationLitMaterialName; // 0x450(0x10)
	None ShadedLevelColorationUnlitMaterial; // 0x460(0x08)
	None ShadedLevelColorationUnlitMaterialName; // 0x468(0x10)
	None RemoveSurfaceMaterial; // 0x478(0x08)
	None RemoveSurfaceMaterialName; // 0x480(0x18)
	None VertexColorMaterial; // 0x498(0x08)
	None VertexColorMaterialName; // 0x4a0(0x10)
	None VertexColorViewModeMaterial_ColorOnly; // 0x4b0(0x08)
	None VertexColorViewModeMaterialName_ColorOnly; // 0x4b8(0x10)
	None VertexColorViewModeMaterial_AlphaAsColor; // 0x4c8(0x08)
	None VertexColorViewModeMaterialName_AlphaAsColor; // 0x4d0(0x10)
	None VertexColorViewModeMaterial_RedOnly; // 0x4e0(0x08)
	None VertexColorViewModeMaterialName_RedOnly; // 0x4e8(0x10)
	None VertexColorViewModeMaterial_GreenOnly; // 0x4f8(0x08)
	None VertexColorViewModeMaterialName_GreenOnly; // 0x500(0x10)
	None VertexColorViewModeMaterial_BlueOnly; // 0x510(0x08)
	None VertexColorViewModeMaterialName_BlueOnly; // 0x518(0x10)
	None DebugEditorMaterialName; // 0x528(0x18)
	None ConstraintLimitMaterial; // 0x540(0x08)
	None ConstraintLimitMaterialX; // 0x548(0x08)
	None ConstraintLimitMaterialXAxis; // 0x550(0x08)
	None ConstraintLimitMaterialY; // 0x558(0x08)
	None ConstraintLimitMaterialYAxis; // 0x560(0x08)
	None ConstraintLimitMaterialZ; // 0x568(0x08)
	None ConstraintLimitMaterialZAxis; // 0x570(0x08)
	None ConstraintLimitMaterialPrismatic; // 0x578(0x08)
	None InvalidLightmapSettingsMaterial; // 0x580(0x08)
	None InvalidLightmapSettingsMaterialName; // 0x588(0x18)
	None PreviewShadowsIndicatorMaterial; // 0x5a0(0x08)
	None PreviewShadowsIndicatorMaterialName; // 0x5a8(0x18)
	None ArrowMaterial; // 0x5c0(0x08)
	None ArrowMaterialYellow; // 0x5c8(0x08)
	None ArrowMaterialName; // 0x5d0(0x18)
	None LightingOnlyBrightness; // 0x5e8(0x10)
	None ShaderComplexityColors; // 0x5f8(0x10)
	None QuadComplexityColors; // 0x608(0x10)
	None LightComplexityColors; // 0x618(0x10)
	None StationaryLightOverlapColors; // 0x628(0x10)
	None LODColorationColors; // 0x638(0x10)
	None HLODColorationColors; // 0x648(0x10)
	None StreamingAccuracyColors; // 0x658(0x10)
	None MaxPixelShaderAdditiveComplexityCount; // 0x668(0x04)
	None MaxES3PixelShaderAdditiveComplexityCount; // 0x66c(0x04)
	None MinLightMapDensity; // 0x670(0x04)
	None IdealLightMapDensity; // 0x674(0x04)
	None MaxLightMapDensity; // 0x678(0x04)
	None bRenderLightMapDensityGrayscale; // 0x67c(0x01)
	None RenderLightMapDensityGrayscaleScale; // 0x680(0x04)
	None RenderLightMapDensityColorScale; // 0x684(0x04)
	None LightMapDensityVertexMappedColor; // 0x688(0x10)
	None LightMapDensitySelectedColor; // 0x698(0x10)
	None StatColorMappings; // 0x6a8(0x10)
	None DefaultPhysMaterial; // 0x6b8(0x08)
	None DefaultPhysMaterialName; // 0x6c0(0x18)
	None ActiveGameNameRedirects; // 0x6d8(0x10)
	None ActiveClassRedirects; // 0x6e8(0x10)
	None ActivePluginRedirects; // 0x6f8(0x10)
	None ActiveStructRedirects; // 0x708(0x10)
	None PreIntegratedSkinBRDFTexture; // 0x718(0x08)
	None PreIntegratedSkinBRDFTextureName; // 0x720(0x18)
	None HirezPreIntegratedSkinBRDFTexture; // 0x738(0x08)
	None HirezPreIntegratedSkinBRDFTextureName; // 0x740(0x18)
	None HirezPreIntegratedShadowTexture; // 0x758(0x08)
	None HirezPreIntegratedShadowTextureName; // 0x760(0x18)
	None BlueNoiseTexture; // 0x778(0x08)
	None BlueNoiseTextureName; // 0x780(0x18)
	None MiniFontTexture; // 0x798(0x08)
	None MiniFontTextureName; // 0x7a0(0x18)
	None WeightMapPlaceholderTexture; // 0x7b8(0x08)
	None WeightMapPlaceholderTextureName; // 0x7c0(0x18)
	None LightMapDensityTexture; // 0x7d8(0x08)
	None LightMapDensityTextureName; // 0x7e0(0x18)
	None GameViewport; // 0x800(0x08)
	None DeferredCommands; // 0x808(0x10)
	None TickCycles; // 0x818(0x04)
	None GameCycles; // 0x81c(0x04)
	None ClientCycles; // 0x820(0x04)
	None NearClipPlane; // 0x824(0x04)
	None bStreamTexturesDuringLoadScreen; // 0x828(0x01)
	None bHardwareSurveyEnabled; // 0x828(0x01)
	None bSubtitlesEnabled; // 0x828(0x01)
	None bSubtitlesForcedOff; // 0x828(0x01)
	None MaximumLoopIterationCount; // 0x82c(0x04)
	None bCanBlueprintsTickByDefault; // 0x830(0x01)
	None bOptimizeAnimBlueprintMemberVariableAccess; // 0x830(0x01)
	None bAllowMultiThreadedAnimationUpdate; // 0x830(0x01)
	None bEnableEditorPSysRealtimeLOD; // 0x830(0x01)
	None bSmoothFrameRate; // 0x830(0x01)
	None bUseFixedFrameRate; // 0x830(0x01)
	None FixedFrameRate; // 0x834(0x04)
	None SmoothedFrameRateRange; // 0x838(0x10)
	None CustomTimeStep; // 0x848(0x08)
	None CustomTimeStepClassName; // 0x870(0x18)
	None TimecodeProvider; // 0x888(0x08)
	None TimecodeProviderClassName; // 0x8b0(0x18)
	None bGenerateDefaultTimecode; // 0x8c8(0x01)
	None GenerateDefaultTimecodeFrameRate; // 0x8cc(0x08)
	None GenerateDefaultTimecodeFrameDelay; // 0x8d4(0x04)
	None bCheckForMultiplePawnsSpawnedInAFrame; // 0x8d8(0x01)
	None NumPawnsAllowedToBeSpawnedInAFrame; // 0x8dc(0x04)
	None bShouldGenerateLowQualityLightmaps; // 0x8e0(0x01)
	None C_WorldBox; // 0x8e4(0x04)
	None C_BrushWire; // 0x8e8(0x04)
	None C_AddWire; // 0x8ec(0x04)
	None C_SubtractWire; // 0x8f0(0x04)
	None C_SemiSolidWire; // 0x8f4(0x04)
	None C_NonSolidWire; // 0x8f8(0x04)
	None C_WireBackground; // 0x8fc(0x04)
	None C_ScaleBoxHi; // 0x900(0x04)
	None C_VolumeCollision; // 0x904(0x04)
	None C_BSPCollision; // 0x908(0x04)
	None C_OrthoBackground; // 0x90c(0x04)
	None C_Volume; // 0x910(0x04)
	None C_BrushShape; // 0x914(0x04)
	None StreamingDistanceFactor; // 0x918(0x04)
	None GameScreenshotSaveDirectory; // 0x920(0x10)
	None TransitionType; // 0x930(0x01)
	None TransitionDescription; // 0x938(0x10)
	None TransitionGameMode; // 0x948(0x10)
	None MeshLODRange; // 0x958(0x04)
	None bAllowMatureLanguage; // 0x95c(0x01)
	None CameraRotationThreshold; // 0x960(0x04)
	None CameraTranslationThreshold; // 0x964(0x04)
	None PrimitiveProbablyVisibleTime; // 0x968(0x04)
	None MaxOcclusionPixelsFraction; // 0x96c(0x04)
	None bPauseOnLossOfFocus; // 0x970(0x01)
	None MaxParticleResize; // 0x974(0x04)
	None MaxParticleResizeWarn; // 0x978(0x04)
	None PendingDroppedNotes; // 0x980(0x10)
	None NetClientTicksPerSecond; // 0x990(0x04)
	None DisplayGamma; // 0x994(0x04)
	None MinDesiredFrameRate; // 0x998(0x04)
	None DefaultSelectedMaterialColor; // 0x99c(0x10)
	None SelectedMaterialColor; // 0x9ac(0x10)
	None SelectionOutlineColor; // 0x9bc(0x10)
	None SubduedSelectionOutlineColor; // 0x9cc(0x10)
	None SelectedMaterialColorOverride; // 0x9dc(0x10)
	None bIsOverridingSelectedColor; // 0x9ec(0x01)
	None bEnableOnScreenDebugMessages; // 0x9f0(0x01)
	None bEnableOnScreenDebugMessagesDisplay; // 0x9f0(0x01)
	None bSuppressMapWarnings; // 0x9f0(0x01)
	None bDisableAILogging; // 0x9f0(0x01)
	None bEnableVisualLogRecordingOnStart; // 0x9f4(0x04)
	None ScreenSaverInhibitorSemaphore; // 0x9fc(0x04)
	None bLockReadOnlyLevels; // 0xa00(0x01)
	None ParticleEventManagerClassPath; // 0xa08(0x10)
	None SelectionHighlightIntensity; // 0xa18(0x04)
	None BSPSelectionHighlightIntensity; // 0xa1c(0x04)
	None SelectionHighlightIntensityBillboards; // 0xa20(0x04)
	None NetDriverDefinitions; // 0xc70(0x10)
	None ServerActors; // 0xc80(0x10)
	None RuntimeServerActors; // 0xc90(0x10)
	None NetErrorLogInterval; // 0xca0(0x04)
	None bStartedLoadMapMovie; // 0xca4(0x01)
	None NextWorldContextHandle; // 0xcc0(0x04)
	None MaxDeltaTime; // 0xe58(0x04)
	None ServerFlushLogInterval; // 0xe5c(0x04)
	None GameInstance; // 0xe60(0x08)
	None PlayerController; // 0x30(0x08)
	None CurrentNetSpeed; // 0x38(0x04)
	None ConfiguredInternetSpeed; // 0x3c(0x04)
	None ConfiguredLanSpeed; // 0x40(0x04)
	None Children; // 0x48(0x10)
	None Driver; // 0x58(0x08)
	None PackageMapClass; // 0x60(0x08)
	None PackageMap; // 0x68(0x08)
	None OpenChannels; // 0x70(0x10)
	None SentTemporaries; // 0x80(0x10)
	None ViewTarget; // 0x90(0x08)
	None OwningActor; // 0x98(0x08)
	None MaxPacket; // 0xa0(0x04)
	None InternalAck; // 0xa4(0x01)
	None PlayerId; // 0x160(0x28)
	None LastReceiveTime; // 0x1d0(0x08)
	None ChannelsToTick; // 0x1510(0x10)
	None ViewportClient; // 0x70(0x08)
	None AspectRatioAxisConstraint; // 0x94(0x01)
	None PendingLevelPlayerControllerClass; // 0x98(0x08)
	None bSentSplitJoin; // 0xa0(0x01)
	None ControllerId; // 0xb8(0x04)
	None FrameDelay; // 0x28(0x04)
	None NetConnectionClassName; // 0x30(0x10)
	None ReplicationDriverClassName; // 0x40(0x10)
	None MaxDownloadSize; // 0x50(0x04)
	None bClampListenServerTickRate; // 0x54(0x01)
	None NetServerMaxTickRate; // 0x58(0x04)
	None MaxNetTickRate; // 0x5c(0x04)
	None MaxInternetClientRate; // 0x60(0x04)
	None MaxClientRate; // 0x64(0x04)
	None ServerTravelPause; // 0x68(0x04)
	None SpawnPrioritySeconds; // 0x6c(0x04)
	None RelevantTimeout; // 0x70(0x04)
	None KeepAliveTime; // 0x74(0x04)
	None HandshakeTimeout; // 0x78(0x04)
	None InitialConnectTimeout; // 0x7c(0x04)
	None ConnectionTimeout; // 0x80(0x04)
	None TimeoutMultiplierForUnoptimizedBuilds; // 0x84(0x04)
	None bNoTimeouts; // 0x88(0x01)
	None bNeverApplyNetworkEmulationSettings; // 0x89(0x01)
	None ServerConnection; // 0x90(0x08)
	None ClientConnections; // 0x98(0x10)
	None RecentlyDisconnectedTrackingTime; // 0x108(0x04)
	None World; // 0x148(0x08)
	None WorldPackage; // 0x150(0x08)
	None NetConnectionClass; // 0x178(0x08)
	None ReplicationDriverClass; // 0x180(0x08)
	None NetDriverName; // 0x198(0x08)
	None ChannelDefinitions; // 0x1a0(0x10)
	None ChannelDefinitionMap; // 0x1b0(0x50)
	None ThrottleSpawnDefinitions; // 0x200(0x10)
	None ThrottleSpawnsRemaining; // 0x210(0x10)
	None ThrottleSpawnPausedFrameNumber; // 0x220(0x04)
	None ActorChannelPool; // 0x228(0x10)
	None Time; // 0x240(0x04)
	None ReplicationDriver; // 0x718(0x08)
	None bCanBeBaked; // 0x30(0x01)
	None bIsDirty; // 0x30(0x01)
	None bBakedDataSuccesfully; // 0x30(0x01)
	None bUseControllerRotationPitch; // 0x228(0x01)
	None bUseControllerRotationYaw; // 0x228(0x01)
	None bUseControllerRotationRoll; // 0x228(0x01)
	None bCanAffectNavigationGeneration; // 0x228(0x01)
	None BaseEyeHeight; // 0x22c(0x04)
	None AutoPossessPlayer; // 0x230(0x01)
	None AutoPossessAI; // 0x231(0x01)
	None RemoteViewPitch; // 0x232(0x01)
	None AIControllerClass; // 0x238(0x08)
	None PlayerState; // 0x240(0x08)
	None LastHitBy; // 0x250(0x08)
	None Controller; // 0x258(0x08)
	None ControlInputVector; // 0x264(0x0c)
	None LastControlInputVector; // 0x270(0x0c)
	None Mesh; // 0x280(0x08)
	None CharacterMovement; // 0x288(0x08)
	None CapsuleComponent; // 0x290(0x08)
	None BasedMovement; // 0x298(0x30)
	None ReplicatedBasedMovement; // 0x2c8(0x30)
	None AnimRootMotionTranslationScale; // 0x2f8(0x04)
	None BaseTranslationOffset; // 0x2fc(0x0c)
	None BaseRotationOffset; // 0x310(0x10)
	None ReplicatedServerLastTransformUpdateTimeStamp; // 0x320(0x04)
	None ReplayLastTransformUpdateTimeStamp; // 0x324(0x04)
	None ReplicatedMovementMode; // 0x328(0x01)
	None bInBaseReplication; // 0x329(0x01)
	None CrouchedEyeHeight; // 0x32c(0x04)
	None bIsCrouched; // 0x330(0x01)
	None bProxyIsJumpForceApplied; // 0x330(0x01)
	None bPressedJump; // 0x330(0x01)
	None bClientUpdating; // 0x330(0x01)
	None bClientWasFalling; // 0x330(0x01)
	None bClientResimulateRootMotion; // 0x330(0x01)
	None bClientResimulateRootMotionSources; // 0x330(0x01)
	None bSimGravityDisabled; // 0x330(0x01)
	None bClientCheckEncroachmentOnNetUpdate; // 0x331(0x01)
	None bServerMoveIgnoreRootMotion; // 0x331(0x01)
	None bWasJumping; // 0x331(0x01)
	None JumpKeyHoldTime; // 0x334(0x04)
	None JumpForceTimeRemaining; // 0x338(0x04)
	None ProxyJumpForceStartedTime; // 0x33c(0x04)
	None JumpMaxHoldTime; // 0x340(0x04)
	None JumpMaxCount; // 0x344(0x04)
	None JumpCurrentCount; // 0x348(0x04)
	None JumpCurrentCountPreJump; // 0x34c(0x04)
	None OnReachedJumpApex; // 0x358(0x10)
	None MovementModeChangedDelegate; // 0x378(0x10)
	None OnCharacterMovementUpdated; // 0x388(0x10)
	None SavedRootMotion; // 0x398(0x38)
	None ClientRootMotionParams; // 0x3d0(0x40)
	None RootMotionRepMoves; // 0x410(0x10)
	None RepRootMotion; // 0x420(0x98)
	None UpdatedComponent; // 0xb0(0x08)
	None UpdatedPrimitive; // 0xb8(0x08)
	None Velocity; // 0xc4(0x0c)
	None PlaneConstraintNormal; // 0xd0(0x0c)
	None PlaneConstraintOrigin; // 0xdc(0x0c)
	None bUpdateOnlyIfRendered; // 0xe8(0x01)
	None bAutoUpdateTickRegistration; // 0xe8(0x01)
	None bTickBeforeOwner; // 0xe8(0x01)
	None bAutoRegisterUpdatedComponent; // 0xe8(0x01)
	None bConstrainToPlane; // 0xe8(0x01)
	None bSnapToPlaneAtStart; // 0xe8(0x01)
	None bAutoRegisterPhysicsVolumeUpdates; // 0xe8(0x01)
	None bComponentShouldUpdatePhysicsVolume; // 0xe8(0x01)
	None PlaneConstraintAxisSetting; // 0xeb(0x01)
	None NavAgentProps; // 0xf0(0x30)
	None FixedPathBrakingDistance; // 0x120(0x04)
	None bUpdateNavAgentWithOwnersCollision; // 0x124(0x01)
	None bUseAccelerationForPaths; // 0x124(0x01)
	None bUseFixedBrakingDistanceForPaths; // 0x124(0x01)
	None MovementState; // 0x125(0x01)
	None PathFollowingComp; // 0x128(0x08)
	None PawnOwner; // 0x130(0x08)
	None CharacterOwner; // 0x148(0x08)
	None GravityScale; // 0x150(0x04)
	None MaxStepHeight; // 0x154(0x04)
	None JumpZVelocity; // 0x158(0x04)
	None JumpOffJumpZFactor; // 0x15c(0x04)
	None WalkableFloorAngle; // 0x160(0x04)
	None WalkableFloorZ; // 0x164(0x04)
	None MovementMode; // 0x168(0x01)
	None CustomMovementMode; // 0x169(0x01)
	None NetworkSmoothingMode; // 0x16a(0x01)
	None GroundFriction; // 0x16c(0x04)
	None MaxWalkSpeed; // 0x18c(0x04)
	None MaxWalkSpeedCrouched; // 0x190(0x04)
	None MaxSwimSpeed; // 0x194(0x04)
	None MaxFlySpeed; // 0x198(0x04)
	None MaxCustomMovementSpeed; // 0x19c(0x04)
	None MaxAcceleration; // 0x1a0(0x04)
	None MinAnalogWalkSpeed; // 0x1a4(0x04)
	None BrakingFrictionFactor; // 0x1a8(0x04)
	None BrakingFriction; // 0x1ac(0x04)
	None BrakingSubStepTime; // 0x1b0(0x04)
	None BrakingDecelerationWalking; // 0x1b4(0x04)
	None BrakingDecelerationFalling; // 0x1b8(0x04)
	None BrakingDecelerationSwimming; // 0x1bc(0x04)
	None BrakingDecelerationFlying; // 0x1c0(0x04)
	None AirControl; // 0x1c4(0x04)
	None AirControlBoostMultiplier; // 0x1c8(0x04)
	None AirControlBoostVelocityThreshold; // 0x1cc(0x04)
	None FallingLateralFriction; // 0x1d0(0x04)
	None CrouchedHalfHeight; // 0x1d4(0x04)
	None Buoyancy; // 0x1d8(0x04)
	None PerchRadiusThreshold; // 0x1dc(0x04)
	None PerchAdditionalHeight; // 0x1e0(0x04)
	None RotationRate; // 0x1e4(0x0c)
	None bUseSeparateBrakingFriction; // 0x1f0(0x01)
	None bApplyGravityWhileJumping; // 0x1f0(0x01)
	None bUseControllerDesiredRotation; // 0x1f0(0x01)
	None bOrientRotationToMovement; // 0x1f0(0x01)
	None bSweepWhileNavWalking; // 0x1f0(0x01)
	None bMovementInProgress; // 0x1f0(0x01)
	None bEnableScopedMovementUpdates; // 0x1f0(0x01)
	None bEnableServerDualMoveScopedMovementUpdates; // 0x1f1(0x01)
	None bForceMaxAccel; // 0x1f1(0x01)
	None bRunPhysicsWithNoController; // 0x1f1(0x01)
	None bForceNextFloorCheck; // 0x1f1(0x01)
	None bShrinkProxyCapsule; // 0x1f1(0x01)
	None bCanWalkOffLedges; // 0x1f1(0x01)
	None bCanWalkOffLedgesWhenCrouching; // 0x1f1(0x01)
	None bNetworkSkipProxyPredictionOnNetUpdate; // 0x1f2(0x01)
	None bNetworkAlwaysReplicateTransformUpdateTimestamp; // 0x1f2(0x01)
	None bDeferUpdateMoveComponent; // 0x1f2(0x01)
	None bPreventMeshDoubleMode; // 0x1f2(0x01)
	None bEnablePhysicsInteraction; // 0x1f2(0x01)
	None bTouchForceScaledToMass; // 0x1f2(0x01)
	None bPushForceScaledToMass; // 0x1f2(0x01)
	None bPushForceUsingZOffset; // 0x1f3(0x01)
	None bScalePushForceToVelocity; // 0x1f3(0x01)
	None DeferredUpdatedMoveComponent; // 0x1f8(0x08)
	None MaxOutOfWaterStepHeight; // 0x200(0x04)
	None OutofWaterZ; // 0x204(0x04)
	None Mass; // 0x208(0x04)
	None StandingDownwardForceScale; // 0x20c(0x04)
	None InitialPushForceFactor; // 0x210(0x04)
	None PushForceFactor; // 0x214(0x04)
	None PushForcePointZOffsetFactor; // 0x218(0x04)
	None TouchForceFactor; // 0x21c(0x04)
	None MinTouchForce; // 0x220(0x04)
	None MaxTouchForce; // 0x224(0x04)
	None RepulsionForce; // 0x228(0x04)
	None Acceleration; // 0x22c(0x0c)
	None LastUpdateRotation; // 0x240(0x10)
	None LastUpdateLocation; // 0x250(0x0c)
	None LastUpdateVelocity; // 0x25c(0x0c)
	None bHasQueuedServerMove; // 0x268(0x01)
	None QueuedServerLocation; // 0x26c(0x0c)
	None QueuedServerRotation; // 0x280(0x10)
	None ParallelUpdateMoveMode; // 0x298(0x01)
	None ParallelUpdateTransform; // 0x2a0(0x30)
	None ServerLastTransformUpdateTimeStamp; // 0x2d0(0x04)
	None ServerLastClientGoodMoveAckTime; // 0x2d4(0x04)
	None ServerLastClientAdjustmentTime; // 0x2d8(0x04)
	None PendingImpulseToApply; // 0x2dc(0x0c)
	None PendingForceToApply; // 0x2e8(0x0c)
	None AnalogInputModifier; // 0x2f4(0x04)
	None MaxSimulationTimeStep; // 0x304(0x04)
	None MaxSimulationIterations; // 0x308(0x04)
	None MaxJumpApexAttemptsPerSimulation; // 0x30c(0x04)
	None MaxDepenetrationWithGeometry; // 0x310(0x04)
	None MaxDepenetrationWithGeometryAsProxy; // 0x314(0x04)
	None MaxDepenetrationWithPawn; // 0x318(0x04)
	None MaxDepenetrationWithPawnAsProxy; // 0x31c(0x04)
	None NetworkSimulatedSmoothLocationTime; // 0x320(0x04)
	None NetworkSimulatedSmoothRotationTime; // 0x324(0x04)
	None ListenServerNetworkSimulatedSmoothLocationTime; // 0x328(0x04)
	None ListenServerNetworkSimulatedSmoothRotationTime; // 0x32c(0x04)
	None NetProxyShrinkRadius; // 0x330(0x04)
	None NetProxyShrinkHalfHeight; // 0x334(0x04)
	None NetworkMaxSmoothUpdateDistance; // 0x338(0x04)
	None NetworkNoSmoothUpdateDistance; // 0x33c(0x04)
	None NetworkMinTimeBetweenClientAckGoodMoves; // 0x340(0x04)
	None NetworkMinTimeBetweenClientAdjustments; // 0x344(0x04)
	None NetworkMinTimeBetweenClientAdjustmentsLargeCorrection; // 0x348(0x04)
	None NetworkLargeClientCorrectionDistance; // 0x34c(0x04)
	None LedgeCheckThreshold; // 0x350(0x04)
	None JumpOutOfWaterPitch; // 0x354(0x04)
	None CurrentFloor; // 0x358(0x94)
	None DefaultLandMovementMode; // 0x3ec(0x01)
	None DefaultWaterMovementMode; // 0x3ed(0x01)
	None GroundMovementMode; // 0x3ee(0x01)
	None bMaintainHorizontalGroundVelocity; // 0x3ef(0x01)
	None bImpartBaseVelocityX; // 0x3ef(0x01)
	None bImpartBaseVelocityY; // 0x3ef(0x01)
	None bImpartBaseVelocityZ; // 0x3ef(0x01)
	None bImpartBaseAngularVelocity; // 0x3ef(0x01)
	None bJustTeleported; // 0x3ef(0x01)
	None bNetworkUpdateReceived; // 0x3ef(0x01)
	None bNetworkMovementModeChanged; // 0x3ef(0x01)
	None bIgnoreClientMovementErrorChecksAndCorrection; // 0x3f0(0x01)
	None bServerAcceptClientAuthoritativePosition; // 0x3f0(0x01)
	None bNotifyApex; // 0x3f0(0x01)
	None bCheatFlying; // 0x3f0(0x01)
	None bWantsToCrouch; // 0x3f0(0x01)
	None bCrouchMaintainsBaseLocation; // 0x3f0(0x01)
	None bIgnoreBaseRotation; // 0x3f0(0x01)
	None bFastAttachedMove; // 0x3f0(0x01)
	None bAlwaysCheckFloor; // 0x3f1(0x01)
	None bUseFlatBaseForFloorChecks; // 0x3f1(0x01)
	None bPerformingJumpOff; // 0x3f1(0x01)
	None bWantsToLeaveNavWalking; // 0x3f1(0x01)
	None bUseRVOAvoidance; // 0x3f1(0x01)
	None bRequestedMoveUseAcceleration; // 0x3f1(0x01)
	None bWasSimulatingRootMotion; // 0x3f1(0x01)
	None bAllowPhysicsRotationDuringAnimRootMotion; // 0x3f2(0x01)
	None bHasRequestedVelocity; // 0x3f2(0x01)
	None bRequestedMoveWithMaxSpeed; // 0x3f2(0x01)
	None bWasAvoidanceUpdated; // 0x3f2(0x01)
	None bProjectNavMeshWalking; // 0x3f2(0x01)
	None bProjectNavMeshOnBothWorldChannels; // 0x3f2(0x01)
	None AvoidanceConsiderationRadius; // 0x408(0x04)
	None RequestedVelocity; // 0x40c(0x0c)
	None AvoidanceUID; // 0x418(0x04)
	None AvoidanceGroup; // 0x41c(0x04)
	None GroupsToAvoid; // 0x420(0x04)
	None GroupsToIgnore; // 0x424(0x04)
	None AvoidanceWeight; // 0x428(0x04)
	None PendingLaunchVelocity; // 0x42c(0x0c)
	None NavMeshProjectionInterval; // 0x4d8(0x04)
	None NavMeshProjectionTimer; // 0x4dc(0x04)
	None NavMeshProjectionInterpSpeed; // 0x4e0(0x04)
	None NavMeshProjectionHeightScaleUp; // 0x4e4(0x04)
	None NavMeshProjectionHeightScaleDown; // 0x4e8(0x04)
	None NavWalkingFloorDistTolerance; // 0x4ec(0x04)
	None PostPhysicsTickFunction; // 0x4f0(0x30)
	None MinTimeBetweenTimeStampResets; // 0x538(0x04)
	None CurrentRootMotion; // 0x540(0x38)
	None RootMotionParams; // 0x610(0x40)
	None AnimRootMotionVelocity; // 0x650(0x0c)
	None LocalPlayers; // 0x38(0x10)
	None OnlineSession; // 0x48(0x08)
	None ReferencedObjects; // 0x50(0x10)
	None OptionsString; // 0x220(0x10)
	None GameSessionClass; // 0x230(0x08)
	None GameStateClass; // 0x238(0x08)
	None PlayerControllerClass; // 0x240(0x08)
	None PlayerStateClass; // 0x248(0x08)
	None HUDClass; // 0x250(0x08)
	None DefaultPawnClass; // 0x258(0x08)
	None SpectatorClass; // 0x260(0x08)
	None ReplaySpectatorPlayerControllerClass; // 0x268(0x08)
	None ServerStatReplicatorClass; // 0x270(0x08)
	None GameSession; // 0x278(0x08)
	None GameState; // 0x280(0x08)
	None ServerStatReplicator; // 0x288(0x08)
	None DefaultPlayerName; // 0x290(0x18)
	None bUseSeamlessTravel; // 0x2a8(0x01)
	None bStartPlayersAsSpectators; // 0x2a8(0x01)
	None bPauseable; // 0x2a8(0x01)
	None MatchState; // 0x2c0(0x08)
	None bDelayedStart; // 0x2c8(0x01)
	None NumSpectators; // 0x2cc(0x04)
	None NumPlayers; // 0x2d0(0x04)
	None NumBots; // 0x2d4(0x04)
	None MinRespawnDelay; // 0x2d8(0x04)
	None NumTravellingPlayers; // 0x2dc(0x04)
	None EngineMessageClass; // 0x2e0(0x08)
	None InactivePlayerArray; // 0x2e8(0x10)
	None InactivePlayerStateLifeSpan; // 0x2f8(0x04)
	None MaxInactivePlayers; // 0x2fc(0x04)
	None bHandleDedicatedServerReplays; // 0x300(0x01)
	None GameModeClass; // 0x220(0x08)
	None AuthorityGameMode; // 0x228(0x08)
	None SpectatorClass; // 0x230(0x08)
	None PlayerArray; // 0x238(0x10)
	None bReplicatedHasBegunPlay; // 0x248(0x01)
	None ReplicatedWorldTimeSeconds; // 0x24c(0x04)
	None ServerWorldTimeSecondsDelta; // 0x250(0x04)
	None ServerWorldTimeSecondsUpdateFrequency; // 0x254(0x04)
	None MatchState; // 0x270(0x08)
	None PreviousMatchState; // 0x278(0x08)
	None ElapsedTime; // 0x280(0x04)
	None PlayerState; // 0x228(0x08)
	None OnInstigatedAnyDamage; // 0x238(0x10)
	None StateName; // 0x248(0x08)
	None Pawn; // 0x250(0x08)
	None Character; // 0x260(0x08)
	None TransformComponent; // 0x268(0x08)
	None ControlRotation; // 0x288(0x0c)
	None bAttachToPawn; // 0x294(0x01)
	None Player; // 0x298(0x08)
	None AcknowledgedPawn; // 0x2a0(0x08)
	None ControllingDirTrackInst; // 0x2a8(0x08)
	None MyHud; // 0x2b0(0x08)
	None PlayerCameraManager; // 0x2b8(0x08)
	None PlayerCameraManagerClass; // 0x2c0(0x08)
	None bAutoManageActiveCameraTarget; // 0x2c8(0x01)
	None TargetViewRotation; // 0x2cc(0x0c)
	None SmoothTargetViewRotationSpeed; // 0x2e4(0x04)
	None HiddenActors; // 0x2f0(0x10)
	None HiddenPrimitiveComponents; // 0x300(0x10)
	None LastSpectatorStateSynchTime; // 0x314(0x04)
	None LastSpectatorSyncLocation; // 0x318(0x0c)
	None LastSpectatorSyncRotation; // 0x324(0x0c)
	None ClientCap; // 0x330(0x04)
	None CheatManager; // 0x338(0x08)
	None CheatClass; // 0x340(0x08)
	None PlayerInputClass; // 0x348(0x08)
	None PlayerInput; // 0x350(0x08)
	None ActiveForceFeedbackEffects; // 0x358(0x10)
	None bPlayerIsWaiting; // 0x3d8(0x01)
	None NetPlayerIndex; // 0x3dc(0x01)
	None PendingSwapConnection; // 0x418(0x08)
	None NetConnection; // 0x420(0x08)
	None InputYawScale; // 0x440(0x04)
	None InputPitchScale; // 0x444(0x04)
	None InputRollScale; // 0x448(0x04)
	None bShowMouseCursor; // 0x44c(0x01)
	None bEnableClickEvents; // 0x44c(0x01)
	None bEnableTouchEvents; // 0x44c(0x01)
	None bEnableMouseOverEvents; // 0x44c(0x01)
	None bEnableTouchOverEvents; // 0x44c(0x01)
	None bForceFeedbackEnabled; // 0x44c(0x01)
	None ForceFeedbackScale; // 0x450(0x04)
	None ClickEventKeys; // 0x458(0x10)
	None DefaultMouseCursor; // 0x468(0x01)
	None CurrentMouseCursor; // 0x469(0x01)
	None DefaultClickTraceChannel; // 0x46a(0x01)
	None CurrentClickTraceChannel; // 0x46b(0x01)
	None HitResultTraceDistance; // 0x46c(0x04)
	None SeamlessTravelCount; // 0x470(0x02)
	None LastCompletedSeamlessTravelCount; // 0x472(0x02)
	None InactiveStateInputComponent; // 0x4e8(0x08)
	None bShouldPerformFullTickWhenPaused; // 0x4f0(0x01)
	None CurrentTouchInterface; // 0x508(0x08)
	None SpectatorPawn; // 0x560(0x08)
	None bIsLocalPlayerController; // 0x56c(0x01)
	None SpawnLocation; // 0x570(0x0c)
	None DebugExecBindings; // 0x120(0x10)
	None InvertedAxis; // 0x160(0x10)
	None TouchRegionStates; // 0x12a0(0x10)
	None CachedKeyToActionInfo; // 0x120(0x10)
	None Score; // 0x220(0x04)
	None PlayerId; // 0x224(0x04)
	None Ping; // 0x228(0x01)
	None bShouldUpdateReplicatedPing; // 0x22a(0x01)
	None bIsSpectator; // 0x22a(0x01)
	None bOnlySpectator; // 0x22a(0x01)
	None bIsABot; // 0x22a(0x01)
	None bIsInactive; // 0x22a(0x01)
	None bFromPreviousLevel; // 0x22a(0x01)
	None StartTime; // 0x22c(0x04)
	None EngineMessageClass; // 0x230(0x08)
	None SavedNetworkAddress; // 0x240(0x10)
	None UniqueId; // 0x250(0x28)
	None PawnPrivate; // 0x280(0x08)
	None PlayerNamePrivate; // 0x300(0x10)
	None ViewportConsole; // 0x40(0x08)
	None DebugProperties; // 0x48(0x10)
	None MaxSplitscreenPlayers; // 0x68(0x04)
	None World; // 0x78(0x08)
	None GameInstance; // 0x80(0x08)
	None ConsoleTargetPlayer; // 0x38(0x08)
	None DefaultTexture_Black; // 0x40(0x08)
	None DefaultTexture_White; // 0x48(0x08)
	None HistoryBuffer; // 0x68(0x10)
	None DefaultHeight; // 0x130(0x04)
	None VisibilityCellSize; // 0x228(0x04)
	None VisibilityAggressiveness; // 0x22c(0x01)
	None bPrecomputeVisibility; // 0x22d(0x01)
	None bPlaceCellsOnlyAlongCameraTracks; // 0x22d(0x01)
	None bEnableWorldBoundsChecks; // 0x22d(0x01)
	None bEnableNavigationSystem; // 0x22d(0x01)
	None bEnableAISystem; // 0x22d(0x01)
	None bEnableWorldComposition; // 0x22d(0x01)
	None bUseClientSideLevelStreamingVolumes; // 0x22d(0x01)
	None bEnableWorldOriginRebasing; // 0x22d(0x01)
	None bWorldGravitySet; // 0x22e(0x01)
	None bGlobalGravitySet; // 0x22e(0x01)
	None bMinimizeBSPSections; // 0x22e(0x01)
	None bForceNoPrecomputedLighting; // 0x22e(0x01)
	None bHighPriorityLoading; // 0x22e(0x01)
	None bHighPriorityLoadingLocal; // 0x22e(0x01)
	None bOverrideDefaultBroadphaseSettings; // 0x22e(0x01)
	None NavigationSystemConfig; // 0x230(0x08)
	None NavigationSystemConfigOverride; // 0x238(0x08)
	None WorldToMeters; // 0x240(0x04)
	None KillZ; // 0x244(0x04)
	None KillZDamageType; // 0x248(0x08)
	None WorldGravityZ; // 0x250(0x04)
	None GlobalGravityZ; // 0x254(0x04)
	None DefaultPhysicsVolumeClass; // 0x258(0x08)
	None PhysicsCollisionHandlerClass; // 0x260(0x08)
	None DefaultGameMode; // 0x268(0x08)
	None GameNetworkManagerClass; // 0x270(0x08)
	None PackedLightAndShadowMapTextureSize; // 0x278(0x04)
	None DefaultColorScale; // 0x27c(0x0c)
	None DefaultMaxDistanceFieldOcclusionDistance; // 0x288(0x04)
	None GlobalDistanceFieldViewDistance; // 0x28c(0x04)
	None DynamicIndirectShadowsSelfShadowingIntensity; // 0x290(0x04)
	None DefaultReverbSettings; // 0x298(0x20)
	None DefaultAmbientZoneSettings; // 0x2b8(0x24)
	None MonoCullingDistance; // 0x2dc(0x04)
	None DefaultBaseSoundMix; // 0x2e0(0x08)
	None TimeDilation; // 0x2e8(0x04)
	None MatineeTimeDilation; // 0x2ec(0x04)
	None DemoPlayTimeDilation; // 0x2f0(0x04)
	None MinGlobalTimeDilation; // 0x2f4(0x04)
	None MaxGlobalTimeDilation; // 0x2f8(0x04)
	None MinUndilatedFrameTime; // 0x2fc(0x04)
	None MaxUndilatedFrameTime; // 0x300(0x04)
	None BroadphaseSettings; // 0x304(0x40)
	None Pauser; // 0x348(0x08)
	None ReplicationViewers; // 0x350(0x10)
	None AssetUserData; // 0x360(0x10)
	None PauserPlayerState; // 0x370(0x08)
	None MaxNumberOfBookmarks; // 0x378(0x04)
	None DefaultBookmarkClass; // 0x380(0x08)
	None BookmarkArray; // 0x388(0x10)
	None LastBookmarkClass; // 0x398(0x08)
	None NativeClass; // 0x28(0x08)
	None ObjectReferenceList; // 0x2c0(0x10)
	None bIsGlobalAsyncScanEnvironment; // 0x2d0(0x01)
	None bShouldGuessTypeAndName; // 0x2d1(0x01)
	None bShouldUseSynchronousLoad; // 0x2d2(0x01)
	None bIsLoadingFromPakFiles; // 0x2d3(0x01)
	None bShouldAcquireMissingChunksOnLoad; // 0x2d4(0x01)
	None bOnlyCookProductionAssets; // 0x2d5(0x01)
	None bIsBulkScanning; // 0x2d6(0x01)
	None bIsPrimaryAssetDirectoryCurrent; // 0x2d7(0x01)
	None bIsManagementDatabaseCurrent; // 0x2d8(0x01)
	None bUpdateManagementDatabaseAfterScan; // 0x2d9(0x01)
	None bIncludeOnlyOnDiskAssets; // 0x2da(0x01)
	None NumberOfSpawnedNotifications; // 0x2dc(0x04)
	None bForceUseAllBundlesDuringLoadRecursive; // 0x3d0(0x01)
	None PlayerOwner; // 0x220(0x08)
	None bLostFocusPaused; // 0x228(0x01)
	None bShowHUD; // 0x228(0x01)
	None bShowDebugInfo; // 0x228(0x01)
	None CurrentTargetIndex; // 0x22c(0x04)
	None bShowHitBoxDebugInfo; // 0x230(0x01)
	None bShowOverlays; // 0x230(0x01)
	None bEnableDebugTextShadow; // 0x230(0x01)
	None PostRenderedActors; // 0x238(0x10)
	None DebugDisplay; // 0x250(0x10)
	None ToggledDebugCategories; // 0x260(0x10)
	None Canvas; // 0x270(0x08)
	None DebugCanvas; // 0x278(0x08)
	None DebugTextList; // 0x280(0x10)
	None ShowDebugTargetDesiredClass; // 0x290(0x08)
	None ShowDebugTargetActor; // 0x298(0x08)
	None BrushType; // 0x220(0x01)
	None BrushColor; // 0x224(0x04)
	None PolyFlags; // 0x228(0x04)
	None bColored; // 0x22c(0x01)
	None bSolidWhenSelected; // 0x22c(0x01)
	None bPlaceableFromClassBrowser; // 0x22c(0x01)
	None bNotForClientOrServer; // 0x22c(0x01)
	None Brush; // 0x230(0x08)
	None BrushComponent; // 0x238(0x08)
	None bInManipulation; // 0x240(0x01)
	None SavedSelections; // 0x248(0x10)
	None PersistentLevel; // 0x30(0x08)
	None NetDriver; // 0x38(0x08)
	None LineBatcher; // 0x40(0x08)
	None PersistentLineBatcher; // 0x48(0x08)
	None ForegroundLineBatcher; // 0x50(0x08)
	None NetworkManager; // 0x58(0x08)
	None PhysicsCollisionHandler; // 0x60(0x08)
	None ExtraReferencedObjects; // 0x68(0x10)
	None PerModuleDataObjects; // 0x78(0x10)
	None LevelSequenceActors; // 0x88(0x10)
	None StreamingLevels; // 0x98(0x10)
	None StreamingLevelsToConsider; // 0xa8(0x28)
	None StreamingLevelsPrefix; // 0xd0(0x10)
	None CurrentLevelPendingVisibility; // 0xe0(0x08)
	None CurrentLevelPendingInvisibility; // 0xe8(0x08)
	None DemoNetDriver; // 0xf0(0x08)
	None MyParticleEventManager; // 0xf8(0x08)
	None DefaultPhysicsVolume; // 0x100(0x08)
	None bAreConstraintsDirty; // 0x11e(0x01)
	None NavigationSystem; // 0x120(0x08)
	None AuthorityGameMode; // 0x128(0x08)
	None GameState; // 0x130(0x08)
	None AISystem; // 0x138(0x08)
	None AvoidanceManager; // 0x140(0x08)
	None Levels; // 0x148(0x10)
	None LevelCollections; // 0x158(0x10)
	None OwningGameInstance; // 0x188(0x08)
	None ParameterCollectionInstances; // 0x190(0x10)
	None CanvasForRenderingToTarget; // 0x1a0(0x08)
	None CanvasForDrawMaterialToRenderTarget; // 0x1a8(0x08)
	None ComponentsThatNeedEndOfFrameUpdate; // 0x200(0x10)
	None ComponentsThatNeedEndOfFrameUpdate_OnGameThread; // 0x210(0x10)
	None WorldComposition; // 0x560(0x08)
	None PSCPool; // 0x5f0(0x58)
	None HirezObjectPool; // 0x710(0x68)
	None SubTracks; // 0x38(0x10)
	None TrackInstClass; // 0x48(0x08)
	None ActiveCondition; // 0x50(0x01)
	None TrackTitle; // 0x58(0x10)
	None bOnePerGroup; // 0x68(0x01)
	None bDirGroupOnly; // 0x68(0x01)
	None bDisableTrack; // 0x68(0x01)
	None bIsSelected; // 0x68(0x01)
	None bIsAnimControlTrack; // 0x68(0x01)
	None bSubTrackOnly; // 0x68(0x01)
	None bVisible; // 0x68(0x01)
	None bIsRecording; // 0x68(0x01)
	None VectorTrack; // 0x70(0x18)
	None CurveTension; // 0x88(0x04)
	None FloatTrack; // 0x70(0x18)
	None CurveTension; // 0x88(0x04)
	None AnimBlueprintGeneratedClass; // 0x670(0x08)
	None AnimClass; // 0x678(0x08)
	None AnimScriptInstance; // 0x680(0x08)
	None PostProcessAnimInstance; // 0x688(0x08)
	None AnimationData; // 0x690(0x18)
	None RootBoneTranslation; // 0x6b8(0x0c)
	None LineCheckBoundsScale; // 0x6c4(0x0c)
	None LinkedInstances; // 0x710(0x10)
	None CachedBoneSpaceTransforms; // 0x720(0x10)
	None CachedComponentSpaceTransforms; // 0x730(0x10)
	None GlobalAnimRateScale; // 0x760(0x04)
	None KinematicBonesUpdateType; // 0x764(0x01)
	None PhysicsTransformUpdateMode; // 0x765(0x01)
	None AnimationMode; // 0x767(0x01)
	None bDisablePostProcessBlueprint; // 0x769(0x01)
	None bUpdateOverlapsOnAnimationFinalize; // 0x769(0x01)
	None bHasValidBodies; // 0x769(0x01)
	None bBlendPhysics; // 0x769(0x01)
	None bEnablePhysicsOnDedicatedServer; // 0x769(0x01)
	None bUpdateJointsFromAnimation; // 0x76a(0x01)
	None bDisableClothSimulation; // 0x76a(0x01)
	None bDisableRigidBodyAnimNode; // 0x76a(0x01)
	None bAllowAnimCurveEvaluation; // 0x76a(0x01)
	None bDisableAnimCurves; // 0x76a(0x01)
	None bCollideWithEnvironment; // 0x76b(0x01)
	None bCollideWithAttachedChildren; // 0x76b(0x01)
	None bLocalSpaceSimulation; // 0x76b(0x01)
	None bResetAfterTeleport; // 0x76b(0x01)
	None bDeferKinematicBoneUpdate; // 0x76b(0x01)
	None bNoSkeletonUpdate; // 0x76b(0x01)
	None bPauseAnims; // 0x76b(0x01)
	None bUseRefPoseOnInitAnim; // 0x76c(0x01)
	None bEnablePerPolyCollision; // 0x76c(0x01)
	None bForceRefpose; // 0x76c(0x01)
	None bOnlyAllowAutonomousTickPose; // 0x76c(0x01)
	None bIsAutonomousTickPose; // 0x76c(0x01)
	None bOldForceRefPose; // 0x76c(0x01)
	None bShowPrePhysBones; // 0x76c(0x01)
	None bRequiredBonesUpToDate; // 0x76c(0x01)
	None bAnimTreeInitialised; // 0x76d(0x01)
	None bIncludeComponentLocationIntoBounds; // 0x76d(0x01)
	None bEnableLineCheckWithBounds; // 0x76d(0x01)
	None bUseBendingElements; // 0x76d(0x01)
	None bUseTetrahedralConstraints; // 0x76d(0x01)
	None bUseThinShellVolumeConstraints; // 0x76d(0x01)
	None bUseSelfCollisions; // 0x76d(0x01)
	None bUseContinuousCollisionDetection; // 0x76d(0x01)
	None bPropagateCurvesToSlaves; // 0x76e(0x01)
	None bSkipKinematicUpdateWhenInterpolating; // 0x76e(0x01)
	None bSkipBoundsUpdateWhenInterpolating; // 0x76e(0x01)
	None bNeedsQueuedAnimEventsDispatched; // 0x76e(0x01)
	None CachedAnimCurveUidVersion; // 0x770(0x02)
	None MassMode; // 0x772(0x01)
	None UniformMass; // 0x774(0x04)
	None TotalMass; // 0x778(0x04)
	None Density; // 0x77c(0x04)
	None MinPerParticleMass; // 0x780(0x04)
	None ClothBlendWeight; // 0x784(0x04)
	None EdgeStiffness; // 0x788(0x04)
	None BendingStiffness; // 0x78c(0x04)
	None AreaStiffness; // 0x790(0x04)
	None VolumeStiffness; // 0x794(0x04)
	None StrainLimitingStiffness; // 0x798(0x04)
	None ShapeTargetStiffness; // 0x79c(0x04)
	None DisallowedAnimCurves; // 0x7a0(0x10)
	None BodySetup; // 0x7b0(0x08)
	None OnConstraintBroken; // 0x7c0(0x10)
	None ClothingSimulationFactory; // 0x7d0(0x08)
	None TeleportDistanceThreshold; // 0x8a8(0x04)
	None TeleportRotationThreshold; // 0x8ac(0x04)
	None LastPoseTickFrame; // 0x8b8(0x04)
	None bDelayedAnimTaskValid; // 0x8c8(0x01)
	None bDisableDelayedAnimTask; // 0x8c9(0x01)
	None ClothingInteractor; // 0x920(0x08)
	None OnAnimInitialized; // 0xa50(0x10)
	None StaticMeshGuid; // 0x458(0x10)
	None ForcedLodModel; // 0x468(0x04)
	None PreviousLODLevel; // 0x46c(0x04)
	None MinLOD; // 0x470(0x04)
	None SubDivisionStepSize; // 0x474(0x04)
	None StaticMesh; // 0x478(0x08)
	None WireframeColorOverride; // 0x480(0x04)
	None bEvaluateWorldPositionOffset; // 0x484(0x01)
	None bOverrideWireframeColor; // 0x484(0x01)
	None bOverrideMinLod; // 0x484(0x01)
	None bOverrideNavigationExport; // 0x484(0x01)
	None bForceNavigationObstacle; // 0x484(0x01)
	None bDisallowMeshPaintPerInstance; // 0x484(0x01)
	None bIgnoreInstanceForTextureStreaming; // 0x484(0x01)
	None bOverrideLightMapRes; // 0x484(0x01)
	None bCastDistanceFieldIndirectShadow; // 0x485(0x01)
	None bOverrideDistanceFieldSelfShadowBias; // 0x485(0x01)
	None bUseSubDivisions; // 0x485(0x01)
	None bUseDefaultCollision; // 0x485(0x01)
	None bReverseCulling; // 0x485(0x01)
	None bHasReflectionCaptureOverrideLocation; // 0x485(0x01)
	None ReflectionCaptureOverrideLocation; // 0x488(0x0c)
	None OverriddenLightMapRes; // 0x494(0x04)
	None DistanceFieldIndirectShadowMinVisibility; // 0x498(0x04)
	None DistanceFieldSelfShadowBias; // 0x49c(0x04)
	None StreamingDistanceMultiplier; // 0x4a0(0x04)
	None LODData; // 0x4a8(0x10)
	None StreamingTextureData; // 0x4b8(0x10)
	None LightmassSettings; // 0x4c8(0x1c)

	void SwimNotifyTransitionStateLock(None bpp__bShouldLock__pf); // SwimNotifyTransitionStateLock Sub_Hero_ABP_Swimming.Sub_Hero_ABP_Swimming_C.SwimNotifyTransitionStateLock // (Native|Event|Public|BlueprintCallable) // <Game+0x195dfa0>
	void SetFillPercentage(None Percentage); // SetFillPercentage WBP_ProgressBar.WBP_ProgressBar_C.SetFillPercentage // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x260f470>
	void HandleInitialSpawn(); // HandleInitialSpawn WBP_TextChat_ChatEntry.WBP_TextChat_ChatEntry_C.HandleInitialSpawn // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x260f470>
	void ServerSetPartyOwner(None InUniqueId, None InPartyOwnerId); // ServerSetPartyOwner Lobby.LobbyBeaconClient.ServerSetPartyOwner // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <Game+0xb3cad0>
