// WidgetBlueprintGeneratedClass ArrowBtn.ArrowBtn_C
class UArrowBtn_C : public UUserWidget {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248 (8)
	struct UButton Button_68; // 0x250 (8)
	struct UImage Normal; // 0x258 (8)
	struct UImage Over; // 0x260 (8)
	struct UOverlay Overlay_113; // 0x268 (8)
	struct UImage Press; // 0x270 (8)
	struct FMulticastInlineDelegate CilckBtn; // 0x278 (16)
	char IsLeft : 0; // 0x288 (1)

	void Construct(); // Function ArrowBtn.ArrowBtn_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void BndEvt__Button_67_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function ArrowBtn.ArrowBtn_C.BndEvt__Button_67_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void BndEvt__Button_67_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature(); // Function ArrowBtn.ArrowBtn_C.BndEvt__Button_67_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void BndEvt__Button_67_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(); // Function ArrowBtn.ArrowBtn_C.BndEvt__Button_67_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void BndEvt__Button_67_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(); // Function ArrowBtn.ArrowBtn_C.BndEvt__Button_67_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void BndEvt__Button_67_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature(); // Function ArrowBtn.ArrowBtn_C.BndEvt__Button_67_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void ExecuteUbergraph_ArrowBtn(int32_t EntryPoint); // Function ArrowBtn.ArrowBtn_C.ExecuteUbergraph_ArrowBtn(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void CilckBtn__DelegateSignature(); // Function ArrowBtn.ArrowBtn_C.CilckBtn__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
};

// Function ArrowBtn.ArrowBtn_C.Construct
inline void UArrowBtn_C::Construct() {
	static auto fn = UObject::FindObject<UFunction>("Function ArrowBtn.ArrowBtn_C.Construct");

	struct Construct_Params {
		
	}; Construct_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ArrowBtn.ArrowBtn_C.BndEvt__Button_67_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
inline void UArrowBtn_C::BndEvt__Button_67_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature() {
	static auto fn = UObject::FindObject<UFunction>("Function ArrowBtn.ArrowBtn_C.BndEvt__Button_67_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature");

	struct BndEvt__Button_67_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params {
		
	}; BndEvt__Button_67_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ArrowBtn.ArrowBtn_C.BndEvt__Button_67_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature
inline void UArrowBtn_C::BndEvt__Button_67_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature() {
	static auto fn = UObject::FindObject<UFunction>("Function ArrowBtn.ArrowBtn_C.BndEvt__Button_67_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature");

	struct BndEvt__Button_67_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature_Params {
		
	}; BndEvt__Button_67_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ArrowBtn.ArrowBtn_C.BndEvt__Button_67_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
inline void UArrowBtn_C::BndEvt__Button_67_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature() {
	static auto fn = UObject::FindObject<UFunction>("Function ArrowBtn.ArrowBtn_C.BndEvt__Button_67_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature");

	struct BndEvt__Button_67_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature_Params {
		
	}; BndEvt__Button_67_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ArrowBtn.ArrowBtn_C.BndEvt__Button_67_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature
inline void UArrowBtn_C::BndEvt__Button_67_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature() {
	static auto fn = UObject::FindObject<UFunction>("Function ArrowBtn.ArrowBtn_C.BndEvt__Button_67_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature");

	struct BndEvt__Button_67_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature_Params {
		
	}; BndEvt__Button_67_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ArrowBtn.ArrowBtn_C.BndEvt__Button_67_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature
inline void UArrowBtn_C::BndEvt__Button_67_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature() {
	static auto fn = UObject::FindObject<UFunction>("Function ArrowBtn.ArrowBtn_C.BndEvt__Button_67_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature");

	struct BndEvt__Button_67_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature_Params {
		
	}; BndEvt__Button_67_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ArrowBtn.ArrowBtn_C.ExecuteUbergraph_ArrowBtn
inline void UArrowBtn_C::ExecuteUbergraph_ArrowBtn(int32_t EntryPoint) {
	static auto fn = UObject::FindObject<UFunction>("Function ArrowBtn.ArrowBtn_C.ExecuteUbergraph_ArrowBtn");

	struct ExecuteUbergraph_ArrowBtn_Params {
		int32_t EntryPoint;
	}; ExecuteUbergraph_ArrowBtn_Params Params;

	Params.EntryPoint = EntryPoint;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function ArrowBtn.ArrowBtn_C.CilckBtn__DelegateSignature
inline void UArrowBtn_C::CilckBtn__DelegateSignature() {
	static auto fn = UObject::FindObject<UFunction>("Function ArrowBtn.ArrowBtn_C.CilckBtn__DelegateSignature");

	struct CilckBtn__DelegateSignature_Params {
		
	}; CilckBtn__DelegateSignature_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

