// WidgetBlueprintGeneratedClass ArrowBtn.ArrowBtn_C
struct UArrowBtn_C : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Button_68; //  0x250 Size(8)
	struct Unknown Normal; //  0x258 Size(8)
	struct Unknown Over; //  0x260 Size(8)
	struct Unknown Overlay_113; //  0x268 Size(8)
	struct Unknown Press; //  0x270 Size(8)
	struct FMulticastInlineDelegate CilckBtn; //  0x278 Size(10)
	char IsLeft; //  0x288 Size(1)

	void Construct(); // Function ArrowBtn.ArrowBtn_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

