// WidgetBlueprintGeneratedClass AudioWidget.AudioWidget_C
struct UAudioWidget_C : UBravoHotelSettingSubWidget {
	struct Unknown UberGraphFrame; //  0x298 Size(8)
	struct Unknown Effect; //  0x2a0 Size(8)
	struct Unknown Master; //  0x2a8 Size(8)
	struct Unknown MasterOnOff; //  0x2b0 Size(8)
	struct Unknown Music; //  0x2b8 Size(8)
	struct Unknown ScrollBox_55; //  0x2c0 Size(8)
	struct Unknown UI; //  0x2c8 Size(8)
	struct Unknown VoiceChanel; //  0x2d0 Size(8)
	struct Unknown VoiceInput; //  0x2d8 Size(8)
	struct Unknown VoiceInputMode; //  0x2e0 Size(8)
	struct Unknown VoiceOutput; //  0x2e8 Size(8)
	struct Unknown ; //  0x2f0 Size(8)
	struct Unknown ; //  0x2f8 Size(8)
	struct Unknown ScrollBarTimer; //  0x300 Size(8)

	void Construct(); // Function AudioWidget.AudioWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

