// AudioComponent Engine.AudioComponent
 struct UAudioComponent : USceneComponent {
	Unknown UberGraphFrame; // 0x368(0x08)
	char bUseComplexAsSimpleCollision; // 0x4f0(0x01)
	char bUseAsyncCooking; // 0x4f1(0x01)
	Unknown ProcMeshBodySetup; // 0x4f8(0x08)
	Unknown ProcMeshSections; // 0x500(0x10)
	Unknown CollisionConvexElems; // 0x510(0x10)
	Unknown LocalBounds; // 0x520(0x1c)
	Unknown AsyncBodySetupQueue; // 0x540(0x10)
	Unknown RenderingLogSeverity; // 0x28(0x01)
	char ShowWarningsOnScreen; // 0x29(0x01)
	struct FString DeveloperOptions; // 0x30(0x10)
	Unknown Texture; // 0x70(0x08)
	Unknown GeneratedMaterials; // 0x30(0x10)
	Unknown GeneratedMeshes; // 0x40(0x10)
	Unknown GeneratedTextures; // 0x50(0x10)
	Unknown ParameterDecorations; // 0xe8(0x10)
	Unknown TextureReuseCache; // 0x108(0x50)
	Unknown ReferencedMaterials; // 0x320(0x10)
	Unknown PhysicsAssetsToMerge; // 0x3d0(0x10)
	Unknown Materials; // 0x28(0x50)
	Unknown Textures; // 0x78(0x50)
	Unknown ReferenceSkeletalMesh; // 0x28(0x08)
	Unknown ReferenceStaticMesh; // 0x30(0x08)
	Unknown Relevancy; // 0x38(0x01)
	char bDisableTextureLayoutManagement; // 0x39(0x01)
	Unknown ReferencedMaterials; // 0x40(0x10)
	Unknown ImageProperties; // 0x50(0x10)
	Unknown GroupNodeMap; // 0x60(0x50)
	Unknown ContributingMorphTargets; // 0xb0(0x10)
	Unknown MorphTargetReconstructionInfo; // 0xc0(0x10)
	Unknown VersionId; // 0xd0(0x10)
	Unknown ParameterProperties; // 0xe0(0x10)
	Unknown ParameterUIDataMap; // 0x140(0x50)
	Unknown StateUIDataMap; // 0x190(0x50)
	Unknown PhysicsAssetsMap; // 0x1e0(0x50)
	Unknown MaskOutCache; // 0x230(0x28)
	char bIsChildObject; // 0x258(0x01)
	Unknown MaskOutCache_HardRef; // 0x260(0x08)
	Unknown CustomizableObject; // 0x28(0x08)
	Unknown SkeletalMesh; // 0x30(0x08)
	Unknown BoolParameters; // 0x38(0x10)
	Unknown IntParameters; // 0x48(0x10)
	Unknown FloatParameters; // 0x58(0x10)
	Unknown TextureParameters; // 0x68(0x10)
	Unknown VectorParameters; // 0x78(0x10)
	Unknown ProjectorParameters; // 0x88(0x10)
	char bBuildParameterDecorations; // 0x98(0x01)
	struct FMulticastInlineDelegate UpdatedDelegate; // 0xa0(0x10)
	struct FString SkeletalMeshStatus; // 0x110(0x10)
	Unknown MaterialTags; // 0x140(0x10)
	Unknown PrivateData; // 0x1d0(0x08)
	Unknown Textures; // 0x28(0x10)
	Unknown PendingReleaseSkeletalMesh; // 0x28(0x10)
	Unknown PreviewExternalImageProvider; // 0x48(0x08)
	Unknown ProtectedCachedTextures; // 0x150(0x10)
	Unknown DefaultInstanceLODManagement; // 0x170(0x08)
	Unknown CurrentInstanceLODManagement; // 0x178(0x08)
	float SkippedLastRenderTime; // 0x23c(0x04)
	Unknown CustomizableObjectInstance; // 0x240(0x08)
	Unknown CustomizableSkeletalComponent; // 0x398(0x08)
	Unknown DataSources; // 0x28(0x50)
	Unknown Components; // 0x28(0x10)
	Unknown UberGraphFrame; // 0x298(0x08)
	Unknown 15XSensitivity; // 0x2a0(0x08)
	Unknown 2XSensitivity; // 0x2a8(0x08)
	Unknown 4XSensitivity; // 0x2b0(0x08)
	Unknown 6XSensitivity; // 0x2b8(0x08)
	Unknown 8XSensitivity; // 0x2c0(0x08)
	Unknown ADSSensitivity; // 0x2c8(0x08)
	Unknown GeneralSensitivity; // 0x2d0(0x08)
	Unknown ReverseLeftAndRight; // 0x2d8(0x08)
	Unknown ReverseUpAndDown; // 0x2e0(0x08)
	Unknown ScrollBox_55; // 0x2e8(0x08)
	Unknown TargetingSensitivity; // 0x2f0(0x08)
	Unknown ToggleADS; // 0x2f8(0x08)
	Unknown ToggleAOS; // 0x300(0x08)
	Unknown ToggleCrouch; // 0x308(0x08)
	Unknown ToggleExLean; // 0x310(0x08)
	Unknown ToggleFreeLook; // 0x318(0x08)
	Unknown ToggleSprint; // 0x320(0x08)
	Unknown ToggleSteadyAim; // 0x328(0x08)
	Unknown ToggleWalk; // 0x330(0x08)
	Unknown TotalSensitivity; // 0x338(0x08)
	Unknown UsingDetailSensitivity; // 0x340(0x08)
	Unknown VehicleDriverSensitivity; // 0x348(0x08)
	Unknown VerticalBox_1; // 0x350(0x08)
	Unknown VerticlaModifier; // 0x358(0x08)
	Unknown ; // 0x360(0x08)
	Unknown ; // 0x368(0x08)
	Unknown ; // 0x370(0x08)
	Unknown ScrollBarTimer; // 0x378(0x08)
	char EnableTransport; // 0x28(0x01)
	struct FString ListenEndpoint; // 0x30(0x10)
	Unknown ConnectToEndpoints; // 0x40(0x10)
	int32_t ConnectionRetryDelay; // 0x50(0x04)
	char bStopServiceWhenAppDeactivates; // 0x54(0x01)
	Unknown PrimaryComponentTick; // 0x30(0x30)
	Unknown ComponentTags; // 0x60(0x10)
	Unknown AssetUserData; // 0x70(0x10)
	int32_t UCSSerializationIndex; // 0x84(0x04)
	char bNetAddressable; // 0x88(0x01)
	char bReplicates; // 0x88(0x01)
	char bAutoActivate; // 0x89(0x01)
	char bIsActive; // 0x8a(0x01)
	char bEditableWhenInherited; // 0x8a(0x01)
	char bCanEverAffectNavigation; // 0x8a(0x01)
	char bIsEditorOnly; // 0x8a(0x01)
	Unknown CreationMethod; // 0x8c(0x01)
	struct FMulticastSparseDelegate OnComponentActivated; // 0x8d(0x01)
	struct FMulticastSparseDelegate OnComponentDeactivated; // 0x8e(0x01)
	Unknown UCSModifiedProperties; // 0x90(0x10)
	Unknown PhysicsVolume; // 0x144(0x08)
	Unknown AttachParent; // 0x1d0(0x08)
	struct FName AttachSocketName; // 0x1dc(0x08)
	Unknown AttachChildren; // 0xb8(0x10)
	Unknown ClientAttachedChildren; // 0x190(0x10)
	Unknown RelativeLocation; // 0x224(0x0c)
	Unknown RelativeRotation; // 0x1b4(0x0c)
	Unknown RelativeScale3D; // 0x1c4(0x0c)
	Unknown ComponentVelocity; // 0x164(0x0c)
	char bComponentToWorldUpdated; // 0x140(0x01)
	char bAbsoluteLocation; // 0x220(0x01)
	char bAbsoluteRotation; // 0x1d8(0x01)
	char bAbsoluteScale; // 0x188(0x01)
	char bVisible; // 0xc8(0x01)
	char bShouldBeAttached; // 0x220(0x01)
	char bShouldSnapLocationWhenAttached; // 0x1b0(0x01)
	char bShouldSnapRotationWhenAttached; // 0x188(0x01)
	char bShouldUpdatePhysicsVolume; // 0x1a0(0x01)
	char bHiddenInGame; // 0x220(0x01)
	char bBoundsChangeTriggersStreamingDataRebuild; // 0xc8(0x01)
	char bUseAttachParentBound; // 0x1d8(0x01)
	Unknown Mobility; // 0x221(0x01)
	Unknown DetailMode; // 0x160(0x01)
	struct FMulticastSparseDelegate PhysicsVolumeChangedDelegate; // 0xb0(0x01)
	Unknown ReplaySamplable; // 0x28(0x01)
	Unknown ReplaySampleClass; // 0x30(0x08)
	float ReplaySamplingFrequency; // 0x38(0x04)
	uint32_t ClientReplaySamplingGUID; // 0x3c(0x04)
	char bReplayLevelAttached; // 0x44(0x01)
	Unknown ReplaySamplesForPlayback; // 0x68(0x10)
	Unknown SelfActor; // 0x88(0x08)
	Unknown PrimaryActorTick; // 0x1d8(0x30)
	char bNetTemporary; // 0x284(0x01)
	char bNetStartup; // 0x248(0x01)
	char bOnlyRelevantToOwner; // 0x1c4(0x01)
	char bAlwaysRelevant; // 0xa1(0x01)
	char bReplicateMovement; // 0x260(0x01)
	char bHidden; // 0x222(0x01)
	char bTearOff; // 0x284(0x01)
	char bExchangedRoles; // 0x120(0x01)
	char bNetLoadOnClient; // 0x138(0x01)
	char bNetUseOwnerRelevancy; // 0xe8(0x01)
	char bRelevantForNetworkReplays; // 0x170(0x01)
	char bRelevantForLevelBounds; // 0x138(0x01)
	char bReplayRewindable; // 0x9f(0x01)
	char bAllowTickBeforeBeginPlay; // 0x1c4(0x01)
	char bAutoDestroyWhenFinished; // 0x1c4(0x01)
	char bCanBeDamaged; // 0x1a0(0x01)
	char bBlockInput; // 0x303(0x01)
	char bCollideWhenPlacing; // 0x301(0x01)
	char bFindCameraComponentWhenViewTarget; // 0x251(0x01)
	char bGenerateOverlapEventsDuringLevelStreaming; // 0x30e(0x01)
	char bIgnoresOriginShifting; // 0x155(0x01)
	char bEnableAutoLODGeneration; // 0x251(0x01)
	char bIsEditorOnlyActor; // 0x120(0x01)
	char bActorSeamlessTraveled; // 0xea(0x01)
	char bReplicates; // 0x9d(0x01)
	char bCanBeInCluster; // 0x90(0x01)
	char bAllowReceiveTickEventOnDedicatedServer; // 0x198(0x01)
	char bActorEnableCollision; // 0x1b8(0x01)
	char bActorIsBeingDestroyed; // 0x30e(0x01)
	Unknown UpdateOverlapsMethodDuringLevelStreaming; // 0x154(0x01)
	Unknown DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0xa3(0x01)
	Unknown RemoteRole; // 0x279(0x01)
	Unknown ReplicatedMovement; // 0xec(0x34)
	float InitialLifeSpan; // 0x2e0(0x04)
	float CustomTimeDilation; // 0x308(0x04)
	Unknown AttachmentReplication; // 0xa8(0x40)
	Unknown Owner; // 0x178(0x08)
	struct FName NetDriverName; // 0x94(0x08)
	Unknown Role; // 0x9e(0x01)
	Unknown NetDormancy; // 0x238(0x01)
	Unknown SpawnCollisionHandlingMethod; // 0x304(0x01)
	Unknown AutoReceiveInput; // 0x302(0x01)
	int32_t InputPriority; // 0x150(0x04)
	Unknown InputComponent; // 0x2f8(0x08)
	float NetCullDistanceSquared; // 0x280(0x04)
	int32_t NetTag; // 0x24c(0x04)
	float NetUpdateFrequency; // 0x27c(0x04)
	float MinNetUpdateFrequency; // 0x288(0x04)
	float NetPriority; // 0x21c(0x04)
	Unknown Instigator; // 0x258(0x08)
	Unknown Children; // 0x268(0x10)
	Unknown RootComponent; // 0x158(0x08)
	Unknown ControllingMatineeActors; // 0x208(0x10)
	Unknown Layers; // 0x188(0x10)
	Unknown ParentComponent; // 0x1bc(0x08)
	char bEnableRerunConstructionScript; // 0x30c(0x01)
	Unknown Tags; // 0x140(0x10)
	struct FMulticastSparseDelegate OnTakeAnyDamage; // 0x218(0x01)
	struct FMulticastSparseDelegate OnTakePointDamage; // 0x27a(0x01)
	struct FMulticastSparseDelegate OnTakeRadialDamage; // 0x9c(0x01)
	struct FMulticastSparseDelegate OnActorBeginOverlap; // 0x27b(0x01)
	struct FMulticastSparseDelegate OnActorEndOverlap; // 0xa0(0x01)
	struct FMulticastSparseDelegate OnBeginCursorOver; // 0x221(0x01)
	struct FMulticastSparseDelegate OnEndCursorOver; // 0xe9(0x01)
	struct FMulticastSparseDelegate OnClicked; // 0x278(0x01)
	struct FMulticastSparseDelegate OnReleased; // 0x2e4(0x01)
	struct FMulticastSparseDelegate OnInputTouchBegin; // 0x300(0x01)
	struct FMulticastSparseDelegate OnInputTouchEnd; // 0x285(0x01)
	struct FMulticastSparseDelegate OnInputTouchEnter; // 0xa2(0x01)
	struct FMulticastSparseDelegate OnInputTouchLeave; // 0x250(0x01)
	struct FMulticastSparseDelegate OnActorHit; // 0x180(0x01)
	struct FMulticastSparseDelegate OnDestroyed; // 0x220(0x01)
	struct FMulticastSparseDelegate OnEndPlay; // 0x30d(0x01)
	Unknown InstanceComponents; // 0x128(0x10)
	Unknown BlueprintCreatedComponents; // 0x1a8(0x10)
	Unknown LoadedObjects; // 0x1c8(0x10)
	char bShouldDoAnimNotifies; // 0x318(0x01)
	char bWakeOnLevelStart; // 0x318(0x01)
	Unknown SkeletalMeshComponent; // 0x320(0x08)
	Unknown ReplicatedMesh; // 0x328(0x08)
	Unknown ReplicatedPhysAsset; // 0x330(0x08)
	Unknown ReplicatedMaterial0; // 0x338(0x08)
	Unknown ReplicatedMaterial1; // 0x340(0x08)
	float MinDrawDistance; // 0x240(0x04)
	float LDMaxDrawDistance; // 0x244(0x04)
	float CachedMaxDrawDistance; // 0x248(0x04)
	Unknown DepthPriorityGroup; // 0x24c(0x01)
	Unknown ViewOwnerDepthPriorityGroup; // 0x24d(0x01)
	Unknown IndirectLightingCacheQuality; // 0x24e(0x01)
	Unknown LightmapType; // 0x24f(0x01)
	char bUseMaxLODAsImposter; // 0x250(0x01)
	char bBatchImpostersAsInstances; // 0x250(0x01)
	char bNeverDistanceCull; // 0x250(0x01)
	char bAlwaysCreatePhysicsState; // 0x250(0x01)
	char bGenerateOverlapEvents; // 0x251(0x01)
	char bMultiBodyOverlap; // 0x251(0x01)
	char bTraceComplexOnMove; // 0x251(0x01)
	char bReturnMaterialOnMove; // 0x251(0x01)
	char bUseViewOwnerDepthPriorityGroup; // 0x251(0x01)
	char bAllowCullDistanceVolume; // 0x251(0x01)
	char bHasMotionBlurVelocityMeshes; // 0x251(0x01)
	char bVisibleInReflectionCaptures; // 0x251(0x01)
	char bVisibleInRayTracing; // 0x252(0x01)
	char bRenderInMainPass; // 0x252(0x01)
	char bRenderInDepthPass; // 0x252(0x01)
	char bReceivesDecals; // 0x252(0x01)
	char bOwnerNoSee; // 0x252(0x01)
	char bOnlyOwnerSee; // 0x252(0x01)
	char bIgnoreNearClippingForOcclusion; // 0x252(0x01)
	char bTreatAsBackgroundForOcclusion; // 0x252(0x01)
	char bUseAsOccluder; // 0x253(0x01)
	char bSelectable; // 0x253(0x01)
	char bForceMipStreaming; // 0x253(0x01)
	char bHasPerInstanceHitProxies; // 0x253(0x01)
	char CastShadow; // 0x253(0x01)
	char bAffectDynamicIndirectLighting; // 0x253(0x01)
	char bAffectDistanceFieldLighting; // 0x253(0x01)
	char bCastDynamicShadow; // 0x253(0x01)
	char bCastStaticShadow; // 0x254(0x01)
	char bCastDirectionalShadow; // 0x254(0x01)
	char bCastVolumetricTranslucentShadow; // 0x254(0x01)
	char bSelfShadowOnly; // 0x254(0x01)
	char bCastFarShadow; // 0x254(0x01)
	char bCastInsetShadow; // 0x254(0x01)
	char bCastCinematicShadow; // 0x254(0x01)
	char bCastHiddenShadow; // 0x254(0x01)
	char bCastShadowAsTwoSided; // 0x255(0x01)
	char bLightAsIfStatic; // 0x255(0x01)
	char bLightAttachmentsAsGroup; // 0x255(0x01)
	char bExcludeFromLightAttachmentGroup; // 0x255(0x01)
	char bReceiveMobileCSMShadows; // 0x255(0x01)
	char bSingleSampleShadowFromStationaryLights; // 0x255(0x01)
	char bIgnoreRadialImpulse; // 0x255(0x01)
	char bIgnoreRadialForce; // 0x255(0x01)
	char bApplyImpulseOnDamage; // 0x256(0x01)
	char bReplicatePhysicsToAutonomousProxy; // 0x256(0x01)
	char bFillCollisionUnderneathForNavmesh; // 0x256(0x01)
	char AlwaysLoadOnClient; // 0x256(0x01)
	char AlwaysLoadOnServer; // 0x256(0x01)
	char bUseEditorCompositing; // 0x256(0x01)
	char bRenderCustomDepth; // 0x256(0x01)
	char bHasNoStreamableTextures; // 0x257(0x01)
	Unknown bHasCustomNavigableGeometry; // 0x258(0x01)
	Unknown CanCharacterStepUpOn; // 0x25a(0x01)
	Unknown LightingChannels; // 0x25b(0x01)
	Unknown CustomDepthStencilWriteMask; // 0x25c(0x01)
	int32_t CustomDepthStencilValue; // 0x260(0x04)
	Unknown CustomPrimitiveData; // 0x268(0x10)
	Unknown CustomPrimitiveDataInternal; // 0x278(0x10)
	int32_t TranslucencySortPriority; // 0x288(0x04)
	int32_t VisibilityId; // 0x28c(0x04)
	Unknown RuntimeVirtualTextures; // 0x290(0x10)
	int8_t VirtualTextureLodBias; // 0x2a0(0x01)
	int8_t VirtualTextureCullMips; // 0x2a1(0x01)
	int8_t VirtualTextureMinCoverage; // 0x2a2(0x01)
	Unknown VirtualTextureRenderPassType; // 0x2a3(0x01)
	float LpvBiasMultiplier; // 0x2a8(0x04)
	float BoundsScale; // 0x2b4(0x04)
	Unknown MoveIgnoreActors; // 0x2c8(0x10)
	Unknown MoveIgnoreComponents; // 0x2d8(0x10)
	Unknown BodyInstance; // 0x2f8(0x190)
	struct FMulticastSparseDelegate OnComponentHit; // 0x488(0x01)
	struct FMulticastSparseDelegate OnComponentBeginOverlap; // 0x489(0x01)
	struct FMulticastSparseDelegate OnComponentEndOverlap; // 0x48a(0x01)
	struct FMulticastSparseDelegate OnComponentWake; // 0x48b(0x01)
	struct FMulticastSparseDelegate OnComponentSleep; // 0x48c(0x01)
	struct FMulticastSparseDelegate OnBeginCursorOver; // 0x48e(0x01)
	struct FMulticastSparseDelegate OnEndCursorOver; // 0x48f(0x01)
	struct FMulticastSparseDelegate OnClicked; // 0x490(0x01)
	struct FMulticastSparseDelegate OnReleased; // 0x491(0x01)
	struct FMulticastSparseDelegate OnInputTouchBegin; // 0x492(0x01)
	struct FMulticastSparseDelegate OnInputTouchEnd; // 0x493(0x01)
	struct FMulticastSparseDelegate OnInputTouchEnter; // 0x494(0x01)
	struct FMulticastSparseDelegate OnInputTouchLeave; // 0x495(0x01)
	Unknown LODParentPrimitive; // 0x4b0(0x08)
	float MipStreamingScale; // 0x4b8(0x04)
	Unknown OverrideMaterials; // 0x4c0(0x10)
	char bEnableMaterialParameterCaching; // 0x4e0(0x01)
	Unknown SkeletalMesh; // 0x4e8(0x08)
	Unknown MasterPoseComponent; // 0x4f0(0x08)
	Unknown SkinCacheUsage; // 0x4f8(0x10)
	Unknown PhysicsAssetOverride; // 0x600(0x08)
	int32_t ForcedLodModel; // 0x608(0x04)
	int32_t MinLodModel; // 0x60c(0x04)
	float StreamingDistanceMultiplier; // 0x618(0x04)
	Unknown LODInfo; // 0x628(0x10)
	Unknown VisibilityBasedAnimTickOption; // 0x65c(0x01)
	char bOverrideMinLod; // 0x65e(0x01)
	char bUseBoundsFromMasterPoseComponent; // 0x65e(0x01)
	char bForceWireframe; // 0x65e(0x01)
	char bDisplayBones; // 0x65e(0x01)
	char bDisableMorphTarget; // 0x65e(0x01)
	char bHideSkin; // 0x65e(0x01)
	char bPerBoneMotionBlur; // 0x65f(0x01)
	char bComponentUseFixedSkelBounds; // 0x65f(0x01)
	char bConsiderAllBodiesForBounds; // 0x65f(0x01)
	char bSyncAttachParentLOD; // 0x65f(0x01)
	char bCanHighlightSelectedSections; // 0x65f(0x01)
	char bRecentlyRendered; // 0x65f(0x01)
	char bCastCapsuleDirectShadow; // 0x65f(0x01)
	char bCastCapsuleIndirectShadow; // 0x65f(0x01)
	char bCPUSkinning; // 0x660(0x01)
	char bEnableUpdateRateOptimizations; // 0x660(0x01)
	char bDisplayDebugUpdateRateOptimizations; // 0x660(0x01)
	char bRenderStatic; // 0x660(0x01)
	char bIgnoreMasterPoseComponentLOD; // 0x660(0x01)
	char bCachedLocalBoundsUpToDate; // 0x660(0x01)
	char bForceMeshObjectUpdate; // 0x661(0x01)
	float CapsuleIndirectShadowMinVisibility; // 0x664(0x04)
	Unknown CachedWorldSpaceBounds; // 0x678(0x1c)
	Unknown CachedWorldToLocalTransform; // 0x6a0(0x40)
	double ForceMipLevelsToBeResidentTimestamp; // 0x28(0x08)
	int32_t NumCinematicMipLevels; // 0x30(0x04)
	int32_t StreamingIndex; // 0x34(0x04)
	int32_t CachedCombinedLODBias; // 0x38(0x04)
	Unknown CachedNumResidentLODs; // 0x3c(0x01)
	char bCachedReadyForStreaming; // 0x3d(0x01)
	char NeverStream; // 0x3d(0x01)
	char bGlobalForceMipLevelsToBeResident; // 0x3d(0x01)
	char bIsStreamable; // 0x3d(0x01)
	char bHasStreamingUpdatePending; // 0x3d(0x01)
	char bForceMiplevelsToBeResident; // 0x3d(0x01)
	char bIgnoreStreamingMipBias; // 0x3d(0x01)
	char bUseCinematicMipLevels; // 0x3d(0x01)
	Unknown Skeleton; // 0x60(0x08)
	Unknown ImportedBounds; // 0x68(0x1c)
	Unknown ExtendedBounds; // 0x84(0x1c)
	Unknown PositiveBoundsExtension; // 0xa0(0x0c)
	Unknown NegativeBoundsExtension; // 0xac(0x0c)
	Unknown Materials; // 0xb8(0x10)
	Unknown SkelMirrorTable; // 0xc8(0x10)
	Unknown LODInfo; // 0xd8(0x10)
	Unknown MinLOD; // 0x138(0x04)
	Unknown DisableBelowMinLodStripping; // 0x13c(0x01)
	Unknown SkelMirrorAxis; // 0x13d(0x01)
	Unknown SkelMirrorFlipAxis; // 0x13e(0x01)
	char bUseFullPrecisionUVs; // 0x13f(0x01)
	char bUseHighPrecisionTangentBasis; // 0x13f(0x01)
	char bHasBeenSimplified; // 0x13f(0x01)
	char bHasVertexColors; // 0x13f(0x01)
	char bEnablePerPolyCollision; // 0x13f(0x01)
	Unknown BodySetup; // 0x140(0x08)
	Unknown PhysicsAsset; // 0x148(0x08)
	Unknown ShadowPhysicsAsset; // 0x150(0x08)
	Unknown NodeMappingData; // 0x158(0x10)
	Unknown MorphTargets; // 0x168(0x10)
	Unknown PostProcessAnimBlueprint; // 0x2f0(0x08)
	Unknown MeshClothingAssets; // 0x2f8(0x10)
	Unknown SamplingInfo; // 0x308(0x30)
	Unknown AssetUserData; // 0x338(0x10)
	Unknown Sockets; // 0x350(0x10)
	Unknown SkinWeightProfiles; // 0x370(0x10)
	Unknown StaticMeshComponent; // 0x310(0x08)
	char bStaticMeshReplicateMovement; // 0x318(0x01)
	Unknown NavigationGeometryGatheringMode; // 0x319(0x01)
	Unknown LightingGuid; // 0x48(0x10)
	int32_t LODBias; // 0x58(0x04)
	Unknown CompressionSettings; // 0x5c(0x01)
	Unknown Filter; // 0x5d(0x01)
	Unknown MipLoadOptions; // 0x5e(0x01)
	Unknown LODGroup; // 0x5f(0x01)
	char SRGB; // 0x60(0x01)
	char bNoTiling; // 0x60(0x01)
	char VirtualTextureStreaming; // 0x60(0x01)
	char CompressionYCoCg; // 0x60(0x01)
	char bAsyncResourceReleaseHasBeenStarted; // 0x60(0x01)
	Unknown AssetUserData; // 0x68(0x10)
	Unknown Format; // 0xc0(0x01)
	Unknown PlayerOwner; // 0x310(0x08)
	char bLostFocusPaused; // 0x318(0x01)
	char bShowHUD; // 0x318(0x01)
	char bShowDebugInfo; // 0x318(0x01)
	int32_t CurrentTargetIndex; // 0x31c(0x04)
	char bShowHitBoxDebugInfo; // 0x320(0x01)
	char bShowOverlays; // 0x320(0x01)
	char bEnableDebugTextShadow; // 0x320(0x01)
	Unknown PostRenderedActors; // 0x328(0x10)
	Unknown DebugDisplay; // 0x340(0x10)
	Unknown ToggledDebugCategories; // 0x350(0x10)
	Unknown Canvas; // 0x360(0x08)
	Unknown DebugCanvas; // 0x368(0x08)
	Unknown DebugTextList; // 0x370(0x10)
	Unknown ShowDebugTargetDesiredClass; // 0x380(0x08)
	Unknown ShowDebugTargetActor; // 0x388(0x08)
	Unknown PlayerController; // 0x30(0x08)
	int32_t CurrentNetSpeed; // 0x38(0x04)
	int32_t ConfiguredInternetSpeed; // 0x3c(0x04)
	int32_t ConfiguredLanSpeed; // 0x40(0x04)
	Unknown SelfNetConnection; // 0xb0(0x08)
	Unknown Children; // 0xb8(0x10)
	Unknown Driver; // 0xc8(0x08)
	Unknown PackageMapClass; // 0xd0(0x08)
	Unknown PackageMap; // 0xd8(0x08)
	Unknown OpenChannels; // 0xe0(0x10)
	Unknown SentTemporaries; // 0xf0(0x10)
	Unknown ViewTarget; // 0x100(0x08)
	Unknown OwningActor; // 0x108(0x08)
	int32_t MaxPacket; // 0x110(0x04)
	char InternalAck; // 0x114(0x01)
	Unknown PlayerId; // 0x1d0(0x28)
	double LastReceiveTime; // 0x240(0x08)
	Unknown ChannelsToTick; // 0x1580(0x10)
	struct FString NetConnectionClassName; // 0x30(0x10)
	struct FString ReplicationDriverClassName; // 0x40(0x10)
	int32_t MaxDownloadSize; // 0x50(0x04)
	char bClampListenServerTickRate; // 0x54(0x01)
	int32_t NetServerMaxTickRate; // 0x58(0x04)
	int32_t MaxNetTickRate; // 0x5c(0x04)
	int32_t MaxInternetClientRate; // 0x60(0x04)
	int32_t MaxClientRate; // 0x64(0x04)
	float ServerTravelPause; // 0x68(0x04)
	float SpawnPrioritySeconds; // 0x6c(0x04)
	float RelevantTimeout; // 0x70(0x04)
	float KeepAliveTime; // 0x74(0x04)
	float InitialConnectTimeout; // 0x78(0x04)
	float ConnectionTimeout; // 0x7c(0x04)
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x80(0x04)
	char bNoTimeouts; // 0x84(0x01)
	char bNeverApplyNetworkEmulationSettings; // 0x85(0x01)
	Unknown ServerConnection; // 0x88(0x08)
	Unknown ClientConnections; // 0x90(0x10)
	int32_t RecentlyDisconnectedTrackingTime; // 0x100(0x04)
	Unknown World; // 0x140(0x08)
	Unknown WorldPackage; // 0x148(0x08)
	Unknown NetConnectionClass; // 0x170(0x08)
	Unknown ReplicationDriverClass; // 0x178(0x08)
	struct FName NetDriverName; // 0x190(0x08)
	Unknown ChannelDefinitions; // 0x198(0x10)
	Unknown ChannelDefinitionMap; // 0x1a8(0x50)
	Unknown ActorChannelPool; // 0x1f8(0x10)
	float Time; // 0x210(0x04)
	Unknown ReplicationDriver; // 0x6e8(0x08)
	Unknown TinyFont; // 0x30(0x08)
	Unknown TinyFontName; // 0x38(0x18)
	Unknown SmallFont; // 0x50(0x08)
	Unknown SmallFontName; // 0x58(0x18)
	Unknown MediumFont; // 0x70(0x08)
	Unknown MediumFontName; // 0x78(0x18)
	Unknown LargeFont; // 0x90(0x08)
	Unknown LargeFontName; // 0x98(0x18)
	Unknown SubtitleFont; // 0xb0(0x08)
	Unknown SubtitleFontName; // 0xb8(0x18)
	Unknown AdditionalFonts; // 0xd0(0x10)
	Unknown AdditionalFontNames; // 0xe8(0x10)
	Unknown ConsoleClass; // 0xf8(0x08)
	Unknown ConsoleClassName; // 0x100(0x18)
	Unknown GameViewportClientClass; // 0x118(0x08)
	Unknown GameViewportClientClassName; // 0x120(0x18)
	Unknown LocalPlayerClass; // 0x138(0x08)
	Unknown LocalPlayerClassName; // 0x140(0x18)
	Unknown WorldSettingsClass; // 0x158(0x08)
	Unknown WorldSettingsClassName; // 0x160(0x18)
	Unknown NavigationSystemClassName; // 0x178(0x18)
	Unknown NavigationSystemClass; // 0x190(0x08)
	Unknown NavigationSystemConfigClassName; // 0x198(0x18)
	Unknown NavigationSystemConfigClass; // 0x1b0(0x08)
	Unknown AvoidanceManagerClassName; // 0x1b8(0x18)
	Unknown AvoidanceManagerClass; // 0x1d0(0x08)
	Unknown PhysicsCollisionHandlerClass; // 0x1d8(0x08)
	Unknown PhysicsCollisionHandlerClassName; // 0x1e0(0x18)
	Unknown GameUserSettingsClassName; // 0x1f8(0x18)
	Unknown GameUserSettingsClass; // 0x210(0x08)
	Unknown AIControllerClassName; // 0x218(0x18)
	Unknown GameUserSettings; // 0x230(0x08)
	Unknown LevelScriptActorClass; // 0x238(0x08)
	Unknown LevelScriptActorClassName; // 0x240(0x18)
	Unknown DefaultBlueprintBaseClassName; // 0x258(0x18)
	Unknown GameSingletonClassName; // 0x270(0x18)
	Unknown GameSingleton; // 0x288(0x08)
	Unknown AssetManagerClassName; // 0x290(0x18)
	Unknown AssetManager; // 0x2a8(0x08)
	Unknown DefaultTexture; // 0x2b0(0x08)
	Unknown DefaultTextureName; // 0x2b8(0x18)
	Unknown DefaultDiffuseTexture; // 0x2d0(0x08)
	Unknown DefaultDiffuseTextureName; // 0x2d8(0x18)
	Unknown DefaultBSPVertexTexture; // 0x2f0(0x08)
	Unknown DefaultBSPVertexTextureName; // 0x2f8(0x18)
	Unknown HighFrequencyNoiseTexture; // 0x310(0x08)
	Unknown HighFrequencyNoiseTextureName; // 0x318(0x18)
	Unknown DefaultBokehTexture; // 0x330(0x08)
	Unknown DefaultBokehTextureName; // 0x338(0x18)
	Unknown DefaultBloomKernelTexture; // 0x350(0x08)
	Unknown DefaultBloomKernelTextureName; // 0x358(0x18)
	Unknown WireframeMaterial; // 0x370(0x08)
	struct FString WireframeMaterialName; // 0x378(0x10)
	Unknown DebugMeshMaterial; // 0x388(0x08)
	Unknown DebugMeshMaterialName; // 0x390(0x18)
	Unknown EmissiveMeshMaterial; // 0x3a8(0x08)
	Unknown EmissiveMeshMaterialName; // 0x3b0(0x18)
	Unknown LevelColorationLitMaterial; // 0x3c8(0x08)
	struct FString LevelColorationLitMaterialName; // 0x3d0(0x10)
	Unknown LevelColorationUnlitMaterial; // 0x3e0(0x08)
	struct FString LevelColorationUnlitMaterialName; // 0x3e8(0x10)
	Unknown LightingTexelDensityMaterial; // 0x3f8(0x08)
	struct FString LightingTexelDensityName; // 0x400(0x10)
	Unknown ShadedLevelColorationLitMaterial; // 0x410(0x08)
	struct FString ShadedLevelColorationLitMaterialName; // 0x418(0x10)
	Unknown ShadedLevelColorationUnlitMaterial; // 0x428(0x08)
	struct FString ShadedLevelColorationUnlitMaterialName; // 0x430(0x10)
	Unknown RemoveSurfaceMaterial; // 0x440(0x08)
	Unknown RemoveSurfaceMaterialName; // 0x448(0x18)
	Unknown VertexColorMaterial; // 0x460(0x08)
	struct FString VertexColorMaterialName; // 0x468(0x10)
	Unknown VertexColorViewModeMaterial_ColorOnly; // 0x478(0x08)
	struct FString VertexColorViewModeMaterialName_ColorOnly; // 0x480(0x10)
	Unknown VertexColorViewModeMaterial_AlphaAsColor; // 0x490(0x08)
	struct FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x498(0x10)
	Unknown VertexColorViewModeMaterial_RedOnly; // 0x4a8(0x08)
	struct FString VertexColorViewModeMaterialName_RedOnly; // 0x4b0(0x10)
	Unknown VertexColorViewModeMaterial_GreenOnly; // 0x4c0(0x08)
	struct FString VertexColorViewModeMaterialName_GreenOnly; // 0x4c8(0x10)
	Unknown VertexColorViewModeMaterial_BlueOnly; // 0x4d8(0x08)
	struct FString VertexColorViewModeMaterialName_BlueOnly; // 0x4e0(0x10)
	Unknown DebugEditorMaterialName; // 0x4f0(0x18)
	Unknown ConstraintLimitMaterial; // 0x508(0x08)
	Unknown ConstraintLimitMaterialX; // 0x510(0x08)
	Unknown ConstraintLimitMaterialXAxis; // 0x518(0x08)
	Unknown ConstraintLimitMaterialY; // 0x520(0x08)
	Unknown ConstraintLimitMaterialYAxis; // 0x528(0x08)
	Unknown ConstraintLimitMaterialZ; // 0x530(0x08)
	Unknown ConstraintLimitMaterialZAxis; // 0x538(0x08)
	Unknown ConstraintLimitMaterialPrismatic; // 0x540(0x08)
	Unknown InvalidLightmapSettingsMaterial; // 0x548(0x08)
	Unknown InvalidLightmapSettingsMaterialName; // 0x550(0x18)
	Unknown PreviewShadowsIndicatorMaterial; // 0x568(0x08)
	Unknown PreviewShadowsIndicatorMaterialName; // 0x570(0x18)
	Unknown ArrowMaterial; // 0x588(0x08)
	Unknown ArrowMaterialYellow; // 0x590(0x08)
	Unknown ArrowMaterialName; // 0x598(0x18)
	Unknown LightingOnlyBrightness; // 0x5b0(0x10)
	Unknown ShaderComplexityColors; // 0x5c0(0x10)
	Unknown QuadComplexityColors; // 0x5d0(0x10)
	Unknown LightComplexityColors; // 0x5e0(0x10)
	Unknown StationaryLightOverlapColors; // 0x5f0(0x10)
	Unknown LODColorationColors; // 0x600(0x10)
	Unknown HLODColorationColors; // 0x610(0x10)
	Unknown StreamingAccuracyColors; // 0x620(0x10)
	float MaxPixelShaderAdditiveComplexityCount; // 0x630(0x04)
	float MaxES3PixelShaderAdditiveComplexityCount; // 0x634(0x04)
	float MinLightMapDensity; // 0x638(0x04)
	float IdealLightMapDensity; // 0x63c(0x04)
	float MaxLightMapDensity; // 0x640(0x04)
	char bRenderLightMapDensityGrayscale; // 0x644(0x01)
	float RenderLightMapDensityGrayscaleScale; // 0x648(0x04)
	float RenderLightMapDensityColorScale; // 0x64c(0x04)
	Unknown LightMapDensityVertexMappedColor; // 0x650(0x10)
	Unknown LightMapDensitySelectedColor; // 0x660(0x10)
	Unknown StatColorMappings; // 0x670(0x10)
	Unknown DefaultPhysMaterial; // 0x680(0x08)
	Unknown DefaultPhysMaterialName; // 0x688(0x18)
	Unknown ActiveGameNameRedirects; // 0x6a0(0x10)
	Unknown ActiveClassRedirects; // 0x6b0(0x10)
	Unknown ActivePluginRedirects; // 0x6c0(0x10)
	Unknown ActiveStructRedirects; // 0x6d0(0x10)
	Unknown PreIntegratedSkinBRDFTexture; // 0x6e0(0x08)
	Unknown PreIntegratedSkinBRDFTextureName; // 0x6e8(0x18)
	Unknown BlueNoiseTexture; // 0x700(0x08)
	Unknown BlueNoiseTextureName; // 0x708(0x18)
	Unknown MiniFontTexture; // 0x720(0x08)
	Unknown MiniFontTextureName; // 0x728(0x18)
	Unknown WeightMapPlaceholderTexture; // 0x740(0x08)
	Unknown WeightMapPlaceholderTextureName; // 0x748(0x18)
	Unknown LightMapDensityTexture; // 0x760(0x08)
	Unknown LightMapDensityTextureName; // 0x768(0x18)
	Unknown GameViewport; // 0x788(0x08)
	Unknown DeferredCommands; // 0x790(0x10)
	int32_t TickCycles; // 0x7a0(0x04)
	int32_t GameCycles; // 0x7a4(0x04)
	int32_t ClientCycles; // 0x7a8(0x04)
	float NearClipPlane; // 0x7ac(0x04)
	float EditorNearClipPlane; // 0x7b0(0x04)
	char bUseCustomAudioModule; // 0x7b4(0x01)
	char bHardwareSurveyEnabled; // 0x7b8(0x01)
	char bSubtitlesEnabled; // 0x7b8(0x01)
	char bSubtitlesForcedOff; // 0x7b8(0x01)
	int32_t MaximumLoopIterationCount; // 0x7bc(0x04)
	char bCanBlueprintsTickByDefault; // 0x7c0(0x01)
	char bOptimizeAnimBlueprintMemberVariableAccess; // 0x7c0(0x01)
	char bAllowMultiThreadedAnimationUpdate; // 0x7c0(0x01)
	char bEnableEditorPSysRealtimeLOD; // 0x7c0(0x01)
	char bSmoothFrameRate; // 0x7c0(0x01)
	char bUseFixedFrameRate; // 0x7c0(0x01)
	float FixedFrameRate; // 0x7c4(0x04)
	Unknown SmoothedFrameRateRange; // 0x7c8(0x10)
	Unknown CustomTimeStep; // 0x7d8(0x08)
	Unknown CustomTimeStepClassName; // 0x800(0x18)
	Unknown TimecodeProvider; // 0x818(0x08)
	Unknown TimecodeProviderClassName; // 0x840(0x18)
	char bGenerateDefaultTimecode; // 0x858(0x01)
	Unknown GenerateDefaultTimecodeFrameRate; // 0x85c(0x08)
	float GenerateDefaultTimecodeFrameDelay; // 0x864(0x04)
	char bCheckForMultiplePawnsSpawnedInAFrame; // 0x868(0x01)
	int32_t NumPawnsAllowedToBeSpawnedInAFrame; // 0x86c(0x04)
	char bShouldGenerateLowQualityLightmaps; // 0x870(0x01)
	Unknown C_WorldBox; // 0x874(0x04)
	Unknown C_BrushWire; // 0x878(0x04)
	Unknown C_AddWire; // 0x87c(0x04)
	Unknown C_SubtractWire; // 0x880(0x04)
	Unknown C_SemiSolidWire; // 0x884(0x04)
	Unknown C_NonSolidWire; // 0x888(0x04)
	Unknown C_WireBackground; // 0x88c(0x04)
	Unknown C_ScaleBoxHi; // 0x890(0x04)
	Unknown C_VolumeCollision; // 0x894(0x04)
	Unknown C_BSPCollision; // 0x898(0x04)
	Unknown C_OrthoBackground; // 0x89c(0x04)
	Unknown C_Volume; // 0x8a0(0x04)
	Unknown C_BrushShape; // 0x8a4(0x04)
	float StreamingDistanceFactor; // 0x8a8(0x04)
	Unknown GameScreenshotSaveDirectory; // 0x8b0(0x10)
	Unknown TransitionType; // 0x8c0(0x01)
	struct FString TransitionDescription; // 0x8c8(0x10)
	struct FString TransitionGameMode; // 0x8d8(0x10)
	float MeshLODRange; // 0x8e8(0x04)
	char bAllowMatureLanguage; // 0x8ec(0x01)
	float CameraRotationThreshold; // 0x8f0(0x04)
	float CameraTranslationThreshold; // 0x8f4(0x04)
	float PrimitiveProbablyVisibleTime; // 0x8f8(0x04)
	float MaxOcclusionPixelsFraction; // 0x8fc(0x04)
	char bPauseOnLossOfFocus; // 0x900(0x01)
	int32_t MaxParticleResize; // 0x904(0x04)
	int32_t MaxParticleResizeWarn; // 0x908(0x04)
	Unknown PendingDroppedNotes; // 0x910(0x10)
	float NetClientTicksPerSecond; // 0x920(0x04)
	float DisplayGamma; // 0x924(0x04)
	float MinDesiredFrameRate; // 0x928(0x04)
	Unknown DefaultSelectedMaterialColor; // 0x92c(0x10)
	Unknown SelectedMaterialColor; // 0x93c(0x10)
	Unknown SelectionOutlineColor; // 0x94c(0x10)
	Unknown SubduedSelectionOutlineColor; // 0x95c(0x10)
	Unknown SelectedMaterialColorOverride; // 0x96c(0x10)
	char bIsOverridingSelectedColor; // 0x97c(0x01)
	char bEnableOnScreenDebugMessages; // 0x980(0x01)
	char bEnableOnScreenDebugMessagesDisplay; // 0x980(0x01)
	char bSuppressMapWarnings; // 0x980(0x01)
	char bDisableAILogging; // 0x980(0x01)
	uint32_t bEnableVisualLogRecordingOnStart; // 0x984(0x04)
	int32_t ScreenSaverInhibitorSemaphore; // 0x98c(0x04)
	char bLockReadOnlyLevels; // 0x990(0x01)
	struct FString ParticleEventManagerClassPath; // 0x998(0x10)
	float SelectionHighlightIntensity; // 0x9a8(0x04)
	float BSPSelectionHighlightIntensity; // 0x9ac(0x04)
	float SelectionHighlightIntensityBillboards; // 0x9b0(0x04)
	Unknown NetDriverDefinitions; // 0xc00(0x10)
	Unknown ServerActors; // 0xc10(0x10)
	Unknown RuntimeServerActors; // 0xc20(0x10)
	float NetErrorLogInterval; // 0xc30(0x04)
	char bStartedLoadMapMovie; // 0xc34(0x01)
	int32_t NextWorldContextHandle; // 0xc50(0x04)
	Unknown ViewportClient; // 0x70(0x08)
	Unknown AspectRatioAxisConstraint; // 0x94(0x01)
	Unknown PendingLevelPlayerControllerClass; // 0x98(0x08)
	char bSentSplitJoin; // 0xa0(0x01)
	int32_t ControllerId; // 0xb8(0x04)
	Unknown AnimBlueprintGeneratedClass; // 0x700(0x08)
	Unknown AnimClass; // 0x708(0x08)
	Unknown AnimScriptInstance; // 0x710(0x08)
	Unknown PostprocessAnimInstance; // 0x718(0x08)
	Unknown AnimationData; // 0x720(0x18)
	Unknown RootBoneTranslation; // 0x748(0x0c)
	Unknown LineCheckBoundsScale; // 0x754(0x0c)
	Unknown LinkedInstances; // 0x780(0x10)
	Unknown CachedBoneSpaceTransforms; // 0x790(0x10)
	Unknown CachedComponentSpaceTransforms; // 0x7a0(0x10)
	float GlobalAnimRateScale; // 0x7d0(0x04)
	Unknown KinematicBonesUpdateType; // 0x7d4(0x01)
	Unknown PhysicsTransformUpdateMode; // 0x7d5(0x01)
	Unknown AnimationMode; // 0x7dd(0x01)
	char bDisablePostProcessBlueprint; // 0x7df(0x01)
	char bUpdateOverlapsOnAnimationFinalize; // 0x7df(0x01)
	char bHasValidBodies; // 0x7df(0x01)
	char bBlendPhysics; // 0x7df(0x01)
	char bEnablePhysicsOnDedicatedServer; // 0x7df(0x01)
	char bUpdateJointsFromAnimation; // 0x7e0(0x01)
	char bDisableClothSimulation; // 0x7e0(0x01)
	char bDisableRigidBodyAnimNode; // 0x7e0(0x01)
	char bAllowAnimCurveEvaluation; // 0x7e0(0x01)
	char bDisableAnimCurves; // 0x7e0(0x01)
	char bCollideWithEnvironment; // 0x7e1(0x01)
	char bCollideWithAttachedChildren; // 0x7e1(0x01)
	char bLocalSpaceSimulation; // 0x7e1(0x01)
	char bResetAfterTeleport; // 0x7e1(0x01)
	char bDeferKinematicBoneUpdate; // 0x7e1(0x01)
	char bNoSkeletonUpdate; // 0x7e1(0x01)
	char bPauseAnims; // 0x7e1(0x01)
	char bUseRefPoseOnInitAnim; // 0x7e2(0x01)
	char bEnablePerPolyCollision; // 0x7e2(0x01)
	char bForceRefpose; // 0x7e2(0x01)
	char bOnlyAllowAutonomousTickPose; // 0x7e2(0x01)
	char bIsAutonomousTickPose; // 0x7e2(0x01)
	char bOldForceRefPose; // 0x7e2(0x01)
	char bShowPrePhysBones; // 0x7e2(0x01)
	char bRequiredBonesUpToDate; // 0x7e2(0x01)
	char bAnimTreeInitialised; // 0x7e3(0x01)
	char bIncludeComponentLocationIntoBounds; // 0x7e3(0x01)
	char bEnableLineCheckWithBounds; // 0x7e3(0x01)
	char bUseBendingElements; // 0x7e3(0x01)
	char bUseTetrahedralConstraints; // 0x7e3(0x01)
	char bUseThinShellVolumeConstraints; // 0x7e3(0x01)
	char bUseSelfCollisions; // 0x7e3(0x01)
	char bUseContinuousCollisionDetection; // 0x7e3(0x01)
	char bPropagateCurvesToSlaves; // 0x7e4(0x01)
	char bSkipKinematicUpdateWhenInterpolating; // 0x7e4(0x01)
	char bSkipBoundsUpdateWhenInterpolating; // 0x7e4(0x01)
	char bNeedsQueuedAnimEventsDispatched; // 0x7e4(0x01)
	uint16_t CachedAnimCurveUidVersion; // 0x7e6(0x02)
	Unknown MassMode; // 0x7e8(0x01)
	float UniformMass; // 0x7ec(0x04)
	float TotalMass; // 0x7f0(0x04)
	float Density; // 0x7f4(0x04)
	float MinPerParticleMass; // 0x7f8(0x04)
	float ClothBlendWeight; // 0x7fc(0x04)
	float EdgeStiffness; // 0x800(0x04)
	float BendingStiffness; // 0x804(0x04)
	float AreaStiffness; // 0x808(0x04)
	float VolumeStiffness; // 0x80c(0x04)
	float StrainLimitingStiffness; // 0x810(0x04)
	float ShapeTargetStiffness; // 0x814(0x04)
	Unknown DisallowedAnimCurves; // 0x818(0x10)
	Unknown BodySetup; // 0x828(0x08)
	struct FMulticastInlineDelegate OnConstraintBroken; // 0x838(0x10)
	Unknown ClothingSimulationFactory; // 0x848(0x08)
	float TeleportDistanceThreshold; // 0x918(0x04)
	float TeleportRotationThreshold; // 0x91c(0x04)
	uint32_t LastPoseTickFrame; // 0x928(0x04)
	Unknown ClothingInteractor; // 0x980(0x08)
	struct FMulticastInlineDelegate OnAnimInitialized; // 0xa50(0x10)
	Unknown CurrentSkeleton; // 0x28(0x08)
	Unknown RootMotionMode; // 0x30(0x01)
	char bUseMultiThreadedAnimationUpdate; // 0x31(0x01)
	char bUsingCopyPoseFromMesh; // 0x31(0x01)
	char bReceiveNotifiesFromLinkedInstances; // 0x31(0x01)
	char bPropagateNotifiesToLinkedInstances; // 0x31(0x01)
	char bQueueMontageEvents; // 0x31(0x01)
	struct FMulticastInlineDelegate OnMontageBlendingOut; // 0x38(0x10)
	struct FMulticastInlineDelegate OnMontageStarted; // 0x48(0x10)
	struct FMulticastInlineDelegate OnMontageEnded; // 0x58(0x10)
	struct FMulticastInlineDelegate OnAllMontageInstancesEnded; // 0x68(0x10)
	Unknown NotifyQueue; // 0x100(0x70)
	Unknown ActiveAnimNotifyState; // 0x170(0x10)
	Unknown SupportedClass; // 0x28(0x08)
	Unknown ExportRootScope; // 0x30(0x08)
	Unknown FormatExtension; // 0x38(0x10)
	Unknown FormatDescription; // 0x48(0x10)
	int32_t PreferredFormatIndex; // 0x58(0x04)
	int32_t TextIndent; // 0x5c(0x04)
	char bText; // 0x60(0x01)
	char bSelectedOnly; // 0x60(0x01)
	char bForceFileOperations; // 0x60(0x01)
	Unknown ExportTask; // 0x68(0x08)
	char bInputEnabled; // 0x310(0x01)
	uint32_t MaxPoolSize; // 0x28(0x04)
	Unknown BrushType; // 0x310(0x01)
	Unknown BrushColor; // 0x314(0x04)
	int32_t PolyFlags; // 0x318(0x04)
	char bColored; // 0x31c(0x01)
	char bSolidWhenSelected; // 0x31c(0x01)
	char bPlaceableFromClassBrowser; // 0x31c(0x01)
	char bNotForClientOrServer; // 0x31c(0x01)
	Unknown Brush; // 0x320(0x08)
	Unknown BrushComponent; // 0x328(0x08)
	char bInManipulation; // 0x330(0x01)
	Unknown SavedSelections; // 0x338(0x10)
	Unknown SelfWorld; // 0x38(0x08)
	Unknown PersistentLevel; // 0x48(0x08)
	Unknown NetDriver; // 0x50(0x08)
	Unknown LineBatcher; // 0x58(0x08)
	Unknown PersistentLineBatcher; // 0x60(0x08)
	Unknown ForegroundLineBatcher; // 0x68(0x08)
	Unknown NetworkManager; // 0x70(0x08)
	Unknown PhysicsCollisionHandler; // 0x78(0x08)
	Unknown ExtraReferencedObjects; // 0x80(0x10)
	Unknown PerModuleDataObjects; // 0x90(0x10)
	Unknown LevelSequenceActors; // 0xa0(0x10)
	Unknown StreamingLevels; // 0xb0(0x10)
	Unknown StreamingLevelsToConsider; // 0xc0(0x48)
	struct FString StreamingLevelsPrefix; // 0x120(0x10)
	Unknown CurrentLevelPendingVisibility; // 0x130(0x08)
	Unknown CurrentLevelPendingInvisibility; // 0x138(0x08)
	Unknown DemoNetDriver; // 0x140(0x08)
	Unknown MyParticleEventManager; // 0x148(0x08)
	Unknown DefaultPhysicsVolume; // 0x150(0x08)
	char bAreConstraintsDirty; // 0x16e(0x01)
	Unknown NavigationSystem; // 0x170(0x08)
	Unknown AuthorityGameMode; // 0x178(0x08)
	Unknown GameState; // 0x180(0x08)
	Unknown AISystem; // 0x188(0x08)
	Unknown AvoidanceManager; // 0x190(0x08)
	Unknown Levels; // 0x198(0x10)
	Unknown LevelCollections; // 0x1a8(0x10)
	Unknown OwningGameInstance; // 0x1d8(0x08)
	Unknown ParameterCollectionInstances; // 0x1e0(0x10)
	Unknown CanvasForRenderingToTarget; // 0x1f0(0x08)
	Unknown CanvasForDrawMaterialToRenderTarget; // 0x1f8(0x08)
	Unknown ComponentsThatNeedEndOfFrameUpdate; // 0x250(0x10)
	Unknown ComponentsThatNeedEndOfFrameUpdate_OnGameThread; // 0x260(0x10)
	Unknown WorldComposition; // 0x5b0(0x08)
	Unknown PSCPool; // 0x650(0x58)
	Unknown SubTracks; // 0x38(0x10)
	Unknown TrackInstClass; // 0x48(0x08)
	Unknown ActiveCondition; // 0x50(0x01)
	struct FString TrackTitle; // 0x58(0x10)
	char bOnePerGroup; // 0x68(0x01)
	char bDirGroupOnly; // 0x68(0x01)
	char bDisableTrack; // 0x68(0x01)
	char bIsSelected; // 0x68(0x01)
	char bIsAnimControlTrack; // 0x68(0x01)
	char bSubTrackOnly; // 0x68(0x01)
	char bVisible; // 0x68(0x01)
	char bIsRecording; // 0x68(0x01)
	Unknown VectorTrack; // 0x70(0x18)
	float CurveTension; // 0x88(0x04)
	Unknown FloatTrack; // 0x70(0x18)
	float CurveTension; // 0x88(0x04)
	Unknown NativeClass; // 0x28(0x08)
	Unknown Material; // 0x28(0x08)
	Unknown Function; // 0x30(0x08)
	char bIsParameterExpression; // 0x38(0x01)
	Unknown Texture; // 0x40(0x08)
	Unknown SamplerType; // 0x48(0x01)
	char IsDefaultMeshpaintTexture; // 0x49(0x01)
	Unknown Coordinates; // 0x50(0x0c)
	Unknown TextureObject; // 0x64(0x0c)
	Unknown MipValue; // 0x78(0x0c)
	Unknown CoordinatesDX; // 0x8c(0x0c)
	Unknown CoordinatesDY; // 0xa0(0x0c)
	Unknown AutomaticViewMipBiasValue; // 0xb4(0x0c)
	Unknown MipValueMode; // 0xc8(0x01)
	Unknown SamplerSource; // 0xc9(0x01)
	char AutomaticViewMipBias; // 0xca(0x01)
	Unknown ConstCoordinate; // 0xcb(0x01)
	int32_t ConstMipValue; // 0xcc(0x04)
	struct FName ParameterName; // 0xd0(0x08)
	Unknown ExpressionGUID; // 0xd8(0x10)
	struct FName Group; // 0xe8(0x08)
	Unknown SelfPawn; // 0x318(0x08)
	char bUseControllerRotationPitch; // 0x328(0x01)
	char bUseControllerRotationYaw; // 0x328(0x01)
	char bUseControllerRotationRoll; // 0x328(0x01)
	char bCanAffectNavigationGeneration; // 0x328(0x01)
	float BaseEyeHeight; // 0x32c(0x04)
	Unknown AutoPossessPlayer; // 0x330(0x01)
	Unknown AutoPossessAI; // 0x331(0x01)
	uint16_t RemoteViewPitch; // 0x332(0x02)
	uint16_t RemoteViewYaw; // 0x334(0x02)
	Unknown AIControllerClass; // 0x338(0x08)
	Unknown PlayerState; // 0x340(0x08)
	Unknown LastHitBy; // 0x350(0x08)
	Unknown Controller; // 0x358(0x08)
	Unknown ControlInputVector; // 0x364(0x0c)
	Unknown LastControlInputVector; // 0x370(0x0c)
	Unknown SelfCharacter; // 0x388(0x08)
	Unknown Mesh; // 0x398(0x08)
	Unknown CharacterMovement; // 0x3a0(0x08)
	Unknown CapsuleComponent; // 0x3a8(0x08)
	Unknown BasedMovement; // 0x3b8(0x30)
	Unknown ReplicatedBasedMovement; // 0x3e8(0x30)
	float AnimRootMotionTranslationScale; // 0x418(0x04)
	Unknown BaseTranslationOffset; // 0x41c(0x0c)
	Unknown BaseRotationOffset; // 0x430(0x10)
	float ReplicatedServerLastTransformUpdateTimeStamp; // 0x440(0x04)
	float ReplayLastTransformUpdateTimeStamp; // 0x444(0x04)
	Unknown ReplicatedMovementMode; // 0x448(0x01)
	char bInBaseReplication; // 0x449(0x01)
	float CrouchedEyeHeight; // 0x44c(0x04)
	char bIsCrouched; // 0x450(0x01)
	char bProxyIsJumpForceApplied; // 0x450(0x01)
	char bPressedJump; // 0x450(0x01)
	char bClientUpdating; // 0x450(0x01)
	char bClientWasFalling; // 0x450(0x01)
	char bClientResimulateRootMotion; // 0x450(0x01)
	char bClientResimulateRootMotionSources; // 0x450(0x01)
	char bSimGravityDisabled; // 0x450(0x01)
	char bClientCheckEncroachmentOnNetUpdate; // 0x451(0x01)
	char bServerMoveIgnoreRootMotion; // 0x451(0x01)
	char bWasJumping; // 0x451(0x01)
	float JumpKeyHoldTime; // 0x454(0x04)
	float JumpForceTimeRemaining; // 0x458(0x04)
	float ProxyJumpForceStartedTime; // 0x45c(0x04)
	float JumpMaxHoldTime; // 0x460(0x04)
	int32_t JumpMaxCount; // 0x464(0x04)
	int32_t JumpCurrentCount; // 0x468(0x04)
	struct FMulticastInlineDelegate OnReachedJumpApex; // 0x470(0x10)
	struct FMulticastInlineDelegate MovementModeChangedDelegate; // 0x490(0x10)
	struct FMulticastInlineDelegate OnCharacterMovementUpdated; // 0x4a0(0x10)
	Unknown SavedRootMotion; // 0x4b0(0x38)
	Unknown ClientRootMotionParams; // 0x4f0(0x40)
	Unknown RootMotionRepMoves; // 0x530(0x10)
	Unknown RepRootMotion; // 0x540(0x98)
	Unknown SplineCurves; // 0x4b8(0x68)
	Unknown SplineInfo; // 0x520(0x18)
	Unknown SplineRotInfo; // 0x538(0x18)
	Unknown SplineScaleInfo; // 0x550(0x18)
	Unknown SplineReparamTable; // 0x568(0x18)
	char bAllowSplineEditingPerInstance; // 0x580(0x01)
	int32_t ReparamStepsPerSegment; // 0x584(0x04)
	float Duration; // 0x588(0x04)
	char bStationaryEndpoints; // 0x58c(0x01)
	char bSplineHasBeenEdited; // 0x58d(0x01)
	char bModifiedByConstructionScript; // 0x58e(0x01)
	char bInputSplinePointsToConstructionScript; // 0x58f(0x01)
	char bDrawDebug; // 0x590(0x01)
	char bClosedLoop; // 0x591(0x01)
	char bLoopPositionOverride; // 0x592(0x01)
	float LoopPosition; // 0x594(0x04)
	Unknown DefaultUpVector; // 0x598(0x0c)
	struct FString HelpDescription; // 0x28(0x10)
	struct FString HelpUsage; // 0x38(0x10)
	struct FString HelpWebLink; // 0x48(0x10)
	Unknown HelpParamNames; // 0x58(0x10)
	Unknown HelpParamDescriptions; // 0x68(0x10)
	char IsServer; // 0x78(0x01)
	char IsClient; // 0x78(0x01)
	char IsEditor; // 0x78(0x01)
	char LogToConsole; // 0x78(0x01)
	char ShowErrorCount; // 0x78(0x01)
	char ShowProgress; // 0x78(0x01)
	Unknown Sound; // 0x238(0x08)
	Unknown InstanceParameters; // 0x240(0x10)
	Unknown SoundClassOverride; // 0x250(0x08)
	char bAutoDestroy; // 0x258(0x01)
	char bStopWhenOwnerDestroyed; // 0x258(0x01)
	char bShouldRemainActiveIfDropped; // 0x258(0x01)
	char bAllowSpatialization; // 0x258(0x01)
	char bOverrideAttenuation; // 0x258(0x01)
	char bOverrideSubtitlePriority; // 0x258(0x01)
	char bIsUISound; // 0x258(0x01)
	char bEnableLowPassFilter; // 0x258(0x01)
	char bOverridePriority; // 0x259(0x01)
	char bSuppressSubtitles; // 0x259(0x01)
	char bAutoManageAttachment; // 0x25a(0x01)
	struct FName AudioComponentUserID; // 0x260(0x08)
	float PitchModulationMin; // 0x268(0x04)
	float PitchModulationMax; // 0x26c(0x04)
	float VolumeModulationMin; // 0x270(0x04)
	float VolumeModulationMax; // 0x274(0x04)
	float VolumeMultiplier; // 0x278(0x04)
	int32_t EnvelopeFollowerAttackTime; // 0x27c(0x04)
	int32_t EnvelopeFollowerReleaseTime; // 0x280(0x04)
	float Priority; // 0x284(0x04)
	float SubtitlePriority; // 0x288(0x04)
	Unknown SourceEffectChain; // 0x290(0x08)
	float PitchMultiplier; // 0x298(0x04)
	float LowPassFilterFrequency; // 0x29c(0x04)
	Unknown AttenuationSettings; // 0x2a8(0x08)
	Unknown AttenuationOverrides; // 0x2b0(0x3a0)
	Unknown ConcurrencySettings; // 0x650(0x08)
	Unknown ConcurrencySet; // 0x658(0x50)
	Unknown AutoAttachLocationRule; // 0x6b4(0x01)
	Unknown AutoAttachRotationRule; // 0x6b5(0x01)
	Unknown AutoAttachScaleRule; // 0x6b6(0x01)
	struct FMulticastInlineDelegate OnAudioFinished; // 0x6b8(0x10)
	struct FMulticastInlineDelegate OnAudioPlaybackPercent; // 0x6e0(0x10)
	struct FMulticastInlineDelegate OnAudioSingleEnvelopeValue; // 0x708(0x10)
	struct FMulticastInlineDelegate OnAudioMultiEnvelopeValue; // 0x730(0x10)
	Unknown Modulation; // 0x758(0x10)
	struct FDelegate OnQueueSubtitles; // 0x768(0x10)
	Unknown AutoAttachParent; // 0x778(0x08)
	struct FName AutoAttachSocketName; // 0x780(0x08)

	void ExecuteUbergraph(int32_t EntryPoint); // ExecuteUbergraph CoreUObject.Object.ExecuteUbergraph // (Event|Public|BlueprintEvent) // <Game+0x23ad490>
	void ReceiveBeginPlay(); // ReceiveBeginPlay BP-SkillTargetingBombing.BP-SkillTargetingBombing_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // <Game+0x23ad490>
	void SliceProceduralMesh(Unknown InProcMesh, Unknown PlanePosition, Unknown PlaneNormal, char bCreateOtherHalf, Unknown& OutOtherHalfProcMesh, Unknown CapOption, Unknown CapMaterial); // SliceProceduralMesh ProceduralMeshComponent.KismetProceduralMeshLibrary.SliceProceduralMesh // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // <Game+0x178e790>
