// WidgetBlueprintGeneratedClass AudioWidget.AudioWidget_C
struct UAudioWidget_C : UBravoHotelSettingSubWidget {
	Unknown UberGraphFrame; //  0x298 Size(8)
	Unknown Effect; //  0x2a0 Size(8)
	Unknown Master; //  0x2a8 Size(8)
	Unknown MasterOnOff; //  0x2b0 Size(8)
	Unknown Music; //  0x2b8 Size(8)
	Unknown ScrollBox_55; //  0x2c0 Size(8)
	Unknown UI; //  0x2c8 Size(8)
	Unknown VoiceChanel; //  0x2d0 Size(8)
	Unknown VoiceInput; //  0x2d8 Size(8)
	Unknown VoiceInputMode; //  0x2e0 Size(8)
	Unknown VoiceOutput; //  0x2e8 Size(8)
	Unknown ; //  0x2f0 Size(8)
	Unknown ; //  0x2f8 Size(8)
	Unknown ScrollBarTimer; //  0x300 Size(8)

	void Construct(); // Function AudioWidget.AudioWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

