// WidgetBlueprintGeneratedClass AudioWidget.AudioWidget_C
class UAudioWidget_C : UBravoHotelSettingSubWidget {
	struct Unknown UberGraphFrame; // 0x298 (8)
	struct Unknown Effect; // 0x2A0 (8)
	struct Unknown Master; // 0x2A8 (8)
	struct Unknown MasterOnOff; // 0x2B0 (8)
	struct Unknown Music; // 0x2B8 (8)
	struct Unknown ScrollBox_55; // 0x2C0 (8)
	struct Unknown UI; // 0x2C8 (8)
	struct Unknown VoiceChanel; // 0x2D0 (8)
	struct Unknown VoiceInput; // 0x2D8 (8)
	struct Unknown VoiceInputMode; // 0x2E0 (8)
	struct Unknown VoiceOutput; // 0x2E8 (8)
	struct Unknown m; // 0x2F0 (8)
	struct Unknown m; // 0x2F8 (8)
	struct Unknown ScrollBarTimer; // 0x300 (8)

	void Construct(); // Function AudioWidget.AudioWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void m_1(struct Unknown Value); // Function AudioWidget.AudioWidget_C.m_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__ScrollBox_54_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature(float CurrentOffset); // Function AudioWidget.AudioWidget_C.BndEvt__ScrollBox_54_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void CustomEvent(); // Function AudioWidget.AudioWidget_C.CustomEvent(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ExecuteUbergraph_AudioWidget(int32_t EntryPoint); // Function AudioWidget.AudioWidget_C.ExecuteUbergraph_AudioWidget(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

