// Enum AugmentedReality.EARTrackingState
enum class EARTrackingState : uint8 {
	EARTrackingState = 0
	EARTrackingState = 1
	EARTrackingState = 2
	EARTrackingState = 3
	EARTrackingState = 4
};

// Enum AugmentedReality.EARSessionTrackingFeature
enum class EARSessionTrackingFeature : uint8 {
	EARSessionTrackingFeature = 0
	EARSessionTrackingFeature = 1
	EARSessionTrackingFeature = 2
	EARSessionTrackingFeature = 3
	EARSessionTrackingFeature = 4
};

// Enum AugmentedReality.EARFaceTrackingUpdate
enum class EARFaceTrackingUpdate : uint8 {
	EARFaceTrackingUpdate = 0
	EARFaceTrackingUpdate = 1
	EARFaceTrackingUpdate = 2
};

// Enum AugmentedReality.EAREnvironmentCaptureProbeType
enum class EAREnvironmentCaptureProbeType : uint8 {
	EAREnvironmentCaptureProbeType = 0
	EAREnvironmentCaptureProbeType = 1
	EAREnvironmentCaptureProbeType = 2
	EAREnvironmentCaptureProbeType = 3
};

// Enum AugmentedReality.EARFrameSyncMode
enum class EARFrameSyncMode : uint8 {
	EARFrameSyncMode = 0
	EARFrameSyncMode = 1
	EARFrameSyncMode = 2
};

// Enum AugmentedReality.EARLightEstimationMode
enum class EARLightEstimationMode : uint8 {
	EARLightEstimationMode = 0
	EARLightEstimationMode = 1
	EARLightEstimationMode = 2
	EARLightEstimationMode = 3
};

// Enum AugmentedReality.EARPlaneDetectionMode
enum class EARPlaneDetectionMode : uint8 {
	EARPlaneDetectionMode = 0
	EARPlaneDetectionMode = 1
	EARPlaneDetectionMode = 2
	EARPlaneDetectionMode = 3
};

// Enum AugmentedReality.EARSessionType
enum class EARSessionType : uint8 {
	EARSessionType = 0
	EARSessionType = 1
	EARSessionType = 2
	EARSessionType = 3
	EARSessionType = 4
	EARSessionType = 5
	EARSessionType = 6
	EARSessionType = 7
};

// Enum AugmentedReality.EARWorldAlignment
enum class EARWorldAlignment : uint8 {
	EARWorldAlignment = 0
	EARWorldAlignment = 1
	EARWorldAlignment = 2
	EARWorldAlignment = 3
};

// Enum AugmentedReality.EARDepthAccuracy
enum class EARDepthAccuracy : uint8 {
	EARDepthAccuracy = 0
	EARDepthAccuracy = 1
	EARDepthAccuracy = 2
	EARDepthAccuracy = 3
};

// Enum AugmentedReality.EARDepthQuality
enum class EARDepthQuality : uint8 {
	EARDepthQuality = 0
	EARDepthQuality = 1
	EARDepthQuality = 2
	EARDepthQuality = 3
};

// Enum AugmentedReality.EARTextureType
enum class EARTextureType : uint8 {
	EARTextureType = 0
	EARTextureType = 1
	EARTextureType = 2
	EARTextureType = 3
};

// Enum AugmentedReality.EAREye
enum class EAREye : uint8 {
	EAREye = 0
	EAREye = 1
	EAREye = 2
};

// Enum AugmentedReality.EARFaceBlendShape
enum class EARFaceBlendShape : uint8 {
	EARFaceBlendShape = 0
	EARFaceBlendShape = 1
	EARFaceBlendShape = 2
	EARFaceBlendShape = 3
	EARFaceBlendShape = 4
	EARFaceBlendShape = 5
	EARFaceBlendShape = 6
	EARFaceBlendShape = 7
	EARFaceBlendShape = 8
	EARFaceBlendShape = 9
	EARFaceBlendShape = 10
	EARFaceBlendShape = 11
	EARFaceBlendShape = 12
	EARFaceBlendShape = 13
	EARFaceBlendShape = 14
	EARFaceBlendShape = 15
	EARFaceBlendShape = 16
	EARFaceBlendShape = 17
	EARFaceBlendShape = 18
	EARFaceBlendShape = 19
	EARFaceBlendShape = 20
	EARFaceBlendShape = 21
	EARFaceBlendShape = 22
	EARFaceBlendShape = 23
	EARFaceBlendShape = 24
	EARFaceBlendShape = 25
	EARFaceBlendShape = 26
	EARFaceBlendShape = 27
	EARFaceBlendShape = 28
	EARFaceBlendShape = 29
	EARFaceBlendShape = 30
	EARFaceBlendShape = 31
	EARFaceBlendShape = 32
	EARFaceBlendShape = 33
	EARFaceBlendShape = 34
	EARFaceBlendShape = 35
	EARFaceBlendShape = 36
	EARFaceBlendShape = 37
	EARFaceBlendShape = 38
	EARFaceBlendShape = 39
	EARFaceBlendShape = 40
	EARFaceBlendShape = 41
	EARFaceBlendShape = 42
	EARFaceBlendShape = 43
	EARFaceBlendShape = 44
	EARFaceBlendShape = 45
	EARFaceBlendShape = 46
	EARFaceBlendShape = 47
	EARFaceBlendShape = 48
	EARFaceBlendShape = 49
	EARFaceBlendShape = 50
	EARFaceBlendShape = 51
	EARFaceBlendShape = 52
	EARFaceBlendShape = 53
	EARFaceBlendShape = 54
	EARFaceBlendShape = 55
	EARFaceBlendShape = 56
	EARFaceBlendShape = 57
	EARFaceBlendShape = 58
	EARFaceBlendShape = 59
	EARFaceBlendShape = 60
	EARFaceBlendShape = 61
};

// Enum AugmentedReality.EARFaceTrackingDirection
enum class EARFaceTrackingDirection : uint8 {
	EARFaceTrackingDirection = 0
	EARFaceTrackingDirection = 1
	EARFaceTrackingDirection = 2
};

// Enum AugmentedReality.EARCandidateImageOrientation
enum class EARCandidateImageOrientation : uint8 {
	EARCandidateImageOrientation = 0
	EARCandidateImageOrientation = 1
	EARCandidateImageOrientation = 2
};

// Enum AugmentedReality.EARJointTransformSpace
enum class EARJointTransformSpace : uint8 {
	EARJointTransformSpace = 0
	EARJointTransformSpace = 1
	EARJointTransformSpace = 2
};

// Enum AugmentedReality.EARObjectClassification
enum class EARObjectClassification : uint8 {
	EARObjectClassification = 0
	EARObjectClassification = 1
	EARObjectClassification = 2
	EARObjectClassification = 3
	EARObjectClassification = 4
	EARObjectClassification = 5
	EARObjectClassification = 6
	EARObjectClassification = 7
	EARObjectClassification = 8
	EARObjectClassification = 9
	EARObjectClassification = 10
	EARObjectClassification = 11
	EARObjectClassification = 12
};

// Enum AugmentedReality.EARPlaneOrientation
enum class EARPlaneOrientation : uint8 {
	EARPlaneOrientation = 0
	EARPlaneOrientation = 1
	EARPlaneOrientation = 2
	EARPlaneOrientation = 3
};

// Enum AugmentedReality.EARWorldMappingState
enum class EARWorldMappingState : uint8 {
	EARWorldMappingState = 0
	EARWorldMappingState = 1
	EARWorldMappingState = 2
	EARWorldMappingState = 3
	EARWorldMappingState = 4
};

// Enum AugmentedReality.EARSessionStatus
enum class EARSessionStatus : uint8 {
	EARSessionStatus = 0
	EARSessionStatus = 1
	EARSessionStatus = 2
	EARSessionStatus = 3
	EARSessionStatus = 4
	EARSessionStatus = 5
	EARSessionStatus = 6
	EARSessionStatus = 7
};

// Enum AugmentedReality.EARTrackingQualityReason
enum class EARTrackingQualityReason : uint8 {
	EARTrackingQualityReason = 0
	EARTrackingQualityReason = 1
	EARTrackingQualityReason = 2
	EARTrackingQualityReason = 3
	EARTrackingQualityReason = 4
	EARTrackingQualityReason = 5
};

// Enum AugmentedReality.EARTrackingQuality
enum class EARTrackingQuality : uint8 {
	EARTrackingQuality = 0
	EARTrackingQuality = 1
	EARTrackingQuality = 2
	EARTrackingQuality = 3
};

// Enum AugmentedReality.EARLineTraceChannels
enum class EARLineTraceChannels : uint8 {
	EARLineTraceChannels = 0
	EARLineTraceChannels = 1
	EARLineTraceChannels = 2
	EARLineTraceChannels = 4
	EARLineTraceChannels = 8
	EARLineTraceChannels = 9
};

// Class AugmentedReality.A
struct UA : UDataAsset {
	char bGenerateMeshDataFromTrackedGeometry : 0; // 0x30 (1)
	char bGenerateCollisionForMeshData : 0; // 0x31 (1)
	char bGenerateNavMeshForMeshData : 0; // 0x32 (1)
	char bUseMeshDataForOcclusion : 0; // 0x33 (1)
	char b : 0; // 0x34 (1)
	char bTrackSceneObjects : 0; // 0x35 (1)
	char bUsePersonSegmentationForOcclusion : 0; // 0x36 (1)
	enum class Unknow WorldAlignment; // 0x37 (1)
	enum class Unknow SessionType; // 0x38 (1)
	enum class Unknow PlaneDetectionMode; // 0x39 (1)
	char bHorizontalPlaneDetection : 0; // 0x3A (1)
	char bVerticalPlaneDetection : 0; // 0x3B (1)
	char bEnableAutoFocus : 0; // 0x3C (1)
	enum class Unknow LightEstimationMode; // 0x3D (1)
	enum class Unknow FrameSyncMode; // 0x3E (1)
	char bEnableAutomaticCameraOverlay : 0; // 0x3F (1)
	char bEnableAutomaticCameraTracking : 0; // 0x40 (1)
	char b : 0; // 0x41 (1)
	char b : 0; // 0x42 (1)
	struct TArray<Unknown> CandidateImages; // 0x48 (16)
	int32_t MaxNumSimultaneousImagesTracked; // 0x58 (4)
	enum class Unknow EnvironmentCaptureProbeType; // 0x5C (1)
	struct TArray<Unknown> WorldMapData; // 0x60 (16)
	struct TArray<Unknown> CandidateObjects; // 0x70 (16)
	struct Unknown DesiredVideoFormat; // 0x80 (12)
	enum class Unknow FaceTrackingDirection; // 0x8C (1)
	enum class Unknow FaceTrackingUpdate; // 0x8D (1)
	struct TArray<Unknown> SerializedARCandidateImageDatabase; // 0x90 (16)
	enum class Unknow EnabledSessionTrackingFeature; // 0xA0 (1)

	char ShouldResetTrackedObjects(); // Function AugmentedReality.A.ShouldResetTrackedObjects(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF1E10>
	char ShouldResetCameraTracking(); // Function AugmentedReality.A.ShouldResetCameraTracking(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF1DE0>
	char ShouldRenderCameraOverlay(); // Function AugmentedReality.A.ShouldRenderCameraOverlay(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF1DB0>
	char ShouldEnableCameraTracking(); // Function AugmentedReality.A.ShouldEnableCameraTracking(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF1D80>
	char ShouldEnableAutoFocus(); // Function AugmentedReality.A.ShouldEnableAutoFocus(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF1D50>
	void SetWorldMapData(struct TArray<Unknown> WorldMapData); // Function AugmentedReality.A.SetWorldMapData(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF1C60>
	void SetSessionTrackingFeatureToEnable(enum class Unknow InSessionTrackingFeature); // Function AugmentedReality.A.SetSessionTrackingFeatureToEnable(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF1BE0>
	void SetResetTrackedObjects(char bNewValue); // Function AugmentedReality.A.SetResetTrackedObjects(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF1B50>
	void SetResetCameraTracking(char bNewValue); // Function AugmentedReality.A.SetResetCameraTracking(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF1AC0>
	void SetFaceTrackingUpdate(enum class Unknow InUpdate); // Function AugmentedReality.A.SetFaceTrackingUpdate(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF1A40>
	void SetFaceTrackingDirection(enum class Unknow InDirection); // Function AugmentedReality.A.SetFaceTrackingDirection(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF19C0>
	void SetEnableAutoFocus(char bNewValue); // Function AugmentedReality.A.SetEnableAutoFocus(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF1930>
	void SetDesiredVideoFormat(struct Unknown NewFormat); // Function AugmentedReality.A.SetDesiredVideoFormat(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF1890>
	void SetCandidateObjectList(struct TArray<Unknown>& InCandidateObjects); // Function AugmentedReality.A.SetCandidateObjectList(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF17E0>
	struct TArray<Unknown> GetWorldMapData(); // Function AugmentedReality.A.GetWorldMapData(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF0D10>
	enum class Unknow GetWorldAlignment(); // Function AugmentedReality.A.GetWorldAlignment(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF0CE0>
	enum class Unknow GetSessionType(); // Function AugmentedReality.A.GetSessionType(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1606710>
	enum class Unknow GetPlaneDetectionMode(); // Function AugmentedReality.A.GetPlaneDetectionMode(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF08E0>
	int32_t GetMaxNumSimultaneousImagesTracked(); // Function AugmentedReality.A.GetMaxNumSimultaneousImagesTracked(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF0820>
	enum class Unknow GetLightEstimationMode(); // Function AugmentedReality.A.GetLightEstimationMode(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF04F0>
	enum class Unknow GetFrameSyncMode(); // Function AugmentedReality.A.GetFrameSyncMode(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF04C0>
	enum class Unknow GetFaceTrackingUpdate(); // Function AugmentedReality.A.GetFaceTrackingUpdate(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF0490>
	enum class Unknow GetFaceTrackingDirection(); // Function AugmentedReality.A.GetFaceTrackingDirection(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF0460>
	enum class Unknow GetEnvironmentCaptureProbeType(); // Function AugmentedReality.A.GetEnvironmentCaptureProbeType(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF0430>
	enum class Unknow GetEnabledSessionTrackingFeature(); // Function AugmentedReality.A.GetEnabledSessionTrackingFeature(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF0400>
	struct Unknown GetDesiredVideoFormat(); // Function AugmentedReality.A.GetDesiredVideoFormat(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF02C0>
	struct TArray<Unknown> GetCandidateObjectList(); // Function AugmentedReality.A.GetCandidateObjectList(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF01C0>
	struct TArray<Unknown> GetCandidateImageList(); // Function AugmentedReality.A.GetCandidateImageList(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF0130>
	void AddCandidateObject(struct Unknown CandidateObject); // Function AugmentedReality.A.AddCandidateObject(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EEF380>
	void AddCandidateImage(struct Unknown NewCandidateImage); // Function AugmentedReality.A.AddCandidateImage(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EEF300>
};

// Class AugmentedReality.A
struct UA : UA {
	float AmbientIntensityLumens; // 0x28 (4)
	float AmbientColorTemperatureKelvin; // 0x2C (4)
	struct Unknown AmbientColor; // 0x30 (16)

	float GetAmbientIntensityLumens(); // Function AugmentedReality.A.GetAmbientIntensityLumens(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF00A0>
	float GetAmbientColorTemperatureKelvin(); // Function AugmentedReality.A.GetAmbientColorTemperatureKelvin(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF0070>
	struct Unknown GetAmbientColor(); // Function AugmentedReality.A.GetAmbientColor(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF0030>
};

// Class AugmentedReality.A
struct UA : UDataAsset {
	struct Unknown CandidateTexture; // 0x30 (8)
	struct FString FriendlyName; // 0x38 (16)
	float Width; // 0x48 (4)
	float Height; // 0x4C (4)
	enum class Unknow Orientation; // 0x50 (1)

	float GetPhysicalWidth(); // Function AugmentedReality.A.GetPhysicalWidth(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF86C0>
	float GetPhysicalHeight(); // Function AugmentedReality.A.GetPhysicalHeight(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF86A0>
	enum class Unknow GetOrientation(); // Function AugmentedReality.A.GetOrientation(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF8680>
	struct FString GetFriendlyName(); // Function AugmentedReality.A.GetFriendlyName(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF8620>
	struct Unknown GetCandidateTexture(); // Function AugmentedReality.A.GetCandidateTexture(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF8600>
};

// Class AugmentedReality.A
struct UA : UA {
	struct FMulticastInlineDelegate OnSuccess; // 0x50 (16)
	struct FMulticastInlineDelegate OnFailed; // 0x60 (16)

	struct Unknown A(struct Unknown WorldContextObject); // Function AugmentedReality.A.A(Final|Native|Static|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EEF280>
};

// Class AugmentedReality.A
struct UA : UA {
	struct FMulticastInlineDelegate OnSuccess; // 0x50 (16)
	struct FMulticastInlineDelegate OnFailed; // 0x60 (16)

	struct Unknown A(struct Unknown WorldContextObject, struct Unknown Location, struct Unknown Extent); // Function AugmentedReality.A.A(Final|Native|Static|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EEF160>
};

// Class AugmentedReality.A
struct UA : Object {
	struct Unknown TrackedGeometry; // 0x28 (8)
	struct Unknown PinnedComponent; // 0x30 (8)
	struct Unknown LocalToTrackingTransform; // 0x40 (48)
	struct Unknown LocalToAlignedTrackingTransform; // 0x70 (48)
	enum class Unknow TrackingState; // 0xA0 (1)
	struct FMulticastInlineDelegate OnARTrackingStateChanged; // 0xC0 (16)
	struct FMulticastInlineDelegate OnARTransformUpdated; // 0xD0 (16)

	enum class Unknow GetTrackingState(); // Function AugmentedReality.A.GetTrackingState(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF0400>
	struct Unknown GetTrackedGeometry(); // Function AugmentedReality.A.GetTrackedGeometry(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF0B80>
	struct Unknown GetPinnedComponent(); // Function AugmentedReality.A.GetPinnedComponent(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF08B0>
	struct Unknown GetLocalToWorldTransform(); // Function AugmentedReality.A.GetLocalToWorldTransform(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF06A0>
	struct Unknown GetLocalToTrackingTransform(); // Function AugmentedReality.A.GetLocalToTrackingTransform(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF0520>
	struct FName GetDebugName(); // Function AugmentedReality.A.GetDebugName(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF0280>
	void DebugDraw(struct Unknown World, struct Unknown& Color, float Scale, float PersistForSeconds); // Function AugmentedReality.A.DebugDraw(Native|Public|HasOutParms|HasDefaults|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EEF670>
};

// Class AugmentedReality.A
struct AA : AGameMode {
	int32_t BufferSizePerChunk; // 0x3F8 (4)

	void SetPreviewImageData(struct TArray<Unknown> ImageData); // Function AugmentedReality.A.SetPreviewImageData(Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF61B0>
	void SetARWorldSharingIsReady(); // Function AugmentedReality.A.SetARWorldSharingIsReady(Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF6110>
	void SetARSharedWorldData(struct TArray<Unknown> A); // Function AugmentedReality.A.SetARSharedWorldData(Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF6020>
	struct Unknown GetARSharedWorldGameState(); // Function AugmentedReality.A.GetARSharedWorldGameState(Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF57F0>
};

// Class AugmentedReality.A
struct AA : AGameState {
	struct TArray<Unknown> PreviewImageData; // 0x380 (16)
	struct TArray<Unknown> A; // 0x390 (16)
	int32_t PreviewImageBytesTotal; // 0x3A0 (4)
	int32_t A; // 0x3A4 (4)
	int32_t PreviewImageBytesDelivered; // 0x3A8 (4)
	int32_t A; // 0x3AC (4)

	void K2_OnARWorldMapIsReady(); // Function AugmentedReality.A.K2_OnARWorldMapIsReady(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// Class AugmentedReality.A
struct AA : ASkyLight {
	struct Unknown CaptureProbe; // 0x320 (8)

	void SetEnvironmentCaptureProbe(struct Unknown InCaptureProbe); // Function AugmentedReality.A.SetEnvironmentCaptureProbe(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF6130>
};

// Class AugmentedReality.A
struct UA : UTexture {
	enum class Unknow TextureType; // 0xB8 (1)
	float Timestamp; // 0xBC (4)
	struct Unknown ExternalTextureGuid; // 0xC0 (16)
	struct Unknown Size; // 0xD0 (8)
};

// Class AugmentedReality.A
struct UA : UA {
	enum class Unknow DepthQuality; // 0xD8 (1)
	enum class Unknow DepthAccuracy; // 0xD9 (1)
	char bIsTemporallySmoothed : 0; // 0xDA (1)
};

// Class AugmentedReality.A
struct UA : UTextureCube {
	enum class Unknow TextureType; // 0x110 (1)
	float Timestamp; // 0x114 (4)
	struct Unknown ExternalTextureGuid; // 0x118 (16)
	struct Unknown Size; // 0x128 (8)
};

// Class AugmentedReality.A
struct UA : Object {
	struct Unknown UniqueID; // 0x28 (16)
	struct Unknown LocalToTrackingTransform; // 0x40 (48)
	struct Unknown LocalToAlignedTrackingTransform; // 0x70 (48)
	enum class Unknow TrackingState; // 0xA0 (1)
	struct Unknown UnderlyingMesh; // 0xB0 (8)
	enum class Unknow ObjectClassification; // 0xB8 (1)
	int32_t LastUpdateFrameNumber; // 0xD0 (4)
	struct FName DebugName; // 0xE0 (8)

	char IsTracked(); // Function AugmentedReality.A.IsTracked(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF5FA0>
	struct Unknown GetUnderlyingMesh(); // Function AugmentedReality.A.GetUnderlyingMesh(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF5EC0>
	enum class Unknow GetTrackingState(); // Function AugmentedReality.A.GetTrackingState(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF0400>
	enum class Unknow GetObjectClassification(); // Function AugmentedReality.A.GetObjectClassification(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF5E30>
	struct Unknown GetLocalToWorldTransform(); // Function AugmentedReality.A.GetLocalToWorldTransform(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF5DD0>
	struct Unknown GetLocalToTrackingTransform(); // Function AugmentedReality.A.GetLocalToTrackingTransform(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF0520>
	float GetLastUpdateTimestamp(); // Function AugmentedReality.A.GetLastUpdateTimestamp(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF5D00>
	int32_t GetLastUpdateFrameNumber(); // Function AugmentedReality.A.GetLastUpdateFrameNumber(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF5CD0>
	struct FName GetDebugName(); // Function AugmentedReality.A.GetDebugName(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF5B90>
};

// Class AugmentedReality.A
struct UA : UA {
	enum class Unknow Orientation; // 0xE8 (1)
	struct Unknown Center; // 0xEC (12)
	struct Unknown Extent; // 0xF8 (12)
	struct Unknown SubsumedBy; // 0x118 (8)

	struct Unknown GetSubsumedBy(); // Function AugmentedReality.A.GetSubsumedBy(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF5E70>
	enum class Unknow GetOrientation(); // Function AugmentedReality.A.GetOrientation(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF5E50>
	struct Unknown GetExtent(); // Function AugmentedReality.A.GetExtent(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF5CA0>
	struct Unknown GetCenter(); // Function AugmentedReality.A.GetCenter(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF5B60>
	struct TArray<Unknown> GetBoundaryPolygonInLocalSpace(); // Function AugmentedReality.A.GetBoundaryPolygonInLocalSpace(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF5A90>
};

// Class AugmentedReality.A
struct UA : UA {
	struct Unknown DetectedImage; // 0xE8 (8)
	struct Unknown EstimatedSize; // 0xF0 (8)

	struct Unknown GetEstimateSize(); // Function AugmentedReality.A.GetEstimateSize(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF5C20>
	struct Unknown GetDetectedImage(); // Function AugmentedReality.A.GetDetectedImage(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF5BD0>
};

// Class AugmentedReality.A
struct UA : UA {
	struct FString Q; // 0xF8 (16)
	int32_t Version; // 0x108 (4)
};

// Class AugmentedReality.A
struct UA : UA {
	struct Unknown LookAtTarget; // 0xE8 (12)
	char bIsTracked : 0; // 0xF4 (1)
	struct TMap<Unknown, Unknown>Unknown BlendShapes; // 0xF8 (80)

	struct Unknown GetWorldSpaceEyeTransform(enum class Unknow Eye); // Function AugmentedReality.A.GetWorldSpaceEyeTransform(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF5EF0>
	struct Unknown GetLocalSpaceEyeTransform(enum class Unknow Eye); // Function AugmentedReality.A.GetLocalSpaceEyeTransform(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF5D30>
	float GetBlendShapeValue(enum class Unknow BlendShape); // Function AugmentedReality.A.GetBlendShapeValue(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF5820>
	struct TMap<Unknown, Unknown>Unknown GetBlendShapes(); // Function AugmentedReality.A.GetBlendShapes(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF58B0>
};

// Class AugmentedReality.A
struct UA : UA {
	struct Unknown EnvironmentCaptureTexture; // 0xF8 (8)

	struct Unknown GetExtent(); // Function AugmentedReality.A.GetExtent(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF5C60>
	struct Unknown GetEnvironmentCaptureTexture(); // Function AugmentedReality.A.GetEnvironmentCaptureTexture(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF5BF0>
};

// Class AugmentedReality.A
struct UA : UA {
	struct Unknown DetectedObject; // 0xE8 (8)

	struct Unknown GetDetectedObject(); // Function AugmentedReality.A.GetDetectedObject(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF5BD0>
};

// Class AugmentedReality.A
struct UA : UActorComponent {
	struct FMulticastInlineDelegate OnAddTrackedGeometry; // 0xB0 (16)
	struct FMulticastInlineDelegate OnUpdateTrackedGeometry; // 0xC0 (16)
	struct FMulticastInlineDelegate OnRemoveTrackedGeometry; // 0xD0 (16)
	struct FMulticastInlineDelegate OnAddTrackedPlane; // 0xE0 (16)
	struct FMulticastInlineDelegate OnUpdateTrackedPlane; // 0xF0 (16)
	struct FMulticastInlineDelegate OnRemoveTrackedPlane; // 0x100 (16)
	struct FMulticastInlineDelegate OnAddTrackedPoint; // 0x110 (16)
	struct FMulticastInlineDelegate OnUpdateTrackedPoint; // 0x120 (16)
	struct FMulticastInlineDelegate OnRemoveTrackedPoint; // 0x130 (16)
	struct FMulticastInlineDelegate OnAddTrackedImage; // 0x140 (16)
	struct FMulticastInlineDelegate OnUpdateTrackedImage; // 0x150 (16)
	struct FMulticastInlineDelegate OnRemoveTrackedImage; // 0x160 (16)
	struct FMulticastInlineDelegate OnAddTrackedFace; // 0x170 (16)
	struct FMulticastInlineDelegate OnUpdateTrackedFace; // 0x180 (16)
	struct FMulticastInlineDelegate OnRemoveTrackedFace; // 0x190 (16)
	struct FMulticastInlineDelegate OnAddTrackedEnvProbe; // 0x1A0 (16)
	struct FMulticastInlineDelegate OnUpdateTrackedEnvProbe; // 0x1B0 (16)
	struct FMulticastInlineDelegate OnRemoveTrackedEnvProbe; // 0x1C0 (16)
	struct FMulticastInlineDelegate OnAddTrackedObject; // 0x1D0 (16)
	struct FMulticastInlineDelegate OnUpdateTrackedObject; // 0x1E0 (16)
	struct FMulticastInlineDelegate OnRemoveTrackedObject; // 0x1F0 (16)
};

// Class AugmentedReality.A
struct UA : UDataAsset {
	struct TArray<Unknown> CandidateObjectData; // 0x30 (16)
	struct FString FriendlyName; // 0x40 (16)
	struct Unknown BoundingBox; // 0x50 (28)

	void SetFriendlyName(struct FString NewName); // Function AugmentedReality.A.SetFriendlyName(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF8830>
	void SetCandidateObjectData(struct TArray<Unknown>& InCandidateObject); // Function AugmentedReality.A.SetCandidateObjectData(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF8780>
	void SetBoundingBox(struct Unknown& InBoundingBox); // Function AugmentedReality.A.SetBoundingBox(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF86E0>
	struct FString GetFriendlyName(); // Function AugmentedReality.A.GetFriendlyName(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EF8650>
