// Enum AugmentedReality.EARTrackingState
enum class EARTrackingState : uint8 {
	EARTrackingState = 0,
	EARTrackingState = 1,
	EARTrackingState = 2,
	EARTrackingState = 3,
	EARTrackingState = 4
};

// Enum AugmentedReality.EARSessionTrackingFeature
enum class EARSessionTrackingFeature : uint8 {
	EARSessionTrackingFeature = 0,
	EARSessionTrackingFeature = 1,
	EARSessionTrackingFeature = 2,
	EARSessionTrackingFeature = 3,
	EARSessionTrackingFeature = 4
};

// Enum AugmentedReality.EARFaceTrackingUpdate
enum class EARFaceTrackingUpdate : uint8 {
	EARFaceTrackingUpdate = 0,
	EARFaceTrackingUpdate = 1,
	EARFaceTrackingUpdate = 2
};

// Enum AugmentedReality.EAREnvironmentCaptureProbeType
enum class EAREnvironmentCaptureProbeType : uint8 {
	EAREnvironmentCaptureProbeType = 0,
	EAREnvironmentCaptureProbeType = 1,
	EAREnvironmentCaptureProbeType = 2,
	EAREnvironmentCaptureProbeType = 3
};

// Enum AugmentedReality.EARFrameSyncMode
enum class EARFrameSyncMode : uint8 {
	EARFrameSyncMode = 0,
	EARFrameSyncMode = 1,
	EARFrameSyncMode = 2
};

// Enum AugmentedReality.EARLightEstimationMode
enum class EARLightEstimationMode : uint8 {
	EARLightEstimationMode = 0,
	EARLightEstimationMode = 1,
	EARLightEstimationMode = 2,
	EARLightEstimationMode = 3
};

// Enum AugmentedReality.EARPlaneDetectionMode
enum class EARPlaneDetectionMode : uint8 {
	EARPlaneDetectionMode = 0,
	EARPlaneDetectionMode = 1,
	EARPlaneDetectionMode = 2,
	EARPlaneDetectionMode = 3
};

// Enum AugmentedReality.EARSessionType
enum class EARSessionType : uint8 {
	EARSessionType = 0,
	EARSessionType = 1,
	EARSessionType = 2,
	EARSessionType = 3,
	EARSessionType = 4,
	EARSessionType = 5,
	EARSessionType = 6,
	EARSessionType = 7
};

// Enum AugmentedReality.EARWorldAlignment
enum class EARWorldAlignment : uint8 {
	EARWorldAlignment = 0,
	EARWorldAlignment = 1,
	EARWorldAlignment = 2,
	EARWorldAlignment = 3
};

// Enum AugmentedReality.EARDepthAccuracy
enum class EARDepthAccuracy : uint8 {
	EARDepthAccuracy = 0,
	EARDepthAccuracy = 1,
	EARDepthAccuracy = 2,
	EARDepthAccuracy = 3
};

// Enum AugmentedReality.EARDepthQuality
enum class EARDepthQuality : uint8 {
	EARDepthQuality = 0,
	EARDepthQuality = 1,
	EARDepthQuality = 2,
	EARDepthQuality = 3
};

// Enum AugmentedReality.EARTextureType
enum class EARTextureType : uint8 {
	EARTextureType = 0,
	EARTextureType = 1,
	EARTextureType = 2,
	EARTextureType = 3
};

// Enum AugmentedReality.EAREye
enum class EAREye : uint8 {
	EAREye = 0,
	EAREye = 1,
	EAREye = 2
};

// Enum AugmentedReality.EARFaceBlendShape
enum class EARFaceBlendShape : uint8 {
	EARFaceBlendShape = 0,
	EARFaceBlendShape = 1,
	EARFaceBlendShape = 2,
	EARFaceBlendShape = 3,
	EARFaceBlendShape = 4,
	EARFaceBlendShape = 5,
	EARFaceBlendShape = 6,
	EARFaceBlendShape = 7,
	EARFaceBlendShape = 8,
	EARFaceBlendShape = 9,
	EARFaceBlendShape = 10,
	EARFaceBlendShape = 11,
	EARFaceBlendShape = 12,
	EARFaceBlendShape = 13,
	EARFaceBlendShape = 14,
	EARFaceBlendShape = 15,
	EARFaceBlendShape = 16,
	EARFaceBlendShape = 17,
	EARFaceBlendShape = 18,
	EARFaceBlendShape = 19,
	EARFaceBlendShape = 20,
	EARFaceBlendShape = 21,
	EARFaceBlendShape = 22,
	EARFaceBlendShape = 23,
	EARFaceBlendShape = 24,
	EARFaceBlendShape = 25,
	EARFaceBlendShape = 26,
	EARFaceBlendShape = 27,
	EARFaceBlendShape = 28,
	EARFaceBlendShape = 29,
	EARFaceBlendShape = 30,
	EARFaceBlendShape = 31,
	EARFaceBlendShape = 32,
	EARFaceBlendShape = 33,
	EARFaceBlendShape = 34,
	EARFaceBlendShape = 35,
	EARFaceBlendShape = 36,
	EARFaceBlendShape = 37,
	EARFaceBlendShape = 38,
	EARFaceBlendShape = 39,
	EARFaceBlendShape = 40,
	EARFaceBlendShape = 41,
	EARFaceBlendShape = 42,
	EARFaceBlendShape = 43,
	EARFaceBlendShape = 44,
	EARFaceBlendShape = 45,
	EARFaceBlendShape = 46,
	EARFaceBlendShape = 47,
	EARFaceBlendShape = 48,
	EARFaceBlendShape = 49,
	EARFaceBlendShape = 50,
	EARFaceBlendShape = 51,
	EARFaceBlendShape = 52,
	EARFaceBlendShape = 53,
	EARFaceBlendShape = 54,
	EARFaceBlendShape = 55,
	EARFaceBlendShape = 56,
	EARFaceBlendShape = 57,
	EARFaceBlendShape = 58,
	EARFaceBlendShape = 59,
	EARFaceBlendShape = 60,
	EARFaceBlendShape = 61
};

// Enum AugmentedReality.EARFaceTrackingDirection
enum class EARFaceTrackingDirection : uint8 {
	EARFaceTrackingDirection = 0,
	EARFaceTrackingDirection = 1,
	EARFaceTrackingDirection = 2
};

// Enum AugmentedReality.EARCandidateImageOrientation
enum class EARCandidateImageOrientation : uint8 {
	EARCandidateImageOrientation = 0,
	EARCandidateImageOrientation = 1,
	EARCandidateImageOrientation = 2
};

// Enum AugmentedReality.EARJointTransformSpace
enum class EARJointTransformSpace : uint8 {
	EARJointTransformSpace = 0,
	EARJointTransformSpace = 1,
	EARJointTransformSpace = 2
};

// Enum AugmentedReality.EARObjectClassification
enum class EARObjectClassification : uint8 {
	EARObjectClassification = 0,
	EARObjectClassification = 1,
	EARObjectClassification = 2,
	EARObjectClassification = 3,
	EARObjectClassification = 4,
	EARObjectClassification = 5,
	EARObjectClassification = 6,
	EARObjectClassification = 7,
	EARObjectClassification = 8,
	EARObjectClassification = 9,
	EARObjectClassification = 10,
	EARObjectClassification = 11,
	EARObjectClassification = 12
};

// Enum AugmentedReality.EARPlaneOrientation
enum class EARPlaneOrientation : uint8 {
	EARPlaneOrientation = 0,
	EARPlaneOrientation = 1,
	EARPlaneOrientation = 2,
	EARPlaneOrientation = 3
};

// Enum AugmentedReality.EARWorldMappingState
enum class EARWorldMappingState : uint8 {
	EARWorldMappingState = 0,
	EARWorldMappingState = 1,
	EARWorldMappingState = 2,
	EARWorldMappingState = 3,
	EARWorldMappingState = 4
};

// Enum AugmentedReality.EARSessionStatus
enum class EARSessionStatus : uint8 {
	EARSessionStatus = 0,
	EARSessionStatus = 1,
	EARSessionStatus = 2,
	EARSessionStatus = 3,
	EARSessionStatus = 4,
	EARSessionStatus = 5,
	EARSessionStatus = 6,
	EARSessionStatus = 7
};

// Enum AugmentedReality.EARTrackingQualityReason
enum class EARTrackingQualityReason : uint8 {
	EARTrackingQualityReason = 0,
	EARTrackingQualityReason = 1,
	EARTrackingQualityReason = 2,
	EARTrackingQualityReason = 3,
	EARTrackingQualityReason = 4,
	EARTrackingQualityReason = 5
};

// Enum AugmentedReality.EARTrackingQuality
enum class EARTrackingQuality : uint8 {
	EARTrackingQuality = 0,
	EARTrackingQuality = 1,
	EARTrackingQuality = 2,
	EARTrackingQuality = 3
};

// Enum AugmentedReality.EARLineTraceChannels
enum class EARLineTraceChannels : uint8 {
	EARLineTraceChannels = 0,
	EARLineTraceChannels = 1,
	EARLineTraceChannels = 2,
	EARLineTraceChannels = 4,
	EARLineTraceChannels = 8,
	EARLineTraceChannels = 9
};

// Class AugmentedReality.ARSessionConfig
struct UARSessionConfig : UDataAsset {
	char bGenerateMeshDataFromTrackedGeometry; //  0x30 Size(1)
	char bGenerateCollisionForMeshData; //  0x31 Size(1)
	char bGenerateNavMeshForMeshData; //  0x32 Size(1)
	char bUseMeshDataForOcclusion; //  0x33 Size(1)
	char bRenderMeshDataInWireframe; //  0x34 Size(1)
	char bTrackSceneObjects; //  0x35 Size(1)
	char bUsePersonSegmentationForOcclusion; //  0x36 Size(1)
	enum class Unknow WorldAlignment; //  0x37 Size(1)
	enum class Unknow SessionType; //  0x38 Size(1)
	enum class Unknow PlaneDetectionMode; //  0x39 Size(1)
	char bHorizontalPlaneDetection; //  0x3a Size(1)
	char bVerticalPlaneDetection; //  0x3b Size(1)
	char bEnableAutoFocus; //  0x3c Size(1)
	enum class Unknow LightEstimationMode; //  0x3d Size(1)
	enum class Unknow FrameSyncMode; //  0x3e Size(1)
	char bEnableAutomaticCameraOverlay; //  0x3f Size(1)
	char bEnableAutomaticCameraTracking; //  0x40 Size(1)
	char bResetCameraTracking; //  0x41 Size(1)
	char bResetTrackedObjects; //  0x42 Size(1)
	struct TArray<Unknown> CandidateImages; //  0x48 Size(10)
	int32_t MaxNumSimultaneousImagesTracked; //  0x58 Size(4)
	enum class Unknow EnvironmentCaptureProbeType; //  0x5c Size(1)
	struct TArray<Unknown> WorldMapData; //  0x60 Size(10)
	struct TArray<Unknown> CandidateObjects; //  0x70 Size(10)
	struct Unknown DesiredVideoFormat; //  0x80 Size(c)
	enum class Unknow FaceTracking; //  0x8c Size(1)
	enum class Unknow FaceTrackingUpdate; //  0x8d Size(1)
	struct TArray<Unknown> SerializedARCandidateImageDatabase; //  0x90 Size(10)
	enum class Unknow EnabledSessionTrackingFeature; //  0xa0 Size(1)

	char ShouldResetTrackedObjects(); // Function AugmentedReality.ARSessionConfig.ShouldResetTrackedObjects(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game+0x2ef1e10>
};

// Class AugmentedReality.ARBasicLightEstimate
struct UARBasicLightEstimate : UARLightEstimate {
	float AmbientIntensityLumens; //  0x28 Size(4)
	float AmbientColorTemperatureKelvin; //  0x2c Size(4)
	struct Unknown AmbientColor; //  0x30 Size(10)

	float GetAmbientIntensityLumens(); // Function AugmentedReality.ARBasicLightEstimate.GetAmbientIntensityLumens(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game+0x2ef00a0>
};

// Class AugmentedReality.ARCandidateImage
struct UARCandidateImage : UDataAsset {
	struct Unknown CandidateTexture; //  0x30 Size(8)
	struct FString FriendlyName; //  0x38 Size(10)
	float Width; //  0x48 Size(4)
	float Height; //  0x4c Size(4)
	enum class Unknow Orientation; //  0x50 Size(1)

	float GetPhysicalWidth(); // Function AugmentedReality.ARCandidateImage.GetPhysicalWidth(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game+0x2ef86c0>
};

// Class AugmentedReality.ARSaveWorldAsyncTaskBlueprintProxy
struct UARSaveWorldAsyncTaskBlueprintProxy : UARBaseAsyncTaskBlueprintProxy {
	struct FMulticastInlineDelegate OnSuccess; //  0x50 Size(10)
	struct FMulticastInlineDelegate OnFailed; //  0x60 Size(10)

	struct Unknown ARSaveWorld(struct Unknown WorldContextObject); // Function AugmentedReality.ARSaveWorldAsyncTaskBlueprintProxy.ARSaveWorld(Final|Native|Static|Public|BlueprintCallable) // <Game+0x2eef280>
};

// Class AugmentedReality.ARGetCandidateObjectAsyncTaskBlueprintProxy
struct UARGetCandidateObjectAsyncTaskBlueprintProxy : UARBaseAsyncTaskBlueprintProxy {
	struct FMulticastInlineDelegate OnSuccess; //  0x50 Size(10)
	struct FMulticastInlineDelegate OnFailed; //  0x60 Size(10)

	struct Unknown ARGetCandidateObject(struct Unknown WorldContextObject, struct Unknown Location, struct Unknown Extent); // Function AugmentedReality.ARGetCandidateObjectAsyncTaskBlueprintProxy.ARGetCandidateObject(Final|Native|Static|Public|HasDefaults|BlueprintCallable) // <Game+0x2eef160>
};

// Class AugmentedReality.ARPin
struct UARPin : Object {
	struct Unknown TrackedGeometry; //  0x28 Size(8)
	struct Unknown PinnedComponent; //  0x30 Size(8)
	struct Unknown LocalToTrackingTransform; //  0x40 Size(30)
	struct Unknown LocalToAlignedTrackingTrans; //  0x70 Size(30)
	enum class Unknow TrackingState; //  0xa0 Size(1)
	struct FMulticastInlineDelegate OnARTrackingStateChanged; //  0xc0 Size(10)
	struct FMulticastInlineDelegate OnARTransformUpdated; //  0xd0 Size(10)

	enum class Unknow GetTrackingState(); // Function AugmentedReality.ARPin.GetTrackingState(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game+0x2ef0400>
};

// Class AugmentedReality.ARSharedWorldGameMode
struct AARSharedWorldGameMode : AGameMode {
	int32_t BufferSizePerChunk; //  0x3f8 Size(4)

	void SetPreviewImageData(struct TArray<Unknown> ImageData); // Function AugmentedReality.ARSharedWorldGameMode.SetPreviewImageData(Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // <Game+0x2ef61b0>
};

// Class AugmentedReality.ARSharedWorldGameState
struct AARSharedWorldGameState : AGameState {
	struct TArray<Unknown> PreviewImage; //  0x380 Size(10)
	struct TArray<Unknown> ARWorldData; //  0x390 Size(10)
	int32_t PreviewImageBytesTotal; //  0x3a0 Size(4)
	int32_t ARWorldBytesTotal; //  0x3a4 Size(4)
	int32_t PreviewImageBytesDelivered; //  0x3a8 Size(4)
	int32_t ARWorldBytes; //  0x3ac Size(4)

	void K2_OnARWorldMapIsReady(); // Function AugmentedReality.ARSharedWorldGameState.K2_OnARWorldMapIsReady(Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// Class AugmentedReality.ARSkyLight
struct AARSkyLight : ASkyLight {
	struct Unknown CaptureProbe; //  0x320 Size(8)

	void SetEnvironmentCaptureProbe(struct Unknown InCaptureProbe); // Function AugmentedReality.ARSkyLight.SetEnvironmentCaptureProbe(Final|Native|Public|BlueprintCallable) // <Game+0x2ef6130>
};

// Class AugmentedReality.ARTexture
struct UARTexture : UTexture {
	enum class Unknow TextureType; //  0xb8 Size(1)
	float Timestamp; //  0xbc Size(4)
	struct Unknown ExternalTextureGuid; //  0xc0 Size(10)
	struct Unknown Size; //  0xd0 Size(8)
};

// Class AugmentedReality.ARTextureCameraDepth
struct UARTextureCameraDepth : UARTexture {
	enum class Unknow DepthQuality; //  0xd8 Size(1)
	enum class Unknow DepthAccuracy; //  0xd9 Size(1)
	char bIsTemporallySmoothed; //  0xda Size(1)
};

// Class AugmentedReality.AREnvironmentCaptureProbeTexture
struct UAREnvironmentCaptureProbeTexture : UTextureCube {
	enum class Unknow TextureType; //  0x110 Size(1)
	float Timestamp; //  0x114 Size(4)
	struct Unknown ExternalTextureGuid; //  0x118 Size(10)
	struct Unknown Size; //  0x128 Size(8)
};

// Class AugmentedReality.ARTrackedGeometry
struct UARTrackedGeometry : Object {
	struct Unknown UniqueID; //  0x28 Size(10)
	struct Unknown LocalToTrackingTransform; //  0x40 Size(30)
	struct Unknown LocalToAlignedTrackingTrans; //  0x70 Size(30)
	enum class Unknow TrackingState; //  0xa0 Size(1)
	struct Unknown UnderlyingMesh; //  0xb0 Size(8)
	enum class Unknow ObjectClassification; //  0xb8 Size(1)
	int32_t LastUpdateFrameNumber; //  0xd0 Size(4)
	struct FName DebugName; //  0xe0 Size(8)

	char IsTracked(); // Function AugmentedReality.ARTrackedGeometry.IsTracked(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game+0x2ef5fa0>
};

// Class AugmentedReality.ARPlaneGeometry
struct UARPlaneGeometry : UARTrackedGeometry {
	enum class Unknow Orientation; //  0xe8 Size(1)
	struct Unknown Center; //  0xec Size(c)
	struct Unknown Extent; //  0xf8 Size(c)
	struct Unknown SubsumedBy; //  0x118 Size(8)

	struct Unknown GetSubsumedBy(); // Function AugmentedReality.ARPlaneGeometry.GetSubsumedBy(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game+0x2ef5e70>
};

// Class AugmentedReality.ARTrackedImage
struct UARTrackedImage : UARTrackedGeometry {
	struct Unknown DetectedImage; //  0xe8 Size(8)
	struct Unknown EstimatedSize; //  0xf0 Size(8)

	struct Unknown GetEstimateSize(); // Function AugmentedReality.ARTrackedImage.GetEstimateSize(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // <Game+0x2ef5c20>
};

// Class AugmentedReality.ARTrackedQRCode
struct UARTrackedQRCode : UARTrackedImage {
	struct FString QRCode; //  0xf8 Size(10)
	int32_t Version; //  0x108 Size(4)
};

// Class AugmentedReality.ARFaceGeometry
struct UARFaceGeometry : UARTrackedGeometry {
	struct Unknown LookAtTarget; //  0xe8 Size(c)
	char bIsTracked; //  0xf4 Size(1)
	struct TMap<{}, {}>Unknown BlendShapes; //  0xf8 Size(50)

	struct Unknown GetWorldSpaceEyeTransform(enum class Unknow Eye); // Function AugmentedReality.ARFaceGeometry.GetWorldSpaceEyeTransform(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <Game+0x2ef5ef0>
};

// Class AugmentedReality.AREnvironmentCaptureProbe
struct UAREnvironmentCaptureProbe : UARTrackedGeometry {
	struct Unknown EnvironmentCaptureTexture; //  0xf8 Size(8)

	struct Unknown GetExtent(); // Function AugmentedReality.AREnvironmentCaptureProbe.GetExtent(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <Game+0x2ef5c60>
};

// Class AugmentedReality.ARTrackedObject
struct UARTrackedObject : UARTrackedGeometry {
	struct Unknown DetectedObject; //  0xe8 Size(8)

	struct Unknown GetDetectedObject(); // Function AugmentedReality.ARTrackedObject.GetDetectedObject(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game+0x2ef5bd0>
};

// Class AugmentedReality.ARTrackableNotifyComponent
struct UARTrackableNotifyComponent : UActorComponent {
	struct FMulticastInlineDelegate OnAddTrackedGeometry; //  0xb0 Size(10)
	struct FMulticastInlineDelegate OnUpdateTrackedGeometry; //  0xc0 Size(10)
	struct FMulticastInlineDelegate OnRemoveTrackedGeometry; //  0xd0 Size(10)
	struct FMulticastInlineDelegate OnAddTrackedPlane; //  0xe0 Size(10)
	struct FMulticastInlineDelegate OnUpdateTrackedPlane; //  0xf0 Size(10)
	struct FMulticastInlineDelegate OnRemoveTrackedPlane; //  0x100 Size(10)
	struct FMulticastInlineDelegate OnAddTrackedPoint; //  0x110 Size(10)
	struct FMulticastInlineDelegate OnUpdateTrackedPoint; //  0x120 Size(10)
	struct FMulticastInlineDelegate OnRemoveTrackedPoint; //  0x130 Size(10)
	struct FMulticastInlineDelegate OnAddTrackedImage; //  0x140 Size(10)
	struct FMulticastInlineDelegate OnUpdateTrackedImage; //  0x150 Size(10)
	struct FMulticastInlineDelegate OnRemoveTrackedImage; //  0x160 Size(10)
	struct FMulticastInlineDelegate OnAddTrackedFace; //  0x170 Size(10)
	struct FMulticastInlineDelegate OnUpdateTrackedFace; //  0x180 Size(10)
	struct FMulticastInlineDelegate OnRemoveTrackedFace; //  0x190 Size(10)
	struct FMulticastInlineDelegate OnAddTrackedEnvProbe; //  0x1a0 Size(10)
	struct FMulticastInlineDelegate OnUpdateTrackedEnvProbe; //  0x1b0 Size(10)
	struct FMulticastInlineDelegate OnRemoveTrackedEnvProbe; //  0x1c0 Size(10)
	struct FMulticastInlineDelegate OnAddTrackedObject; //  0x1d0 Size(10)
	struct FMulticastInlineDelegate OnUpdateTrackedObject; //  0x1e0 Size(10)
	struct FMulticastInlineDelegate OnRemoveTrackedObject; //  0x1f0 Size(10)
};

// Class AugmentedReality.ARCandidateObject
struct UARCandidateObject : UDataAsset {
	struct TArray<Unknown> CandidateObjectData; //  0x30 Size(10)
	struct FString FriendlyName; //  0x40 Size(10)
	struct Unknown BoundingBox; //  0x50 Size(1c)

	void SetFriendlyName(struct FString NewName); // Function AugmentedReality.ARCandidateObject.SetFriendlyName(Final|Native|Public|BlueprintCallable) // <Game+0x2ef8830>
};

