// UserDefinedEnum B.B
enum class B : uint8 {
	B = 0,
	B = 1,
	B = 2,
	B = 3
};

// BlueprintGeneratedClass B.B
struct UB : UBravoHotelGameInstance {
	Unknown UberGraphFrame; //  0x5a0 Size(8)
	Unknown Game; //  0x5a8 Size(8)
	Unknown LastPCPosition; //  0x5b0 Size(c)

	void Update(Unknown Audio, float Volume, char& ); // Function B.B.Update(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelAmplifier {
	Unknown UberGraphFrame; //  0x1bf0 Size(8)
	Unknown InternalPP; //  0x1bf8 Size(8)
	Unknown EffectMaterial; //  0x1c00 Size(8)
	char IsActive; //  0x1c08 Size(1)
	Unknown mRadialBlur; //  0x1c10 Size(8)
	Unknown iRadialBlur; //  0x1c18 Size(8)
	Unknown Radial; //  0x1c20 Size(38)
	float Radial; //  0x1c58 Size(4)
	int32_t Radial; //  0x1c5c Size(4)
	Unknown Radial; //  0x1c60 Size(8)
	Unknown Radial; //  0x1c68 Size(8)
	Unknown Native; //  0x1c70 Size(5c0)
	Unknown mSelectiveColor; //  0x2230 Size(8)
	Unknown iSelectiveColor; //  0x2238 Size(8)
	Unknown Selective; //  0x2240 Size(38)
	Unknown Selective; //  0x2278 Size(10)
	float Selective; //  0x2288 Size(4)
	float Selective; //  0x228c Size(4)
	float Selective; //  0x2290 Size(4)
	float CurrentBlur; //  0x2294 Size(4)
	float CurrentSelective; //  0x2298 Size(4)
	float FadeInSpeed; //  0x229c Size(4)
	float FadeOutSpeed; //  0x22a0 Size(4)
	Unknown mMonochrome; //  0x22a8 Size(8)
	Unknown iMonochrome; //  0x22b0 Size(8)
	Unknown Monochrome; //  0x22b8 Size(38)
	Unknown Monochrome; //  0x22f0 Size(10)
	Unknown MBlackColor; //  0x2300 Size(8)
	Unknown IBlackColor; //  0x2308 Size(8)
	Unknown BlackColor; //  0x2310 Size(38)
	float ActiveDelayTime; //  0x2348 Size(4)
	Unknown MainWidget; //  0x2350 Size(8)
	Unknown TopWidget; //  0x2358 Size(8)

	void GetTopWidget(Unknown& TopWidget); // Function B.B.GetTopWidget(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct UB : USavedInventorySettings {
	char ShowPerkSlot; //  0x30 Size(1)
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileMolotovFireCell {
	Unknown UberGraphFrame; //  0x398 Size(8)
	float TextureScale; //  0x3a0 Size(4)
	float BurnArea; //  0x3a4 Size(4)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown UberGraphFrame; //  0x22f0 Size(8)
	float BarrelHeatEffect_Effect_Intensity_B2A9FBB3451595B9BFEF019625EA581E; //  0x22f8 Size(4)
	Unknown BarrelHeatEffect__Direction_B2A9FBB3451595B9BFEF019625EA581E; //  0x22fc Size(1)
	Unknown BarrelHeatEffect; //  0x2300 Size(8)

	void BarrelHeatEffect__FinishedFunc(); // Function B.B.BarrelHeatEffect__FinishedFunc(BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct UB : UBravoHotelGrassCollisionComponent {
	Unknown UberGraphFrame; //  0xb8 Size(8)
	float TextureScale; //  0xc0 Size(4)
	float CollisionArea; //  0xc4 Size(4)
	float LieDistance; //  0xc8 Size(4)
	float DrawDistance; //  0xcc Size(4)
	Unknown Brush; //  0xd0 Size(8)
	float Brush; //  0xd8 Size(4)
	Unknown Eraser; //  0xe0 Size(8)
	float Erase; //  0xe8 Size(4)
	char IsTickStart; //  0xec Size(1)
	Unknown TargetCharacter; //  0xf0 Size(8)

	void DrawGrassCollision(Unknown TargetCharacter); // Function B.B.DrawGrassCollision(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelCharacterPrefab {
	Unknown UberGraphFrame; //  0x3a60 Size(8)
	Unknown B; //  0x3a68 Size(8)
	Unknown OutBlueZone; //  0x3a70 Size(8)
	Unknown B; //  0x3a78 Size(8)
	Unknown DevCamera_ChildActor; //  0x3a80 Size(8)
	Unknown TeamInfoUpdater; //  0x3a88 Size(8)
	float VelocityZ_LandingDamage; //  0x3a90 Size(4)
	Unknown CharacterPreviewRef; //  0x3a98 Size(8)
	Unknown Chat; //  0x3aa0 Size(8)
	char ShowChatToggle; //  0x3aa8 Size(1)
	float CurrentViewportSizeX; //  0x3aac Size(4)
	float CurrentViewportSizeY; //  0x3ab0 Size(4)
	char OutScreenPosition; //  0x3ab4 Size(1)
	int32_t SightNumForTset; //  0x3ab8 Size(4)
	char bDefaultAmplifier; //  0x3abc Size(1)
	float CurrentTeamInfoHeight; //  0x3ac0 Size(4)

	void ForceInitRecordingCharacter(); // Function B.B.ForceInitRecordingCharacter(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown B; //  0xd18 Size(8)
	Unknown B; //  0xd20 Size(8)
	Unknown B; //  0xd28 Size(8)
	Unknown BravoHotelVehicleSeat05; //  0xd30 Size(8)
	Unknown BravoHotelVehicleSeat04; //  0xd38 Size(8)
	Unknown BravoHotelVehicleSeat03; //  0xd40 Size(8)
	Unknown BravoHotelVehicleSeat02; //  0xd48 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileGrenadeBomb {
	Unknown UberGraphFrame; //  0x678 Size(8)
	Unknown Ak; //  0x680 Size(8)

	void BndEvt__SphereCollision_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(Unknown HitComponent, Unknown OtherActor, Unknown OtherComp, Unknown NormalImpulse, Unknown& Hit); // Function B.B.BndEvt__SphereCollision_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(HasOutParms|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown BravoHotelVehicleTire_RR; //  0xd18 Size(8)
	Unknown BravoHotelVehicleTire_RL; //  0xd20 Size(8)
	Unknown BravoHotelVehicleTire_FR; //  0xd28 Size(8)
	Unknown BravoHotelVehicleTire_FL; //  0xd30 Size(8)
	Unknown B; //  0xd38 Size(8)
	Unknown B; //  0xd40 Size(8)
	Unknown BravoHotelVehicleSeat04; //  0xd48 Size(8)
	Unknown BravoHotelVehicleSeat03; //  0xd50 Size(8)
	Unknown BravoHotelVehicleSeat02; //  0xd58 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelBootyBoxActor {
	Unknown StaticMesh; //  0x3b8 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileGrenadeMolotovCocktail {
	Unknown UberGraphFrame; //  0x7f0 Size(8)
	float TextureScale; //  0x7f8 Size(4)
	float CollisionSize; //  0x7fc Size(4)

	void ActiveThrowingProjectileMainEffect(); // Function B.B.ActiveThrowingProjectileMainEffect(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass B.B
struct UB : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown BackgroundBlurFadeIn; //  0x250 Size(8)
	Unknown Idle; //  0x258 Size(8)
	Unknown BackgroundBlur_1; //  0x260 Size(8)
	Unknown BT; //  0x268 Size(8)
	Unknown Btn; //  0x270 Size(8)
	Unknown Btn; //  0x278 Size(8)
	Unknown Btn; //  0x280 Size(8)
	Unknown Canvas_Main; //  0x288 Size(8)
	Unknown KillcamBtns; //  0x290 Size(8)
	Unknown Memb; //  0x298 Size(8)
	Unknown TextDepth_Replay; //  0x2a0 Size(8)
	Unknown U; //  0x2a8 Size(8)
	char bIsKillCam; //  0x2b0 Size(1)

	Unknown GetInteractiveWidget(); // Function B.B.GetInteractiveWidget(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ATransportAircraftPawn {
	Unknown UberGraphFrame; //  0x6d0 Size(8)

	void ReceiveTick(float DeltaSeconds); // Function B.B.ReceiveTick(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct UB : UBravoHotelGameSettingManager {
	Unknown UberGraphFrame; //  0x38 Size(8)
	Unknown Game; //  0x40 Size(8)

	void Get(Unknown& SettingsWrapper); // Function B.B.Get(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown BravoHotelVehicleTire_RR; //  0xd18 Size(8)
	Unknown BravoHotelVehicleTire_RL; //  0xd20 Size(8)
	Unknown BravoHotelVehicleTire_FR; //  0xd28 Size(8)
	Unknown BravoHotelVehicleTire_FL; //  0xd30 Size(8)
	Unknown B; //  0xd38 Size(8)
	Unknown B; //  0xd40 Size(8)
	Unknown BravoHotelVehicleSeat04; //  0xd48 Size(8)
	Unknown BravoHotelVehicleSeat03; //  0xd50 Size(8)
	Unknown BravoHotelVehicleSeat02; //  0xd58 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileMolotovFireCell {
	Unknown UberGraphFrame; //  0x398 Size(8)
	float TextureScale; //  0x3a0 Size(4)
	float BurnArea; //  0x3a4 Size(4)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass B.B
struct UB : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown B_Value; //  0x250 Size(8)
	Unknown Check; //  0x258 Size(8)
	Unknown G_Value; //  0x260 Size(8)
	Unknown Image_166; //  0x268 Size(8)
	Unknown Land; //  0x270 Size(8)
	Unknown Land_2; //  0x278 Size(8)
	Unknown Land_3; //  0x280 Size(8)
	Unknown Land_4; //  0x288 Size(8)
	Unknown Land_5; //  0x290 Size(8)
	Unknown Land_6; //  0x298 Size(8)
	Unknown R_5; //  0x2a0 Size(8)
	Unknown R_7; //  0x2a8 Size(8)
	Unknown R_9; //  0x2b0 Size(8)
	Unknown R_Value; //  0x2b8 Size(8)
	Unknown TextBlock_4; //  0x2c0 Size(8)
	Unknown TextBlock_5; //  0x2c8 Size(8)
	Unknown TextBlock_6; //  0x2d0 Size(8)
	Unknown TextBlock_8; //  0x2d8 Size(8)
	Unknown TextBlock_9; //  0x2e0 Size(8)
	Unknown TextBlock_10; //  0x2e8 Size(8)
	Unknown Timer; //  0x2f0 Size(8)

	void OnLoaded_395796F147F051B7CCBB17B8AB7F3577(Unknown Loaded); // Function B.B.OnLoaded_395796F147F051B7CCBB17B8AB7F3577(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : UActor {
	Unknown UberGraphFrame; //  0x310 Size(8)
	Unknown Widget; //  0x318 Size(8)
	Unknown DefaultSceneRoot; //  0x320 Size(8)
	Unknown TargetCharacter; //  0x328 Size(8)
	Unknown LoudnessCurve; //  0x330 Size(8)
	float AmplifierLength; //  0x338 Size(4)
	Unknown TagetGroundState; //  0x33c Size(1)
	char IsFiring; //  0x33d Size(1)
	Unknown CurrentWeapon; //  0x340 Size(8)
	Unknown SingleTimerEvent; //  0x348 Size(8)
	char IsSingleFiring; //  0x350 Size(1)

	void _1(float DeltaSeconds, Unknown OldLocation, Unknown OldVelocity); // Function B.B._1(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : UActor {
	Unknown UberGraphFrame; //  0x310 Size(8)
	Unknown Widget; //  0x318 Size(8)
	Unknown DefaultSceneRoot; //  0x320 Size(8)
	Unknown TargetCharacter; //  0x328 Size(8)
	Unknown LoudnessCurve; //  0x330 Size(8)
	float HeartBeatSensorLength; //  0x338 Size(4)
	Unknown TagetGroundState; //  0x33c Size(1)
	char IsFiring; //  0x33d Size(1)
	Unknown CurrentWeapon; //  0x340 Size(8)
	Unknown SingleTimerEvent; //  0x348 Size(8)
	char IsSingleFiring; //  0x350 Size(1)

	void ReceiveTick(float DeltaSeconds); // Function B.B.ReceiveTick(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown UberGraphFrame; //  0xd18 Size(8)
	Unknown AdditionalStuntRotation; //  0xd20 Size(c)
	char Pressed_Pitch; //  0xd2c Size(1)
	char Pressed_Roll; //  0xd2d Size(1)
	char AutoRotate_Roll; //  0xd2e Size(1)
	char CanStunt_Roll; //  0xd2f Size(1)
	float StuntValue_Pitch; //  0xd30 Size(4)
	float StuntValue_Roll; //  0xd34 Size(4)
	float StuntInterpSpeed_Pitch; //  0xd38 Size(4)
	float StuntInterpSpeed_Roll; //  0xd3c Size(4)
	float StuntInterpSpeedRate; //  0xd40 Size(4)
	float StuntDirection_Pitch; //  0xd44 Size(4)
	float StuntDirection_Roll; //  0xd48 Size(4)
	float TargetStunt_Pitch; //  0xd4c Size(4)
	float TargetStunt_Roll; //  0xd50 Size(4)
	float ParkingForceValue; //  0xd54 Size(4)
	float RaisingForceValue; //  0xd58 Size(4)
	Unknown Handle_SetParkingForce; //  0xd60 Size(8)

	void Stunt(); // Function B.B.Stunt(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelAreaSkillZonePowerInterruption {
	Unknown UberGraphFrame; //  0x368 Size(8)
	float SkillDelayTime; //  0x370 Size(4)
	Unknown BlackOutDynamicMaterial; //  0x378 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : UActor {
	Unknown UberGraphFrame; //  0x310 Size(8)
	Unknown WorldViewCamera; //  0x318 Size(8)
	Unknown FarCamera; //  0x320 Size(8)
	Unknown NearCamera; //  0x328 Size(8)
	Unknown DefaultSceneRoot; //  0x330 Size(8)
	Unknown CharacterRef; //  0x338 Size(8)
	Unknown TargetNearCameraTransform; //  0x340 Size(30)
	float DeltaTime; //  0x370 Size(4)
	Unknown TargetFarCameraTransform; //  0x380 Size(30)
	Unknown PlayerControllerRef; //  0x3b0 Size(8)
	char bIsBackgroundScene; //  0x3b8 Size(1)
	Unknown WinTeamCharacters; //  0x3c0 Size(10)
	Unknown DuoLocation_Near; //  0x3d0 Size(10)
	Unknown CharacterOriginLocation; //  0x3e0 Size(c)
	Unknown DuoRotation_Near; //  0x3f0 Size(10)
	Unknown DuoLocation_Far; //  0x400 Size(10)
	Unknown DuoRotation_Far; //  0x410 Size(10)
	Unknown TrioLocation_Near; //  0x420 Size(10)
	Unknown TrioRotation_Near; //  0x430 Size(10)
	Unknown TrioLocation_Far; //  0x440 Size(10)
	Unknown TrioRotation_Far; //  0x450 Size(10)
	Unknown SquadLocation_Near; //  0x460 Size(10)
	Unknown SquadRotation_Near; //  0x470 Size(10)
	Unknown SquadLocation_Far; //  0x480 Size(10)
	Unknown SquadRotation_Far; //  0x490 Size(10)
	Unknown CharacterOriginRotation; //  0x4a0 Size(c)

	void GetFloorLocation(Unknown InLocation, Unknown& OutLocation); // Function B.B.GetFloorLocation(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelPlayerHUD {
	Unknown UberGraphFrame; //  0x858 Size(8)
	Unknown DefaultSceneRoot; //  0x860 Size(8)
	Unknown TableInfo; //  0x868 Size(50)
	Unknown NewVar_1; //  0x8b8 Size(10)
	Unknown GuideWidgetStack; //  0x8c8 Size(10)
	Unknown NewVar_2; //  0x8d8 Size(1)

	void IsSpectate(char& Return); // Function B.B.IsSpectate(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelVehicle {
	Unknown UberGraphFrame; //  0xcd0 Size(8)
	Unknown TeamInfoUpdater; //  0xcd8 Size(8)
	float Timeline_0_NewTrack_0_FB4F6B44434A25E409AE66987076220A; //  0xce0 Size(4)
	Unknown Timeline_0__Direction_FB4F6B44434A25E409AE66987076220A; //  0xce4 Size(1)
	Unknown Timeline_1; //  0xce8 Size(8)
	Unknown EngineSound; //  0xcf0 Size(8)

	void SetWaterLevelZ_Func(); // Function B.B.SetWaterLevelZ_Func(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelTitleHUD {
	Unknown DefaultSceneRoot; //  0x4b0 Size(8)
	Unknown MediaSoundComponent; //  0x4b8 Size(8)
	struct FMulticastInlineDelegate EventDispatcher_PlayLobbySo; //  0x4c0 Size(10)
	struct FMulticastInlineDelegate EventDispatcher_StopLobbySo; //  0x4d0 Size(10)

	void EventDispatcher_StopLobbySod(); // Function B.B.EventDispatcher_StopLobbySo(Public|Delegate|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelAreaSkillZoneWetFog {
	Unknown UberGraphFrame; //  0x388 Size(8)

	void ActivateEffect(Unknown Character); // Function B.B.ActivateEffect(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileMolotovFireCell {
	Unknown UberGraphFrame; //  0x398 Size(8)
	float TextureScale; //  0x3a0 Size(4)
	float BurnArea; //  0x3a4 Size(4)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown UberGraphFrame; //  0x22f0 Size(8)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass B.B
struct UB : UBravoHotelLoadingWidget {
	Unknown UberGraphFrame; //  0x2a0 Size(8)
	Unknown HorizontalBox_1; //  0x2a8 Size(8)
	Unknown Image_bg; //  0x2b0 Size(8)
	Unknown RichTextBlock; //  0x2b8 Size(8)
	Unknown RichTextBlock_Title; //  0x2c0 Size(8)
	Unknown Throbber_1; //  0x2c8 Size(8)
	Unknown VerticalBox_2; //  0x2d0 Size(8)
	Unknown Textures; //  0x2d8 Size(10)
	Unknown Game; //  0x2e8 Size(8)
	struct FString TempString; //  0x2f0 Size(10)
	char Key; //  0x300 Size(1)
	int32_t RandomTemp; //  0x304 Size(4)
	int32_t ImageIndex; //  0x308 Size(4)
	int32_t TitleIndex; //  0x30c Size(4)

	void SetInfo(Unknown Type, Unknown& OutData); // Function B.B.SetInfo(Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMK3DSpectatorPawn {
	Unknown UberGraphFrame; //  0x3c0 Size(8)
	Unknown FreeCam; //  0x3c8 Size(8)
	Unknown SpringArm; //  0x3d0 Size(8)
	Unknown ReplayMainWidget; //  0x3d8 Size(8)
	Unknown ViewMode; //  0x3e0 Size(1)

	void GetReplayWidget(Unknown& ReplayMainWidget); // Function B.B.GetReplayWidget(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown UberGraphFrame; //  0xcf8 Size(8)
	Unknown SplashParticleComp; //  0xd00 Size(8)
	Unknown PlaneParticleComp; //  0xd08 Size(8)
	Unknown TimerHandle_RemoveAllWaterParticle; //  0xd10 Size(8)

	void ReceiveTick(float DeltaSeconds); // Function B.B.ReceiveTick(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelTransportDropBoxActor {
	Unknown UberGraphFrame; //  0x4a0 Size(8)
	float OverWater_CV_OverWater_77012AB948B572A268E63583418444D0; //  0x4a8 Size(4)
	Unknown OverWater__Direction_77012AB948B572A268E63583418444D0; //  0x4ac Size(1)
	Unknown OverWater; //  0x4b0 Size(8)
	float HittingWater_CV_OverWater_7E5F9D2E4D0DDDC70F2F67AD035A6212; //  0x4b8 Size(4)
	Unknown HittingWater__Direction_7E5F9D2E4D0DDDC70F2F67AD035A6212; //  0x4bc Size(1)
	Unknown HittingWater; //  0x4c0 Size(8)
	float LandingTimer; //  0x4c8 Size(4)
	Unknown ItemResult; //  0x4d0 Size(10)
	float ParachuteTimer; //  0x4e0 Size(4)
	float LandingDelay; //  0x4e4 Size(4)
	float ForceLandingDelaySeconds; //  0x4e8 Size(4)
	char bLandedOnGround; //  0x4ec Size(1)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct UB : USaveGame {
	Unknown WearableItemList; //  0x28 Size(10)
	Unknown CustomItemList; //  0x38 Size(10)
	Unknown WeaponItemList; //  0x48 Size(10)
	Unknown InBackpackItemList; //  0x58 Size(10)
	Unknown AppearanceInfo; //  0x68 Size(14)
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown B; //  0xd18 Size(8)
	Unknown B; //  0xd20 Size(8)
	Unknown B; //  0xd28 Size(8)
	Unknown B; //  0xd30 Size(8)
	Unknown BravoHotelVehicleSeat04; //  0xd38 Size(8)
	Unknown BravoHotelVehicleSeat03; //  0xd40 Size(8)
	Unknown BravoHotelVehicleSeat02; //  0xd48 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelSpectatorPawn {
	Unknown UberGraphFrame; //  0x3d0 Size(8)
	Unknown Camera; //  0x3d8 Size(8)
	Unknown SpringArm; //  0x3e0 Size(8)
	char bKillCam; //  0x3e8 Size(1)

	void TargetSetting(); // Function B.B.TargetSetting(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	Unknown Tire_RL; //  0x460 Size(8)
	Unknown Tire_FL; //  0x468 Size(8)
	Unknown Tire_RR; //  0x470 Size(8)
	Unknown Tire_FR; //  0x478 Size(8)
	Unknown SkeletalMesh; //  0x480 Size(8)
	Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMK3DReplayController {
	Unknown UberGraphFrame; //  0xab0 Size(8)
	Unknown B; //  0xab8 Size(8)
	int32_t OpenedWidgetNum; //  0xac0 Size(4)
	Unknown ViewMode; //  0xac4 Size(1)

	Unknown GetHUDInteractionComponent(); // Function B.B.GetHUDInteractionComponent(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelSpectatorController {
	Unknown UberGraphFrame; //  0x13b8 Size(8)
	Unknown Observer; //  0x13c0 Size(8)
	char PlayingKillCam; //  0x13c8 Size(1)
	Unknown AfterGameHUD; //  0x13d0 Size(8)
	Unknown GameInstanceRef; //  0x13d8 Size(8)
	char bKillCamFinish; //  0x13e0 Size(1)

	void SetObserver(); // Function B.B.SetObserver(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : UActor {
	Unknown Box; //  0x310 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown Sphere; //  0x420 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : ABHPersonalSupplyBox {
	Unknown UberGraphFrame; //  0x378 Size(8)
	Unknown StaticMeshUnassigned; //  0x380 Size(8)
	Unknown StaticMeshAssigned; //  0x388 Size(8)
	float LandingTimer; //  0x390 Size(4)
	char bLanding; //  0x394 Size(1)
	Unknown ItemResult; //  0x398 Size(10)
	float ParachuteTimer; //  0x3a8 Size(4)
	float VisibleValue; //  0x3ac Size(4)
	char VisibleAnimationState; //  0x3b0 Size(1)

	void ReceiveTick(float DeltaSeconds); // Function B.B.ReceiveTick(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelBrokenEquipment {
	Unknown UberGraphFrame; //  0x330 Size(8)
	float Power_Min; //  0x338 Size(4)
	float Power_Max; //  0x33c Size(4)
	float FlyAngle; //  0x340 Size(4)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelInventoryCharacter {
	Unknown SpotLight1; //  0x3d8 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileGrenadeMolotovCocktail {
	Unknown UberGraphFrame; //  0x7f0 Size(8)
	float TextureScale; //  0x7f8 Size(4)
	float CollisionSize; //  0x7fc Size(4)

	void ActiveThrowingProjectileMainEffect(); // Function B.B.ActiveThrowingProjectileMainEffect(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileMolotovFireCell {
	Unknown UberGraphFrame; //  0x398 Size(8)
	float TextureScale; //  0x3a0 Size(4)
	float BurnArea; //  0x3a4 Size(4)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelHeartBeatSensor {
	Unknown UberGraphFrame; //  0x1bf0 Size(8)
	Unknown InternalPP; //  0x1bf8 Size(8)
	Unknown EffectMaterial; //  0x1c00 Size(8)
	char IsActive; //  0x1c08 Size(1)
	Unknown mRadialBlur; //  0x1c10 Size(8)
	Unknown iRadialBlur; //  0x1c18 Size(8)
	Unknown Radial; //  0x1c20 Size(38)
	float Radial; //  0x1c58 Size(4)
	int32_t Radial; //  0x1c5c Size(4)
	Unknown Radial; //  0x1c60 Size(8)
	Unknown Radial; //  0x1c68 Size(8)
	Unknown Native; //  0x1c70 Size(5c0)
	Unknown mSelectiveColor; //  0x2230 Size(8)
	Unknown iSelectiveColor; //  0x2238 Size(8)
	Unknown Selective; //  0x2240 Size(38)
	Unknown Selective; //  0x2278 Size(10)
	float Selective; //  0x2288 Size(4)
	float Selective; //  0x228c Size(4)
	float Selective; //  0x2290 Size(4)
	float CurrentBlur; //  0x2294 Size(4)
	float CurrentSelective; //  0x2298 Size(4)
	float FadeInSpeed; //  0x229c Size(4)
	float FadeOutSpeed; //  0x22a0 Size(4)
	Unknown mMonochrome; //  0x22a8 Size(8)
	Unknown iMonochrome; //  0x22b0 Size(8)
	Unknown Monochrome; //  0x22b8 Size(38)
	Unknown Monochrome; //  0x22f0 Size(10)
	Unknown MBlackColor; //  0x2300 Size(8)
	Unknown IBlackColor; //  0x2308 Size(8)
	Unknown BlackColor; //  0x2310 Size(38)
	float ActiveDelayTime; //  0x2348 Size(4)
	Unknown MainWidget; //  0x2350 Size(8)
	Unknown TopWidget; //  0x2358 Size(8)

	void GetTopWidget(Unknown& TopWidget); // Function B.B.GetTopWidget(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct UB : UDragDropOperation {
	Unknown WidgetReference; //  0x88 Size(8)
	Unknown InventorySlotWidgetKind; //  0x90 Size(1)
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotel3DViewActor {
	Unknown UberGraphFrame; //  0x310 Size(8)
	Unknown PointLight3; //  0x318 Size(8)
	Unknown PointLight2; //  0x320 Size(8)
	Unknown SpotLight; //  0x328 Size(8)
	Unknown PointLight1; //  0x330 Size(8)
	Unknown BravoHotelSceneCaptureCompo; //  0x338 Size(8)
	Unknown PointLight; //  0x340 Size(8)
	Unknown SpotLight2; //  0x348 Size(8)
	Unknown Cube; //  0x350 Size(8)
	Unknown CustomizableSkeletal; //  0x358 Size(8)
	Unknown SkeletalMesh; //  0x360 Size(8)
	Unknown Camera; //  0x368 Size(8)
	Unknown Scene; //  0x370 Size(8)
	Unknown CharacterRef; //  0x378 Size(8)
	Unknown PreviewWeapons; //  0x380 Size(10)
	char Enab; //  0x390 Size(1)
	Unknown TargetAccel; //  0x394 Size(c)
	Unknown CurrentAccel; //  0x3a0 Size(c)

	void Resize(int32_t SizeX, int32_t SizeY); // Function B.B.Resize(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct UB : ULadderComponent {
	Unknown UberGraphFrame; //  0x210 Size(8)
	char NeedToChangeHand; //  0x218 Size(1)
	float CrntAxisValue; //  0x21c Size(4)
	float GoalLocationZ; //  0x220 Size(4)
	char NeedMoveOnLadder; //  0x224 Size(1)
	float MotionMinAlpha; //  0x228 Size(4)
	char CanStopMotion; //  0x22c Size(1)
	float DirectSnapLocZ; //  0x230 Size(4)
	float DeltaSecond; //  0x234 Size(4)
	float LastSecond; //  0x238 Size(4)
	int32_t AdditionalStepCount; //  0x23c Size(4)

	void CalcLadderInteractionType(); // Function B.B.CalcLadderInteractionType(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown UberGraphFrame; //  0x3ac8 Size(8)
	Unknown Listener; //  0x3ad0 Size(8)
	float _P_Cam_Z_NewTrack_0_898B65D1462B08609DA61C81A7B52313; //  0x3ad8 Size(4)
	Unknown _P_Cam_Z__Direction_898B65D1462B08609DA61C81A7B52313; //  0x3adc Size(1)
	Unknown 3P_Cam_Z; //  0x3ae0 Size(8)
	Unknown CriticalUITimeHandler; //  0x3ae8 Size(8)
	Unknown DyingUITimeHandler; //  0x3af0 Size(8)
	Unknown ClothHandler; //  0x3af8 Size(8)
	Unknown ClothBallObject; //  0x3b00 Size(8)
	Unknown BallHandleLocation; //  0x3b08 Size(c)
	float GamepadInputModifier; //  0x3b14 Size(4)
	float BaseTurnRate; //  0x3b18 Size(4)
	float BaseLookUpRate; //  0x3b1c Size(4)
	Unknown PerkLevelUpWidgets; //  0x3b20 Size(10)
	float PerkLevelUpWidthDepth; //  0x3b30 Size(4)
	Unknown AmplifierEffect; //  0x3b38 Size(8)
	float Cam_Shake_Radius; //  0x3b40 Size(4)
	Unknown MainWidget; //  0x3b48 Size(8)
	Unknown HeartBeatSensorEffect; //  0x3b50 Size(8)

	char IsEnableSpawnSupplyBox(Unknown TargetActor, struct FString& OutResult); // Function B.B.IsEnableSpawnSupplyBox(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown UberGraphFrame; //  0x420 Size(8)
	Unknown Sphere; //  0x428 Size(8)

	void SetTexture5mm(); // Function B.B.SetTexture5mm(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelSkillTargetingBombing {
	Unknown UberGraphFrame; //  0x368 Size(8)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown UberGraphFrame; //  0x22f0 Size(8)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : UActor {
	Unknown UberGraphFrame; //  0x310 Size(8)
	Unknown WorldViewCamera; //  0x318 Size(8)
	Unknown DefaultSceneRoot; //  0x320 Size(8)
	float DeltaTime; //  0x328 Size(4)
	char bIsBackgroundScene; //  0x32c Size(1)

	void CheckWorldViewCameraLocatio(); // Function B.B.CheckWorldViewCameraLocatio(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABattleRoyaleGameMode_Login {
	Unknown DefaultSceneRoot; //  0x638 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelLobbyCharacter {
	Unknown UberGraphFrame; //  0x3a70 Size(8)
	Unknown Box; //  0x3a78 Size(8)
	int32_t PawnIndex; //  0x3a80 Size(4)
	Unknown BravoHotelPlayerStateClass; //  0x3a88 Size(8)
	char bReady; //  0x3a90 Size(1)
	char bMatchSuccess; //  0x3a91 Size(1)
	char bIsFaceCustomizing; //  0x3a92 Size(1)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass B.B
struct UB : UBravoHotelLobbyWidget_Web {
	Unknown UberGraphFrame; //  0x4c8 Size(8)
	Unknown FadeOutNotice; //  0x4d0 Size(8)
	Unknown Bg; //  0x4d8 Size(8)
	Unknown Bg_2; //  0x4e0 Size(8)
	Unknown CanvasPanel_GameNotice; //  0x4e8 Size(8)
	Unknown CanvasPanel_PrefetchingProgress; //  0x4f0 Size(8)
	Unknown Image; //  0x4f8 Size(8)
	Unknown Image_145; //  0x500 Size(8)
	Unknown ProgressText; //  0x508 Size(8)
	Unknown U; //  0x510 Size(8)
	Unknown WeaponList_1; //  0x518 Size(10)
	Unknown CharacterInfoWidgetList; //  0x528 Size(10)
	int32_t PartySize; //  0x538 Size(4)
	Unknown EquipmentTransition; //  0x540 Size(8)
	char BindParticle; //  0x548 Size(1)
	Unknown EffectPool; //  0x550 Size(10)
	struct FMulticastInlineDelegate EventDispatcher_Mov; //  0x560 Size(10)
	struct FString CurrentTab; //  0x570 Size(10)

	void CheckOptionChanged(); // Function B.B.CheckOptionChanged(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass B.B
struct UB : UBravoHotelCreateCharacterWidget {
	Unknown UberGraphFrame; //  0x308 Size(8)
	Unknown CoherentUIGTWidget_90; //  0x310 Size(8)
	Unknown U; //  0x318 Size(8)
	Unknown CurrentSceneType; //  0x320 Size(1)

	void Construct(); // Function B.B.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown Sphere; //  0x420 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelOutGameParachuteActor {
	Unknown UberGraphFrame; //  0x310 Size(8)
	Unknown ParachuteBag_SkeletalMesh; //  0x318 Size(8)
	Unknown Parachute_SkeletalMesh; //  0x320 Size(8)
	Unknown DefaultSceneRoot; //  0x328 Size(8)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelLobbyPlayerControt {
	Unknown UberGraphFrame; //  0x720 Size(8)
	Unknown B; //  0x728 Size(8)
	struct FMulticastInlineDelegate EventDispatcher_PlayLobbySo; //  0x730 Size(10)
	struct FMulticastInlineDelegate EventDispatcher_StopLobbySo; //  0x740 Size(10)
	Unknown MediaSoundComponent; //  0x750 Size(8)
	Unknown OperationMessageWidget; //  0x758 Size(8)
	Unknown CurrentSceneType; //  0x760 Size(1)
	Unknown Lobb; //  0x768 Size(8)

	void CanInput(char& bCheck); // Function B.B.CanInput(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelAreaSkillZoneHacking {
	Unknown UberGraphFrame; //  0x368 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : UActor {
	Unknown UberGraphFrame; //  0x310 Size(8)
	Unknown WorldViewCamera; //  0x318 Size(8)
	Unknown FarCamera; //  0x320 Size(8)
	Unknown NearCamera; //  0x328 Size(8)
	Unknown DefaultSceneRoot; //  0x330 Size(8)
	Unknown CharacterRef; //  0x338 Size(8)
	Unknown TargetNearCameraTransform; //  0x340 Size(30)
	float DeltaTime; //  0x370 Size(4)
	Unknown TargetFarCameraTransform; //  0x380 Size(30)
	Unknown PlayerControllerRef; //  0x3b0 Size(8)
	char bIsBackgroundScene; //  0x3b8 Size(1)
	Unknown WinTeamCharacters; //  0x3c0 Size(10)
	Unknown DuoLocation_Near; //  0x3d0 Size(10)
	Unknown CharacterOriginLocation; //  0x3e0 Size(c)
	Unknown DuoRotation_Near; //  0x3f0 Size(10)
	Unknown DuoLocation_Far; //  0x400 Size(10)
	Unknown DuoRotation_Far; //  0x410 Size(10)
	Unknown TrioLocation_Near; //  0x420 Size(10)
	Unknown TrioRotation_Near; //  0x430 Size(10)
	Unknown TrioLocation_Far; //  0x440 Size(10)
	Unknown TrioRotation_Far; //  0x450 Size(10)
	Unknown SquadLocation_Near; //  0x460 Size(10)
	Unknown SquadRotation_Near; //  0x470 Size(10)
	Unknown SquadLocation_Far; //  0x480 Size(10)
	Unknown SquadRotation_Far; //  0x490 Size(10)
	Unknown CharacterOriginRotation; //  0x4a0 Size(c)

	void ResetCharacter(); // Function B.B.ResetCharacter(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct UB : USaveGame {
	char bHideWorkInProgress; //  0x28 Size(1)
	Unknown MainTab; //  0x29 Size(1)
	Unknown WeaponSubTab; //  0x2a Size(1)
	Unknown AttachmentSubTab; //  0x2b Size(1)
	Unknown WearableSubTab; //  0x2c Size(1)
	Unknown CustomSubTab; //  0x2d Size(1)
	Unknown GearSubTab; //  0x2e Size(1)
};

// BlueprintGeneratedClass B.B
struct AB : UActor {
	Unknown UberGraphFrame; //  0x310 Size(8)
	Unknown FirstCamera; //  0x318 Size(8)
	Unknown FirstSpringArm; //  0x320 Size(8)
	Unknown ThirdCamera; //  0x328 Size(8)
	Unknown SecondCamera; //  0x330 Size(8)
	Unknown DefaultSceneRoot; //  0x338 Size(8)
	float DeltaSeconds; //  0x340 Size(4)
	Unknown TargetDeltaLocation; //  0x344 Size(c)
	Unknown Character; //  0x350 Size(8)
	float LowerBoundCameraHeightDelta; //  0x358 Size(4)
	char bHeightUpdateFinished; //  0x35c Size(1)
	float ThridCameraRotationYawDelta; //  0x360 Size(4)
	float ThirdCameraMinHeight; //  0x364 Size(4)
	float FirstSpringArmDeltaZ; //  0x368 Size(4)

	void CheckThirdCameraLocationRange(); // Function B.B.CheckThirdCameraLocationRange(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct UB : UHUDInteractionComponent {
	Unknown UberGraphFrame; //  0xf0 Size(8)
	Unknown PlayerController; //  0xf8 Size(8)
	char bAlreadySetOptionWidget; //  0x100 Size(1)
	float defaultContrast; //  0x104 Size(4)
	float defaultMaxBrightness; //  0x108 Size(4)
	float defaultMinBrightness; //  0x10c Size(4)
	float MinBrightness; //  0x110 Size(4)
	float MaxBrightness; //  0x114 Size(4)
	float Contrast; //  0x118 Size(4)
	char bUsePostProcessVolumeOption; //  0x11c Size(1)
	float ColorGradingGlobalGamma; //  0x120 Size(4)
	float FilmToeIntensity; //  0x124 Size(4)
	char IsInWidget; //  0x128 Size(1)
	char bInputModeUI; //  0x129 Size(1)
	Unknown InputActionsToBlock; //  0x130 Size(10)

	void CheckAnyAction(char& AnyAction); // Function B.B.CheckAnyAction(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct UB : UB {
	Unknown UberGraphFrame; //  0x140 Size(8)
	char bHasJustClosed_1; //  0x148 Size(1)
	float defaultContrast_1; //  0x14c Size(4)
	float defaultMaxBrightness_1; //  0x150 Size(4)
	float defaultMinBrightness_1; //  0x154 Size(4)
	float MinBrightness_1; //  0x158 Size(4)
	float MaxBrightness_1; //  0x15c Size(4)
	float Contrast_1; //  0x160 Size(4)
	char bUsePostProcessVolumeOption_1; //  0x164 Size(1)
	float ColorGradingGlobalGamma_1; //  0x168 Size(4)
	float FilmToeIntensity_1; //  0x16c Size(4)
	char IsInWidget_1; //  0x170 Size(1)
	char bInputModeUI_1; //  0x171 Size(1)
	Unknown InputActionsToBlock_1; //  0x178 Size(10)

	void CheckAnyAction(char& AnyAction); // Function B.B.CheckAnyAction(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelPlayerController {
	Unknown UberGraphFrame; //  0x13a0 Size(8)
	Unknown B; //  0x13a8 Size(8)
	Unknown SmartPingSystemComponent; //  0x13b0 Size(8)
	Unknown MapSize; //  0x13b8 Size(c)
	char IsInWidget; //  0x13c4 Size(1)
	Unknown InputActionsToBlock; //  0x13c8 Size(10)
	Unknown BlueZone; //  0x13d8 Size(8)
	Unknown PhoneticAlphabetTable_NATO; //  0x13e0 Size(10)
	char bHasJustClosed; //  0x13f0 Size(1)
	char bLineTrace; //  0x13f1 Size(1)
	Unknown U; //  0x13f8 Size(8)
	Unknown LocalScreenPosition; //  0x1400 Size(8)
	Unknown MaxViewportSize; //  0x1408 Size(8)
	char ReverseSide; //  0x1410 Size(1)
	Unknown SavedInventory; //  0x1418 Size(8)
	Unknown DefaultItemList; //  0x1420 Size(10)
	struct FString SavedInventorySlotName; //  0x1430 Size(10)
	char bLoadInventoryData; //  0x1440 Size(1)
	char bOpenSystemMenu; //  0x1441 Size(1)
	float MinBrightness; //  0x1444 Size(4)
	float MaxBrightness; //  0x1448 Size(4)
	float Contrast; //  0x144c Size(4)
	char bUsePostProcessVolumeOption; //  0x1450 Size(1)
	float FilmToeIntensity; //  0x1454 Size(4)
	float ColorGradingGlobalGamma; //  0x1458 Size(4)
	char bInputModeUI; //  0x145c Size(1)
	Unknown Timer; //  0x1460 Size(8)
	Unknown Doub; //  0x1468 Size(8)
	float CheckTime; //  0x1470 Size(4)
	float Doub; //  0x1474 Size(4)
	char CheckDoubleClick; //  0x1478 Size(1)
	Unknown TempLocation; //  0x147c Size(c)
	Unknown NameWidgets; //  0x1488 Size(10)
	int32_t CurrentNameWidgetCount; //  0x1498 Size(4)
	char bNameTooltipMode; //  0x149c Size(1)
	int32_t SmartPingTypeIndex; //  0x14a0 Size(4)
	char EableSmartPing; //  0x14a4 Size(1)
	char PingLock; //  0x14a5 Size(1)
	Unknown OperationMessageWidget; //  0x14a8 Size(8)
	Unknown SelectionMenu; //  0x14b0 Size(8)
	char IsVisibleSelectionMenu; //  0x14b8 Size(1)
	Unknown BoostItemList; //  0x14c0 Size(50)
	char IgnoreMenu; //  0x1510 Size(1)

	char HasPerkDeckWidget(); // Function B.B.HasPerkDeckWidget(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown UberGraphFrame; //  0xd18 Size(8)
	Unknown BravoHotelVehicleTire_RR; //  0xd20 Size(8)
	Unknown BravoHotelVehicleTire_RL; //  0xd28 Size(8)
	Unknown BravoHotelVehicleTire_FR; //  0xd30 Size(8)
	Unknown BravoHotelVehicleTire_FL; //  0xd38 Size(8)
	Unknown VehicleSeatCollision1; //  0xd40 Size(8)
	Unknown VehicleSeatCollision; //  0xd48 Size(8)
	Unknown BravoHotelVehicleSeat02; //  0xd50 Size(8)
	Unknown ; //  0xd58 Size(8)

	void ReceiveTick(float DeltaSeconds); // Function B.B.ReceiveTick(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass B.B
struct UB : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown U; //  0x250 Size(8)
	struct FMulticastInlineDelegate OnTriedToLogin; //  0x258 Size(10)
	struct FMulticastInlineDelegate OnTriedToTestLogin; //  0x268 Size(10)
	char bEnableDevServer; //  0x278 Size(1)
	struct FMulticastInlineDelegate OnMoveLobby; //  0x280 Size(10)
	struct FMulticastInlineDelegate OnPlayBGM; //  0x290 Size(10)
	struct FMulticastInlineDelegate OnSaveUserData; //  0x2a0 Size(10)
	char bPlayBGM; //  0x2b0 Size(1)
	char bRememberMe; //  0x2b1 Size(1)
	struct FMulticastInlineDelegate OnSkipTitle; //  0x2b8 Size(10)

	void HideExitPopup(); // Function B.B.HideExitPopup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown BravoHotelVehicleTire_RR; //  0xd18 Size(8)
	Unknown BravoHotelVehicleTire_RL; //  0xd20 Size(8)
	Unknown BravoHotelVehicleTire_FR; //  0xd28 Size(8)
	Unknown BravoHotelVehicleTire_FL; //  0xd30 Size(8)
	Unknown B; //  0xd38 Size(8)
	Unknown B; //  0xd40 Size(8)
	Unknown BravoHotelVehicleSeat04; //  0xd48 Size(8)
	Unknown BravoHotelVehicleSeat03; //  0xd50 Size(8)
	Unknown BravoHotelVehicleSeat02; //  0xd58 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	Unknown Tire_RL; //  0x460 Size(8)
	Unknown Tire_FL; //  0x468 Size(8)
	Unknown Tire_RR; //  0x470 Size(8)
	Unknown Tire_FR; //  0x478 Size(8)
	Unknown SkeletalMesh; //  0x480 Size(8)
	Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown Sphere; //  0x420 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown ScopeWidget_Background; //  0x420 Size(8)
	Unknown Cube; //  0x428 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown UberGraphFrame; //  0xcf8 Size(8)

	void ReceiveUnpossessed(Unknown OldController); // Function B.B.ReceiveUnpossessed(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelSkillTargetingNuclear {
	Unknown UberGraphFrame; //  0x358 Size(8)

	void UpdateTargetSize(); // Function B.B.UpdateTargetSize(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelAircraftBomber {
	Unknown UberGraphFrame; //  0x320 Size(8)
	Unknown ParticleSystem; //  0x328 Size(8)
	Unknown S; //  0x330 Size(8)
	Unknown DefaultSceneRoot; //  0x338 Size(8)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown UberGraphFrame; //  0x22f0 Size(8)

	void GetTargetEffectorLocationR(Unknown& TargetEffectorLocationR); // Function B.B.GetTargetEffectorLocationR(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown UberGraphFrame; //  0x1ff0 Size(8)
	Unknown ParticleSystem; //  0x1ff8 Size(8)

	void K2_OnEquip(); // Function B.B.K2_OnEquip(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown UberGraphFrame; //  0x1ff0 Size(8)
	Unknown ParticleSystem; //  0x1ff8 Size(8)

	void K2_OnEquip(); // Function B.B.K2_OnEquip(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown UberGraphFrame; //  0x22f0 Size(8)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown BravoHotelShellCasingArrow_Clip; //  0x22f0 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileMolotovFireCell {
	Unknown UberGraphFrame; //  0x398 Size(8)
	float TextureScale; //  0x3a0 Size(4)
	float BurnArea; //  0x3a4 Size(4)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : UActor {
	Unknown UberGraphFrame; //  0x310 Size(8)
	Unknown StaticMesh; //  0x318 Size(8)
	Unknown DefaultSceneRoot; //  0x320 Size(8)
	float DestructibleMeshLifeTime; //  0x328 Size(4)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown UberGraphFrame; //  0x22f0 Size(8)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileBullet {
	Unknown UberGraphFrame; //  0x520 Size(8)
	Unknown ParticleSystem; //  0x528 Size(8)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileGrenadeMolotovCocktail {
	Unknown UberGraphFrame; //  0x7f0 Size(8)
	float TextureScale; //  0x7f8 Size(4)
	float CollisionSize; //  0x7fc Size(4)

	void ActiveThrowingProjectileMainEffect(); // Function B.B.ActiveThrowingProjectileMainEffect(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	Unknown Tire_RL; //  0x460 Size(8)
	Unknown Tire_FL; //  0x468 Size(8)
	Unknown Tire_RR; //  0x470 Size(8)
	Unknown Tire_FR; //  0x478 Size(8)
	Unknown SkeletalMesh; //  0x480 Size(8)
	Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	Unknown Tire_RL; //  0x460 Size(8)
	Unknown Tire_FL; //  0x468 Size(8)
	Unknown Tire_RR; //  0x470 Size(8)
	Unknown Tire_FR; //  0x478 Size(8)
	Unknown SkeletalMesh; //  0x480 Size(8)
	Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	Unknown Tire_RL; //  0x460 Size(8)
	Unknown Tire_FL; //  0x468 Size(8)
	Unknown Tire_RR; //  0x470 Size(8)
	Unknown Tire_FR; //  0x478 Size(8)
	Unknown SkeletalMesh; //  0x480 Size(8)
	Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	Unknown Tire_RL; //  0x460 Size(8)
	Unknown Tire_FL; //  0x468 Size(8)
	Unknown Tire_RR; //  0x470 Size(8)
	Unknown Tire_FR; //  0x478 Size(8)
	Unknown SkeletalMesh; //  0x480 Size(8)
	Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	Unknown Tire_RL; //  0x460 Size(8)
	Unknown Tire_FL; //  0x468 Size(8)
	Unknown Tire_RR; //  0x470 Size(8)
	Unknown Tire_FR; //  0x478 Size(8)
	Unknown SkeletalMesh; //  0x480 Size(8)
	Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown BravoHotelVehicleTire_RR; //  0xd00 Size(8)
	Unknown BravoHotelVehicleTire_RL; //  0xd08 Size(8)
	Unknown BravoHotelVehicleTire_FR; //  0xd10 Size(8)
	Unknown BravoHotelVehicleTire_FL; //  0xd18 Size(8)
	Unknown VehicleSeatCollision1; //  0xd20 Size(8)
	Unknown VehicleSeatCollision; //  0xd28 Size(8)
	Unknown BravoHotelVehicleSeat01; //  0xd30 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	Unknown Tire_RL; //  0x460 Size(8)
	Unknown Tire_FL; //  0x468 Size(8)
	Unknown Tire_RR; //  0x470 Size(8)
	Unknown Tire_FR; //  0x478 Size(8)
	Unknown SkeletalMesh; //  0x480 Size(8)
	Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	Unknown Tire_RL; //  0x460 Size(8)
	Unknown Tire_FL; //  0x468 Size(8)
	Unknown Tire_RR; //  0x470 Size(8)
	Unknown Tire_FR; //  0x478 Size(8)
	Unknown SkeletalMesh; //  0x480 Size(8)
	Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	Unknown Tire_RL; //  0x460 Size(8)
	Unknown Tire_FL; //  0x468 Size(8)
	Unknown Tire_RR; //  0x470 Size(8)
	Unknown Tire_FR; //  0x478 Size(8)
	Unknown SkeletalMesh; //  0x480 Size(8)
	Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown UberGraphFrame; //  0xd18 Size(8)
	Unknown BravoHotelVehicleTire_RR; //  0xd20 Size(8)
	Unknown BravoHotelVehicleTire_RL; //  0xd28 Size(8)
	Unknown BravoHotelVehicleTire_FR; //  0xd30 Size(8)
	Unknown BravoHotelVehicleTire_FL; //  0xd38 Size(8)
	Unknown B; //  0xd40 Size(8)
	Unknown B; //  0xd48 Size(8)
	Unknown B; //  0xd50 Size(8)
	Unknown B; //  0xd58 Size(8)
	Unknown BravoHotelVehicleSeat04; //  0xd60 Size(8)
	Unknown BravoHotelVehicleSeat03; //  0xd68 Size(8)
	Unknown BravoHotelVehicleSeat02; //  0xd70 Size(8)

	void ReceiveTick(float DeltaSeconds); // Function B.B.ReceiveTick(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	Unknown Tire_RL; //  0x460 Size(8)
	Unknown Tire_FL; //  0x468 Size(8)
	Unknown Tire_RR; //  0x470 Size(8)
	Unknown Tire_FR; //  0x478 Size(8)
	Unknown SkeletalMesh; //  0x480 Size(8)
	Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	Unknown Tire_RL; //  0x460 Size(8)
	Unknown Tire_FL; //  0x468 Size(8)
	Unknown Tire_RR; //  0x470 Size(8)
	Unknown Tire_FR; //  0x478 Size(8)
	Unknown SkeletalMesh; //  0x480 Size(8)
	Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	Unknown Tire_RL; //  0x460 Size(8)
	Unknown Tire_FL; //  0x468 Size(8)
	Unknown Tire_RR; //  0x470 Size(8)
	Unknown Tire_FR; //  0x478 Size(8)
	Unknown SkeletalMesh; //  0x480 Size(8)
	Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	Unknown Tire_RL; //  0x460 Size(8)
	Unknown Tire_FL; //  0x468 Size(8)
	Unknown Tire_RR; //  0x470 Size(8)
	Unknown Tire_FR; //  0x478 Size(8)
	Unknown SkeletalMesh; //  0x480 Size(8)
	Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown UberGraphFrame; //  0xcf8 Size(8)
	Unknown Handle_IsAnyHit; //  0xd00 Size(8)
	char IsAnyHit; //  0xd08 Size(1)
	Unknown LastHitActor; //  0xd10 Size(8)

	void CheckLastHitActor(); // Function B.B.CheckLastHitActor(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	Unknown Tire_RL; //  0x460 Size(8)
	Unknown Tire_FL; //  0x468 Size(8)
	Unknown Tire_RR; //  0x470 Size(8)
	Unknown Tire_FR; //  0x478 Size(8)
	Unknown SkeletalMesh; //  0x480 Size(8)
	Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	Unknown Tire_RL; //  0x460 Size(8)
	Unknown Tire_FL; //  0x468 Size(8)
	Unknown Tire_RR; //  0x470 Size(8)
	Unknown Tire_FR; //  0x478 Size(8)
	Unknown SkeletalMesh; //  0x480 Size(8)
	Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : ADestructibleActor {
	Unknown UberGraphFrame; //  0x328 Size(8)
	float OpacityTime_Opacity_Percent_6C96418549465FDC90E47A873A3B4734; //  0x330 Size(4)
	float OpacityTime_Opacity_6C96418549465FDC90E47A873A3B4734; //  0x334 Size(4)
	Unknown OpacityTime__Direction_6C96418549465FDC90E47A873A3B4734; //  0x338 Size(1)
	Unknown OpacityTime; //  0x340 Size(8)
	float Opacity; //  0x348 Size(4)
	float DM_Opacity; //  0x34c Size(4)
	char Opacity_Bool; //  0x350 Size(1)

	void OpacityTime__FinishedFunc(); // Function B.B.OpacityTime__FinishedFunc(BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown BravoHotelVehicleTire_RR; //  0xd18 Size(8)
	Unknown BravoHotelVehicleTire_RL; //  0xd20 Size(8)
	Unknown BravoHotelVehicleTire_FR; //  0xd28 Size(8)
	Unknown BravoHotelVehicleTire_FL; //  0xd30 Size(8)
	Unknown B; //  0xd38 Size(8)
	Unknown B; //  0xd40 Size(8)
	Unknown BravoHotelVehicleSeat04; //  0xd48 Size(8)
	Unknown BravoHotelVehicleSeat03; //  0xd50 Size(8)
	Unknown BravoHotelVehicleSeat02; //  0xd58 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown BravoHotelVehicleTire_RR; //  0xd18 Size(8)
	Unknown BravoHotelVehicleTire_RL; //  0xd20 Size(8)
	Unknown BravoHotelVehicleTire_FR; //  0xd28 Size(8)
	Unknown BravoHotelVehicleTire_FL; //  0xd30 Size(8)
	Unknown B; //  0xd38 Size(8)
	Unknown B; //  0xd40 Size(8)
	Unknown BravoHotelVehicleSeat04; //  0xd48 Size(8)
	Unknown BravoHotelVehicleSeat03; //  0xd50 Size(8)
	Unknown BravoHotelVehicleSeat02; //  0xd58 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown BravoHotelVehicleTire_RR; //  0xd18 Size(8)
	Unknown BravoHotelVehicleTire_RL; //  0xd20 Size(8)
	Unknown BravoHotelVehicleTire_FR; //  0xd28 Size(8)
	Unknown BravoHotelVehicleTire_FL; //  0xd30 Size(8)
	Unknown B; //  0xd38 Size(8)
	Unknown B; //  0xd40 Size(8)
	Unknown BravoHotelVehicleSeat04; //  0xd48 Size(8)
	Unknown BravoHotelVehicleSeat03; //  0xd50 Size(8)
	Unknown BravoHotelVehicleSeat02; //  0xd58 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	Unknown BravoHotelVehicleTire_RR; //  0xd18 Size(8)
	Unknown BravoHotelVehicleTire_RL; //  0xd20 Size(8)
	Unknown BravoHotelVehicleTire_FR; //  0xd28 Size(8)
	Unknown BravoHotelVehicleTire_FL; //  0xd30 Size(8)
	Unknown B; //  0xd38 Size(8)
	Unknown B; //  0xd40 Size(8)
	Unknown B; //  0xd48 Size(8)
	Unknown B; //  0xd50 Size(8)
	Unknown BravoHotelVehicleSeat04; //  0xd58 Size(8)
	Unknown BravoHotelVehicleSeat03; //  0xd60 Size(8)
	Unknown BravoHotelVehicleSeat02; //  0xd68 Size(8)
	char bSnowy; //  0xd70 Size(1)
};

// BlueprintGeneratedClass B.B
struct UB : UBravoHotelDestructibleCompot {
	Unknown UberGraphFrame; //  0x630 Size(8)
	float DestructibleMeshLifeTime; //  0x638 Size(4)
	char IsLegacyMethodEnable; //  0x63c Size(1)
	float StaticMeshLifeSpanTime; //  0x640 Size(4)
	char GameStarted; //  0x644 Size(1)
	float DefaultHpCache; //  0x648 Size(4)
	char IsDestructedBeforeGameStart; //  0x64c Size(1)
	char Is; //  0x64d Size(1)
	struct FMulticastInlineDelegate DestructEventDispatcher; //  0x650 Size(10)
	float LinearDamping; //  0x660 Size(4)
	float MassInKg; //  0x664 Size(4)
	float AngularDamping; //  0x668 Size(4)
	Unknown ClassType; //  0x66c Size(1)

	void OnRep_IsDestructedBeforeGameStart(); // Function B.B.OnRep_IsDestructedBeforeGameStart(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

