// User B.B
enum class B : uint8 {
	B = 0,
	B = 1,
	B = 2,
	B = 3
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileMolotovFireCell {
	struct Unknown UberGraphFrame; //  0x398 Size(8)
	float TextureScale; //  0x3a0 Size(4)
	float BurnArea; //  0x3a4 Size(4)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelPlayerController {
	struct Unknown UberGraphFrame; //  0x13d8 Size(8)
	struct Unknown B; //  0x13e0 Size(8)
	struct Unknown SmartPingSystemComponent; //  0x13e8 Size(8)
	struct Unknown MapSize; //  0x13f0 Size(c)
	char IsInWidget; //  0x13fc Size(1)
	struct TArray<Unknown> InputActionsToBlock; //  0x1400 Size(10)
	struct Unknown BlueZone; //  0x1410 Size(8)
	struct TArray<Unknown> PhoneticAlphabetTable_NATO; //  0x1418 Size(10)
	char bHasJustClosed; //  0x1428 Size(1)
	char bLineTrace; //  0x1429 Size(1)
	struct Unknown U; //  0x1430 Size(8)
	struct Unknown LocalScreenPosition; //  0x1438 Size(8)
	struct Unknown MaxViewportSize; //  0x1440 Size(8)
	char ReverseSide; //  0x1448 Size(1)
	struct Unknown SavedInventory; //  0x1450 Size(8)
	struct TArray<Unknown> DefaultItemList; //  0x1458 Size(10)
	struct FString SavedInventorySlotName; //  0x1468 Size(10)
	char bLoadInventoryData; //  0x1478 Size(1)
	char bOpenSystemMenu; //  0x1479 Size(1)
	float MinBrightness; //  0x147c Size(4)
	float MaxBrightness; //  0x1480 Size(4)
	float Contrast; //  0x1484 Size(4)
	char bUsePostProcessVolumeOption; //  0x1488 Size(1)
	float FilmToeIntensity; //  0x148c Size(4)
	float ColorGradingGlobalGamma; //  0x1490 Size(4)
	char bInputModeUI; //  0x1494 Size(1)
	struct Unknown Timer; //  0x1498 Size(8)
	struct Unknown DoubleclickTimer; //  0x14a0 Size(8)
	float CheckTime; //  0x14a8 Size(4)
	float DoubleClickTime; //  0x14ac Size(4)
	char CheckDoubleClick; //  0x14b0 Size(1)
	struct Unknown TempLocation; //  0x14b4 Size(c)
	struct TArray<Unknown> NameWidgets; //  0x14c0 Size(10)
	int32_t CurrentNameWidgetCount; //  0x14d0 Size(4)
	char bNameTooltipMode; //  0x14d4 Size(1)
	int32_t SmartPingTypeIndex; //  0x14d8 Size(4)
	char EableSmartPing; //  0x14dc Size(1)
	char PingLock; //  0x14dd Size(1)
	struct Unknown OperationMessageWidget; //  0x14e0 Size(8)
	struct Unknown SelectionMenu; //  0x14e8 Size(8)
	char IsVisibleSelectionMenu; //  0x14f0 Size(1)
	struct TMap<{}, {}>Unknown BoostItemList; //  0x14f8 Size(50)
	char IgnoreMenu; //  0x1548 Size(1)

	char HasPerkDeckWidget(); // Function B.B.HasPerkDeckWidget(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass B.B
struct UB : UBravoHotelCreateCharacterWidget {
	struct Unknown UberGraphFrame; //  0x308 Size(8)
	struct Unknown CoherentUIGTWidget_90; //  0x310 Size(8)
	struct Unknown U; //  0x318 Size(8)
	enum class Unknow CurrentSceneType; //  0x320 Size(1)

	void Construct(); // Function B.B.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelSkillTargetingNuclear {
	struct Unknown UberGraphFrame; //  0x358 Size(8)

	void UpdateTargetSize(); // Function B.B.UpdateTargetSize(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	struct Unknown Tire_RL; //  0x460 Size(8)
	struct Unknown Tire_FL; //  0x468 Size(8)
	struct Unknown Tire_RR; //  0x470 Size(8)
	struct Unknown Tire_FR; //  0x478 Size(8)
	struct Unknown SkeletalMesh; //  0x480 Size(8)
	struct Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct UB : UBravoHotelGrassCollisionComponent {
	struct Unknown UberGraphFrame; //  0xb8 Size(8)
	float TextureScale; //  0xc0 Size(4)
	float CollisionArea; //  0xc4 Size(4)
	float LieDistance; //  0xc8 Size(4)
	float Draw; //  0xcc Size(4)
	struct Unknown Brush; //  0xd0 Size(8)
	float Brush; //  0xd8 Size(4)
	struct Unknown Eraser; //  0xe0 Size(8)
	float Erase; //  0xe8 Size(4)
	char IsTickStart; //  0xec Size(1)
	struct Unknown TargetCharacter; //  0xf0 Size(8)

	void DrawGrassCollision(struct Unknown TargetCharacter); // Function B.B.DrawGrassCollision(Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelAreaSkillZoneHacking {
	struct Unknown UberGraphFrame; //  0x368 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown UberGraphFrame; //  0x22f0 Size(8)
	float BarrelHeatEffect_Effect_Intensi; //  0x22f8 Size(4)
	char BarrelHeatEffect__Direction_B2A9FBB3451595B9BFEF019625MP5_FP; //  0x22fc Size(1)
	struct Unknown BarrelHeatEffect; //  0x2300 Size(8)

	void BarrelHeatEffect__FinishedFunc(); // Function B.B.BarrelHeatEffect__FinishedFunc(BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : UActor {
	struct Unknown UberGraphFrame; //  0x310 Size(8)
	struct Unknown WorldViewCamera; //  0x318 Size(8)
	struct Unknown DefaultSceneRoot; //  0x320 Size(8)
	float DeltaTime; //  0x328 Size(4)
	char bIsBackgroundScene; //  0x32c Size(1)

	void CheckWorldViewCameraLocationRange(); // Function B.B.CheckWorldViewCameraLocationRange(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass B.B
struct UB : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown B_Value; //  0x250 Size(8)
	struct Unknown Check; //  0x258 Size(8)
	struct Unknown G_Value; //  0x260 Size(8)
	struct Unknown Image_166; //  0x268 Size(8)
	struct Unknown Land; //  0x270 Size(8)
	struct Unknown Land_2; //  0x278 Size(8)
	struct Unknown Land_3; //  0x280 Size(8)
	struct Unknown Land_4; //  0x288 Size(8)
	struct Unknown Land_5; //  0x290 Size(8)
	struct Unknown Land_6; //  0x298 Size(8)
	struct Unknown R_5; //  0x2a0 Size(8)
	struct Unknown R_7; //  0x2a8 Size(8)
	struct Unknown R_9; //  0x2b0 Size(8)
	struct Unknown R_Value; //  0x2b8 Size(8)
	struct Unknown TextBlock_4; //  0x2c0 Size(8)
	struct Unknown TextBlock_5; //  0x2c8 Size(8)
	struct Unknown TextBlock_6; //  0x2d0 Size(8)
	struct Unknown TextBlock_8; //  0x2d8 Size(8)
	struct Unknown TextBlock_9; //  0x2e0 Size(8)
	struct Unknown TextBlock_10; //  0x2e8 Size(8)
	struct Unknown Timer; //  0x2f0 Size(8)

	void OnLoaded_395796F147F051B7CCBB17B8AB7F3577(struct Unknown Loaded); // Function B.B.OnLoaded_395796F147F051B7CCBB17B8AB7F3577(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileGrenadeMolotovCocktail {
	struct Unknown UberGraphFrame; //  0x7f0 Size(8)
	float TextureScale; //  0x7f8 Size(4)
	float CollisionSize; //  0x7fc Size(4)

	void ActiveThrowingProjectileMainEffect(); // Function B.B.ActiveThrowingProjectileMainEffect(Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : UActor {
	struct Unknown UberGraphFrame; //  0x310 Size(8)
	struct Unknown WorldViewCamera; //  0x318 Size(8)
	struct Unknown FarCamera; //  0x320 Size(8)
	struct Unknown NearCamera; //  0x328 Size(8)
	struct Unknown DefaultSceneRoot; //  0x330 Size(8)
	struct Unknown CharacterRef; //  0x338 Size(8)
	struct Unknown TargetNearCameraTransform; //  0x340 Size(30)
	float DeltaTime; //  0x370 Size(4)
	struct Unknown TargetFarCameraTransform; //  0x380 Size(30)
	struct Unknown PlayerControllerRef; //  0x3b0 Size(8)
	char bIsBackgroundScene; //  0x3b8 Size(1)
	struct TArray<Unknown> WinTeamCharacters; //  0x3c0 Size(10)
	struct TArray<Unknown> DuoLocation_Near; //  0x3d0 Size(10)
	struct Unknown CharacterOriginLocation; //  0x3e0 Size(c)
	struct TArray<Unknown> DuoRotation_Near; //  0x3f0 Size(10)
	struct TArray<Unknown> DuoLocation_Far; //  0x400 Size(10)
	struct TArray<Unknown> DuoRotation_Far; //  0x410 Size(10)
	struct TArray<Unknown> TrioLocation_Near; //  0x420 Size(10)
	struct TArray<Unknown> TrioRotation_Near; //  0x430 Size(10)
	struct TArray<Unknown> TrioLocation_Far; //  0x440 Size(10)
	struct TArray<Unknown> TrioRotation_Far; //  0x450 Size(10)
	struct TArray<Unknown> SquadLocation_Near; //  0x460 Size(10)
	struct TArray<Unknown> SquadRotation_Near; //  0x470 Size(10)
	struct TArray<Unknown> SquadLocation_Far; //  0x480 Size(10)
	struct TArray<Unknown> SquadRotation_Far; //  0x490 Size(10)
	struct Unknown CharacterOriginRotation; //  0x4a0 Size(c)

	void GetFloorLocation(struct Unknown InLocation, struct Unknown& OutLocation); // Function B.B.GetFloorLocation(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelAreaSkillZonePowerInterruption {
	struct Unknown UberGraphFrame; //  0x368 Size(8)
	float SkillDelayTime; //  0x370 Size(4)
	struct Unknown BlackOutDynamicMaterial; //  0x378 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelAircraftBomber {
	struct Unknown UberGraphFrame; //  0x320 Size(8)
	struct Unknown ParticleSystem; //  0x328 Size(8)
	struct Unknown S; //  0x330 Size(8)
	struct Unknown DefaultSceneRoot; //  0x338 Size(8)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileGrenadeMolotovCocktail {
	struct Unknown UberGraphFrame; //  0x7f0 Size(8)
	float TextureScale; //  0x7f8 Size(4)
	float CollisionSize; //  0x7fc Size(4)

	void ActiveThrowingProjectileMainEffect(); // Function B.B.ActiveThrowingProjectileMainEffect(Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown BravoHotelVehicleTire_RR; //  0xd00 Size(8)
	struct Unknown BravoHotelVehicleTire_RL; //  0xd08 Size(8)
	struct Unknown BravoHotelVehicleTire_FR; //  0xd10 Size(8)
	struct Unknown BravoHotelVehicleTire_FL; //  0xd18 Size(8)
	struct Unknown VehicleSeatCollision1; //  0xd20 Size(8)
	struct Unknown VehicleSeatCollision; //  0xd28 Size(8)
	struct Unknown BravoHotelVehicleSeat01; //  0xd30 Size(8)
};

// WidgetBlueprintGeneratedClass B.B
struct UB : UBravoHotelLoadingWidget {
	struct Unknown UberGraphFrame; //  0x2a0 Size(8)
	struct Unknown HorizontalBox_1; //  0x2a8 Size(8)
	struct Unknown Image_bg; //  0x2b0 Size(8)
	struct Unknown RichTextBlock; //  0x2b8 Size(8)
	struct Unknown RichTextBlock_Title; //  0x2c0 Size(8)
	struct Unknown Throbber_1; //  0x2c8 Size(8)
	struct Unknown VerticalBox_2; //  0x2d0 Size(8)
	struct TArray<Unknown> Textures; //  0x2d8 Size(10)
	struct Unknown Game; //  0x2e8 Size(8)
	struct FString TempString; //  0x2f0 Size(10)
	char Key; //  0x300 Size(1)
	int32_t RandomTemp; //  0x304 Size(4)
	int32_t ImageIndex; //  0x308 Size(4)
	int32_t TitleIndex; //  0x30c Size(4)

	void SetInfo(enum class Unknow Type, struct Unknown& OutData); // Function B.B.SetInfo(Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct UB : USavedInventorySettings {
	char ShowPerkSlot; //  0x30 Size(1)
};

// BlueprintGeneratedClass B.B
struct AB : UActor {
	struct Unknown UberGraphFrame; //  0x310 Size(8)
	struct Unknown Widget; //  0x318 Size(8)
	struct Unknown DefaultSceneRoot; //  0x320 Size(8)
	struct Unknown TargetCharacter; //  0x328 Size(8)
	struct Unknown LoudnessCurve; //  0x330 Size(8)
	float AmplifierLength; //  0x338 Size(4)
	enum class Unknow TagetGroundState; //  0x33c Size(1)
	char IsFiring; //  0x33d Size(1)
	struct Unknown CurrentWeapon; //  0x340 Size(8)
	struct Unknown SingleTimerEvent; //  0x348 Size(8)
	char IsSingleFiring; //  0x350 Size(1)

	void (float DeltaSeconds, struct Unknown OldLocation, struct Unknown OldVelocity); // Function B.B.(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileMolotovFireCell {
	struct Unknown UberGraphFrame; //  0x398 Size(8)
	float TextureScale; //  0x3a0 Size(4)
	float BurnArea; //  0x3a4 Size(4)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ATransportAircraftPawn {
	struct Unknown UberGraphFrame; //  0x6d0 Size(8)

	void ReceiveTick(float DeltaSeconds); // Function B.B.ReceiveTick(Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileMolotovFireCell {
	struct Unknown UberGraphFrame; //  0x398 Size(8)
	float TextureScale; //  0x3a0 Size(4)
	float BurnArea; //  0x3a4 Size(4)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelGrenadeWeapon {
	struct Unknown UberGraphFrame; //  0x1f20 Size(8)
	struct Unknown StaticMesh_Ring; //  0x1f28 Size(8)
	struct Unknown StaticMesh_Lever; //  0x1f30 Size(8)
	float Timeline_0_Lerp_77CE; //  0x1f38 Size(4)
	char Timeline_0__; //  0x1f3c Size(1)
	struct Unknown Timeline_1; //  0x1f40 Size(8)
	float Lerp_Lerp_ED; //  0x1f48 Size(4)
	char Lerp__Direction_EDD5977E4E850EC460B1E599F1FF45F8; //  0x1f4c Size(1)
	struct Unknown Lerp; //  0x1f50 Size(8)
	struct Unknown InterpOffset; //  0x1f58 Size(c)
	struct Unknown DesiredLocation; //  0x1f64 Size(c)
	struct Unknown InitalLocalVelocity; //  0x1f70 Size(c)
	struct Unknown DesiredLocation_Ing; //  0x1f7c Size(c)
	struct Unknown InitalLocalVelocity_Ing; //  0x1f88 Size(c)
	enum class Unknow ThrowingWeaponState; //  0x1f94 Size(1)
	char ThrowingAction_Bool; //  0x1f95 Size(1)
	struct Unknown DesiredLocation_3; //  0x1f98 Size(c)
	struct Unknown DesiredLocation_2_Ing; //  0x1fa4 Size(c)
	struct Unknown InitalLocalVelocity_3; //  0x1fb0 Size(c)
	struct Unknown InitalLocalVelocity_2_ing; //  0x1fbc Size(c)
	float PathLifeTime; //  0x1fc8 Size(4)
	float TimeInterval; //  0x1fcc Size(4)
	struct Unknown IndicatorComponent_2; //  0x1fd0 Size(8)
	struct Unknown IndicatorComponent_3; //  0x1fd8 Size(8)
	struct Unknown TrajectoryComponent_2; //  0x1fe0 Size(8)
	struct Unknown TrajectoryComponent_3; //  0x1fe8 Size(8)

	struct Unknown GetDebugInfo(); // Function B.B.GetDebugInfo(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelLobbyPlayerController {
	struct Unknown UberGraphFrame; //  0x720 Size(8)
	struct Unknown B; //  0x728 Size(8)
	struct FMulticastInlineDelegate EventDispatcher_PlayLobbySound; //  0x730 Size(10)
	struct FMulticastInlineDelegate EventDispatcher_StopLobbySound; //  0x740 Size(10)
	struct Unknown MediaSoundComponent; //  0x750 Size(8)
	struct Unknown OperationMessageWidget; //  0x758 Size(8)
	enum class Unknow CurrentSceneType; //  0x760 Size(1)
	struct Unknown LobbyWidgetRef; //  0x768 Size(8)

	void CanInput(char& bCheck); // Function B.B.CanInput(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : UActor {
	struct Unknown UberGraphFrame; //  0x310 Size(8)
	struct Unknown Widget; //  0x318 Size(8)
	struct Unknown DefaultSceneRoot; //  0x320 Size(8)
	struct Unknown TargetCharacter; //  0x328 Size(8)
	struct Unknown LoudnessCurve; //  0x330 Size(8)
	float HeartBeatSensorLength; //  0x338 Size(4)
	enum class Unknow TagetGroundState; //  0x33c Size(1)
	char IsFiring; //  0x33d Size(1)
	struct Unknown CurrentWeapon; //  0x340 Size(8)
	struct Unknown SingleTimerEvent; //  0x348 Size(8)
	char IsSingleFiring; //  0x350 Size(1)

	void ReceiveTick(float DeltaSeconds); // Function B.B.ReceiveTick(Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown UberGraphFrame; //  0x22f0 Size(8)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMK3DSpectatorPawn {
	struct Unknown UberGraphFrame; //  0x3c0 Size(8)
	struct Unknown FreeCam; //  0x3c8 Size(8)
	struct Unknown SpringArm; //  0x3d0 Size(8)
	struct Unknown ReplayMainWidget; //  0x3d8 Size(8)
	char ViewMode; //  0x3e0 Size(1)

	void GetReplayWidget(struct Unknown& ReplayMainWidget); // Function B.B.GetReplayWidget(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMK3DReplayController {
	struct Unknown UberGraphFrame; //  0xab0 Size(8)
	struct Unknown B; //  0xab8 Size(8)
	int32_t OpenedWidgetNum; //  0xac0 Size(4)
	char ViewMode; //  0xac4 Size(1)

	struct Unknown GetHUDInteractionComponent(); // Function B.B.GetHUDInteractionComponent(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	struct Unknown Tire_RL; //  0x460 Size(8)
	struct Unknown Tire_FL; //  0x468 Size(8)
	struct Unknown Tire_RR; //  0x470 Size(8)
	struct Unknown Tire_FR; //  0x478 Size(8)
	struct Unknown SkeletalMesh; //  0x480 Size(8)
	struct Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelSpectatorPawn {
	struct Unknown UberGraphFrame; //  0x3d0 Size(8)
	struct Unknown Camera; //  0x3d8 Size(8)
	struct Unknown SpringArm; //  0x3e0 Size(8)
	char bKillCam; //  0x3e8 Size(1)

	void TargetSetting(); // Function B.B.TargetSetting(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelSpectatorController {
	struct Unknown UberGraphFrame; //  0x13f0 Size(8)
	struct Unknown Observer; //  0x13f8 Size(8)
	char PlayingKillCam; //  0x1400 Size(1)
	struct Unknown AfterGameHUD; //  0x1408 Size(8)
	struct Unknown GameInstanceRef; //  0x1410 Size(8)
	char bKillCamFinish; //  0x1418 Size(1)

	void SetObserver(); // Function B.B.SetObserver(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown UberGraphFrame; //  0x3ac8 Size(8)
	struct Unknown Listener; //  0x3ad0 Size(8)
	float _P_Cam_Z_NewTrack_0_898B65D1462B08609DA61C81A7B52313; //  0x3ad8 Size(4)
	char _P_Cam_Z__Direction_898B65D1462B08609DA61C81A7B52313; //  0x3adc Size(1)
	struct Unknown 3P_Cam_Z; //  0x3ae0 Size(8)
	struct Unknown CriticalUITimeHandler; //  0x3ae8 Size(8)
	struct Unknown DyingUITimeHandler; //  0x3af0 Size(8)
	struct Unknown ClothHandler; //  0x3af8 Size(8)
	struct Unknown ClothBallObject; //  0x3b00 Size(8)
	struct Unknown BallHandleLocation; //  0x3b08 Size(c)
	float GamepadInputModifier; //  0x3b14 Size(4)
	float BaseTurnRate; //  0x3b18 Size(4)
	float BaseLookUpRate; //  0x3b1c Size(4)
	struct TArray<Unknown> PerkLevelUpWidgets; //  0x3b20 Size(10)
	float PerkLevelUpWidthDepth; //  0x3b30 Size(4)
	struct Unknown AmplifierEffect; //  0x3b38 Size(8)
	float Cam_Shake_Radius; //  0x3b40 Size(4)
	struct Unknown MainWidget; //  0x3b48 Size(8)
	struct Unknown HeartBeatSensorEffect; //  0x3b50 Size(8)

	char IsEnableSpawnSupplyBox(struct Unknown TargetActor, struct FString& OutResult); // Function B.B.IsEnableSpawnSupplyBox(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass B.B
struct UB : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown BackgroundBlurFadeIn; //  0x250 Size(8)
	struct Unknown Idle; //  0x258 Size(8)
	struct Unknown BackgroundBlur_1; //  0x260 Size(8)
	struct Unknown BT; //  0x268 Size(8)
	struct Unknown Btn; //  0x270 Size(8)
	struct Unknown Btn; //  0x278 Size(8)
	struct Unknown Btn; //  0x280 Size(8)
	struct Unknown Canvas_Main; //  0x288 Size(8)
	struct Unknown KillcamBtns; //  0x290 Size(8)
	struct Unknown MemberChangeBox; //  0x298 Size(8)
	struct Unknown Text; //  0x2a0 Size(8)
	struct Unknown U; //  0x2a8 Size(8)
	char bIsKillCam; //  0x2b0 Size(1)

	struct Unknown GetInteractiveWidget(); // Function B.B.GetInteractiveWidget(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelPlayerHUD {
	struct Unknown UberGraphFrame; //  0x860 Size(8)
	struct Unknown DefaultSceneRoot; //  0x868 Size(8)
	struct TMap<{}, {}>Unknown TableInfo; //  0x870 Size(50)
	struct TArray<Unknown> NewVar_1; //  0x8c0 Size(10)
	struct TArray<Unknown> GuideWidgetStack; //  0x8d0 Size(10)
	enum class Unknow NewVar_2; //  0x8e0 Size(1)

	void IsSpectate(char& Return); // Function B.B.IsSpectate(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct UB : UBravoHotelGameInstance {
	struct Unknown UberGraphFrame; //  0x5a0 Size(8)
	struct Unknown Game; //  0x5a8 Size(8)
	struct Unknown LastPCPosition; //  0x5b0 Size(c)

	void Update(char Audio, float Volume, char& ); // Function B.B.Update(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileGrenadeMolotovCocktail {
	struct Unknown UberGraphFrame; //  0x7f0 Size(8)
	float TextureScale; //  0x7f8 Size(4)
	float CollisionSize; //  0x7fc Size(4)

	void ActiveThrowingProjectileMainEffect(); // Function B.B.ActiveThrowingProjectileMainEffect(Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelLobbyCharacter {
	struct Unknown UberGraphFrame; //  0x3a70 Size(8)
	struct Unknown Box; //  0x3a78 Size(8)
	int32_t PawnIndex; //  0x3a80 Size(4)
	struct Unknown* BravoHotelPlayerStateClass; //  0x3a88 Size(8)
	char bReady; //  0x3a90 Size(1)
	char bMatchSuccess; //  0x3a91 Size(1)
	char bIsFaceCustomizing; //  0x3a92 Size(1)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : UActor {
	struct Unknown Box; //  0x310 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelVehicle {
	struct Unknown UberGraphFrame; //  0xcd0 Size(8)
	struct Unknown TeamInfoUpdater; //  0xcd8 Size(8)
	float Timeline_0_NewTrack_0_FB4F6B44434A25E409AE66987076220A; //  0xce0 Size(4)
	char Timeline_0__; //  0xce4 Size(1)
	struct Unknown Timeline_1; //  0xce8 Size(8)
	struct Unknown EngineSound; //  0xcf0 Size(8)

	void SetWaterLevelZ_Func(); // Function B.B.SetWaterLevelZ_Func(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelInventoryCharacter {
	struct Unknown SpotLight1; //  0x3d8 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown UberGraphFrame; //  0x1ff0 Size(8)
	struct Unknown ParticleSystem; //  0x1ff8 Size(8)

	void K2_OnEquip(); // Function B.B.K2_OnEquip(Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct UB : ULadderComponent {
	struct Unknown UberGraphFrame; //  0x210 Size(8)
	char NeedToChangeHand; //  0x218 Size(1)
	float CrntAxisValue; //  0x21c Size(4)
	float GoalLocationZ; //  0x220 Size(4)
	char NeedMoveOnLadder; //  0x224 Size(1)
	float MotionMinAlpha; //  0x228 Size(4)
	char CanStopMotion; //  0x22c Size(1)
	float DirectSnapLocZ; //  0x230 Size(4)
	float DeltaSecond; //  0x234 Size(4)
	float LastSecond; //  0x238 Size(4)
	int32_t AdditionalStepCount; //  0x23c Size(4)

	void CalcLadderInteractionType(); // Function B.B.CalcLadderInteractionType(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelCharacterPrefab {
	struct Unknown UberGraphFrame; //  0x3a60 Size(8)
	struct Unknown B; //  0x3a68 Size(8)
	struct Unknown OutBlueZone; //  0x3a70 Size(8)
	struct Unknown B; //  0x3a78 Size(8)
	struct Unknown DevCamera_ChildActor; //  0x3a80 Size(8)
	struct Unknown TeamInfoUpdater; //  0x3a88 Size(8)
	float VelocityZ_LandingDamage; //  0x3a90 Size(4)
	struct Unknown CharacterPreviewRef; //  0x3a98 Size(8)
	struct Unknown Chat; //  0x3aa0 Size(8)
	char ShowChatToggle; //  0x3aa8 Size(1)
	float CurrentViewportSizeX; //  0x3aac Size(4)
	float CurrentViewportSizeY; //  0x3ab0 Size(4)
	char OutScreenPosition; //  0x3ab4 Size(1)
	int32_t SightNumForTset; //  0x3ab8 Size(4)
	char bDefaultAmplifier; //  0x3abc Size(1)
	float CurrentTeamInfoHeight; //  0x3ac0 Size(4)

	void ForceInitRecordingCharacter(); // Function B.B.ForceInitRecordingCharacter(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMagazineForDrop {
	struct Unknown UberGraphFrame; //  0x360 Size(8)
	float PhysicsSimulateTime; //  0x368 Size(4)
	float LifeTime; //  0x36c Size(4)
	float AddImpulse; //  0x370 Size(4)
	char Stance; //  0x374 Size(1)
	float AddImpulse_Crouched; //  0x378 Size(4)
	float AddImpulse_Proned; //  0x37c Size(4)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown UberGraphFrame; //  0x1ff0 Size(8)
	struct Unknown ParticleSystem; //  0x1ff8 Size(8)

	void K2_OnEquip(); // Function B.B.K2_OnEquip(Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	struct Unknown Tire_RL; //  0x460 Size(8)
	struct Unknown Tire_FL; //  0x468 Size(8)
	struct Unknown Tire_RR; //  0x470 Size(8)
	struct Unknown Tire_FR; //  0x478 Size(8)
	struct Unknown SkeletalMesh; //  0x480 Size(8)
	struct Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileBullet {
	struct Unknown UberGraphFrame; //  0x520 Size(8)
	struct Unknown ParticleSystem; //  0x528 Size(8)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass B.B
struct UB : UBravoHotelLobbyWidget_Web {
	struct Unknown UberGraphFrame; //  0x4c8 Size(8)
	struct Unknown FadeOutNotice; //  0x4d0 Size(8)
	struct Unknown Bg; //  0x4d8 Size(8)
	struct Unknown Bg_2; //  0x4e0 Size(8)
	struct Unknown CanvasPanel_GameNotice; //  0x4e8 Size(8)
	struct Unknown CanvasPanel_PrefetchingProgress; //  0x4f0 Size(8)
	struct Unknown Image; //  0x4f8 Size(8)
	struct Unknown Image_145; //  0x500 Size(8)
	struct Unknown ProgressText; //  0x508 Size(8)
	struct Unknown U; //  0x510 Size(8)
	struct TArray<Unknown> WeaponList_1; //  0x518 Size(10)
	struct TArray<Unknown> CharacterInfoWidgetList; //  0x528 Size(10)
	int32_t PartySize; //  0x538 Size(4)
	struct Unknown EquipmentTransition; //  0x540 Size(8)
	char BindParticle; //  0x548 Size(1)
	struct TArray<Unknown> EffectPool; //  0x550 Size(10)
	struct FMulticastInlineDelegate EventDispatcher_Mov; //  0x560 Size(10)
	struct FString CurrentTab; //  0x570 Size(10)

	void CheckOptionChanged(); // Function B.B.CheckOptionChanged(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct UB : UHUDInteractionComponent {
	struct Unknown UberGraphFrame; //  0xf0 Size(8)
	struct Unknown PlayerController; //  0xf8 Size(8)
	char bAlreadySetOptionWidget; //  0x100 Size(1)
	float defaultContrast; //  0x104 Size(4)
	float defaultMaxBrightness; //  0x108 Size(4)
	float defaultMinBrightness; //  0x10c Size(4)
	float MinBrightness; //  0x110 Size(4)
	float MaxBrightness; //  0x114 Size(4)
	float Contrast; //  0x118 Size(4)
	char bUsePostProcessVolumeOption; //  0x11c Size(1)
	float ColorGradingGlobalGamma; //  0x120 Size(4)
	float FilmToeIntensity; //  0x124 Size(4)
	char IsInWidget; //  0x128 Size(1)
	char bInputModeUI; //  0x129 Size(1)
	struct TArray<Unknown> InputActionsToBlock; //  0x130 Size(10)

	void CheckAnyAction(char& AnyAction); // Function B.B.CheckAnyAction(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : UActor {
	struct Unknown UberGraphFrame; //  0x310 Size(8)
	struct Unknown WorldViewCamera; //  0x318 Size(8)
	struct Unknown FarCamera; //  0x320 Size(8)
	struct Unknown NearCamera; //  0x328 Size(8)
	struct Unknown DefaultSceneRoot; //  0x330 Size(8)
	struct Unknown CharacterRef; //  0x338 Size(8)
	struct Unknown TargetNearCameraTransform; //  0x340 Size(30)
	float DeltaTime; //  0x370 Size(4)
	struct Unknown TargetFarCameraTransform; //  0x380 Size(30)
	struct Unknown PlayerControllerRef; //  0x3b0 Size(8)
	char bIsBackgroundScene; //  0x3b8 Size(1)
	struct TArray<Unknown> WinTeamCharacters; //  0x3c0 Size(10)
	struct TArray<Unknown> DuoLocation_Near; //  0x3d0 Size(10)
	struct Unknown CharacterOriginLocation; //  0x3e0 Size(c)
	struct TArray<Unknown> DuoRotation_Near; //  0x3f0 Size(10)
	struct TArray<Unknown> DuoLocation_Far; //  0x400 Size(10)
	struct TArray<Unknown> DuoRotation_Far; //  0x410 Size(10)
	struct TArray<Unknown> TrioLocation_Near; //  0x420 Size(10)
	struct TArray<Unknown> TrioRotation_Near; //  0x430 Size(10)
	struct TArray<Unknown> TrioLocation_Far; //  0x440 Size(10)
	struct TArray<Unknown> TrioRotation_Far; //  0x450 Size(10)
	struct TArray<Unknown> SquadLocation_Near; //  0x460 Size(10)
	struct TArray<Unknown> SquadRotation_Near; //  0x470 Size(10)
	struct TArray<Unknown> SquadLocation_Far; //  0x480 Size(10)
	struct TArray<Unknown> SquadRotation_Far; //  0x490 Size(10)
	struct Unknown CharacterOriginRotation; //  0x4a0 Size(c)

	void ResetCharacter(); // Function B.B.ResetCharacter(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelOutGameParachuteActor {
	struct Unknown UberGraphFrame; //  0x310 Size(8)
	struct Unknown ParachuteBag_SkeletalMesh; //  0x318 Size(8)
	struct Unknown Parachute_SkeletalMesh; //  0x320 Size(8)
	struct Unknown DefaultSceneRoot; //  0x328 Size(8)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelTitleHUD {
	struct Unknown DefaultSceneRoot; //  0x4b0 Size(8)
	struct Unknown MediaSoundComponent; //  0x4b8 Size(8)
	struct FMulticastInlineDelegate EventDispatcher_PlayLobbySound; //  0x4c0 Size(10)
	struct FMulticastInlineDelegate EventDispatcher_StopLobbySound; //  0x4d0 Size(10)

	void EventDispatcher_StopLobbySound__DelegateSignature(); // Function B.B.EventDispatcher_StopLobbySound__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct UB : USaveGame {
	char bHideWorkInProgress; //  0x28 Size(1)
	enum class Unknow MainTab; //  0x29 Size(1)
	enum class Unknow WeaponSubTab; //  0x2a Size(1)
	enum class Unknow AttachmentSubTab; //  0x2b Size(1)
	enum class Unknow WearableSubTab; //  0x2c Size(1)
	enum class Unknow CustomSubTab; //  0x2d Size(1)
	enum class Unknow GearSubTab; //  0x2e Size(1)
};

// BlueprintGeneratedClass B.B
struct UB : USaveGame {
	struct TArray<Unknown> WearableItemList; //  0x28 Size(10)
	struct TArray<Unknown> CustomItemList; //  0x38 Size(10)
	struct TArray<Unknown> WeaponItemList; //  0x48 Size(10)
	struct TArray<Unknown> InBackpackItemList; //  0x58 Size(10)
	struct Unknown AppearanceInfo; //  0x68 Size(14)
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown UberGraphFrame; //  0x420 Size(8)
	struct Unknown Sphere; //  0x428 Size(8)

	void SetTexture5mm(); // Function B.B.SetTexture5mm(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : UActor {
	struct Unknown UberGraphFrame; //  0x310 Size(8)
	struct Unknown FirstCamera; //  0x318 Size(8)
	struct Unknown FirstSpringArm; //  0x320 Size(8)
	struct Unknown ThirdCamera; //  0x328 Size(8)
	struct Unknown SecondCamera; //  0x330 Size(8)
	struct Unknown DefaultSceneRoot; //  0x338 Size(8)
	float DeltaSeconds; //  0x340 Size(4)
	struct Unknown TargetDeltaLocation; //  0x344 Size(c)
	struct Unknown Character; //  0x350 Size(8)
	float LowerBoundCameraHeightDelta; //  0x358 Size(4)
	char bHeightUpdateFinished; //  0x35c Size(1)
	float ThridCameraRotationYawDelta; //  0x360 Size(4)
	float ThirdCameraMinHeight; //  0x364 Size(4)
	float FirstSpringArmDeltaZ; //  0x368 Size(4)

	void CheckThirdCameraLocationRange(); // Function B.B.CheckThirdCameraLocationRange(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	struct Unknown Tire_RL; //  0x460 Size(8)
	struct Unknown Tire_FL; //  0x468 Size(8)
	struct Unknown Tire_RR; //  0x470 Size(8)
	struct Unknown Tire_FR; //  0x478 Size(8)
	struct Unknown SkeletalMesh; //  0x480 Size(8)
	struct Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct UB : UB {
	struct Unknown UberGraphFrame; //  0x140 Size(8)
	char bHasJustClosed_1; //  0x148 Size(1)
	float defaultContrast_1; //  0x14c Size(4)
	float defaultMaxBrightness_1; //  0x150 Size(4)
	float defaultMinBrightness_1; //  0x154 Size(4)
	float MinBrightness_1; //  0x158 Size(4)
	float MaxBrightness_1; //  0x15c Size(4)
	float Contrast_1; //  0x160 Size(4)
	char bUsePostProcessVolumeOption_1; //  0x164 Size(1)
	float ColorGradingGlobalGamma_1; //  0x168 Size(4)
	float FilmToeIntensity_1; //  0x16c Size(4)
	char IsInWidget_1; //  0x170 Size(1)
	char bInputModeUI_1; //  0x171 Size(1)
	struct TArray<Unknown> InputActionsToBlock_1; //  0x178 Size(10)

	void CheckAnyAction(char& AnyAction); // Function B.B.CheckAnyAction(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelSkillTargetingBombing {
	struct Unknown UberGraphFrame; //  0x368 Size(8)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown Sphere; //  0x420 Size(8)
};

// BlueprintGeneratedClass B.B
struct UB : UBravoHotelGameSettingManager {
	struct Unknown UberGraphFrame; //  0x38 Size(8)
	struct Unknown Game; //  0x40 Size(8)

	void Get(struct Unknown& SettingsWrapper); // Function B.B.Get(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass B.B
struct UB : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown U; //  0x250 Size(8)
	struct FMulticastInlineDelegate OnTriedToLogin; //  0x258 Size(10)
	struct FMulticastInlineDelegate OnTriedToTestLogin; //  0x268 Size(10)
	char bEnableDevServer; //  0x278 Size(1)
	struct FMulticastInlineDelegate OnMoveLobby; //  0x280 Size(10)
	struct FMulticastInlineDelegate OnPlayBGM; //  0x290 Size(10)
	struct FMulticastInlineDelegate OnSaveUserData; //  0x2a0 Size(10)
	char bPlayBGM; //  0x2b0 Size(1)
	char bRememberMe; //  0x2b1 Size(1)
	struct FMulticastInlineDelegate OnSkipTitle; //  0x2b8 Size(10)

	void HideExitPopup(); // Function B.B.HideExitPopup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABattleRoyaleGameMode_Login {
	struct Unknown DefaultSceneRoot; //  0x648 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	struct Unknown Tire_RL; //  0x460 Size(8)
	struct Unknown Tire_FL; //  0x468 Size(8)
	struct Unknown Tire_RR; //  0x470 Size(8)
	struct Unknown Tire_FR; //  0x478 Size(8)
	struct Unknown SkeletalMesh; //  0x480 Size(8)
	struct Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown Sphere; //  0x420 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown Sphere; //  0x420 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown ScopeWidget_Background; //  0x420 Size(8)
	struct Unknown Cube; //  0x428 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileGrenadeBomb {
	struct Unknown UberGraphFrame; //  0x678 Size(8)
	struct Unknown Ak; //  0x680 Size(8)

	void BndEvt__SphereCollision_K2Node_ComponentBoundEvent_Bomb(struct Unknown HitComponent, struct Unknown OtherActor, struct Unknown OtherComp, struct Unknown NormalImpulse, struct Unknown& Hit); // Function B.B.BndEvt__SphereCollision_K2Node_ComponentBoundEventght_2(HasOutParms|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileGrenadeBomb {
	struct Unknown UberGraphFrame; //  0x678 Size(8)
	struct Unknown Ak; //  0x680 Size(8)

	void BndEvt__SphereCollision_K2Node_ComponentBoundEvent(struct Unknown HitComponent, struct Unknown OtherActor, struct Unknown OtherComp, struct Unknown NormalImpulse, struct Unknown& Hit); // Function B.B.BndEvt__SphereCollision_K2Node_ComponentBoundEventt_CoverShot(HasOutParms|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelAreaSkillZoneWetFog {
	struct Unknown UberGraphFrame; //  0x388 Size(8)

	void ActivateEffect(struct Unknown Character); // Function B.B.ActivateEffect(Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown BravoHotelVehicleTire_RR; //  0xd18 Size(8)
	struct Unknown BravoHotelVehicleTire_RL; //  0xd20 Size(8)
	struct Unknown BravoHotelVehicleTire_FR; //  0xd28 Size(8)
	struct Unknown BravoHotelVehicleTire_FL; //  0xd30 Size(8)
	struct Unknown B; //  0xd38 Size(8)
	struct Unknown B; //  0xd40 Size(8)
	struct Unknown B; //  0xd48 Size(8)
	struct Unknown B; //  0xd50 Size(8)
	struct Unknown BravoHotelVehicleSeat04; //  0xd58 Size(8)
	struct Unknown BravoHotelVehicleSeat03; //  0xd60 Size(8)
	struct Unknown BravoHotelVehicleSeat02; //  0xd68 Size(8)
	char bSnowy; //  0xd70 Size(1)
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelHeartBeatSensor {
	struct Unknown UberGraphFrame; //  0x1bf0 Size(8)
	struct Unknown InternalPP; //  0x1bf8 Size(8)
	struct Unknown EffectMaterial; //  0x1c00 Size(8)
	char IsActive; //  0x1c08 Size(1)
	struct Unknown mRadialBlur; //  0x1c10 Size(8)
	struct Unknown iRadialBlur; //  0x1c18 Size(8)
	struct Unknown Radial; //  0x1c20 Size(38)
	float Radial; //  0x1c58 Size(4)
	int32_t Radial; //  0x1c5c Size(4)
	struct Unknown Radial; //  0x1c60 Size(8)
	struct Unknown Radial; //  0x1c68 Size(8)
	struct Unknown Native; //  0x1c70 Size(5c0)
	struct Unknown mSelectiveColor; //  0x2230 Size(8)
	struct Unknown iSelectiveColor; //  0x2238 Size(8)
	struct Unknown Selective; //  0x2240 Size(38)
	struct Unknown Selective; //  0x2278 Size(10)
	float Selective; //  0x2288 Size(4)
	float Selective; //  0x228c Size(4)
	float Selective; //  0x2290 Size(4)
	float CurrentBlur; //  0x2294 Size(4)
	float CurrentSelective; //  0x2298 Size(4)
	float FadeInSpeed; //  0x229c Size(4)
	float FadeOutSpeed; //  0x22a0 Size(4)
	struct Unknown mMonochrome; //  0x22a8 Size(8)
	struct Unknown iMonochrome; //  0x22b0 Size(8)
	struct Unknown Monochrome; //  0x22b8 Size(38)
	struct Unknown Monochrome; //  0x22f0 Size(10)
	struct Unknown MBlackColor; //  0x2300 Size(8)
	struct Unknown IBlackColor; //  0x2308 Size(8)
	struct Unknown BlackColor; //  0x2310 Size(38)
	float ActiveDelayTime; //  0x2348 Size(4)
	struct Unknown MainWidget; //  0x2350 Size(8)
	struct Unknown TopWidget; //  0x2358 Size(8)

	void GetTopWidget(struct Unknown& TopWidget); // Function B.B.GetTopWidget(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown UberGraphFrame; //  0x22f0 Size(8)

	void GetTargetEffectorLocationR(struct Unknown& TargetEffectorLocationR); // Function B.B.GetTargetEffectorLocationR(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelAmplifier {
	struct Unknown UberGraphFrame; //  0x1bf0 Size(8)
	struct Unknown InternalPP; //  0x1bf8 Size(8)
	struct Unknown EffectMaterial; //  0x1c00 Size(8)
	char IsActive; //  0x1c08 Size(1)
	struct Unknown mRadialBlur; //  0x1c10 Size(8)
	struct Unknown iRadialBlur; //  0x1c18 Size(8)
	struct Unknown Radial; //  0x1c20 Size(38)
	float Radial; //  0x1c58 Size(4)
	int32_t Radial; //  0x1c5c Size(4)
	struct Unknown Radial; //  0x1c60 Size(8)
	struct Unknown Radial; //  0x1c68 Size(8)
	struct Unknown Native; //  0x1c70 Size(5c0)
	struct Unknown mSelectiveColor; //  0x2230 Size(8)
	struct Unknown iSelectiveColor; //  0x2238 Size(8)
	struct Unknown Selective; //  0x2240 Size(38)
	struct Unknown Selective; //  0x2278 Size(10)
	float Selective; //  0x2288 Size(4)
	float Selective; //  0x228c Size(4)
	float Selective; //  0x2290 Size(4)
	float CurrentBlur; //  0x2294 Size(4)
	float CurrentSelective; //  0x2298 Size(4)
	float FadeInSpeed; //  0x229c Size(4)
	float FadeOutSpeed; //  0x22a0 Size(4)
	struct Unknown mMonochrome; //  0x22a8 Size(8)
	struct Unknown iMonochrome; //  0x22b0 Size(8)
	struct Unknown Monochrome; //  0x22b8 Size(38)
	struct Unknown Monochrome; //  0x22f0 Size(10)
	struct Unknown MBlackColor; //  0x2300 Size(8)
	struct Unknown IBlackColor; //  0x2308 Size(8)
	struct Unknown BlackColor; //  0x2310 Size(38)
	float ActiveDelayTime; //  0x2348 Size(4)
	struct Unknown MainWidget; //  0x2350 Size(8)
	struct Unknown TopWidget; //  0x2358 Size(8)

	void GetTopWidget(struct Unknown& TopWidget); // Function B.B.GetTopWidget(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown BravoHotelVehicleTire_RR; //  0xd18 Size(8)
	struct Unknown BravoHotelVehicleTire_RL; //  0xd20 Size(8)
	struct Unknown BravoHotelVehicleTire_FR; //  0xd28 Size(8)
	struct Unknown BravoHotelVehicleTire_FL; //  0xd30 Size(8)
	struct Unknown B; //  0xd38 Size(8)
	struct Unknown B; //  0xd40 Size(8)
	struct Unknown BravoHotelVehicleSeat04; //  0xd48 Size(8)
	struct Unknown BravoHotelVehicleSeat03; //  0xd50 Size(8)
	struct Unknown BravoHotelVehicleSeat02; //  0xd58 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown BravoHotelShellCasingArrow_Clip; //  0x22f0 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	struct Unknown Tire_RL; //  0x460 Size(8)
	struct Unknown Tire_FL; //  0x468 Size(8)
	struct Unknown Tire_RR; //  0x470 Size(8)
	struct Unknown Tire_FR; //  0x478 Size(8)
	struct Unknown SkeletalMesh; //  0x480 Size(8)
	struct Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown BravoHotelVehicleTire_RR; //  0xd18 Size(8)
	struct Unknown BravoHotelVehicleTire_RL; //  0xd20 Size(8)
	struct Unknown BravoHotelVehicleTire_FR; //  0xd28 Size(8)
	struct Unknown BravoHotelVehicleTire_FL; //  0xd30 Size(8)
	struct Unknown B; //  0xd38 Size(8)
	struct Unknown B; //  0xd40 Size(8)
	struct Unknown BravoHotelVehicleSeat04; //  0xd48 Size(8)
	struct Unknown BravoHotelVehicleSeat03; //  0xd50 Size(8)
	struct Unknown BravoHotelVehicleSeat02; //  0xd58 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown UberGraphFrame; //  0x22f0 Size(8)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown UberGraphFrame; //  0x22f0 Size(8)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown UberGraphFrame; //  0x22f0 Size(8)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	struct Unknown Tire_RL; //  0x460 Size(8)
	struct Unknown Tire_FL; //  0x468 Size(8)
	struct Unknown Tire_RR; //  0x470 Size(8)
	struct Unknown Tire_FR; //  0x478 Size(8)
	struct Unknown SkeletalMesh; //  0x480 Size(8)
	struct Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileMolotovFireCell {
	struct Unknown UberGraphFrame; //  0x398 Size(8)
	float TextureScale; //  0x3a0 Size(4)
	float BurnArea; //  0x3a4 Size(4)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelProjectileMolotovFireCell {
	struct Unknown UberGraphFrame; //  0x398 Size(8)
	float TextureScale; //  0x3a0 Size(4)
	float BurnArea; //  0x3a4 Size(4)

	void ReceiveBeginPlay(); // Function B.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	struct Unknown Tire_RL; //  0x460 Size(8)
	struct Unknown Tire_FL; //  0x468 Size(8)
	struct Unknown Tire_RR; //  0x470 Size(8)
	struct Unknown Tire_FR; //  0x478 Size(8)
	struct Unknown SkeletalMesh; //  0x480 Size(8)
	struct Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	struct Unknown Tire_RL; //  0x460 Size(8)
	struct Unknown Tire_FL; //  0x468 Size(8)
	struct Unknown Tire_RR; //  0x470 Size(8)
	struct Unknown Tire_FR; //  0x478 Size(8)
	struct Unknown SkeletalMesh; //  0x480 Size(8)
	struct Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown UberGraphFrame; //  0xcf8 Size(8)

	void ReceiveUnpossessed(struct Unknown OldController); // Function B.B.ReceiveUnpossessed(Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	struct Unknown Tire_RL; //  0x460 Size(8)
	struct Unknown Tire_FL; //  0x468 Size(8)
	struct Unknown Tire_RR; //  0x470 Size(8)
	struct Unknown Tire_FR; //  0x478 Size(8)
	struct Unknown SkeletalMesh; //  0x480 Size(8)
	struct Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	struct Unknown Tire_RL; //  0x460 Size(8)
	struct Unknown Tire_FL; //  0x468 Size(8)
	struct Unknown Tire_RR; //  0x470 Size(8)
	struct Unknown Tire_FR; //  0x478 Size(8)
	struct Unknown SkeletalMesh; //  0x480 Size(8)
	struct Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	struct Unknown Tire_RL; //  0x460 Size(8)
	struct Unknown Tire_FL; //  0x468 Size(8)
	struct Unknown Tire_RR; //  0x470 Size(8)
	struct Unknown Tire_FR; //  0x478 Size(8)
	struct Unknown SkeletalMesh; //  0x480 Size(8)
	struct Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	struct Unknown Tire_RL; //  0x460 Size(8)
	struct Unknown Tire_FL; //  0x468 Size(8)
	struct Unknown Tire_RR; //  0x470 Size(8)
	struct Unknown Tire_FR; //  0x478 Size(8)
	struct Unknown SkeletalMesh; //  0x480 Size(8)
	struct Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	struct Unknown Tire_RL; //  0x460 Size(8)
	struct Unknown Tire_FL; //  0x468 Size(8)
	struct Unknown Tire_RR; //  0x470 Size(8)
	struct Unknown Tire_FR; //  0x478 Size(8)
	struct Unknown SkeletalMesh; //  0x480 Size(8)
	struct Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	struct Unknown Tire_RL; //  0x460 Size(8)
	struct Unknown Tire_FL; //  0x468 Size(8)
	struct Unknown Tire_RR; //  0x470 Size(8)
	struct Unknown Tire_FR; //  0x478 Size(8)
	struct Unknown SkeletalMesh; //  0x480 Size(8)
	struct Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown UberGraphFrame; //  0xcf8 Size(8)
	struct Unknown Handle_IsAnyHit; //  0xd00 Size(8)
	char IsAnyHit; //  0xd08 Size(1)
	struct Unknown LastHitActor; //  0xd10 Size(8)

	void CheckLastHitActor(); // Function B.B.CheckLastHitActor(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown B; //  0xd18 Size(8)
	struct Unknown B; //  0xd20 Size(8)
	struct Unknown B; //  0xd28 Size(8)
	struct Unknown B; //  0xd30 Size(8)
	struct Unknown BravoHotelVehicleSeat04; //  0xd38 Size(8)
	struct Unknown BravoHotelVehicleSeat03; //  0xd40 Size(8)
	struct Unknown BravoHotelVehicleSeat02; //  0xd48 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : ABravoHotelMaterialEffectActor {
	struct Unknown Tire_RL; //  0x460 Size(8)
	struct Unknown Tire_FL; //  0x468 Size(8)
	struct Unknown Tire_RR; //  0x470 Size(8)
	struct Unknown Tire_FR; //  0x478 Size(8)
	struct Unknown SkeletalMesh; //  0x480 Size(8)
	struct Unknown DefaultSceneRoot; //  0x488 Size(8)

	void UserConstructionScript(); // Function B.B.UserConstructionScript(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown UberGraphFrame; //  0xcf8 Size(8)
	struct Unknown SplashParticleComp; //  0xd00 Size(8)
	struct Unknown PlaneParticleComp; //  0xd08 Size(8)
	struct Unknown TimerHandle_RemoveAllWaterParti; //  0xd10 Size(8)

	void ReceiveTick(float DeltaSeconds); // Function B.B.ReceiveTick(Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown BravoHotelVehicleTire_RR; //  0xd18 Size(8)
	struct Unknown BravoHotelVehicleTire_RL; //  0xd20 Size(8)
	struct Unknown BravoHotelVehicleTire_FR; //  0xd28 Size(8)
	struct Unknown BravoHotelVehicleTire_FL; //  0xd30 Size(8)
	struct Unknown B; //  0xd38 Size(8)
	struct Unknown B; //  0xd40 Size(8)
	struct Unknown BravoHotelVehicleSeat04; //  0xd48 Size(8)
	struct Unknown BravoHotelVehicleSeat03; //  0xd50 Size(8)
	struct Unknown BravoHotelVehicleSeat02; //  0xd58 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown BravoHotelVehicleTire_RR; //  0xd18 Size(8)
	struct Unknown BravoHotelVehicleTire_RL; //  0xd20 Size(8)
	struct Unknown BravoHotelVehicleTire_FR; //  0xd28 Size(8)
	struct Unknown BravoHotelVehicleTire_FL; //  0xd30 Size(8)
	struct Unknown B; //  0xd38 Size(8)
	struct Unknown B; //  0xd40 Size(8)
	struct Unknown BravoHotelVehicleSeat04; //  0xd48 Size(8)
	struct Unknown BravoHotelVehicleSeat03; //  0xd50 Size(8)
	struct Unknown BravoHotelVehicleSeat02; //  0xd58 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown BravoHotelVehicleTire_RR; //  0xd18 Size(8)
	struct Unknown BravoHotelVehicleTire_RL; //  0xd20 Size(8)
	struct Unknown BravoHotelVehicleTire_FR; //  0xd28 Size(8)
	struct Unknown BravoHotelVehicleTire_FL; //  0xd30 Size(8)
	struct Unknown B; //  0xd38 Size(8)
	struct Unknown B; //  0xd40 Size(8)
	struct Unknown BravoHotelVehicleSeat04; //  0xd48 Size(8)
	struct Unknown BravoHotelVehicleSeat03; //  0xd50 Size(8)
	struct Unknown BravoHotelVehicleSeat02; //  0xd58 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown UberGraphFrame; //  0xd18 Size(8)
	struct Unknown BravoHotelVehicleTire_RR; //  0xd20 Size(8)
	struct Unknown BravoHotelVehicleTire_RL; //  0xd28 Size(8)
	struct Unknown BravoHotelVehicleTire_FR; //  0xd30 Size(8)
	struct Unknown BravoHotelVehicleTire_FL; //  0xd38 Size(8)
	struct Unknown B; //  0xd40 Size(8)
	struct Unknown B; //  0xd48 Size(8)
	struct Unknown B; //  0xd50 Size(8)
	struct Unknown B; //  0xd58 Size(8)
	struct Unknown BravoHotelVehicleSeat04; //  0xd60 Size(8)
	struct Unknown BravoHotelVehicleSeat03; //  0xd68 Size(8)
	struct Unknown BravoHotelVehicleSeat02; //  0xd70 Size(8)

	void ReceiveTick(float DeltaSeconds); // Function B.B.ReceiveTick(Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown BravoHotelVehicleTire_RR; //  0xd18 Size(8)
	struct Unknown BravoHotelVehicleTire_RL; //  0xd20 Size(8)
	struct Unknown BravoHotelVehicleTire_FR; //  0xd28 Size(8)
	struct Unknown BravoHotelVehicleTire_FL; //  0xd30 Size(8)
	struct Unknown B; //  0xd38 Size(8)
	struct Unknown B; //  0xd40 Size(8)
	struct Unknown BravoHotelVehicleSeat04; //  0xd48 Size(8)
	struct Unknown BravoHotelVehicleSeat03; //  0xd50 Size(8)
	struct Unknown BravoHotelVehicleSeat02; //  0xd58 Size(8)
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown UberGraphFrame; //  0xd18 Size(8)
	struct Unknown BravoHotelVehicleTire_RR; //  0xd20 Size(8)
	struct Unknown BravoHotelVehicleTire_RL; //  0xd28 Size(8)
	struct Unknown BravoHotelVehicleTire_FR; //  0xd30 Size(8)
	struct Unknown BravoHotelVehicleTire_FL; //  0xd38 Size(8)
	struct Unknown VehicleSeatCollision1; //  0xd40 Size(8)
	struct Unknown VehicleSeatCollision; //  0xd48 Size(8)
	struct Unknown BravoHotelVehicleSeat02; //  0xd50 Size(8)
	struct Unknown ; //  0xd58 Size(8)

	void ReceiveTick(float DeltaSeconds); // Function B.B.ReceiveTick(Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown UberGraphFrame; //  0xd18 Size(8)
	struct Unknown AdditionalStuntRotation; //  0xd20 Size(c)
	char Pressed_Pitch; //  0xd2c Size(1)
	char Pressed_Roll; //  0xd2d Size(1)
	char AutoRotate_Roll; //  0xd2e Size(1)
	char CanStunt_Roll; //  0xd2f Size(1)
	float StuntValue_Pitch; //  0xd30 Size(4)
	float StuntValue_Roll; //  0xd34 Size(4)
	float StuntInterpSpeed_Pitch; //  0xd38 Size(4)
	float StuntInterpSpeed_Roll; //  0xd3c Size(4)
	float StuntInterpSpeedRate; //  0xd40 Size(4)
	float StuntDirection_Pitch; //  0xd44 Size(4)
	float StuntDirection_Roll; //  0xd48 Size(4)
	float TargetStunt_Pitch; //  0xd4c Size(4)
	float TargetStunt_Roll; //  0xd50 Size(4)
	float ParkingForceValue; //  0xd54 Size(4)
	float RaisingForceValue; //  0xd58 Size(4)
	struct Unknown Handle_SetParkingForce; //  0xd60 Size(8)

	void Stunt(); // Function B.B.Stunt(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass B.B
struct AB : AB {
	struct Unknown BravoHotelVehicleTire_R; //  0xd68 Size(8)
	struct Unknown BravoHotelVehicleTire_F; //  0xd70 Size(8)
	struct Unknown VehicleSeatCollision1; //  0xd78 Size(8)
	struct Unknown VehicleSeatCollision; //  0xd80 Size(8)
	struct Unknown BravoHotelVehicleSeat02; //  0xd88 Size(8)
};

