// WidgetBlueprintGeneratedClass Blac.U
class UU : UU {
	struct Unknown UberGraphFrame; // 0x3D8 (8)
	struct Unknown BT; // 0x3E0 (8)
	struct Unknown BT; // 0x3E8 (8)
	struct Unknown BT; // 0x3F0 (8)
	struct Unknown C; // 0x3F8 (8)
	struct Unknown IM; // 0x400 (8)
	struct Unknown IM; // 0x408 (8)
	struct Unknown IM; // 0x410 (8)
	struct Unknown IM; // 0x418 (8)
	struct Unknown IM; // 0x420 (8)
	struct Unknown IM; // 0x428 (8)
	struct Unknown Menu02; // 0x430 (8)
	struct Unknown Menu03; // 0x438 (8)
	struct Unknown Menu04; // 0x440 (8)
	struct Unknown Overlay_Mask; // 0x448 (8)
	struct Unknown TX; // 0x450 (8)
	struct Unknown TX; // 0x458 (8)
	struct Unknown TX; // 0x460 (8)
	struct Unknown TX; // 0x468 (8)
	struct Unknown TX; // 0x470 (8)
	struct Unknown TX; // 0x478 (8)
	struct Unknown TX; // 0x480 (8)
	struct FText PerkSlot; // 0x488 (24)

	void SetIconTexture(struct TSoftObjectPtr<Unknown> IconTexture); // Function Blac.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnLoaded_9CBCD238440D1A899A0522A5A29885AA(struct Unknown Loaded); // Function Blac.U.OnLoaded_9CBCD238440D1A899A0522A5A29885AA(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Construct(); // Function Blac.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void AysncLoading(struct TSoftObjectPtr<Unknown> IconTexture); // Function Blac.U.AysncLoading(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function Blac.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SwitchMenu(); // Function Blac.U.SwitchMenu(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SwitchSlot(); // Function Blac.U.SwitchSlot(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetData(struct Unknown Data); // Function Blac.U.SetData(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function Blac.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// WidgetBlueprintGeneratedClass Blac.U
class UU : UU {
	struct Unknown UberGraphFrame; // 0x3D8 (8)
	struct Unknown BT; // 0x3E0 (8)
	struct Unknown BT; // 0x3E8 (8)
	struct Unknown BT; // 0x3F0 (8)
	struct Unknown BT; // 0x3F8 (8)
	struct Unknown BT; // 0x400 (8)
	struct Unknown BT; // 0x408 (8)
	struct Unknown BT; // 0x410 (8)
	struct Unknown BT; // 0x418 (8)
	struct Unknown C; // 0x420 (8)
	struct Unknown IM; // 0x428 (8)
	struct Unknown IM; // 0x430 (8)
	struct Unknown IM; // 0x438 (8)
	struct Unknown IM; // 0x440 (8)
	struct Unknown IM; // 0x448 (8)
	struct Unknown IM; // 0x450 (8)
	struct Unknown Menu02; // 0x458 (8)
	struct Unknown Menu03; // 0x460 (8)
	struct Unknown Menu04; // 0x468 (8)
	struct Unknown Menu05; // 0x470 (8)
	struct Unknown Menu06; // 0x478 (8)
	struct Unknown Menu07; // 0x480 (8)
	struct Unknown Menu08; // 0x488 (8)
	struct Unknown Menu09; // 0x490 (8)
	struct Unknown Overlay_Mask; // 0x498 (8)
	struct Unknown TX; // 0x4A0 (8)
	struct Unknown TX; // 0x4A8 (8)
	struct Unknown TX; // 0x4B0 (8)
	struct Unknown TX; // 0x4B8 (8)
	struct Unknown TX; // 0x4C0 (8)
	struct Unknown TX; // 0x4C8 (8)
	struct Unknown TX; // 0x4D0 (8)
	struct Unknown TX; // 0x4D8 (8)
	struct Unknown TX; // 0x4E0 (8)
	struct Unknown TX; // 0x4E8 (8)
	struct Unknown TX; // 0x4F0 (8)
	struct Unknown TX; // 0x4F8 (8)
	struct Unknown TX; // 0x500 (8)
	struct Unknown TX; // 0x508 (8)
	struct Unknown TX; // 0x510 (8)
	struct Unknown TX; // 0x518 (8)
	struct Unknown TX; // 0x520 (8)

	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetIconTexture(struct TSoftObjectPtr<Unknown> IconTexture); // Function Blac.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnLoaded_F81B5B0343A0A1A16D1EBABD173C2F15(struct Unknown Loaded); // Function BlackSlot.U.OnLoaded_F81B5B0343A0A1A16D1EBABD173C2F15(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Construct(); // Function Blac.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac1.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function Blac.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void AysncLoading(struct TSoftObjectPtr<Unknown> IconTexture); // Function BlackSlot.U.AysncLoading(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SwitchMenu(); // Function Blac.U.SwitchMenu(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SwitchSlot(); // Function Blac.U.SwitchSlot(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function BlacC.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function Blac.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// WidgetBlueprintGeneratedClass Blacs.U
class UU : UU {
	struct Unknown UberGraphFrame; // 0x3D8 (8)
	struct Unknown BT; // 0x3E0 (8)
	struct Unknown C; // 0x3E8 (8)
	struct Unknown IM; // 0x3F0 (8)
	struct Unknown IM; // 0x3F8 (8)
	struct Unknown IM; // 0x400 (8)
	struct Unknown IM; // 0x408 (8)
	struct Unknown IM; // 0x410 (8)
	struct Unknown IM; // 0x418 (8)
	struct Unknown Menu02; // 0x420 (8)
	struct Unknown Overlay_Mask; // 0x428 (8)
	struct Unknown TX; // 0x430 (8)
	struct Unknown TX; // 0x438 (8)
	struct Unknown TX; // 0x440 (8)

	void SetSlotInfo(struct Unknown BlackmarketDataInfo); // Function Blacs.U.SetSlotInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	struct Unknown OnClick(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function BlacVECTO.U.OnClick(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetIconTexture(struct TSoftObjectPtr<Unknown> IconTexture); // Function Blac.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnLoaded_7C34C7D64FB053FED5EAACB72A3EAAD0(struct Unknown Loaded); // Function Blac.U.OnLoaded_7C34C7D64FB053FED5EAACB72A3EAAD0(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Construct(); // Function BlacD.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blacs.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function BlacD.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void AysncLoading(struct TSoftObjectPtr<Unknown> IconTexture); // Function Blac.U.AysncLoading(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SwitchMenu(); // Function Blac.U.SwitchMenu(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SwitchSlot(); // Function Blac.U.SwitchSlot(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function Blac.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// WidgetBlueprintGeneratedClass Blac.U
class UU : UU {
	struct Unknown UberGraphFrame; // 0x3D8 (8)
	struct Unknown BT; // 0x3E0 (8)
	struct Unknown BT; // 0x3E8 (8)
	struct Unknown BT; // 0x3F0 (8)
	struct Unknown BT; // 0x3F8 (8)
	struct Unknown BT; // 0x400 (8)
	struct Unknown C; // 0x408 (8)
	struct Unknown IM; // 0x410 (8)
	struct Unknown IM; // 0x418 (8)
	struct Unknown IM; // 0x420 (8)
	struct Unknown IM; // 0x428 (8)
	struct Unknown IM; // 0x430 (8)
	struct Unknown IM; // 0x438 (8)
	struct Unknown Menu02; // 0x440 (8)
	struct Unknown Menu03; // 0x448 (8)
	struct Unknown Menu04; // 0x450 (8)
	struct Unknown Menu05; // 0x458 (8)
	struct Unknown Menu06; // 0x460 (8)
	struct Unknown Overlay_Mask; // 0x468 (8)
	struct Unknown TX; // 0x470 (8)
	struct Unknown TX; // 0x478 (8)
	struct Unknown TX; // 0x480 (8)
	struct Unknown TX; // 0x488 (8)
	struct Unknown TX; // 0x490 (8)
	struct Unknown TX; // 0x498 (8)
	struct Unknown TX; // 0x4A0 (8)
	struct Unknown TX; // 0x4A8 (8)
	struct Unknown TX; // 0x4B0 (8)
	struct Unknown TX; // 0x4B8 (8)
	struct Unknown TX; // 0x4C0 (8)

	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetIconTexture(struct TSoftObjectPtr<Unknown> IconTexture); // Function Blac.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnLoaded_F6A17E404AD1BD4EA73593A8AF9F47DF(struct Unknown Loaded); // Function Blac.U.OnLoaded_F6A17E404AD1BD4EA73593A8AF9F47DF(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Construct(); // Function Blac.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function Blac.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void AysncLoading(struct TSoftObjectPtr<Unknown> IconTexture); // Function Blac.U.AysncLoading(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SwitchMenu(); // Function Blac.U.SwitchMenu(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SwitchSlot(); // Function Blac.U.SwitchSlot(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function BlacD.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function Blac.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// WidgetBlueprintGeneratedClass Blac.U
class UU : UBravoHotelDevelopmentBlackMarket {
	struct Unknown UberGraphFrame; // 0x2E8 (8)
	struct Unknown AllItem; // 0x2F0 (8)
	struct Unknown Button_1004; // 0x2F8 (8)
	struct Unknown CheckBox_1; // 0x300 (8)
	struct Unknown C; // 0x308 (8)
	struct Unknown IM; // 0x310 (8)
	struct Unknown IM; // 0x318 (8)
	struct Unknown IM; // 0x320 (8)
	struct Unknown IM; // 0x328 (8)
	struct Unknown IM; // 0x330 (8)
	struct Unknown IM; // 0x338 (8)
	struct Unknown IM; // 0x340 (8)
	struct Unknown IM; // 0x348 (8)
	struct Unknown IM; // 0x350 (8)
	struct Unknown IM; // 0x358 (8)
	struct Unknown IM; // 0x360 (8)
	struct Unknown Text_culture; // 0x368 (8)
	struct Unknown U; // 0x370 (8)
	struct Unknown U; // 0x378 (8)
	struct Unknown W; // 0x380 (8)
	struct Unknown WrapBox_6; // 0x388 (8)
	enum class Unknow CurrentTab; // 0x390 (1)
	struct Unknown SelectTabColor; // 0x394 (16)
	struct Unknown UnSelectTabColor; // 0x3A4 (16)
	char ShowWorkInProcess : 0; // 0x3B4 (1)
	struct TArray<Unknown> ItemList; // 0x3B8 (16)
	enum class Unknow SelectedWeaponSubTab; // 0x3C8 (1)
	enum class Unknow SelectedAttachmentSubTab; // 0x3C9 (1)
	enum class Unknow SelectedWearableSubTab; // 0x3CA (1)
	enum class Unknow SelectedGearSubTab; // 0x3CB (1)
	enum class Unknow SelectedCustomSubTab; // 0x3CC (1)
	struct TArray<Unknown> SortTypeList; // 0x3D0 (16)
	struct TArray<Unknown> WeaponAscendList; // 0x3E0 (16)
	int32_t CurrentWeaponSortType; // 0x3F0 (4)
	struct TArray<Unknown> AmmoAscendList; // 0x3F8 (16)
	int32_t CurrentAmmoSortType; // 0x408 (4)
	struct TArray<Unknown> AttachmentAscendList; // 0x410 (16)
	int32_t CurrentAttachmentSortType; // 0x420 (4)
	int32_t CurrentWearableSortType; // 0x424 (4)
	int32_t CurrentConsumableSortType; // 0x428 (4)
	int32_t CurrentCustomSortType; // 0x42C (4)
	int32_t CurrentVehicleSortType; // 0x430 (4)
	struct TArray<Unknown> WearableAscendList; // 0x438 (16)
	struct TArray<Unknown> ConsumableAscendList; // 0x448 (16)
	struct TArray<Unknown> CustomAscendList; // 0x458 (16)
	struct TArray<Unknown> VehicleAscendList; // 0x468 (16)
	struct Unknown SaveData; // 0x478 (8)
	struct TArray<Unknown> GearAscendList; // 0x480 (16)
	int32_t CurrentGearSortType; // 0x490 (4)
	struct FString BlackmarketSaveSlotName; // 0x498 (16)
	int32_t TestIndex; // 0x4A8 (4)
	struct TArray<Unknown> PerkAscendList; // 0x4B0 (16)
	int32_t CurrentPerkSortType; // 0x4C0 (4)
	enum class Unknow SelectedPerkSubTab; // 0x4C4 (1)
	int32_t CurrentPresetSortType; // 0x4C8 (4)
	struct TArray<Unknown> PresetAscendList; // 0x4D0 (16)
	struct FName SelectedPerkClass; // 0x4E0 (8)
	enum class Unknow SelectedConsumableSubTab; // 0x4E8 (1)

	void IsCorrectPresetSlot(enum class Unknow status, char& bResult); // Function Blac.U.IsCorrectPresetSlot(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void InitPresetList(); // Function Blac.U.InitPresetList(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetPresetSlot_Impl(int32_t SortType, char bHideOption); // Function Blac.U.SetPresetSlot_Impl(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void IsCorrectPerk(enum class Unknow Type, struct TArray<Unknown>& Index, enum class Unknow status, char& bResult); // Function Blac.U.IsCorrectPerk(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetPerkSlot_Impl(int32_t SortType, char bHideOption); // Function Blac.U.SetPerkSlot_Impl(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void InitPerkList(); // Function Blac.U.InitPerkList(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetGearSlot_Impl(int32_t SortType, char bHideOption); // Function Blac.U.SetGearSlot_Impl(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void IsCorrectGear(enum class Unknow Type, enum class Unknow status, char& bResult); // Function Blac.U.IsCorrectGear(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void InitGearList(); // Function Blac.U.InitGearList(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void IsCorrectVehicleSlot(enum class Unknow status, char& bResult); // Function Blac.U.IsCorrectVehicleSlot(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void InitVehicleList(); // Function Blac.U.InitVehicleList(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetCustomizeSlot_Impl(int32_t SortType, char bHideOption); // Function Blac.U.SetCustomizeSlot_Impl(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void InitCustomizeData(); // Function Blac.U.InitCustomizeData(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetConsumableSlot_Impl(int32_t SortType, char bHideOption); // Function Blac.U.SetConsumableSlot_Impl(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void InitConsumableList(); // Function Blac.U.InitConsumableList(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void IsCorrectConsumableSlot(enum class Unknow Type, enum class Unknow status, char& bResult); // Function Blac.U.IsCorrectConsumableSlot(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetWearableSlot_Impl(int32_t SortType, char bHideOption); // Function Blac.U.SetWearableSlot_Impl(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void InitWearableList(); // Function Blac.U.InitWearableList(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void InitAttachmentList(); // Function Blac.U.InitAttachmentList(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetAttachmentSlot_Impl(int32_t SortType, char bHideOption); // Function Blac.U.SetAttachmentSlot_Impl(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void IsCorrectAmmo(enum class Unknow TabType, enum class Unknow status, char& bResult); // Function Blac.U.IsCorrectAmmo(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetAmmoSlot_Impl(int32_t SortType, char bHideOption); // Function Blac.U.SetAmmoSlot_Impl(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void InitAmmoList(); // Function Blac.U.InitAmmoList(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetWeaponSlot_Impl(int32_t SortType, char bHideOption); // Function Blac.U.SetWeaponSlot_Impl(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void InitWeaponList(); // Function Blac.U.InitWeaponList(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void IsCorrectCustomize(enum class Unknow Type, enum class Unknow status, char& bResult); // Function Blac.U.IsCorrectCustomize(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void IsCorrectWearable(enum class Unknow Type, enum class Unknow status, char& bResult); // Function Blac.U.IsCorrectWearable(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void IsCorrectAttachment(enum class Unknow Type, enum class Unknow status, char& bResult); // Function Blac.U.IsCorrectAttachment(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetVehicleSlot_Impl(int32_t SortType, char bHideOption); // Function Blac.U.SetVehicleSlot_Impl(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetCustomizeSlot2(struct FName ItemRowName, struct Unknown InventoryItemDetailInfo); // Function Blac.U.SetCustomizeSlot2(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void IsCorrectWeapon(enum class Unknow WeaponType, enum class Unknow status, char& bResult); // Function Blac.U.IsCorrectWeapon(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetTab(enum class Unknow TabType); // Function Blac.U.SetTab(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetData(); // Function Blac.U.SetData(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void InitData(); // Function Blac.U.InitData(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Construct(); // Function Blac.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__CheckBox_0_K2Node_ComponentBoundEvent_26_OnCheckBoxComponentStateChanged__DelegateSignature(char bIsChecked); // Function Blac.U.BndEvt__CheckBox_0_K2Node_ComponentBoundEvent_26_OnCheckBoxComponentStateChanged__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SaveGameData(); // Function Blac.U.SaveGameData(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__Button_1003_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function Blac.U.BndEvt__Button_1003_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetText_culture(); // Function Blac.U.SetText_culture(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__AllItem_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function Blac.U.BndEvt__AllItem_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BlackMarketItemExecute(struct Unknown ItemData); // Function Blac.U.BlackMarketItemExecute(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BlackMarketCustomItemExecute(struct Unknown ItemData); // Function Blac.U.BlackMarketCustomItemExecute(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetAmmoSlot(int32_t SlotType, char bHideOption); // Function Blac.U.SetAmmoSlot(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetConsumableSlot(int32_t SlotType, char bHideOption); // Function Blac.U.SetConsumableSlot(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetAttachmentSlot(int32_t SlotType, char bHideOption); // Function Blac.U.SetAttachmentSlot(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetCustomizeSlot(int32_t SlotType, char bHideOption); // Function Blac.U.SetCustomizeSlot(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetGearSlot(int32_t SlotType, char bHideOption); // Function Blac.U.SetGearSlot(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetPerkSlot(int32_t SlotType, char bHideOption); // Function Blac.U.SetPerkSlot(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetPresetSlot(int32_t SlotType, char bHideOption); // Function Blac.U.SetPresetSlot(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetVehicleSlot(int32_t SlotType, char bHideOption); // Function Blac.U.SetVehicleSlot(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetWeaponSlot(int32_t SlotType, char bHideOption); // Function Blac.U.SetWeaponSlot(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetWearableSlot(int32_t SlotType, char bHideOption); // Function Blac.U.SetWearableSlot(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function Blac.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// BlueprintGeneratedClass Blac.B
class UB : USaveGame {
	struct TArray<Unknown> WearableItemList; // 0x28 (16)
	struct TArray<Unknown> CustomItemList; // 0x38 (16)
	struct TArray<Unknown> WeaponItemList; // 0x48 (16)
	struct TArray<Unknown> InBackpackItemList; // 0x58 (16)
	struct Unknown AppearanceInfo; // 0x68 (20)
};

// WidgetBlueprintGeneratedClass Blac.U
class UU : UUserWidget {
	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Button_Tab; // 0x250 (8)
	struct Unknown Image_Check; // 0x258 (8)
	struct Unknown TextBlock_TabName; // 0x260 (8)
	struct Unknown BlackMarket_SubTab; // 0x268 (8)
	enum class Unknow TabType; // 0x270 (1)
	struct FText TabName; // 0x278 (24)
	struct FName TabIndex; // 0x290 (8)
	char Selected : 0; // 0x298 (1)

	struct Unknown Get_TextBlock_TabName_ColorAndOpacity_1(); // Function Blac.U.Get_TextBlock_TabName_ColorAndOpacity_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	enum class Unknow Get_Image_Check_Visibility_1(); // Function Blac.U.Get_Image_Check_Visibility_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__Button_Tab_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function Blac.U.BndEvt__Button_Tab_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function Blac.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// WidgetBlueprintGeneratedClass Blac.U
class UU : UU {
	struct Unknown UberGraphFrame; // 0x3D8 (8)
	struct Unknown BT; // 0x3E0 (8)
	struct Unknown BT; // 0x3E8 (8)
	struct Unknown BT; // 0x3F0 (8)
	struct Unknown BT; // 0x3F8 (8)
	struct Unknown BT; // 0x400 (8)
	struct Unknown C; // 0x408 (8)
	struct Unknown IM; // 0x410 (8)
	struct Unknown IM; // 0x418 (8)
	struct Unknown IM; // 0x420 (8)
	struct Unknown IM; // 0x428 (8)
	struct Unknown IM; // 0x430 (8)
	struct Unknown IM; // 0x438 (8)
	struct Unknown Menu02; // 0x440 (8)
	struct Unknown Menu03; // 0x448 (8)
	struct Unknown Menu04; // 0x450 (8)
	struct Unknown Menu05; // 0x458 (8)
	struct Unknown Menu06; // 0x460 (8)
	struct Unknown Overlay_Mask; // 0x468 (8)
	struct Unknown TX; // 0x470 (8)
	struct Unknown TX; // 0x478 (8)
	struct Unknown TX; // 0x480 (8)
	struct Unknown TX; // 0x488 (8)
	struct Unknown TX; // 0x490 (8)
	struct Unknown TX; // 0x498 (8)
	struct Unknown TX; // 0x4A0 (8)
	struct Unknown TX; // 0x4A8 (8)
	struct Unknown TX; // 0x4B0 (8)
	struct Unknown TX; // 0x4B8 (8)
	struct Unknown TX; // 0x4C0 (8)

	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetIconTexture(struct TSoftObjectPtr<Unknown> IconTexture); // Function Blac.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnLoaded_A157F79F471B0D31224E8281D33433DF(struct Unknown Loaded); // Function Blac.U.OnLoaded_A157F79F471B0D31224E8281D33433DF(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Construct(); // Function Blac.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function Blac.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void AysncLoading(struct TSoftObjectPtr<Unknown> IconTexture); // Function Blac.U.AysncLoading(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SwitchMenu(); // Function Blac.U.SwitchMenu(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SwitchSlot(); // Function Blac.U.SwitchSlot(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function BlacD.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function Blac.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// WidgetBlueprintGeneratedClass Blac.U
class UU : UUserWidget {
	struct FName ItemRowName; // 0x248 (8)
	struct FString ConsoleCommandString; // 0x250 (16)
	struct FString GiveCount; // 0x260 (16)
	enum class Unknow ItemType; // 0x270 (1)
	struct Unknown Icon; // 0x278 (8)
	char bSlot : 0; // 0x280 (1)
	int32_t Count; // 0x284 (4)
	struct FName AmmoName; // 0x288 (8)
	struct FString AmmoCommandString; // 0x290 (16)
	int32_t AmmoCount; // 0x2A0 (4)
	struct Unknown BlackMarketMainRef; // 0x2A8 (8)
	struct Unknown BlackmarketDataInfo; // 0x2B0 (280)
	struct TArray<Unknown> ConsoleMultiCommandString; // 0x3C8 (16)

	void SetConsoleMultiCommandString(struct TArray<Unknown>& Str); // Function Blac.U.SetConsoleMultiCommandString(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetItemMultiCommand(struct FName ItemRowName, enum class Unknow ItemType, struct TArray<Unknown>& Command); // Function Blac.U.SetItemMultiCommand(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetData(struct Unknown Data); // Function Blac.U.SetData(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetAmmoInfoForWeapon(struct FName AmmoName, int32_t Count); // Function Blac.U.SetAmmoInfoForWeapon(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetItemType(enum class Unknow ItemType); // Function Blac.U.SetItemType(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void RunCommand(); // Function Blac.U.RunCommand(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetConsoleCommandString(struct FString Str); // Function Blac.U.SetConsoleCommandString(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetItemCommand(struct FName ItemRowName, enum class Unknow ItemType, struct FString Command); // Function Blac.U.SetItemCommand(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// WidgetBlueprintGeneratedClass Blac.U
class UU : UU {
	struct Unknown UberGraphFrame; // 0x3D8 (8)
	struct Unknown BT; // 0x3E0 (8)
	struct Unknown BT; // 0x3E8 (8)
	struct Unknown BT; // 0x3F0 (8)
	struct Unknown BT; // 0x3F8 (8)
	struct Unknown BT; // 0x400 (8)
	struct Unknown BT; // 0x408 (8)
	struct Unknown BT; // 0x410 (8)
	struct Unknown BT; // 0x418 (8)
	struct Unknown BT; // 0x420 (8)
	struct Unknown BT; // 0x428 (8)
	struct Unknown C; // 0x430 (8)
	struct Unknown IM; // 0x438 (8)
	struct Unknown IM; // 0x440 (8)
	struct Unknown IM; // 0x448 (8)
	struct Unknown IM; // 0x450 (8)
	struct Unknown IM; // 0x458 (8)
	struct Unknown IM; // 0x460 (8)
	struct Unknown Menu02; // 0x468 (8)
	struct Unknown Menu03; // 0x470 (8)
	struct Unknown Menu04; // 0x478 (8)
	struct Unknown Menu05; // 0x480 (8)
	struct Unknown Menu06; // 0x488 (8)
	struct Unknown Menu07; // 0x490 (8)
	struct Unknown Menu08; // 0x498 (8)
	struct Unknown Menu09; // 0x4A0 (8)
	struct Unknown Menu10; // 0x4A8 (8)
	struct Unknown Menu11; // 0x4B0 (8)
	struct Unknown Overlay_Mask; // 0x4B8 (8)
	struct Unknown TX; // 0x4C0 (8)
	struct Unknown TX; // 0x4C8 (8)
	struct Unknown TX; // 0x4D0 (8)
	struct Unknown TX; // 0x4D8 (8)
	struct Unknown TX; // 0x4E0 (8)
	struct Unknown TX; // 0x4E8 (8)
	struct Unknown TX; // 0x4F0 (8)
	struct Unknown TX; // 0x4F8 (8)
	struct Unknown TX; // 0x500 (8)
	struct Unknown TX; // 0x508 (8)
	struct Unknown TX; // 0x510 (8)
	struct Unknown TX; // 0x518 (8)
	struct Unknown TX; // 0x520 (8)
	struct Unknown TX; // 0x528 (8)
	struct Unknown TX; // 0x530 (8)
	struct Unknown TX; // 0x538 (8)
	struct Unknown TX; // 0x540 (8)
	struct Unknown TX; // 0x548 (8)
	struct Unknown TX; // 0x550 (8)
	struct Unknown TX; // 0x558 (8)
	struct Unknown TX; // 0x560 (8)

	void SetIconTexture(struct TSoftObjectPtr<Unknown> IconTexture); // Function Blac.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	struct Unknown On_IM_2(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.On_IM_2(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnLoaded_9693EBAC46E1F6BA769CC6A2AB0B68E0(struct Unknown Loaded); // Function Blac.U.OnLoaded_9693EBAC46E1F6BA769CC6A2AB0B68E0(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Construct(); // Function Blac.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function BlacE.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function Blac.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void AysncLoading(struct TSoftObjectPtr<Unknown> IconTexture); // Function Blac.U.AysncLoading(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SwitchMenu(); // Function Blac.U.SwitchMenu(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SwitchSlot(); // Function Blac.U.SwitchSlot(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function Blac.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// WidgetBlueprintGeneratedClass Blac.U
class UU : UU {
	struct Unknown UberGraphFrame; // 0x3D8 (8)
	struct Unknown BT; // 0x3E0 (8)
	struct Unknown C; // 0x3E8 (8)
	struct Unknown IM; // 0x3F0 (8)
	struct Unknown IM; // 0x3F8 (8)
	struct Unknown IM; // 0x400 (8)
	struct Unknown IM; // 0x408 (8)
	struct Unknown IM; // 0x410 (8)
	struct Unknown IM; // 0x418 (8)
	struct Unknown Menu02; // 0x420 (8)
	struct Unknown Overlay_Mask; // 0x428 (8)
	struct Unknown TX; // 0x430 (8)
	struct Unknown TX; // 0x438 (8)
	struct Unknown TX; // 0x440 (8)

	void SetIconTexture(struct TSoftObjectPtr<Unknown> IconTexture); // Function Blac.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnLoaded_65481F2E4FBDAFF739C1CA99F79D422C(struct Unknown Loaded); // Function Blac.U.OnLoaded_65481F2E4FBDAFF739C1CA99F79D422C(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Construct(); // Function Blac.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void AysncLoading(struct TSoftObjectPtr<Unknown> IconTexture); // Function Blac2.U.AysncLoading(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac2.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function Blac2.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SwitchMenu(); // Function Blac.U.SwitchMenu(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SwitchSlot(); // Function Blac.U.SwitchSlot(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function Blac.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// WidgetBlueprintGeneratedClass Blac.U
class UU : UU {
	struct Unknown UberGraphFrame; // 0x3D8 (8)
	struct Unknown BT; // 0x3E0 (8)
	struct Unknown BT; // 0x3E8 (8)
	struct Unknown C; // 0x3F0 (8)
	struct Unknown IM; // 0x3F8 (8)
	struct Unknown IM; // 0x400 (8)
	struct Unknown IM; // 0x408 (8)
	struct Unknown IM; // 0x410 (8)
	struct Unknown IM; // 0x418 (8)
	struct Unknown IM; // 0x420 (8)
	struct Unknown Menu02; // 0x428 (8)
	struct Unknown Menu03; // 0x430 (8)
	struct Unknown Overlay_Mask; // 0x438 (8)
	struct Unknown TX; // 0x440 (8)
	struct Unknown TX; // 0x448 (8)
	struct Unknown TX; // 0x450 (8)
	struct Unknown TX; // 0x458 (8)
	struct Unknown TX; // 0x460 (8)

	void SetIconTexture(struct TSoftObjectPtr<Unknown> IconTexture); // Function Blac.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnLoaded_B9C38FBE4303B12CB7C28ABE281A371A(struct Unknown Loaded); // Function Blac.U.OnLoaded_B9C38FBE4303B12CB7C28ABE281A371A(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Construct(); // Function Blac.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void AysncLoading(struct TSoftObjectPtr<Unknown> IconTexture); // Function Blac.U.AysncLoading(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function Blac.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SwitchMenu(); // Function Blac.U.SwitchMenu(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SwitchSlot(); // Function Blac.U.SwitchSlot(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void RunCommand(); // Function Blac.U.RunCommand(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function Blac.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// WidgetBlueprintGeneratedClass Blac.U
class UU : UU {
	struct Unknown UberGraphFrame; // 0x3D8 (8)
	struct Unknown BT; // 0x3E0 (8)
	struct Unknown BT; // 0x3E8 (8)
	struct Unknown BT; // 0x3F0 (8)
	struct Unknown BT; // 0x3F8 (8)
	struct Unknown BT; // 0x400 (8)
	struct Unknown C; // 0x408 (8)
	struct Unknown IM; // 0x410 (8)
	struct Unknown IM; // 0x418 (8)
	struct Unknown IM; // 0x420 (8)
	struct Unknown IM; // 0x428 (8)
	struct Unknown IM; // 0x430 (8)
	struct Unknown IM; // 0x438 (8)
	struct Unknown Menu02; // 0x440 (8)
	struct Unknown Menu03; // 0x448 (8)
	struct Unknown Menu04; // 0x450 (8)
	struct Unknown Menu05; // 0x458 (8)
	struct Unknown Menu06; // 0x460 (8)
	struct Unknown Overlay_Mask; // 0x468 (8)
	struct Unknown TX; // 0x470 (8)
	struct Unknown TX; // 0x478 (8)
	struct Unknown TX; // 0x480 (8)
	struct Unknown TX; // 0x488 (8)
	struct Unknown TX; // 0x490 (8)
	struct Unknown TX; // 0x498 (8)
	struct Unknown TX; // 0x4A0 (8)
	struct Unknown TX; // 0x4A8 (8)
	struct Unknown TX; // 0x4B0 (8)
	struct Unknown TX; // 0x4B8 (8)
	struct Unknown TX; // 0x4C0 (8)

	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetIconTexture(struct TSoftObjectPtr<Unknown> ItemTexture); // Function Blac.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnLoaded_5699AF624A3322545E5B4781A35497A4(struct Unknown Loaded); // Function Blac1.U.OnLoaded_5699AF624A3322545E5B4781A35497A4(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Construct(); // Function BlacA.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function Blac.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void AysncLoading(struct TSoftObjectPtr<Unknown> IconTexture); // Function Blac.U.AysncLoading(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SwitchMenu(); // Function Blac.U.SwitchMenu(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SwitchSlot(); // Function Blac.U.SwitchSlot(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function Blac.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// WidgetBlueprintGeneratedClass Blac.U
class UU : UU {
	struct Unknown UberGraphFrame; // 0x3D8 (8)
	struct Unknown BT; // 0x3E0 (8)
	struct Unknown BT; // 0x3E8 (8)
	struct Unknown BT; // 0x3F0 (8)
	struct Unknown BT; // 0x3F8 (8)
	struct Unknown C; // 0x400 (8)
	struct Unknown IM; // 0x408 (8)
	struct Unknown IM; // 0x410 (8)
	struct Unknown IM; // 0x418 (8)
	struct Unknown IM; // 0x420 (8)
	struct Unknown IM; // 0x428 (8)
	struct Unknown IM; // 0x430 (8)
	struct Unknown Menu02; // 0x438 (8)
	struct Unknown Menu03; // 0x440 (8)
	struct Unknown Menu04; // 0x448 (8)
	struct Unknown Menu05; // 0x450 (8)
	struct Unknown Overlay_Mask; // 0x458 (8)
	struct Unknown TX; // 0x460 (8)
	struct Unknown TX; // 0x468 (8)
	struct Unknown TX; // 0x470 (8)
	struct Unknown TX; // 0x478 (8)
	struct Unknown TX; // 0x480 (8)
	struct Unknown TX; // 0x488 (8)
	struct Unknown TX; // 0x490 (8)
	struct Unknown TX; // 0x498 (8)
	struct Unknown TX; // 0x4A0 (8)

	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetIconTexture(struct TSoftObjectPtr<Unknown> IconTexture); // Function Blac.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnLoaded_CF7AEC2246CE5FCA548190A8C8AE4FB8(struct Unknown Loaded); // Function Blac.U.OnLoaded_CF7AEC2246CE5FCA548190A8C8AE4FB8(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Construct(); // Function BlacB.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function Blac.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void AysncLoading(struct TSoftObjectPtr<Unknown> IconTexture); // Function Blac.U.AysncLoading(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SwitchMenu(); // Function Blac.U.SwitchMenu(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SwitchSlot(); // Function Blac.U.SwitchSlot(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function Blac.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// BlueprintGeneratedClass BlacB.B
class UB : USaveGame {
	char bHideWorkInProgress : 0; // 0x28 (1)
	enum class Unknow MainTab; // 0x29 (1)
	enum class Unknow WeaponSubTab; // 0x2A (1)
	enum class Unknow AttachmentSubTab; // 0x2B (1)
	enum class Unknow WearableSubTab; // 0x2C (1)
	enum class Unknow CustomSubTab; // 0x2D (1)
	enum class Unknow GearSubTab; // 0x2E (1)
};

// WidgetBlueprintGeneratedClass Blac.U
class UU : UUserWidget {
	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown BT; // 0x250 (8)
	struct Unknown BT; // 0x258 (8)
	struct Unknown BT; // 0x260 (8)
	struct Unknown BT; // 0x268 (8)
	struct Unknown BT; // 0x270 (8)
	struct Unknown BT; // 0x278 (8)
	struct Unknown BT; // 0x280 (8)
	struct Unknown BT; // 0x288 (8)
	struct Unknown BT; // 0x290 (8)
	struct Unknown BT; // 0x298 (8)
	struct Unknown BT; // 0x2A0 (8)
	struct Unknown BT; // 0x2A8 (8)
	struct Unknown BT; // 0x2B0 (8)
	struct Unknown BT; // 0x2B8 (8)
	struct Unknown BT; // 0x2C0 (8)
	struct Unknown BT; // 0x2C8 (8)
	struct Unknown BT; // 0x2D0 (8)
	struct Unknown BT; // 0x2D8 (8)
	struct Unknown BT; // 0x2E0 (8)
	struct Unknown BT; // 0x2E8 (8)
	struct Unknown BT; // 0x2F0 (8)
	struct Unknown BT; // 0x2F8 (8)
	struct Unknown BT; // 0x300 (8)
	struct Unknown BT; // 0x308 (8)
	struct Unknown BT; // 0x310 (8)
	struct Unknown BT; // 0x318 (8)
	struct Unknown BT; // 0x320 (8)
	struct Unknown BT; // 0x328 (8)
	struct Unknown BT; // 0x330 (8)
	struct Unknown BT; // 0x338 (8)
	struct Unknown BT; // 0x340 (8)
	struct Unknown BT; // 0x348 (8)
	struct Unknown BT; // 0x350 (8)
	struct Unknown BT; // 0x358 (8)
	struct Unknown BT; // 0x360 (8)
	struct Unknown BT; // 0x368 (8)
	struct Unknown BT; // 0x370 (8)
	struct Unknown BT; // 0x378 (8)
	struct Unknown BT; // 0x380 (8)
	struct Unknown Button_1; // 0x388 (8)
	struct Unknown Button_2; // 0x390 (8)
	struct Unknown Button_3; // 0x398 (8)
	struct Unknown Button_4; // 0x3A0 (8)
	struct Unknown Image_1; // 0x3A8 (8)
	struct Unknown Image_2; // 0x3B0 (8)
	struct Unknown Image_3; // 0x3B8 (8)
	struct Unknown Image_4; // 0x3C0 (8)
	struct Unknown IM; // 0x3C8 (8)
	struct Unknown IM; // 0x3D0 (8)
	struct Unknown IM; // 0x3D8 (8)
	struct Unknown IM; // 0x3E0 (8)
	struct Unknown IM; // 0x3E8 (8)
	struct Unknown IM; // 0x3F0 (8)
	struct Unknown IM; // 0x3F8 (8)
	struct Unknown IM; // 0x400 (8)
	struct Unknown IM; // 0x408 (8)
	struct Unknown IM; // 0x410 (8)
	struct Unknown IM; // 0x418 (8)
	struct Unknown IM; // 0x420 (8)
	struct Unknown IM; // 0x428 (8)
	struct Unknown IM; // 0x430 (8)
	struct Unknown IM; // 0x438 (8)
	struct Unknown IM; // 0x440 (8)
	struct Unknown IM; // 0x448 (8)
	struct Unknown IM; // 0x450 (8)
	struct Unknown IM; // 0x458 (8)
	struct Unknown IM; // 0x460 (8)
	struct Unknown IM; // 0x468 (8)
	struct Unknown IM; // 0x470 (8)
	struct Unknown IM; // 0x478 (8)
	struct Unknown IM; // 0x480 (8)
	struct Unknown IM; // 0x488 (8)
	struct Unknown IM; // 0x490 (8)
	struct Unknown IM; // 0x498 (8)
	struct Unknown IM; // 0x4A0 (8)
	struct Unknown IM; // 0x4A8 (8)
	struct Unknown IM; // 0x4B0 (8)
	struct Unknown IM; // 0x4B8 (8)
	struct Unknown IM; // 0x4C0 (8)
	struct Unknown IM; // 0x4C8 (8)
	struct Unknown IM; // 0x4D0 (8)
	struct Unknown IM; // 0x4D8 (8)
	struct Unknown IM; // 0x4E0 (8)
	struct Unknown IM; // 0x4E8 (8)
	struct Unknown IM; // 0x4F0 (8)
	struct Unknown S; // 0x4F8 (8)
	struct Unknown S; // 0x500 (8)
	struct Unknown S; // 0x508 (8)
	struct Unknown S; // 0x510 (8)
	struct Unknown S; // 0x518 (8)
	struct Unknown S; // 0x520 (8)
	struct Unknown S; // 0x528 (8)
	struct Unknown TextBlock_2; // 0x530 (8)
	struct Unknown TextBlock_3; // 0x538 (8)
	struct Unknown TextBlock_4; // 0x540 (8)
	struct Unknown TextBlock_5; // 0x548 (8)
	struct Unknown TX; // 0x550 (8)
	struct Unknown TX; // 0x558 (8)
	struct Unknown TX; // 0x560 (8)
	struct Unknown TX; // 0x568 (8)
	struct Unknown TX; // 0x570 (8)
	struct Unknown TX; // 0x578 (8)
	struct Unknown TX; // 0x580 (8)
	struct Unknown TX; // 0x588 (8)
	struct Unknown TX; // 0x590 (8)
	struct Unknown TX; // 0x598 (8)
	struct Unknown TX; // 0x5A0 (8)
	struct Unknown TX; // 0x5A8 (8)
	struct Unknown TX; // 0x5B0 (8)
	struct Unknown TX; // 0x5B8 (8)
	struct Unknown TX; // 0x5C0 (8)
	struct Unknown TX; // 0x5C8 (8)
	struct Unknown TX; // 0x5D0 (8)
	struct Unknown TX; // 0x5D8 (8)
	struct Unknown TX; // 0x5E0 (8)
	struct Unknown TX; // 0x5E8 (8)
	struct Unknown TX; // 0x5F0 (8)
	struct Unknown TX; // 0x5F8 (8)
	struct Unknown TX; // 0x600 (8)
	struct Unknown TX; // 0x608 (8)
	struct Unknown TX; // 0x610 (8)
	struct Unknown TX; // 0x618 (8)
	struct Unknown TX; // 0x620 (8)
	struct Unknown TX; // 0x628 (8)
	struct Unknown TX; // 0x630 (8)
	struct Unknown TX; // 0x638 (8)
	struct Unknown TX; // 0x640 (8)
	struct Unknown TX; // 0x648 (8)
	struct Unknown TX; // 0x650 (8)
	struct Unknown TX; // 0x658 (8)
	struct Unknown TX; // 0x660 (8)
	struct Unknown TX; // 0x668 (8)
	struct Unknown TX; // 0x670 (8)
	struct Unknown TX; // 0x678 (8)
	struct Unknown VerticalBox_Perk; // 0x680 (8)
	struct Unknown NormalSlateColor; // 0x688 (40)
	struct Unknown SelectedSlateColor; // 0x6B0 (40)
	struct Unknown BlackMarketMainRef; // 0x6D8 (8)

	void SetConsumableData(enum class Unknow Type); // Function Blac.U.SetConsumableData(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void DeselectConsumableButton(enum class Unknow Type); // Function Blac.U.DeselectConsumableButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SelectConsumableButton(enum class Unknow Type); // Function Blac.U.SelectConsumableButton(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void CreatePerkTab(); // Function Blac.U.CreatePerkTab(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ClickSubTab(enum class Unknow TabType, struct FName Index); // Function Blac.U.ClickSubTab(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void DeselectPerkButton(enum class Unknow Type); // Function Blac.U.DeselectPerkButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetPerkData(enum class Unknow Type, struct FName Class); // Function Blac.U.SetPerkData(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SelectPerkButton(enum class Unknow Type); // Function Blac.U.SelectPerkButton(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetGearData(enum class Unknow Type); // Function Blac.U.SetGearData(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void DeselectGearButton(enum class Unknow Type); // Function Blac.U.DeselectGearButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SelectGearButton(enum class Unknow Type); // Function Blac.U.SelectGearButton(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetCustomData(enum class Unknow Type); // Function Blac.U.SetCustomData(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void DeselectCustomButton(enum class Unknow Type); // Function Blac.U.DeselectCustomButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SelectCustomButton(enum class Unknow Type); // Function Blac.U.SelectCustomButton(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetWearableData(enum class Unknow Type); // Function Blac.U.SetWearableData(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetAttachmentData(enum class Unknow Type); // Function Blac.U.SetAttachmentData(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void DeselectWearableButton(enum class Unknow Type); // Function Blac.U.DeselectWearableButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SelectWearableButton(enum class Unknow Type); // Function Blac.U.SelectWearableButton(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void DeselectAttachmentButton(enum class Unknow Type); // Function Blac.U.DeselectAttachmentButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SelectAttachmentButton(enum class Unknow Type); // Function Blac.U.SelectAttachmentButton(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SelectCategory(enum class Unknow TabType); // Function Blac.U.SelectCategory(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetWeaponData(enum class Unknow WeaponType); // Function Blac.U.SetWeaponData(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void DeselectWeaponButton(enum class Unknow Type); // Function Blac.U.DeselectWeaponButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SelectWeaponButton(enum class Unknow Type); // Function Blac.U.SelectWeaponButton(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void DeselectAllWeaponSubButton(); // Function Blac.U.DeselectAllWeaponSubButton(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void DeselectAllAttachmentSubButton(); // Function Blac.U.DeselectAllAttachmentSubButton(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void DeselectAllWearableSubButton(); // Function Blac.U.DeselectAllWearableSubButton(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void DeselectAllCustomSubButton(); // Function Blac.U.DeselectAllCustomSubButton(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void DeselectAllGearSubButton(); // Function Blac.U.DeselectAllGearSubButton(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void DeselectAllPerkSubButton(); // Function Blac.U.DeselectAllPerkSubButton(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Construct(); // Function Blac.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__Button_2_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function Blac.U.BndEvt__Button_2_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__Button_1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function Blac.U.BndEvt__Button_1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function Blac.U.BndEvt__Button_0_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__Button_3_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature(); // Function Blac.U.BndEvt__Button_3_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void DeselectAllConsumableButton(); // Function Blac.U.DeselectAllConsumableButton(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BndEvt__BT(); // Function Blac.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function Blac.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// WidgetBlueprintGeneratedClass Blac.U
class UU : UUserWidget {
	struct Unknown IM; // 0x248 (8)
};

// WidgetBlueprintGeneratedClass Blaceset.U
class UU : UUserWidget {
	struct Unknown Image_3; // 0x248 (8)
	struct Unknown IM; // 0x250 (8)
	struct Unknown IM; // 0x258 (8)
	struct Unknown IM; // 0x260 (8)
	struct Unknown U; // 0x268 (8)

	struct Unknown OnClose(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Blac.U.OnClose(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// UserDefinedStruct Blac.B
struct FB {
	struct FString ItemCommandString_23_11C9379C4A2BE25F4BFADD8CBA3978CC; // 0x0 (16)
	char bEquip_9_A19EFA7A4F6CDA9056F641902DB36B2B : 0; // 0x10 (1)
	int32_t SlotIndex_14_2F87447C4959EFB11C4D328275A0351E; // 0x14 (4)
	int32_t CustomType_26_75F60B7440E043592BCFC68101490C3D; // 0x18 (4)
};

