// User BluePrintudioType.Item
enum class Item : uint8 {
	Item = 0,
	Item = 1,
	Item = 2,
	Item = 3,
	Item = 4,
	Item = 5
};

// BlueprintGeneratedClass BluePrint.B
struct AB : ABravoHotel3DViewActor {
	struct Unknown UberGraphFrame; //  0x310 Size(8)
	struct Unknown PointLight3; //  0x318 Size(8)
	struct Unknown PointLight2; //  0x320 Size(8)
	struct Unknown SpotLight; //  0x328 Size(8)
	struct Unknown PointLight1; //  0x330 Size(8)
	struct Unknown BravoHotelSceneCaptureComponent2D; //  0x338 Size(8)
	struct Unknown PointLight; //  0x340 Size(8)
	struct Unknown SpotLight2; //  0x348 Size(8)
	struct Unknown Cube; //  0x350 Size(8)
	struct Unknown CustomizableSkeletal; //  0x358 Size(8)
	struct Unknown SkeletalMesh; //  0x360 Size(8)
	struct Unknown Camera; //  0x368 Size(8)
	struct Unknown Scene; //  0x370 Size(8)
	struct Unknown CharacterRef; //  0x378 Size(8)
	struct TArray<Unknown> PreviewWeapons; //  0x380 Size(10)
	char EnableTick; //  0x390 Size(1)
	struct Unknown TargetAccel; //  0x394 Size(c)
	struct Unknown CurrentAccel; //  0x3a0 Size(c)

	void Resize(int32_t SizeX, int32_t SizeY); // Function BluePrint.B.Resize(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass BluePrintizedCharacter.B
struct UB : UDrag {
	struct Unknown WidgetReference; //  0x88 Size(8)
	enum class Unknow InventorySlotWidgetKind; //  0x90 Size(1)
};

