// BlueprintGeneratedClass BP-BravoHotel-PlayerController.BP-BravoHotel-PlayerController_C
class ABP-BravoHotel-PlayerController_C : public ABravoHotelPlayerController {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1410 (8)
	struct UBP-HUDInteractionComponent_C BP-HUDInteractionComponent; // 0x1418 (8)
	struct USmartPingSystem_C SmartPingSystemComponent; // 0x1420 (8)
	struct FVector MapSize; // 0x1428 (12)
	char IsInWidget : 0; // 0x1434 (1)
	struct TArray<struct FName> InputActionsToBlock; // 0x1438 (16)
	struct ABravoHotelBlueZone BlueZone; // 0x1448 (8)
	struct TArray<struct FText> PhoneticAlphabetTable_NATO; // 0x1450 (16)
	char bHasJustClosed : 0; // 0x1460 (1)
	char bLineTrace : 0; // 0x1461 (1)
	struct UUW-BlackMarket_C UI-BlackMarket; // 0x1468 (8)
	struct FVector2D LocalScreenPosition; // 0x1470 (8)
	struct FVector2D MaxViewportSize; // 0x1478 (8)
	char ReverseSide : 0; // 0x1480 (1)
	struct UBP-SavedPlayerInventory_C SavedInventory; // 0x1488 (8)
	struct TArray<struct FString> DefaultItemList; // 0x1490 (16)
	struct FString SavedInventorySlotName; // 0x14A0 (16)
	char bLoadInventoryData : 0; // 0x14B0 (1)
	char bOpenSystemMenu : 0; // 0x14B1 (1)
	float MinBrightness; // 0x14B4 (4)
	float MaxBrightness; // 0x14B8 (4)
	float Contrast; // 0x14BC (4)
	char bUsePostProcessVolumeOption : 0; // 0x14C0 (1)
	float FilmToeIntensity; // 0x14C4 (4)
	float ColorGradingGlobalGamma; // 0x14C8 (4)
	char bInputModeUI : 0; // 0x14CC (1)
	struct FTimerHandle Timer; // 0x14D0 (8)
	struct FTimerHandle DoubleclickTimer; // 0x14D8 (8)
	float CheckTime; // 0x14E0 (4)
	float DoubleClickTime; // 0x14E4 (4)
	char CheckDoubleClick : 0; // 0x14E8 (1)
	struct FVector TempLocation; // 0x14EC (12)
	struct TArray<struct UUW_UserNameTooltip_C> NameWidgets; // 0x14F8 (16)
	int32_t CurrentNameWidgetCount; // 0x1508 (4)
	char bNameTooltipMode : 0; // 0x150C (1)
	int32_t SmartPingTypeIndex; // 0x1510 (4)
	char EableSmartPing : 0; // 0x1514 (1)
	char PingLock : 0; // 0x1515 (1)
	struct UUserWidget OperationMessageWidget; // 0x1518 (8)
	struct UWBP_SPS_UseItemSelectionMenu_C SelectionMenu; // 0x1520 (8)
	char IsVisibleSelectionMenu : 0; // 0x1528 (1)
	struct TMap<int32_t, struct FName> BoostItemList; // 0x1530 (80)
	char IgnoreMenu : 0; // 0x1580 (1)

	char HasPerkDeckWidget(); // Function BP-BravoHotel-PlayerController.BP-BravoHotel-PlayerController_C.HasPerkDeckWidget(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	struct UHUDInteractionComponent GetHUDInteractionComponent(); // Function BP-BravoHotel-PlayerController.BP-BravoHotel-PlayerController_C.GetHUDInteractionComponent(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	char IsShowingSystemPopup(); // Function BP-BravoHotel-PlayerController.BP-BravoHotel-PlayerController_C.IsShowingSystemPopup(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
