// BlueprintGeneratedClass BP-BattleRoyalePawn.BP-BattleRoyalePawn_C
class ABP-BattleRoyalePawn_C : public ABP-DefaultPawn_C {

public:

	struct Unknown UberGraphFrame; // 0x3B38 (8)
	struct Unknown Listener; // 0x3B40 (8)
	float _P_Cam_Z_NewTrack_0_898B65D1462B08609DA61C81A7B52313; // 0x3B48 (4)
	char _P_Cam_Z__Direction_898B65D1462B08609DA61C81A7B52313; // 0x3B4C (1)
	struct Unknown 3P_Cam_Z; // 0x3B50 (8)
	struct Unknown CriticalUITimeHandler; // 0x3B58 (8)
	struct Unknown DyingUITimeHandler; // 0x3B60 (8)
	struct Unknown ClothHandler; // 0x3B68 (8)
	struct Unknown ClothBallObject; // 0x3B70 (8)
	struct Unknown BallHandleLocation; // 0x3B78 (12)
	float GamepadInputModifier; // 0x3B84 (4)
	float BaseTurnRate; // 0x3B88 (4)
	float BaseLookUpRate; // 0x3B8C (4)
	struct TArray<Unknown> PerkLevelUpWidgets; // 0x3B90 (16)
	float PerkLevelUpWidthDepth; // 0x3BA0 (4)
	struct Unknown AmplifierEffect; // 0x3BA8 (8)
	float Cam_Shake_Radius; // 0x3BB0 (4)
	struct Unknown MainWidget; // 0x3BB8 (8)
	struct Unknown HeartBeatSensorEffect; // 0x3BC0 (8)

	char IsEnableSpawnSupplyBox(struct Unknown TargetActor, struct FString& OutResult); // Function BP-BattleRoyalePawn.BP-BattleRoyalePawn_C.IsEnableSpawnSupplyBox(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	char IsInstancedFoliageActor(struct Unknown TargetActor); // Function BP-BattleRoyalePawn.BP-BattleRoyalePawn_C.IsInstancedFoliageActor(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	void GetMainWidget(struct Unknown& MainWidget); // Function BP-BattleRoyalePawn.BP-BattleRoyalePawn_C.GetMainWidget(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game_BE.exe+0x2B812B0>
	void 3P_Cam_Z__FinishedFunc(); // Function BP-BattleRoyalePawn.BP-BattleRoyalePawn_C.3P_Cam_Z__FinishedFunc(BlueprintEvent) // <Game_BE.exe+0x2B812B0>
