// BlueprintGeneratedClass BP-BravoHotel-PlayerController.BP-BravoHotel-PlayerController_C
class ABP-BravoHotel-PlayerController_C : public ABravoHotelPlayerController {

public:

	struct Unknown UberGraphFrame; // 0x13D8 (8)
	struct Unknown BP-HUDInteractionComponent; // 0x13E0 (8)
	struct Unknown SmartPingSystemComponent; // 0x13E8 (8)
	struct Unknown MapSize; // 0x13F0 (12)
	char IsInWidget : 0; // 0x13FC (1)
	struct TArray<Unknown> InputActionsToBlock; // 0x1400 (16)
	struct Unknown BlueZone; // 0x1410 (8)
	struct TArray<Unknown> PhoneticAlphabetTable_NATO; // 0x1418 (16)
	char bHasJustClosed : 0; // 0x1428 (1)
	char bLineTrace : 0; // 0x1429 (1)
	struct Unknown UI-BlackMarket; // 0x1430 (8)
	struct Unknown LocalScreenPosition; // 0x1438 (8)
	struct Unknown MaxViewportSize; // 0x1440 (8)
	char ReverseSide : 0; // 0x1448 (1)
	struct Unknown SavedInventory; // 0x1450 (8)
	struct TArray<Unknown> DefaultItemList; // 0x1458 (16)
	struct FString SavedInventorySlotName; // 0x1468 (16)
	char bLoadInventoryData : 0; // 0x1478 (1)
	char bOpenSystemMenu : 0; // 0x1479 (1)
	float MinBrightness; // 0x147C (4)
	float MaxBrightness; // 0x1480 (4)
	float Contrast; // 0x1484 (4)
	char bUsePostProcessVolumeOption : 0; // 0x1488 (1)
	float FilmToeIntensity; // 0x148C (4)
	float ColorGradingGlobalGamma; // 0x1490 (4)
	char bInputModeUI : 0; // 0x1494 (1)
	struct Unknown Timer; // 0x1498 (8)
	struct Unknown DoubleclickTimer; // 0x14A0 (8)
	float CheckTime; // 0x14A8 (4)
	float DoubleClickTime; // 0x14AC (4)
	char CheckDoubleClick : 0; // 0x14B0 (1)
	struct Unknown TempLocation; // 0x14B4 (12)
	struct TArray<Unknown> NameWidgets; // 0x14C0 (16)
	int32_t CurrentNameWidgetCount; // 0x14D0 (4)
	char bNameTooltipMode : 0; // 0x14D4 (1)
	int32_t SmartPingTypeIndex; // 0x14D8 (4)
	char EableSmartPing : 0; // 0x14DC (1)
	char PingLock : 0; // 0x14DD (1)
	struct Unknown OperationMessageWidget; // 0x14E0 (8)
	struct Unknown SelectionMenu; // 0x14E8 (8)
	char IsVisibleSelectionMenu : 0; // 0x14F0 (1)
	struct TMap<Unknown, Unknown> BoostItemList; // 0x14F8 (80)
	char IgnoreMenu : 0; // 0x1548 (1)

	char HasPerkDeckWidget(); // Function BP-BravoHotel-PlayerController.BP-BravoHotel-PlayerController_C.HasPerkDeckWidget(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6E050>
	struct Unknown GetHUDInteractionComponent(); // Function BP-BravoHotel-PlayerController.BP-BravoHotel-PlayerController_C.GetHUDInteractionComponent(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6E050>
	char IsShowingSystemPopup(); // Function BP-BravoHotel-PlayerController.BP-BravoHotel-PlayerController_C.IsShowingSystemPopup(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6E050>
