// BlueprintGeneratedClass BP-BattleRoyalePawn.BP-BattleRoyalePawn_C
class ABP-BattleRoyalePawn_C : public ABP-DefaultPawn_C {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3B48 (8)
	struct USceneComponent Listener; // 0x3B50 (8)
	float _P_Cam_Z_NewTrack_0_898B65D1462B08609DA61C81A7B52313; // 0x3B58 (4)
	char _P_Cam_Z__Direction_898B65D1462B08609DA61C81A7B52313; // 0x3B5C (1)
	struct UTimelineComponent 3P_Cam_Z; // 0x3B60 (8)
	struct FTimerHandle CriticalUITimeHandler; // 0x3B68 (8)
	struct FTimerHandle DyingUITimeHandler; // 0x3B70 (8)
	struct UPhysicsHandleComponent ClothHandler; // 0x3B78 (8)
	struct USkeletalMeshComponent ClothBallObject; // 0x3B80 (8)
	struct FVector BallHandleLocation; // 0x3B88 (12)
	float GamepadInputModifier; // 0x3B94 (4)
	float BaseTurnRate; // 0x3B98 (4)
	float BaseLookUpRate; // 0x3B9C (4)
	struct TArray<struct UUW-PerkLevelUp_C> PerkLevelUpWidgets; // 0x3BA0 (16)
	float PerkLevelUpWidthDepth; // 0x3BB0 (4)
	struct ABP-AmplifierEffect_C AmplifierEffect; // 0x3BB8 (8)
	float Cam_Shake_Radius; // 0x3BC0 (4)
	struct UBravoHotelMainWidget MainWidget; // 0x3BC8 (8)
	struct ABP-HeartBeatSensorEffect_C HeartBeatSensorEffect; // 0x3BD0 (8)

	char IsEnableSpawnSupplyBox(struct UActor TargetActor, struct FString& OutResult); // Function BP-BattleRoyalePawn.BP-BattleRoyalePawn_C.IsEnableSpawnSupplyBox(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	char IsInstancedFoliageActor(struct UActor TargetActor); // Function BP-BattleRoyalePawn.BP-BattleRoyalePawn_C.IsInstancedFoliageActor(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	void GetMainWidget(struct UBravoHotelMainWidget& MainWidget); // Function BP-BattleRoyalePawn.BP-BattleRoyalePawn_C.GetMainWidget(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
