// BlueprintGeneratedClass BP-DefaultPawn.BP-DefaultPawn_C
class ABP-DefaultPawn_C : public ABravoHotelCharacterPrefab {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3AE0 (8)
	struct UBP-LadderComponent_C BP-LadderComponent; // 0x3AE8 (8)
	struct UParticleSystemComponent OutBlueZone; // 0x3AF0 (8)
	struct UBP-GrassCollision_Character_C BP-FoliageCollision; // 0x3AF8 (8)
	struct UChildActorComponent DevCamera_ChildActor; // 0x3B00 (8)
	struct UTeamInfoUpdaterComponent TeamInfoUpdater; // 0x3B08 (8)
	float VelocityZ_LandingDamage; // 0x3B10 (4)
	struct ABP-CharacterRecording_C CharacterPreviewRef; // 0x3B18 (8)
	struct AChat_System_C Chat System; // 0x3B20 (8)
	char ShowChatToggle : 0; // 0x3B28 (1)
	float CurrentViewportSizeX; // 0x3B2C (4)
	float CurrentViewportSizeY; // 0x3B30 (4)
	char OutScreenPosition : 0; // 0x3B34 (1)
	int32_t SightNumForTset; // 0x3B38 (4)
	char bDefaultAmplifier : 0; // 0x3B3C (1)
	float CurrentTeamInfoHeight; // 0x3B40 (4)

	void ForceInitRecordingCharacter(); // Function BP-DefaultPawn.BP-DefaultPawn_C.ForceInitRecordingCharacter(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	void CheckAimingCancelation(); // Function BP-DefaultPawn.BP-DefaultPawn_C.CheckAimingCancelation(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	void CorrectionScreenPosition(struct FVector2D& ScreenPosition, char& RetOutScreenPosition); // Function BP-DefaultPawn.BP-DefaultPawn_C.CorrectionScreenPosition(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	void LoadTableData(); // Function BP-DefaultPawn.BP-DefaultPawn_C.LoadTableData(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
