// BlueprintGeneratedClass BP-Jeep.BP-Jeep_C
class ABP-Jeep_C : public ABP-DefaultGroundVehicle_C {

public:

	struct Unknown BravoHotelVehicleTire_RR; // 0xD18 (8)
	struct Unknown BravoHotelVehicleTire_RL; // 0xD20 (8)
	struct Unknown BravoHotelVehicleTire_FR; // 0xD28 (8)
	struct Unknown BravoHotelVehicleTire_FL; // 0xD30 (8)
	struct Unknown BP-DestructibleComponent3; // 0xD38 (8)
	struct Unknown BP-DestructibleComponent2; // 0xD40 (8)
	struct Unknown BP-DestructibleComponent0; // 0xD48 (8)
	struct Unknown BP-DestructibleComponent1; // 0xD50 (8)
	struct Unknown BravoHotelVehicleSeat04; // 0xD58 (8)
	struct Unknown BravoHotelVehicleSeat03; // 0xD60 (8)
	struct Unknown BravoHotelVehicleSeat02; // 0xD68 (8)
	char bSnowy : 0; // 0xD70 (1)
};

