// BlueprintGeneratedClass BP-Jaguar.BP-Jaguar_C
class ABP-Jaguar_C : public ABP-DefaultGroundVehicle_C {

public:

	struct Unknown BravoHotelVehicleTire_RR; // 0xD80 (8)
	struct Unknown BravoHotelVehicleTire_RL; // 0xD88 (8)
	struct Unknown BravoHotelVehicleTire_FR; // 0xD90 (8)
	struct Unknown BravoHotelVehicleTire_FL; // 0xD98 (8)
	struct Unknown BP-DestructibleComponent1; // 0xDA0 (8)
	struct Unknown BP-DestructibleComponent; // 0xDA8 (8)
	struct Unknown BravoHotelVehicleSeat04; // 0xDB0 (8)
	struct Unknown BravoHotelVehicleSeat03; // 0xDB8 (8)
	struct Unknown BravoHotelVehicleSeat02; // 0xDC0 (8)
};

