// BlueprintGeneratedClass BP-Jeep.BP-Jeep_C
class ABP-Jeep_C : public ABP-DefaultGroundVehicle_C {

public:

	struct UBravoHotelVehicleTireComponent BravoHotelVehicleTire_RR; // 0xDA0 (8)
	struct UBravoHotelVehicleTireComponent BravoHotelVehicleTire_RL; // 0xDA8 (8)
	struct UBravoHotelVehicleTireComponent BravoHotelVehicleTire_FR; // 0xDB0 (8)
	struct UBravoHotelVehicleTireComponent BravoHotelVehicleTire_FL; // 0xDB8 (8)
	struct UBP-DestructibleComponent_C BP-DestructibleComponent3; // 0xDC0 (8)
	struct UBP-DestructibleComponent_C BP-DestructibleComponent2; // 0xDC8 (8)
	struct UBP-DestructibleComponent_C BP-DestructibleComponent0; // 0xDD0 (8)
	struct UBP-DestructibleComponent_C BP-DestructibleComponent1; // 0xDD8 (8)
	struct UBravoHotelVehicleSeatComponent BravoHotelVehicleSeat04; // 0xDE0 (8)
	struct UBravoHotelVehicleSeatComponent BravoHotelVehicleSeat03; // 0xDE8 (8)
	struct UBravoHotelVehicleSeatComponent BravoHotelVehicleSeat02; // 0xDF0 (8)
	char bSnowy : 0; // 0xDF8 (1)
};

