// BlueprintGeneratedClass BP-Jeep.BP-Jeep_C
class ABP-Jeep_C : public ABP-DefaultGroundVehicle_C {

public:

	struct Unknown BravoHotelVehicleTire_RR; // 0xD68 (8)
	struct Unknown BravoHotelVehicleTire_RL; // 0xD70 (8)
	struct Unknown BravoHotelVehicleTire_FR; // 0xD78 (8)
	struct Unknown BravoHotelVehicleTire_FL; // 0xD80 (8)
	struct Unknown BP-DestructibleComponent3; // 0xD88 (8)
	struct Unknown BP-DestructibleComponent2; // 0xD90 (8)
	struct Unknown BP-DestructibleComponent0; // 0xD98 (8)
	struct Unknown BP-DestructibleComponent1; // 0xDA0 (8)
	struct Unknown BravoHotelVehicleSeat04; // 0xDA8 (8)
	struct Unknown BravoHotelVehicleSeat03; // 0xDB0 (8)
	struct Unknown BravoHotelVehicleSeat02; // 0xDB8 (8)
	char bSnowy : 0; // 0xDC0 (1)
};

