// BlueprintGeneratedClass BP-Jeep.BP-Jeep_C
class ABP-Jeep_C : public ABP-DefaultGroundVehicle_C {

public:

	struct Unknown BravoHotelVehicleTire_RR; // 0xD98 (8)
	struct Unknown BravoHotelVehicleTire_RL; // 0xDA0 (8)
	struct Unknown BravoHotelVehicleTire_FR; // 0xDA8 (8)
	struct Unknown BravoHotelVehicleTire_FL; // 0xDB0 (8)
	struct Unknown BP-DestructibleComponent3; // 0xDB8 (8)
	struct Unknown BP-DestructibleComponent2; // 0xDC0 (8)
	struct Unknown BP-DestructibleComponent0; // 0xDC8 (8)
	struct Unknown BP-DestructibleComponent1; // 0xDD0 (8)
	struct Unknown BravoHotelVehicleSeat04; // 0xDD8 (8)
	struct Unknown BravoHotelVehicleSeat03; // 0xDE0 (8)
	struct Unknown BravoHotelVehicleSeat02; // 0xDE8 (8)
	char bSnowy : 0; // 0xDF0 (1)
};

