// BlueprintGeneratedClass BP-LadderComponent.BP-LadderComponent_C
class UBP-LadderComponent_C : public ULadderComponent {

public:

	struct Unknown UberGraphFrame; // 0x210 (8)
	char NeedToChangeHand : 0; // 0x218 (1)
	float CrntAxisValue; // 0x21C (4)
	float GoalLocationZ; // 0x220 (4)
	char NeedMoveOnLadder : 0; // 0x224 (1)
	float MotionMinAlpha; // 0x228 (4)
	char CanStopMotion : 0; // 0x22C (1)
	float DirectSnapLocZ; // 0x230 (4)
	float DeltaSecond; // 0x234 (4)
	float LastSecond; // 0x238 (4)
	int32_t AdditionalStepCount; // 0x23C (4)

	void CalcLadderInteractionType(); // Function BP-LadderComponent.BP-LadderComponent_C.CalcLadderInteractionType(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void CanCancelMotion(char& CanCancel); // Function BP-LadderComponent.BP-LadderComponent_C.CanCancelMotion(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void GetEndLocation(struct Unknown& LadderRelativeLocation); // Function BP-LadderComponent.BP-LadderComponent_C.GetEndLocation(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void SetMovingInfo(); // Function BP-LadderComponent.BP-LadderComponent_C.SetMovingInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
