// BlueprintGeneratedClass BP-PlatedJeep_Red.BP-PlatedJeep_Red_C
class ABP-PlatedJeep_Red_C : public ABP-DefaultGroundVehicle_C {

public:

	struct Unknown BravoHotelVehicleTire_RR; // 0xD98 (8)
	struct Unknown BravoHotelVehicleTire_RL; // 0xDA0 (8)
	struct Unknown BravoHotelVehicleTire_FR; // 0xDA8 (8)
	struct Unknown BravoHotelVehicleTire_FL; // 0xDB0 (8)
	struct Unknown BP-DestructibleComponent1; // 0xDB8 (8)
	struct Unknown BP-DestructibleComponent; // 0xDC0 (8)
	struct Unknown BravoHotelVehicleSeat04; // 0xDC8 (8)
	struct Unknown BravoHotelVehicleSeat03; // 0xDD0 (8)
	struct Unknown BravoHotelVehicleSeat02; // 0xDD8 (8)
};

