// BlueprintGeneratedClass BP-PlatedJeep.BP-PlatedJeep_C
class ABP-PlatedJeep_C : public ABP-DefaultGroundVehicle_C {

public:

	struct UBravoHotelVehicleTireComponent BravoHotelVehicleTire_RR; // 0xDA0 (8)
	struct UBravoHotelVehicleTireComponent BravoHotelVehicleTire_RL; // 0xDA8 (8)
	struct UBravoHotelVehicleTireComponent BravoHotelVehicleTire_FR; // 0xDB0 (8)
	struct UBravoHotelVehicleTireComponent BravoHotelVehicleTire_FL; // 0xDB8 (8)
	struct UBP-DestructibleComponent_C BP-DestructibleComponent1; // 0xDC0 (8)
	struct UBP-DestructibleComponent_C BP-DestructibleComponent; // 0xDC8 (8)
	struct UBravoHotelVehicleSeatComponent BravoHotelVehicleSeat04; // 0xDD0 (8)
	struct UBravoHotelVehicleSeatComponent BravoHotelVehicleSeat03; // 0xDD8 (8)
	struct UBravoHotelVehicleSeatComponent BravoHotelVehicleSeat02; // 0xDE0 (8)
};

