// BlueprintGeneratedClass BP-PlatedJeep_White.BP-PlatedJeep_White_C
class ABP-PlatedJeep_White_C : public ABP-DefaultGroundVehicle_C {

public:

	struct UBravoHotelVehicleTireComponent BravoHotelVehicleTire_RR; // 0xD80 (8)
	struct UBravoHotelVehicleTireComponent BravoHotelVehicleTire_RL; // 0xD88 (8)
	struct UBravoHotelVehicleTireComponent BravoHotelVehicleTire_FR; // 0xD90 (8)
	struct UBravoHotelVehicleTireComponent BravoHotelVehicleTire_FL; // 0xD98 (8)
	struct UBP-DestructibleComponent_C BP-DestructibleComponent1; // 0xDA0 (8)
	struct UBP-DestructibleComponent_C BP-DestructibleComponent; // 0xDA8 (8)
	struct UBravoHotelVehicleSeatComponent BravoHotelVehicleSeat04; // 0xDB0 (8)
	struct UBravoHotelVehicleSeatComponent BravoHotelVehicleSeat03; // 0xDB8 (8)
	struct UBravoHotelVehicleSeatComponent BravoHotelVehicleSeat02; // 0xDC0 (8)
};

