// WidgetBlueprintGeneratedClass BP-SpectatorWidget.BP-SpectatorWidget_C
class UBP-SpectatorWidget_C : public UBravoHotelSpectatorWidget {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x250 (8)
	struct UWidgetAnimation BackgroundBlurFadeIn; // 0x258 (8)
	struct UWidgetAnimation Idle; // 0x260 (8)
	struct UBackgroundBlur BackgroundBlur_1; // 0x268 (8)
	struct UButton BTN-Exit; // 0x270 (8)
	struct UButton Btn-NextTarget; // 0x278 (8)
	struct UButton Btn-PreTarget; // 0x280 (8)
	struct UButton Btn-Replay; // 0x288 (8)
	struct UCanvasPanel Canvas_Main; // 0x290 (8)
	struct UHorizontalBox KillcamBtns; // 0x298 (8)
	struct UHorizontalBox MemberChangeBox; // 0x2A0 (8)
	struct UTextBlock TextDepth_Replay; // 0x2A8 (8)
	struct UUW-SpectatingTargetInfo_C UW-SpectatingTargetInfo; // 0x2B0 (8)
	char bIsKillCam : 0; // 0x2B8 (1)

	struct UBravoHotelInteractionWidget GetInteractiveWidget(); // Function BP-SpectatorWidget.BP-SpectatorWidget_C.GetInteractiveWidget(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
	void SetTargetPlayerInfo(struct ABravoHotelPlayerState PlayerState); // Function BP-SpectatorWidget.BP-SpectatorWidget_C.SetTargetPlayerInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
	enum class ESlateVisibility GetVisibility_1(); // Function BP-SpectatorWidget.BP-SpectatorWidget_C.GetVisibility_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
