// WidgetBlueprintGeneratedClass BP-SpectatorHUD.BP-SpectatorHUD_C
class UBP-SpectatorHUD_C : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown BackgroundBlurFadeIn; // 0x250 (8)
	struct Unknown Idle; // 0x258 (8)
	struct Unknown BackgroundBlur_1; // 0x260 (8)
	struct Unknown BTN-Exit; // 0x268 (8)
	struct Unknown Btn-NextTarget; // 0x270 (8)
	struct Unknown Btn-PreTarget; // 0x278 (8)
	struct Unknown Btn-Replay; // 0x280 (8)
	struct Unknown Canvas_Main; // 0x288 (8)
	struct Unknown KillcamBtns; // 0x290 (8)
	struct Unknown MemberChangeBox; // 0x298 (8)
	struct Unknown TextDepth_Replay; // 0x2A0 (8)
	struct Unknown UW-SpectatingTargetInfo; // 0x2A8 (8)
	char bIsKillCam : 0; // 0x2B0 (1)

	struct Unknown GetInteractiveWidget(); // Function BP-SpectatorHUD.BP-SpectatorHUD_C.GetInteractiveWidget(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	void SetTargetPlayerInfo(struct Unknown PlayerState); // Function BP-SpectatorHUD.BP-SpectatorHUD_C.SetTargetPlayerInfo(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	enum class Unknow GetVisibility_1(); // Function BP-SpectatorHUD.BP-SpectatorHUD_C.GetVisibility_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game_BE.exe+0x2B812B0>
	struct FText GetText_1(); // Function BP-SpectatorHUD.BP-SpectatorHUD_C.GetText_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game_BE.exe+0x2B812B0>
	void SetReplayBtn(char bVisiable); // Function BP-SpectatorHUD.BP-SpectatorHUD_C.SetReplayBtn(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
