// BlueprintGeneratedClass BP_BlueZone.BP_BlueZone_C
struct ABP_BlueZone_C : ABravoHotelBlueZone {
	Unknown UberGraphFrame; //  0x7c0 Size(8)
	Unknown StaticMesh; //  0x7c8 Size(8)
	Unknown MagneticDecal; //  0x7d0 Size(8)
	float Puls_PulsScale_0F5B0359412DDBACBDF407BB69788854; //  0x7d8 Size(4)
	Unknown Puls__Direction_0F5B0359412DDBACBDF407BB69788854; //  0x7dc Size(1)
	Unknown Puls; //  0x7e0 Size(8)
	float Height; //  0x7e8 Size(4)
	float SeaLevelZ; //  0x7ec Size(4)
	char bIsMatchEnded; //  0x7f0 Size(1)
	float ModifyingOpacityTime; //  0x7f4 Size(4)
	float CurrentOpacity; //  0x7f8 Size(4)
	float ScaleModifier; //  0x7fc Size(4)
	Unknown ParametersCurve; //  0x800 Size(8)
	float MaterialParameterRadius; //  0x808 Size(4)
	char bWasMpUpdated; //  0x80c Size(1)
	float PreRadius; //  0x810 Size(4)

	void ShouldUpdateParameter(char& Result); // Function BP_BlueZone.BP_BlueZone_C.ShouldUpdateParameter(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

