// BlueprintGeneratedClass BP_GameSettings.BP_GameSettings_C
class UBP_GameSettings_C : UBravoHotelLocalSavedSettings {
	float Look; // 0x120 (4)
	float Look; // 0x124 (4)
	char Look : 0; // 0x128 (1)
	char Look : 0; // 0x129 (1)
	struct TScriptInterface<IUnknown> Game; // 0x130 (16)
	struct FString Save; // 0x140 (16)
	int32_t Save; // 0x150 (4)
	struct TArray<Unknown> AudioEmittors; // 0x158 (16)
	float Audio; // 0x168 (4)
	float Audio; // 0x16C (4)
	float Audio; // 0x170 (4)
	float Audio; // 0x174 (4)
	float Audio; // 0x178 (4)
	float Audio; // 0x17C (4)
	float Volume; // 0x180 (4)
	float Volume; // 0x184 (4)
	float Volume; // 0x188 (4)
	float Volume; // 0x18C (4)
	float Volume; // 0x190 (4)
	int32_t Video; // 0x194 (4)
	int32_t Video; // 0x198 (4)
	struct TArray<Unknown> Camera; // 0x1A0 (16)
	char Screen; // 0x1B0 (1)
	int32_t Resolution; // 0x1B4 (4)
	float View; // 0x1B8 (4)
	int32_t Anti; // 0x1BC (4)
	int32_t Post; // 0x1C0 (4)
	int32_t Shadow; // 0x1C4 (4)
	int32_t Texture; // 0x1C8 (4)
	int32_t Effect; // 0x1CC (4)
	int32_t Foliage; // 0x1D0 (4)
	float Field; // 0x1D4 (4)
	float Motion; // 0x1D8 (4)
	char VSync : 0; // 0x1DC (1)
	char My : 0; // 0x1DD (1)
	int32_t My; // 0x1E0 (4)
	float My; // 0x1E4 (4)
	float Bloom; // 0x1E8 (4)
	float Gamma; // 0x1EC (4)
	float Gain; // 0x1F0 (4)
	struct Unknown Previous; // 0x1F8 (8)
	struct FString My; // 0x200 (16)
	float Current; // 0x210 (4)
	struct TArray<Unknown> Key; // 0x218 (16)
	struct TArray<Unknown> Input; // 0x228 (16)
	struct TArray<Unknown> Saved; // 0x238 (16)
	float Volume; // 0x248 (4)
	char Old; // 0x24C (1)
	float TemporalAAFilterSize; // 0x250 (4)
	char TemporalAACatmullRom : 0; // 0x254 (1)
	char TemporalAAPauseCorrect : 0; // 0x255 (1)
	float TemporalAACurrentFrameWeight; // 0x258 (4)
	int32_t TemporalAASamples; // 0x25C (4)
	float TonemapperSharpen; // 0x260 (4)
	float MinBrightness; // 0x264 (4)
	float MaxBrightness; // 0x268 (4)
	float Contrast; // 0x26C (4)
	char PostProcessVolume : 0; // 0x270 (1)
	char ScreenModeChange : 0; // 0x271 (1)
	char FilmToe : 0; // 0x272 (1)
	float ColorGrading; // 0x274 (4)
	char ClearFog : 0; // 0x278 (1)
	int32_t ViewDistanceQuality; // 0x27C (4)
	int32_t ScalabilityQuality; // 0x280 (4)
	int32_t CurrentFileVersion; // 0x284 (4)
	int32_t UpdateFileVersion; // 0x288 (4)
	char Smooth : 0; // 0x28C (1)

	void SetAutoReloadSetting(char Value, char Apply, char& Result); // Function BP_GameSettings.BP_GameSettings_C.SetAutoReloadSetting(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void GetAutoReloadSetting(char& autoReload); // Function BP_GameSettings.BP_GameSettings_C.GetAutoReloadSetting(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ModifyAutoReloadSetting(char Modify); // Function BP_GameSettings.BP_GameSettings_C.ModifyAutoReloadSetting(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Get(char& Value); // Function BP_GameSettings.BP_GameSettings_C.Get(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
