// BlueprintGeneratedClass BP_GameSettings.BP_GameSettings_C
class UBP_GameSettings_C : public UBravoHotelLocalSavedSettings {

public:

	float Look Horizontal Sensitivity; // 0x120 (4)
	float Look Vertical Sensitivity; // 0x124 (4)
	char Look Horizontal Invert : 0; // 0x128 (1)
	char Look Vertical Invert : 0; // 0x129 (1)
	struct TScriptInterface<IUnknown> Game Settings Interface; // 0x130 (16)
	struct FString Save File Name; // 0x140 (16)
	int32_t Save File User Index; // 0x150 (4)
	struct TArray<Unknown> AudioEmittors; // 0x158 (16)
	float Audio Multiplier Master; // 0x168 (4)
	float Audio Multiplier Music; // 0x16C (4)
	float Audio Multiplier Voice; // 0x170 (4)
	float Audio Multiplier Effect; // 0x174 (4)
	float Audio Multiplier Ambient; // 0x178 (4)
	float Audio Multiplier UI; // 0x17C (4)
	float Volume Master; // 0x180 (4)
	float Volume Music; // 0x184 (4)
	float Volume Voice; // 0x188 (4)
	float Volume Effect; // 0x18C (4)
	float Volume Ambient; // 0x190 (4)
	int32_t Video X Resolution; // 0x194 (4)
	int32_t Video Y Resolution; // 0x198 (4)
	struct TArray<Unknown> Camera List; // 0x1A0 (16)
	char Screen Mode; // 0x1B0 (1)
	int32_t Resolution Scale Quality; // 0x1B4 (4)
	float View Distance Scale; // 0x1B8 (4)
	int32_t Anti Aliasing Quality; // 0x1BC (4)
	int32_t Post Processing Quality; // 0x1C0 (4)
	int32_t Shadow Quality; // 0x1C4 (4)
	int32_t Texture Quality; // 0x1C8 (4)
	int32_t Effect Quality; // 0x1CC (4)
	int32_t Foliage Quality; // 0x1D0 (4)
	float Field Of View FOV; // 0x1D4 (4)
	float Motion Blur Strength; // 0x1D8 (4)
	char VSync Enabled : 0; // 0x1DC (1)
	char My Custom Checkbox : 0; // 0x1DD (1)
	int32_t My Custom RadioBox; // 0x1E0 (4)
	float My Custom Slider; // 0x1E4 (4)
	float Bloom Intensity; // 0x1E8 (4)
	float Gamma Intensity; // 0x1EC (4)
	float Gain Intensity; // 0x1F0 (4)
	struct Unknown Previous Setting State; // 0x1F8 (8)
	struct FString My Custom Combobox; // 0x200 (16)
	float Current Frame Time; // 0x210 (4)
	struct TArray<Unknown> Key Actions; // 0x218 (16)
	struct TArray<Unknown> Input Float Axis List; // 0x228 (16)
	struct TArray<Unknown> Saved Key Inputs; // 0x238 (16)
	float Volume UI; // 0x248 (4)
	char Old ScreenMode State; // 0x24C (1)
	float TemporalAAFilterSize; // 0x250 (4)
	char TemporalAACatmullRom : 0; // 0x254 (1)
	char TemporalAAPauseCorrect : 0; // 0x255 (1)
	float TemporalAACurrentFrameWeight; // 0x258 (4)
	int32_t TemporalAASamples; // 0x25C (4)
	float TonemapperSharpen; // 0x260 (4)
	float MinBrightness; // 0x264 (4)
	float MaxBrightness; // 0x268 (4)
	float Contrast; // 0x26C (4)
	char PostProcessVolume : 0; // 0x270 (1)
	char ScreenModeChange : 0; // 0x271 (1)
	char FilmToe : 0; // 0x272 (1)
	float ColorGrading Global Gamma; // 0x274 (4)
	char ClearFog : 0; // 0x278 (1)
	int32_t ViewDistanceQuality; // 0x27C (4)
	int32_t ScalabilityQuality; // 0x280 (4)
	int32_t CurrentFileVersion; // 0x284 (4)
	int32_t UpdateFileVersion; // 0x288 (4)
	char Smooth Frame Enabled : 0; // 0x28C (1)

	void SetAutoReloadSetting(char Value, char Apply, char& Result); // Function BP_GameSettings.BP_GameSettings_C.SetAutoReloadSetting(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void GetAutoReloadSetting(char& autoReload); // Function BP_GameSettings.BP_GameSettings_C.GetAutoReloadSetting(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void ModifyAutoReloadSetting(char Modify); // Function BP_GameSettings.BP_GameSettings_C.ModifyAutoReloadSetting(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void Get Smooth Frame Rate(char& Value); // Function BP_GameSettings.BP_GameSettings_C.Get Smooth Frame Rate(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
