// BlueprintGeneratedClass BP_GameSettings.BP_GameSettings_C
struct UBP_GameSettings_C : UBravoHotelLocalSavedSettings {
	float Look; //  0x120 Size(4)
	float Look; //  0x124 Size(4)
	char Look; //  0x128 Size(1)
	char Look; //  0x129 Size(1)
	Unknown Game; //  0x130 Size(10)
	struct FString Save; //  0x140 Size(10)
	int32_t Save; //  0x150 Size(4)
	Unknown AudioEmittors; //  0x158 Size(10)
	float Audio; //  0x168 Size(4)
	float Audio; //  0x16c Size(4)
	float Audio; //  0x170 Size(4)
	float Audio; //  0x174 Size(4)
	float Audio; //  0x178 Size(4)
	float Audio; //  0x17c Size(4)
	float Volume; //  0x180 Size(4)
	float Volume; //  0x184 Size(4)
	float Volume; //  0x188 Size(4)
	float Volume; //  0x18c Size(4)
	float Volume; //  0x190 Size(4)
	int32_t Video; //  0x194 Size(4)
	int32_t Video; //  0x198 Size(4)
	Unknown Camera; //  0x1a0 Size(10)
	Unknown Screen; //  0x1b0 Size(1)
	int32_t Resolution; //  0x1b4 Size(4)
	float View; //  0x1b8 Size(4)
	int32_t Anti; //  0x1bc Size(4)
	int32_t Post; //  0x1c0 Size(4)
	int32_t Shadow; //  0x1c4 Size(4)
	int32_t Texture; //  0x1c8 Size(4)
	int32_t Effect; //  0x1cc Size(4)
	int32_t Foliage; //  0x1d0 Size(4)
	float Field; //  0x1d4 Size(4)
	float Motion; //  0x1d8 Size(4)
	char VSync; //  0x1dc Size(1)
	char My; //  0x1dd Size(1)
	int32_t My; //  0x1e0 Size(4)
	float My; //  0x1e4 Size(4)
	float Bloom; //  0x1e8 Size(4)
	float Gamma; //  0x1ec Size(4)
	float Gain; //  0x1f0 Size(4)
	Unknown Previous; //  0x1f8 Size(8)
	struct FString My; //  0x200 Size(10)
	float Current; //  0x210 Size(4)
	Unknown Key; //  0x218 Size(10)
	Unknown Input; //  0x228 Size(10)
	Unknown Saved; //  0x238 Size(10)
	float Volume; //  0x248 Size(4)
	Unknown Old; //  0x24c Size(1)
	float TemporalAAFilterSize; //  0x250 Size(4)
	char TemporalAACatmullRom; //  0x254 Size(1)
	char TemporalAAPauseCorrect; //  0x255 Size(1)
	float TemporalAACurrentFrameWeight; //  0x258 Size(4)
	int32_t TemporalAASamples; //  0x25c Size(4)
	float TonemapperSharpen; //  0x260 Size(4)
	float MinBrightness; //  0x264 Size(4)
	float MaxBrightness; //  0x268 Size(4)
	float Contrast; //  0x26c Size(4)
	char PostProcessVolume; //  0x270 Size(1)
	char ScreenModeChange; //  0x271 Size(1)
	char FilmToe; //  0x272 Size(1)
	float ColorGrading; //  0x274 Size(4)
	char ClearFog; //  0x278 Size(1)
	int32_t ViewDistanceQuality; //  0x27c Size(4)
	int32_t ScalabilityQuality; //  0x280 Size(4)
	int32_t CurrentFileVersion; //  0x284 Size(4)
	int32_t UpdateFileVersion; //  0x288 Size(4)
	char Smooth; //  0x28c Size(1)

	void SetAutoReloadSetting(char Value, char Apply, char& Result); // Function BP_GameSettings.BP_GameSettings_C.SetAutoReloadSetting(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass BP_GameSettings.BP_GameSettingsWrapper_C
struct UBP_GameSettingsWrapper_C : Object {
	Unknown UberGraphFrame; //  0x28 Size(8)
	Unknown Game; //  0x30 Size(8)

	void ExecuteUbergraph_BP_GameSettingsWrapper(int32_t EntryPoint); // Function BP_GameSettings.BP_GameSettingsWrapper_C.ExecuteUbergraph_BP_GameSettingsWrapper(Final|UbergraphFunction) // <Game+0x23a73f0>
};

