// BlueprintGeneratedClass BP_MoveElevator.BP_MoveElevator_C
class ABP_MoveElevator_C : public ABravoHotelMoveElevator {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x328 (8)
	struct UBoxComponent Box2; // 0x330 (8)
	struct UBoxComponent Box1; // 0x338 (8)
	struct UBravoHotelAudioEmitterComponent BravoHotelAudioEmitter; // 0x340 (8)
	struct UStaticMeshComponent Upper_Rear_Display_Sub; // 0x348 (8)
	struct UStaticMeshComponent Upper_Front_Display_Sub; // 0x350 (8)
	struct UStaticMeshComponent Lower_Rear_Display_Sub; // 0x358 (8)
	struct UStaticMeshComponent Lower_Front_Display_Sub; // 0x360 (8)
	struct UBoxComponent PointBox; // 0x368 (8)
	struct UBoxComponent FloorBox; // 0x370 (8)
	struct UStaticMeshComponent Main_Display; // 0x378 (8)
	struct UBoxComponent Box; // 0x380 (8)
	struct UTextRenderComponent TextRender5; // 0x388 (8)
	struct UTextRenderComponent TextRender7; // 0x390 (8)
	struct UTextRenderComponent TextRender6; // 0x398 (8)
	struct UTextRenderComponent TextRender1; // 0x3A0 (8)
	struct UTextRenderComponent TextRender4; // 0x3A8 (8)
	struct UTextRenderComponent TextRender3; // 0x3B0 (8)
	struct UTextRenderComponent TextRender; // 0x3B8 (8)
	struct UTextRenderComponent TextRender2; // 0x3C0 (8)
	struct UBoxComponent Upper_Front_Button_Area; // 0x3C8 (8)
	struct UBoxComponent Upper_Rear_Button_Area; // 0x3D0 (8)
	struct UBoxComponent Lower_Rear_Button_Area; // 0x3D8 (8)
	struct UBoxComponent Lower_Front_Button_Area; // 0x3E0 (8)
	struct UBoxComponent Main_Rear_Button_Area; // 0x3E8 (8)
	struct UBoxComponent Main_Front_Button_Area; // 0x3F0 (8)
	struct UStaticMeshComponent Main_Front_Button; // 0x3F8 (8)
	struct UStaticMeshComponent Main_Rear_Button; // 0x400 (8)
	struct UStaticMeshComponent Upper_Rear_Display; // 0x408 (8)
	struct UStaticMeshComponent Upper_Front_Display; // 0x410 (8)
	struct UStaticMeshComponent Lower_Rear_Display; // 0x418 (8)
	struct UStaticMeshComponent Lower_Front_Display; // 0x420 (8)
	struct UStaticMeshComponent Upper_Rear_Button; // 0x428 (8)
	struct UStaticMeshComponent Upper_Front_Button; // 0x430 (8)
	struct UStaticMeshComponent Lower_Rear_Button; // 0x438 (8)
	struct UStaticMeshComponent Lower_Front_Button; // 0x440 (8)
	struct UStaticMeshComponent Upper_Rear_Left; // 0x448 (8)
	struct UStaticMeshComponent Upper_Rear_Right; // 0x450 (8)
	struct UStaticMeshComponent Upper_Front_Left; // 0x458 (8)
	struct UStaticMeshComponent Upper_Front_Right; // 0x460 (8)
	struct UStaticMeshComponent Lower_Rear_Right; // 0x468 (8)
	struct UStaticMeshComponent Lower_Front_Right; // 0x470 (8)
	struct UStaticMeshComponent Lower_Front_Left; // 0x478 (8)
	struct UStaticMeshComponent Lower_Rear_Left; // 0x480 (8)
	struct USceneComponent Upper_Rear; // 0x488 (8)
	struct USceneComponent Upper_Front; // 0x490 (8)
	struct USceneComponent Lower_Rear; // 0x498 (8)
	struct USceneComponent Lower_Front; // 0x4A0 (8)
	struct USceneComponent Upper_Floor; // 0x4A8 (8)
	struct USceneComponent Front_Door; // 0x4B0 (8)
	struct USceneComponent Rear_Door; // 0x4B8 (8)
	struct USceneComponent Lower_Floor; // 0x4C0 (8)
	struct UStaticMeshComponent Main_Front_Right; // 0x4C8 (8)
	struct UStaticMeshComponent Main_Front_Left; // 0x4D0 (8)
	struct UStaticMeshComponent Main_Body; // 0x4D8 (8)
	struct USceneComponent Scene1; // 0x4E0 (8)
	struct UStaticMeshComponent Main_Rear_Right; // 0x4E8 (8)
	struct UStaticMeshComponent Main_Rear_Left; // 0x4F0 (8)
	float ElevatorCloseDoor______0_70C4393D45E164D3C8B473964F68015B; // 0x4F8 (4)
	char ElevatorCloseDoor__Direction_70C4393D45E164D3C8B473964F68015B; // 0x4FC (1)
	struct UTimelineComponent ElevatorCloseDoor; // 0x500 (8)
	float LowerMoving______0_95D3AE1045ABFF7C4CC7778EAC04BCDA; // 0x508 (4)
	char LowerMoving__Direction_95D3AE1045ABFF7C4CC7778EAC04BCDA; // 0x50C (1)
	struct UTimelineComponent LowerMoving; // 0x510 (8)
	float ElevatorOpenDoor______0_5DABF5354368A8D3121A6FB4685095FB; // 0x518 (4)
	char ElevatorOpenDoor__Direction_5DABF5354368A8D3121A6FB4685095FB; // 0x51C (1)
	struct UTimelineComponent ElevatorOpenDoor; // 0x520 (8)
	float UpperMoving______0_B6B6057A44D35DFC9C1FCDB8B065C5D0; // 0x528 (4)
	char UpperMoving__Direction_B6B6057A44D35DFC9C1FCDB8B065C5D0; // 0x52C (1)
	struct UTimelineComponent UpperMoving; // 0x530 (8)
	struct FVector Upper_Location; // 0x538 (12)
	struct FVector Body_Position; // 0x544 (12)
	char IsLower : 0; // 0x550 (1)
	float DoorTravel; // 0x554 (4)
	float DoorMoveTime; // 0x558 (4)
	char IsMoving : 0; // 0x55C (1)
	struct FVector RoomPos; // 0x560 (12)
	struct USceneComponent MoveFloor; // 0x570 (8)
	struct TArray<struct ABravoHotelCharacter> AddCharacters; // 0x578 (16)
	float AddMoveOffest; // 0x588 (4)
	struct UAkAudioEvent OpenDoorCompleted; // 0x590 (8)
	struct UAkAudioEvent OpeningDoor; // 0x598 (8)
	struct UAkAudioEvent ClosingDoor; // 0x5A0 (8)
	struct UAkAudioEvent CloseDoorCompleted; // 0x5A8 (8)
	struct UAkAudioEvent SoundEventForMoved; // 0x5B0 (8)
	struct UAkAudioEvent SoundEventForMoving; // 0x5B8 (8)
	char IsTraceMoving : 0; // 0x5C0 (1)
	struct FVector TraceLocation; // 0x5C4 (12)
	struct TArray<struct UActor> AttachActors; // 0x5D0 (16)
	char NewVar_1 : 0; // 0x5E0 (1)
	char NewVar_2 : 0; // 0x5E1 (1)
	struct UAkComponent ElevatorAKComponent; // 0x5E8 (8)
	struct UAkAudioEvent ButtonSound; // 0x5F0 (8)

	void SetScalarParameterList(struct TArray<struct UStaticMeshComponent>& StaticMeshList, struct FName ParameterName, float ParameterValue); // Function BP_MoveElevator.BP_MoveElevator_C.SetScalarParameterList(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void CloseLowerSubDoor(float AddLocation); // Function BP_MoveElevator.BP_MoveElevator_C.CloseLowerSubDoor(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void CloseUpperSubDoor(float AddLocation); // Function BP_MoveElevator.BP_MoveElevator_C.CloseUpperSubDoor(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
