// BlueprintGeneratedClass BP_MoveElevator.BP_MoveElevator_C
struct ABP_MoveElevator_C : ABravoHotelMoveElevator {
	struct Unknown UberGraphFrame; //  0x320 Size(8)
	struct Unknown Box2; //  0x328 Size(8)
	struct Unknown Box1; //  0x330 Size(8)
	struct Unknown BravoHotelAudioEmitter; //  0x338 Size(8)
	struct Unknown Upper_Rear_Display_Sub; //  0x340 Size(8)
	struct Unknown Upper_Front_; //  0x348 Size(8)
	struct Unknown Lower_Rear_Display_Sub; //  0x350 Size(8)
	struct Unknown Lower_Front_; //  0x358 Size(8)
	struct Unknown PointBox; //  0x360 Size(8)
	struct Unknown FloorBox; //  0x368 Size(8)
	struct Unknown Main_Display; //  0x370 Size(8)
	struct Unknown Box; //  0x378 Size(8)
	struct Unknown TextRender5; //  0x380 Size(8)
	struct Unknown TextRender7; //  0x388 Size(8)
	struct Unknown TextRender6; //  0x390 Size(8)
	struct Unknown TextRender1; //  0x398 Size(8)
	struct Unknown TextRender4; //  0x3a0 Size(8)
	struct Unknown TextRender3; //  0x3a8 Size(8)
	struct Unknown TextRender; //  0x3b0 Size(8)
	struct Unknown TextRender2; //  0x3b8 Size(8)
	struct Unknown Upper_Front_Button_Area; //  0x3c0 Size(8)
	struct Unknown Upper_Rear_Button_Area; //  0x3c8 Size(8)
	struct Unknown Lower_Rear_Button_Area; //  0x3d0 Size(8)
	struct Unknown Lower_Front_Button_Area; //  0x3d8 Size(8)
	struct Unknown Main_Rear_Button_Area; //  0x3e0 Size(8)
	struct Unknown Main_Front_Button_Area; //  0x3e8 Size(8)
	struct Unknown Main_Front_Button; //  0x3f0 Size(8)
	struct Unknown Main_Rear_Button; //  0x3f8 Size(8)
	struct Unknown Upper_Rear_Display; //  0x400 Size(8)
	struct Unknown Upper_Front_; //  0x408 Size(8)
	struct Unknown Lower_Rear_Display; //  0x410 Size(8)
	struct Unknown Lower_Front_; //  0x418 Size(8)
	struct Unknown Upper_Rear_Button; //  0x420 Size(8)
	struct Unknown Upper_Front_Button; //  0x428 Size(8)
	struct Unknown Lower_Rear_Button; //  0x430 Size(8)
	struct Unknown Lower_Front_Button; //  0x438 Size(8)
	struct Unknown Upper_Rear_Left; //  0x440 Size(8)
	struct Unknown Upper_Rear_Right; //  0x448 Size(8)
	struct Unknown Upper_Front_Left; //  0x450 Size(8)
	struct Unknown Upper_Front_Right; //  0x458 Size(8)
	struct Unknown Lower_Rear_Right; //  0x460 Size(8)
	struct Unknown Lower_Front_Right; //  0x468 Size(8)
	struct Unknown Lower_Front_Left; //  0x470 Size(8)
	struct Unknown Lower_Rear_Left; //  0x478 Size(8)
	struct Unknown Upper_Rear; //  0x480 Size(8)
	struct Unknown Upper_Front; //  0x488 Size(8)
	struct Unknown Lower_Rear; //  0x490 Size(8)
	struct Unknown Lower_Front; //  0x498 Size(8)
	struct Unknown Upper_Floor; //  0x4a0 Size(8)
	struct Unknown Front_Door; //  0x4a8 Size(8)
	struct Unknown Rear_Door; //  0x4b0 Size(8)
	struct Unknown Lower_Floor; //  0x4b8 Size(8)
	struct Unknown Main_Front_Right; //  0x4c0 Size(8)
	struct Unknown Main_Front_Left; //  0x4c8 Size(8)
	struct Unknown Main_Body; //  0x4d0 Size(8)
	struct Unknown Scene1; //  0x4d8 Size(8)
	struct Unknown Main_Rear_Right; //  0x4e0 Size(8)
	struct Unknown Main_Rear_Left; //  0x4e8 Size(8)
	float ElevatorCloseDoor______0_70C4393D45E164D3C8B473964F68015B; //  0x4f0 Size(4)
	char ElevatorCloseDoor__Direction_70C4393D45E164D3C8B473964F68015B; //  0x4f4 Size(1)
	struct Unknown ElevatorCloseDoor; //  0x4f8 Size(8)
	float LowerMoving______0_95D3AE1045ABFF7C4CC7778EAC04BCDA; //  0x500 Size(4)
	char LowerMoving__Direction_95D3AE1045ABFF7C4CC7778EAC04BCDA; //  0x504 Size(1)
	struct Unknown LowerMoving; //  0x508 Size(8)
	float ElevatorOpen; //  0x510 Size(4)
	char ElevatorOpen; //  0x514 Size(1)
	struct Unknown ElevatorOpen; //  0x518 Size(8)
	float UpperMoving______0_B6B6057A44D35DFC9C1FCDB8B065C5D0; //  0x520 Size(4)
	char UpperMoving__Direction_B6B6057A44D35DFC9C1FCDB8B065C5D0; //  0x524 Size(1)
	struct Unknown UpperMoving; //  0x528 Size(8)
	struct Unknown Upper_Location; //  0x530 Size(c)
	struct Unknown Body_Position; //  0x53c Size(c)
	char IsLower; //  0x548 Size(1)
	float DoorTravel; //  0x54c Size(4)
	float DoorMoveTime; //  0x550 Size(4)
	char IsMoving; //  0x554 Size(1)
	struct Unknown RoomPos; //  0x558 Size(c)
	struct Unknown MoveFloor; //  0x568 Size(8)
	struct TArray<Unknown> AddCharacters; //  0x570 Size(10)
	float AddMoveOffest; //  0x580 Size(4)
	struct Unknown Open; //  0x588 Size(8)
	struct Unknown OpeningDoor; //  0x590 Size(8)
	struct Unknown ClosingDoor; //  0x598 Size(8)
	struct Unknown CloseDoorCompleted; //  0x5a0 Size(8)
	struct Unknown SoundEventForMoved; //  0x5a8 Size(8)
	struct Unknown SoundEventForMoving; //  0x5b0 Size(8)
	char IsTraceMoving; //  0x5b8 Size(1)
	struct Unknown TraceLocation; //  0x5bc Size(c)
	struct TArray<Unknown> AttachActors; //  0x5c8 Size(10)
	char NewVar_1; //  0x5d8 Size(1)
	char NewVar_2; //  0x5d9 Size(1)
	struct Unknown ElevatorAKComponent; //  0x5e0 Size(8)
	struct Unknown ButtonSound; //  0x5e8 Size(8)

	void SetScalarParameterList(struct TArray<Unknown>& StaticMeshList, struct FName ParameterName, float ParameterValue); // Function BP_MoveElevator.BP_MoveElevator_C.SetScalarParameterList(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

