// BlueprintGeneratedClass BP_SPS_WidgetActor.BP_SPS_WidgetActor_C
struct ABP_SPS_WidgetActor_C : ABravoHotelSmartPingActor {
	Unknown UberGraphFrame; //  0x5b8 Size(8)
	Unknown Widget_Screen; //  0x5c0 Size(8)
	Unknown Widget_World; //  0x5c8 Size(8)
	Unknown DefaultSceneRoot; //  0x5d0 Size(8)
	Unknown SmartPingWidget_World; //  0x5d8 Size(8)
	Unknown DeactivateTimer; //  0x5e0 Size(8)
	Unknown SmartPingComponent; //  0x5e8 Size(8)
	Unknown ScreenToWorldLocation; //  0x5f0 Size(c)
	float ScreenRotation; //  0x5fc Size(4)
	Unknown HoldSound; //  0x600 Size(8)
	Unknown PhaseTimer; //  0x608 Size(8)
	Unknown TempWidget; //  0x610 Size(8)
	int32_t PingIndex; //  0x618 Size(4)
	Unknown SaveTempPingInfo; //  0x620 Size(38)
	Unknown LineActor; //  0x658 Size(8)
	Unknown SmartPingWidget_Screen; //  0x660 Size(8)
	char Enab; //  0x668 Size(1)

	void GetTeamColor(int32_t TeamIndex, Unknown& OutColor); // Function BP_SPS_WidgetActor.BP_SPS_WidgetActor_C.GetTeamColor(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

