// BlueprintGeneratedClass BP_SPS_Wi.BP_SPS_WidgetActor_C
struct ABP_SPS_WidgetActor_C : ABravoHotelSmartPingActor {
	struct Unknown UberGraphFrame; //  0x5b8 Size(8)
	struct Unknown Widget_Screen; //  0x5c0 Size(8)
	struct Unknown Widget_World; //  0x5c8 Size(8)
	struct Unknown DefaultSceneRoot; //  0x5d0 Size(8)
	struct Unknown SmartPingWidget_World; //  0x5d8 Size(8)
	struct Unknown DeactivateTimer; //  0x5e0 Size(8)
	struct Unknown SmartPingComponent; //  0x5e8 Size(8)
	struct Unknown ScreenToWorldLocation; //  0x5f0 Size(c)
	float ScreenRotation; //  0x5fc Size(4)
	struct Unknown HoldSound; //  0x600 Size(8)
	struct Unknown PhaseTimer; //  0x608 Size(8)
	struct Unknown TempWidget; //  0x610 Size(8)
	int32_t PingIndex; //  0x618 Size(4)
	struct Unknown SaveTempPingInfo; //  0x620 Size(38)
	struct Unknown LineActor; //  0x658 Size(8)
	struct Unknown SmartPingWidget_Screen; //  0x660 Size(8)
	char EnableShow; //  0x668 Size(1)

	void GetTeamColor(int32_t TeamIndex, struct Unknown& OutColor); // Function BP_SPS_Wi.BP_SPS_WidgetActor_C.GetTeamColor(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

