// Enum BravoHotelGame.EBuffEventType
enum class EBuffEventType : uint8 {
	EBuffEventType = 0,
	EBuffEventType = 1,
	EBuffEventType = 2,
	EBuffEventType = 3,
	EBuffEventType = 4,
	EBuffEventType = 5,
	EBuffEventType = 6,
	EBuffEventType = 7,
	EBuffEventType = 8,
	EBuffEventType = 9,
	EBuffEventType = 10,
	EBuffEventType = 11,
	EBuffEventType = 12,
	EBuffEventType = 13,
	EBuffEventType = 14,
	EBuffEventType = 15,
	EBuffEventType = 16,
	EBuffEventType = 17,
	EBuffEventType = 18,
	EBuffEventType = 19,
	EBuffEventType = 20,
	EBuffEventType = 21,
	EBuffEventType = 22,
	EBuffEventType = 23,
	EBuffEventType = 24,
	EBuffEventType = 25,
	EBuffEventType = 26,
	EBuffEventType = 27,
	EBuffEventType = 28,
	EBuffEventType = 29,
	EBuffEventType = 30,
	EBuffEventType = 31,
	EBuffEventType = 32,
	EBuffEventType = 33,
	EBuffEventType = 34,
	EBuffEventType = 35,
	EBuffEventType = 36,
	EBuffEventType = 37,
	EBuffEventType = 38,
	EBuffEventType = 39,
	EBuffEventType = 40,
	EBuffEventType = 41,
	EBuffEventType = 42,
	EBuffEventType = 43,
	EBuffEventType = 44,
	EBuffEventType = 45,
	EBuffEventType = 46,
	EBuffEventType = 47,
	EBuffEventType = 48,
	EBuffEventType = 49,
	EBuffEventType = 50,
	EBuffEventType = 51,
	EBuffEventType = 52,
	EBuffEventType = 53,
	EBuffEventType = 54,
	EBuffEventType = 55,
	EBuffEventType = 56,
	EBuffEventType = 57,
	EBuffEventType = 255
};

// Enum BravoHotelGame.EWeaponType
enum class EWeaponType : uint8 {
	EWeaponType = 0,
	EWeaponType = 1,
	EWeaponType = 2,
	EWeaponType = 3,
	EWeaponType = 4,
	EWeaponType = 5,
	EWeaponType = 6,
	EWeaponType = 7,
	EWeaponType = 8,
	EWeaponType = 9,
	EWeaponType = 10,
	EWeaponType = 101,
	EWeaponType = 102,
	EWeaponType = 103,
	EWeaponType = 104,
	EWeaponType = 105,
	EWeaponType = 106
};

// Enum BravoHotelGame.EWeaponBuffEventType
enum class EWeaponBuffEventType : uint8 {
	EWeaponBuffEventType = 0,
	EWeaponBuffEventType = 1,
	EWeaponBuffEventType = 2,
	EWeaponBuffEventType = 3,
	EWeaponBuffEventType = 4,
	EWeaponBuffEventType = 5,
	EWeaponBuffEventType = 6,
	EWeaponBuffEventType = 7,
	EWeaponBuffEventType = 8,
	EWeaponBuffEventType = 9,
	EWeaponBuffEventType = 10,
	EWeaponBuffEventType = 11,
	EWeaponBuffEventType = 255
};

// Enum BravoHotelGame.EMediaPlayerState
enum class EMediaPlayerState : uint8 {
	EMediaPlayerState = 0,
	EMediaPlayerState = 1,
	EMediaPlayerState = 2
};

// Enum BravoHotelGame.EAircraftFlightState
enum class EAircraftFlightState : uint8 {
	EAircraftFlightState = 0,
	EAircraftFlightState = 1,
	EAircraftFlightState = 2,
	EAircraftFlightState = 3,
	EAircraftFlightState = 4,
	EAircraftFlightState = 5
};

// Enum BravoHotelGame.EAircraftMovementMethod
enum class EAircraftMovementMethod : uint8 {
	EAircraftMovementMethod = 0,
	EAircraftMovementMethod = 1
};

// Enum BravoHotelGame.EPickupRoot
enum class EPickupRoot : uint8 {
	EPickupRoot = 0,
	EPickupRoot = 1,
	EPickupRoot = 2,
	EPickupRoot = 3,
	EPickupRoot = 4,
	EPickupRoot = 255,
	EPickupRoot = 256
};

// Enum BravoHotelGame.EItemBindType
enum class EItemBindType : uint8 {
	EItemBindType = 0,
	EItemBindType = 1,
	EItemBindType = 2,
	EItemBindType = 3,
	EItemBindType = 4
};

// Enum BravoHotelGame.EInventoryItemState
enum class EInventoryItemState : uint8 {
	EInventoryItemState = 0,
	EInventoryItemState = 1,
	EInventoryItemState = 2,
	EInventoryItemState = 3,
	EInventoryItemState = 4,
	EInventoryItemState = 5,
	EInventoryItemState = 6,
	EInventoryItemState = 7,
	EInventoryItemState = 8
};

// Enum BravoHotelGame.EReplicationItemListType
enum class EReplicationItemListType : uint8 {
	EReplicationItemListType = 0,
	EReplicationItemListType = 1,
	EReplicationItemListType = 2,
	EReplicationItemListType = 3
};

// Enum BravoHotelGame.EAbilityCase
enum class EAbilityCase : uint8 {
	EAbilityCase = 0,
	EAbilityCase = 1,
	EAbilityCase = 2,
	EAbilityCase = 3,
	EAbilityCase = 4,
	EAbilityCase = 5,
	EAbilityCase = 6,
	EAbilityCase = 7,
	EAbilityCase = 8,
	EAbilityCase = 9,
	EAbilityCase = 10,
	EAbilityCase = 11,
	EAbilityCase = 12,
	EAbilityCase = 13,
	EAbilityCase = 14,
	EAbilityCase = 15,
	EAbilityCase = 16,
	EAbilityCase = 17,
	EAbilityCase = 18,
	EAbilityCase = 19,
	EAbilityCase = 20,
	EAbilityCase = 21,
	EAbilityCase = 22
};

// Enum BravoHotelGame.ECharacterConditionType
enum class ECharacterConditionType : uint8 {
	ECharacterConditionType = 0,
	ECharacterConditionType = 1,
	ECharacterConditionType = 2,
	ECharacterConditionType = 3,
	ECharacterConditionType = 4,
	ECharacterConditionType = 5,
	ECharacterConditionType = 6,
	ECharacterConditionType = 7,
	ECharacterConditionType = 8,
	ECharacterConditionType = 9,
	ECharacterConditionType = 10,
	ECharacterConditionType = 11,
	ECharacterConditionType = 12,
	ECharacterConditionType = 13,
	ECharacterConditionType = 14,
	ECharacterConditionType = 15,
	ECharacterConditionType = 16,
	ECharacterConditionType = 17,
	ECharacterConditionType = 18,
	ECharacterConditionType = 19,
	ECharacterConditionType = 20,
	ECharacterConditionType = 21,
	ECharacterConditionType = 22,
	ECharacterConditionType = 23,
	ECharacterConditionType = 24,
	ECharacterConditionType = 25,
	ECharacterConditionType = 26,
	ECharacterConditionType = 27,
	ECharacterConditionType = 28,
	ECharacterConditionType = 29,
	ECharacterConditionType = 30,
	ECharacterConditionType = 31,
	ECharacterConditionType = 32,
	ECharacterConditionType = 33,
	ECharacterConditionType = 34,
	ECharacterConditionType = 35,
	ECharacterConditionType = 36,
	ECharacterConditionType = 37,
	ECharacterConditionType = 38,
	ECharacterConditionType = 39,
	ECharacterConditionType = 40,
	ECharacterConditionType = 41,
	ECharacterConditionType = 42,
	ECharacterConditionType = 43,
	ECharacterConditionType = 44,
	ECharacterConditionType = 45,
	ECharacterConditionType = 46,
	ECharacterConditionType = 47,
	ECharacterConditionType = 48,
	ECharacterConditionType = 49,
	ECharacterConditionType = 50,
	ECharacterConditionType = 51,
	ECharacterConditionType = 52,
	ECharacterConditionType = 53,
	ECharacterConditionType = 54,
	ECharacterConditionType = 55,
	ECharacterConditionType = 56,
	ECharacterConditionType = 57
};

// Enum BravoHotelGame.EPerkLevelUpType
enum class EPerkLevelUpType : uint8 {
	EPerkLevelUpType = 0,
	EPerkLevelUpType = 1,
	EPerkLevelUpType = 2,
	EPerkLevelUpType = 3,
	EPerkLevelUpType = 4,
	EPerkLevelUpType = 5
};

// Enum BravoHotelGame.EPerkSlotFlag
enum class EPerkSlotFlag : uint8 {
	EPerkSlotFlag = 0,
	EPerkSlotFlag = 1,
	EPerkSlotFlag = 2,
	EPerkSlotFlag = 4,
	EPerkSlotFlag = 255,
	EPerkSlotFlag = 256
};

// Enum BravoHotelGame.ECastingUIType
enum class ECastingUIType : uint8 {
	ECastingUIType = 0,
	ECastingUIType = 1,
	ECastingUIType = 2,
	ECastingUIType = 3,
	ECastingUIType = 4,
	ECastingUIType = 5,
	ECastingUIType = 6,
	ECastingUIType = 7
};

// Enum BravoHotelGame.ESettingType
enum class ESettingType : uint8 {
	ESettingType = 0,
	ESettingType = 1,
	ESettingType = 2,
	ESettingType = 3,
	ESettingType = 4,
	ESettingType = 5,
	ESettingType = 6,
	ESettingType = 7,
	ESettingType = 8,
	ESettingType = 9,
	ESettingType = 10,
	ESettingType = 11,
	ESettingType = 12,
	ESettingType = 13,
	ESettingType = 14,
	ESettingType = 15,
	ESettingType = 16,
	ESettingType = 17,
	ESettingType = 18,
	ESettingType = 19,
	ESettingType = 20,
	ESettingType = 21,
	ESettingType = 22,
	ESettingType = 23,
	ESettingType = 24,
	ESettingType = 25,
	ESettingType = 26,
	ESettingType = 27,
	ESettingType = 28,
	ESettingType = 29,
	ESettingType = 30,
	ESettingType = 31,
	ESettingType = 32,
	ESettingType = 33,
	ESettingType = 34,
	ESettingType = 35,
	ESettingType = 36,
	ESettingType = 37,
	ESettingType = 38,
	ESettingType = 39,
	ESettingType = 40,
	ESettingType = 41,
	ESettingType = 42,
	ESettingType = 43,
	ESettingType = 44,
	ESettingType = 45,
	ESettingType = 46,
	ESettingType = 47,
	ESettingType = 48,
	ESettingType = 49,
	ESettingType = 50,
	ESettingType = 51,
	ESettingType = 52,
	ESettingType = 53,
	ESettingType = 54,
	ESettingType = 55,
	ESettingType = 56,
	ESettingType = 57,
	ESettingType = 58,
	ESettingType = 59,
	ESettingType = 60,
	ESettingType = 61,
	ESettingType = 62,
	ESettingType = 63,
	ESettingType = 64,
	ESettingType = 65,
	ESettingType = 66,
	ESettingType = 67,
	ESettingType = 68,
	ESettingType = 69,
	ESettingType = 70,
	ESettingType = 71,
	ESettingType = 72,
	ESettingType = 73,
	ESettingType = 74,
	ESettingType = 75,
	ESettingType = 76,
	ESettingType = 77,
	ESettingType = 78,
	ESettingType = 79,
	ESettingType = 80,
	ESettingType = 81,
	ESettingType = 82,
	ESettingType = 83,
	ESettingType = 84,
	ESettingType = 85,
	ESettingType = 86,
	ESettingType = 87,
	ESettingType = 88,
	ESettingType = 89,
	ESettingType = 90,
	ESettingType = 91,
	ESettingType = 92,
	ESettingType = 93,
	ESettingType = 94,
	ESettingType = 95,
	ESettingType = 96,
	ESettingType = 97,
	ESettingType = 98,
	ESettingType = 99,
	ESettingType = 100,
	ESettingType = 101,
	ESettingType = 102,
	ESettingType = 103,
	ESettingType = 104,
	ESettingType = 105,
	ESettingType = 106,
	ESettingType = 107,
	ESettingType = 108,
	ESettingType = 109,
	ESettingType = 110,
	ESettingType = 111,
	ESettingType = 112,
	ESettingType = 113,
	ESettingType = 114,
	ESettingType = 115,
	ESettingType = 116,
	ESettingType = 117,
	ESettingType = 118,
	ESettingType = 119,
	ESettingType = 120,
	ESettingType = 121
};

// Enum BravoHotelGame.EPlosiveSoundDetectionType
enum class EPlosiveSoundDetectionType : uint8 {
	EPlosiveSoundDetectionType = 0,
	EPlosiveSoundDetectionType = 1,
	EPlosiveSoundDetectionType = 2,
	EPlosiveSoundDetectionType = 3,
	EPlosiveSoundDetectionType = 4
};

// Enum BravoHotelGame.ELandingReason
enum class ELandingReason : uint8 {
	ELandingReason = 0,
	ELandingReason = 1,
	ELandingReason = 2,
	ELandingReason = 3,
	ELandingReason = 4,
	ELandingReason = 5,
	ELandingReason = 6,
	ELandingReason = 7,
	ELandingReason = 8,
	ELandingReason = 9,
	ELandingReason = 10,
	ELandingReason = 11,
	ELandingReason = 12,
	ELandingReason = 13,
	ELandingReason = 14
};

// Enum BravoHotelGame.ELeanState
enum class ELeanState : uint8 {
	ELeanState = 0,
	ELeanState = 1,
	ELeanState = 2,
	ELeanState = 3
};

// Enum BravoHotelGame.ItemWidgetDragType
enum class ItemWidgetDragType : uint8 {
	ItemWidgetDragType = 0,
	ItemWidgetDragType = 1,
	ItemWidgetDragType = 2,
	ItemWidgetDragType = 3,
	ItemWidgetDragType = 4,
	ItemWidgetDragType = 5,
	ItemWidgetDragType = 6,
	ItemWidgetDragType = 7
};

// Enum BravoHotelGame.EWearableItemType
enum class EWearableItemType : uint8 {
	EWearableItemType = 0,
	EWearableItemType = 1,
	EWearableItemType = 2,
	EWearableItemType = 3,
	EWearableItemType = 4,
	EWearableItemType = 5,
	EWearableItemType = 6,
	EWearableItemType = 7,
	EWearableItemType = 8,
	EWearableItemType = 9,
	EWearableItemType = 10,
	EWearableItemType = 11,
	EWearableItemType = 12,
	EWearableItemType = 13,
	EWearableItemType = 14,
	EWearableItemType = 16,
	EWearableItemType = 17,
	EWearableItemType = 18,
	EWearableItemType = 255,
	EWearableItemType = 256
};

// Enum BravoHotelGame.ECharacterAbilityType
enum class ECharacterAbilityType : uint8 {
	ECharacterAbilityType = 0,
	ECharacterAbilityType = 1,
	ECharacterAbilityType = 2,
	ECharacterAbilityType = 3,
	ECharacterAbilityType = 4,
	ECharacterAbilityType = 5,
	ECharacterAbilityType = 6,
	ECharacterAbilityType = 7,
	ECharacterAbilityType = 8,
	ECharacterAbilityType = 9,
	ECharacterAbilityType = 10,
	ECharacterAbilityType = 11,
	ECharacterAbilityType = 12,
	ECharacterAbilityType = 13,
	ECharacterAbilityType = 14,
	ECharacterAbilityType = 15,
	ECharacterAbilityType = 16,
	ECharacterAbilityType = 17,
	ECharacterAbilityType = 18,
	ECharacterAbilityType = 19,
	ECharacterAbilityType = 20,
	ECharacterAbilityType = 21,
	ECharacterAbilityType = 22,
	ECharacterAbilityType = 23,
	ECharacterAbilityType = 24,
	ECharacterAbilityType = 25,
	ECharacterAbilityType = 26,
	ECharacterAbilityType = 27,
	ECharacterAbilityType = 28,
	ECharacterAbilityType = 29,
	ECharacterAbilityType = 30,
	ECharacterAbilityType = 31,
	ECharacterAbilityType = 32,
	ECharacterAbilityType = 33,
	ECharacterAbilityType = 34,
	ECharacterAbilityType = 35,
	ECharacterAbilityType = 36,
	ECharacterAbilityType = 37,
	ECharacterAbilityType = 38,
	ECharacterAbilityType = 39,
	ECharacterAbilityType = 40,
	ECharacterAbilityType = 41,
	ECharacterAbilityType = 42,
	ECharacterAbilityType = 43,
	ECharacterAbilityType = 44,
	ECharacterAbilityType = 45,
	ECharacterAbilityType = 46,
	ECharacterAbilityType = 47,
	ECharacterAbilityType = 48,
	ECharacterAbilityType = 49,
	ECharacterAbilityType = 50,
	ECharacterAbilityType = 51,
	ECharacterAbilityType = 52
};

// Enum BravoHotelGame.EConditionType
enum class EConditionType : uint8 {
	EConditionType = 0,
	EConditionType = 1,
	EConditionType = 2,
	EConditionType = 3,
	EConditionType = 4
};

// Enum BravoHotelGame.EThrowingWeaponState
enum class EThrowingWeaponState : uint8 {
	EThrowingWeaponState = 0,
	EThrowingWeaponState = 1,
	EThrowingWeaponState = 2,
	EThrowingWeaponState = 3,
	EThrowingWeaponState = 4,
	EThrowingWeaponState = 5,
	EThrowingWeaponState = 6,
	EThrowingWeaponState = 7
};

// Enum BravoHotelGame.EFireType
enum class EFireType : uint8 {
	EFireType = 0,
	EFireType = 1,
	EFireType = 2,
	EFireType = 3,
	EFireType = 4,
	EFireType = 5,
	EFireType = 6
};

// Enum BravoHotelGame.ECharacterState
enum class ECharacterState : uint8 {
	ECharacterState = 0,
	ECharacterState = 1,
	ECharacterState = 2,
	ECharacterState = 3,
	ECharacterState = 4,
	ECharacterState = 5,
	ECharacterState = 6,
	ECharacterState = 7,
	ECharacterState = 8,
	ECharacterState = 9,
	ECharacterState = 10,
	ECharacterState = 11,
	ECharacterState = 12,
	ECharacterState = 13,
	ECharacterState = 14,
	ECharacterState = 15,
	ECharacterState = 16,
	ECharacterState = 17,
	ECharacterState = 18,
	ECharacterState = 19
};

// Enum BravoHotelGame.EGrenadeThrowingType
enum class EGrenadeThrowingType : uint8 {
	EGrenadeThrowingType = 0,
	EGrenadeThrowingType = 1,
	EGrenadeThrowingType = 2,
	EGrenadeThrowingType = 3
};

// Enum BravoHotelGame.EWaterDepthType
enum class EWaterDepthType : uint8 {
	EWaterDepthType = 0,
	EWaterDepthType = 1,
	EWaterDepthType = 2,
	EWaterDepthType = 3,
	EWaterDepthType = 4,
	EWaterDepthType = 5,
	EWaterDepthType = 6
};

// Enum BravoHotelGame.ECharacterBuffType
enum class ECharacterBuffType : uint8 {
	ECharacterBuffType = 0,
	ECharacterBuffType = 2,
	ECharacterBuffType = 4,
	ECharacterBuffType = 8,
	ECharacterBuffType = 16,
	ECharacterBuffType = 32,
	ECharacterBuffType = 33
};

// Enum BravoHotelGame.ESuperPeopleClass
enum class ESuperPeopleClass : uint8 {
	ESuperPeopleClass = 0,
	ESuperPeopleClass = 1,
	ESuperPeopleClass = 2,
	ESuperPeopleClass = 3,
	ESuperPeopleClass = 4,
	ESuperPeopleClass = 5,
	ESuperPeopleClass = 6,
	ESuperPeopleClass = 7,
	ESuperPeopleClass = 8,
	ESuperPeopleClass = 9,
	ESuperPeopleClass = 10,
	ESuperPeopleClass = 11,
	ESuperPeopleClass = 12,
	ESuperPeopleClass = 13
};

// Enum BravoHotelGame.ECharacterAudioEventType
enum class ECharacterAudioEventType : uint8 {
	ECharacterAudioEventType = 0,
	ECharacterAudioEventType = 1,
	ECharacterAudioEventType = 2,
	ECharacterAudioEventType = 3,
	ECharacterAudioEventType = 4,
	ECharacterAudioEventType = 5,
	ECharacterAudioEventType = 6
};

// Enum BravoHotelGame.EBattleRoyaleState
enum class EBattleRoyaleState : uint8 {
	EBattleRoyaleState = 0,
	EBattleRoyaleState = 1,
	EBattleRoyaleState = 2,
	EBattleRoyaleState = 3,
	EBattleRoyaleState = 4,
	EBattleRoyaleState = 5,
	EBattleRoyaleState = 6
};

// Enum BravoHotelGame.ECharacterGroundState
enum class ECharacterGroundState : uint8 {
	ECharacterGroundState = 0,
	ECharacterGroundState = 1,
	ECharacterGroundState = 2,
	ECharacterGroundState = 3,
	ECharacterGroundState = 4
};

// Enum BravoHotelGame.EToggleWidgetModeType
enum class EToggleWidgetModeType : uint8 {
	EToggleWidgetModeType = 0,
	EToggleWidgetModeType = 1,
	EToggleWidgetModeType = 2,
	EToggleWidgetModeType = 3,
	EToggleWidgetModeType = 4,
	EToggleWidgetModeType = 5
};

// Enum BravoHotelGame.ETargetHealthType
enum class ETargetHealthType : uint8 {
	ETargetHealthType = 0,
	ETargetHealthType = 1,
	ETargetHealthType = 2,
	ETargetHealthType = 3
};

// Enum BravoHotelGame.EInteractionType
enum class EInteractionType : uint8 {
	EInteractionType = 0,
	EInteractionType = 1,
	EInteractionType = 2,
	EInteractionType = 3,
	EInteractionType = 4,
	EInteractionType = 5,
	EInteractionType = 6,
	EInteractionType = 7,
	EInteractionType = 8,
	EInteractionType = 9,
	EInteractionType = 10,
	EInteractionType = 11,
	EInteractionType = 12,
	EInteractionType = 13,
	EInteractionType = 14
};

// Enum BravoHotelGame.EProjectileGrenadeState
enum class EProjectileGrenadeState : uint8 {
	EProjectileGrenadeState = 0,
	EProjectileGrenadeState = 1,
	EProjectileGrenadeState = 2,
	EProjectileGrenadeState = 3,
	EProjectileGrenadeState = 4,
	EProjectileGrenadeState = 5,
	EProjectileGrenadeState = 6
};

// Enum BravoHotelGame.EInDoorAdjustmentTarget
enum class EInDoorAdjustmentTarget : uint8 {
	EInDoorAdjustmentTarget = 0,
	EInDoorAdjustmentTarget = 1,
	EInDoorAdjustmentTarget = 2,
	EInDoorAdjustmentTarget = 4,
	EInDoorAdjustmentTarget = 5
};

// Enum BravoHotelGame.EKeySettingType
enum class EKeySettingType : uint8 {
	EKeySettingType = 0,
	EKeySettingType = 1,
	EKeySettingType = 2,
	EKeySettingType = 3,
	EKeySettingType = 4,
	EKeySettingType = 5,
	EKeySettingType = 6,
	EKeySettingType = 7,
	EKeySettingType = 8,
	EKeySettingType = 9,
	EKeySettingType = 10,
	EKeySettingType = 11,
	EKeySettingType = 12,
	EKeySettingType = 13,
	EKeySettingType = 14,
	EKeySettingType = 15,
	EKeySettingType = 16,
	EKeySettingType = 17,
	EKeySettingType = 18,
	EKeySettingType = 19,
	EKeySettingType = 20,
	EKeySettingType = 21,
	EKeySettingType = 22,
	EKeySettingType = 23,
	EKeySettingType = 24,
	EKeySettingType = 25,
	EKeySettingType = 26,
	EKeySettingType = 27,
	EKeySettingType = 28,
	EKeySettingType = 29,
	EKeySettingType = 30,
	EKeySettingType = 31,
	EKeySettingType = 32,
	EKeySettingType = 33,
	EKeySettingType = 34,
	EKeySettingType = 35,
	EKeySettingType = 36,
	EKeySettingType = 37,
	EKeySettingType = 38,
	EKeySettingType = 39,
	EKeySettingType = 40,
	EKeySettingType = 41,
	EKeySettingType = 42,
	EKeySettingType = 43,
	EKeySettingType = 44,
	EKeySettingType = 45,
	EKeySettingType = 46,
	EKeySettingType = 47,
	EKeySettingType = 48,
	EKeySettingType = 49,
	EKeySettingType = 50,
	EKeySettingType = 51,
	EKeySettingType = 52,
	EKeySettingType = 53,
	EKeySettingType = 54,
	EKeySettingType = 55,
	EKeySettingType = 56,
	EKeySettingType = 57,
	EKeySettingType = 58,
	EKeySettingType = 59,
	EKeySettingType = 60,
	EKeySettingType = 61,
	EKeySettingType = 62,
	EKeySettingType = 63,
	EKeySettingType = 64,
	EKeySettingType = 65,
	EKeySettingType = 66,
	EKeySettingType = 67,
	EKeySettingType = 68,
	EKeySettingType = 69,
	EKeySettingType = 70,
	EKeySettingType = 71,
	EKeySettingType = 72,
	EKeySettingType = 73,
	EKeySettingType = 74,
	EKeySettingType = 75,
	EKeySettingType = 76,
	EKeySettingType = 77,
	EKeySettingType = 78,
	EKeySettingType = 79,
	EKeySettingType = 80,
	EKeySettingType = 81,
	EKeySettingType = 82,
	EKeySettingType = 83,
	EKeySettingType = 84,
	EKeySettingType = 85,
	EKeySettingType = 86,
	EKeySettingType = 87,
	EKeySettingType = 88,
	EKeySettingType = 89,
	EKeySettingType = 90,
	EKeySettingType = 91,
	EKeySettingType = 92,
	EKeySettingType = 93,
	EKeySettingType = 94,
	EKeySettingType = 95,
	EKeySettingType = 96,
	EKeySettingType = 97,
	EKeySettingType = 98,
	EKeySettingType = 99,
	EKeySettingType = 100,
	EKeySettingType = 101,
	EKeySettingType = 102,
	EKeySettingType = 103,
	EKeySettingType = 104,
	EKeySettingType = 105,
	EKeySettingType = 106,
	EKeySettingType = 107,
	EKeySettingType = 108,
	EKeySettingType = 109,
	EKeySettingType = 110,
	EKeySettingType = 111,
	EKeySettingType = 112,
	EKeySettingType = 113,
	EKeySettingType = 114,
	EKeySettingType = 115,
	EKeySettingType = 116,
	EKeySettingType = 117,
	EKeySettingType = 118,
	EKeySettingType = 119,
	EKeySettingType = 120,
	EKeySettingType = 121,
	EKeySettingType = 122,
	EKeySettingType = 123,
	EKeySettingType = 124,
	EKeySettingType = 125,
	EKeySettingType = 126,
	EKeySettingType = 127,
	EKeySettingType = 128,
	EKeySettingType = 129,
	EKeySettingType = 130,
	EKeySettingType = 131,
	EKeySettingType = 132,
	EKeySettingType = 133,
	EKeySettingType = 134,
	EKeySettingType = 135,
	EKeySettingType = 136,
	EKeySettingType = 137,
	EKeySettingType = 138,
	EKeySettingType = 139,
	EKeySettingType = 140,
	EKeySettingType = 141
};

// Enum BravoHotelGame.EWeaponAttachmentItem
enum class EWeaponAttachmentItem : uint8 {
	EWeaponAttachmentItem = 0,
	EWeaponAttachmentItem = 1,
	EWeaponAttachmentItem = 2,
	EWeaponAttachmentItem = 3,
	EWeaponAttachmentItem = 4,
	EWeaponAttachmentItem = 5,
	EWeaponAttachmentItem = 6,
	EWeaponAttachmentItem = 7,
	EWeaponAttachmentItem = 8,
	EWeaponAttachmentItem = 9,
	EWeaponAttachmentItem = 10,
	EWeaponAttachmentItem = 11,
	EWeaponAttachmentItem = 12,
	EWeaponAttachmentItem = 13,
	EWeaponAttachmentItem = 14,
	EWeaponAttachmentItem = 15,
	EWeaponAttachmentItem = 16,
	EWeaponAttachmentItem = 17,
	EWeaponAttachmentItem = 18,
	EWeaponAttachmentItem = 19,
	EWeaponAttachmentItem = 20,
	EWeaponAttachmentItem = 21,
	EWeaponAttachmentItem = 22,
	EWeaponAttachmentItem = 23,
	EWeaponAttachmentItem = 24,
	EWeaponAttachmentItem = 25,
	EWeaponAttachmentItem = 26,
	EWeaponAttachmentItem = 27,
	EWeaponAttachmentItem = 28,
	EWeaponAttachmentItem = 29,
	EWeaponAttachmentItem = 30,
	EWeaponAttachmentItem = 31,
	EWeaponAttachmentItem = 32,
	EWeaponAttachmentItem = 33,
	EWeaponAttachmentItem = 34,
	EWeaponAttachmentItem = 35,
	EWeaponAttachmentItem = 36,
	EWeaponAttachmentItem = 37,
	EWeaponAttachmentItem = 38,
	EWeaponAttachmentItem = 39,
	EWeaponAttachmentItem = 40,
	EWeaponAttachmentItem = 41,
	EWeaponAttachmentItem = 42,
	EWeaponAttachmentItem = 43,
	EWeaponAttachmentItem = 44,
	EWeaponAttachmentItem = 45,
	EWeaponAttachmentItem = 46,
	EWeaponAttachmentItem = 47
};

// Enum BravoHotelGame.ECustomMovementMode
enum class ECustomMovementMode : uint8 {
	ECustomMovementMode = 0,
	ECustomMovementMode = 1,
	ECustomMovementMode = 2,
	ECustomMovementMode = 3,
	ECustomMovementMode = 4,
	ECustomMovementMode = 5,
	ECustomMovementMode = 6
};

// Enum BravoHotelGame.EMouseSensitivityState
enum class EMouseSensitivityState : uint8 {
	EMouseSensitivityState = 0,
	EMouseSensitivityState = 1,
	EMouseSensitivityState = 2,
	EMouseSensitivityState = 3,
	EMouseSensitivityState = 4,
	EMouseSensitivityState = 5,
	EMouseSensitivityState = 6,
	EMouseSensitivityState = 7,
	EMouseSensitivityState = 8,
	EMouseSensitivityState = 9,
	EMouseSensitivityState = 10,
	EMouseSensitivityState = 11,
	EMouseSensitivityState = 12,
	EMouseSensitivityState = 13
};

// Enum BravoHotelGame.ECharacterConditionedAbilityType
enum class ECharacterConditionedAbilityType : uint8 {
	ECharacterConditionedAbilityType = 0,
	ECharacterConditionedAbilityType = 1,
	ECharacterConditionedAbilityType = 2,
	ECharacterConditionedAbilityType = 3,
	ECharacterConditionedAbilityType = 4,
	ECharacterConditionedAbilityType = 5,
	ECharacterConditionedAbilityType = 6,
	ECharacterConditionedAbilityType = 7,
	ECharacterConditionedAbilityType = 8,
	ECharacterConditionedAbilityType = 9,
	ECharacterConditionedAbilityType = 10,
	ECharacterConditionedAbilityType = 11,
	ECharacterConditionedAbilityType = 12,
	ECharacterConditionedAbilityType = 13,
	ECharacterConditionedAbilityType = 14,
	ECharacterConditionedAbilityType = 15,
	ECharacterConditionedAbilityType = 16,
	ECharacterConditionedAbilityType = 17,
	ECharacterConditionedAbilityType = 18,
	ECharacterConditionedAbilityType = 19,
	ECharacterConditionedAbilityType = 20,
	ECharacterConditionedAbilityType = 21,
	ECharacterConditionedAbilityType = 22,
	ECharacterConditionedAbilityType = 23,
	ECharacterConditionedAbilityType = 24,
	ECharacterConditionedAbilityType = 25,
	ECharacterConditionedAbilityType = 26,
	ECharacterConditionedAbilityType = 27,
	ECharacterConditionedAbilityType = 28,
	ECharacterConditionedAbilityType = 29,
	ECharacterConditionedAbilityType = 30,
	ECharacterConditionedAbilityType = 31,
	ECharacterConditionedAbilityType = 32,
	ECharacterConditionedAbilityType = 33,
	ECharacterConditionedAbilityType = 34,
	ECharacterConditionedAbilityType = 35,
	ECharacterConditionedAbilityType = 36,
	ECharacterConditionedAbilityType = 37,
	ECharacterConditionedAbilityType = 38,
	ECharacterConditionedAbilityType = 39,
	ECharacterConditionedAbilityType = 40,
	ECharacterConditionedAbilityType = 41,
	ECharacterConditionedAbilityType = 42,
	ECharacterConditionedAbilityType = 43,
	ECharacterConditionedAbilityType = 44,
	ECharacterConditionedAbilityType = 45,
	ECharacterConditionedAbilityType = 46,
	ECharacterConditionedAbilityType = 47,
	ECharacterConditionedAbilityType = 48,
	ECharacterConditionedAbilityType = 49,
	ECharacterConditionedAbilityType = 50,
	ECharacterConditionedAbilityType = 51,
	ECharacterConditionedAbilityType = 52,
	ECharacterConditionedAbilityType = 53,
	ECharacterConditionedAbilityType = 54,
	ECharacterConditionedAbilityType = 55,
	ECharacterConditionedAbilityType = 56,
	ECharacterConditionedAbilityType = 57,
	ECharacterConditionedAbilityType = 58,
	ECharacterConditionedAbilityType = 59
};

// Enum BravoHotelGame.EPingType
enum class EPingType : uint8 {
	EPingType = 0,
	EPingType = 1,
	EPingType = 2,
	EPingType = 3,
	EPingType = 4,
	EPingType = 5,
	EPingType = 6,
	EPingType = 7,
	EPingType = 8,
	EPingType = 9,
	EPingType = 10,
	EPingType = 11,
	EPingType = 12,
	EPingType = 13,
	EPingType = 14,
	EPingType = 15,
	EPingType = 16,
	EPingType = 17,
	EPingType = 18
};

// Enum BravoHotelGame.ELogTag
enum class ELogTag : uint8 {
	ELogTag = 0,
	ELogTag = 1,
	ELogTag = 2
};

// Enum BravoHotelGame.ELoadingScreenType
enum class ELoadingScreenType : uint8 {
	ELoadingScreenType = 0,
	ELoadingScreenType = 1,
	ELoadingScreenType = 2,
	ELoadingScreenType = 3,
	ELoadingScreenType = 4,
	ELoadingScreenType = 5,
	ELoadingScreenType = 6,
	ELoadingScreenType = 7,
	ELoadingScreenType = 8,
	ELoadingScreenType = 9
};

// Enum BravoHotelGame.EHUDMessageType
enum class EHUDMessageType : uint8 {
	EHUDMessageType = 0,
	EHUDMessageType = 1,
	EHUDMessageType = 2,
	EHUDMessageType = 3,
	EHUDMessageType = 4,
	EHUDMessageType = 5,
	EHUDMessageType = 6,
	EHUDMessageType = 7,
	EHUDMessageType = 8,
	EHUDMessageType = 9,
	EHUDMessageType = 10,
	EHUDMessageType = 11,
	EHUDMessageType = 12,
	EHUDMessageType = 13,
	EHUDMessageType = 14,
	EHUDMessageType = 15,
	EHUDMessageType = 16,
	EHUDMessageType = 17,
	EHUDMessageType = 18,
	EHUDMessageType = 19,
	EHUDMessageType = 20,
	EHUDMessageType = 21,
	EHUDMessageType = 22,
	EHUDMessageType = 23,
	EHUDMessageType = 24,
	EHUDMessageType = 25,
	EHUDMessageType = 26,
	EHUDMessageType = 27,
	EHUDMessageType = 28,
	EHUDMessageType = 29,
	EHUDMessageType = 30,
	EHUDMessageType = 31,
	EHUDMessageType = 32
};

// Enum BravoHotelGame.EHUDMessageTableType
enum class EHUDMessageTableType : uint8 {
	EHUDMessageTableType = 0,
	EHUDMessageTableType = 1,
	EHUDMessageTableType = 2,
	EHUDMessageTableType = 3,
	EHUDMessageTableType = 4
};

// Enum BravoHotelGame.EPresenceState
enum class EPresenceState : uint8 {
	EPresenceState = 0,
	EPresenceState = 1,
	EPresenceState = 2,
	EPresenceState = 3
};

// Enum BravoHotelGame.ERandomType
enum class ERandomType : uint8 {
	ERandomType = 0,
	ERandomType = 1,
	ERandomType = 2,
	ERandomType = 3
};

// Enum BravoHotelGame.EKeySettingSubType
enum class EKeySettingSubType : uint8 {
	EKeySettingSubType = 0,
	EKeySettingSubType = 1,
	EKeySettingSubType = 2,
	EKeySettingSubType = 3,
	EKeySettingSubType = 4,
	EKeySettingSubType = 5,
	EKeySettingSubType = 6,
	EKeySettingSubType = 7,
	EKeySettingSubType = 8,
	EKeySettingSubType = 9,
	EKeySettingSubType = 10,
	EKeySettingSubType = 11,
	EKeySettingSubType = 12,
	EKeySettingSubType = 13,
	EKeySettingSubType = 14,
	EKeySettingSubType = 15,
	EKeySettingSubType = 16
};

// Enum BravoHotelGame.ESlotType
enum class ESlotType : uint8 {
	ESlotType = 0,
	ESlotType = 1,
	ESlotType = 2,
	ESlotType = 3,
	ESlotType = 4,
	ESlotType = 5
};

// Enum BravoHotelGame.ESettingBigType
enum class ESettingBigType : uint8 {
	ESettingBigType = 0,
	ESettingBigType = 1,
	ESettingBigType = 2,
	ESettingBigType = 3,
	ESettingBigType = 4,
	ESettingBigType = 5,
	ESettingBigType = 6
};

// Enum BravoHotelGame.EPersonalSupplyBoxPingType
enum class EPersonalSupplyBoxPingType : uint8 {
	EPersonalSupplyBoxPingType = 0,
	EPersonalSupplyBoxPingType = 1,
	EPersonalSupplyBoxPingType = 2,
	EPersonalSupplyBoxPingType = 3
};

// Enum BravoHotelGame.CheatParamType
enum class CheatParamType : uint8 {
	CheatParamType = 0,
	CheatParamType = 1,
	CheatParamType = 2,
	CheatParamType = 3,
	CheatParamType = 4
};

// Enum BravoHotelGame.EItemPingIconType
enum class EItemPingIconType : uint8 {
	EItemPingIconType = 0,
	EItemPingIconType = 1,
	EItemPingIconType = 2,
	EItemPingIconType = 3,
	EItemPingIconType = 4,
	EItemPingIconType = 5,
	EItemPingIconType = 6,
	EItemPingIconType = 7,
	EItemPingIconType = 8,
	EItemPingIconType = 9
};

// Enum BravoHotelGame.EWeaponFireMode
enum class EWeaponFireMode : uint8 {
	EWeaponFireMode = 0,
	EWeaponFireMode = 1,
	EWeaponFireMode = 2,
	EWeaponFireMode = 3
};

// Enum BravoHotelGame.ELoadingType
enum class ELoadingType : uint8 {
	ELoadingType = 0,
	ELoadingType = 1,
	ELoadingType = 2,
	ELoadingType = 3
};

// Enum BravoHotelGame.EWeaponAttachmentBarrel
enum class EWeaponAttachmentBarrel : uint8 {
	EWeaponAttachmentBarrel = 0,
	EWeaponAttachmentBarrel = 1,
	EWeaponAttachmentBarrel = 2,
	EWeaponAttachmentBarrel = 3
};

// Enum BravoHotelGame.EWeaponAttachmentMuzzleDevice
enum class EWeaponAttachmentMuzzleDevice : uint8 {
	EWeaponAttachmentMuzzleDevice = 0,
	EWeaponAttachmentMuzzleDevice = 1,
	EWeaponAttachmentMuzzleDevice = 2,
	EWeaponAttachmentMuzzleDevice = 3,
	EWeaponAttachmentMuzzleDevice = 4,
	EWeaponAttachmentMuzzleDevice = 5,
	EWeaponAttachmentMuzzleDevice = 6,
	EWeaponAttachmentMuzzleDevice = 7,
	EWeaponAttachmentMuzzleDevice = 8,
	EWeaponAttachmentMuzzleDevice = 9,
	EWeaponAttachmentMuzzleDevice = 10,
	EWeaponAttachmentMuzzleDevice = 11,
	EWeaponAttachmentMuzzleDevice = 12
};

// Enum BravoHotelGame.EWeaponAttachmentStock
enum class EWeaponAttachmentStock : uint8 {
	EWeaponAttachmentStock = 0,
	EWeaponAttachmentStock = 1,
	EWeaponAttachmentStock = 2,
	EWeaponAttachmentStock = 3,
	EWeaponAttachmentStock = 4,
	EWeaponAttachmentStock = 5,
	EWeaponAttachmentStock = 6
};

// Enum BravoHotelGame.EWeaponAttachmentMagazine
enum class EWeaponAttachmentMagazine : uint8 {
	EWeaponAttachmentMagazine = 0,
	EWeaponAttachmentMagazine = 1,
	EWeaponAttachmentMagazine = 2,
	EWeaponAttachmentMagazine = 3,
	EWeaponAttachmentMagazine = 4,
	EWeaponAttachmentMagazine = 5,
	EWeaponAttachmentMagazine = 6,
	EWeaponAttachmentMagazine = 7,
	EWeaponAttachmentMagazine = 8,
	EWeaponAttachmentMagazine = 9,
	EWeaponAttachmentMagazine = 10,
	EWeaponAttachmentMagazine = 11,
	EWeaponAttachmentMagazine = 12,
	EWeaponAttachmentMagazine = 13,
	EWeaponAttachmentMagazine = 14
};

// Enum BravoHotelGame.EWeaponAttachmentGrip
enum class EWeaponAttachmentGrip : uint8 {
	EWeaponAttachmentGrip = 0,
	EWeaponAttachmentGrip = 1,
	EWeaponAttachmentGrip = 2,
	EWeaponAttachmentGrip = 3
};

// Enum BravoHotelGame.EWeaponAttachmentType
enum class EWeaponAttachmentType : uint8 {
	EWeaponAttachmentType = 0,
	EWeaponAttachmentType = 1,
	EWeaponAttachmentType = 2,
	EWeaponAttachmentType = 3,
	EWeaponAttachmentType = 4,
	EWeaponAttachmentType = 5,
	EWeaponAttachmentType = 6,
	EWeaponAttachmentType = 7,
	EWeaponAttachmentType = 8,
	EWeaponAttachmentType = 9,
	EWeaponAttachmentType = 10,
	EWeaponAttachmentType = 11,
	EWeaponAttachmentType = 12,
	EWeaponAttachmentType = 13
};

// Enum BravoHotelGame.EWeaponAttachmentUseType
enum class EWeaponAttachmentUseType : uint8 {
	EWeaponAttachmentUseType = 0,
	EWeaponAttachmentUseType = 1,
	EWeaponAttachmentUseType = 2,
	EWeaponAttachmentUseType = 3
};

// Enum BravoHotelGame.EThrowingWeaponType
enum class EThrowingWeaponType : uint8 {
	EThrowingWeaponType = 0,
	EThrowingWeaponType = 1,
	EThrowingWeaponType = 2,
	EThrowingWeaponType = 3,
	EThrowingWeaponType = 4,
	EThrowingWeaponType = 5,
	EThrowingWeaponType = 6
};

// Enum BravoHotelGame.EGuideWidgetType
enum class EGuideWidgetType : uint8 {
	EGuideWidgetType = 0,
	EGuideWidgetType = 1,
	EGuideWidgetType = 2,
	EGuideWidgetType = 3,
	EGuideWidgetType = 4,
	EGuideWidgetType = 5,
	EGuideWidgetType = 6,
	EGuideWidgetType = 7,
	EGuideWidgetType = 8,
	EGuideWidgetType = 9,
	EGuideWidgetType = 10,
	EGuideWidgetType = 11
};

// Enum BravoHotelGame.EBravoHotel_ZipUtilityCompressionFormat
enum class EBravoHotel_ZipUtilityCompressionFormat : uint8 {
	EBravoHotel_ZipUtilityCompressionFormat = 0,
	EBravoHotel_ZipUtilityCompressionFormat = 1,
	EBravoHotel_ZipUtilityCompressionFormat = 2,
	EBravoHotel_ZipUtilityCompressionFormat = 3,
	EBravoHotel_ZipUtilityCompressionFormat = 4,
	EBravoHotel_ZipUtilityCompressionFormat = 5,
	EBravoHotel_ZipUtilityCompressionFormat = 6,
	EBravoHotel_ZipUtilityCompressionFormat = 7,
	EBravoHotel_ZipUtilityCompressionFormat = 8,
	EBravoHotel_ZipUtilityCompressionFormat = 9,
	EBravoHotel_ZipUtilityCompressionFormat = 10,
	EBravoHotel_ZipUtilityCompressionFormat = 11
};

// Enum BravoHotelGame.EAudioSettingType
enum class EAudioSettingType : uint8 {
	EAudioSettingType = 0,
	EAudioSettingType = 1,
	EAudioSettingType = 2,
	EAudioSettingType = 3,
	EAudioSettingType = 4,
	EAudioSettingType = 5,
	EAudioSettingType = 6,
	EAudioSettingType = 7
};

// Enum BravoHotelGame.EBeginReportWidgetType
enum class EBeginReportWidgetType : uint8 {
	EBeginReportWidgetType = 0,
	EBeginReportWidgetType = 1,
	EBeginReportWidgetType = 2,
	EBeginReportWidgetType = 3,
	EBeginReportWidgetType = 4
};

// Enum BravoHotelGame.EGameExitType
enum class EGameExitType : uint8 {
	EGameExitType = 0,
	EGameExitType = 1,
	EGameExitType = 2,
	EGameExitType = 3
};

// Enum BravoHotelGame.ELob
enum class ELobd : uint8 {
	ELob = 0,
	ELobd = 1,
	ELobd = 2,
	ELobd = 3,
	ELobd = 4,
	ELobd = 5
};

// Enum BravoHotelGame.EReportType
enum class EReportType : uint8 {
	EReportType = 0,
	EReportType = 1,
	EReportType = 2,
	EReportType = 3,
	EReportType = 4,
	EReportType = 5
};

// Enum BravoHotelGame.ENormalType
enum class ENormalType : uint8 {
	ENormalType = 0,
	ENormalType = 1,
	ENormalType = 2,
	ENormalType = 3,
	ENormalType = 4,
	ENormalType = 5,
	ENormalType = 6,
	ENormalType = 7,
	ENormalType = 8,
	ENormalType = 9,
	ENormalType = 10,
	ENormalType = 11,
	ENormalType = 12,
	ENormalType = 13,
	ENormalType = 14,
	ENormalType = 15,
	ENormalType = 16,
	ENormalType = 17
};

// Enum BravoHotelGame.EDevelopmentStatus
enum class EDevelopmentStatus : uint8 {
	EDevelopmentStatus = 0,
	EDevelopmentStatus = 1,
	EDevelopmentStatus = 2,
	EDevelopmentStatus = 3
};

// Enum BravoHotelGame.ERewardChangeType
enum class ERewardChangeType : uint8 {
	ERewardChangeType = 0,
	ERewardChangeType = 1,
	ERewardChangeType = 2
};

// Enum BravoHotelGame.EItemRarity
enum class EItemRarity : uint8 {
	EItemRarity = 0,
	EItemRarity_1 = 0,
	EItemRarity_2 = 1,
	EItemRarity_3 = 2,
	EItemRarity_4 = 3,
	EItemRarity_5 = 4,
	EItemRarity_6 = 5,
	EItemRarity_7 = 6,
	EItemRarity_8 = 7,
	EItemRarity_9 = 8,
	EItemRarity_10 = 9,
	EItemRarity_11 = 10,
	EItemRarity = 11
};

// Enum BravoHotelGame.EGenderType
enum class EGenderType : uint8 {
	EGenderType = 0,
	EGenderType = 1,
	EGenderType = 2,
	EGenderType = 3,
	EGenderType = 4
};

// Enum BravoHotelGame.EItemLifeTimeType
enum class EItemLifeTimeType : uint8 {
	EItemLifeTimeType = 0,
	EItemLifeTimeType = 1,
	EItemLifeTimeType = 2,
	EItemLifeTimeType = 3,
	EItemLifeTimeType = 4,
	EItemLifeTimeType = 5
};

// Enum BravoHotelGame.EConsumablesItemType
enum class EConsumablesItemType : uint8 {
	EConsumablesItemType = 0,
	EConsumablesItemType = 1,
	EConsumablesItemType = 2,
	EConsumablesItemType = 3,
	EConsumablesItemType = 4,
	EConsumablesItemType = 5,
	EConsumablesItemType = 6,
	EConsumablesItemType = 7,
	EConsumablesItemType = 8,
	EConsumablesItemType = 9,
	EConsumablesItemType = 10,
	EConsumablesItemType = 11,
	EConsumablesItemType = 12,
	EConsumablesItemType = 255,
	EConsumablesItemType = 256
};

// Enum BravoHotelGame.EItemType
enum class EItemType : uint8 {
	EItemType = 0,
	EItemType = 1,
	EItemType = 2,
	EItemType = 3,
	EItemType = 4,
	EItemType = 5,
	EItemType = 6,
	EItemType = 7,
	EItemType = 8,
	EItemType = 9,
	EItemType = 10,
	EItemType = 11,
	EItemType = 12,
	EItemType = 13
};

// Enum BravoHotelGame.EResultUIType
enum class EResultUIType : uint8 {
	EResultUIType = 0,
	EResultUIType = 1,
	EResultUIType = 2,
	EResultUIType = 3
};

// Enum BravoHotelGame.EPlayerState
enum class EPlayerState : uint8 {
	EPlayerState = 0,
	EPlayerState = 1,
	EPlayerState = 2,
	EPlayerState = 3,
	EPlayerState = 4,
	EPlayerState = 5,
	EPlayerState = 6,
	EPlayerState = 7,
	EPlayerState = 8,
	EPlayerState = 9,
	EPlayerState = 10,
	EPlayerState = 11,
	EPlayerState = 12,
	EPlayerState = 13
};

// Enum BravoHotelGame.EItemSpawnPriorityType
enum class EItemSpawnPriorityType : uint8 {
	EItemSpawnPriorityType = 0,
	EItemSpawnPriorityType = 1,
	EItemSpawnPriorityType = 2,
	EItemSpawnPriorityType = 3
};

// Enum BravoHotelGame.ESpectatingMode
enum class ESpectatingMode : uint8 {
	ESpectatingMode = 0,
	ESpectatingMode = 1,
	ESpectatingMode = 2,
	ESpectatingMode = 3,
	ESpectatingMode = 4,
	ESpectatingMode = 5
};

// Enum BravoHotelGame.EPlayerBehavior
enum class EPlayerBehavior : uint8 {
	EPlayerBehavior = 0,
	EPlayerBehavior = 1,
	EPlayerBehavior = 2,
	EPlayerBehavior = 3,
	EPlayerBehavior = 4,
	EPlayerBehavior = 5,
	EPlayerBehavior = 6,
	EPlayerBehavior = 7,
	EPlayerBehavior = 8
};

// Enum BravoHotelGame.EPromotionCondition
enum class EPromotionCondition : uint8 {
	EPromotionCondition = 0,
	EPromotionCondition = 1
};

// Enum BravoHotelGame.EProjectileBehavior
enum class EProjectileBehavior : uint8 {
	EProjectileBehavior = 0,
	EProjectileBehavior = 1,
	EProjectileBehavior = 2,
	EProjectileBehavior = 3
};

// Enum BravoHotelGame.EQuestTaskType
enum class EQuestTaskType : uint8 {
	EQuestTaskType = 0,
	EQuestTaskType = 1,
	EQuestTaskType = 2,
	EQuestTaskType = 3,
	EQuestTaskType = 4,
	EQuestTaskType = 5,
	EQuestTaskType = 6,
	EQuestTaskType = 7,
	EQuestTaskType = 8,
	EQuestTaskType = 9,
	EQuestTaskType = 10,
	EQuestTaskType = 11
};

// Enum BravoHotelGame.EVehicleState
enum class EVehicleState : uint8 {
	EVehicleState = 1,
	EVehicleState = 2,
	EVehicleState = 3,
	EVehicleState = 4,
	EVehicleState = 5,
	EVehicleState = 6,
	EVehicleState = 7,
	EVehicleState = 8,
	EVehicleState = 9
};

// Enum BravoHotelGame.EQuestState
enum class EQuestState : uint8 {
	EQuestState = 0,
	EQuestState = 1,
	EQuestState = 2,
	EQuestState = 3,
	EQuestState = 4
};

// Enum BravoHotelGame.EDediGameCheatType
enum class EDediGameCheatType : uint8 {
	EDediGameCheatType = 0,
	EDediGameCheatType = 1,
	EDediGameCheatType = 2
};

// Enum BravoHotelGame.EMatchingType
enum class EMatchingType : uint8 {
	EMatchingType = 0,
	EMatchingType = 1,
	EMatchingType = 2,
	EMatchingType = 4,
	EMatchingType = 5
};

// Enum BravoHotelGame.EGameViewType
enum class EGameViewType : uint8 {
	EGameViewType = 0,
	EGameViewType = 1,
	EGameViewType = 2,
	EGameViewType = 3
};

// Enum BravoHotelGame.ELoginType
enum class ELoginType : uint8 {
	ELoginType = 0,
	ELoginType = 1,
	ELoginType = 2,
	ELoginType = 3,
	ELoginType = 4,
	ELoginType = 5
};

// Enum BravoHotelGame.EGameMode
enum class EGameMode : uint8 {
	EGameMode = 0,
	EGameMode = 1,
	EGameMode = 2,
	EGameMode = 3,
	EGameMode = 4,
	EGameMode = 5
};

// Enum BravoHotelGame.EBluseZoneState
enum class EBluseZoneState : uint8 {
	EBluseZoneState = 0,
	EBluseZoneState = 1,
	EBluseZoneState = 2,
	EBluseZoneState = 3,
	EBluseZoneState = 4
};

// Enum BravoHotelGame.EWorldMapAreaWidgetType
enum class EWorldMapAreaWidgetType : uint8 {
	EWorldMapAreaWidgetType = 0,
	EWorldMapAreaWidgetType = 1,
	EWorldMapAreaWidgetType = 2,
	EWorldMapAreaWidgetType = 3,
	EWorldMapAreaWidgetType = 4,
	EWorldMapAreaWidgetType = 5,
	EWorldMapAreaWidgetType = 6,
	EWorldMapAreaWidgetType = 7,
	EWorldMapAreaWidgetType = 8,
	EWorldMapAreaWidgetType = 9,
	EWorldMapAreaWidgetType = 10,
	EWorldMapAreaWidgetType = 11,
	EWorldMapAreaWidgetType = 12,
	EWorldMapAreaWidgetType = 13,
	EWorldMapAreaWidgetType = 14,
	EWorldMapAreaWidgetType = 15,
	EWorldMapAreaWidgetType = 16,
	EWorldMapAreaWidgetType = 17,
	EWorldMapAreaWidgetType = 18,
	EWorldMapAreaWidgetType = 19,
	EWorldMapAreaWidgetType = 20,
	EWorldMapAreaWidgetType = 21,
	EWorldMapAreaWidgetType = 22
};

// Enum BravoHotelGame.EBroadCastTeamType
enum class EBroadCastTeamType : uint8 {
	EBroadCastTeamType = 0,
	EBroadCastTeamType = 1,
	EBroadCastTeamType = 2,
	EBroadCastTeamType = 3,
	EBroadCastTeamType = 4
};

// Enum BravoHotelGame.EBroadCastKillMessageType
enum class EBroadCastKillMessageType : uint8 {
	EBroadCastKillMessageType = 0,
	EBroadCastKillMessageType = 1,
	EBroadCastKillMessageType = 2,
	EBroadCastKillMessageType = 3,
	EBroadCastKillMessageType = 4,
	EBroadCastKillMessageType = 5
};

// Enum BravoHotelGame.EStatupAnimType
enum class EStatupAnimType : uint8 {
	EStatupAnimType = 0,
	EStatupAnimType = 1,
	EStatupAnimType = 2,
	EStatupAnimType = 3,
	EStatupAnimType = 4,
	EStatupAnimType = 5,
	EStatupAnimType = 6
};

// Enum BravoHotelGame.ESceneType
enum class ESceneType : uint8 {
	ESceneType = 0,
	ESceneType = 1,
	ESceneType = 2,
	ESceneType = 3,
	ESceneType = 4,
	ESceneType = 5,
	ESceneType = 6,
	ESceneType = 7,
	ESceneType = 8,
	ESceneType = 9,
	ESceneType = 10,
	ESceneType = 11,
	ESceneType = 12,
	ESceneType = 13
};

// Enum BravoHotelGame.ELoginFlow
enum class ELoginFlow : uint8 {
	ELoginFlow = 0,
	ELoginFlow = 1,
	ELoginFlow = 2,
	ELoginFlow = 3,
	ELoginFlow = 4
};

// Enum BravoHotelGame.ESteamPresenceState
enum class ESteamPresenceState : uint8 {
	ESteamPresenceState = 0,
	ESteamPresenceState = 1,
	ESteamPresenceState = 2,
	ESteamPresenceState = 3,
	ESteamPresenceState = 4,
	ESteamPresenceState = 5,
	ESteamPresenceState = 6
};

// Enum BravoHotelGame.EVehicleWheelType
enum class EVehicleWheelType : uint8 {
	EVehicleWheelType = 0,
	EVehicleWheelType = 1,
	EVehicleWheelType = 2,
	EVehicleWheelType = 3,
	EVehicleWheelType = 4
};

// Enum BravoHotelGame.EWeaponAnimationType
enum class EWeaponAnimationType : uint8 {
	EWeaponAnimationType = 0,
	EWeaponAnimationType = 1,
	EWeaponAnimationType = 2,
	EWeaponAnimationType = 3,
	EWeaponAnimationType = 4,
	EWeaponAnimationType = 5,
	EWeaponAnimationType = 6,
	EWeaponAnimationType = 7,
	EWeaponAnimationType = 8,
	EWeaponAnimationType = 9,
	EWeaponAnimationType = 10
};

// Enum BravoHotelGame.EWeaponState
enum class EWeaponState : uint8 {
	EWeaponState = 0,
	EWeaponState = 1,
	EWeaponState = 2,
	EWeaponState = 3,
	EWeaponState = 4,
	EWeaponState = 5
};

// Enum BravoHotelGame.EWeaponAttachmentMagazineType
enum class EWeaponAttachmentMagazineType : uint8 {
	EWeaponAttachmentMagazineType = 0,
	EWeaponAttachmentMagazineType = 1,
	EWeaponAttachmentMagazineType = 2,
	EWeaponAttachmentMagazineType = 3,
	EWeaponAttachmentMagazineType = 4
};

// Enum BravoHotelGame.EWeaponRecoilType
enum class EWeaponRecoilType : uint8 {
	EWeaponRecoilType_2 = 0,
	EWeaponRecoilType_3 = 1,
	EWeaponRecoilType = 2
};

// Enum BravoHotelGame.ETeamType
enum class ETeamType : uint8 {
	ETeamType = 0,
	ETeamType = 1,
	ETeamType = 2,
	ETeamType = 3,
	ETeamType = 4
};

// Enum BravoHotelGame.EBattleRoyalTeamState
enum class EBattleRoyalTeamState : uint8 {
	EBattleRoyalTeamState = 0,
	EBattleRoyalTeamState = 1,
	EBattleRoyalTeamState = 2,
	EBattleRoyalTeamState = 3
};

// Enum BravoHotelGame.EBoxStateType
enum class EBoxStateType : uint8 {
	EBoxStateType = 0,
	EBoxStateType = 1,
	EBoxStateType = 2,
	EBoxStateType = 3,
	EBoxStateType = 4,
	EBoxStateType = 5
};

// Enum BravoHotelGame.EAssignReason
enum class EAssignReason : uint8 {
	EAssignReason = 0,
	EAssignReason = 1,
	EAssignReason = 2,
	EAssignReason = 3,
	EAssignReason = 4,
	EAssignReason = 5
};

// Enum BravoHotelGame.EPersonalSupplyBoxState
enum class EPersonalSupplyBoxState : uint8 {
	EPersonalSupplyBoxState = 0,
	EPersonalSupplyBoxState = 1,
	EPersonalSupplyBoxState = 2,
	EPersonalSupplyBoxState = 3,
	EPersonalSupplyBoxState = 4,
	EPersonalSupplyBoxState = 5,
	EPersonalSupplyBoxState = 6
};

// Enum BravoHotelGame.ECharacterClassFlag
enum class ECharacterClassFlag : uint8 {
	ECharacterClassFlag = 0,
	ECharacterClassFlag = 1,
	ECharacterClassFlag = 2,
	ECharacterClassFlag = 4,
	ECharacterClassFlag = 8,
	ECharacterClassFlag = 16,
	ECharacterClassFlag = 32,
	ECharacterClassFlag = 64,
	ECharacterClassFlag = 128,
	ECharacterClassFlag = 255,
	ECharacterClassFlag = 256
};

// Enum BravoHotelGame.ECharacterMovmentStateType
enum class ECharacterMovmentStateType : uint8 {
	ECharacterMovmentStateType = 0,
	ECharacterMovmentStateType = 1,
	ECharacterMovmentStateType = 2,
	ECharacterMovmentStateType = 3,
	ECharacterMovmentStateType = 4,
	ECharacterMovmentStateType = 5,
	ECharacterMovmentStateType = 6,
	ECharacterMovmentStateType = 7,
	ECharacterMovmentStateType = 8,
	ECharacterMovmentStateType = 9,
	ECharacterMovmentStateType = 10,
	ECharacterMovmentStateType = 11,
	ECharacterMovmentStateType = 12,
	ECharacterMovmentStateType = 13,
	ECharacterMovmentStateType = 14,
	ECharacterMovmentStateType = 15,
	ECharacterMovmentStateType = 16,
	ECharacterMovmentStateType = 17,
	ECharacterMovmentStateType = 18,
	ECharacterMovmentStateType = 19,
	ECharacterMovmentStateType = 20,
	ECharacterMovmentStateType = 21,
	ECharacterMovmentStateType = 22,
	ECharacterMovmentStateType = 23,
	ECharacterMovmentStateType = 24,
	ECharacterMovmentStateType = 25
};

// Enum BravoHotelGame.EBuffTargetType
enum class EBuffTargetType : uint8 {
	EBuffTargetType = 0,
	EBuffTargetType = 1,
	EBuffTargetType = 2,
	EBuffTargetType = 3
};

// Enum BravoHotelGame.EAbilityCombineType
enum class EAbilityCombineType : uint8 {
	EAbilityCombineType = 0,
	EAbilityCombineType = 1,
	EAbilityCombineType = 2,
	EAbilityCombineType = 3,
	EAbilityCombineType = 4,
	EAbilityCombineType = 5,
	EAbilityCombineType = 6
};

// Enum BravoHotelGame.ESoundCondition
enum class ESoundCondition : int32 {
	ESoundCondition = 1,
	ESoundCondition = 2,
	ESoundCondition = 4,
	ESoundCondition = 8,
	ESoundCondition = 16,
	ESoundCondition = 32,
	ESoundCondition = 64,
	ESoundCondition = 128,
	ESoundCondition = 256,
	ESoundCondition = 512,
	ESoundCondition = 1024,
	ESoundCondition = 2048,
	ESoundCondition = 4096,
	ESoundCondition = 8192,
	ESoundCondition = 16384,
	ESoundCondition = 32768,
	ESoundCondition = 65536,
	ESoundCondition = 131072,
	ESoundCondition = 262144,
	ESoundCondition = 524288,
	ESoundCondition = 1048576,
	ESoundCondition = 2097152,
	ESoundCondition = 2097153
};

// Enum BravoHotelGame.EAppAudioState
enum class EAppAudioState : uint8 {
	EAppAudioState = 0,
	EAppAudioState = 1,
	EAppAudioState = 2,
	EAppAudioState = 3,
	EAppAudioState = 4,
	EAppAudioState = 5,
	EAppAudioState = 6
};

// Enum BravoHotelGame.EIndoorConditionTargets
enum class EIndoorConditionTargets : uint8 {
	EIndoorConditionTargets = 1,
	EIndoorConditionTargets = 2,
	EIndoorConditionTargets = 3,
	EIndoorConditionTargets = 4
};

// Enum BravoHotelGame.EOcclusionMethod
enum class EOcclusionMethod : uint8 {
	EOcclusionMethod = 0,
	EOcclusionMethod = 1,
	EOcclusionMethod = 2,
	EOcclusionMethod = 3
};

// Enum BravoHotelGame.ECrosshairPosition
enum class ECrosshairPosition : uint8 {
	ECrosshairPosition = 0,
	ECrosshairPosition = 1,
	ECrosshairPosition = 2,
	ECrosshairPosition = 3,
	ECrosshairPosition = 4,
	ECrosshairPosition = 5,
	ECrosshairPosition = 6
};

// Enum BravoHotelGame.EContentsType
enum class EContentsType : uint8 {
	EContentsType = 0,
	EContentsType = 1,
	EContentsType = 2,
	EContentsType = 3,
	EContentsType = 4,
	EContentsType = 5,
	EContentsType = 6,
	EContentsType = 7,
	EContentsType = 8,
	EContentsType = 9,
	EContentsType = 10,
	EContentsType = 11,
	EContentsType = 12,
	EContentsType = 13,
	EContentsType = 14,
	EContentsType = 15,
	EContentsType = 16
};

// Enum BravoHotelGame.EReportIndex
enum class EReportIndex : uint8 {
	EReportIndex = 0,
	EReportIndex = 1,
	EReportIndex = 2,
	EReportIndex = 3,
	EReportIndex = 4,
	EReportIndex = 5
};

// Enum BravoHotelGame.ERecipeSearchType
enum class ERecipeSearchType : uint8 {
	ERecipeSearchType = 0,
	ERecipeSearchType = 1,
	ERecipeSearchType = 2,
	ERecipeSearchType = 3
};

// Enum BravoHotelGame.EItemLogType
enum class EItemLogType : uint8 {
	EItemLogType = 0,
	EItemLogType = 1,
	EItemLogType = 2,
	EItemLogType = 3,
	EItemLogType = 4,
	EItemLogType = 5,
	EItemLogType = 6,
	EItemLogType = 7
};

// Enum BravoHotelGame.EDataItemType
enum class EDataItemType : uint8 {
	EDataItemType = 0,
	EDataItemType = 1,
	EDataItemType = 2,
	EDataItemType = 3,
	EDataItemType = 4
};

// Enum BravoHotelGame.EClientGameContentsType
enum class EClientGameContentsType : uint8 {
	EClientGameContentsType = 0,
	EClientGameContentsType = 1,
	EClientGameContentsType = 2,
	EClientGameContentsType = 3,
	EClientGameContentsType = 4,
	EClientGameContentsType = 5,
	EClientGameContentsType = 6,
	EClientGameContentsType = 7,
	EClientGameContentsType = 8,
	EClientGameContentsType = 9,
	EClientGameContentsType = 10,
	EClientGameContentsType = 11,
	EClientGameContentsType = 12,
	EClientGameContentsType = 13,
	EClientGameContentsType = 14,
	EClientGameContentsType = 15,
	EClientGameContentsType = 16,
	EClientGameContentsType = 17,
	EClientGameContentsType = 18,
	EClientGameContentsType = 19,
	EClientGameContentsType = 20,
	EClientGameContentsType = 21,
	EClientGameContentsType = 22,
	EClientGameContentsType = 23,
	EClientGameContentsType = 24,
	EClientGameContentsType = 25,
	EClientGameContentsType = 26,
	EClientGameContentsType = 27,
	EClientGameContentsType = 28,
	EClientGameContentsType = 29,
	EClientGameContentsType = 30,
	EClientGameContentsType = 31,
	EClientGameContentsType = 32,
	EClientGameContentsType = 33,
	EClientGameContentsType = 34,
	EClientGameContentsType = 35,
	EClientGameContentsType = 36,
	EClientGameContentsType = 37,
	EClientGameContentsType = 38,
	EClientGameContentsType = 39,
	EClientGameContentsType = 40,
	EClientGameContentsType = 41,
	EClientGameContentsType = 42,
	EClientGameContentsType = 43,
	EClientGameContentsType = 44,
	EClientGameContentsType = 45
};

// Enum BravoHotelGame.EEventTypeClientGameStateData
enum class EEventTypeClientGameStateData : uint8 {
	EEventTypeClientGameStateData = 0,
	EEventTypeClientGameStateData = 1,
	EEventTypeClientGameStateData = 2,
	EEventTypeClientGameStateData = 3,
	EEventTypeClientGameStateData = 4
};

// Enum BravoHotelGame.EEventTypeClientGameWeaponData
enum class EEventTypeClientGameWeaponData : uint8 {
	EEventTypeClientGameWeaponData = 0,
	EEventTypeClientGameWeaponData = 1,
	EEventTypeClientGameWeaponData = 2,
	EEventTypeClientGameWeaponData = 3,
	EEventTypeClientGameWeaponData = 4
};

// Enum BravoHotelGame.EEventTypeClientGameInvento
enum class EEventTypeClientGameInvento : uint8 {
	EEventTypeClientGameInvento = 0,
	EEventTypeClientGameInventoata = 1,
	EEventTypeClientGameInvento = 2,
	EEventTypeClientGameInventoata = 3
};

// Enum BravoHotelGame.EEventTypeClientGameVehicleData
enum class EEventTypeClientGameVehicleData : uint8 {
	EEventTypeClientGameVehicleData = 0,
	EEventTypeClientGameVehicleData = 1,
	EEventTypeClientGameVehicleData = 2,
	EEventTypeClientGameVehicleData = 3,
	EEventTypeClientGameVehicleData = 4
};

// Enum BravoHotelGame.EEventTypeClientGameRevivalData
enum class EEventTypeClientGameRevivalData : uint8 {
	EEventTypeClientGameRevivalData = 0,
	EEventTypeClientGameRevivalData = 1,
	EEventTypeClientGameRevivalData = 2,
	EEventTypeClientGameRevivalData = 3
};

// Enum BravoHotelGame.EEventTypeClientGameDiedData
enum class EEventTypeClientGameDiedData : uint8 {
	EEventTypeClientGameDiedData = 0,
	EEventTypeClientGameDiedData = 1,
	EEventTypeClientGameDiedData = 2,
	EEventTypeClientGameDiedData = 3
};

// Enum BravoHotelGame.EEventTypeClientGameKnockDo
enum class EEventTypeClientGameKnockDo : uint8 {
	EEventTypeClientGameKnockDo = 0,
	EEventTypeClientGameKnockDoa = 1,
	EEventTypeClientGameKnockDo = 2,
	EEventTypeClientGameKnockDoa = 3
};

// Enum BravoHotelGame.EEventTypeClientGameBattleData
enum class EEventTypeClientGameBattleData : uint8 {
	EEventTypeClientGameBattleData = 0,
	EEventTypeClientGameBattleData = 1,
	EEventTypeClientGameBattleData = 2,
	EEventTypeClientGameBattleData = 3,
	EEventTypeClientGameBattleData = 4,
	EEventTypeClientGameBattleData = 5,
	EEventTypeClientGameBattleData = 6
};

// Enum BravoHotelGame.EEventTypeClientGameThrowableData
enum class EEventTypeClientGameThrowableData : uint8 {
	EEventTypeClientGameThrowableData = 0,
	EEventTypeClientGameThrowableData = 1,
	EEventTypeClientGameThrowableData = 2
};

// Enum BravoHotelGame.EEventTypeClientGameInteractionData
enum class EEventTypeClientGameInteractionData : uint8 {
	EEventTypeClientGameInteractionData = 0,
	EEventTypeClientGameInteractionData = 1,
	EEventTypeClientGameInteractionData = 2,
	EEventTypeClientGameInteractionData = 3,
	EEventTypeClientGameInteractionData = 4,
	EEventTypeClientGameInteractionData = 5
};

// Enum BravoHotelGame.EEventTypeClientGameItemSearchData
enum class EEventTypeClientGameItemSearchData : uint8 {
	EEventTypeClientGameItemSearchData = 0,
	EEventTypeClientGameItemSearchData = 1,
	EEventTypeClientGameItemSearchData = 2
};

// Enum BravoHotelGame.EEventTypeClientGameItemData
enum class EEventTypeClientGameItemData : uint8 {
	EEventTypeClientGameItemData = 0,
	EEventTypeClientGameItemData = 1,
	EEventTypeClientGameItemData = 2,
	EEventTypeClientGameItemData = 3,
	EEventTypeClientGameItemData = 4,
	EEventTypeClientGameItemData = 5,
	EEventTypeClientGameItemData = 6,
	EEventTypeClientGameItemData = 7,
	EEventTypeClientGameItemData = 8,
	EEventTypeClientGameItemData = 9,
	EEventTypeClientGameItemData = 10
};

// Enum BravoHotelGame.EEventTypeClientGameSkillData
enum class EEventTypeClientGameSkillData : uint8 {
	EEventTypeClientGameSkillData = 0,
	EEventTypeClientGameSkillData = 1,
	EEventTypeClientGameSkillData = 2,
	EEventTypeClientGameSkillData = 3
};

// Enum BravoHotelGame.EEventTypeClientGameSupplyBoxData
enum class EEventTypeClientGameSupplyBoxData : uint8 {
	EEventTypeClientGameSupplyBoxData = 0,
	EEventTypeClientGameSupplyBoxData = 1,
	EEventTypeClientGameSupplyBoxData = 2,
	EEventTypeClientGameSupplyBoxData = 3
};

// Enum BravoHotelGame.EEventTypeClientData
enum class EEventTypeClientData : int32 {
	EEventTypeClientData = 0,
	EEventTypeClientData = 10101,
	EEventTypeClientData = 10102,
	EEventTypeClientData = 10103,
	EEventTypeClientData = 10104,
	EEventTypeClientData = 10105
};

// Enum BravoHotelGame.EEventTypeWorldItemData
enum class EEventTypeWorldItemData : int32 {
	EEventTypeWorldItemData = 0,
	EEventTypeWorldItemData = 50101,
	EEventTypeWorldItemData = 50102,
	EEventTypeWorldItemData = 50103,
	EEventTypeWorldItemData = 50104
};

// Enum BravoHotelGame.EEventTypeUseItemData
enum class EEventTypeUseItemData : int32 {
	EEventTypeUseItemData = 0,
	EEventTypeUseItemData = 40301,
	EEventTypeUseItemData = 40302,
	EEventTypeUseItemData = 40303,
	EEventTypeUseItemData = 40304
};

// Enum BravoHotelGame.EEventTypeSupplyData
enum class EEventTypeSupplyData : uint8 {
	EEventTypeSupplyData = 0,
	EEventTypeSupplyData = 1,
	EEventTypeSupplyData = 2,
	EEventTypeSupplyData = 3
};

// Enum BravoHotelGame.EEventTypeTransportData
enum class EEventTypeTransportData : uint8 {
	EEventTypeTransportData = 0,
	EEventTypeTransportData = 1,
	EEventTypeTransportData = 2,
	EEventTypeTransportData = 3,
	EEventTypeTransportData = 4,
	EEventTypeTransportData = 5
};

// Enum BravoHotelGame.EEventTypeRedZoneData
enum class EEventTypeRedZoneData : uint8 {
	EEventTypeRedZoneData = 0,
	EEventTypeRedZoneData = 1,
	EEventTypeRedZoneData = 2,
	EEventTypeRedZoneData = 3
};

// Enum BravoHotelGame.EEventTypeBlueZoneData
enum class EEventTypeBlueZoneData : uint8 {
	EEventTypeBlueZoneData = 0,
	EEventTypeBlueZoneData = 1,
	EEventTypeBlueZoneData = 2,
	EEventTypeBlueZoneData = 3,
	EEventTypeBlueZoneData = 4,
	EEventTypeBlueZoneData = 5
};

// Enum BravoHotelGame.EEventTypeBattleRoyalData
enum class EEventTypeBattleRoyalData : uint8 {
	EEventTypeBattleRoyalData = 0,
	EEventTypeBattleRoyalData = 1,
	EEventTypeBattleRoyalData = 2,
	EEventTypeBattleRoyalData = 3,
	EEventTypeBattleRoyalData = 4,
	EEventTypeBattleRoyalData = 5,
	EEventTypeBattleRoyalData = 6,
	EEventTypeBattleRoyalData = 7
};

// Enum BravoHotelGame.EEventTypeWeaponData
enum class EEventTypeWeaponData : int32 {
	EEventTypeWeaponData = 0,
	EEventTypeWeaponData = 40201,
	EEventTypeWeaponData = 40202,
	EEventTypeWeaponData = 40203,
	EEventTypeWeaponData = 40204,
	EEventTypeWeaponData = 40205,
	EEventTypeWeaponData = 40206,
	EEventTypeWeaponData = 40207,
	EEventTypeWeaponData = 40208
};

// Enum BravoHotelGame.EEventTypeCharacterFlyingData
enum class EEventTypeCharacterFlyingData : uint8 {
	EEventTypeCharacterFlyingData = 0,
	EEventTypeCharacterFlyingData = 1,
	EEventTypeCharacterFlyingData = 2,
	EEventTypeCharacterFlyingData = 3,
	EEventTypeCharacterFlyingData = 4
};

// Enum BravoHotelGame.EEventTypeCharacterData
enum class EEventTypeCharacterData : int32 {
	EEventTypeCharacterData = 0,
	EEventTypeCharacterData = 40101,
	EEventTypeCharacterData = 40102,
	EEventTypeCharacterData = 40103,
	EEventTypeCharacterData = 40104,
	EEventTypeCharacterData = 40105,
	EEventTypeCharacterData = 40106,
	EEventTypeCharacterData = 40107,
	EEventTypeCharacterData = 40108,
	EEventTypeCharacterData = 40109,
	EEventTypeCharacterData = 40110,
	EEventTypeCharacterData = 40111,
	EEventTypeCharacterData = 40112,
	EEventTypeCharacterData = 40113,
	EEventTypeCharacterData = 40114,
	EEventTypeCharacterData = 40115,
	EEventTypeCharacterData = 40116,
	EEventTypeCharacterData = 40117,
	EEventTypeCharacterData = 40118,
	EEventTypeCharacterData = 40119,
	EEventTypeCharacterData = 40120,
	EEventTypeCharacterData = 40121,
	EEventTypeCharacterData = 40122,
	EEventTypeCharacterData = 40123,
	EEventTypeCharacterData = 40124,
	EEventTypeCharacterData = 40125,
	EEventTypeCharacterData = 40126,
	EEventTypeCharacterData = 40127,
	EEventTypeCharacterData = 40128,
	EEventTypeCharacterData = 40129,
	EEventTypeCharacterData = 40130,
	EEventTypeCharacterData = 40131,
	EEventTypeCharacterData = 40132,
	EEventTypeCharacterData = 40133,
	EEventTypeCharacterData = 40134,
	EEventTypeCharacterData = 40135,
	EEventTypeCharacterData = 40136,
	EEventTypeCharacterData = 40137,
	EEventTypeCharacterData = 40138,
	EEventTypeCharacterData = 40139,
	EEventTypeCharacterData = 40140,
	EEventTypeCharacterData = 40141,
	EEventTypeCharacterData = 40142,
	EEventTypeCharacterData = 40143,
	EEventTypeCharacterData = 40144,
	EEventTypeCharacterData = 40145,
	EEventTypeCharacterData = 40146
};

// Enum BravoHotelGame.EEventTypePlayerData
enum class EEventTypePlayerData : int32 {
	EEventTypePlayerData = 0,
	EEventTypePlayerData = 30101,
	EEventTypePlayerData = 30102,
	EEventTypePlayerData = 30103,
	EEventTypePlayerData = 30104
};

// Enum BravoHotelGame.EEventTypeGameData
enum class EEventTypeGameData : int32 {
	EEventTypeGameData = 0,
	EEventTypeGameData = 20101,
	EEventTypeGameData = 20102,
	EEventTypeGameData = 20103,
	EEventTypeGameData = 20104
};

// Enum BravoHotelGame.EBlackmarketGearSortType
enum class EBlackmarketGearSortType : uint8 {
	EBlackmarketGearSortType = 0,
	EBlackmarketGearSortType = 1,
	EBlackmarketGearSortType = 2,
	EBlackmarketGearSortType = 3,
	EBlackmarketGearSortType = 4,
	EBlackmarketGearSortType = 5
};

// Enum BravoHotelGame.EBlackmarketCustomSortType
enum class EBlackmarketCustomSortType : uint8 {
	EBlackmarketCustomSortType = 0,
	EBlackmarketCustomSortType = 1
};

// Enum BravoHotelGame.EBlackmarketConsumableSortType
enum class EBlackmarketConsumableSortType : uint8 {
	EBlackmarketConsumableSortType = 0,
	EBlackmarketConsumableSortType = 1,
	EBlackmarketConsumableSortType = 2,
	EBlackmarketConsumableSortType = 3,
	EBlackmarketConsumableSortType = 4,
	EBlackmarketConsumableSortType = 5
};

// Enum BravoHotelGame.EBlackmarketWearableSortType
enum class EBlackmarketWearableSortType : uint8 {
	EBlackmarketWearableSortType = 0,
	EBlackmarketWearableSortType = 1,
	EBlackmarketWearableSortType = 2,
	EBlackmarketWearableSortType = 3,
	EBlackmarketWearableSortType = 4,
	EBlackmarketWearableSortType = 5
};

// Enum BravoHotelGame.EBlackmarketAttachmentSortType
enum class EBlackmarketAttachmentSortType : uint8 {
	EBlackmarketAttachmentSortType = 0,
	EBlackmarketAttachmentSortType = 1,
	EBlackmarketAttachmentSortType = 2,
	EBlackmarketAttachmentSortType = 3,
	EBlackmarketAttachmentSortType = 4,
	EBlackmarketAttachmentSortType = 5,
	EBlackmarketAttachmentSortType = 6,
	EBlackmarketAttachmentSortType = 7,
	EBlackmarketAttachmentSortType = 8
};

// Enum BravoHotelGame.EBlackmarketAmmoSortType
enum class EBlackmarketAmmoSortType : uint8 {
	EBlackmarketAmmoSortType = 0,
	EBlackmarketAmmoSortType = 1,
	EBlackmarketAmmoSortType = 2,
	EBlackmarketAmmoSortType = 3,
	EBlackmarketAmmoSortType = 4
};

// Enum BravoHotelGame.EBlackmarketWeaponSortType
enum class EBlackmarketWeaponSortType : uint8 {
	EBlackmarketWeaponSortType = 0,
	EBlackmarketWeaponSortType = 1,
	EBlackmarketWeaponSortType = 2,
	EBlackmarketWeaponSortType = 3,
	EBlackmarketWeaponSortType = 4,
	EBlackmarketWeaponSortType = 5,
	EBlackmarketWeaponSortType = 6,
	EBlackmarketWeaponSortType = 7,
	EBlackmarketWeaponSortType = 8,
	EBlackmarketWeaponSortType = 9,
	EBlackmarketWeaponSortType = 10
};

// Enum BravoHotelGame.EBlackmarketTabType
enum class EBlackmarketTabType : uint8 {
	EBlackmarketTabType = 0,
	EBlackmarketTabType = 1,
	EBlackmarketTabType = 2,
	EBlackmarketTabType = 3,
	EBlackmarketTabType = 4,
	EBlackmarketTabType = 5,
	EBlackmarketTabType = 6,
	EBlackmarketTabType = 7,
	EBlackmarketTabType = 8,
	EBlackmarketTabType = 9,
	EBlackmarketTabType = 10
};

// Enum BravoHotelGame.EDoorSoundType
enum class EDoorSoundType : uint8 {
	EDoorSoundType = 0,
	EDoorSoundType = 1,
	EDoorSoundType = 2,
	EDoorSoundType = 3,
	EDoorSoundType = 4,
	EDoorSoundType = 5,
	EDoorSoundType = 6,
	EDoorSoundType = 7
};

// Enum BravoHotelGame.EElevatorStateType
enum class EElevatorStateType : uint8 {
	EElevatorStateType = 0,
	EElevatorStateType = 1,
	EElevatorStateType = 2
};

// Enum BravoHotelGame.EElevatorDoorStateType
enum class EElevatorDoorStateType : uint8 {
	EElevatorDoorStateType = 0,
	EElevatorDoorStateType = 1,
	EElevatorDoorStateType = 2,
	EElevatorDoorStateType = 3,
	EElevatorDoorStateType = 4,
	EElevatorDoorStateType = 5
};

// Enum BravoHotelGame.ENetworkLoginFlowFlags
enum class ENetworkLoginFlowFlags : uint8 {
	ENetworkLoginFlowFlags = 0,
	ENetworkLoginFlowFlags = 1,
	ENetworkLoginFlowFlags = 2,
	ENetworkLoginFlowFlags = 4,
	ENetworkLoginFlowFlags = 5,
	ENetworkLoginFlowFlags = 7,
	ENetworkLoginFlowFlags = 8
};

// Enum BravoHotelGame.EGameResultWidgetMode
enum class EGameResultWidgetMode : uint8 {
	EGameResultWidgetMode = 0,
	EGameResultWidgetMode = 1,
	EGameResultWidgetMode = 2,
	EGameResultWidgetMode = 3,
	EGameResultWidgetMode = 4,
	EGameResultWidgetMode = 5,
	EGameResultWidgetMode = 6
};

// Enum BravoHotelGame.EGoogleCloudType
enum class EGoogleCloudType : uint8 {
	EGoogleCloudType = 0,
	EGoogleCloudType = 1,
	EGoogleCloudType = 2,
	EGoogleCloudType = 3
};

// Enum BravoHotelGame.EItemEquipType
enum class EItemEquipType : uint8 {
	EItemEquipType = 0,
	EItemEquipType = 1,
	EItemEquipType = 2
};

// Enum BravoHotelGame.EItemLocation
enum class EItemLocation : uint8 {
	EItemLocation = 0,
	EItemLocation = 1,
	EItemLocation = 2,
	EItemLocation = 3
};

// Enum BravoHotelGame.EBattleMode
enum class EBattleMode : uint8 {
	EBattleMode = 1,
	EBattleMode = 2,
	EBattleMode = 4,
	EBattleMode = 5
};

// Enum BravoHotelGame.EWeb
enum class EWebd : uint8 {
	EWeb = 0,
	EWebd = 1,
	EWebd = 2,
	EWebd = 3,
	EWebd = 4
};

// Enum BravoHotelGame.ECompareItemType
enum class ECompareItemType : uint8 {
	ECompareItemType = 0,
	ECompareItemType = 1,
	ECompareItemType = 2,
	ECompareItemType = 3
};

// Enum BravoHotelGame.EItemEffectSubParticleSpawnState
enum class EItemEffectSubParticleSpawnState : uint8 {
	EItemEffectSubParticleSpawnState = 0,
	EItemEffectSubParticleSpawnState = 1,
	EItemEffectSubParticleSpawnState = 2
};

// Enum BravoHotelGame.EPatrolDirection
enum class EPatrolDirection : uint8 {
	EPatrolDirection = 0,
	EPatrolDirection = 1,
	EPatrolDirection = 2
};

// Enum BravoHotelGame.EEventLogType
enum class EEventLogType : uint8 {
	EEventLogType = 0,
	EEventLogType = 1,
	EEventLogType = 2,
	EEventLogType = 3,
	EEventLogType = 4,
	EEventLogType = 5,
	EEventLogType = 6,
	EEventLogType = 7,
	EEventLogType = 8,
	EEventLogType = 9,
	EEventLogType = 10,
	EEventLogType = 11,
	EEventLogType = 12,
	EEventLogType = 13,
	EEventLogType = 14,
	EEventLogType = 15,
	EEventLogType = 16,
	EEventLogType = 17,
	EEventLogType = 18,
	EEventLogType = 19,
	EEventLogType = 20,
	EEventLogType = 21,
	EEventLogType = 22,
	EEventLogType = 23,
	EEventLogType = 24,
	EEventLogType = 25,
	EEventLogType = 26,
	EEventLogType = 27,
	EEventLogType = 28,
	EEventLogType = 29,
	EEventLogType = 30,
	EEventLogType = 31,
	EEventLogType = 32,
	EEventLogType = 33,
	EEventLogType = 34
};

// Enum BravoHotelGame.EMoveElevatorStateType
enum class EMoveElevatorStateType : uint8 {
	EMoveElevatorStateType = 0,
	EMoveElevatorStateType = 1,
	EMoveElevatorStateType = 2,
	EMoveElevatorStateType = 3,
	EMoveElevatorStateType = 4
};

// Enum BravoHotelGame.ECloudPlatformType
enum class ECloudPlatformType : uint8 {
	ECloudPlatformType = 0,
	ECloudPlatformType = 1,
	ECloudPlatformType = 2
};

// Enum BravoHotelGame.EClientOutGameContentsType
enum class EClientOutGameContentsType : uint8 {
	EClientOutGameContentsType = 0,
	EClientOutGameContentsType = 1,
	EClientOutGameContentsType = 2,
	EClientOutGameContentsType = 3,
	EClientOutGameContentsType = 4,
	EClientOutGameContentsType = 5,
	EClientOutGameContentsType = 6,
	EClientOutGameContentsType = 7,
	EClientOutGameContentsType = 8,
	EClientOutGameContentsType = 9,
	EClientOutGameContentsType = 10,
	EClientOutGameContentsType = 11,
	EClientOutGameContentsType = 12,
	EClientOutGameContentsType = 13,
	EClientOutGameContentsType = 14,
	EClientOutGameContentsType = 15,
	EClientOutGameContentsType = 16,
	EClientOutGameContentsType = 17,
	EClientOutGameContentsType = 18
};

// Enum BravoHotelGame.EEventTypeClientOutGameFirstClientRunData
enum class EEventTypeClientOutGameFirstClientRunData : uint8 {
	EEventTypeClientOutGameFirstClientRunData = 0,
	EEventTypeClientOutGameFirstClientRunData = 1,
	EEventTypeClientOutGameFirstClientRunData = 2,
	EEventTypeClientOutGameFirstClientRunData = 3,
	EEventTypeClientOutGameFirstClientRunData = 4,
	EEventTypeClientOutGameFirstClientRunData = 5,
	EEventTypeClientOutGameFirstClientRunData = 6,
	EEventTypeClientOutGameFirstClientRunData = 7,
	EEventTypeClientOutGameFirstClientRunData = 8,
	EEventTypeClientOutGameFirstClientRunData = 9,
	EEventTypeClientOutGameFirstClientRunData = 10,
	EEventTypeClientOutGameFirstClientRunData = 11,
	EEventTypeClientOutGameFirstClientRunData = 12,
	EEventTypeClientOutGameFirstClientRunData = 13,
	EEventTypeClientOutGameFirstClientRunData = 14,
	EEventTypeClientOutGameFirstClientRunData = 15,
	EEventTypeClientOutGameFirstClientRunData = 16,
	EEventTypeClientOutGameFirstClientRunData = 17,
	EEventTypeClientOutGameFirstClientRunData = 18
};

// Enum BravoHotelGame.EEventTypeClientOutGameTuto
enum class EEventTypeClientOutGameTuto : uint8 {
	EEventTypeClientOutGameTuto = 0,
	EEventTypeClientOutGameTutotClientRunData = 1,
	EEventTypeClientOutGameTuto = 2,
	EEventTypeClientOutGameTutotClientRunData = 3,
	EEventTypeClientOutGameTuto = 4,
	EEventTypeClientOutGameTutotClientRunDat = 5
};

// Enum BravoHotelGame.EEventTypeClientOutGameExitData
enum class EEventTypeClientOutGameExitData : uint8 {
	EEventTypeClientOutGameExitData = 0,
	EEventTypeClientOutGameExitData = 1,
	EEventTypeClientOutGameExitData = 2
};

// Enum BravoHotelGame.EEventTypeClientOutGameActionData
enum class EEventTypeClientOutGameActionData : uint8 {
	EEventTypeClientOutGameActionData = 0,
	EEventTypeClientOutGameActionData = 1,
	EEventTypeClientOutGameActionData = 2
};

// Enum BravoHotelGame.EEventTypeClientOutGameLoginData
enum class EEventTypeClientOutGameLoginData : uint8 {
	EEventTypeClientOutGameLoginData = 0,
	EEventTypeClientOutGameLoginData = 1,
	EEventTypeClientOutGameLoginData = 2,
	EEventTypeClientOutGameLoginData = 3
};

// Enum BravoHotelGame.EEventTypeClientOutGameMatchingData
enum class EEventTypeClientOutGameMatchingData : uint8 {
	EEventTypeClientOutGameMatchingData = 0,
	EEventTypeClientOutGameMatchingData = 1,
	EEventTypeClientOutGameMatchingData = 2,
	EEventTypeClientOutGameMatchingData = 3
};

// Enum BravoHotelGame.EItemSortType
enum class EItemSortType : uint8 {
	EItemSortType = 0,
	EItemSortType = 1,
	EItemSortType = 2,
	EItemSortType = 3,
	EItemSortType = 4,
	EItemSortType = 5,
	EItemSortType = 6
};

// Enum BravoHotelGame.EPickUpItemEffectType
enum class EPickUpItemEffectType : uint8 {
	EPickUpItemEffectType = 0,
	EPickUpItemEffectType = 1,
	EPickUpItemEffectType = 2,
	EPickUpItemEffectType = 3
};

// Enum BravoHotelGame.EPopupWidgetButtonFlags
enum class EPopupWidgetButtonFlags : uint8 {
	EPopupWidgetButtonFlags = 0,
	EPopupWidgetButtonFlags = 1,
	EPopupWidgetButtonFlags = 2,
	EPopupWidgetButtonFlags = 4,
	EPopupWidgetButtonFlags = 5
};

// Enum BravoHotelGame.EAchievementState
enum class EAchievementState : uint8 {
	EAchievementState = 0,
	EAchievementState = 1,
	EAchievementState = 2,
	EAchievementState = 3
};

// Enum BravoHotelGame.EAchievementType
enum class EAchievementType : uint8 {
	EAchievementType = 0,
	EAchievementType = 1,
	EAchievementType = 2,
	EAchievementType = 3,
	EAchievementType = 4
};

// Enum BravoHotelGame.ERemoteControlState
enum class ERemoteControlState : uint8 {
	ERemoteControlState = 0,
	ERemoteControlState = 1,
	ERemoteControlState = 2,
	ERemoteControlState = 3
};

// Enum BravoHotelGame.EDropBoxState
enum class EDropBoxState : uint8 {
	EDropBoxState = 0,
	EDropBoxState = 1,
	EDropBoxState = 2,
	EDropBoxState = 3,
	EDropBoxState = 4,
	EDropBoxState = 5
};

// Enum BravoHotelGame.EGameLoadingStep
enum class EGameLoadingStep : uint8 {
	EGameLoadingStep = 0,
	EGameLoadingStep = 1,
	EGameLoadingStep = 2,
	EGameLoadingStep = 3
};

// Enum BravoHotelGame.ELanguageType
enum class ELanguageType : uint8 {
	ELanguageType = 0,
	ELanguageType = 1,
	ELanguageType = 2,
	ELanguageType = 3,
	ELanguageType = 4,
	ELanguageType = 5,
	ELanguageType = 6,
	ELanguageType = 7,
	ELanguageType = 8,
	ELanguageType = 9
};

// Enum BravoHotelGame.EMailMsgTag
enum class EMailMsgTag : uint8 {
	EMailMsgTag = 0,
	EMailMsgTag = 1,
	EMailMsgTag = 2,
	EMailMsgTag = 3
};

// Enum BravoHotelGame.EMailMsgSaveOption
enum class EMailMsgSaveOption : uint8 {
	EMailMsgSaveOption = 0,
	EMailMsgSaveOption = 1,
	EMailMsgSaveOption = 2,
	EMailMsgSaveOption = 3
};

// Enum BravoHotelGame.EMailMsgType
enum class EMailMsgType : uint8 {
	EMailMsgType = 0,
	EMailMsgType = 1,
	EMailMsgType = 2
};

// Enum BravoHotelGame.ECommunicatorType
enum class ECommunicatorType : uint8 {
	ECommunicatorType = 0,
	ECommunicatorType = 1,
	ECommunicatorType = 2,
	ECommunicatorType = 3,
	ECommunicatorType = 4
};

// Enum BravoHotelGame.EBlockType
enum class EBlockType : uint8 {
	EBlockType = 0,
	EBlockType = 1,
	EBlockType = 2,
	EBlockType = 3
};

// Enum BravoHotelGame.EBroadCastKillerType
enum class EBroadCastKillerType : uint8 {
	EBroadCastKillerType = 0,
	EBroadCastKillerType = 1,
	EBroadCastKillerType = 2,
	EBroadCastKillerType = 3,
	EBroadCastKillerType = 4
};

// Enum BravoHotelGame.EAutoMoveSnapshotActionType
enum class EAutoMoveSnapshotActionType : uint8 {
	EAutoMoveSnapshotActionType = 0,
	EAutoMoveSnapshotActionType = 1,
	EAutoMoveSnapshotActionType = 2,
	EAutoMoveSnapshotActionType = 3,
	EAutoMoveSnapshotActionType = 4,
	EAutoMoveSnapshotActionType = 5,
	EAutoMoveSnapshotActionType = 6,
	EAutoMoveSnapshotActionType = 7,
	EAutoMoveSnapshotActionType = 8
};

// Enum BravoHotelGame.EMatchRateCaseType
enum class EMatchRateCaseType : uint8 {
	EMatchRateCaseType = 0,
	EMatchRateCaseType = 1,
	EMatchRateCaseType = 2,
	EMatchRateCaseType = 3,
	EMatchRateCaseType = 4,
	EMatchRateCaseType = 5,
	EMatchRateCaseType = 6,
	EMatchRateCaseType = 7
};

// Enum BravoHotelGame.EDeafenDistanceLevel
enum class EDeafenDistanceLevel : uint8 {
	EDeafenDistanceLevel = 0,
	EDeafenDistanceLevel = 1,
	EDeafenDistanceLevel = 2,
	EDeafenDistanceLevel = 3
};

// Enum BravoHotelGame.EMouseCursorType
enum class EMouseCursorType : uint8 {
	EMouseCursorType = 0,
	EMouseCursorType = 1,
	EMouseCursorType = 2
};

// Enum BravoHotelGame.EStatusType
enum class EStatusType : uint8 {
	EStatusType = 0,
	EStatusType = 1,
	EStatusType = 2,
	EStatusType = 3
};

// Enum BravoHotelGame.EPlayerListSortType
enum class EPlayerListSortType : uint8 {
	EPlayerListSortType = 0,
	EPlayerListSortType = 1,
	EPlayerListSortType = 2,
	EPlayerListSortType = 3,
	EPlayerListSortType = 4
};

// Enum BravoHotelGame.CheatSubType
enum class CheatSubType : uint8 {
	CheatSubType = 0,
	CheatSubType = 1,
	CheatSubType = 2,
	CheatSubType = 3,
	CheatSubType = 4,
	CheatSubType = 5,
	CheatSubType = 6,
	CheatSubType = 7,
	CheatSubType = 8,
	CheatSubType = 9,
	CheatSubType = 10
};

// Enum BravoHotelGame.CheatMainType
enum class CheatMainType : uint8 {
	CheatMainType = 0,
	CheatMainType = 1,
	CheatMainType = 2,
	CheatMainType = 3,
	CheatMainType = 4
};

// Enum BravoHotelGame.EVehicleTransmissionType
enum class EVehicleTransmissionType : uint8 {
	EVehicleTransmissionType = 0,
	EVehicleTransmissionType = 1,
	EVehicleTransmissionType = 2,
	EVehicleTransmissionType = 3
};

// Enum BravoHotelGame.EDoorState
enum class EDoorState : uint8 {
	EDoorState = 0,
	EDoorState = 1,
	EDoorState = 2,
	EDoorState = 3,
	EDoorState = 4,
	EDoorState = 5,
	EDoorState = 6
};

// Enum BravoHotelGame.EPingActorType
enum class EPingActorType : uint8 {
	EPingActorType = 0,
	EPingActorType = 1,
	EPingActorType = 2,
	EPingActorType = 3,
	EPingActorType = 4
};

// Enum BravoHotelGame.EPingIconAnimationStateType
enum class EPingIconAnimationStateType : uint8 {
	EPingIconAnimationStateType = 0,
	EPingIconAnimationStateType = 1,
	EPingIconAnimationStateType = 2,
	EPingIconAnimationStateType = 3
};

// Enum BravoHotelGame.EPingIconLoopAnimationType
enum class EPingIconLoopAnimationType : uint8 {
	EPingIconLoopAnimationType = 0,
	EPingIconLoopAnimationType = 1,
	EPingIconLoopAnimationType = 2,
	EPingIconLoopAnimationType = 3,
	EPingIconLoopAnimationType = 4,
	EPingIconLoopAnimationType = 5
};

// Enum BravoHotelGame.EPingIconTransitionAnimatio
enum class EPingIconTransitionAnimatio : uint8 {
	EPingIconTransitionAnimatio = 0,
	EPingIconTransitionAnimatio = 1,
	EPingIconTransitionAnimatio = 2,
	EPingIconTransitionAnimatio = 3,
	EPingIconTransitionAnimatio = 4
};

// Enum BravoHotelGame.ETimeOfDayType
enum class ETimeOfDayType : uint8 {
	ETimeOfDayType = 0,
	ETimeOfDayType = 1,
	ETimeOfDayType = 2,
	ETimeOfDayType = 3
};

// Enum BravoHotelGame.EWaterViewCameraType
enum class EWaterViewCameraType : uint8 {
	EWaterViewCameraType = 0,
	EWaterViewCameraType = 1,
	EWaterViewCameraType = 2,
	EWaterViewCameraType = 3
};

// Enum BravoHotelGame.ECharacterVoicePriorityType
enum class ECharacterVoicePriorityType : uint8 {
	ECharacterVoicePriorityType = 0,
	ECharacterVoicePriorityType = 1,
	ECharacterVoicePriorityType = 2
};

// Enum BravoHotelGame.ECharacterVoiceRPCType
enum class ECharacterVoiceRPCType : uint8 {
	ECharacterVoiceRPCType = 0,
	ECharacterVoiceRPCType = 1,
	ECharacterVoiceRPCType = 2,
	ECharacterVoiceRPCType = 3
};

// Enum BravoHotelGame.ESteamAvatarSize
enum class ESteamAvatarSize : uint8 {
	ESteamAvatarSize = 0,
	ESteamAvatarSize = 1,
	ESteamAvatarSize = 2,
	ESteamAvatarSize = 3,
	ESteamAvatarSize = 4
};

// Enum BravoHotelGame.EUpLoadDataType
enum class EUpLoadDataType : uint8 {
	EUpLoadDataType = 0,
	EUpLoadDataType = 1,
	EUpLoadDataType = 2,
	EUpLoadDataType = 3
};

// Enum BravoHotelGame.EMovementDirection
enum class EMovementDirection : uint8 {
	EMovementDirection = 0,
	EMovementDirection = 1,
	EMovementDirection = 2
};

// Enum BravoHotelGame.ECardinalDirection
enum class ECardinalDirection : uint8 {
	ECardinalDirection = 0,
	ECardinalDirection = 1,
	ECardinalDirection = 2,
	ECardinalDirection = 3,
	ECardinalDirection = 4
};

// Enum BravoHotelGame.EVehicleExitSide
enum class EVehicleExitSide : uint8 {
	EVehicleExitSide = 0,
	EVehicleExitSide = 1,
	EVehicleExitSide = 2,
	EVehicleExitSide = 3
};

// Enum BravoHotelGame.EVehicleEffect
enum class EVehicleEffect : uint8 {
	EVehicleEffect = 0,
	EVehicleEffect = 1,
	EVehicleEffect = 2,
	EVehicleEffect = 3,
	EVehicleEffect = 4
};

// Enum BravoHotelGame.ERedZoneSelectType
enum class ERedZoneSelectType : uint8 {
	ERedZoneSelectType = 0,
	ERedZoneSelectType = 1,
	ERedZoneSelectType = 2,
	ERedZoneSelectType = 3,
	ERedZoneSelectType = 4
};

// Enum BravoHotelGame.EPerkSpawnType
enum class EPerkSpawnType : uint8 {
	EPerkSpawnType = 0,
	EPerkSpawnType = 1,
	EPerkSpawnType = 2
};

// Enum BravoHotelGame.ESurviveType
enum class ESurviveType : uint8 {
	ESurviveType = 0,
	ESurviveType = 1,
	ESurviveType = 2,
	ESurviveType = 3,
	ESurviveType = 4,
	ESurviveType = 5
};

// Enum BravoHotelGame.ESimpleWeaponAnimationType
enum class ESimpleWeaponAnimationType : uint8 {
	ESimpleWeaponAnimationType = 0,
	ESimpleWeaponAnimationType = 1,
	ESimpleWeaponAnimationType = 2
};

// Enum BravoHotelGame.ELadderState
enum class ELadderState : uint8 {
	ELadderState = 0,
	ELadderState = 1,
	ELadderState = 2,
	ELadderState = 3,
	ELadderState = 4,
	ELadderState = 5,
	ELadderState = 6,
	ELadderState = 7
};

// Enum BravoHotelGame.ELadderInteractionType
enum class ELadderInteractionType : uint8 {
	ELadderInteractionType = 0,
	ELadderInteractionType = 1,
	ELadderInteractionType = 2,
	ELadderInteractionType = 3,
	ELadderInteractionType = 4,
	ELadderInteractionType = 5
};

// Enum BravoHotelGame.EWeaponAttachmentSight
enum class EWeaponAttachmentSight : uint8 {
	EWeaponAttachmentSight = 0,
	EWeaponAttachmentSight = 1,
	EWeaponAttachmentSight = 2,
	EWeaponAttachmentSight = 3,
	EWeaponAttachmentSight = 4,
	EWeaponAttachmentSight = 5,
	EWeaponAttachmentSight = 6,
	EWeaponAttachmentSight = 7,
	EWeaponAttachmentSight = 8
};

// Enum BravoHotelGame.EProjectileType
enum class EProjectileType : uint8 {
	EProjectileType = 0,
	EProjectileType = 1,
	EProjectileType = 2,
	EProjectileType = 3,
	EProjectileType = 4,
	EProjectileType = 5,
	EProjectileType = 6,
	EProjectileType = 7
};

// Enum BravoHotelGame.ETerrainType
enum class ETerrainType : int32 {
	ETerrainType = 0,
	ETerrainType = 2,
	ETerrainType = 4,
	ETerrainType = 8,
	ETerrainType = 16,
	ETerrainType = 32,
	ETerrainType = 64,
	ETerrainType = 128,
	ETerrainType = 256,
	ETerrainType = 512,
	ETerrainType = 513
};

// Enum BravoHotelGame.EHumanWeaponHitArea
enum class EHumanWeaponHitArea : uint8 {
	EHumanWeaponHitArea = 0,
	EHumanWeaponHitArea = 1,
	EHumanWeaponHitArea = 2,
	EHumanWeaponHitArea = 3,
	EHumanWeaponHitArea = 4,
	EHumanWeaponHitArea = 5,
	EHumanWeaponHitArea = 6,
	EHumanWeaponHitArea = 7,
	EHumanWeaponHitArea = 8,
	EHumanWeaponHitArea = 9,
	EHumanWeaponHitArea = 10,
	EHumanWeaponHitArea = 11,
	EHumanWeaponHitArea = 12,
	EHumanWeaponHitArea = 13,
	EHumanWeaponHitArea = 14
};

// Enum BravoHotelGame.EWeaponHitArea
enum class EWeaponHitArea : uint8 {
	EWeaponHitArea = 0,
	EWeaponHitArea = 1,
	EWeaponHitArea = 2,
	EWeaponHitArea = 3,
	EWeaponHitArea = 4
};

// Enum BravoHotelGame.EVehicleSoundFlag
enum class EVehicleSoundFlag : uint8 {
	EVehicleSoundFlag = 0,
	EVehicleSoundFlag = 1,
	EVehicleSoundFlag = 2,
	EVehicleSoundFlag = 4,
	EVehicleSoundFlag = 5
};

// Enum BravoHotelGame.EVehicleNetProperty
enum class EVehicleNetProperty : uint8 {
	EVehicleNetProperty = 0,
	EVehicleNetProperty = 1,
	EVehicleNetProperty = 2,
	EVehicleNetProperty = 4,
	EVehicleNetProperty = 8,
	EVehicleNetProperty = 16,
	EVehicleNetProperty = 17
};

// Enum BravoHotelGame.VoiceChannelType
enum class VoiceChannelType : uint8 {
	VoiceChannelType = 0,
	VoiceChannelType = 1,
	VoiceChannelType = 2,
	VoiceChannelType = 3
};

// Enum BravoHotelGame.PTTKey
enum class PTTKey : uint8 {
	PTTKey = 0,
	PTTKey = 1,
	PTTKey = 2,
	PTTKey = 3,
	PTTKey = 4
};

// Enum BravoHotelGame.EWeightMapBitCheck
enum class EWeightMapBitCheck : uint8 {
	EWeightMapBitCheck = 0,
	EWeightMapBitCheck = 1,
	EWeightMapBitCheck = 2,
	EWeightMapBitCheck = 4,
	EWeightMapBitCheck = 5
};

// Enum BravoHotelGame.EWeightMapLandType
enum class EWeightMapLandType : uint8 {
	EWeightMapLandType = 0,
	EWeightMapLandType = 1,
	EWeightMapLandType = 2,
	EWeightMapLandType = 3
};

// Enum BravoHotelGame.EWeightMapDescentType
enum class EWeightMapDescentType : uint8 {
	EWeightMapDescentType = 0,
	EWeightMapDescentType = 1,
	EWeightMapDescentType = 2,
	EWeightMapDescentType = 3
};

// Enum BravoHotelGame.EParkourDebugType
enum class EParkourDebugType : uint8 {
	EParkourDebugType = 0,
	EParkourDebugType = 1,
	EParkourDebugType = 2,
	EParkourDebugType = 4,
	EParkourDebugType = 8,
	EParkourDebugType = 16,
	EParkourDebugType = 32,
	EParkourDebugType = 64,
	EParkourDebugType = 128,
	EParkourDebugType = 255,
	EParkourDebugType = 256
};

// Class BravoHotelGame.AmbientSoundVolume
struct AAmbientSoundVolume : AVolume {
	struct FString Ambience; //  0x348 Size(10)
	int32_t Priority; //  0x358 Size(4)

	void OnOverlapEnd(Unknown OverlappedComponent, Unknown OtherActor, Unknown OtherComp, int32_t OtherBodyIndex); // Function BravoHotelGame.AmbientSoundVolume.OnOverlapEnd(Final|Native|Protected) // <Game+0x1e46cf0>
};

// Class BravoHotelGame.AnimNotifyState_PlaySound
struct UAnimNotifyState_PlaySound : UAnimNotifyState {
	Unknown Sound; //  0x30 Size(8)
	float VolumeMultiplier; //  0x38 Size(4)
	float PitchMultiplier; //  0x3c Size(4)
	char bFollow; //  0x40 Size(1)
	struct FName AttachName; //  0x44 Size(8)
};

// Class BravoHotelGame.BravoHotelGameMode
struct ABravoHotelGameMode : ABravoHotelGameModeBase {
	char bFriendlyFire; //  0x3fc Size(1)
	Unknown PoolingActorComponent; //  0x400 Size(8)
	Unknown MapDataTableHandle; //  0x408 Size(10)
	Unknown PCReceivedPlayerInfos; //  0x418 Size(50)
	Unknown TestAIControllerClass; //  0x468 Size(8)
	char UsingOuterBlueZone; //  0x4e1 Size(1)
	struct FName SelectedPlayZoneName; //  0x4e4 Size(8)
	Unknown BlueZoneClass; //  0x4f0 Size(8)
	struct FString CQRType; //  0x4f8 Size(10)
	Unknown BlueZone; //  0x570 Size(8)

	void SetTestAIChangeLocation(Unknown AIController); // Function BravoHotelGame.BravoHotelGameMode.SetTestAIChangeLocation(Final|Native|Public) // <Game+0x1f1f6f0>
};

// Class BravoHotelGame.BattleRoyaleGameMode
struct ABattleRoyaleGameMode : ABravoHotelGameMode {
	Unknown RemovePendingPlayerArray; //  0x578 Size(10)
	Unknown GameViewType; //  0x588 Size(1)
	Unknown MatchingType; //  0x589 Size(1)
	int32_t TeamSize; //  0x58c Size(4)
	struct FString Training; //  0x590 Size(10)
	int32_t AIGrade; //  0x5a0 Size(4)
	struct FMulticastInlineDelegate UpdateSurvivalCircleDelegate; //  0x5a8 Size(10)
	Unknown TeamInfoMap; //  0x5f0 Size(50)
	Unknown WinnerTeamIndex; //  0x640 Size(1)
	Unknown SendPlayerEndedEvent; //  0x648 Size(10)
	Unknown SendPlayerRankedEvent; //  0x658 Size(10)
	Unknown AircraftViewPawnClass; //  0x680 Size(8)
	Unknown AircraftFlightPawnClass; //  0x688 Size(8)
	char bAutoStart; //  0x690 Size(1)
	float StartingPlayerCountRate; //  0x694 Size(4)
	int32_t WaitingTime; //  0x698 Size(4)
	int32_t ReadyTime; //  0x69c Size(4)
	int32_t DescentDelay; //  0x6a0 Size(4)
	int32_t DescentableTime; //  0x6a4 Size(4)
	Unknown AircraftFlight; //  0x6a8 Size(8)
	char bIsUseAircraft; //  0x6b0 Size(1)
	char bUseAircraftViewPawn; //  0x6c5 Size(1)
	char bEndlessGame; //  0x6c6 Size(1)
	Unknown DamageInfoArray; //  0x6e0 Size(10)
	Unknown RedZoneManagerClass; //  0x6f8 Size(8)
	Unknown RedZoneManager; //  0x700 Size(8)
	Unknown PersonalSupplyBoxManagerClass; //  0x788 Size(8)
	Unknown PersonalSupplyBoxManager; //  0x790 Size(8)
	Unknown DivisionItemCountResult; //  0x798 Size(10)
	char DisivisonComplete; //  0x7a8 Size(1)
	Unknown StandardGroupKeyCountInfo; //  0x990 Size(58)
	Unknown AreaSpawnRateList; //  0x9e8 Size(50)
	Unknown BlueZoneSpawnRateInfo; //  0xa38 Size(88)
	struct FName BlueZoneSpawnRateKey; //  0xac0 Size(8)
	Unknown NoneData; //  0xac8 Size(88)
	Unknown VehicleAreaSpawnRateList; //  0xb50 Size(50)
	Unknown VehicleBlueZoneSpawnRateInfo; //  0xba0 Size(78)
	struct FName VehicleBlueZoneSpawnRateKey; //  0xc18 Size(8)
	Unknown NoneVehicleData; //  0xc20 Size(78)
	Unknown CustomBlueZoneSpawnRateInfo; //  0xc98 Size(28)
	Unknown CustomAreaSpawnRateList; //  0xcc0 Size(50)
	Unknown CustomVehicleBlueZoneSpawnRateInfo; //  0xd10 Size(28)
	Unknown CustomVehicleAreaSpawnRateList; //  0xd38 Size(50)
	float ItemDivisionDelay; //  0xd90 Size(4)
	char UsingWorldItemSpawnTalbeInBlueZone; //  0xd94 Size(1)
	char ItemSpawnInBlueZone; //  0xd95 Size(1)
	char UnlimitItemSpawnCnt; //  0xd96 Size(1)
	int32_t MaxItemDivisionCountAtOnce; //  0xd98 Size(4)
	char ItemDivisionLevelLoadComplet; //  0xd9c Size(1)
	char ItemDivisionGameReady; //  0xd9d Size(1)
	char UsingMaxPickUpItemSpawnCount; //  0xd9e Size(1)
	int32_t MaxPickUpItemSpawnCount; //  0xda0 Size(4)
	char UsingMaxVehicleSpawnCount; //  0xda4 Size(1)
	int32_t MaxVehicleSpawnCount; //  0xda8 Size(4)
	int32_t MaxPickUpVehicleSpawnCount; //  0xdac Size(4)
	char UsingDynamicMaxPickUpItemSpawnCount; //  0xdb0 Size(1)
	Unknown ItemSpawnLimitInfo; //  0xdb4 Size(14)
	char GCRecordData; //  0xdc8 Size(1)
	struct FString GCRecordDataTitle; //  0xdd0 Size(10)
	char RecordBuildingData; //  0xde0 Size(1)
	char RecordPersonalSupplyBoxData; //  0xde1 Size(1)
	Unknown ItemSpawnRateCurve; //  0xde8 Size(8)
	Unknown VehicleSpawnRateCurve; //  0xdf0 Size(8)
	int32_t CurrentSpawnVehicleCount; //  0xdf8 Size(4)
	int32_t CurrentDivisionItemCount; //  0xdfc Size(4)
	Unknown CheckCharacters; //  0xe18 Size(10)
	Unknown LoadCompleteList; //  0xe38 Size(10)
	Unknown AutoBotIds; //  0xe50 Size(10)
	Unknown AutoBotInfoSendIDList; //  0xe60 Size(10)

	void UpdateSurvivalCircleDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode.UpdateSurvivalCircleDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <Game+0x23a73f0>
};

// Class BravoHotelGame.BattleRoyaleGameMode_Login
struct ABattleRoyaleGameMode_Login : ABravoHotelGameModeBase {
	float MatchingTimeout; //  0x3f8 Size(4)
	Unknown PlayerPawnList; //  0x400 Size(10)
	Unknown CustomizeCharacter; //  0x410 Size(8)
	Unknown RankingCharacter; //  0x418 Size(8)
	Unknown AppearingMotionCharacter; //  0x420 Size(8)
	Unknown Loading_TimerHandle; //  0x538 Size(8)
	Unknown PartyInfo_TimerHandle; //  0x540 Size(8)
	Unknown Ping_TimerHandle; //  0x548 Size(8)
	Unknown GeeGeeLoginToken_TimerHandle; //  0x550 Size(8)
	Unknown SteamLoginToken_TimerHandle; //  0x558 Size(8)
	Unknown AveragePingRequest_TimerHandle; //  0x560 Size(8)
	Unknown DuplicatedReconnectTimeout_TimerHandle; //  0x568 Size(8)
	struct FMulticastInlineDelegate OnLoginSucceeded; //  0x578 Size(10)
	struct FMulticastInlineDelegate OnLoginNotify; //  0x588 Size(10)
	struct FMulticastInlineDelegate OnLoginFailed; //  0x598 Size(10)
	struct FMulticastInlineDelegate OnMatchingPending; //  0x5a8 Size(10)
	struct FMulticastInlineDelegate OnMatchingStarted; //  0x5b8 Size(10)
	struct FMulticastInlineDelegate OnMatchingSucceeded; //  0x5c8 Size(10)
	struct FMulticastInlineDelegate OnMatchingFailed; //  0x5d8 Size(10)
	struct FMulticastInlineDelegate OnPartyInvited; //  0x5e8 Size(10)
	struct FMulticastInlineDelegate OnPartyInfoChanged; //  0x5f8 Size(10)
	struct FMulticastInlineDelegate OnPartyMemberInfoChanged; //  0x608 Size(10)
	struct FMulticastInlineDelegate OnMatchingSettingsChanged; //  0x618 Size(10)
	struct FMulticastInlineDelegate OnCreateCharacter; //  0x628 Size(10)

	void UpdatePCInfo(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.UpdatePCInfo(Final|Native|Public|BlueprintCallable) // <Game+0x1e497c0>
};

// Class BravoHotelGame.BravoHotelGameState
struct ABravoHotelGameState : AGameState {
	Unknown MatchWinnerTeam; //  0x380 Size(1)
	Unknown WinnerPlayerState; //  0x388 Size(8)
	int32_t TimeRemaining; //  0x390 Size(4)
	struct FName CurrentSeasonID; //  0x394 Size(8)
	int32_t PerkMode; //  0x39c Size(4)
	int32_t RecipeMode; //  0x3a0 Size(4)
	int32_t MaxPerkCount; //  0x3a4 Size(4)
	int32_t OverrideUltimateLev; //  0x3a8 Size(4)
	Unknown PerkClassNumCap; //  0x3b0 Size(50)
	Unknown PerkClassWeightModifier; //  0x400 Size(50)
	Unknown PerkClassBlock; //  0x450 Size(10)
	char bBlockSpawnVehicle; //  0x460 Size(1)
	char bBlockRedZone; //  0x461 Size(1)
	char PerkLevelUpAllUserSame; //  0x462 Size(1)
	struct FString CQRKey; //  0x468 Size(10)
	Unknown GameViewType; //  0x478 Size(1)
	Unknown MatchingType; //  0x479 Size(1)
	struct FName ExpertWeaponTableID; //  0x47c Size(8)
	int32_t PersonalSupplyBoxPositionType; //  0x484 Size(4)
	char NoDelaySpawnPersonalSupplyBox; //  0x488 Size(1)
	char MustSpawnPersonalSupplyBox; //  0x489 Size(1)
	int32_t RetiredPlayerCount; //  0x48c Size(4)
	Unknown UniqueIDPlayerStates; //  0x490 Size(50)
	Unknown MatchID; //  0x4e0 Size(10)
	struct FString GameServerID; //  0x4f0 Size(10)
	Unknown DefaultClassSelectInfo; //  0x510 Size(28)
	Unknown DefaultClassChangeInfo; //  0x538 Size(48)
	Unknown CurrentGameSettingInfo; //  0x580 Size(88)
	char IsUsingOuterAreaBlueZone; //  0x608 Size(1)
	Unknown BlueZone; //  0x610 Size(8)
	struct FMulticastInlineDelegate OnBlueZoneDelegate; //  0x618 Size(10)
	struct FMulticastInlineDelegate OnChangePerkModeDelegate; //  0x628 Size(10)
	float RecoilModifier_AR; //  0x654 Size(4)
	float RecoilModifier_SMG; //  0x658 Size(4)
	float RecoilModifier_SG; //  0x65c Size(4)
	float RecoilModifier_DMR; //  0x660 Size(4)
	float RecoilModifier_SR; //  0x664 Size(4)

	void ShowTimeHUDMessage(); // Function BravoHotelGame.BravoHotelGameState.ShowTimeHUDMessage(Native|Public) // <Game+0x1f24550>
};

// Class BravoHotelGame.BattleRoyaleGameState
struct ABattleRoyaleGameState : ABravoHotelGameState {
	char IsNewItemSpawnMode; //  0x668 Size(1)
	int32_t TeamSize; //  0x66c Size(4)
	Unknown GameRule; //  0x670 Size(1)
	Unknown BattleRoyaleState; //  0x671 Size(1)
	int32_t TotalPlayerCount; //  0x674 Size(4)
	int32_t TotalAIPlayerCount; //  0x678 Size(4)
	int32_t CurrentPlayerCount; //  0x67c Size(4)
	int32_t CurrentTeamCount; //  0x680 Size(4)
	int32_t TotalTeamCount; //  0x684 Size(4)
	struct FMulticastInlineDelegate OnBattleRoyalStateChanged; //  0x688 Size(10)
	struct FMulticastInlineDelegate OnRocketLaunch; //  0x698 Size(10)
	struct FMulticastInlineDelegate OnItemSpawnModeChanged; //  0x6a8 Size(10)
	struct FMulticastInlineDelegate OnChangeRemainTime; //  0x6b8 Size(10)
	char bCheckSeaLevelZ; //  0x6c8 Size(1)
	float SeaLevelZ; //  0x6cc Size(4)
	int32_t GhostPlayerCountForTest; //  0x6d4 Size(4)
	struct FMulticastInlineDelegate OnRepTeamSize; //  0x6d8 Size(10)
	Unknown CharacterDiedInfos; //  0x6e8 Size(10)
	Unknown TeamEndInfos; //  0x6f8 Size(10)
	Unknown AirCraftBoardingInfos; //  0x708 Size(10)
	Unknown redzone; //  0x718 Size(8)
	Unknown RedZoneManager; //  0x720 Size(8)
	struct FMulticastInlineDelegate AirCraftDescentPlayerInfoEvent; //  0x780 Size(10)
	struct FMulticastInlineDelegate EndAirCraftBoardingPlayerEvent; //  0x790 Size(10)
	Unknown AircraftFlightRef; //  0x7a0 Size(8)
	struct FMulticastInlineDelegate OnRepCurrentPlayerCount; //  0x7a8 Size(10)
	struct FMulticastInlineDelegate OnRepCurrentTeamCount; //  0x7b8 Size(10)
	struct FMulticastInlineDelegate OnUpdateClassCount; //  0x7c8 Size(10)
	Unknown RestoreList; //  0x7d8 Size(10)
	Unknown TimerHandle_MoveToLobbyLevel; //  0x7f0 Size(8)
	Unknown CurrentClassCounts; //  0x7f8 Size(50)
	int32_t AutoBotCount; //  0x848 Size(4)

	void SetDescentPlayerInfo(int32_t PlayerId); // Function BravoHotelGame.BattleRoyaleGameState.SetDescentPlayerInfo(Final|Native|Public) // <Game+0x1e4b020>
};

// Class BravoHotelGame.BHPersonalSupplyBox
struct ABHPersonalSupplyBox : UActor {
	char NeedInit; //  0x310 Size(1)
	Unknown RootBoxComponent; //  0x320 Size(8)
	Unknown InteractiveSphereComponent; //  0x328 Size(8)
	Unknown InteractiveCancleSphereComponent; //  0x330 Size(8)
	struct FName BoxName; //  0x338 Size(8)
	Unknown RelatedPlayerIds; //  0x340 Size(10)
	Unknown CurrentStateType; //  0x359 Size(1)
	char CheckRePosition; //  0x35a Size(1)
	Unknown TimeHandle_CheckRePosition; //  0x360 Size(8)
	int32_t CustomIndex; //  0x368 Size(4)
	char TraceLand; //  0x36c Size(1)
	Unknown TimerHandle_Destroy; //  0x370 Size(8)

	void UpdateCheckRePosition(); // Function BravoHotelGame.BHPersonalSupplyBox.UpdateCheckRePosition(Final|Native|Public) // <Game+0x1e4bf80>
};

// Class BravoHotelGame.BravoHotelDropBoxActor
struct ABravoHotelDropBoxActor : UActor {
	Unknown RootType; //  0x310 Size(1)
	Unknown RootBoxComponent; //  0x318 Size(8)
	Unknown InventoryComponent; //  0x320 Size(8)
	Unknown InteractiveSphereComponent; //  0x328 Size(8)
	Unknown InteractiveCancleSphereComponent; //  0x330 Size(8)
	struct FName DropperNickName; //  0x338 Size(8)
	struct FName BoxName; //  0x340 Size(8)
	int32_t RarityIndex; //  0x348 Size(4)
	Unknown DetectedCharacter; //  0x350 Size(8)

	void SetItemInBlueprint(struct FName& ItemKey); // Function BravoHotelGame.BravoHotelDropBoxActor.SetItemInBlueprint(Event|Public|HasOutParms|BlueprintEvent) // <Game+0x23a73f0>
};

// Class BravoHotelGame.BHPersonalSupplyBoxDummy
struct ABHPersonalSupplyBoxDummy : ABravoHotelDropBoxActor {
	int32_t playerGUID; //  0x390 Size(4)
};

// Class BravoHotelGame.BHPersonalSupplyBoxManager
struct ABHPersonalSupplyBoxManager : AInfo {
	Unknown SupplyBoxClass; //  0x310 Size(8)
	Unknown ListPhaseInfo; //  0x318 Size(10)
	int32_t CurrentPhaseNum; //  0x328 Size(4)
	Unknown ListUsableSupplyBox; //  0x330 Size(10)
	Unknown MapSupplyBox; //  0x340 Size(50)
	struct FName TestRandomTableID; //  0x390 Size(8)
	char UseTestRandom; //  0x398 Size(1)
	Unknown SpawnedSupplyBoxList; //  0x3b0 Size(10)
	Unknown ForceSpawnedSupplyBoxList; //  0x3c0 Size(10)

	void SetCurrentPhaseNum(int32_t PhaseNum); // Function BravoHotelGame.BHPersonalSupplyBoxManager.SetCurrentPhaseNum(Final|Native|Public|BlueprintCallable) // <Game+0x1e4c450>
};

// Class BravoHotelGame.BravoHotelCharacter
struct ABravoHotelCharacter : ACharacter {
	Unknown AudioComponent; //  0x30e8 Size(8)
	Unknown CameraBase; //  0x2e40 Size(8)
	Unknown CameraAssistant3P; //  0x1390 Size(8)
	Unknown Camera3P; //  0x908 Size(8)
	Unknown CharacterBackLight; //  0x1e28 Size(8)
	Unknown CharacterBackLightSecond; //  0x36a8 Size(8)
	float BackLightIntensity_FPP; //  0x3768 Size(4)
	float BackLightIntensity_ADS; //  0x36d8 Size(4)
	Unknown BuffParticleComponents; //  0x24b8 Size(10)
	Unknown MutableComponent; //  0x24f8 Size(8)
	Unknown InteractiveSphereComponent; //  0x1a70 Size(8)
	Unknown InteractiveCancleSphereComponent; //  0x29b0 Size(8)
	Unknown Parachute; //  0x2718 Size(8)
	Unknown WaterParticleSystem; //  0x3830 Size(8)
	Unknown FlameDamageParticleComponent; //  0x3720 Size(8)
	Unknown FlameDamageParticle; //  0x36c0 Size(8)
	Unknown STMComponent; //  0x2d60 Size(8)
	Unknown ActionComponent; //  0xb58 Size(8)
	Unknown PerkComponent; //  0x1f80 Size(8)
	Unknown TeamInfoUpdaterComponentRef; //  0x10e8 Size(8)
	Unknown TimeHandle_MolotovDotDamage; //  0xb90 Size(8)
	Unknown Stand_FlameDotDamageAnim; //  0xee8 Size(10)
	Unknown Prone_FlameDotDamageAnim; //  0x850 Size(10)
	Unknown FlameDamageInfos; //  0x2820 Size(10)
	struct FString NPCNickName; //  0x1f60 Size(10)
	char bAllowToggleCamera; //  0x1730 Size(1)
	char bThirdPerson; //  0x1d18 Size(1)
	float SprintingMoveRightModifier; //  0x11e0 Size(4)
	float LeanValue; //  0x1168 Size(4)
	float LeanDegreeMax; //  0x2ca4 Size(4)
	float LeanUpdateSpeed; //  0x12bc Size(4)
	Unknown SaveLeanState; //  0x29c4 Size(1)
	Unknown PrevLeanState; //  0x1684 Size(1)
	char bFixLeanDegreeMax; //  0x20e0 Size(1)
	char bFixFPPFoV; //  0x161c Size(1)
	float Health; //  0x10e0 Size(4)
	float ShortTimeHealth; //  0x12f0 Size(4)
	float TargetHealth; //  0x2d18 Size(4)
	float BandageTargetHealth; //  0x11c8 Size(4)
	float OverHealHealth; //  0xa80 Size(4)
	Unknown PP_Preset_ShortHealth; //  0x9a8 Size(8)
	Unknown PPInst_ShortHealth; //  0x2010 Size(8)
	Unknown TargetHealthMap; //  0x2040 Size(50)
	float Oxygen; //  0x3208 Size(4)
	float SteadyPoint; //  0x14b0 Size(4)
	int8_t BoostPercent; //  0xd50 Size(1)
	float Default3PFOV; //  0x3708 Size(4)
	float Default3PFOV_AOS; //  0x2784 Size(4)
	float Default3PFOV_AMP; //  0xa94 Size(4)
	float Default3PFOV_HeartBeatSenso; //  0xca8 Size(4)
	float Default3PFOV_SkillMAP; //  0x16f8 Size(4)
	float ForwardAxisValue; //  0x36b8 Size(4)
	float RightAxisValue; //  0x2250 Size(4)
	float InputMovementAttenuationTime; //  0x281c Size(4)
	float InputMovementAttenuationTimeIdleToCrouch; //  0x30d0 Size(4)
	float InputMovementAttenuationTimeIdleToProne; //  0xc98 Size(4)
	float InputMovementAttenuationTimeProneToIdle; //  0xe30 Size(4)
	float InputMovementAttenuationValueIdleToCrouch; //  0x9b8 Size(4)
	float InputMovementAttenuationValueIdleToProne; //  0x1524 Size(4)
	float InputMovementAttenuationValueProneToIdle; //  0x20d0 Size(4)
	float InputMovementAttenuationValue; //  0xf2c Size(4)
	char bMovementKeyPushed; //  0x29a8 Size(1)
	char bLastMovementKeyPushed; //  0xb20 Size(1)
	char bMovementInputLock; //  0x27d9 Size(1)
	Unknown InputAxisOnLockMovement; //  0x3358 Size(8)
	char bInputKeyJump; //  0x27ed Size(1)
	float Doub; //  0x2b0c Size(4)
	char bShouldSprint; //  0x1d08 Size(1)
	Unknown FireTypeComplete; //  0x21b8 Size(1)
	Unknown PerBoneDamageTable; //  0x3738 Size(8)
	Unknown MeleeDamageTable; //  0x2cf0 Size(8)
	Unknown PistolsDamageTable; //  0x1ae8 Size(8)
	Unknown ShotgunsDamageTable; //  0x2848 Size(8)
	Unknown SMGsDamageTable; //  0x1718 Size(8)
	Unknown ARsDamageTable; //  0x1460 Size(8)
	Unknown DMRsDamageTable; //  0xdc8 Size(8)
	Unknown SRsDamageTable; //  0x3668 Size(8)
	Unknown BrokenHelmetClass; //  0xbd0 Size(8)
	char bNeedToSpawnBrokenEquipment; //  0x1ac8 Size(1)
	float BrokenEquipmentLevel; //  0x1064 Size(4)
	Unknown BrokenEquipmentDamagedDirection; //  0x253c Size(c)
	Unknown BrokenEquipmentType; //  0x21d8 Size(1)
	Unknown InteractionType; //  0x3499 Size(1)
	float InteractionTraceDistance; //  0x2fa4 Size(4)
	Unknown DetectedInteractionActor; //  0xca0 Size(8)
	Unknown DetectedInteractionComponet; //  0x26d8 Size(8)
	Unknown DetectedVehicleSeatComponent; //  0x1fa0 Size(8)
	Unknown DetectedInteractionCancleActors; //  0x2520 Size(10)
	Unknown InteractionDistRatioMap; //  0x1318 Size(50)
	float ResurrectionCameraBlendTime; //  0x31a0 Size(4)
	Unknown PostProcessResurrectionClass; //  0x1458 Size(8)
	Unknown ResurrectionEffectCurve; //  0x13a8 Size(8)
	Unknown ResurrectionMaterialController; //  0x3368 Size(10)
	Unknown DetectedPickableItem; //  0x11d0 Size(8)
	Unknown DetectedItemList; //  0x2490 Size(10)
	Unknown DetectedBoxList; //  0x1050 Size(10)
	Unknown DetectedStealableList; //  0x26b0 Size(10)
	Unknown DetectedItemHideList; //  0x8d8 Size(10)
	Unknown TimerHandle_CheckDetectedItemList; //  0xf38 Size(8)
	Unknown InventoryComponent; //  0x1dd8 Size(8)
	Unknown AbilityComponent; //  0x1440 Size(8)
	Unknown DoorComponent; //  0x13e0 Size(8)
	Unknown ParkourComponent; //  0x1ba8 Size(8)
	Unknown BlueZoneGameRule; //  0x2008 Size(8)
	Unknown VoiceComponent; //  0x2440 Size(8)
	Unknown LadderComponent; //  0xf78 Size(8)
	Unknown StationaryCharInfo; //  0xb98 Size(8)
	Unknown CharacterReplication; //  0x2278 Size(8)
	Unknown Comb; //  0x8b8 Size(10)
	Unknown CombacterReplicat; //  0x3810 Size(10)
	Unknown RepairAnim_Stand; //  0x2cf8 Size(10)
	Unknown RepairAnim_Prone; //  0x21a0 Size(10)
	Unknown CurrentPickupMontage; //  0x1188 Size(8)
	Unknown PickUpAnim_Unarmed_Floor; //  0x25f8 Size(10)
	Unknown PickUpAnim_Unarmed_Table; //  0x2ed8 Size(10)
	Unknown PickUpAnim_Unarmed_Crouch; //  0x3240 Size(10)
	Unknown PickUpAnim_Unarmed_Prone; //  0x2990 Size(10)
	Unknown PickUpAnim_Rifle_Floor; //  0x1070 Size(10)
	Unknown PickUpAnim_Rifle_Table; //  0x2b88 Size(10)
	Unknown PickUpAnim_Rifle_Crouch; //  0x25d8 Size(10)
	Unknown PickUpAnim_Rifle_Prone; //  0x31a8 Size(10)
	Unknown PickUpAnim_Pistol_Floor; //  0x2c20 Size(10)
	Unknown PickUpAnim_Pistol_Table; //  0x3110 Size(10)
	Unknown PickUpAnim_Pistol_Crouch; //  0x2168 Size(10)
	Unknown PickUpAnim_Pistol_Prone; //  0xe20 Size(10)
	Unknown DoorAnim_Open; //  0x10f0 Size(10)
	Unknown DoorAnim_Close; //  0x1590 Size(10)
	Unknown DoorAnim_Kick; //  0x2a48 Size(10)
	Unknown MovementAnim_GetUpFromBack; //  0x14f0 Size(10)
	Unknown MovementAnim_GetUpFromFront; //  0x33c8 Size(10)
	Unknown ConditionAnim_ShakeOut_Unarmed; //  0x2d78 Size(10)
	Unknown ConditionAnim_ShakeOut_Rifle; //  0x19d0 Size(10)
	Unknown MeleeAnim_Punch_Idle; //  0x2ef8 Size(10)
	Unknown MeleeAnim_Punch_Crouch; //  0x3758 Size(10)
	Unknown MeleeAnim_Punch_Jump; //  0x3560 Size(10)
	Unknown MeleeAnim_Rifle_Idle; //  0x21c0 Size(10)
	Unknown MeleeAnim_Rifle_Crouch; //  0x3268 Size(10)
	Unknown MeleeAnim_Pistol_Idle; //  0x2d28 Size(10)
	Unknown MeleeAnim_Pistol_Crouch; //  0x1408 Size(10)
	Unknown DeathAnim_Crouch; //  0x2790 Size(10)
	Unknown DeathAnim_FlameDamage; //  0x7c8 Size(10)
	Unknown DeathAnim_Grenade; //  0xd58 Size(10)
	Unknown DeathAnim_HeadShot; //  0x15d8 Size(10)
	Unknown DeathAnim_Natural; //  0x1b90 Size(10)
	Unknown DeathAnim_Rifle; //  0x1570 Size(10)
	Unknown DeathAnim_Shotgun; //  0x2468 Size(10)
	Unknown DeathAnim_Sprint; //  0x890 Size(10)
	Unknown DeathAnim_Falling; //  0xc28 Size(10)
	Unknown DeathAnim_ClosedEyes; //  0x1d00 Size(8)
	Unknown PickUpStartEvent; //  0x2d68 Size(8)
	Unknown PickUpBackpackEvent; //  0x10d8 Size(8)
	Unknown EquipAnim_MainWeapon1; //  0x26c8 Size(10)
	Unknown EquipAnim_MainWeapon1_Prone; //  0x2240 Size(10)
	Unknown EquipAnim_MainWeapon2; //  0x2a80 Size(10)
	Unknown EquipAnim_MainWeapon2_Prone; //  0x37b8 Size(10)
	Unknown EquipAnim_SubWeapon; //  0x2e48 Size(10)
	Unknown EquipAnim_SubWeapon_Prone; //  0x2680 Size(10)
	Unknown EquipAnim_Melee; //  0x1f70 Size(10)
	Unknown EquipAnim_Melee_Prone; //  0x1430 Size(10)
	Unknown EquipAnim_Amplifier; //  0x1b58 Size(10)
	Unknown EquipAnim_Amplifier_Prone; //  0x2310 Size(10)
	Unknown EquipAnim_HeartBeatSensor; //  0x33e8 Size(10)
	Unknown EquipAnim_HeartBeatSensor_Prone; //  0x1ad0 Size(10)
	Unknown SlidingAnim; //  0x8c8 Size(10)
	Unknown RollingAnim; //  0xb40 Size(10)
	Unknown KnockbackRollingAnim; //  0xa18 Size(10)
	Unknown EquipAnim_ThrowingWeapon; //  0x3740 Size(10)
	Unknown EquipAnim_Prone_ThrowingWeapon; //  0x10c8 Size(10)
	Unknown UnequipAnim_MainWeapon1; //  0x1398 Size(10)
	Unknown UnequipAnim_MainWeapon1_Pro; //  0x1858 Size(10)
	Unknown UnequipAnim_MainWeapon2; //  0x35b0 Size(10)
	Unknown UnequipAnim_MainWeapon2_Propo; //  0xb00 Size(10)
	Unknown UnequipAnim_SubWeapon; //  0x868 Size(10)
	Unknown UnequipAnim_SubWeapon_Prone; //  0x2f18 Size(10)
	Unknown UnequipAnim_Melee; //  0x2018 Size(10)
	Unknown UnequipAnim_Melee_Prone; //  0x1380 Size(10)
	Unknown UnequipAnim_Amplifier; //  0x2830 Size(10)
	Unknown UnequipAnim_Amplifier_Prone; //  0x1c90 Size(10)
	Unknown UnequipAnim_HeartBeatSensor; //  0x3190 Size(10)
	Unknown UnequipAnim_HeartBeatSensor_Prone; //  0x1bd8 Size(10)
	Unknown UnequipAnim_ThrowingWeapon; //  0x29e8 Size(10)
	Unknown UnequipAnim_Prone_ThrowingWeapon; //  0x20e8 Size(10)
	Unknown LandingAnim_LandStop; //  0x13b8 Size(10)
	Unknown LandingAnim_Parachute; //  0x3778 Size(10)
	Unknown LandingAnim_Unarmed; //  0x20a0 Size(10)
	Unknown LandingAnim_Rifle; //  0x2ae8 Size(10)
	Unknown LandingAnim_Pistol; //  0x11a8 Size(10)
	Unknown ResuscitationAnimSets; //  0xc08 Size(10)
	Unknown WeaponEquipEvents; //  0x2b58 Size(10)
	Unknown AttachmentEquipEvents; //  0x32c0 Size(10)
	Unknown WearableEquipEvents; //  0x37a0 Size(10)
	Unknown ConsumablesEvents; //  0x1128 Size(10)
	Unknown MedipackUseEvent; //  0x24d0 Size(8)
	Unknown ItemDropEvent; //  0xe40 Size(8)
	Unknown ADSEnterEvent; //  0x2090 Size(8)
	Unknown ADSEnterEvent_Digital; //  0xb80 Size(8)
	Unknown ADSExitEvent; //  0x2610 Size(8)
	Unknown ADSExitEvent_Digital; //  0x32e0 Size(8)
	Unknown AOSEnterEvent; //  0x3a38 Size(8)
	Unknown AOSExitEvent; //  0x37d8 Size(8)
	Unknown AMPEnterEvent; //  0x3730 Size(8)
	Unknown AMPExitEvent; //  0x3920 Size(8)
	Unknown AMPNoiseEvent; //  0xaa8 Size(8)
	Unknown AMPNoiseStopEvent; //  0x1090 Size(8)
	Unknown PlosiveSoundDetection3LvEvent; //  0x1a50 Size(8)
	Unknown HeartBeatSensorEnterEvent; //  0x1138 Size(8)
	Unknown HeartBeatSensorExitEvent; //  0x1f48 Size(8)
	Unknown HeartBeatSensorNoiseEvent; //  0x3018 Size(8)
	Unknown HeartBeatSensorNoiseStopEvent; //  0x22e0 Size(8)
	Unknown DamagedEvent; //  0x36d0 Size(8)
	Unknown HitEvent; //  0x31c8 Size(8)
	Unknown SnowAreaEnteringEvent; //  0x1220 Size(8)
	Unknown UltimateSprintEvent; //  0x33b0 Size(8)
	char bIsParachuteLanding; //  0x36f0 Size(1)
	float ParachuteLandingHeight; //  0x81c Size(4)
	Unknown StartDescendingEvent; //  0x3a18 Size(8)
	Unknown ParachuteFoldEvent; //  0x20c8 Size(8)
	Unknown TimerHandle_Sequnce; //  0x3028 Size(8)
	Unknown TeamPosition; //  0xef8 Size(8)
	float AdditionalTeamPositionWidgetHeight; //  0x2648 Size(4)
	float TeamPositionWidgetInterpSpeed; //  0x2780 Size(4)
	float CurrentTeamPositionHeight; //  0x31ec Size(4)
	struct FMulticastInlineDelegate OnChangeDetectedItems; //  0x1880 Size(10)
	char bIsArmedBeforeAction; //  0x2ca0 Size(1)
	struct FMulticastInlineDelegate Delegate_OnViewCameraInWater; //  0x23e8 Size(10)
	struct FMulticastInlineDelegate Delegate_OnViewCameraOutWater; //  0x3178 Size(10)
	char bInSmoke; //  0x2a32 Size(1)
	struct FMulticastInlineDelegate Delegate_OnInSmoke; //  0xc38 Size(10)
	struct FMulticastInlineDelegate Delegate_OnOutSmoke; //  0x30f0 Size(10)
	Unknown SmokeActors; //  0x1f88 Size(10)
	Unknown SwimDiveEvent; //  0x1110 Size(8)
	char bIsEnterIndoorVolume; //  0x1af4 Size(1)
	Unknown SkyLightRef; //  0x8a8 Size(8)
	float PrevSkyLightIntensityCache; //  0x22d4 Size(4)
	Unknown PrevSkyLightOcclusionTintCache; //  0x36b4 Size(4)
	float SkyLightCurrentPriority; //  0x3168 Size(4)
	Unknown OverlappedInDoorVolumes; //  0x2df8 Size(10)
	Unknown LastSteppedSurface; //  0x1c80 Size(8)
	Unknown SurfaceType; //  0x2428 Size(1)
	Unknown SurfaceType_LastTick; //  0x344c Size(1)
	float MP_SnowInterpSpeed; //  0xd88 Size(4)
	Unknown TimerHandle_BreathEffect; //  0x21d0 Size(8)
	Unknown BreathParticleComponent; //  0x1d70 Size(8)
	Unknown BreathParticle_Idle; //  0xd30 Size(8)
	Unknown BreathParticle_Moving; //  0x37e0 Size(8)
	Unknown InWaterParticle; //  0x2700 Size(8)
	struct FMulticastInlineDelegate OnUpdateMutableDelegate; //  0x2d88 Size(10)
	Unknown OverlapWaterVolume; //  0x3578 Size(8)
	char bIsMelee; //  0xd78 Size(1)
	char bIsMeleeJumpAttack; //  0x994 Size(1)
	char bCanJumpMeleeAttack; //  0xd10 Size(1)
	char bIsMeleeAttackBlocked; //  0x12b8 Size(1)
	float LastMeleeAttackTime; //  0xd74 Size(4)
	Unknown CurrentMeleeAnimSlot; //  0x2c90 Size(10)
	Unknown ActorsToIgnore_Melee; //  0x2da8 Size(10)
	Unknown MeshesToIgnore_Melee; //  0x1208 Size(10)
	float UnarmedMeleeDamage_Ground; //  0x36bc Size(4)
	float UnarmedMeleeDamage_Jump; //  0x28f0 Size(4)
	char bIsFired; //  0x2290 Size(1)
	char bWantsToFire; //  0x839 Size(1)
	char bWantsToAOS; //  0x1069 Size(1)
	char bIsLanded; //  0xfc0 Size(1)
	float FiredTimeCount; //  0x9c4 Size(4)
	float StartFireTime; //  0x1628 Size(4)
	char bIsADSFireToCamera; //  0x3580 Size(1)
	float FireToCameraLocationCorrection; //  0x2f80 Size(4)
	Unknown ArmsLagRotation; //  0x810 Size(c)
	float ArmsLagDeltaMin; //  0x2b70 Size(4)
	float ArmsLagDeltaMax; //  0x13b0 Size(4)
	float DefaultsArmsLagRotationMax; //  0xb64 Size(4)
	float DefaultsArmsLagRotationSpeed; //  0x28bc Size(4)
	Unknown ArmsLags; //  0x2a98 Size(50)
	float ArmsLagBaseModify; //  0x1f50 Size(4)
	float ArmsLagWeaponModify; //  0x11fc Size(4)
	Unknown ArmsLagWeaponRotation; //  0xbb8 Size(c)
	Unknown ADSDeltaRotation; //  0x1518 Size(c)
	Unknown ADSEndLocation; //  0x320c Size(c)
	char bSteadyAim; //  0x1dfc Size(1)
	Unknown LastSwayRotationOnSteadyAim; //  0x1aa8 Size(c)
	Unknown SteadyAimReadyEvent; //  0x1748 Size(8)
	Unknown SteadyAimStartEvent; //  0x25e8 Size(8)
	Unknown SteadyAimEndEvent; //  0x29e0 Size(8)
	float HeadShotBloodEffectDistance; //  0x7f0 Size(4)
	Unknown HeadShotHelmetFxEmitterTemplate; //  0x1510 Size(8)
	float BoltActionDelayTime; //  0x1ab4 Size(4)
	char bWaitingADSReturn; //  0x2a31 Size(1)
	float ADSReturnEnableTime; //  0x84c Size(4)
	float Delay_AOSToADS; //  0xb24 Size(4)
	char bNeedToBeADS; //  0x3410 Size(1)
	Unknown TimerHandle_ADSProcess; //  0x2b80 Size(8)
	Unknown PP_Preset_ADS; //  0x2f58 Size(8)
	Unknown PPInst_ADS; //  0x28c0 Size(8)
	float ReplayInputForwardAxisValue; //  0x12a0 Size(4)
	float ReplayInputRightAxisValue; //  0x20c0 Size(4)
	Unknown CurrentInputAxis; //  0x26a0 Size(8)
	struct FMulticastInlineDelegate Delegate_OnCameraViewModeChanged; //  0x5e8 Size(10)
	Unknown ZoomInAudioEvent_Digital; //  0x2450 Size(8)
	Unknown ZoomOutAudioEvent_Digital; //  0x1dd0 Size(8)
	float ZoomAudioEventRepeatDelay; //  0x25f4 Size(4)
	float ZoomAudioEventLastPlayTime; //  0x3794 Size(4)
	struct FMulticastInlineDelegate OnPickableItemDetected; //  0x628 Size(10)
	float OverHeadTraceDistance; //  0xf30 Size(4)
	char bShouldAdjustOverHead; //  0x33d8 Size(1)
	float UpdateAnimationDistance; //  0x1538 Size(4)
	char bIsDisarming; //  0x658 Size(1)
	Unknown ResuscitationStopEv; //  0xa88 Size(8)
	Unknown ResuscitatingCharacter; //  0x1fe8 Size(8)
	float RequestResuscitationCoolTime; //  0xf20 Size(4)
	Unknown CurrentResuscitationAnimSlo; //  0xf88 Size(10)
	Unknown TimerHandle_SetIsFired; //  0x3a48 Size(8)
	float KillAssistValidTime; //  0x3450 Size(4)
	int32_t KillAssistMaxCount; //  0xf28 Size(4)
	float KnockOutAssistValidTime; //  0x2904 Size(4)
	int32_t KnockOutAssistMaxCount; //  0xc88 Size(4)
	Unknown AssistInfo; //  0x1950 Size(10)
	float ThrowingWeaponFireDelay; //  0x2a64 Size(4)
	float PreShootDeltaSecond; //  0xfd0 Size(4)
	char bIsParachuteAvailable; //  0x1bd1 Size(1)
	float ParachuteInputForward; //  0x2fe0 Size(4)
	float ParachuteInputRight; //  0x7a8 Size(4)
	float ParachuteForwardMomentum; //  0x13d4 Size(4)
	Unknown ParachuteLastRotator; //  0x3428 Size(c)
	float CurrentParachuteMaxMomentum; //  0x910 Size(4)
	float ParachuteMaxMomentum; //  0xe94 Size(4)
	float ParachuteMomentumAcc; //  0x15d0 Size(4)
	float ParachuteMomentumDeacc; //  0x15e8 Size(4)
	float ParachuteMomentumZ; //  0x1ba4 Size(4)
	float DescentInputVectorAcc; //  0x26f8 Size(4)
	float ParachuteInputVectorAcc; //  0x1f54 Size(4)
	float ParachuteVelocityChangeFinalRate; //  0x32ac Size(4)
	float ParachuteVelocityChangeZDecRate; //  0xb3c Size(4)
	float ParachuteLandingVelocityZ; //  0x1930 Size(4)
	float ParachuteLandingVelocityXY; //  0xf60 Size(4)
	float ForwardMomentumRangeMin; //  0x1734 Size(4)
	float ForwardMomentumRangeMax; //  0xaec Size(4)
	float CurrentYawSpeed; //  0x1ce0 Size(4)
	float CurrentRollSpeed; //  0x2908 Size(4)
	float CurrentPitchSpeed; //  0x2e58 Size(4)
	float MinPitchInParachute; //  0x3128 Size(4)
	float MaxPitchInParachute; //  0x2408 Size(4)
	float GlidePitchInParachute; //  0x9e8 Size(4)
	float MinRollInParachute; //  0x2a90 Size(4)
	float MaxRollInParachute; //  0x3424 Size(4)
	float MaxRollInParachuteVelocity; //  0x1378 Size(4)
	float ParachuteTurnSpeedYaw; //  0x2b74 Size(4)
	float ParachuteTurnSpeedPitch; //  0x2818 Size(4)
	float ParachuteTurnSpeedRoll; //  0x2a00 Size(4)
	float ParachuteTurnChangeSpeedYaw; //  0x2098 Size(4)
	float ParachuteTurnChangeSpeedPitch; //  0x2178 Size(4)
	float ParachuteTurnChangeSpeedRoll; //  0x386c Size(4)
	float HeightToGetInParachuteFromLand; //  0x2fa0 Size(4)
	float ForceHeightToGetInParachuteFromLand; //  0x2a34 Size(4)
	Unknown ReplicatedParachuteVelocity; //  0x12d0 Size(c)
	Unknown ParachutePitchCurve; //  0x14b8 Size(8)
	Unknown ParachuteSkinMaterials; //  0x1868 Size(10)
	Unknown CurrentParachuteSkin; //  0x1760 Size(8)
	char bChangeNearClipPlane; //  0x2ca9 Size(1)
	float DescentStartZPosition; //  0x2b78 Size(4)
	float ParachuteAvailableFallingDistance; //  0xd28 Size(4)
	float DescentZ; //  0xda0 Size(4)
	float SeaLevelZ; //  0x800 Size(4)
	float SaveMaxWalkSpeed; //  0x37d0 Size(4)
	float SaveCameraBoomLocationZ; //  0x2d0c Size(4)
	float PosToGetInParachute; //  0x2c1c Size(4)
	Unknown AccelerationPPClass; //  0x3130 Size(8)
	Unknown RadialOnDescentCurv; //  0x998 Size(8)
	float RadialRate; //  0x3798 Size(4)
	float DescentBlurWidth; //  0x15a0 Size(4)
	Unknown AccelerationPPInst; //  0x27b8 Size(8)
	float TargetSpringArmLengthDescent; //  0x1850 Size(4)
	float SpeedSpringArmLengthDesecnt; //  0x1a5c Size(4)
	char bDescentCameraShakeLoop; //  0x2a10 Size(1)
	float DescentCameraShakeDelay; //  0x2590 Size(4)
	Unknown DescentCameraShake; //  0x1300 Size(8)
	Unknown CloudFxEmitterTemplate; //  0x1f58 Size(8)
	Unknown CloudFxInDescent; //  0x3438 Size(8)
	float VelocityZ_LandStop; //  0x1a3c Size(4)
	float VelocityZ_Falling; //  0x3138 Size(4)
	float PrevMeshRelativeZ; //  0x349c Size(4)
	float PronedEyeHeight; //  0x2ee8 Size(4)
	char bIsProneWeaponIdle; //  0x316c Size(1)
	char bIsAutoSprint; //  0x2f38 Size(1)
	float PronedDeltaHeightCamera3P; //  0x256c Size(4)
	float CrouchedDeltaHeightCamera3P; //  0x1154 Size(4)
	float CrouchMovedDeltaHeightCamera3P; //  0x1cf8 Size(4)
	float StandDeltaHeightCamera3P; //  0x20f8 Size(4)
	float StandSprintDeltaHeightCamera3P; //  0x2708 Size(4)
	Unknown Camera1PInterpSrc; //  0x2154 Size(c)
	Unknown Camera3PInterpSrc; //  0x928 Size(c)
	Unknown Camera3PInterpDst; //  0x1678 Size(c)
	float TargetArmLength; //  0x3664 Size(4)
	float TargetArmLengthInterpSpeed; //  0x2c30 Size(4)
	float TargetArmLengthInterpSpeed_AMP; //  0x1084 Size(4)
	float TargetArmLengthInterpSpeed_HeartBeatSensor; //  0x1acc Size(4)
	float TargetFieldOfView; //  0x3238 Size(4)
	Unknown TargetSocketOffset; //  0x1644 Size(c)
	float DefaultCameraLag; //  0x1098 Size(4)
	float ReturnCameraLag; //  0xe58 Size(4)
	Unknown DefaultSocketOffset_VehicleAOS; //  0x289c Size(c)
	Unknown DefaultSocketOffset_LeftHipshot; //  0x31d4 Size(c)
	Unknown DefaultSocketOffset_Hipshot; //  0xba0 Size(c)
	Unknown DefaultSocketOffset_RightHipshot; //  0x20b4 Size(c)
	Unknown DefaultSocketOffset_LeftLeanAOS; //  0x2f94 Size(c)
	Unknown DefaultSocketOffset_RightLeanAOS; //  0x7ac Size(c)
	Unknown DefaultSocketOffset_LeftAOS_Idle; //  0x2554 Size(c)
	Unknown DefaultSocketOffset_RightAOS_Idle; //  0x31e0 Size(c)
	Unknown DefaultSocketOffset_LeftAOS_Crouch; //  0x9c8 Size(c)
	Unknown DefaultSocketOffset_RightAOS_Crouch; //  0x2480 Size(c)
	Unknown DefaultSocketOffset_LeftAOS_Prone; //  0x36e0 Size(c)
	Unknown DefaultSocketOffset_RightAOS_Prone; //  0x2ba0 Size(c)
	Unknown DefaultTargetOffset_HipShot; //  0x2f0c Size(c)
	Unknown DefaultTargetOffset_AOS_Stand_Idle; //  0x28c8 Size(c)
	Unknown DefaultTargetOffset_AOS_Stand_Lean; //  0x1cb8 Size(c)
	Unknown DefaultTargetOffset_AOS_Cro; //  0x83c Size(c)
	Unknown DefaultTargetOffset_AOS_Crond_Lean; //  0x1e08 Size(c)
	float DefaultTargetArmLength_Hipshot; //  0x2160 Size(4)
	float DefaultTargetArmLength_AOS; //  0xa90 Size(4)
	float Camera3P_FOV_InterpSpeed; //  0xa14 Size(4)
	float Camera3P_AMP_FOV_InterpSpeed; //  0x1948 Size(4)
	float Camera3P_HeartBeatSensor_FOV_InterpSpeed; //  0x2f8c Size(4)
	float Camera3P_Lean_InterpSpeed; //  0x2518 Size(4)
	Unknown DeathCamClass; //  0xc70 Size(8)
	float DeathBeginTime; //  0x3a54 Size(4)
	Unknown BodyBaseSkeletalMesh; //  0x668 Size(8)
	char bNeedToUpdatePreviewPawn; //  0x3544 Size(1)
	Unknown Mutable_MaleInstance; //  0x11c0 Size(8)
	Unknown Mutable_FemaleInstance; //  0x2b98 Size(8)
	Unknown InventoryCharacterClass; //  0x2300 Size(8)
	Unknown InventoryCharacter; //  0xbc8 Size(8)
	struct FMulticastInlineDelegate OnUpdateCastingDelegate; //  0x6b0 Size(10)
	int32_t UsingBackpackItemIndex; //  0xa28 Size(4)
	float ItemInterruptInputSeconds; //  0x31b8 Size(4)
	Unknown CastingItemTimer; //  0x1298 Size(8)
	Unknown CastingSupplyTimer; //  0x1780 Size(8)
	Unknown CastingItemMontageTimer; //  0x23f8 Size(8)
	Unknown LastCastingItemAnimSlot_Stand; //  0x1560 Size(10)
	Unknown LastCastingItemAnimSlot_Pro; //  0x13e8 Size(10)
	Unknown CastingStopEvents; //  0x2bf0 Size(10)
	char bIsCastingItem; //  0x1e14 Size(1)
	Unknown CompletedCastingInfo; //  0x2e5c Size(8)
	int32_t BasicSetting_gender; //  0x2198 Size(4)
	int32_t BasicSetting_face; //  0x15c8 Size(4)
	int32_t BasicSetting_face_color; //  0x2028 Size(4)
	int32_t BasicSetting_hair; //  0x24ac Size(4)
	int32_t BasicSetting_hair_color; //  0x142c Size(4)
	int32_t BasicSetting_makeup; //  0x36dc Size(4)
	Unknown BasicSettingItemInfos; //  0x1fd0 Size(10)
	struct FName Comb; //  0x1a88 Size(8)
	Unknown CombcSettingItemInf; //  0x3550 Size(10)
	Unknown Comb; //  0x14a8 Size(8)
	char bEnabledFur; //  0x1fa8 Size(1)
	struct FName WearableNameHasFur; //  0x32d0 Size(8)
	float CooldownTimeForEnterVehicle; //  0x25d4 Size(4)
	float CoolDownTimeForUseLadder; //  0x3728 Size(4)
	Unknown NearbyVehicles; //  0x2258 Size(10)
	struct FMulticastInlineDelegate Delegate_OnEnteredVehicle; //  0x6c0 Size(10)
	float MaxVehicleEscapeSpeed; //  0x9a0 Size(4)
	Unknown PreviousVehicleSeat; //  0x2720 Size(8)
	Unknown ProjectileGrenades; //  0x2268 Size(10)
	struct FMulticastInlineDelegate OnChangeProjectilePredictPath; //  0x2d50 Size(10)
	char IsBlind; //  0x141c Size(1)
	struct FMulticastInlineDelegate OnAirCraftDelegate; //  0x21e0 Size(10)
	struct FMulticastInlineDelegate OnCharacterGroundStateChangeDelegate; //  0x15f8 Size(10)
	float FlashBangAngle; //  0x820 Size(4)
	Unknown PostProcessFlashBangClass; //  0x2e70 Size(8)
	Unknown GrenadeFlashBangStartEvent; //  0x1370 Size(8)
	Unknown GrenadeFlashBangEndEvent; //  0x3710 Size(8)
	Unknown GrenadeFragmentExplosionSineStopEvent; //  0x9f0 Size(8)
	Unknown PostProcessBloodHitClass; //  0x31c0 Size(8)
	Unknown DamagedDissolveAnimationCurve; //  0x1dc0 Size(8)
	Unknown PostProcessBloodHit; //  0x2420 Size(8)
	float DamagedDissolveRateTime; //  0x1268 Size(4)
	float DamagedTermTime; //  0x1540 Size(4)
	float DamagedDissolveAnimaitionMaxTime; //  0x2a60 Size(4)
	float HitBlinkTime; //  0x32a8 Size(4)
	float InternalDamagedTermTime; //  0xde4 Size(4)
	float InternalHitBlinkTime; //  0x1fe0 Size(4)
	float DamagedDissolveAnimationValue; //  0x27f0 Size(4)
	char IsEndTermTime; //  0x1a38 Size(1)
	char IsPlayingDamage; //  0xa98 Size(1)
	char IsHit; //  0x12cc Size(1)
	char IsDissolve; //  0xc90 Size(1)
	char DamageReset; //  0x26c0 Size(1)
	int32_t HitBlinkState; //  0x2608 Size(4)
	int32_t CurrentDamageCount; //  0x990 Size(4)
	int32_t DissolveCount; //  0x2504 Size(4)
	Unknown PostProcessOuterPlayZoneClass; //  0x22e8 Size(8)
	float ShowTimePostProcessOuterPlayZone; //  0x11e8 Size(4)
	Unknown TimerHandle_OuterPlayZone; //  0x3100 Size(8)
	Unknown PostProcessBlueZoneHitClass; //  0x14e8 Size(8)
	Unknown TimerHandle_BlueZone; //  0x1df0 Size(8)
	Unknown PostProcessMagneticHitClass; //  0x2d20 Size(8)
	Unknown PostProcessMagneticHit; //  0xbd8 Size(8)
	Unknown MagneticDamagedDissolveAnimation; //  0x2778 Size(8)
	float MagneticDamagedTermTime; //  0x2a6c Size(4)
	float MagneticDamagedDissolveAnimaitionMaxTime; //  0x2f84 Size(4)
	float MagneticHitBlinkTime; //  0x3414 Size(4)
	float InternalMagneticDamagedTermTime; //  0x2888 Size(4)
	float InternalMagneticHitBlinkTime; //  0x1af0 Size(4)
	float MagneticDamagedDissolveAnimationValue; //  0x2be8 Size(4)
	float BluezoneMaterialOnTime; //  0x830 Size(4)
	char IsMagneticEndTermTime; //  0x1bd2 Size(1)
	char IsMagneticDamage; //  0x27da Size(1)
	char IsMagneticHit; //  0x2840 Size(1)
	char IsMagneticDissolve; //  0x2808 Size(1)
	char MagneticDamageReset; //  0x3498 Size(1)
	Unknown PostProcessDustClass; //  0x26e8 Size(8)
	Unknown DustDissolveAnimationCurve; //  0x3980 Size(8)
	Unknown PostProcessDust; //  0x15b0 Size(8)
	float DustDissolveAnimaitionMaxTime; //  0x17ac Size(4)
	float DustDissolveDelayTime; //  0xb88 Size(4)
	float InternalDustDissolv; //  0xb14 Size(4)
	float DustDissolveAnimationValue; //  0x9d4 Size(4)
	char IsOnDust; //  0x2b7c Size(1)
	char IsDustDissolve; //  0x23e0 Size(1)
	char DustReset; //  0x1898 Size(1)
	Unknown PP_Preset_PickupOutline; //  0x1190 Size(8)
	Unknown PP_PickupOutlineRef; //  0x2560 Size(8)
	float CurrentOutlineThickness; //  0x24a8 Size(4)
	float MaxOutlineThickness; //  0x2568 Size(4)
	float OutlineThicknessInterpSpeed; //  0x1f98 Size(4)
	float CurrentCameraModifyerX; //  0x1d50 Size(4)
	float CurrentCameraModifyerY; //  0x228c Size(4)
	Unknown CurrentEMouseSensitivityState; //  0x33f8 Size(1)
	char bPendingOpenDoor; //  0x2ca8 Size(1)
	Unknown KickTargetDoor; //  0x1160 Size(8)
	Unknown DoorBreachingParticle; //  0x3228 Size(8)
	Unknown WindowBreachingParticle; //  0x2a08 Size(8)
	Unknown BreachingAudioEvent; //  0x1698 Size(8)
	Unknown BreachingAudioEvent_Silence; //  0x3788 Size(8)
	Unknown AnimInstance; //  0x26f0 Size(8)
	Unknown PostprocessAnimInstance; //  0x16f0 Size(8)
	Unknown AnimInstance_FPP; //  0x1cd8 Size(8)
	Unknown BravoHotelGameState; //  0x2810 Size(8)
	Unknown BravoHotelPlayerController; //  0x3800 Size(8)
	int32_t IdleNum; //  0x34e0 Size(4)
	float IdleWaitingTime; //  0x25d0 Size(4)
	struct FName LevelUpEffectBuffName; //  0x12b0 Size(8)
	Unknown DefaultBuffName; //  0x2430 Size(10)
	Unknown DefaultPerkInfo; //  0x1ab8 Size(10)
	Unknown UberUser; //  0x2458 Size(10)
	Unknown CurrentPerkInfos; //  0x3348 Size(10)
	Unknown UltimatePerkInfo; //  0x3278 Size(28)
	Unknown PerkUIInfos; //  0x1668 Size(10)
	Unknown UltimateUIInfo; //  0x3840 Size(2c)
	Unknown CurrentPerkCards; //  0x1198 Size(10)
	Unknown MutableBuffList; //  0x1750 Size(10)
	Unknown CurrentSkillType; //  0x1c10 Size(1)
	struct FMulticastInlineDelegate OnChangeFireType; //  0x1608 Size(10)
	int32_t CurrentReadyToSnipeGrade; //  0x260c Size(4)
	struct FMulticastInlineDelegate Delegate_OnEndSearchInstinct; //  0x1d20 Size(10)
	Unknown UsedTrapList; //  0x2670 Size(10)
	Unknown PerkLevelUpType; //  0x3a40 Size(1)
	int32_t ActiveSkillInitIndex; //  0xc6c Size(4)
	int32_t ActiveSkillCount; //  0x270c Size(4)
	Unknown CurrentDisplayAbility; //  0x2984 Size(c)
	Unknown LoadedClasses; //  0x1548 Size(10)
	int32_t PerkDeckChangingCount; //  0x2d38 Size(4)
	struct FMulticastInlineDelegate OnMovementInputPressedDelegate; //  0x708 Size(10)
	char bIsMoving; //  0xbe0 Size(1)
	char bForceMoving; //  0xc18 Size(1)
	Unknown LastDamagedType; //  0x31f0 Size(8)
	float LastDamagedAmount; //  0x22d8 Size(4)
	Unknown LastHitType; //  0x3750 Size(8)
	Unknown LastSimulatedTakeDamageInfo; //  0x948 Size(48)
	Unknown DebuffHitResult; //  0x398c Size(88)
	Unknown DebuffHitDamageType; //  0x28f8 Size(8)
	Unknown TakeDamageMontageList; //  0x10b8 Size(10)
	Unknown BloodSplatterEffect; //  0x36f8 Size(8)
	Unknown PunchEffect; //  0x1bf8 Size(8)
	Unknown ThrowingWeaponDirectHitEffect; //  0x1200 Size(8)
	float BloodEffectNearbyDist; //  0x122c Size(4)
	Unknown DefaultItemSetting; //  0x1000 Size(38)
	Unknown DefaultWearableSetting; //  0x2c00 Size(18)
	Unknown BlackMarketItemPresetList; //  0x37e8 Size(10)
	struct FMulticastInlineDelegate OnCanProneFailedDelegate; //  0x720 Size(10)
	float MinDamageableFallingSpeed; //  0x211c Size(4)
	float MaxDamageableFallingSpeed; //  0xfe0 Size(4)
	float MinDamageableFallingSpeedFromVehicle; //  0x2b10 Size(4)
	float MaxDamageableFallingSpeedFromVehicle; //  0xb10 Size(4)
	Unknown LandingReason; //  0xd11 Size(1)
	struct FMulticastInlineDelegate Delegate_OnExitFallingState; //  0x14d8 Size(10)
	Unknown OverlappedPhysicMaterials; //  0x1248 Size(10)
	float BushSoundSpawnDelay; //  0x17a8 Size(4)
	float BushLandingDamageMultiplier; //  0x2e64 Size(4)
	Unknown OverlappedCantProneComponent; //  0x1c30 Size(50)
	char bIsInsideBlueZone; //  0x178d Size(1)
	char bIsSpectated; //  0x1a58 Size(1)
	Unknown Camera3P_DeltaTargetOffsets; //  0x1980 Size(50)
	char bReplaceFreeLook; //  0x924 Size(1)
	char bUpdateDeathRotation; //  0x2a58 Size(1)
	Unknown RagdollLocation; //  0xd68 Size(c)
	Unknown RagdollVelocity; //  0x8f0 Size(c)
	Unknown LastDamageType; //  0x8e8 Size(8)
	float Ragdoll_ZOffset; //  0x1d34 Size(4)
	char bApplyRagdollForce; //  0x3014 Size(1)
	Unknown BravoHotelCharacterMovement; //  0x750 Size(8)
	Unknown PrevMovementMode; //  0x2b14 Size(1)
	Unknown NewMovementMode; //  0x11dc Size(1)
	Unknown PrevCustomMovementMode; //  0x27d8 Size(1)
	Unknown NewCustomMovementMode; //  0xf08 Size(1)
	Unknown MovementInputVector; //  0x1f38 Size(c)
	Unknown TimerHandle_HideParachute; //  0x758 Size(8)
	Unknown Timeline_TunnelEffect; //  0x35c0 Size(98)
	Unknown Curve_TunnelEffect; //  0x3930 Size(50)
	Unknown Timeline_CameraInterp; //  0x17b8 Size(98)
	Unknown Curve_CameraInterp; //  0x2e78 Size(8)
	Unknown Curve_AdsCameraInterp; //  0x918 Size(8)
	Unknown TimerHandle_MinTimeJumpingBeforeLand; //  0x3440 Size(8)
	float MinTimeJumpingBeforeLand; //  0x2de4 Size(4)
	float DescentXYAcc; //  0x2e18 Size(4)
	float DescentAirControl; //  0x1a90 Size(4)
	float DescentSpeed; //  0x1934 Size(4)
	float DescentGravityScale; //  0x1d14 Size(4)
	float DescentDeacceleration; //  0x8fc Size(4)
	float DescentMaxAcceleration; //  0x8a4 Size(4)
	Unknown DescentCameraLocation; //  0x2280 Size(c)
	float ParachuteAirControl; //  0x37cc Size(4)
	float ParachuteSpeed; //  0x2e68 Size(4)
	float ParachuteGravity; //  0x1558 Size(4)
	float ParachuteDeacceleration; //  0xfbc Size(4)
	float ParachuteMaxAcceleration; //  0xc94 Size(4)
	Unknown ParachuteCameraLocation; //  0x1448 Size(c)
	float ParachuteSocketOffsetY; //  0x1d0c Size(4)
	float ParachuteSocketDeltaOffsetZ; //  0x1c20 Size(4)
	float ParachuteReadyToLandHeight; //  0x3548 Size(4)
	float ParachuteQuickLandingStartHeight; //  0x2c48 Size(4)
	float ParachuteQuickLandingStartRadius; //  0x392c Size(4)
	float ParachuteQuickLandingVelocityModifierXY; //  0x1978 Size(4)
	float ParachuteQuickLandingVelocityModifierZ; //  0x11d8 Size(4)
	float ParachuteQuickLandingDMGRate; //  0x1938 Size(4)
	char bCanQuickLanding; //  0x2108 Size(1)
	Unknown LastQuickLandingAllowedLocation; //  0x3538 Size(c)
	Unknown ParachuteTargetCameraLocation; //  0x3670 Size(c)
	float ParachuteTargetCameraSpeed; //  0x26fc Size(4)
	float ParachuteTargetArmLengthSpeedStart; //  0x8a0 Size(4)
	float ParachuteTargetArmLengthSpeedEnd; //  0xfa8 Size(4)
	Unknown ParachuteUnfoldCameraShake; //  0x3418 Size(8)
	Unknown BreathStartEvent; //  0x29a0 Size(8)
	Unknown BreathEndEvent; //  0x1d38 Size(8)
	Unknown BreathStopEvent; //  0xfc8 Size(8)
	Unknown SprintingBeginRange; //  0x365c Size(8)
	Unknown SprintingRange; //  0xb28 Size(8)
	float ReduceCharacterSpeedTime; //  0x2db8 Size(4)
	float InternalReduceCharacterSpeedTime; //  0x13c8 Size(4)
	char IsInReduceSpeedExplosionRange; //  0x3188 Size(1)
	Unknown PostProcessEffectsTable; //  0xad0 Size(8)
	Unknown PostProcessAssignedList; //  0x16a0 Size(50)
	Unknown PostProcessBuffList; //  0x28a8 Size(10)
	Unknown RenderSettingsTable; //  0xfa0 Size(8)
	char bUpdateRenderSettings; //  0x1c11 Size(1)
	int32_t CurrentTerrainType; //  0x15a8 Size(4)
	Unknown AttachInAircraftOffset; //  0x2a38 Size(c)
	Unknown AttachInAircraftRotationOffset; //  0x33a4 Size(c)
	Unknown AttachInAircraftCameraLocaiton; //  0x1720 Size(c)
	float InitSpringArmLengthInAircraft; //  0x3824 Size(4)
	float TargetSpringArmLengthInAircraft; //  0xda4 Size(4)
	float SpeedSpringArmLengthInAirCraft; //  0x2f08 Size(4)
	float PrevBloomIntensity; //  0x29f8 Size(4)
	float PrevBloomThreshold; //  0x2a5c Size(4)
	float TargetBloomIntensityInAirCraft; //  0x26c4 Size(4)
	float SpeedBloomIntensityInAirCraft; //  0x1bb8 Size(4)
	float BloomStartDelayTimeInAirCraft; //  0x1ba0 Size(4)
	float CineDurationTimeMax; //  0x2710 Size(4)
	float CineTextAnimationAppearTime; //  0x9c0 Size(4)
	float GetPerkOnStartTime; //  0x32a0 Size(4)
	Unknown FPSK_Camera; //  0xd48 Size(8)
	Unknown ADSCameraScene; //  0x1b78 Size(8)
	Unknown FPSK_MutableArms; //  0x3108 Size(8)
	Unknown FPSK_Arms; //  0xbe8 Size(8)
	Unknown FPSK_CameraHeight; //  0x2e08 Size(c)
	float FPSK_CameraProbe; //  0x1cc4 Size(4)
	float FPSK_CameraPitchDeltaX; //  0x3808 Size(4)
	Unknown FPSK_CameraLocation_Idle; //  0x2548 Size(c)
	struct FName FPSK_CameraBone_Idle; //  0x11b8 Size(8)
	Unknown FPSK_CameraLocation_ADS; //  0xf54 Size(c)
	Unknown FPSK_CameraLocation_Parkour; //  0x1420 Size(c)
	struct FName FPSK_CameraBone_Parkour; //  0x2d70 Size(8)
	float FPSK_CameraHeight_Stand; //  0x824 Size(4)
	float FPSK_CameraHeight_Crouch; //  0x3390 Size(4)
	float FPSK_CameraHeight_Prone; //  0x1ae0 Size(4)
	Unknown FPSK_CameraLocation_Collide; //  0x103c Size(c)
	Unknown FPSK_CameraLocation_LeftLeanDelta; //  0x263c Size(c)
	Unknown FPSK_CameraLocation_RightLeanDelta; //  0xff4 Size(c)
	float FPSK_CameraLocation_CollideAlpha; //  0x2a68 Size(4)
	Unknown FPSK_StartCameraHeight; //  0x2530 Size(c)
	Unknown FPSK_DestCameraHeight; //  0xaf0 Size(c)
	Unknown FPSK_WeaponShadow; //  0x37f8 Size(8)
	Unknown FPSK_SightShadow; //  0x27e0 Size(8)
	Unknown FPSK_GripShadow; //  0x1fc8 Size(8)
	Unknown FPSK_MagazineShadow; //  0x12c0 Size(8)
	Unknown FPSK_StockShadow; //  0x1d80 Size(8)
	Unknown FPSK_TacticalAttachmentShadow; //  0x1ce8 Size(8)
	Unknown FPSK_BarrelShadow; //  0x2ef0 Size(8)
	Unknown FPSK_MuzzleShadow; //  0x1aa0 Size(8)
	Unknown FPSK_WeaponAttachments; //  0x3900 Size(10)
	char bFPSK_UseCustomCurv; //  0x9b0 Size(1)
	char bFPSK_IsDefaultTransformUpdated; //  0x9bc Size(1)
	char bFPSK_IsFPSMode; //  0x2639 Size(1)
	Unknown FPSK_CurrentWeaponTransform; //  0x22a0 Size(30)
	Unknown FPSK_IdleWeaponTransform; //  0x2850 Size(30)
	Unknown FPSK_CollideWeaponTransform; //  0x2fb0 Size(30)
	Unknown FPSK_ADS_DefaultWeaponTransform; //  0x34b0 Size(30)
	Unknown FPSK_ADS_TargetWeaponTransform; //  0xdf0 Size(30)
	Unknown FPSK_ADS_DefaultWeaponTransform_BasicSightCache; //  0x2b20 Size(30)
	Unknown FPSK_ADS_DefaultWeaponTransform_; //  0x1d90 Size(30)
	Unknown FPSK_ADS_WeaponTransform; //  0x2cc0 Size(30)
	float FPSK_ADSFOV; //  0x2bd4 Size(4)
	float FPSK_AOSFOV; //  0x3434 Size(4)
	float FPSK_DefaultFOV; //  0x36c8 Size(4)
	float FPSK_CurrentMagnificationFactor; //  0x1100 Size(4)
	float FPSK_TargetMagnificationFactor; //  0x1d30 Size(4)
	Unknown MPC_WeaponFov; //  0x28d8 Size(8)
	Unknown FPSK_CurrentCameraRelativeLocation; //  0xdd4 Size(c)
	float FPSK_ADSAlpha; //  0x31d0 Size(4)
	float FPSK_StartFOV_Delta; //  0x1e18 Size(4)
	float CameraInterpPlayRate; //  0x3570 Size(4)
	float AdsCameraInterpPlayRate; //  0x1dc8 Size(4)
	float FPSK_TargetADSAlpha; //  0xfac Size(4)
	Unknown FPSK_Timeline_Sway_Idle; //  0x2338 Size(98)
	Unknown FPSK_Timeline_Sway_Move; //  0x3038 Size(98)
	Unknown FPSK_Curve_Sway_Idle_Default; //  0x1770 Size(8)
	Unknown FPSK_Curve_Sway_Mov; //  0x11f0 Size(8)
	Unknown FPSK_Curve_Sway_Scale_With_Fov; //  0x20d8 Size(8)
	Unknown FPSK_Curve_Sway_Idle; //  0x2a28 Size(8)
	Unknown FPSK_Curve_Sway_Mov; //  0xd40 Size(8)
	char bUseFPSK_Sway; //  0x1238 Size(1)
	float FPSK_SwayAlpha; //  0x22d0 Size(4)
	float FPSK_SwayAlphaMin; //  0x3820 Size(4)
	float FPSK_SwayAlphaMax; //  0x1544 Size(4)
	float FPSK_SwayScale; //  0xe90 Size(4)
	Unknown FPSK_SwayRotationIdle; //  0x15ec Size(c)
	Unknown FPSK_SwayRotationMove; //  0xed8 Size(c)
	Unknown FPSK_SwayRotationDeltaForSteadyAim; //  0x2d98 Size(c)
	float FPSK_SwayInterpSpeed; //  0x1fc4 Size(4)
	Unknown FPSK_LeanRotation; //  0x123c Size(c)
	Unknown FPSK_LeanLocation; //  0x3148 Size(c)
	Unknown FPSK_CurrentCollideWeaponTransform; //  0x2120 Size(30)
	float FPSK_CollideAlpha; //  0x1878 Size(4)
	float FPSK_CollideAngle; //  0x2bac Size(4)
	float FPSK_CollideAngle_LocalCache; //  0x2900 Size(4)
	char bFPSK_IsCollide; //  0xb8c Size(1)
	Unknown FPSK_Curves_TunnelEffect; //  0x19e8 Size(50)
	float FPSK_TargetFOV; //  0x1088 Size(4)
	Unknown TimerHandle_NoCarLandingDamageToTeam; //  0x27c0 Size(8)
	float InAircraftNearClipPlane; //  0x36ec Size(4)
	Unknown AIBot_SearchedEnemyList; //  0x1b80 Size(10)
	char bEnableCustomDepth; //  0x2f50 Size(1)
	Unknown TimerHandle_HurtCondition; //  0x3030 Size(8)
	float ProneDamageScaleInRedZone; //  0x1e04 Size(4)
	Unknown BlueZoneFreezeEvent; //  0x3170 Size(8)
	Unknown BlueZoneFreezeStopEvent; //  0x1768 Size(8)
	Unknown BlueZoneDroneEvent; //  0x7f8 Size(8)
	Unknown BlueZoneDroneStopEv; //  0x2298 Size(8)
	Unknown SupplyBoxNotifyAlertMe; //  0xb18 Size(8)
	Unknown SupplyBoxNotifyAlertOther; //  0x30d8 Size(8)
	float CheckFreezeDistance; //  0xbf4 Size(4)
	float CheckDroneDistance; //  0x3704 Size(4)
	Unknown DefaultSocketOffset_LeftLeanAMP; //  0x1ca0 Size(c)
	Unknown DefaultSocketOffset_RightLeanAMP; //  0x1a60 Size(c)
	Unknown DefaultSocketOffset_RightAMP; //  0xb30 Size(c)
	Unknown DefaultSocketOffset_LeftAMP; //  0xabc Size(c)
	float DefaultTargetArmLength_AMP; //  0xff0 Size(4)
	float AmplifierFocusDistance; //  0x3250 Size(4)
	Unknown DefaultSocketOffset_LeftLeanHeartBeatSensor; //  0x1d60 Size(c)
	Unknown DefaultSocketOffset_RightLeanHeartBeatSensor; //  0x202c Size(c)
	Unknown DefaultSocketOffset_RightHeartBeatSensor; //  0x27cc Size(c)
	Unknown DefaultSocketOffset_LeftHeartBeatSensor; //  0x2574 Size(c)
	float DefaultTargetArmLength_HeartBeatSensor; //  0x2f44 Size(4)
	float HeartBeatSensorFocusDistance; //  0x1584 Size(4)
	float CameraFocusDistanceAOS; //  0x8b0 Size(4)
	float AirWalkStartTime; //  0xfd8 Size(4)
	Unknown TimerHandle_StopAirWalk; //  0x1ff8 Size(8)
	float AirWalkBestRecord; //  0x1e00 Size(4)
	float AirWalkTotalRecord; //  0x2570 Size(4)
	Unknown AirWalkAudioEvent; //  0x1cf0 Size(8)
	float CurrentAirWalkVelocityZ; //  0x1400 Size(4)
	float AirWalkDuration; //  0x2150 Size(4)
	float AirWalkGravity; //  0x21bc Size(4)
	Unknown PersonalSupplySystemComponent; //  0x3838 Size(8)
	Unknown PrevNetworkSmoothingMode; //  0xb60 Size(1)
	Unknown TimeHandle_SkyDive; //  0x778 Size(8)
	char bActiveCriticalTime; //  0x3828 Size(1)
	float CriticalTimeTickInterval; //  0x22f8 Size(4)
	float CriticalTimeLimitTime; //  0x1790 Size(4)
	Unknown CriticalTimeMeshLocaiton; //  0x2e30 Size(c)
	Unknown CriticalTimeComponentTickIntervals; //  0x32e8 Size(50)
	float ParachuteEnableHieght; //  0x1290 Size(4)
	Unknown ParachuteTriggerBox; //  0x2000 Size(8)
	Unknown CurHit; //  0x3870 Size(88)
	Unknown Curve_Sliding; //  0x9e0 Size(8)
	Unknown ParticleSystem_Sliding; //  0x1308 Size(8)
	Unknown ParticleSystemComponent_Sliding; //  0x1048 Size(8)
	float SlidingStartTime; //  0xdd0 Size(4)
	Unknown GroundStateBeforeSliding; //  0x29fc Size(1)
	Unknown ReplicateIndexPerkMap; //  0x21f0 Size(50)
	int16_t SlidingBuffIndex; //  0x1bb4 Size(2)
	char bPendingStopSliding; //  0x1588 Size(1)
	float RollingStartTime; //  0x376c Size(4)
	Unknown PostProcessWetFogClass; //  0x1960 Size(8)
	Unknown ActiveWetFogAreas; //  0x2de8 Size(10)
	Unknown WetFogInfo; //  0x3458 Size(20)
	Unknown WetFogZoneInfo; //  0xf64 Size(c)
	Unknown TimerHandle_WetFog; //  0xd20 Size(8)
	Unknown PostProcessBlackOutClass; //  0x1108 Size(8)
	Unknown ActivePowerInterruptions; //  0x2dc0 Size(10)
	Unknown BlackOutInfo; //  0xe98 Size(20)
	Unknown TimerHandle_BlackOut; //  0xfe8 Size(8)
	Unknown StartBlackOutAudioEvent; //  0x1b00 Size(8)
	Unknown StartBlackOutParticle; //  0x1620 Size(8)
	Unknown StartBlackOutParticleComponent; //  0xe50 Size(8)
	struct FMulticastInlineDelegate OnSpawnBlackOutDelegate; //  0x2c80 Size(10)
	Unknown PostProcessForceFieldClass; //  0x9f8 Size(8)
	Unknown ActiveForceFields; //  0x3400 Size(10)
	Unknown ForceFieldInfo; //  0x2650 Size(20)
	Unknown TimerHandle_ForceField; //  0x3480 Size(8)
	Unknown SuperBarrierClass; //  0x12a8 Size(8)
	char UsingSimulationBox; //  0x344d Size(1)
	char HiddenSimulationBox; //  0x27dc Size(1)
	float SimulationBoxHeight; //  0x2330 Size(4)
	struct TSoftClassPtr<UObject> SimulationBoxClass; //  0x3588 Size(28)
	struct FMulticastInlineDelegate OnCompleteActiveSkillDelegate; //  0x1a40 Size(10)
	Unknown Bomb; //  0x1fb8 Size(8)
	Unknown StartBomingEvent; //  0x22f0 Size(8)
	char IsBombing; //  0x20e1 Size(1)
	Unknown Bomb; //  0x2ff0 Size(24)
	float AutoAimRadius; //  0x3478 Size(4)
	float AutoAimDistance; //  0xfe4 Size(4)
	char bShowAutoAimDebug; //  0xde0 Size(1)
	Unknown TeleportFxTemplate; //  0x3770 Size(8)
	Unknown TeleportTraceFxTemplate; //  0x24e8 Size(8)
	float TeleportDisappearTime; //  0xd94 Size(4)
	float TeleportAppearTime; //  0x3140 Size(4)
	float RocketJumpGravity; //  0x21b4 Size(4)
	Unknown RocketJumpAudioEvent; //  0xd80 Size(8)
	Unknown RocketJumpLandedAudioEvent; //  0x1af8 Size(8)
	Unknown ParticleSystem_RocketJump; //  0x17a0 Size(8)
	Unknown ParticleSystem_RocketJumpTrail; //  0x808 Size(8)
	Unknown ParticleSystem_RocketJumpLanded; //  0x2f60 Size(8)
	Unknown RocketJumpTrailEffect; //  0xc20 Size(8)
	char bFinishMeteorJump; //  0xbc4 Size(1)
	float MeteorJumpGravity; //  0x1fac Size(4)
	char bMeteorStrikeBlockingHit; //  0x1bd0 Size(1)
	Unknown MeteorGrenadeProjectileClass; //  0x2f28 Size(10)
	Unknown MeteorJumpAudioEvent; //  0x3230 Size(8)
	Unknown MeteorJumpLandedAudioEvent; //  0x7a0 Size(8)
	Unknown ParticleSystem_MeteorJump; //  0x7c0 Size(8)
	Unknown ParticleSystem_MeteorJumpTrail; //  0x2fe8 Size(8)
	Unknown ParticleSystem_MeteorJumpLanded; //  0x2d48 Size(8)
	Unknown MeteorJumpTrailEffect; //  0x2fa8 Size(8)
	Unknown MeteorTarget; //  0x1230 Size(8)
	Unknown ThrownFlashbangs; //  0x32b0 Size(10)
	Unknown ThrownMolotovCocktails; //  0xc78 Size(10)
	Unknown ThrownC4s; //  0x1528 Size(10)
	char bIsUltimateSprint; //  0xab8 Size(1)
	char IgnoreInteraction; //  0x1218 Size(1)
	struct FMulticastInlineDelegate OnChangeCharacterStateDelegate; //  0x2a18 Size(10)
	int32_t LogSize; //  0x1140 Size(4)
	Unknown TimeHandle_RequestBuildingInfo; //  0x1890 Size(8)
	float LogIntervalTime; //  0x1df8 Size(4)
	int32_t LogRequestSize; //  0x3a58 Size(4)
	Unknown LogList; //  0x2e20 Size(10)
	Unknown LogJsonList; //  0x25b8 Size(10)
	Unknown GodEffect1; //  0x2410 Size(8)
	Unknown GodEffect2; //  0x940 Size(8)
	Unknown ParticleSystem_Knockout; //  0x1970 Size(8)
	Unknown RepSimulatedHittedDamage; //  0x31f8 Size(10)
	float FirstTimeHittedDamage; //  0x25f0 Size(4)
	float LastTimeHittedDamage; //  0x11e4 Size(4)
	Unknown GodParticle; //  0x2448 Size(8)
	char NeedFindPersonalSupplyBoxLo; //  0xa00 Size(1)
	int32_t PersonalSupplyBoxRePositionCount; //  0x34a0 Size(4)
	char UsingPersonalSupplyBoxWeightMap; //  0x17b0 Size(1)
	char UsingPersonalSupplyBoxRePosition; //  0x1583 Size(1)
	float PersonalSupplyBoxRePositionDistance; //  0xfb4 Size(4)
	Unknown TimeHandle_Ultimate_Recon; //  0xc48 Size(8)
	Unknown AnimSlot_Ultimate_Recon; //  0x2a70 Size(10)
	char bIsUltimate_Recon; //  0x1b70 Size(1)
	Unknown AvoidHeadShotMontage; //  0x1650 Size(8)
	Unknown SteelHelmetSound; //  0xf40 Size(8)
	Unknown StuntmanRollingDir; //  0x10a8 Size(c)
	float StuntmanStartTime; //  0x162c Size(4)
	Unknown TimerHandle_Stuntman; //  0x3120 Size(8)
	char bNeedToUpdateNitroBoost; //  0x21b0 Size(1)
	float NitroBoostTorqueScale; //  0xd98 Size(4)
	Unknown NitroBoomTargetVehicle; //  0x13f8 Size(8)
	char bNeedToUpdateNitroBoom; //  0x3700 Size(1)
	float NitroBoomDuration; //  0xa9c Size(4)
	char bNeedToDrawNitroBoomTarget; //  0x1368 Size(1)
	Unknown NitroBoomTargetLocation; //  0x2cac Size(c)
	float NitroBoomLastVehicleSetTime; //  0x172c Size(4)
	char bNeedToUpdateUltimate_Driver; //  0x22fc Size(1)
	char bNeedToCheckPlosiveSoundDetection; //  0x79c Size(1)
	Unknown EnteredElevatorRef; //  0x37b0 Size(8)
	float OuterDamage; //  0x780 Size(4)
	Unknown TimerHandle_InOuterArea; //  0x788 Size(8)
	Unknown TimerHandle_UpdateInOuterArea; //  0x790 Size(8)
	struct FMulticastInlineDelegate DelegateCheckSupplyCost; //  0x3218 Size(10)
	Unknown SecuredCache; //  0xfb0 Size(4)
	Unknown DamageCorrectValueByPenetrationDepthCurve; //  0x1d58 Size(8)
	Unknown AircraftFlightRef; //  0x2be0 Size(8)

	void WearItem(Unknown Slot, struct FString UniqueKey, char bUpdateSkeletalMesh); // Function BravoHotelGame.BravoHotelCharacter.WearItem(Final|Native|Public|BlueprintCallable) // <Game+0x1ed2e20>
};

// Class BravoHotelGame.BHPersonalSupplySystemCompo
struct UBHPersonalSupplySystemCompot : UActorComponent {
	Unknown CurrentSupplyBox; //  0xc0 Size(8)
	Unknown CurrentSupplyBoxDummy; //  0xc8 Size(8)
	Unknown SupplyBoxClass; //  0xd0 Size(8)
	Unknown SupplyBoxDummyClass; //  0xd8 Size(8)
	Unknown CurrentAssignmentInfo; //  0xe0 Size(30)
	int32_t CountOpenSupplyBox; //  0x110 Size(4)
	int32_t SupplyBoxCost; //  0x114 Size(4)
	Unknown CurrentPSBState; //  0x118 Size(1)
	Unknown AssignReason; //  0x119 Size(1)
	char ShowPingByHUD; //  0x122 Size(1)

	void StartSpawnFromSpawnInfo(Unknown& Data, char CheckRePosition); // Function BravoHotelGame.BHPersonalSupplySystemCompot.StartSpawnFromSpawnInfo(Final|Native|Public|HasOutParms) // <Game+0x1e4d990>
};

// Class BravoHotelGame.BravoHotelAbilityComponent
struct UBravoHotelAbilityComponent : UActorComponent {
	Unknown DefaultBalanceData; //  0x298 Size(78)
	Unknown CharacterBuffDataKeys; //  0x3f8 Size(50)
	Unknown DefaultFireCell; //  0x660 Size(8)
	float SimulatedTickTime; //  0x460 Size(4)
	Unknown AbilityStates; //  0x188 Size(50)
	Unknown ConditionedAbilityStates; //  0x3a0 Size(50)
	Unknown ConditionStates; //  0x518 Size(50)
	uint64_t ConditionFlags; //  0x450 Size(8)
	Unknown BuffUIInfos; //  0x568 Size(50)
	Unknown CurrentBuffKeys; //  0x6c0 Size(118)
	Unknown CurrentBuffInfos; //  0xe8 Size(50)
	Unknown BuffControls; //  0x468 Size(50)
	Unknown StackBuffInfos; //  0x1e8 Size(10)
	float Loudness; //  0x45c Size(4)
	float LoudnessCrouchRatio; //  0x1f8 Size(4)
	float LoudnessProneRatio; //  0x448 Size(4)
	float LoudnessTime; //  0x668 Size(4)
	Unknown DebugWidgetClass; //  0xd8 Size(8)
	Unknown MaterialEffectInfos; //  0x350 Size(50)
	Unknown MaterialEffectCurve; //  0x288 Size(8)
	Unknown MaterialEffectStrCurve; //  0x290 Size(8)
	Unknown DebugWidget; //  0x1d8 Size(8)
	Unknown WeaponDebugTextWidget; //  0x1e0 Size(8)
	Unknown BuffEventDelegates; //  0x238 Size(50)
	Unknown BuffEndEventDelegates; //  0x670 Size(50)
	Unknown WeaponBuffEventDelegates; //  0x4c8 Size(50)

	void WeaponBuffEventDelegate__DelegateSignature(Unknown& EventType, Unknown& WeaponInfo); // DelegateFunction BravoHotelGame.BravoHotelAbilityComponent.WeaponBuffEventDelegate__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <Game+0x23a73f0>
};

// Class BravoHotelGame.BuffControlState
struct UBuffControlState : Object {
	Unknown ActiveBuffs; //  0x70 Size(10)
	Unknown BravoHotelCharacter; //  0x80 Size(8)
	Unknown BravoHotelAbilityComponent; //  0x88 Size(8)

	void WeaponEventEndCallBack(Unknown& BuffEventType, Unknown& WeaponInfo); // Function BravoHotelGame.BuffControlState.WeaponEventEndCallBack(Final|Native|Public|HasOutParms) // <Game+0x1e61a60>
};

// Class BravoHotelGame.BravoHotelActionComponent
struct UBravoHotelActionComponent : UActorComponent {
	char bWalking; //  0xc8 Size(1)
	char bSprinting; //  0xc8 Size(1)
	char bIsProned; //  0xc8 Size(1)
	char bIsJumping; //  0xc8 Size(1)
	char bIsKicking; //  0xc8 Size(1)
	char bIsAirWalking; //  0xc8 Size(1)
	char bWantsToRocketJump; //  0xc8 Size(1)
	char bWantsToMeteorJump; //  0xc8 Size(1)
	char bWantsToMeteorStrike; //  0xc9 Size(1)
	char bWantsToJetpack; //  0xc9 Size(1)
	char bWantsToJetpackAim; //  0xc9 Size(1)
	char CustomBuoyancySwimMode; //  0xc9 Size(1)
	Unknown LeanState; //  0xca Size(1)
	Unknown FireType; //  0xcb Size(1)
	Unknown ThrowingType; //  0xcc Size(1)
	Unknown ReplicatedAnimMontage; //  0xd0 Size(8)
	Unknown ReplicatedAnimMontage_FPP; //  0xd8 Size(8)
	char bIsSliding; //  0xe0 Size(1)
	char bIsRolling; //  0xe1 Size(1)
	Unknown BravoHotelCharacterMovement; //  0xe8 Size(8)

	void OnRep_ThrowingType(); // Function BravoHotelGame.BravoHotelActionComponent.OnRep_ThrowingType(Final|Native|Protected) // <Game+0x1e62f40>
};

// Class BravoHotelGame.BravoHotelAIPlayerController
struct ABravoHotelAIPlayerController : AAIController {
	float AutoRotateSpeed; //  0x440 Size(4)
	struct FName DefaultWeaponName; //  0x444 Size(8)
	Unknown NearPlayerController; //  0x468 Size(8)
	Unknown NearTargetPawn; //  0x470 Size(8)
	Unknown AttackTargetPawn; //  0x478 Size(8)

	void StartDescenting(); // Function BravoHotelGame.BravoHotelAIPlayerController.StartDescenting(Final|Native|Public|BlueprintCallable) // <Game+0x1e656d0>
};

// Class BravoHotelGame.BravoHotelAircraftBomber
struct ABravoHotelAircraftBomber : UActor {
	Unknown MovementComponent; //  0x310 Size(8)
	int32_t LoopCount; //  0x318 Size(4)

	void OnReset(Unknown& ImpactResult, float Time); // Function BravoHotelGame.BravoHotelAircraftBomber.OnReset(Final|Native|Protected|HasOutParms|BlueprintCallable) // <Game+0x1e65970>
};

// Class BravoHotelGame.BravoHotelAircraftFlight
struct ABravoHotelAircraftFlight : ACharacter {
	Unknown FixedStartingPoint; //  0x5d8 Size(8)
	char bScrambled; //  0x5e0 Size(1)
	Unknown AudioEmitter; //  0x5e8 Size(8)
	Unknown StartFlyingEvent; //  0x5f0 Size(8)
	Unknown StopFlyingEvent; //  0x5f8 Size(8)
	Unknown FlyingSoundHandle; //  0x600 Size(4)
	Unknown Aircrafts; //  0x608 Size(10)
	Unknown AircraftOrdersForEv; //  0x618 Size(10)
	Unknown AircraftOrdersForOddFormation; //  0x628 Size(10)
	Unknown MovementMethod; //  0x638 Size(1)
	float ScramblingDuration; //  0x63c Size(4)
	float ScramblingSpeed; //  0x640 Size(4)
	float DistanceFromBorder; //  0x644 Size(4)
	float SpeedToChangeAltitude; //  0x648 Size(4)
	float TargetAltitude; //  0x64c Size(4)
	float AltitudeFromTargetAtFirst; //  0x650 Size(4)
	Unknown CineCamera; //  0x658 Size(8)
	Unknown AircraftRoot; //  0x660 Size(8)
	Unknown CineParticle; //  0x668 Size(8)
	Unknown CineCameraSpline; //  0x670 Size(8)
	Unknown CineDeltaLocation; //  0x678 Size(c)
	float CineInterpSpeed; //  0x684 Size(4)
	float CineInterpSpeedZ; //  0x688 Size(4)
	Unknown CinePawn; //  0x690 Size(8)
	Unknown CineController; //  0x698 Size(8)
	float CineCameraBlendTime; //  0x6a0 Size(4)
	Unknown CineCameraBlendFunction; //  0x6a4 Size(1)
	float CineCameraBlendExp; //  0x6a8 Size(4)
	char bUseSplineAnimation; //  0x6ac Size(1)
	float SplineAnimationDelayTime; //  0x6b0 Size(4)
	float SplineAnimationTime; //  0x6b4 Size(4)
	Unknown Timeline_SplineInterp; //  0x6c0 Size(98)
	Unknown Curve_SplineInterp; //  0x758 Size(8)
	struct FMulticastInlineDelegate OnStartCinematic; //  0x760 Size(10)
	struct FMulticastInlineDelegate OnEndCinematic; //  0x770 Size(10)
	Unknown CinematicSequenceList; //  0x780 Size(10)
	Unknown LevelSequenceActor; //  0x790 Size(8)
	Unknown OriginLocation; //  0x7a0 Size(c)
	Unknown TargetLocation; //  0x7ac Size(c)
	Unknown SavedRotation; //  0x7b8 Size(c)
	Unknown DescentStartPos; //  0x7c4 Size(8)
	Unknown DescentEndPos; //  0x7cc Size(8)
	Unknown WeightMapInfo; //  0x838 Size(8)
	char bUseUpdateBloom; //  0x868 Size(1)
	float BloomSpeed; //  0x86c Size(4)
	float TargetBloomIntensity; //  0x870 Size(4)
	char IsVisibleStartPoint; //  0x874 Size(1)
	char IsVisibleEndPoint; //  0x875 Size(1)
	char IsVisibleAircraf; //  0x876 Size(1)
	char IsVisibleAircraftLine; //  0x877 Size(1)
	char bWantsToDestroy; //  0x878 Size(1)
	Unknown State; //  0x879 Size(1)

	void UpdateSplineTimeline(float Value); // Function BravoHotelGame.BravoHotelAircraftFlight.UpdateSplineTimeline(Final|Native|Protected) // <Game+0x1e66dd0>
};

// Class BravoHotelGame.BravoHotelAircraftPoint
struct ABravoHotelAircraftPoint : ATargetPoint {
	Unknown NextPoint; //  0x310 Size(8)

	void StartFromHere(Unknown AircraftFlight, int32_t AircraftCount); // Function BravoHotelGame.BravoHotelAircraftPoint.StartFromHere(Final|Native|Public|BlueprintCallable) // <Game+0x1e66ff0>
};

// Class BravoHotelGame.BravoHotelAircraftRouteWidget
struct UBravoHotelAircraftRouteWidget : UUserWidget {
	Unknown AirCraftRef; //  0x2a8 Size(8)

	void UpdateAircraftPosition(Unknown MapCompWidget); // Function BravoHotelGame.BravoHotelAircraftRouteWidget.UpdateAircraftPosition(Final|Native|Public) // <Game+0x1e679a0>
};

// Class BravoHotelGame.BravoHotelAircraftViewer
struct ABravoHotelAircraftViewer : APawn {
	Unknown SpringArm; //  0x380 Size(8)
	Unknown Camera; //  0x388 Size(8)
	float StartYaw; //  0x390 Size(4)

	void StartDescent(); // Function BravoHotelGame.BravoHotelAircraftViewer.StartDescent(Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// Class BravoHotelGame.BravoHotelAliveInfoWidget
struct UBravoHotelAliveInfoWidget : UUserWidget {
	Unknown Canvas_Aircraft; //  0x250 Size(8)
	Unknown T_BoardingCount; //  0x258 Size(8)
	Unknown T_MaxBoardingCount; //  0x260 Size(8)
	Unknown KillAliveInfo; //  0x270 Size(14)

	void UpdateTeamCount(); // Function BravoHotelGame.BravoHotelAliveInfoWidget.UpdateTeamCount(Final|Native|Public) // <Game+0x1e68e80>
};

// Class BravoHotelGame.BravoHotelAmbientSound
struct ABravoHotelAmbientSound : AAkAmbientSound {
	char bUseMultiplePositions; //  0x350 Size(1)
	Unknown RelativeMultiplePositions; //  0x358 Size(10)
	char bUseSynchronization; //  0x368 Size(1)
	float LoopInterval; //  0x36c Size(4)

	void OnEmitterUnregistered(); // Function BravoHotelGame.BravoHotelAmbientSound.OnEmitterUnregistered(Final|Native|Protected) // <Game+0x1e69090>
};

// Class BravoHotelGame.BravoHotelEquippableActor
struct ABravoHotelEquippableActor : UActor {
	Unknown ReplicatedComponent; //  0x310 Size(8)
	Unknown StaticMesh; //  0x318 Size(8)
	Unknown SkelMesh; //  0x320 Size(8)
	Unknown ItemDetailInfo; //  0x328 Size(490)
	float EquipTime_L; //  0x7b8 Size(4)
	float EquipTime_R; //  0x7bc Size(4)
	float UnEquipTime; //  0x7c0 Size(4)
	float EquipAnimationPlayRate_L; //  0x7c4 Size(4)
	float EquipAnimationPlayRate_R; //  0x7c8 Size(4)
	float UnequipAnimationPlayRate; //  0x7cc Size(4)
	char bPendingEquip; //  0x7d0 Size(1)
	char bPendingUnEquip; //  0x7d0 Size(1)
	struct FName OverrideAttachSocketName; //  0x7f8 Size(8)
	struct FName OverrideAttachSocketName_Backpack; //  0x800 Size(8)
	Unknown OverrideEquipAnimMontage_StandSlot; //  0x808 Size(10)
	Unknown OverrideEquipAnimMontage_ProneSlot; //  0x818 Size(10)
	Unknown OverrideUnequipAnimMontage_StandSlot; //  0x828 Size(10)
	Unknown OverrideUnequipAnimMontage_ProneSlot; //  0x838 Size(10)
	char bIsEquipped; //  0x850 Size(1)

	float OnUnEquip(char bPlayUnequipAnimation); // Function BravoHotelGame.BravoHotelEquippableActor.OnUnEquip(Native|Public) // <Game+0x1f18520>
};

// Class BravoHotelGame.BravoHotelWeaponBase
struct ABravoHotelWeaponBase : ABravoHotelEquippableActor {
	Unknown WeaponReplicatedComponent; //  0x948 Size(8)
	Unknown SkelMesh1P; //  0xab8 Size(8)
	Unknown WeaponDataTable; //  0x8c8 Size(10)
	Unknown AttachmentItems; //  0xf90 Size(10)
	Unknown AttachmentItemEnums; //  0xac8 Size(10)
	Unknown IdleHandAnim_3p; //  0x8c0 Size(8)
	Unknown ProneHandAnim_3p; //  0xb80 Size(8)
	Unknown IdleHandAnim_1p; //  0x950 Size(8)
	Unknown IdleHandAnim_Crouch; //  0xe68 Size(8)
	Unknown IdleHandAnim_InVehicle; //  0xfd8 Size(8)
	Unknown AOSAnim; //  0xd10 Size(8)
	Unknown ADSAnim; //  0xac0 Size(8)
	Unknown CollideUpsideAnim; //  0x1038 Size(8)
	Unknown CollideDownsideAnim; //  0x8b8 Size(8)
	Unknown CollideProneAnim; //  0xe18 Size(8)
	char bAlwaysMaxCollideAlpha; //  0xfe8 Size(1)
	char bUseSpecialProneAnimation; //  0x900 Size(1)
	char bDisableHandAnimDuringCollide; //  0x1b78 Size(1)
	char bDisableHandAnimDuringProneCollide; //  0xa58 Size(1)
	Unknown SpecialProneAnimation; //  0xb10 Size(8)
	Unknown SpecialProneAnimation_1P; //  0xe58 Size(8)
	char bUseSpecialSprintAnimation; //  0xe60 Size(1)
	Unknown SpecialSprintAnimation; //  0x958 Size(8)
	Unknown SpecialSprintReadyAnimation; //  0x870 Size(8)
	char bUseSpecialCrouchSprintAnimation; //  0xcd9 Size(1)
	Unknown SpecialCrouchSprintAnimatio; //  0xf20 Size(8)
	Unknown SprintAnim_1P; //  0xdb8 Size(8)
	Unknown Anim_SecondaryWeapon_Stand_Idle; //  0xe70 Size(8)
	Unknown Anim_SecondaryWeapon_Crouch_Idle; //  0xff0 Size(8)
	char bUseOneHandSprintAnimation; //  0x1040 Size(1)
	char bDisableHandAnimDuringSprint; //  0xf38 Size(1)
	float AimOffsetMinY_TPP; //  0xb20 Size(4)
	float AimOffsetMaxY_TPP; //  0x8f0 Size(4)
	char bHideMagazineWhenEmpty; //  0xed1 Size(1)
	char bIsTrueDamageWeapon; //  0x940 Size(1)
	Unknown WeaponInfo; //  0x1048 Size(b30)
	Unknown WeaponBaseData; //  0xb88 Size(110)
	Unknown ShiningEffectComponent; //  0x8b0 Size(8)
	Unknown ShiningEffect; //  0xe78 Size(8)
	float LastFireTime; //  0x8e8 Size(4)
	int32_t magazine; //  0x1030 Size(4)
	int32_t BackPackInTotalAmmoCount; //  0xfe4 Size(4)
	int32_t MagazineCapacity; //  0xad8 Size(4)
	float UI_CurrentDamage; //  0xf28 Size(4)
	int32_t UI_CurrentRPM; //  0xdc0 Size(4)
	char bIsPerkWeapon; //  0xe50 Size(1)
	struct FName PerkIndex; //  0xf3c Size(8)
	char bIsNoDamageWeapon; //  0xcd8 Size(1)
	char ProhibitedforUseInVehicle; //  0xf19 Size(1)
	struct FMulticastInlineDelegate OnFireDelegate; //  0xd68 Size(10)
	Unknown CurrentPlayerMontage_1P; //  0xd78 Size(8)
	Unknown CurrentPlayerMontage_3P; //  0xf10 Size(8)
	Unknown CurrentWeaponMontage_1P; //  0x878 Size(8)
	Unknown CurrentWeaponMontage_3P; //  0x8f8 Size(8)
	Unknown CurrentMontageState; //  0x8ec Size(1)
	float PausedMontagePosition; //  0xab0 Size(4)
	Unknown AttachmentInfoModifier; //  0x968 Size(48)
	Unknown TimerHandle_UpdateActorHiddenInGame_TPPOnly; //  0xfd0 Size(8)
	Unknown IdlePositionDeltaArray_FPP; //  0xdc8 Size(50)
	Unknown AOSPositionDeltaArray_FPP; //  0xb28 Size(50)
	float AOSPositionInterpSpeed_FPP; //  0xb7c Size(4)
	char bVisibleAbsolutely; //  0xf18 Size(1)

	void UpdateActorHiddenInGame_TPPOnly(); // Function BravoHotelGame.BravoHotelWeaponBase.UpdateActorHiddenInGame_TPPOnly(Final|Native|Public) // <Game+0x2026670>
};

// Class BravoHotelGame.BravoHotelAmplifier
struct ABravoHotelAmplifier : ABravoHotelWeaponBase {
	float AmplifierLength; //  0x1bd4 Size(4)
	Unknown TimerHandle_OnStartEffectEvent; //  0x1bd8 Size(8)
	Unknown DetectedCharacters; //  0x1be0 Size(10)

	void ServerValidateAmplifierEffect(Unknown TargetCharacter); // Function BravoHotelGame.BravoHotelAmplifier.ServerValidateAmplifierEffect(Net|Native|Event|Public|NetServer|NetValidate) // <Game+0x1e69520>
};

// Class BravoHotelGame.BravoHotelAnimInstance
struct UBravoHotelAnimInstance : UAnimInstance {
	Unknown Character; //  0x2c0 Size(8)
	Unknown CharacterMovementComponent; //  0x658 Size(8)
	char bIsAccelerating; //  0x784 Size(1)
	float ParachuteInputForward; //  0x2f0 Size(4)
	float ParachuteInputRight; //  0x77c Size(4)
	char bIsParachuteLanding; //  0x740 Size(1)
	float Direction; //  0x2ac Size(4)
	char bIsLocallyPlaying; //  0x2a8 Size(1)
	char bIsFreeLook; //  0x311 Size(1)
	char bIsProne; //  0x5f0 Size(1)
	char bIsCrouch; //  0x458 Size(1)
	char bIsMelee; //  0x620 Size(1)
	char bIsJumpAttack; //  0x760 Size(1)
	char bMoving; //  0xc4e Size(1)
	char bIsClimbing; //  0x4d9 Size(1)
	char bIsKnockbackRolling; //  0x63c Size(1)
	int32_t IdleNum; //  0x5a0 Size(4)
	float CastingRemainTime; //  0x778 Size(4)
	char bMovedWhileMontage; //  0x488 Size(1)
	char bIsFallingOrLanding; //  0x6a2 Size(1)
	char bIsSprintStop; //  0x6fc Size(1)
	char bUseSprintAnimation; //  0x290 Size(1)
	char bUseSpecialSprintAnimation; //  0x3b8 Size(1)
	char bUseSpecialCrouchSprintAnimation; //  0x2a9 Size(1)
	char bUseSpecialProneAnimation; //  0x560 Size(1)
	char bUseFallingAnimation; //  0x534 Size(1)
	char bUseVehicleStandAnimation; //  0x7d0 Size(1)
	char bIsAirWalking; //  0x7d8 Size(1)
	char bIsAmplifier; //  0x5e0 Size(1)
	char bIsCriticalTime; //  0x535 Size(1)
	char bIsResuscitating; //  0x3e9 Size(1)
	char bIsInVehicle; //  0x5ac Size(1)
	char bIsVehicleDriver; //  0x7d1 Size(1)
	char bEnableDriverIK_HandL; //  0x622 Size(1)
	char bEnableDriverIK_HandR; //  0x680 Size(1)
	float DriverAimOffsetAlpha; //  0x370 Size(4)
	Unknown VehicleUnarmedAnimIdle; //  0x598 Size(8)
	Unknown VehicleUnarmedAnimStand; //  0x708 Size(8)
	Unknown VehicleAnimIdle; //  0x500 Size(8)
	Unknown VehicleAnimAOS; //  0x378 Size(8)
	Unknown VehicleAnimIdleForMontagePlay; //  0x5f8 Size(8)
	Unknown VehicleAimingAimOffset; //  0xc30 Size(8)
	Unknown VehicleIdleAimOffset; //  0x608 Size(8)
	Unknown VehicleUnderThrowAimOffset; //  0x7c8 Size(8)
	Unknown VehicleAimBlending; //  0x7b0 Size(8)
	Unknown VehicleHandlingIdleAnim; //  0x628 Size(8)
	Unknown VehicleHandlingLeftAnim; //  0x538 Size(8)
	Unknown VehicleHandlingRightAnim; //  0x5b8 Size(8)
	char IsVehicleAimingMotion; //  0x6a1 Size(1)
	float VehicleADSBlendTime; //  0x49c Size(4)
	float VehicleADSBlendDirectTime; //  0x41c Size(4)
	float VehicleAimingBlendTime; //  0x5c4 Size(4)
	float VehicleAimingBlendDirectTime; //  0x42c Size(4)
	char bUseVehicleAimingAimOffset; //  0x591 Size(1)
	float VehicleAOSBlendingAngle; //  0x650 Size(4)
	float VehicleAOSBlendingPlayRate; //  0x5a4 Size(4)
	char bIsHandlebar; //  0x754 Size(1)
	Unknown BS_HandlebarVehicle; //  0x408 Size(8)
	float HandlebarDirection; //  0x530 Size(4)
	float HandlebarSpeed; //  0x73c Size(4)
	char bIsLeftSteering; //  0x6ce Size(1)
	char bIsRightSteering; //  0x6e8 Size(1)
	float LeftSteeringPlayRate; //  0x32c Size(4)
	float RightSteeringPlayRate; //  0x58c Size(4)
	char bIsIdleSteering; //  0x544 Size(1)
	char IsLadderAnim; //  0x76c Size(1)
	char IsPawnOnLadder; //  0x39c Size(1)
	char IsLadderSliding; //  0x6b4 Size(1)
	char LadderIdleMotion; //  0x728 Size(1)
	char LadderIdleIsLeft; //  0x2b4 Size(1)
	float LadderBlendTime; //  0x7a4 Size(4)
	float EvaluateAnimSequence; //  0x724 Size(4)
	Unknown AS_Ladder_Up_Loop; //  0x5c8 Size(8)
	Unknown LadderIKLocation_HandL; //  0x3c4 Size(c)
	Unknown LadderIKLocation_HandR; //  0x330 Size(c)
	Unknown LadderIKLocation_FootL; //  0x57c Size(c)
	Unknown LadderIKLocation_FootR; //  0x48c Size(c)
	char bEnableLadderIK_HandL; //  0x6d8 Size(1)
	char bEnableLadderIK_HandR; //  0xc21 Size(1)
	char bEnableLadderIK_FootL; //  0x6cc Size(1)
	char bEnableLadderIK_FootR; //  0x4e0 Size(1)
	Unknown AimOffset; //  0x474 Size(8)
	char bEnableAimOffset; //  0x418 Size(1)
	char bEnableSprintAimOffset; //  0x698 Size(1)
	char bIsAimingDownside; //  0x428 Size(1)
	float DownsideBlendTime; //  0xc40 Size(4)
	float AimOffsetInterpSpeed; //  0xc00 Size(4)
	char bIsPlayingWeaponMontage; //  0x301 Size(1)
	char bIsPlayingCollideWeaponMontage; //  0x7a0 Size(1)
	char bIsADS; //  0x738 Size(1)
	Unknown CollideUpsideAnim; //  0x748 Size(8)
	Unknown CollideDownsideAnim; //  0x6c0 Size(8)
	Unknown CollideProneAnim; //  0x4b8 Size(8)
	char bIsWeaponColliding; //  0x755 Size(1)
	Unknown WeaponType; //  0x2b6 Size(1)
	Unknown WeaponAnimType; //  0x75f Size(1)
	Unknown SimpleWeaponAnimType; //  0x621 Size(1)
	char bIsEquippingThrowWeapon; //  0x661 Size(1)
	char bIsProneColliding; //  0x663 Size(1)
	Unknown WeaponHandAnim; //  0x798 Size(8)
	Unknown WeaponHandAnim_Crouch; //  0x3f8 Size(8)
	Unknown WeaponHandAnim_Prone; //  0x730 Size(8)
	Unknown WeaponHandAnim_InVehicle; //  0x298 Size(8)
	float WeaponHandAnimAlpha; //  0xc1c Size(4)
	float AOS_Weight; //  0x350 Size(4)
	float AOS_Weight_InterpSpeed; //  0x2e4 Size(4)
	Unknown CurrentAOSAnim; //  0xc10 Size(8)
	Unknown CurrentADSAnim; //  0x568 Size(8)
	Unknown SecondaryWeapon_Stand_Idle; //  0x2f8 Size(8)
	Unknown SecondaryWeapon_Crouch_Idle; //  0x3b0 Size(8)
	Unknown ThrowingWeaponState; //  0x644 Size(1)
	Unknown GrenadeThrowingType; //  0x3e8 Size(1)
	Unknown ThrowingWeapon_Stand_Idle; //  0x2b8 Size(8)
	Unknown ThrowingWeapon_Stand_Idle_Under; //  0x3d8 Size(8)
	Unknown ThrowingWeapon_Stand_PinOff_Idle; //  0xbe8 Size(8)
	Unknown ThrowingWeapon_Stand_PinOff_Idle_Additive; //  0x340 Size(8)
	Unknown ThrowingWeapon_Stand_ThrowUnder_Idle; //  0x3a0 Size(8)
	Unknown ThrowingWeapon_Stand_ThrowUnder_Idle_Additive; //  0x480 Size(8)
	Unknown ThrowingWeapon_Crouch_Idle; //  0x548 Size(8)
	Unknown ThrowingWeapon_Crouch_PinOff_Idle; //  0x4a8 Size(8)
	Unknown ThrowingWeapon_Crouch_PinOff_Idle_Additive; //  0xc38 Size(8)
	Unknown ThrowingWeapon_Crouch_ThrowUnder_Idle; //  0x2d8 Size(8)
	Unknown ThrowingWeapon_Crouch_ThrowUnder_Idle_Additive; //  0x4e8 Size(8)
	Unknown ThrowingWeapon_Prone_Idle; //  0x318 Size(8)
	Unknown ThrowingWeapon_Prone_PinOff_Idle_ThrowOver; //  0x410 Size(8)
	Unknown ThrowingWeapon_Prone_PinOff_Idle_ThrowUnder; //  0x3e0 Size(8)
	Unknown MeleeWeapon_Stand_Idle; //  0x710 Size(8)
	Unknown MeleeWeapon_Crouch_Idle; //  0x280 Size(8)
	Unknown MeleeWeapon_Prone_Idle; //  0x448 Size(8)
	float BS_SprintSpeed; //  0x684 Size(4)
	float BS_IdleSpeed; //  0x43c Size(4)
	float BS_SprintSpeedLimit; //  0x420 Size(4)
	float FallSpeed; //  0x700 Size(4)
	float AimOffsetBlendTime; //  0x4b0 Size(4)
	float UseSprintAnimBlendTime; //  0x594 Size(4)
	float WeaponCollideAlpha; //  0x524 Size(4)
	float WeaponMontageCollideAlpha; //  0x2d0 Size(4)
	float AimOffsetAlpha; //  0x5a8 Size(4)
	float DoorAnimAlpha; //  0x4dc Size(4)
	float FootPosition; //  0x5dc Size(4)
	float FootPositionDirection; //  0x308 Size(4)
	char bUseRightFootAnimation; //  0x76d Size(1)
	float LeanRotation; //  0x450 Size(4)
	float LeanAcceleration; //  0x4a4 Size(4)
	char bLockRotation; //  0x2b5 Size(1)
	Unknown MovementDirection; //  0x33c Size(1)
	Unknown SpecialSprintAnimation; //  0x358 Size(8)
	Unknown SpecialCrouchSprintAnimatio; //  0x348 Size(8)
	Unknown SpecialSprintReadyAnimation; //  0x430 Size(8)
	Unknown SpecialProneAnimation; //  0x268 Size(8)
	Unknown FallingAnimParams; //  0x4c8 Size(c)
	float LeanInAir; //  0x2a0 Size(4)
	Unknown JumpAnimSequence_Unarmed; //  0x648 Size(8)
	Unknown JumpAnimSequence_Rifle; //  0x6e0 Size(8)
	Unknown JumpAnimSequence_Pistol; //  0x6a8 Size(8)
	Unknown JumpAnim_Unarmed_NotMoving; //  0xbf8 Size(8)
	Unknown JumpAnim_Unarmed_Moving; //  0x3f0 Size(8)
	Unknown JumpAnim_Rifle_NotMoving; //  0x668 Size(8)
	Unknown JumpAnim_Rifle_Moving; //  0x320 Size(8)
	Unknown JumpAnim_Pistol_NotMoving; //  0x528 Size(8)
	Unknown JumpAnim_Pistol_Mov; //  0x6f0 Size(8)
	Unknown ToCriticalTime; //  0x7b8 Size(8)
	Unknown CriticalTimeIdle; //  0x5e8 Size(8)
	Unknown Resuscitated; //  0x678 Size(8)
	char bUnderWaterSurface; //  0x5f1 Size(1)
	float SwimDirection; //  0x6a4 Size(4)
	Unknown FinalSwimRotation; //  0x570 Size(c)
	Unknown TurnInPlaceInfo; //  0x7e8 Size(400)
	float TurnInPlaceRepeatTriggerTime; //  0x670 Size(4)
	float TurnInPlaceRepeatTriggerAngle; //  0x3a8 Size(4)
	float TurnInPlaceRepeatTime; //  0x2cc Size(4)
	float TurnInPlaceRepeatAngle; //  0x2d4 Size(4)
	float TurnInPlaceRepeatTimeCrouch; //  0x2e8 Size(4)
	float TurnInPlaceRepeatTimeProne; //  0x71c Size(4)
	float TurnInPlaceBlendInTime; //  0x6b0 Size(4)
	float TurnInPlaceBlendOutTime; //  0x69c Size(4)
	char bTurnInPlaceRepeatCheat; //  0x5e1 Size(1)
	Unknown ParticleSystem_WaterDust; //  0x518 Size(8)
	char bUsePredictedAirTime; //  0x545 Size(1)
	char bHitPredictedInAirTime; //  0x537 Size(1)
	float HitPredictedZ; //  0x454 Size(4)
	float WaterSurfaceHeight; //  0xc08 Size(4)
	float SwimTransformAlpha; //  0x470 Size(4)
	float SprintReadyEnteredTime; //  0x30c Size(4)
	char bCanEnterSprintReadyState; //  0x288 Size(1)
	float DebuffAlpha_Burn_FullBody; //  0x7d4 Size(4)
	float DebuffAlpha_Burn_UpperBody; //  0x328 Size(4)
	float DebuffAlpha_Hurt_Additive; //  0x294 Size(4)
	float DebuffAlpha_Hurt_Layered; //  0x2e0 Size(4)
	float Hurt_Additive_RightHandAlpha; //  0x5c0 Size(4)
	float ExplicitTime_FallingAnim; //  0x274 Size(4)
	char bIsUnarmedHeadBanging; //  0x5e3 Size(1)
	float HeadBangingAlpha; //  0x424 Size(4)
	int32_t HeadBangingAnimIndex; //  0x600 Size(4)
	float HeadBangingCurrentPlayRate; //  0x718 Size(4)
	float DescentForwardPicthMin; //  0x4d4 Size(4)
	float DescentIdlePicthMin; //  0x638 Size(4)
	Unknown DescentBackwardMontage; //  0x390 Size(8)
	float BS_DescentRotationInput; //  0x2ec Size(4)
	float RightArmAnimAlpha; //  0x468 Size(4)
	float ThrowWeaponCookingAnimAlpha; //  0x304 Size(4)
	float EquipAnimAlpha; //  0x554 Size(4)
	float UpperBodySlotAlpha; //  0x6c8 Size(4)
	Unknown CharacterRotationCorrectionValueByLeanState; //  0x764 Size(8)

	char Transition_Swim_ToMovementModeConduit(); // Function BravoHotelGame.BravoHotelAnimInstance.Transition_Swim_ToMovementModeConduit(Final|Native|Public) // <Game+0x1e6cce0>
};

// Class BravoHotelGame.BravoHotelAnimInstanceFPP
struct UBravoHotelAnimInstanceFPP : UAnimInstance {
	Unknown CharacterRef; //  0x268 Size(8)
	Unknown CurrentWeaponRef; //  0x270 Size(8)
	Unknown AnimInstanceRef; //  0x278 Size(8)
	Unknown AnimInstancePostProsessRef; //  0x280 Size(8)
	Unknown MeshComponent_3P; //  0x288 Size(8)
	float DeltaTime; //  0x290 Size(4)
	float CurrentScopeAngle; //  0x294 Size(4)
	Unknown CurrentCameraTransform; //  0x2a0 Size(30)
	Unknown BaseGripAnimation; //  0x2d0 Size(8)
	Unknown WeaponHandAnim; //  0x2d8 Size(8)
	Unknown WeaponSprintAnim; //  0x2e0 Size(8)
	Unknown WeaponType; //  0x2e8 Size(1)
	Unknown WeaponAnimType; //  0x2e9 Size(1)
	Unknown FireType; //  0x2ea Size(1)
	int32_t IdleNum; //  0x2ec Size(4)
	float CharacterDirection; //  0x2f0 Size(4)
	float CharacterSpeed; //  0x2f4 Size(4)
	Unknown SpinePosition; //  0x2f8 Size(c)
	Unknown SpineJointPosition; //  0x304 Size(c)
	Unknown SpineRotation; //  0x310 Size(c)
	char bUpdateProneSlope; //  0x31c Size(1)
	Unknown ProneSlopeRotation; //  0x320 Size(c)
	Unknown ProneRootOffset; //  0x32c Size(c)
	float PrevSurfaceDegrees; //  0x338 Size(4)
	Unknown RecoilVector; //  0x33c Size(c)
	Unknown RecoilRotator; //  0x348 Size(c)
	char bEnableModifySpine; //  0x354 Size(1)
	char bEnableGenderIK; //  0x355 Size(1)
	char bEnableWeaponMontageGenderIK; //  0x356 Size(1)
	float ADSAlpha; //  0x358 Size(4)
	char bIsNoWeapon; //  0x35c Size(1)
	char bIsNoRangedWeapon; //  0x35d Size(1)
	char bUseFirstPersonSM; //  0x35e Size(1)
	char bUseThirdPersonLowerBody; //  0x35f Size(1)
	float BlendTime_NoWeapon; //  0x360 Size(4)
	float BlendTime_ADS; //  0x364 Size(4)
	char bIsFreeLook; //  0x368 Size(1)
	char bIsMoving; //  0x369 Size(1)
	char bIsProne; //  0x36a Size(1)
	char bCrouching; //  0x36b Size(1)
	char bIsSprint; //  0x36c Size(1)
	char bIsJumping; //  0x36d Size(1)
	char bIsSwimming; //  0x36e Size(1)
	char bUnderWaterSurface; //  0x36f Size(1)
	char bIsLandStop; //  0x370 Size(1)
	char bIsAirWalking; //  0x371 Size(1)
	char bIsClimbing; //  0x372 Size(1)
	char bIsADS; //  0x373 Size(1)
	char bIsAOS; //  0x374 Size(1)
	char bIsFiring; //  0x375 Size(1)
	char bUseSpecialProneAnimation; //  0x376 Size(1)
	Unknown SpecialProneAnimation; //  0x378 Size(8)
	char bIsAmplifier; //  0x380 Size(1)
	char bIsReviving; //  0x381 Size(1)
	char bIsKnockedOut; //  0x382 Size(1)
	float CastingRemainTime; //  0x384 Size(4)
	char bHoldWeaponPosition; //  0x388 Size(1)
	char bLastHoldWeaponPosition; //  0x389 Size(1)
	char bUseTPPUpper; //  0x38a Size(1)
	char bEnableHandIK; //  0x38b Size(1)
	char bUseLeftHandIK; //  0x38c Size(1)
	char bIsWeaponAttachedToCamera; //  0x38d Size(1)
	char bUseGrip; //  0x38e Size(1)
	char bUseLeanRotation; //  0x38f Size(1)
	char bAttachWeaponToLHand; //  0x390 Size(1)
	float DisableHandIKTimer; //  0x394 Size(4)
	float AttachWeaponToLHandTimer; //  0x398 Size(4)
	char bUseLeftArmBlendSlot; //  0x39c Size(1)
	float BlendTime_HandIK; //  0x3a0 Size(4)
	struct FName AttachWeaponBoneToLHand; //  0x3a4 Size(8)
	Unknown AttachWeaponToLHandTransform; //  0x3b0 Size(30)
	Unknown AttachLHandIK_Location; //  0x3e0 Size(c)
	Unknown AttachLHandIK_Rotation; //  0x3ec Size(c)
	char bReloading; //  0x3f8 Size(1)
	char bBoltAction; //  0x3f9 Size(1)
	Unknown MovementMode; //  0x3fa Size(1)
	char bIsInVehicle; //  0x3fb Size(1)
	char bIsVehiclePassenger; //  0x3fc Size(1)
	char bIsVehicleDriver; //  0x3fd Size(1)
	Unknown VehicleRef; //  0x400 Size(8)
	float VehicleAimOffsetYaw; //  0x408 Size(4)
	float VehicleAimOffsetPitch; //  0x40c Size(4)
	char bUseHandlebarAnim; //  0x410 Size(1)
	char bUseOnlyRightHandInADS; //  0x411 Size(1)
	Unknown BS_DriverHandleBar; //  0x418 Size(8)
	Unknown VehicleHandlingIdleAnim; //  0x420 Size(8)
	Unknown VehicleHandlingLeftAnim; //  0x428 Size(8)
	Unknown VehicleHandlingRightAnim; //  0x430 Size(8)
	Unknown DriverAimOffsetBasePose; //  0x438 Size(8)
	Unknown DriverAimOffset; //  0x440 Size(8)
	Unknown VehicleLeftHandIK; //  0x450 Size(30)
	Unknown VehicleLeftHandIK_Location; //  0x480 Size(c)
	Unknown VehicleLeftHandIK_Rotation; //  0x48c Size(c)
	Unknown VehicleRightHandIK; //  0x4a0 Size(30)
	Unknown VehicleRightHandIK_Location; //  0x4d0 Size(c)
	Unknown VehicleRightHandIK_Rotation; //  0x4dc Size(c)
	Unknown VehicleLeftFootIK; //  0x4f0 Size(30)
	Unknown VehicleRightFootIK; //  0x520 Size(30)
	char bHasFootIKSocket; //  0x550 Size(1)
	char bUseVehicleLeftHandIK; //  0x551 Size(1)
	char bUseVehicleRightHandIK; //  0x552 Size(1)
	char bIsLeftSteering; //  0x553 Size(1)
	char bIsRightSteering; //  0x554 Size(1)
	float LeftSteeringPlayRate; //  0x558 Size(4)
	float RightSteeringPlayRate; //  0x55c Size(4)
	char bIsIdleSteering; //  0x560 Size(1)
	float DriverIdlePoseBlendAlpha; //  0x564 Size(4)
	float WeaponTransformTimer; //  0x568 Size(4)
	float WeaponTransformMaxTime; //  0x56c Size(4)
	float AOSAlpha; //  0x570 Size(4)
	float SprintSpeedModifier; //  0x574 Size(4)
	Unknown CurrentWeaponWorldTransform; //  0x580 Size(30)
	Unknown LeftHandComponentIK; //  0x5b0 Size(30)
	Unknown RightHandComponentIK; //  0x5e0 Size(30)
	Unknown LeftHandIK_Location; //  0x610 Size(c)
	Unknown LeftHandIK_Rotation; //  0x61c Size(c)
	Unknown RightHandIK_Location; //  0x628 Size(c)
	Unknown RightHandIK_Rotation; //  0x634 Size(c)
	Unknown FemaleLeftHandIKModify; //  0x640 Size(c)
	Unknown IdleCameraPosition; //  0x64c Size(c)
	Unknown LeanRotation; //  0x658 Size(c)
	Unknown ThrowingWeaponType; //  0x664 Size(1)
	Unknown ThrowingWeaponState; //  0x665 Size(1)
	Unknown GrenadeThrowingType; //  0x666 Size(1)
	char bIsUnderThrowType; //  0x667 Size(1)
	Unknown ThrowingWeapon_Stand_Idle; //  0x668 Size(8)
	Unknown ThrowingWeapon_Stand_Idle_Under; //  0x670 Size(8)
	Unknown ThrowingWeapon_Stand_PinOff_Idle; //  0x678 Size(8)
	Unknown ThrowingWeapon_Stand_PinOff_Idle_Additive; //  0x680 Size(8)
	Unknown ThrowingWeapon_Stand_ThrowUnder_Idle; //  0x688 Size(8)
	Unknown ThrowingWeapon_Stand_ThrowUnder_Idle_Additive; //  0x690 Size(8)
	Unknown ThrowingWeapon_Crouch_Idle; //  0x698 Size(8)
	Unknown ThrowingWeapon_Crouch_PinOff_Idle; //  0x6a0 Size(8)
	Unknown ThrowingWeapon_Crouch_PinOff_Idle_Additive; //  0x6a8 Size(8)
	Unknown ThrowingWeapon_Crouch_ThrowUnder_Idle; //  0x6b0 Size(8)
	Unknown ThrowingWeapon_Crouch_ThrowUnder_Idle_Additive; //  0x6b8 Size(8)
	Unknown ThrowingWeapon_Prone_Idle; //  0x6c0 Size(8)
	Unknown ThrowingWeapon_Prone_PinOff_Idle_ThrowOver; //  0x6c8 Size(8)
	Unknown ThrowingWeapon_Prone_PinOff_Idle_ThrowUnder; //  0x6d0 Size(8)
	Unknown MontageListWithoutHandIK; //  0x6d8 Size(10)
	char bIsCold; //  0x6e9 Size(1)
	char bIsBurning; //  0x6ea Size(1)
	float HurtAlpha; //  0x6ec Size(4)
	float HeadBangingAlpha; //  0x6f0 Size(4)
	char bUseFallingAnimation; //  0x6f4 Size(1)

	void UpdateWeaponVariables(); // Function BravoHotelGame.BravoHotelAnimInstanceFPP.UpdateWeaponVariables(Final|Native|Protected) // <Game+0x1e6db70>
};

// Class BravoHotelGame.BravoHotelAnimInstanceParachute
struct UBravoHotelAnimInstanceParachute : UAnimInstance {
	Unknown CharacterRef; //  0x268 Size(8)
	float DeltaTime; //  0x270 Size(4)
	float InputForward; //  0x274 Size(4)
	float InputRight; //  0x278 Size(4)
	Unknown CharacterState; //  0x27c Size(1)
	char bIsDescentFalling; //  0x27d Size(1)
	Unknown LeftHandleTransition; //  0x280 Size(c)
	Unknown RightHandleTransition; //  0x28c Size(c)
	char bNeedToSkipTransitionBlend; //  0x298 Size(1)
	char Transition_InDescentToStart; //  0x299 Size(1)
	char Transition_Stand_NotMovingToMoving; //  0x29a Size(1)
	char Transition_StartToMovement_3; //  0x29b Size(1)
	char Transition_MovementToEnd; //  0x29c Size(1)
	char Transition_EndToInDescent; //  0x29d Size(1)
	Unknown ParachuteSeparationAnim_OnLand; //  0x2a0 Size(8)
	Unknown ParachuteSeparationAnim_OnAir; //  0x2a8 Size(8)
	Unknown SpawnedParachuteActor; //  0x2b0 Size(8)
	float SpawnedParachuteDissolveValue; //  0x2b8 Size(4)
	float SpawnedParachuteDissolveStartTime; //  0x2bc Size(4)
	float SpawnedParachuteDissolveDuration; //  0x2c0 Size(4)
	float ParachuteSpawnTime; //  0x2c4 Size(4)

	void UpdateSpawnedParachute(); // Function BravoHotelGame.BravoHotelAnimInstanceParachute.UpdateSpawnedParachute(Final|Native|Protected) // <Game+0x1e6df40>
};

// Class BravoHotelGame.BravoHotelAnimInstancePostprocess
struct UBravoHotelAnimInstancePostprocess : UAnimInstance {
	Unknown Character; //  0x268 Size(8)
	Unknown CharacterMovementComponent; //  0x270 Size(8)
	float DeltaTime; //  0x278 Size(4)
	Unknown AM_CheckMontageIsPlaying; //  0x280 Size(10)
	Unknown PelvisZOffset; //  0x290 Size(c)
	Unknown LeftFootZOffset; //  0x29c Size(c)
	Unknown RightFootZOffset; //  0x2a8 Size(c)
	Unknown LeftFootRotationOffset; //  0x2b4 Size(c)
	Unknown RightFootRotationOffset; //  0x2c0 Size(c)
	Unknown RootRotationOffset; //  0x2cc Size(c)
	Unknown RootZOffset; //  0x2d8 Size(c)
	char bEnablePelvisZOffset; //  0x2e4 Size(1)
	char bEnableLeftFootIK; //  0x2e5 Size(1)
	char bEnableRightFootIK; //  0x2e6 Size(1)
	float ZOffsetMaxLimit; //  0x2ec Size(4)
	float ZOffsetMinLimit; //  0x2f0 Size(4)
	float RollOffsetMaxLimit; //  0x2f4 Size(4)
	float RollOffsetMinLimit; //  0x2f8 Size(4)
	float PitchOffsetMaxLimit; //  0x2fc Size(4)
	float PitchOffsetMinLimit; //  0x300 Size(4)
	float ZOffsetFastInterpSpeed; //  0x304 Size(4)
	float ZOffsetSlowinterpSpeed; //  0x308 Size(4)
	float RotationOffsetInterpSpeed; //  0x30c Size(4)
	float RootRotationOffsetInterpSpeed; //  0x310 Size(4)
	struct FName LeftFootName; //  0x314 Size(8)
	struct FName RightFootName; //  0x31c Size(8)
	struct FName RootName; //  0x324 Size(8)
	float TraceStartHeight; //  0x32c Size(4)
	float TraceLengthBelowCapsule; //  0x330 Size(4)
	char Enab; //  0x334 Size(1)
	char bDisableHandIK_ByAnimNotifyState; //  0x335 Size(1)
	char IsEquippingNormalGrip; //  0x336 Size(1)
	Unknown IdleHandAnim; //  0x338 Size(8)
	char bIsPlayingWeaponMontage; //  0x340 Size(1)
	char bForceUseGripPose; //  0x341 Size(1)
	Unknown HandL_Location; //  0x344 Size(c)
	Unknown HandL_Rotation; //  0x350 Size(c)
	Unknown Collide_HandR_Rotation; //  0x35c Size(c)
	char bEnableCollideHandR_Rotatio; //  0x368 Size(1)
	float HandR_Rotation_Alpha; //  0x36c Size(4)
	float HandIK_BlendTime; //  0x370 Size(4)
	Unknown GripType; //  0x374 Size(1)
	float LeanValue; //  0x378 Size(4)
	Unknown Spine01_LeanRotation; //  0x37c Size(c)
	Unknown Lowerarm_r_LeanRotation; //  0x388 Size(c)
	Unknown Pelvis_CrouchLeanTranslatioS; //  0x394 Size(c)
	Unknown UpperarmR_LeanRotation; //  0x3a0 Size(c)
	char bUpdateLeanNodes; //  0x3ac Size(1)
	Unknown LeftHandActionPos; //  0x3b0 Size(c)
	Unknown RightHandActionPos; //  0x3bc Size(c)
	char bIsInVehicle; //  0x3c8 Size(1)
	char bUseDriverTwoHandIK; //  0x3c9 Size(1)
	char bEnableDriverIK_HandL; //  0x3ca Size(1)
	char bEnableDriverIK_HandR; //  0x3cb Size(1)
	char bUsePassengerTwoHandIK; //  0x3cc Size(1)
	float VehicleFootIKAlpha; //  0x3d0 Size(4)
	Unknown VehicleLeftHandIK_Location; //  0x3d4 Size(c)
	Unknown VehicleLeftHandIK_Rotation; //  0x3e0 Size(c)
	Unknown VehicleRightHandIK_Location; //  0x3ec Size(c)
	Unknown VehicleRightHandIK_Rotation; //  0x3f8 Size(c)
	Unknown VehicleLeftFootIK_Location; //  0x404 Size(c)
	Unknown VehicleLeftFootIK_Rotation; //  0x410 Size(c)
	Unknown VehicleRightFootIK_Location; //  0x41c Size(c)
	Unknown VehicleRightFootIK_Rotation; //  0x428 Size(c)
	char bIsParkourArmIK; //  0x434 Size(1)
	char bIsAimingDownside; //  0x435 Size(1)
	char bIsIdleWeaponColliding; //  0x436 Size(1)
	char bIsProneWeaponColliding; //  0x437 Size(1)
	float CollideAlpha; //  0x438 Size(4)
	char Enab; //  0x43c Size(1)
	float LeftFootTarget; //  0x440 Size(4)
	float RightFootTarget; //  0x444 Size(4)
	Unknown LeftFootLocation; //  0x448 Size(c)
	Unknown RightFootLocation; //  0x454 Size(c)
	char bUseTwoHandIK; //  0x47c Size(1)
	Unknown MovementMode; //  0x47d Size(1)
	Unknown CustomMovementMode; //  0x47e Size(1)
	Unknown JointTargetLocationR; //  0x480 Size(c)
	Unknown JointTargetLocationL; //  0x48c Size(c)
	Unknown EffectorLocationR; //  0x498 Size(c)
	Unknown PakourIKLocationR; //  0x4a4 Size(c)
	Unknown PakourIKLocationL; //  0x4b0 Size(c)
	char bIsProned; //  0x4bc Size(1)
	Unknown Pelvis_LeanTranslation; //  0x4c0 Size(c)
	char bIsCrouch; //  0x4cc Size(1)
	char bIsLocallyControlled; //  0x4cd Size(1)
	char IsEquippingRangedWeapon; //  0x4ce Size(1)
	Unknown UpperarmL_LeanRotation; //  0x4d0 Size(c)
	char LeanLeftSide; //  0x4dc Size(1)
	char bIsOneHandSprint; //  0x4dd Size(1)
	float OneHandSprintLastTime; //  0x4e0 Size(4)
	char bEnableAnimDynamics; //  0x4e4 Size(1)
	char bUsePonytailDynamics; //  0x4e5 Size(1)
	float PonytailDynamicsAlpha; //  0x4e8 Size(4)
	char bUseHairDynamics; //  0x4ec Size(1)
	float HairDynamicsAlpha; //  0x4f0 Size(4)
	char bUseSkirtDynamics; //  0x4f4 Size(1)
	float SkirtDynamicsAlpha; //  0x4f8 Size(4)
	char bUseBackpackDynamics; //  0x4fc Size(1)
	float BackpackDynamicsAlpha; //  0x500 Size(4)
	char bUseBreastDynamics; //  0x504 Size(1)
	char bUseCoatDynamics; //  0x505 Size(1)
	char bUseGhillieDynamics; //  0x506 Size(1)
	float KawaiiAlpha; //  0x508 Size(4)
	float BoneDrivenAlpha; //  0x50c Size(4)
	float TargetKawaiiAlpha; //  0x510 Size(4)
	float TargetBoneDrivenAlpha; //  0x514 Size(4)

	void UpdateAnimDynamicsAlpha(); // Function BravoHotelGame.BravoHotelAnimInstancePostprocess.UpdateAnimDynamicsAlpha(Final|Native|Public) // <Game+0x1e6e9c0>
};

// Class BravoHotelGame.BravoHotelAnimInstanceUsableItem
struct UBravoHotelAnimInstanceUsableItem : UAnimInstance {
	Unknown OwningActorRef; //  0x268 Size(8)
	Unknown CharacterRef; //  0x270 Size(8)
	float DeltaTime; //  0x278 Size(4)
	char bIsCharacterProned; //  0x27c Size(1)
	char bIsThirdPerson; //  0x27d Size(1)
	char bIsOwnerPlayingAnimation; //  0x27e Size(1)
	float AnimStartPosition; //  0x280 Size(4)
	float AnimPlayRate; //  0x284 Size(4)
	float OwnerCastingRemainTime; //  0x288 Size(4)
};

// Class BravoHotelGame.BravoHotelAnimInstanceWeapo
struct UBravoHotelAnimInstanceWeapot : UAnimInstance {
	Unknown CharacterRef; //  0x268 Size(8)
	Unknown WeaponRef; //  0x270 Size(8)
	Unknown CharacterAnimInstance1PRef; //  0x278 Size(8)
	float DeltaTime; //  0x280 Size(4)
	Unknown ArmsOffset; //  0x284 Size(c)
	Unknown RootJointScale; //  0x290 Size(c)
	float ItemRecoilPitchAngle; //  0x29c Size(4)
	float ItemRecoilYawAngle; //  0x2a0 Size(4)
	Unknown CollideRotation; //  0x2a4 Size(c)
	float CollideAlpha; //  0x2b0 Size(4)
	char bIsDefaultTransformUpdated; //  0x2b4 Size(1)
	Unknown SightSocketDeltaLocation; //  0x2b8 Size(c)
	Unknown SightSocketDeltaRotation; //  0x2c4 Size(c)
	char bIsADS; //  0x2d0 Size(1)
	Unknown WeaponLocation; //  0x2d4 Size(c)
	Unknown WeaponRotation; //  0x2e0 Size(c)
	Unknown WeaponTransform; //  0x2f0 Size(30)
	Unknown FireMode; //  0x320 Size(1)
	char bIsAimingDownside; //  0x321 Size(1)
};

// Class BravoHotelGame.BravoHotelAnimNotifyState_AttachWeaponToLHand
struct UBravoHotelAnimNotifyState_AttachWeaponToLHand : UAnimNotifyState {
	struct FName WeaponBone; //  0x30 Size(8)
};

// Class BravoHotelGame.BravoHotelAnimNotifyState_BreakDestructable
struct UBravoHotelAnimNotifyState_BreakDestructable : UAnimNotifyState {
	float UpdateFrequency; //  0x30 Size(4)
	struct FName CheckBoneName; //  0x34 Size(8)
	float TraceRadius; //  0x3c Size(4)
};

// Class BravoHotelGame.BravoHotelAnimNotifyState_Melee
struct UBravoHotelAnimNotifyState_Melee : UAnimNotifyState {
	float UpdateFrequency; //  0x30 Size(4)
	struct FName TraceStartSocketName; //  0x34 Size(8)
	struct FName TraceEndSocketName; //  0x3c Size(8)
	float TraceRadius; //  0x44 Size(4)
	float ApplyDamage_EndTime; //  0x48 Size(4)
};

// Class BravoHotelGame.BravoHotelAnimNotifyState_TimedParticle
struct UBravoHotelAnimNotifyState_TimedParticle : UAnimNotifyState {
	Unknown PSTemplate; //  0x30 Size(8)
	Unknown PSTemplate_OnlyOtherPlayerSee; //  0x38 Size(8)
	struct FName SocketName; //  0x40 Size(8)
	Unknown LocationOffset; //  0x48 Size(c)
	Unknown RotationOffset; //  0x54 Size(c)
	Unknown Scale3D; //  0x60 Size(c)
	char bDestroyAtEnd; //  0x6c Size(1)
};

// Class BravoHotelGame.BravoHotelAnimNotify_AttachMesh
struct UBravoHotelAnimNotify_AttachMesh : UAnimNotify {
	Unknown StaticMesh; //  0x38 Size(28)
	Unknown SkeletalMesh; //  0x60 Size(28)
	char bUsePhysics; //  0x88 Size(1)
	struct FName AttachSocketName; //  0x8c Size(8)
	float AttachDuration; //  0x94 Size(4)
	Unknown ScalarParamDatas; //  0x98 Size(10)
};

// Class BravoHotelGame.BravoHotelAnimNotify_DropMagazine
struct UBravoHotelAnimNotify_DropMagazine : UAnimNotify {
	struct FName WeaponSlotNameForSpawn; //  0x38 Size(8)
	Unknown MagazineClass; //  0x40 Size(8)
};

// Class BravoHotelGame.BravoHotelAnimNotify_PlayCo
struct UBravoHotelAnimNotify_PlayCot : UAnimNotify {
	Unknown ConditionedSound; //  0x38 Size(10)
	char bFollow; //  0x48 Size(1)
	char bPlayOnServer; //  0x49 Size(1)
	char bPlayWhileFalling; //  0x4a Size(1)
	char bPlayOnlyForPawnMesh; //  0x4b Size(1)
	char bPlayOnlyLocalPlayer; //  0x4c Size(1)
	char bForced2D; //  0x4d Size(1)
	char bUseConditionProvider; //  0x4e Size(1)
};

// Class BravoHotelGame.BravoHotelAnimNotify_PlayMo
struct UBravoHotelAnimNotify_PlayMot : UAnimNotify {
	Unknown TargetMontage; //  0x38 Size(8)
	float PlayRate; //  0x40 Size(4)
	struct FName StartSectionName; //  0x44 Size(8)
};

// Class BravoHotelGame.BravoHotelAnimNotify_TimedPostProcess
struct UBravoHotelAnimNotify_TimedPostProcess : UAnimNotify {
	struct FName EffectRowName; //  0x38 Size(8)
	float Duration; //  0x40 Size(4)
	char bFPPOnly; //  0x44 Size(1)
};

// Class BravoHotelGame.BravoHotelAnimNotify_Voice
struct UBravoHotelAnimNotify_Voice : UAnimNotify {
	struct FName SoundIdx; //  0x38 Size(8)
};

// Class BravoHotelGame.BravoHotelAppAudioStateManager
struct UBravoHotelAppAudioStateManager : Object {
	Unknown StateConditionMap; //  0x28 Size(50)
};

// Class BravoHotelGame.BravoHotelAreaSkillZone
struct ABravoHotelAreaSkillZone : UActor {
	Unknown SphereCollision; //  0x310 Size(8)
	Unknown AreaParticle; //  0x318 Size(8)
	Unknown AreaParticleOwner; //  0x320 Size(8)
	Unknown AreaSkillInfo; //  0x328 Size(8)
	Unknown OverlappedCharacters; //  0x330 Size(10)
	Unknown AreaSkillZoneInfo; //  0x340 Size(20)

	void StartDestroy(); // Function BravoHotelGame.BravoHotelAreaSkillZone.StartDestroy(Native|Event|Public|BlueprintEvent) // <Game+0x1e4be10>
};

// Class BravoHotelGame.BravoHotelAreaSkillZoneWetFog
struct ABravoHotelAreaSkillZoneWetFog : ABravoHotelAreaSkillZone {
	Unknown WetFogZoneInfo; //  0x368 Size(c)
	Unknown EffectActiveCharacters; //  0x378 Size(10)

	Unknown GetWetFogZoneInfo(); // Function BravoHotelGame.BravoHotelAreaSkillZoneWetFog.GetWetFogZoneInfo(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game+0x1e71740>
};

// Class BravoHotelGame.BravoHotelCoherentObject
struct UBravoHotelCoherentObject : Object {
	Unknown CoherentWidget; //  0x28 Size(8)
};

// Class BravoHotelGame.BravoHotelArmory
struct UBravoHotelArmory : UBravoHotelCoherentObject {
	Unknown ArmoryMeshMap; //  0x30 Size(50)
	struct FMulticastInlineDelegate ChangeSceneDelegate; //  0x80 Size(10)
	struct FMulticastInlineDelegate MouseEventDelegate; //  0x90 Size(10)
	Unknown ResultInfo; //  0xa0 Size(38)
	int32_t CurrentMaterialCount; //  0xd8 Size(4)
	struct FMulticastInlineDelegate SkipIdentifiedDelegate; //  0xe0 Size(10)
	struct FMulticastInlineDelegate ArmoryTabDelegate; //  0xf0 Size(10)

	void SetHiddenAllArmoryMesh(); // Function BravoHotelGame.BravoHotelArmory.SetHiddenAllArmoryMesh(Final|Native|Public|BlueprintCallable) // <Game+0x1e72a70>
};

// Class BravoHotelGame.BravoHotelArmoryMeshActor
struct ABravoHotelArmoryMeshActor : UActor {
	Unknown ArmoryMesh; //  0x310 Size(8)
	Unknown DefaultTransform; //  0x320 Size(30)
	Unknown LocationOffset; //  0x350 Size(c)
	Unknown RotationOffset; //  0x35c Size(c)
	Unknown ScaleOffset; //  0x368 Size(c)
};

// Class BravoHotelGame.BravoHotelAttachedUsableItem
struct ABravoHotelAttachedUsableItem : UActor {
	Unknown WorldStaticMesh; //  0x310 Size(8)
	Unknown WorldSkelMesh; //  0x318 Size(8)
	Unknown ShadowStaticMesh; //  0x320 Size(8)
	Unknown ShadowSkelMesh; //  0x328 Size(8)
	char bTurnOnPhysicsWhenDetach; //  0x330 Size(1)
	Unknown LoadedAssets; //  0x338 Size(10)

	void OnCompleteAysnLoadItems(Unknown StaticMeshPtr, Unknown SkeletalMeshPtr); // Function BravoHotelGame.BravoHotelAttachedUsableItem.OnCompleteAysnLoadItems(Final|Native|Protected) // <Game+0x1e73dc0>
};

// Class BravoHotelGame.BravoHotelAttackDamageWidget
struct UBravoHotelAttackDamageWidget : UUserWidget {
	Unknown Enemy_DamageFadeIn; //  0x248 Size(8)
	Unknown Enemy_DamageFadeOut; //  0x250 Size(8)
	Unknown Enemy_DamageBroken; //  0x258 Size(8)
	Unknown TimerHandle_EventRemoveWidget; //  0x260 Size(8)
	Unknown PlayerControllerRef; //  0x268 Size(8)
	Unknown WidgetSwitcher_1; //  0x270 Size(8)
	Unknown TextBlock_1; //  0x278 Size(8)
	Unknown TextBlock_3; //  0x280 Size(8)
	Unknown TextBlock_457; //  0x288 Size(8)
	Unknown Image_1; //  0x290 Size(8)
	Unknown Image_2; //  0x298 Size(8)
	Unknown Image_145; //  0x2a0 Size(8)
	Unknown Image_147; //  0x2a8 Size(8)
	Unknown Image_177; //  0x2b0 Size(8)
	Unknown AttackDamageWidgetInfo; //  0x2b8 Size(50)
	char bIsTrueDamage; //  0x308 Size(1)
	char bIsDestructed; //  0x309 Size(1)
	Unknown WidgetLocation; //  0x30c Size(c)
	struct FDelegate Delegate_OnEnemy_DamageFadeIn_Finished; //  0x318 Size(10)
	Unknown Texture_Helmet; //  0x368 Size(8)
	Unknown Texture_HelmetBroken; //  0x370 Size(8)
	Unknown Texture_Chest; //  0x378 Size(8)
	Unknown Texture_ChestBroken; //  0x380 Size(8)
	Unknown Texture_Tire; //  0x388 Size(8)
	Unknown Font_Heavy; //  0x390 Size(8)
	Unknown Font_Regular; //  0x398 Size(8)

	void SetImage(struct FString InHitType); // Function BravoHotelGame.BravoHotelAttackDamageWidget.SetImage(Final|Native|Public) // <Game+0x1e741a0>
};

// Class BravoHotelGame.BravoHotelAttackUserWidget
struct UBravoHotelAttackUserWidget : UUserWidget {
	Unknown Enemy_Lv_Motion_FadeIn; //  0x248 Size(8)
	Unknown Enemy_Lv_Motion_FadeOut; //  0x250 Size(8)
	Unknown TimerHandle_EventRemoveWidget; //  0x258 Size(8)
	Unknown PawnRef; //  0x260 Size(8)
	Unknown Enemy_Name; //  0x268 Size(8)
	Unknown TextBlock_Level; //  0x270 Size(8)
	Unknown TextBlock_Level2; //  0x278 Size(8)
	Unknown TextBlock_Name; //  0x280 Size(8)
	Unknown TextBlock_Name2; //  0x288 Size(8)
	Unknown Image_Icon; //  0x290 Size(8)
	Unknown Image_Icon2; //  0x298 Size(8)

	void EventRemoveWidget(); // Function BravoHotelGame.BravoHotelAttackUserWidget.EventRemoveWidget(Final|Native|Public) // <Game+0x1e74480>
};

// Class BravoHotelGame.BravoHotelAudioAmbientMapData
struct UBravoHotelAudioAmbientMapData : UDataAsset {
	Unknown StateColors; //  0x30 Size(50)
	Unknown NewStateColors; //  0x80 Size(50)
	Unknown WorldSize; //  0xd0 Size(8)
	Unknown WorldCenter; //  0xd8 Size(8)
	Unknown BaseMapSize; //  0xe0 Size(8)
	Unknown BitDataArray; //  0xe8 Size(10)
};

// Class BravoHotelGame.BravoHotelAudioEmitterCompo
struct UBravoHotelAudioEmitterCompot : UAkComponent {
	char bUseEventRadiusAsMinBounds; //  0x488 Size(1)
	float MinBoundsRadius; //  0x48c Size(4)
	struct FMulticastInlineDelegate EmitterRegisteredEv; //  0x4a0 Size(10)
	struct FMulticastInlineDelegate EmitterUnregisteredEvent; //  0x4b0 Size(10)
};

// Class BravoHotelGame.BravoHotelAudioEventDescription
struct UBravoHotelAudioEventDescription : UDataAsset {
	Unknown EventAssetDataMap; //  0x30 Size(50)
};

// Class BravoHotelGame.BravoHotelAudioListenerComponent
struct UBravoHotelAudioListenerComponent : UAkComponent {
	Unknown AmbientMapData; //  0x4c0 Size(8)
};

// Class BravoHotelGame.BravoHotelAudioPortalComponent
struct UBravoHotelAudioPortalComponent : UBoxComponent {
	char bEnable; //  0x4f0 Size(1)
	Unknown InitialState; //  0x4f1 Size(1)

	void OpenPortal(); // Function BravoHotelGame.BravoHotelAudioPortalComponent.OpenPortal(Final|Native|Public|BlueprintCallable) // <Game+0x1e75cc0>
};

// Class BravoHotelGame.BravoHotelAudioRoomComponent
struct UBravoHotelAudioRoomComponent : UAkRoomComponent {
	Unknown ParentMeshComponent; //  0x290 Size(8)
	Unknown OcclusionMethod; //  0x298 Size(4)
	struct FString AmbienceState; //  0x2a0 Size(10)
	char bIsOnRoof; //  0x2b0 Size(1)
	int8_t OcclusionHeightLevel; //  0x2b1 Size(1)
	Unknown OcclusionDepthLevel; //  0x2b2 Size(1)
	Unknown IndoorConditionTargets; //  0x2b3 Size(1)
	int8_t HighestLevelInGroup; //  0x2c8 Size(1)
	Unknown MeshType; //  0x2e1 Size(1)
	int32_t LOD; //  0x2e4 Size(4)
	float WeldingThreshold; //  0x2e8 Size(4)
	Unknown StaticMeshSurfaceOv; //  0x2f0 Size(50)
	Unknown CollisionMeshSurfaceOverride; //  0x340 Size(10)
	char bEnableDiffraction; //  0x350 Size(1)
	char bEnableDiffractionOnBoundaryEdges; //  0x350 Size(1)
	Unknown GeometryData; //  0x358 Size(60)
	Unknown AuxBus; //  0x408 Size(8)
	struct FString AuxBusName; //  0x410 Size(10)
	float SendLevel; //  0x420 Size(4)
	float FadeRate; //  0x424 Size(4)

	void UpdateGeometry(); // Function BravoHotelGame.BravoHotelAudioRoomComponent.UpdateGeometry(Final|Native|Public|BlueprintCallable) // <Game+0x1e76600>
};

// Class BravoHotelGame.BravoHotelAutoMoveSaveGame
struct UBravoHotelAutoMoveSaveGame : USaveGame {
	Unknown StartPos; //  0x28 Size(c)
	Unknown RotationKeyTime; //  0x38 Size(10)
	Unknown RotationData; //  0x48 Size(10)
	Unknown MoveKeyTime; //  0x58 Size(10)
	Unknown MoveData; //  0x68 Size(10)
	Unknown RunKeyTime; //  0x78 Size(10)
	Unknown RunData; //  0x88 Size(10)
	Unknown ActionKeyTime; //  0x98 Size(10)
	Unknown ActionData; //  0xa8 Size(10)
	Unknown ActionLocationData; //  0xb8 Size(10)
};

// Class BravoHotelGame.BravoHotelBaseHUD
struct ABravoHotelBaseHUD : AHUD {
	Unknown MainWidgetClass; //  0x400 Size(8)
	Unknown MainWidget; //  0x408 Size(8)

	Unknown GetMainWidget(char bWantsToCreateIfNull); // Function BravoHotelGame.BravoHotelBaseHUD.GetMainWidget(Native|Public|BlueprintCallable|BlueprintPure) // <Game+0x1e78700>
};

// Class BravoHotelGame.BravoHotelBlueZone
struct ABravoHotelBlueZone : UActor {
	Unknown BlueZoneMesh; //  0x310 Size(8)
	Unknown PainCausingComponent; //  0x318 Size(8)
	Unknown TransportPawnClass; //  0x320 Size(8)
	int32_t CurrentPhase; //  0x328 Size(4)
	Unknown OriginSurvivalCirclePos; //  0x32c Size(c)
	float OriginSurvivalCircleRadius; //  0x338 Size(4)
	Unknown TargetSurvivalCirclePos; //  0x33c Size(c)
	float TargetSurvivalCircleRadius; //  0x348 Size(4)
	float TimeToStartShrinking; //  0x34c Size(4)
	float TimeToEndShrinking; //  0x350 Size(4)
	Unknown eState; //  0x354 Size(1)
	char IsVisibleTargetCircle; //  0x355 Size(1)
	char IsVisibleBlueZone; //  0x356 Size(1)
	Unknown CurrentSurvivalCirclePos; //  0x368 Size(c)
	float CurrentSurvivalCircleRadius; //  0x374 Size(4)
	struct FMulticastInlineDelegate OnBlueZoneStateChanged; //  0x378 Size(10)
	struct FMulticastInlineDelegate OnSurvivalCirclePhaseChanged; //  0x388 Size(10)
	struct FMulticastInlineDelegate OnBlueZoneEnd; //  0x398 Size(10)
	float DefaultRadiusRate; //  0x3a8 Size(4)
	Unknown GameData; //  0x3b0 Size(320)
	char SetVisibleBlueZone; //  0x6d0 Size(1)
	Unknown WeightMapInfo; //  0x6e8 Size(8)
	Unknown InBlueZoneCharacters; //  0x728 Size(10)
	Unknown OutBlueZoneCharacters; //  0x738 Size(10)
	Unknown OuterCirclePos; //  0x798 Size(8)
	struct FName SelectedPlayZoneName; //  0x7a0 Size(8)
	int32_t SelectedPlayZoneInfoIndex; //  0x7a8 Size(4)
	Unknown ClientPlayZonePhaseList; //  0x7b0 Size(10)

	char TryGetCustomCircle(Unknown& OutCenter, float& OutRadius); // Function BravoHotelGame.BravoHotelBlueZone.TryGetCustomCircle(Final|BlueprintCosmetic|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <Game+0x1e877a0>
};

// Class BravoHotelGame.GameRuleInvokerComponent
struct UGameRuleInvokerComponent : UActorComponent {
	char bIsFollowingRule; //  0xb0 Size(1)
};

// Class BravoHotelGame.BravoHotelBlueZoneGameRule
struct UBravoHotelBlueZoneGameRule : UGameRuleInvokerComponent {
	Unknown BluezoneStartEvent; //  0xd0 Size(8)
	Unknown BluezoneEndEvent; //  0xd8 Size(8)

	void OnFollowingChanged(Unknown Checker, char bIsFollowing); // Function BravoHotelGame.BravoHotelBlueZoneGameRule.OnFollowingChanged(Final|Native|Public) // <Game+0x1e87a70>
};

// Class BravoHotelGame.BravoHotelBootyBoxActor
struct ABravoHotelBootyBoxActor : ABravoHotelDropBoxActor {
	Unknown RarityParticle; //  0x390 Size(8)
	Unknown RarityParticleComponent; //  0x398 Size(8)
	Unknown HighestRarityOfCurrentItems; //  0x3a0 Size(1)
	Unknown TimerHandle_Deactiv; //  0x3b0 Size(8)

	void RefreshHighestRarityOfCurrentItems(); // Function BravoHotelGame.BravoHotelBootyBoxActor.RefreshHighestRarityOfCurrentItems(Final|Native|Protected) // <Game+0x1e87ea0>
};

// Class BravoHotelGame.BravoHotelBrokenEquipment
struct ABravoHotelBrokenEquipment : UActor {
	Unknown WorldStaticMesh; //  0x310 Size(8)
	Unknown WorldSkelMesh; //  0x318 Size(8)
	int32_t Equipmentlevel; //  0x320 Size(4)
	Unknown DamageImpulseDir; //  0x324 Size(c)
};

// Class BravoHotelGame.BravoHotelBTServiceDetectTarget
struct UBravoHotelBTServiceDetectTarget : UBTService {
	Unknown BlackboardComponent; //  0x70 Size(8)
};

// Class BravoHotelGame.BravoHotelBuffBase
struct UBravoHotelBuffBase : Object {
	Unknown BravoHotelCharacter; //  0x240 Size(8)
	Unknown BravoHotelAbilityComponent; //  0x248 Size(8)
	Unknown TimerHandles; //  0x280 Size(10)
	Unknown CharacterParticles; //  0x290 Size(10)
	Unknown AttackerPC; //  0x2a0 Size(8)
	Unknown AttackerActor; //  0x2a8 Size(8)

	void SetToEnd(); // Function BravoHotelGame.BravoHotelBuffBase.SetToEnd(Final|Native|Public) // <Game+0x1ea14e0>
};

// Class BravoHotelGame.BHBHeadBanging
struct UBHBHeadBanging : UBHBAddConditionBase {
	float HeadBangingStartTime; //  0x2c8 Size(4)
	float HeadBangingEndTime; //  0x2cc Size(4)
};

// Class BravoHotelGame.BHBDoorBreaching
struct UBHBDoorBreaching : UBravoHotelBuffBase {
	Unknown TimerHandle_EndBuff; //  0x2b8 Size(8)
};

// Class BravoHotelGame.BHBWindowBreaching
struct UBHBWindowBreaching : UBravoHotelBuffBase {
	Unknown TimerHandle_EndBuff; //  0x2b8 Size(8)
};

// Class BravoHotelGame.BHBForceField
struct UBHBForceField : UBravoHotelBuffBase {
	Unknown AnimInstanceArray; //  0x2b8 Size(10)

	void OnExitForceField(); // Function BravoHotelGame.BHBForceField.OnExitForceField(Final|Native|Public) // <Game+0x1ea10d0>
};

// Class BravoHotelGame.BHBReadyToSnipe
struct UBHBReadyToSnipe : UBHBConditionedAbilityModify {
	float MaxReadyToSnipeTime; //  0x3a0 Size(4)
};

// Class BravoHotelGame.BHBCamouflage
struct UBHBCamouflage : UBravoHotelBuffBase {
	struct FString BuffMutableString; //  0x2b8 Size(10)
};

// Class BravoHotelGame.BHBWaterGhillie
struct UBHBWaterGhillie : UBravoHotelBuffBase {
	struct FString BuffMutableString; //  0x2b8 Size(10)
};

// Class BravoHotelGame.BHBMaterialEffectBase
struct UBHBMaterialEffectBase : UBravoHotelBuffBase {
	Unknown CameraPostProcessPreset; //  0x380 Size(8)
	Unknown TargetMeshs; //  0x388 Size(10)

	void MarkRenderStateDirty(Unknown UpdatedCharacter); // Function BravoHotelGame.BHBMaterialEffectBase.MarkRenderStateDirty(Final|Native|Protected) // <Game+0x1ea0f10>
};

// Class BravoHotelGame.BHBWeaponUpgradeEffectBase
struct UBHBWeaponUpgradeEffectBase : UBHBUpgradeMaterialEffectBase {
	Unknown TargetWeapon; //  0x420 Size(8)
};

// Class BravoHotelGame.BHBAdditiveCrosshairBase
struct UBHBAdditiveCrosshairBase : UBravoHotelBuffBase {
	struct FName CrosshairTableRow; //  0x2b8 Size(8)

	char IsNeedToDrawAdditiv(); // Function BravoHotelGame.BHBAdditiveCrosshairBase.IsNeedToDrawAdditiv(Native|Protected) // <Game+0x1ea0da0>
};

// Class BravoHotelGame.BHBUltimate_Recon
struct UBHBUltimate_Recon : UBHBActiveBuffBase {
	int32_t CurrentActiveCount; //  0x2c0 Size(4)
	int32_t MaxActiveCount; //  0x2c4 Size(4)
};

// Class BravoHotelGame.BravoHotelBuilding
struct ABravoHotelBuilding : UActor {
	float ExteriorMaxDrawDistance; //  0x310 Size(4)
	float InteriorMaxDrawDistance; //  0x314 Size(4)
	int32_t ItemWorldSpawnTableIndex; //  0x318 Size(4)
	Unknown ItemWorldSpawnInfo; //  0x320 Size(10)
	Unknown SpawnBoxList; //  0x330 Size(10)
	struct FName SaveDetectingUserName; //  0x340 Size(8)
	Unknown SpawnedItemList; //  0x348 Size(10)
	Unknown LogItemData; //  0x358 Size(a0)
	char IgnorePersonalSpawnBox; //  0x3f8 Size(1)
	char Enab; //  0x3f9 Size(1)
	struct FName AreaSpawnRateTableKey; //  0x3fc Size(8)
	Unknown AreaOverrideStandardGroupDatas; //  0x408 Size(50)
	char Enab; //  0x45b Size(1)

	void PropagateDrawDistanceByTag(); // Function BravoHotelGame.BravoHotelBuilding.PropagateDrawDistanceByTag(Final|Native|Public|BlueprintCallable) // <Game+0x151a800>
};

// Class BravoHotelGame.BravoHotelRemoteController
struct ABravoHotelRemoteController : ABravoHotelWeaponBase {
	Unknown ActiveAnim; //  0x1bd0 Size(10)
	Unknown ActiveSound; //  0x1be0 Size(8)
	Unknown RemoteControlState; //  0x1be8 Size(1)
	int32_t SwitchOnSimulation; //  0x1bec Size(4)

	void SetRemoteControllerState(Unknown NewState); // Function BravoHotelGame.BravoHotelRemoteController.SetRemoteControllerState(Final|Native|Protected) // <Game+0x1fb0720>
};

// Class BravoHotelGame.BravoHotelC4RemoteController
struct ABravoHotelC4RemoteController : ABravoHotelRemoteController {
	Unknown ThrownC4; //  0x1bf0 Size(8)
	float Enab; //  0x1bf8 Size(4)
	float UpdateCheckTime; //  0x1c08 Size(4)
	char bEnableRemoteController; //  0x1c0c Size(1)

	void UpdateCheckDistance(); // Function BravoHotelGame.BravoHotelC4RemoteController.UpdateCheckDistance(Final|Native|Private) // <Game+0x1ea1cd0>
};

// Class BravoHotelGame.BravoHotelCameraComponent
struct UBravoHotelCameraComponent : UCineCameraComponent {
	float ResetCameraMovementFOVThreshold; //  0x978 Size(4)
};

// Class BravoHotelGame.BravoHotelCarKey
struct ABravoHotelCarKey : ABravoHotelRemoteController {
	Unknown FindVehicles; //  0x1bf0 Size(10)
	Unknown CarKeySound; //  0x1c00 Size(8)
	Unknown TimerHandle_Deactiv; //  0x1c08 Size(8)
	Unknown Timer_UpdateUltimateVehicleLocation; //  0x1c10 Size(8)
	Unknown UltimateParticleComponent; //  0x1c18 Size(8)
	Unknown UltimateDecalComponent; //  0x1c20 Size(8)
	Unknown UltimateParticle; //  0x1c28 Size(8)
	Unknown UltimateDecal; //  0x1c30 Size(8)
	Unknown CanSpawnColor; //  0x1c38 Size(50)
	Unknown CannotSpawnColor; //  0x1c88 Size(50)
	float UltimateParticle_DeltaHeight; //  0x1cd8 Size(4)
	Unknown ActiveBuffs; //  0x1ce0 Size(10)
	Unknown UltimateActiveBuffs; //  0x1cf0 Size(10)
	Unknown UltimateSpawnVehicle; //  0x1d00 Size(8)
	Unknown UltimateSpawnVehicleLocatio; //  0x1d08 Size(c)

	void UpdateUltimateVehicleLocation(); // Function BravoHotelGame.BravoHotelCarKey.UpdateUltimateVehicleLocation(Final|Native|Protected) // <Game+0x1ea2670>
};

// Class BravoHotelGame.BHStationaryCharInfo
struct UBHStationaryCharInfo : UActorComponent {
	char bLocalCharacterInReplay; //  0xc0 Size(1)
	Unknown CurrentPerkDeckSelectInfo; //  0xc8 Size(18)
	Unknown SavedPlayerState; //  0xe0 Size(8)
	int32_t ParachuteSkinIndex; //  0xe8 Size(4)
	char bDisconnected; //  0xec Size(1)
	Unknown DisconnectedPlayerState; //  0xf0 Size(8)
	char IsClientTeam; //  0xf8 Size(1)

	void OnRep_ParachuteSkinIndex(); // Function BravoHotelGame.BHStationaryCharInfo.OnRep_ParachuteSkinIndex(Final|Native|Protected) // <Game+0x1ec6470>
};

// Class BravoHotelGame.BHCharacterReplication
struct UBHCharacterReplication : UActorComponent {
	char bIsFreeLook; //  0xc0 Size(1)
	char bFPSK_WantToFPSMode; //  0xc0 Size(1)
	char bIsFlameDamaged; //  0xc0 Size(1)
	char bIsChargingGauge; //  0xc0 Size(1)
	char bIsShowingLandingPosition; //  0xc0 Size(1)
	int32_t KnockOutCount; //  0xc4 Size(4)
	int32_t CriticalTimeCount; //  0xc8 Size(4)
	Unknown ReplicatedStateID; //  0xcc Size(1)
	Unknown CastingItemInfo; //  0xd0 Size(98)
	Unknown SearchInstinctLocation; //  0x168 Size(c)
	Unknown CastingInfo; //  0x178 Size(18)
	Unknown RevivingActor; //  0x190 Size(8)
	Unknown ResuscitatedTargetActor; //  0x198 Size(8)
	Unknown InteractedTargetActor; //  0x1a0 Size(8)
	Unknown Revivers; //  0x1a8 Size(10)
	Unknown Resuscitaters; //  0x1b8 Size(10)
	Unknown OccupyingVehicleSeat; //  0x1c8 Size(8)

	void OnRep_ResuscitatedTargetActor(); // Function BravoHotelGame.BHCharacterReplication.OnRep_ResuscitatedTargetActor(Final|Native|Protected) // <Game+0x1ec64b0>
};

// Class BravoHotelGame.BravoHotelCharacterMovementComponent
struct UBravoHotelCharacterMovementComponent : UCharacterMovementComponent {
	float MoveRightSpeedModifier; //  0x7d0 Size(4)
	float MoveBackSpeedModifier; //  0x724 Size(4)
	float WalkInNoProneWaterSpeedModifier; //  0x80c Size(4)
	float WalkInWaterSpeedModifier; //  0x6e8 Size(4)
	Unknown MoveSlopeSpeedModifierCurve; //  0x700 Size(8)
	float ReduceCharacterSpeedInGrenadeExplosionRangeModifier; //  0x760 Size(4)
	float LastMaxSpeed; //  0x798 Size(4)
	float MaxWalkSpeedProned; //  0x744 Size(4)
	float MaxRunSpeed; //  0x788 Size(4)
	float MaxRunSpeedCrouched; //  0x748 Size(4)
	float MaxRunSpeedProned; //  0x7f0 Size(4)
	float MaxSprintSpeed; //  0x71c Size(4)
	float MaxSprintSpeedCrouched; //  0x7a0 Size(4)
	float MaxSprintSpeedProned; //  0x790 Size(4)
	float MaxWalkSpeedAMP; //  0x728 Size(4)
	float MaxWalkSpeedHeartBeatSensor; //  0x7a8 Size(4)
	float PronedHalfHeight; //  0x7dc Size(4)
	float SwimHalfHeight; //  0x804 Size(4)
	char bCanWalkOffLedgesWhenProning; //  0x708 Size(1)
	char bWantsToProne; //  0x7a4 Size(1)
	char bProneMaintainsBaseLocation; //  0x7cc Size(1)
	char bSwimMaintainsBaseLocation; //  0x708 Size(1)
	float FallingDecelerationDuration; //  0x770 Size(4)
	Unknown SkydivingKValueRange; //  0x70c Size(10)
	Unknown SkydivingPitchRange; //  0x774 Size(10)
	float MaxParachuteSpeed; //  0x7d4 Size(4)
	float ParachuteKValue; //  0x78c Size(4)
	float MaxRocketJumpSpeed; //  0x740 Size(4)
	float DepthWaterNoProne; //  0x73c Size(4)
	float DepthWaterNoCrouch; //  0x784 Size(4)
	float DepthWaterSuface; //  0x800 Size(4)
	float DepthUnderWater; //  0x7bc Size(4)
	float AngleUnderWater; //  0x7ac Size(4)
	float CurrentWaterDepth; //  0x74c Size(4)
	Unknown MoveParameter; //  0x7e4 Size(8)
	float ServerControlRotationInveral; //  0x750 Size(4)
	float ClientNetSendMoveDeltaTimeScaleBySpectator; //  0x7c8 Size(4)
	float LastGroundStateChangedTime; //  0x7c4 Size(4)
	Unknown BravoHotelCharacterOwner; //  0x768 Size(8)
	float ClientServerSyncSpeed; //  0x6f8 Size(4)

	void ServerSetLocationImmediatly(Unknown TargetLocation, Unknown TargetVelocity, float ClientTimeStamp, Unknown ClientMovementMode); // Function BravoHotelGame.BravoHotelCharacterMovementComponent.ServerSetLocationImmediatly(Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // <Game+0x1ed3bf0>
};

// Class BravoHotelGame.BravoHotelCheatManager
struct UBravoHotelCheatManager : UCheatManagerEx {
	Unknown OpenedWidget; //  0x78 Size(8)

	void WeaponDebugText(); // Function BravoHotelGame.BravoHotelCheatManager.WeaponDebugText(Final|Exec|Native|Public|Const) // <Game+0x151a800>
};

// Class BravoHotelGame.BravoHotelCoherentBaseWidget
struct UBravoHotelCoherentBaseWidget : UUserWidget {
	Unknown CoherentWidget; //  0x248 Size(8)
	Unknown AudioEvent; //  0x250 Size(8)
	Unknown ObjectArray; //  0x258 Size(10)
	struct FString WidgetName; //  0x270 Size(10)
	char bInvisibleAfterLoading; //  0x280 Size(1)

	void OnSetLocalSavedSettings(struct FString Settings); // Function BravoHotelGame.BravoHotelCoherentBaseWidget.OnSetLocalSavedSettings(Final|Native|Public) // <Game+0x1edbf20>
};

// Class BravoHotelGame.BravoHotelCoherentTestHUD
struct ABravoHotelCoherentTestHUD : ABravoHotelBaseHUD {
	Unknown MyWidgetClass; //  0x418 Size(8)
	struct FMulticastInlineDelegate ChangeCloseInvenDelegate; //  0x430 Size(10)
	struct FMulticastInlineDelegate ChangeWeaponDelegate; //  0x440 Size(10)
	struct FMulticastInlineDelegate SendTriggerDelegate; //  0x450 Size(10)

	void SendTriggerEvent(struct FString Str, int32_t Value); // Function BravoHotelGame.BravoHotelCoherentTestHUD.SendTriggerEvent(Final|Native|Public|BlueprintCallable) // <Game+0x1edc430>
};

// Class BravoHotelGame.BravoHotelCompassUnitWidget
struct UBravoHotelCompassUnitWidget : UUserWidget {
	float Angle; //  0x248 Size(4)
};

// Class BravoHotelGame.BravoHotelCompassWidget
struct UBravoHotelCompassWidget : UUserWidget {
	float Length; //  0x250 Size(4)
	float ArragnedAngle; //  0x254 Size(4)
	float AngleBetweenUnits; //  0x258 Size(4)
	float DefaultLengthRate; //  0x25c Size(4)
	float AdditionalLengthRate; //  0x260 Size(4)
	Unknown PersonalSupplyBoxMarkerInfo; //  0x278 Size(28)
	Unknown MarkerInfos; //  0x2a0 Size(10)
	Unknown MaterialItemMarkerInfos; //  0x2b0 Size(10)
	Unknown LocalPingMarkerInfos; //  0x2c0 Size(10)
	Unknown ResuscitationMarkerInfos; //  0x2d0 Size(10)
	Unknown ExpertWeaponItemMarkerInfo; //  0x2e0 Size(40)
	Unknown UnitArray; //  0x320 Size(10)
	Unknown UnitArray2; //  0x330 Size(10)
	Unknown ScaleCurve; //  0x340 Size(8)

	Unknown UpdateUnit(float& CurrentAngle, float& CurrentPos, float& WidgetAngle, char& Reset, char IsTest); // Function BravoHotelGame.BravoHotelCompassWidget.UpdateUnit(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x1edf400>
};

// Class BravoHotelGame.BravoHotelConfirmPopupWidget
struct UBravoHotelConfirmPopupWidget : UUserWidget {
	Unknown ParantWidget; //  0x248 Size(8)
};

// Class BravoHotelGame.BravoHotelConversationCompo
struct UBravoHotelConversationCompot : UActorComponent {
	Unknown ConversationWidgetClass; //  0xc8 Size(8)
	Unknown CurrentConversationWidget; //  0xd0 Size(8)
	struct FName CurrentConversationKey; //  0xd8 Size(8)
	int32_t CurrentSentenceIndex; //  0xe0 Size(4)
	Unknown VoiceChannelInfo; //  0x100 Size(50)

	void StopConversation(); // Function BravoHotelGame.BravoHotelConversationCompot.StopConversation(Final|Native|Public|BlueprintCallable) // <Game+0x1ee0010>
};

// Class BravoHotelGame.BravoHotelCreateCharacterWidget
struct UBravoHotelCreateCharacterWidget : UBravoHotelCoherentBaseWidget {
	Unknown CustomizedCharacterComponent; //  0x298 Size(8)

	void OnReceiveCharacterTab(struct FString ReceiveTab); // Function BravoHotelGame.BravoHotelCreateCharacterWidget.OnReceiveCharacterTab(Final|Native|Private) // <Game+0x1ee0ab0>
};

// Class BravoHotelGame.BravoHotelCrosshair
struct UBravoHotelCrosshair : Object {
	Unknown CrosshairDataMap; //  0x40 Size(50)
	Unknown CrosshairDataMap_ADS; //  0x90 Size(50)

	void OnChangeOption(Unknown& ChangeTypeList); // Function BravoHotelGame.BravoHotelCrosshair.OnChangeOption(Final|Native|Public|HasOutParms) // <Game+0x1ee14e0>
};

// Class BravoHotelGame.BravoHotelCrosshairManager
struct UBravoHotelCrosshairManager : Object {
	Unknown Map; //  0x28 Size(50)
	Unknown AdditiveMap; //  0x78 Size(50)
	Unknown ActiveAdditiveCroshairList; //  0xc8 Size(10)

	void RemoveAdditiveCrosshair(struct FName& CrosshairRowName); // Function BravoHotelGame.BravoHotelCrosshairManager.RemoveAdditiveCrosshair(Final|Native|Public|HasOutParms) // <Game+0x1ee19d0>
};

// Class BravoHotelGame.BravoHotelCustomizedCharacter
struct UBravoHotelCustomizedCharacter : UBravoHotelCoherentObject {
	struct FMulticastInlineDelegate MoveLobbyCharacterWearableDelegate; //  0x30 Size(10)
	struct FMulticastInlineDelegate MoveLobbyCharacterAppearanceDelegate; //  0x40 Size(10)
	struct FMulticastInlineDelegate MouseEventDelegate; //  0x50 Size(10)
	struct FString WearableMenu; //  0x60 Size(10)

	void OnPreViewEquipAppearance(struct FString PCLooks); // Function BravoHotelGame.BravoHotelCustomizedCharacter.OnPreViewEquipAppearance(Final|Native|Public) // <Game+0x1ee24c0>
};

// Class BravoHotelGame.BravoHotelCustomizeWardrobeWidget
struct UBravoHotelCustomizeWardrobeWidget : UUserWidget {
	Unknown WearableList; //  0x248 Size(10)
};

// Class BravoHotelGame.BravoHotelCustomMatchWidget
struct UBravoHotelCustomMatchWidget : UUserWidget {
	Unknown Data; //  0x248 Size(1a8)
	Unknown PhaseInfo; //  0x3f0 Size(10)

	void Ok(); // Function BravoHotelGame.BravoHotelCustomMatchWidget.Ok(Final|Native|Public|BlueprintCallable) // <Game+0x151a800>
};

// Class BravoHotelGame.BravoHotelDamageType
struct UBravoHotelDamageType : UDamageType {
	struct FName Name; //  0x40 Size(8)
	Unknown Names; //  0x48 Size(10)
	char bApplyHurtCondition; //  0x58 Size(1)
	char bShouldCalculatePerBoneDamage; //  0x58 Size(1)
	char bSpawnBlood; //  0x58 Size(1)
	char bSpawnDust; //  0x58 Size(1)
	char bPlayDamageEffect; //  0x58 Size(1)
	char bDrawBloodPostProcess; //  0x58 Size(1)
	struct FString IconPath; //  0x60 Size(10)
	Unknown Icon; //  0x70 Size(28)
	struct FText CauserText; //  0x98 Size(18)
	float MultiplyRatio; //  0xb0 Size(4)

	char IsDamageTypeName(struct FName& InName); // Function BravoHotelGame.BravoHotelDamageType.IsDamageTypeName(Final|Native|Public|HasOutParms|Const) // <Game+0x1ee7110>
};

// Class BravoHotelGame.BravoHotelDataManager
struct UBravoHotelDataManager : Object {
	Unknown BattleRoyalGameMode; //  0x3e0 Size(8)
	Unknown ClientLogCharacter; //  0x5b8 Size(8)
};

// Class BravoHotelGame.BravoHotelDebugWidget
struct UBravoHotelDebugWidget : UUserWidget {
	struct FString DebugString; //  0x248 Size(10)
};

// Class BravoHotelGame.BravoHotelDestructibleCompo
struct UBravoHotelDestructibleCompot : UBravoHotelStaticMeshComponent {
	Unknown AllowedDamageType; //  0x570 Size(10)
	char bForceDestructionByVehicleDamage; //  0x580 Size(1)
	float ImpulseStrength; //  0x584 Size(4)
	float hp; //  0x588 Size(4)
	int32_t CurrentHP; //  0x58c Size(4)
	Unknown DestructedSound; //  0x590 Size(8)
	char bIsWindowComponent; //  0x598 Size(1)
	Unknown DestructibleActorClass; //  0x5a0 Size(8)
	Unknown DestructibleMesh; //  0x5a8 Size(28)
	char bIsDestruct; //  0x60d Size(1)

	void SimulatedDestructibleMesh(Unknown HitLocation, Unknown ImpactDirection); // Function BravoHotelGame.BravoHotelDestructibleCompot.SimulatedDestructibleMesh(Final|Native|Protected|HasDefaults|BlueprintCallable) // <Game+0x1f11220>
};

// Class BravoHotelGame.BravoHotelDestructibleEx
struct ABravoHotelDestructibleEx : UActor {
	char bHiddenInReplay; //  0x318 Size(1)

	void HandleInReplay(char bState); // Function BravoHotelGame.BravoHotelDestructibleEx.HandleInReplay(Final|Native|Public|BlueprintCallable) // <Game+0x1f11470>
};

// Class BravoHotelGame.BravoHotelDetectItemSpawnBo
struct UBravoHotelDetectItemSpawnBot : UBoxComponent {
	Unknown SpawnItemList; //  0x4e0 Size(10)
	float CheckItemSpawnDistance; //  0x504 Size(4)
	float CheckUnImportanttemSpawnDistance; //  0x508 Size(4)

	void SpawnItems(Unknown Box, Unknown& ItemsToSpawn); // Function BravoHotelGame.BravoHotelDetectItemSpawnBot.SpawnItems(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x1f11ec0>
};

// Class BravoHotelGame.BravoHotelDevelopmentBlackMarket
struct UBravoHotelDevelopmentBlackMarket : UUserWidget {
	Unknown WeaponList; //  0x248 Size(10)
	Unknown AmmoList; //  0x258 Size(10)
	Unknown AttachmentList; //  0x268 Size(10)
	Unknown WearableList; //  0x278 Size(10)
	Unknown ConsumableList; //  0x288 Size(10)
	Unknown CustomList; //  0x298 Size(10)
	Unknown VehicleList; //  0x2a8 Size(10)
	Unknown GearList; //  0x2b8 Size(10)
	Unknown PerkList; //  0x2c8 Size(10)
	Unknown PresetList; //  0x2d8 Size(10)

	void SortListForDevelopment(Unknown TabType); // Function BravoHotelGame.BravoHotelDevelopmentBlackMarket.SortListForDevelopment(Final|Native|Public|BlueprintCallable) // <Game+0x1f13770>
};

// Class BravoHotelGame.BravoHotelDoor
struct ABravoHotelDoor : UActor {
	Unknown RootNode; //  0x318 Size(8)
	Unknown MoveNode; //  0x320 Size(8)
	Unknown StaticMesh; //  0x328 Size(8)
	Unknown PlayerInteractiveBox; //  0x330 Size(8)
	Unknown PushBox; //  0x338 Size(8)
	Unknown ForwardArrow; //  0x340 Size(8)
	float InDoorNetCullDistanceSquared; //  0x348 Size(4)
	float OutDoorNetCullDistanceSquared; //  0x34c Size(4)
	Unknown DestructibleMesh; //  0x350 Size(8)
	Unknown DestructibleMeshTest; //  0x358 Size(8)
	Unknown DestructibleMeshRef; //  0x360 Size(28)
	char bIsDestructible; //  0x388 Size(1)
	float MaxHp; //  0x38c Size(4)
	float CurrentHP; //  0x390 Size(4)
	char bIsMeshCreated; //  0x394 Size(1)
	Unknown ChunkCount; //  0x395 Size(1)
	Unknown DestructPointStack; //  0x398 Size(10)
	Unknown DestructedPoint; //  0x3a8 Size(10)
	char bOverrideMaterial; //  0x3b8 Size(1)
	Unknown DestructibleMaterial; //  0x3c0 Size(8)
	Unknown TimerHandle_DestroyComponents; //  0x3c8 Size(8)
	Unknown FadeAlphaCurve; //  0x3d0 Size(8)
	Unknown FadeTimeline; //  0x3d8 Size(98)
	Unknown FadeMaterial; //  0x470 Size(8)
	Unknown DoorState; //  0x478 Size(1)
	char bIsOpenedFromFront; //  0x479 Size(1)
	Unknown OpenCurve; //  0x480 Size(8)
	Unknown CloseCurve; //  0x488 Size(8)
	Unknown DefaultDoorRotation; //  0x5c4 Size(c)
	Unknown AkSound_Open; //  0x648 Size(8)
	Unknown AkSound_StartClose; //  0x650 Size(8)
	Unknown AkSound_Melee; //  0x658 Size(8)
	Unknown AKSound_Kicked; //  0x660 Size(8)
	Unknown AKSound_Destructed; //  0x668 Size(8)
	Unknown DoorSoundType; //  0x670 Size(1)
	Unknown AudioPortalComponent; //  0x678 Size(8)
	char bKeepOpenAudioPortal; //  0x680 Size(1)
	Unknown KickedParticle; //  0x688 Size(8)
	Unknown KickedParticleSystem; //  0x690 Size(8)
	float KickImpulseStrength; //  0x698 Size(4)
	Unknown OverlappingPlayersInPushBox; //  0x6b0 Size(10)
	Unknown DamageCorrectValues; //  0x6e8 Size(50)

	void UpdateOpenDoor(float Value); // Function BravoHotelGame.BravoHotelDoor.UpdateOpenDoor(Native|Event|Protected|BlueprintEvent) // <Game+0x1f15430>
};

// Class BravoHotelGame.BravoHotelShellCasing
struct ABravoHotelShellCasing : UActor {
	Unknown StaticMeshComponent; //  0x310 Size(8)
	Unknown ProjectileType; //  0x318 Size(1)
	Unknown HitSurfaceEvent; //  0x320 Size(8)
	int8_t CurrentSoundPlayCount; //  0x328 Size(1)
	int8_t MaxSoundPlayCount; //  0x329 Size(1)

	void OnHitSurface(Unknown Surface, Unknown& Location); // Function BravoHotelGame.BravoHotelShellCasing.OnHitSurface(Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable) // <Game+0x1fbd3f0>
};

// Class BravoHotelGame.BravoHotelEjectingClip
struct ABravoHotelEjectingClip : ABravoHotelShellCasing {
	Unknown EjectingSound; //  0x330 Size(8)
};

// Class BravoHotelGame.BravoHotelElevator
struct ABravoHotelElevator : UActor {
	Unknown ElevatorBody; //  0x310 Size(8)
	Unknown DoorList; //  0x318 Size(10)
	Unknown InnerDoorList; //  0x328 Size(10)
	Unknown InnerDoorPivotList; //  0x338 Size(10)
	Unknown TargetDoor; //  0x348 Size(8)
	Unknown CurrentDoor; //  0x350 Size(8)
	Unknown DoorQueue; //  0x358 Size(10)
	Unknown CurrentStateType; //  0x368 Size(1)
	int32_t DefaultDoorID; //  0x36c Size(4)
	float MoveSpeed; //  0x370 Size(4)
	float DefaultDelayTime; //  0x374 Size(4)
	float CurrentDelayTime; //  0x378 Size(4)
	Unknown AkAudioComponent; //  0x380 Size(8)
	Unknown SoundEventForMoving; //  0x388 Size(8)
	Unknown SoundEventForMoved; //  0x390 Size(8)

	void OnRep_SetStateType(); // Function BravoHotelGame.BravoHotelElevator.OnRep_SetStateType(Native|Protected) // <Game+0x1e4be10>
};

// Class BravoHotelGame.BravoHotelElevatorDoor
struct ABravoHotelElevatorDoor : UActor {
	char bDoorUIEnable; //  0x358 Size(1)
	Unknown BoxTrigger; //  0x360 Size(8)
	Unknown PushBox; //  0x368 Size(8)
	Unknown LeftDoorPivot; //  0x370 Size(8)
	Unknown RightDoorPivot; //  0x378 Size(8)
	Unknown ElevatorPivot; //  0x380 Size(8)
	Unknown ElevatorUI; //  0x388 Size(8)
	Unknown ButtonUI; //  0x390 Size(8)
	Unknown CurrentStateType; //  0x398 Size(1)
	int32_t DoorID; //  0x39c Size(4)
	int32_t MatchingDoorID; //  0x3a0 Size(4)
	Unknown LeftOpenLocation; //  0x3a4 Size(c)
	Unknown RightOpenLocation; //  0x3b0 Size(c)
	float DoorSpeed; //  0x3bc Size(4)
	char bCalled; //  0x3c0 Size(1)
	Unknown AkAudioComponent; //  0x3c8 Size(8)
	Unknown SoundEventForOpening; //  0x3d0 Size(8)
	Unknown SoundEventForOpened; //  0x3d8 Size(8)
	Unknown SoundEventForClosing; //  0x3e0 Size(8)
	Unknown SoundEventForClosed; //  0x3e8 Size(8)

	void OnRep_SetStateType(); // Function BravoHotelGame.BravoHotelElevatorDoor.OnRep_SetStateType(Native|Protected) // <Game+0x1e4be10>
};

// Class BravoHotelGame.BravoHotelWebSocket
struct UBravoHotelWebSocket : Object {
	Unknown ParentGameInstance; //  0x28 Size(8)
};

// Class BravoHotelGame.BravoHotelFence
struct ABravoHotelFence : ABravoHotelDestructibleEx {
	Unknown DamageCorrectValues; //  0x328 Size(50)

	char ShouldReplicate(); // Function BravoHotelGame.BravoHotelFence.ShouldReplicate(Event|Protected|BlueprintEvent|Const) // <Game+0x23a73f0>
};

// Class BravoHotelGame.BravoHotelGameBuffSlot
struct UBravoHotelGameBuffSlot : UUserWidget {
	Unknown Image_Buff; //  0x248 Size(8)
	Unknown ProgressBar_Slot; //  0x250 Size(8)
	Unknown BuffUIInfo; //  0x258 Size(98)
	float LastTimer; //  0x2f0 Size(4)

	void UpdateBuff(int32_t KeyIndex, float Timer, float MaxTime); // Function BravoHotelGame.BravoHotelGameBuffSlot.UpdateBuff(Final|Native|Public) // <Game+0x1f19f90>
};

// Class BravoHotelGame.BravoHotelGameInstance
struct UBravoHotelGameInstance : UBravoHotelAppInstance {
	char CharacterTeleport; //  0x250 Size(1)
	char Enab; //  0x251 Size(1)
	char AllowReconnect; //  0x252 Size(1)
	char bIsInHouseDevBuild; //  0x253 Size(1)
	struct FString DefaultFontFamilyAsset; //  0x258 Size(10)
	Unknown DefaultFontFamily; //  0x268 Size(8)
	int32_t LoadingScreenIndex; //  0x270 Size(4)
	Unknown LoadingScreenWidget; //  0x278 Size(8)
	Unknown CurLoadingScreenInfo; //  0x280 Size(40)
	char bWinnerCam; //  0x2c0 Size(1)
	Unknown ForceLoadingType; //  0x2c1 Size(1)
	char bIsPlayingKillCam; //  0x2c2 Size(1)
	int32_t KillerUniquePlayerId; //  0x2c8 Size(4)
	int32_t MyUniquePlayerId; //  0x2cc Size(4)
	struct FMulticastInlineDelegate ReplayListChangedCallBack; //  0x2d0 Size(10)
	char bCheatable; //  0x2e0 Size(1)
	char bEnableMakeAccount; //  0x2e1 Size(1)
	Unknown GameSettingManager; //  0x2e8 Size(8)
	struct FString LoadingScreenWidgetClass; //  0x300 Size(10)
	Unknown CohWidgetList; //  0x368 Size(10)
	struct FString PopupWidgetClass; //  0x458 Size(10)
	struct FMulticastInlineDelegate OnChangedLanguageCallBack; //  0x468 Size(10)
	Unknown Lobb; //  0x480 Size(50)
	Unknown MembangedLanguageCal; //  0x4d0 Size(50)
	Unknown ReconnectWidget; //  0x598 Size(8)

	void UpdateVoiceTalkMember(char bIsLobby); // Function BravoHotelGame.BravoHotelGameInstance.UpdateVoiceTalkMember(Final|Native|Public|BlueprintCallable) // <Game+0x1f1dbb0>
};

// Class BravoHotelGame.BravoHotelLayerBase
struct UBravoHotelLayerBase : Object {
	int32_t ZOrder; //  0x28 Size(4)
	Unknown WidgetList; //  0x30 Size(10)
};

// Class BravoHotelGame.BravoHotelGameMatchEndWidget
struct UBravoHotelGameMatchEndWidget : UUserWidget {
	Unknown CurrentGameResultWidgetMode; //  0x250 Size(1)
	char bIsShowingSimpleResult; //  0x251 Size(1)
	Unknown TimerHandle_ShowSimpleResult; //  0x258 Size(8)
	Unknown SimpleResultData; //  0x270 Size(a8)
	char bIsShowingFinalResult; //  0x318 Size(1)
	Unknown FinalResultData; //  0x319 Size(4)
	Unknown TimerHandle_ShowFinalResult; //  0x320 Size(8)
	char bIsShowingMatchEndAnimation; //  0x338 Size(1)
	Unknown TimerHandle_ShowMatchEndAnimation; //  0x340 Size(8)
	Unknown MatchEndAnimationData; //  0x358 Size(2)

	void ShowSimpleResult(Unknown& SimpleResult, float ShowDelayTime); // Function BravoHotelGame.BravoHotelGameMatchEndWidget.ShowSimpleResult(Final|Native|Public|HasOutParms) // <Game+0x1f1f360>
};

// Class BravoHotelGame.BravoHotelGamePlayStatistics
struct UBravoHotelGamePlayStatistics : Object {
	uint16_t HitScore; //  0x28 Size(2)
	int32_t PickUpCoin; //  0x2c Size(4)
	Unknown ExpPoint; //  0x30 Size(10)
	float TotalDistanceTraveled; //  0x40 Size(4)
	struct FMulticastInlineDelegate OnChangedFinalRankDelegate; //  0x48 Size(10)
	uint16_t FinalRank; //  0x5a Size(2)
	int32_t GainedRP; //  0x5c Size(4)
	Unknown GoldPoint; //  0x60 Size(10)
	Unknown RewardItemList; //  0x70 Size(10)
	Unknown DropedItemList; //  0x80 Size(10)
	float TotalDamage; //  0x90 Size(4)
	float LifeTime; //  0x94 Size(4)

	float GetTotalDistanceTraveled(); // Function BravoHotelGame.BravoHotelGamePlayStatistics.GetTotalDistanceTraveled(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game+0x1f20ae0>
};

// Class BravoHotelGame.BravoHotelGameSingleton
struct UBravoHotelGameSingleton : Object {
	Unknown BravoHotelNetworkManager; //  0x28 Size(8)
	Unknown BravoHotelItemSpawnStatisticManager; //  0x30 Size(8)
	Unknown BravoHotelDataManager; //  0x128 Size(8)
	Unknown BravoHotelReportDataManager; //  0x130 Size(8)
	Unknown BravoHotelOutGameDataManager; //  0x138 Size(8)
	Unknown BravoHotelQuestManager; //  0x140 Size(8)
	Unknown BravoHotelAchievementManager; //  0x148 Size(8)
	Unknown BravoHotelAppAudioStateManager; //  0x158 Size(8)
	Unknown CachedLocalSaves; //  0x178 Size(50)
};

// Class BravoHotelGame.BravoHotelGrenadeWeapon
struct ABravoHotelGrenadeWeapon : ABravoHotelThrowingWeapon {
	Unknown GrenadeProjectileClass; //  0x1bd0 Size(8)
	char bNeedAssistantWeapon; //  0x1bd8 Size(1)
	struct FName StartFireBoneName; //  0x1bdc Size(8)
	Unknown AssistantWeaponClass; //  0x1be8 Size(8)
	struct FName HandSocketName; //  0x1bf0 Size(8)
	float GrenadeDamage; //  0x1bf8 Size(4)
	float GrenadeHitDamage; //  0x1bfc Size(4)
	float GrenadeHitDamageToCharacter; //  0x1c00 Size(4)
	float GrenadeCookingTime; //  0x1c04 Size(4)
	float OverThrowDegreeValue; //  0x1c08 Size(4)
	float UnderThrowDegreeValue; //  0x1c0c Size(4)
	float OverThrowGrenadeVelocity; //  0x1c10 Size(4)
	float UnderThrowGrenadeVelocity; //  0x1c14 Size(4)
	float GrenadeThrowDirectionCorrectionValue; //  0x1c18 Size(4)
	float ThrowVelocityModifierByCharacterMovement; //  0x1c1c Size(4)
	Unknown CookEvent; //  0x1c20 Size(8)
	Unknown ThrowEvent; //  0x1c28 Size(8)
	char bEnableCooking; //  0x1c30 Size(1)
	char bIsCooked; //  0x1c31 Size(1)
	Unknown GrenadeType; //  0x1c32 Size(1)
	Unknown GrenadeState; //  0x1c33 Size(1)
	Unknown ThrowingType; //  0x1c34 Size(1)
	Unknown ProjectileGrenade; //  0x1c38 Size(8)
	char DrawPredictProjectileLine; //  0x1c40 Size(1)
	Unknown FireLocation; //  0x1c44 Size(c)
	Unknown FireDirection; //  0x1c50 Size(c)
	Unknown FireRotation; //  0x1c5c Size(c)
	float FireVelocity; //  0x1c68 Size(4)
	Unknown FireLocationOffset; //  0x1c6c Size(c)
	Unknown FireRotationOffset; //  0x1c78 Size(c)
	float ThrowStartedTime; //  0x1c84 Size(4)
	float OverThrowLocationCompensationValue; //  0x1c88 Size(4)
	float UnderThrowLocationCompensationValue; //  0x1c8c Size(4)
	float RightHandOffset; //  0x1c90 Size(4)
	Unknown FireWeaponLocationOffset; //  0x1c94 Size(c)
	Unknown PredictPathThrowingType; //  0x1ca0 Size(1)
	char bEnableUnderThrow; //  0x1ca1 Size(1)
	float AfterThrowAnimDelay; //  0x1ca4 Size(4)
	Unknown OverThrowGrenade; //  0x1cb8 Size(10)
	Unknown UnderThrowGrenade; //  0x1cc8 Size(10)
	Unknown PinOffGrenade; //  0x1cd8 Size(10)
	Unknown LeverOffGrenade; //  0x1ce8 Size(10)
	Unknown UnderThrow_LeverOffGrenade; //  0x1cf8 Size(10)
	Unknown Crouch_OverThrowGrenade; //  0x1d08 Size(10)
	Unknown Crouch_UnderThrowGrenade; //  0x1d18 Size(10)
	Unknown Crouch_PinOffGrenade; //  0x1d28 Size(10)
	Unknown Crouch_UnderThrow_LeverOffGrenade; //  0x1d38 Size(10)
	Unknown Prone_OverThrow_Lev; //  0x1d48 Size(10)
	Unknown Prone_UnderThrow_LeverOffGrenade; //  0x1d58 Size(10)
	Unknown Prone_OverThrow; //  0x1d68 Size(10)
	Unknown Prone_UnderThrow; //  0x1d78 Size(10)
	Unknown Locomotion_Stand_Idle; //  0x1d88 Size(8)
	Unknown Locomotion_Stand_Idle_Under; //  0x1d90 Size(8)
	Unknown Locomotion_Stand_PinOff_Idle; //  0x1d98 Size(8)
	Unknown Locomotion_Stand_PinOff_Idle_Additive; //  0x1da0 Size(8)
	Unknown Locomotion_Stand_ThrowUnder_Idle; //  0x1da8 Size(8)
	Unknown Locomotion_Stand_ThrowUnder_Idle_Additive; //  0x1db0 Size(8)
	Unknown Locomotion_Crouch_Idle; //  0x1db8 Size(8)
	Unknown Locomotion_Crouch_PinOff_Idle; //  0x1dc0 Size(8)
	Unknown Locomotion_Crouch_PinOff_Idle_Additive; //  0x1dc8 Size(8)
	Unknown Locomotion_Crouch_ThrowUnder_Idle; //  0x1dd0 Size(8)
	Unknown Locomotion_Crouch_ThrowUnder_Idle_Additive; //  0x1dd8 Size(8)
	Unknown Locomotion_Prone_Idle; //  0x1de0 Size(8)
	Unknown Locomotion_Prone_PinOff_Idle_ThrowOver; //  0x1de8 Size(8)
	Unknown Locomotion_Prone_PinOff_Idle_ThrowUnder; //  0x1df0 Size(8)
	Unknown Locomotion_Stand_Idle_1P; //  0x1df8 Size(8)
	Unknown Locomotion_Stand_Idle_Under_1P; //  0x1e00 Size(8)
	Unknown Locomotion_Stand_PinOff_Idle_1P; //  0x1e08 Size(8)
	Unknown Locomotion_Stand_PinOff_Idle_Additive_1P; //  0x1e10 Size(8)
	Unknown Locomotion_Stand_ThrowUnder_Idle_1P; //  0x1e18 Size(8)
	Unknown Locomotion_Stand_ThrowUnder_Idle_Additive_1P; //  0x1e20 Size(8)
	Unknown Locomotion_Crouch_Idle_1P; //  0x1e28 Size(8)
	Unknown Locomotion_Crouch_PinOff_Idle_1P; //  0x1e30 Size(8)
	Unknown Locomotion_Crouch_PinOff_Idle_Additive_1P; //  0x1e38 Size(8)
	Unknown Locomotion_Crouch_ThrowUnder_Idle_1P; //  0x1e40 Size(8)
	Unknown Locomotion_Crouch_ThrowUnder_Idle_Additive_1P; //  0x1e48 Size(8)
	Unknown Locomotion_Prone_Idle_1P; //  0x1e50 Size(8)
	Unknown Locomotion_Prone_PinOff_Idle_ThrowOver_1P; //  0x1e58 Size(8)
	Unknown Locomotion_Prone_PinOff_Idle_ThrowUnder_1P; //  0x1e60 Size(8)
	struct FMulticastInlineDelegate OnChangeThrowingWeaponStateDelegate; //  0x1e68 Size(10)
	struct FMulticastInlineDelegate OnChangeThrowingTypeDelegate; //  0x1e78 Size(10)
	float ThrowingWeaponCameraShakeDelayTime; //  0x1e88 Size(4)
	Unknown ThrowingWeaponCameraShake; //  0x1e90 Size(8)
	float DestroyDelayTime; //  0x1e98 Size(4)
	float ThrowingWeaponCameraShakeScale; //  0x1e9c Size(4)
	Unknown InterpProjectilePredictPathJumpCurve; //  0x1ea0 Size(8)
	Unknown InterpProjectilePredictPathNormalCurve; //  0x1ea8 Size(8)
	Unknown CalcProjectilePredictPathRo; //  0x1eb0 Size(c)
	float ProjectilePredictTime; //  0x1ebc Size(4)
	float FireWeaponDelayTime; //  0x1ec0 Size(4)
	char bOverrideSpawnGrenadeCount; //  0x1ec4 Size(1)
	int32_t OverrideSpawnGrenadeCount; //  0x1ec8 Size(4)
	Unknown PredictTimeHandle; //  0x1ee0 Size(8)
	Unknown PinOffParticle; //  0x1ee8 Size(8)
	int32_t SpawnGrenadeCount; //  0x1ef8 Size(4)
	float SpawnPositionDelta; //  0x1efc Size(4)
	float SpawnRotationDelta; //  0x1f00 Size(4)
	char bEnableGuidedShot; //  0x1f04 Size(1)
	float GuidedShotDistance; //  0x1f08 Size(4)
	float GuidedShotRadius; //  0x1f0c Size(4)
	float FireCorrectLocationHitBlock; //  0x1f10 Size(4)

	void SpawnPinOffParticle(Unknown& SpawnTransform); // Function BravoHotelGame.BravoHotelGrenadeWeapon.SpawnPinOffParticle(Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable) // <Game+0x1f25bb0>
};

// Class BravoHotelGame.BravoHotelHeartBeatSensor
struct ABravoHotelHeartBeatSensor : ABravoHotelWeaponBase {
	float HeartBeatSensorLength; //  0x1bd4 Size(4)
	Unknown TimerHandle_OnStartEffectEvent; //  0x1bd8 Size(8)
	Unknown DetectedCharacters; //  0x1be0 Size(10)

	void ServerValidateHeartBeatSensorEffect(Unknown TargetCharacter); // Function BravoHotelGame.BravoHotelHeartBeatSensor.ServerValidateHeartBeatSensorEffect(Net|Native|Event|Public|NetServer|NetValidate) // <Game+0x1f26030>
};

// Class BravoHotelGame.BravoHotelHIDestructibleComponent
struct UBravoHotelHIDestructibleComponent : UHierarchicalInstancedStaticMeshComponent {
	struct FName MeshClassType; //  0x730 Size(8)
	Unknown AllowedDamageType; //  0x738 Size(10)
	float ImpulseStrength; //  0x748 Size(4)
	Unknown HpList; //  0x750 Size(10)
	Unknown CurrentHpList; //  0x760 Size(10)
	Unknown DestructedSound; //  0x770 Size(8)
	Unknown DestructedEffect; //  0x778 Size(8)
	Unknown EffectPositionDelta; //  0x780 Size(c)
	Unknown EffectRotationDelta; //  0x78c Size(c)
	char bOverrideMaterial; //  0x798 Size(1)
	int32_t DestructibleMaterialIndex; //  0x79c Size(4)
	Unknown DestructibleMaterial; //  0x7a0 Size(8)
	char bIsWindowComponent; //  0x7a8 Size(1)
	Unknown DestructibleActorClass; //  0x7b0 Size(8)
	Unknown DestructibleMesh; //  0x7b8 Size(28)
	Unknown DisableInstanceArray; //  0x848 Size(10)

	void SimulatedDestructibleMesh(Unknown HitLocation, Unknown ImpactDirection, int32_t InstanceIndex); // Function BravoHotelGame.BravoHotelHIDestructibleComponent.SimulatedDestructibleMesh(Final|Native|Protected|HasDefaults|BlueprintCallable) // <Game+0x1f26a50>
};

// Class BravoHotelGame.BravoHotelHISMMesh
struct ABravoHotelHISMMesh : UActor {
	Unknown RootNode; //  0x310 Size(8)
	char ActionLink; //  0x318 Size(1)
};

// Class BravoHotelGame.BravoHotelIconImageWidget
struct UBravoHotelIconImageWidget : UUserWidget {
	Unknown Image_133; //  0x248 Size(8)
	Unknown Icon; //  0x250 Size(8)
	Unknown Bg; //  0x258 Size(8)
	Unknown Overlay_36; //  0x260 Size(8)
	Unknown NewAnimation; //  0x268 Size(8)

	void SetIcon(Unknown ResourceImage, Unknown ItemRarity, char bEffectReinforce); // Function BravoHotelGame.BravoHotelIconImageWidget.SetIcon(Final|Native|Public|BlueprintCallable) // <Game+0x1f415d0>
};

// Class BravoHotelGame.BravoHotelInventoryCharacter
struct ABravoHotelInventoryCharacter : UActor {
	Unknown MutableComponent; //  0x310 Size(8)
	Unknown InventoryCharacterMesh; //  0x318 Size(8)
	Unknown BackgroundWidgetComponent; //  0x320 Size(8)
	Unknown PostProcessComponet; //  0x328 Size(8)
	Unknown LightsRootComponent; //  0x330 Size(8)
	Unknown SpotLight; //  0x338 Size(8)
	Unknown OwnCharacter; //  0x340 Size(8)
	Unknown BodyBaseSkeletalMesh; //  0x348 Size(8)
	Unknown LocationOffset; //  0x360 Size(c)
	Unknown DefaultMeshScale; //  0x36c Size(c)
	Unknown ScreenPosition; //  0x378 Size(8)
	float CharacterFOV; //  0x380 Size(4)
	float MoveScaleModify; //  0x384 Size(4)
	float RotationInterpSpeed; //  0x388 Size(4)
	Unknown DragWidgetClass; //  0x390 Size(8)
	Unknown DragWidget; //  0x398 Size(8)

	void UpdateWeapons(); // Function BravoHotelGame.BravoHotelInventoryCharacter.UpdateWeapons(Final|Native|Public) // <Game+0x1f45020>
};

// Class BravoHotelGame.BravoHotelInventoryHoverWidget
struct UBravoHotelInventoryHoverWidget : UUserWidget {
	Unknown CanvasItemSlotHover; //  0x248 Size(8)
	Unknown CanvasWeaponItemSlotHover; //  0x250 Size(8)
	Unknown CanvasPerkSlotHover; //  0x258 Size(8)
	Unknown CanvasStatSlotHover; //  0x260 Size(8)
	Unknown CanvasMaterialSlotHover; //  0x268 Size(8)
	Unknown CanvasTooltipSlotHover; //  0x270 Size(8)
	char bNeedUpdateHover; //  0x278 Size(1)
	int32_t HoverType; //  0x27c Size(4)

	void HideHoverBP(); // Function BravoHotelGame.BravoHotelInventoryHoverWidget.HideHoverBP(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// Class BravoHotelGame.BravoHotelInventoryPerkSlotWidget
struct UBravoHotelInventoryPerkSlotWidget : UUserWidget {
	Unknown PlayerCharacter; //  0x248 Size(8)
	Unknown PerkInfo; //  0x250 Size(2c)
	char bIsJustVisual; //  0x27c Size(1)
	Unknown OverlayCoolTime; //  0x280 Size(8)
	Unknown TextCoolTime; //  0x288 Size(8)
	Unknown ImgCoolTime; //  0x290 Size(8)
	Unknown Img_Active; //  0x298 Size(8)
};

// Class BravoHotelGame.BravoHotelInventoryPerkWidget
struct UBravoHotelInventoryPerkWidget : UUserWidget {
	Unknown PlayerCharacter; //  0x248 Size(8)
	Unknown UltimatePerkInfo; //  0x250 Size(2c)
	Unknown LastHoverWidget; //  0x280 Size(8)
	Unknown OverlayUltimate; //  0x288 Size(8)
	Unknown VerticalBoxHealth; //  0x290 Size(8)
	Unknown VerticalBoxPower; //  0x298 Size(8)
	Unknown VerticalBoxSpeed; //  0x2a0 Size(8)
	Unknown Over_CoolTime; //  0x2a8 Size(8)
	Unknown T_CoolTime; //  0x2b0 Size(8)
	Unknown IMG_CoolTime; //  0x2b8 Size(8)
	Unknown Img_Active; //  0x2c0 Size(8)
	Unknown IMG_CanActive; //  0x2c8 Size(8)
	Unknown T_RemainCount; //  0x2d8 Size(8)
	char bCanChangePerkDeck; //  0x2e0 Size(1)

	void UpdateUnlockLevel(int32_t NewLevel); // Function BravoHotelGame.BravoHotelInventoryPerkWidget.UpdateUnlockLevel(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// Class BravoHotelGame.BravoHotelInventoryWidget
struct UBravoHotelInventoryWidget : UUserWidget {
	struct FMulticastInlineDelegate WeaponAmmoDelegate; //  0x250 Size(10)

	float WeightGauge(struct FString ItemName, int32_t Quantity, char Ground); // Function BravoHotelGame.BravoHotelInventoryWidget.WeightGauge(Final|Native|Public|BlueprintCallable) // <Game+0x1f46220>
};

// Class BravoHotelGame.BravoHotelPickup
struct ABravoHotelPickup : UActor {
	Unknown BoxComponent; //  0x318 Size(8)
	Unknown SphereComponent; //  0x320 Size(8)
	Unknown WorldStaticMesh; //  0x328 Size(8)
	Unknown WorldSkelMesh; //  0x330 Size(8)
	Unknown AudioComponent; //  0x340 Size(8)
	Unknown ItemInfo; //  0x348 Size(98)
	Unknown DetailItemInfo; //  0x3e0 Size(490)
	Unknown AttachmentItems; //  0x870 Size(10)
	char bDrawDebugInfo; //  0x880 Size(1)
	Unknown LoadedAssets; //  0x888 Size(10)
	char bLoadMesh; //  0x8a1 Size(1)
	char bPlaceOnTheGround; //  0x8a2 Size(1)
	struct FMulticastInlineDelegate OnChangeItemInfoDelegate; //  0x8a8 Size(10)
	char IsSpawnBook; //  0x8b8 Size(1)
	Unknown BookSpawnEffectComponent; //  0x8c0 Size(8)
	Unknown BookSpawnEffect; //  0x8c8 Size(8)
	Unknown RootParticleComponent; //  0x8d0 Size(8)
	Unknown MeshParticleComponent; //  0x8d8 Size(8)
	Unknown PassiveChildParticleComponents; //  0x8e0 Size(10)
	Unknown ActiveChildParticleComponents; //  0x8f0 Size(10)
	Unknown RootParticle; //  0x908 Size(8)

	void UpdateSkelMeshTickEnable(); // Function BravoHotelGame.BravoHotelPickup.UpdateSkelMeshTickEnable(Final|Native|Protected) // <Game+0x1f808d0>
};

// Class BravoHotelGame.BravoHotelItemRecipeTreeWidget
struct UBravoHotelItemRecipeTreeWidget : UUserWidget {
	Unknown ItemRecipeTreeInfo; //  0x248 Size(10)

	void SetTreeInfo(struct FName TopRecipe); // Function BravoHotelGame.BravoHotelItemRecipeTreeWidget.SetTreeInfo(Final|Native|Public|BlueprintCallable) // <Game+0x16b3b30>
};

// Class BravoHotelGame.BravoHotelItemSpawnBoxCompo
struct UBravoHotelItemSpawnBoxCompot : UBoxComponent {
	int32_t BoxID; //  0x4e0 Size(4)
	char UsingRandomRotation; //  0x4e4 Size(1)
	char IsCompleteSpawn; //  0x4e5 Size(1)
	Unknown NoneItem; //  0x588 Size(18)
	Unknown ParentsStandardGroupBoxComponent; //  0x5d0 Size(8)
	Unknown LoadedClasses; //  0x5d8 Size(10)

	void SetBoxComponentID(int32_t ID); // Function BravoHotelGame.BravoHotelItemSpawnBoxCompot.SetBoxComponentID(Final|Native|Public|BlueprintCallable) // <Game+0x1f49e90>
};

// Class BravoHotelGame.BravoHotelItemSpawnDebugWidget
struct UBravoHotelItemSpawnDebugWidget : UUserWidget {
	Unknown WorldCenter; //  0x248 Size(c)
	Unknown WorldSize; //  0x254 Size(8)
	Unknown BaseMapSize; //  0x25c Size(8)
	Unknown RecordInfo; //  0x268 Size(188)
	Unknown ItemDataInfoData; //  0x3f0 Size(e8)
	Unknown SlotList; //  0x4d8 Size(10)
	Unknown BuildingData; //  0x4e8 Size(50)
	Unknown ItemDivisionCnt; //  0x538 Size(50)
	Unknown ItemSpawnCnt; //  0x588 Size(50)
	Unknown ItemRateAddCnt; //  0x5d8 Size(50)
	Unknown ItemRateRemoveCnt; //  0x628 Size(50)
	struct FString SelectedBuildingName; //  0x678 Size(10)
	struct FString SelectedStandardGroupName; //  0x688 Size(10)

	void SetSpawnData(int32_t TotalSpawnCnt, int32_t TotalPickUpCount, int32_t TotalPickUpLimitCount); // Function BravoHotelGame.BravoHotelItemSpawnDebugWidget.SetSpawnData(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// Class BravoHotelGame.BravoHotelItemSpawnRateWidget
struct UBravoHotelItemSpawnRateWidget : UUserWidget {
	struct FName SelectAreaKey; //  0x248 Size(8)
	char IsBlueZoneSpawnRate; //  0x250 Size(1)
	Unknown AreaSpawnRateList; //  0x258 Size(50)
	Unknown BlueZoneSpawnRate; //  0x2a8 Size(28)

	void SetSetting(Unknown& Data); // Function BravoHotelGame.BravoHotelItemSpawnRateWidget.SetSetting(Event|Public|HasOutParms|BlueprintEvent) // <Game+0x23a73f0>
};

// Class BravoHotelGame.BravoHotelItemSpawnSimulationBox
struct ABravoHotelItemSpawnSimulationBox : UActor {
	Unknown SpawnPerkData; //  0x310 Size(60)
	struct FMulticastInlineDelegate OnEndSimulationDelegate; //  0x370 Size(10)
	Unknown PreLocation; //  0x380 Size(c)
	int32_t CheckCount; //  0x38c Size(4)
	int32_t MaxCount; //  0x390 Size(4)
	Unknown Box; //  0x398 Size(8)

	void EndSimulation(Unknown& Location, struct FString Msg); // Function BravoHotelGame.BravoHotelItemSpawnSimulationBox.EndSimulation(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <Game+0x1f4cda0>
};

// Class BravoHotelGame.BravoHotelItemStandardGroupBoxComponent
struct UBravoHotelItemStandardGroupBoxComponent : UBoxComponent {
	Unknown ItemStandardGroupInfo; //  0x4e0 Size(10)
	Unknown AllBoxInfos; //  0x4f0 Size(10)
};

// Class BravoHotelGame.BravoHotelJetpackWidget
struct UBravoHotelJetpackWidget : UUserWidget {
	Unknown GauageProgress; //  0x248 Size(8)
	Unknown GauageText; //  0x250 Size(8)
};

// Class BravoHotelGame.BravoHotelKillcamPlayback
struct UBravoHotelKillcamPlayback : Object {
	Unknown KillcamWorld; //  0x28 Size(8)
	Unknown KillcamWorldPackage; //  0x30 Size(8)
};

// Class BravoHotelGame.BravoHotelKillInfoSlotWidget
struct UBravoHotelKillInfoSlotWidget : UUserWidget {
	float HideTime; //  0x248 Size(4)
	int32_t ArrayIndex; //  0x24c Size(4)
	Unknown ParentWidget; //  0x250 Size(8)

	void SetInfo_BP(int32_t NewArrayIndex, Unknown& Info); // Function BravoHotelGame.BravoHotelKillInfoSlotWidget.SetInfo_BP(Event|Public|HasOutParms|BlueprintEvent) // <Game+0x23a73f0>
};

// Class BravoHotelGame.BravoHotelKillInfoWidget
struct UBravoHotelKillInfoWidget : UUserWidget {
	Unknown SlotWidgetClass; //  0x248 Size(8)
	int32_t MaxSlotCount; //  0x250 Size(4)
	int32_t MaxVisibleCount; //  0x254 Size(4)
	Unknown SlotList; //  0x258 Size(10)
	Unknown KillDataList; //  0x268 Size(50)
	int32_t AddIndex; //  0x2b8 Size(4)

	void TimeOverSlot(int32_t ArrayIndex, Unknown TargetSlotWidget); // Function BravoHotelGame.BravoHotelKillInfoWidget.TimeOverSlot(Final|Native|Public|BlueprintCallable) // <Game+0x1f53080>
};

// Class BravoHotelGame.BravoHotelLadder
struct ABravoHotelLadder : UActor {
	Unknown RootScene; //  0x310 Size(8)
	Unknown InteractiveCheckBox; //  0x318 Size(8)
	Unknown UpStart; //  0x320 Size(8)
	Unknown UpEnd; //  0x328 Size(8)
	Unknown DownStart; //  0x330 Size(8)
	Unknown DownEnd; //  0x338 Size(8)
	Unknown LadderPoint; //  0x340 Size(8)
	int32_t StepMinCount; //  0x348 Size(4)
	int32_t StepCount; //  0x34c Size(4)
	float StepHeight; //  0x350 Size(4)
	float StepHalfWidth; //  0x354 Size(4)
	float StepWidthScale; //  0x358 Size(4)
	float StepWidthMargin; //  0x35c Size(4)
	Unknown StepMesh; //  0x360 Size(8)
	char OnlySnapToCenter; //  0x368 Size(1)
	char TestLadderHiddenInGame; //  0x369 Size(1)
	char DebugMode; //  0x36a Size(1)
	float AvailableDistanceAtTop; //  0x36c Size(4)
	float AvailableDistanceAtBottom; //  0x370 Size(4)
	float AvailableDistanceInAir; //  0x374 Size(4)
	float AvailableMinYawAtTop; //  0x378 Size(4)
	float AvailableMaxYawAtTop; //  0x37c Size(4)
	float AvailableMinYawAtBottom; //  0x380 Size(4)
	float AvailableMaxYawAtBottom; //  0x384 Size(4)
	float BottomAdjustedHeight; //  0x388 Size(4)
	float TopRelativeX; //  0x38c Size(4)
	float BottomRelativeX; //  0x390 Size(4)
	char IsTopOccupied; //  0x394 Size(1)
	char IsBottomOccupied; //  0x395 Size(1)
	Unknown UsingPlayers; //  0x3b0 Size(10)

	void SetOccupyLadder(char IsTop); // Function BravoHotelGame.BravoHotelLadder.SetOccupyLadder(Final|Native|Public|BlueprintCallable) // <Game+0x1f53f30>
};

// Class BravoHotelGame.BravoHotelLightPropActor
struct ABravoHotelLightPropActor : UActor {
	char bLightOn; //  0x310 Size(1)
	char bLightFlicker; //  0x311 Size(1)
	float LightOnIntensity; //  0x314 Size(4)
	float LightOnTemperture; //  0x318 Size(4)
	float LightOnAttenuationRadius; //  0x31c Size(4)
	Unknown LightOnMaterial; //  0x320 Size(8)
	Unknown LightOffMaterial; //  0x328 Size(8)
	Unknown LightFlickerFunctionMaterial; //  0x330 Size(8)
	Unknown SceneRootComponent; //  0x338 Size(8)
};

// Class BravoHotelGame.BravoHotelLoadingWidget
struct UBravoHotelLoadingWidget : UUserWidget {
	int32_t LoadingScreenIndex; //  0x248 Size(4)
	int32_t LoadingScreenCount; //  0x24c Size(4)
	struct FString FromLoading; //  0x250 Size(10)
	Unknown MutableList; //  0x270 Size(10)
	Unknown TargetPawn; //  0x288 Size(8)

	void Update(Unknown& Data); // Function BravoHotelGame.BravoHotelLoadingWidget.Update(Event|Public|HasOutParms|BlueprintEvent) // <Game+0x23a73f0>
};

// Class BravoHotelGame.BravoHotelLobbyPlayerContro
struct ABravoHotelLobbyPlayerControt : APlayerController {
	int32_t CurrentLobbyPawnIndex; //  0x6f8 Size(4)
	Unknown ParachuteActor; //  0x700 Size(8)

	void VoiceTalkState(char bVoiceChat); // Function BravoHotelGame.BravoHotelLobbyPlayerControt.VoiceTalkState(Final|Native|Public) // <Game+0x1f55490>
};

// Class BravoHotelGame.BravoHotelLobbyWidget
struct UBravoHotelLobbyWidget : UUserWidget {
	Unknown DefaultMapSetting; //  0x248 Size(10)

	void Logout(); // Function BravoHotelGame.BravoHotelLobbyWidget.Logout(Native|Event|Public|BlueprintCallable|BlueprintEvent) // <Game+0x1edb970>
};

// Class BravoHotelGame.BravoHotelLobbyWidget_Web
struct UBravoHotelLobbyWidget_Web : UBravoHotelCoherentBaseWidget {
	Unknown MousePos; //  0x364 Size(8)
	char CheckPreLoad; //  0x36c Size(1)
	char bShowReconnectAlarm; //  0x36d Size(1)
	struct FMulticastInlineDelegate ExitDelegate; //  0x370 Size(10)
	struct FMulticastInlineDelegate OptionDelegate; //  0x380 Size(10)
	struct FMulticastInlineDelegate UIButtonOverSoundDelegate; //  0x390 Size(10)
	struct FMulticastInlineDelegate UIButtonClickSoundDelegate; //  0x3a0 Size(10)
	struct FMulticastInlineDelegate StoreDelegate; //  0x3b0 Size(10)
	struct FMulticastInlineDelegate PartyInfoDelegate; //  0x3c0 Size(10)
	Unknown DefaultMapSetting; //  0x3d0 Size(10)
	Unknown DevMapSetting; //  0x3e0 Size(10)
	Unknown MapSetting; //  0x3f0 Size(10)
	Unknown CustomizedCharacterComponent; //  0x400 Size(8)
	Unknown SupplyBoxComponent; //  0x408 Size(8)
	Unknown ArmoryComponent; //  0x410 Size(8)
	Unknown SeasonComponent; //  0x418 Size(8)
	struct FMulticastInlineDelegate TabDelegate; //  0x420 Size(10)
	struct FMulticastInlineDelegate OnPrefetchingProgress; //  0x430 Size(10)
	Unknown SupplyBoxSpawnEffect; //  0x440 Size(8)
	Unknown PP_Preset_PickupOutline; //  0x448 Size(8)
	int32_t GamePlayTime_Hours; //  0x450 Size(4)
	int32_t PrefetchingProgressPercentage; //  0x454 Size(4)
	struct TSoftClassPtr<UObject> SoftReplayWidgetClass; //  0x460 Size(28)
	Unknown ReMatchingByDS_TimerHandle; //  0x488 Size(8)
	int32_t Gold; //  0x4a0 Size(4)
	Unknown WeaponList; //  0x4a8 Size(10)
	Unknown MaterialList; //  0x4b8 Size(10)

	void UIButtonOverSoundDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelLobbyWidget_Web.UIButtonOverSoundDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <Game+0x23a73f0>
};

// Class BravoHotelGame.BravoHotelLocalPlayer
struct UBravoHotelLocalPlayer : ULocalPlayer {
	int32_t UniquePlayerId; //  0x258 Size(4)
	Unknown KillcamPlayback; //  0x260 Size(8)
};

// Class BravoHotelGame.BravoHotelLocalSavedSettings
struct UBravoHotelLocalSavedSettings : UBravoHotelLocalSaveBase {
	struct FName UserName; //  0x28 Size(8)
	Unknown MouseSensitivityStates; //  0x30 Size(50)
	char bRememberMe; //  0x80 Size(1)
	Unknown MatchingSettings; //  0x88 Size(20)
	Unknown FireModeSettings; //  0xa8 Size(50)
	char bAutoReload; //  0xf8 Size(1)
	struct FName OpeningMovieName; //  0xfc Size(8)
	char bFirstRun; //  0x104 Size(1)
	Unknown CoherentSettings; //  0x108 Size(18)

	Unknown Get(); // Function BravoHotelGame.BravoHotelLocalSavedSettings.Get(Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable|BlueprintPure) // <Game+0x1f5aa50>
};

// Class BravoHotelGame.BravoHotelMagazineForDrop
struct ABravoHotelMagazineForDrop : UActor {
	Unknown MagazineMeshComponent; //  0x310 Size(8)
	Unknown SpawnedSocketTransform; //  0x320 Size(30)
	Unknown OwnerWeaponRef; //  0x350 Size(8)

	void OnCompleteAysnLoadItems(Unknown StaticMeshPtr); // Function BravoHotelGame.BravoHotelMagazineForDrop.OnCompleteAysnLoadItems(Final|Native|Protected) // <Game+0x1f61010>
};

// Class BravoHotelGame.BravoHotelMainWidget
struct UBravoHotelMainWidget : UUserWidget {
	Unknown WorldCenter; //  0x260 Size(c)
	Unknown WorldSize; //  0x26c Size(8)
	Unknown BaseMapSize; //  0x274 Size(8)
	Unknown ParentWidgetSize; //  0x27c Size(8)
	Unknown TargetCharacterRef; //  0x288 Size(8)
	Unknown TargetPlayerStateRef; //  0x290 Size(8)
	Unknown BattleRoyaleGameStateRef; //  0x298 Size(8)
	Unknown PlayerHUDRef; //  0x2a0 Size(8)
	Unknown PlayerControllerRef; //  0x2a8 Size(8)
	Unknown TargetPawnTeamPlayers; //  0x2b0 Size(10)
	Unknown ViewportSize; //  0x2cc Size(8)
	float ViewportScale; //  0x2d4 Size(4)
	Unknown TopInfoWidgetClass; //  0x2d8 Size(8)
	Unknown SightInfoWidgetClass; //  0x2e0 Size(8)
	Unknown TeamPositionWidgetArray; //  0x2e8 Size(10)
	Unknown TeamPositionWidgetClass; //  0x2f8 Size(8)
	char bWantShowTeamPositionWidget; //  0x300 Size(1)
	Unknown MinViewportPosition; //  0x304 Size(8)
	Unknown MaxViewportPosition; //  0x30c Size(8)
	char RedCircleVisibility; //  0x31c Size(1)
	char IsMouseCursorWidgetChanged; //  0x31d Size(1)
	Unknown SkillMapRadarPosition; //  0x320 Size(8)
	float SkillMapRadarScaleRate; //  0x328 Size(4)
	Unknown AudioEvent_FindLandingPositionStart; //  0x338 Size(8)
	Unknown AudioEvent_FindLandingPositionEnd; //  0x340 Size(8)
	Unknown AudioEvent_SearchInstinctStart; //  0x368 Size(8)
	Unknown AudioEvent_SearchInstinctEnd; //  0x370 Size(8)
	float SearchInstinctAlpha; //  0x378 Size(4)
	char bIsSetSearchInstinctWidget; //  0x37c Size(1)
	char bIsSetVehicleSearchWidget; //  0x37d Size(1)
	Unknown SpatialSenseUIInfoMap; //  0x380 Size(50)
	float CarScanCurrentTime; //  0x3d0 Size(4)
	Unknown AttackDamageInfoList; //  0x3d8 Size(10)
	Unknown AttackDamageWidgetClass; //  0x3f0 Size(8)
	Unknown AttackUserWidgetClass; //  0x3f8 Size(8)
	Unknown HitWidgetList; //  0x400 Size(10)
	Unknown TopInfoWidget; //  0x410 Size(8)
	Unknown SightInfoWidget; //  0x418 Size(8)
	Unknown AliveInfoWidget; //  0x420 Size(8)
	Unknown KillInfoWidget; //  0x428 Size(8)
	Unknown CompassWidget; //  0x430 Size(8)
	Unknown VehicleWidget; //  0x438 Size(8)
	Unknown TeamInfoWidget; //  0x440 Size(8)
	Unknown JetpackWidget; //  0x448 Size(8)

	void UpdateNitroBoomWidget(Unknown TargetPosition); // Function BravoHotelGame.BravoHotelMainWidget.UpdateNitroBoomWidget(Event|Public|HasDefaults|BlueprintEvent) // <Game+0x23a73f0>
};

// Class BravoHotelGame.BravoHotelMapCompWidget
struct UBravoHotelMapCompWidget : UUserWidget {
	Unknown BattleRoyaleGameState; //  0x248 Size(8)
	Unknown BravoHotelGameState; //  0x250 Size(8)
	int32_t TeamSize; //  0x258 Size(4)
	char bForceUpdateAllWidgets; //  0x260 Size(1)
	Unknown MapPlayerInfos; //  0x268 Size(10)
	Unknown LocalMapPlayerInfo; //  0x278 Size(58)
	Unknown PersonalSupplyBoxInfo; //  0x2d0 Size(10)
	Unknown WorldCenter; //  0x2e0 Size(c)
	Unknown WorldSize; //  0x2ec Size(8)
	Unknown BaseMapSize; //  0x2f4 Size(8)
	Unknown ParentWidgetSize; //  0x2fc Size(8)
	float ScaleFactor; //  0x304 Size(4)
	float BaseScaleFactor; //  0x308 Size(4)
	float TargetScaleFactor; //  0x30c Size(4)
	Unknown TargetMapPos; //  0x310 Size(8)
	Unknown PivotPosOnViewport; //  0x318 Size(8)
	char bNeedToTranslateMapToPlayerPos; //  0x320 Size(1)
	int32_t GridLevel; //  0x324 Size(4)
	int32_t CurrentGridLevel; //  0x328 Size(4)
	Unknown GridUnits; //  0x330 Size(10)
	Unknown GridColors; //  0x340 Size(10)
	float LineP2CAngle; //  0x350 Size(4)
	float LineP2CHeight; //  0x354 Size(4)
	Unknown LineP2CPosonMap; //  0x358 Size(8)
	Unknown MapCompBlueZoneInfo; //  0x360 Size(2c)
	char IsUsingOuterAreaBlueZone; //  0x38c Size(1)
	char UsingOuterAreaBlueZoneVisible; //  0x38d Size(1)
	Unknown AircraftWidget; //  0x390 Size(8)
	Unknown ReplayCircleInfo; //  0x39c Size(10)
	char bIsFreeCamVisible; //  0x3ac Size(1)
	Unknown FreeCamPosition; //  0x3b0 Size(8)
	float FreeCamAngle; //  0x3b8 Size(4)
	Unknown MaterialItemList; //  0x3c0 Size(50)
	Unknown LocalPingList; //  0x410 Size(50)
	Unknown ExpertWeaponItem; //  0x460 Size(8)
	char bShowWorldMap; //  0x468 Size(1)
	Unknown ParentWidgetRef; //  0x470 Size(8)
	Unknown AreaWidgetsRef; //  0x478 Size(10)
	Unknown UW_MapDrawWidget_Circle; //  0x488 Size(8)
	Unknown UW_MapDrawWidget_Grid; //  0x490 Size(8)
	Unknown LinePlayerToCircle; //  0x498 Size(8)
	Unknown LineRouteDefault; //  0x4a0 Size(8)
	Unknown LineRouteDotline; //  0x4a8 Size(8)
	Unknown DescentStartPoint; //  0x4b0 Size(8)
	Unknown DescentEndPoint; //  0x4b8 Size(8)
	Unknown CircleMask; //  0x4c0 Size(8)
	Unknown ReplayCircleMask; //  0x4c8 Size(8)
	int32_t MiniMapLevel; //  0x4d0 Size(4)
	Unknown DefaultCircleTexture; //  0x4d8 Size(8)
	Unknown CircleMaskMaterial; //  0x4e0 Size(8)
	Unknown ReplayMaskMaterial; //  0x4e8 Size(8)
	Unknown CircleMaterialInstance; //  0x4f0 Size(8)
	Unknown ReplayMaterialInstance; //  0x4f8 Size(8)

	void UpdateSupplyBoxInfo(); // Function BravoHotelGame.BravoHotelMapCompWidget.UpdateSupplyBoxInfo(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// Class BravoHotelGame.BravoHotelMapDrawWidget
struct UBravoHotelMapDrawWidget : UUserWidget {
	Unknown MapCompRef; //  0x248 Size(8)
	int32_t CircleClicedCount; //  0x250 Size(4)
	Unknown CurrentCircleColor; //  0x254 Size(10)
	Unknown TargetCircleColor; //  0x264 Size(10)
	Unknown ReplayCircleColor; //  0x274 Size(10)

	void UpdateReplayCircleInfos(); // Function BravoHotelGame.BravoHotelMapDrawWidget.UpdateReplayCircleInfos(Final|Native|Public|BlueprintCallable) // <Game+0x1f66690>
};

// Class BravoHotelGame.BravoHotelMaterialEffectActor
struct ABravoHotelMaterialEffectActor : UActor {
	float DestructTime; //  0x310 Size(4)
	Unknown ColorValues; //  0x318 Size(50)
	Unknown FloatValues; //  0x368 Size(50)
	Unknown ColorCurves; //  0x3b8 Size(50)
	Unknown FloatCurves; //  0x408 Size(50)
};

// Class BravoHotelGame.BravoHotelMediaPlayerWidget
struct UBravoHotelMediaPlayerWidget : UUserWidget {
	struct FMulticastInlineDelegate DelegateMediaState; //  0x248 Size(10)

	void ShowMovie(); // Function BravoHotelGame.BravoHotelMediaPlayerWidget.ShowMovie(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// Class BravoHotelGame.BravoHotelMeleeWeapon
struct ABravoHotelMeleeWeapon : ABravoHotelWeaponBase {
	Unknown MeleeAttack_Stand; //  0x1bd0 Size(10)
	Unknown MeleeAttack_Crouch; //  0x1be0 Size(10)
	Unknown MeleeAttach_Jump; //  0x1bf0 Size(10)
	Unknown Locomotion_Stand_Idle_3P; //  0x1c00 Size(8)
	Unknown Locomotion_Crouch_Idle_3P; //  0x1c08 Size(8)
	Unknown Locomotion_Prone_Idle_3P; //  0x1c10 Size(8)
	Unknown Locomotion_Stand_Idle_1P; //  0x1c18 Size(8)
	Unknown Locomotion_Crouch_Idle_1P; //  0x1c20 Size(8)
	Unknown Locomotion_Prone_Idle_1P; //  0x1c28 Size(8)
};

// Class BravoHotelGame.BravoHotelMiniMapWidget
struct UBravoHotelMiniMapWidget : UUserWidget {
	Unknown RemaingTimeToActivate; //  0x250 Size(8)

	char UpdatePlayerIcon_Impl(float DeltaSeconds, float MapWidth, Unknown PlayerIconGroup); // Function BravoHotelGame.BravoHotelMiniMapWidget.UpdatePlayerIcon_Impl(Final|Native|Public|BlueprintCallable) // <Game+0x1f67280>
};

// Class BravoHotelGame.BravoHotelMK3DReplayController
struct ABravoHotelMK3DReplayController : AMK3DReplayController {
	Unknown MaxViewportSize; //  0x930 Size(8)
	char bIsShowingTimelineWidget; //  0x938 Size(1)
	char bIsShowingPlayerListWidget; //  0x939 Size(1)
	char bIsShowingItemListWidget; //  0x93a Size(1)
	Unknown DuplicatedReconnectTimeout_TimerHandle; //  0x940 Size(8)
	Unknown MainWidgetRef; //  0x948 Size(8)
	Unknown ReplayMainWidgetRef; //  0x950 Size(8)
	float KillMessageAdditionalEffectiveTime; //  0x958 Size(4)
	Unknown LastViewTarget; //  0x960 Size(8)
	Unknown GameOverlayWidget; //  0x970 Size(8)
	Unknown GameSettingWidget; //  0x978 Size(8)
	Unknown DebugInfo; //  0x980 Size(8)
	Unknown ReplayZone; //  0x988 Size(8)
	Unknown CurrentRecordingPawn; //  0x990 Size(8)
	Unknown TargetVehicle; //  0xa70 Size(8)
	Unknown K2_AfterKillcamHUD; //  0xa80 Size(8)
	Unknown RecordingPlayerState; //  0xa88 Size(8)

	void ShowLevelName(); // Function BravoHotelGame.BravoHotelMK3DReplayController.ShowLevelName(Final|Exec|Native|Public) // <Game+0x1f68330>
};

// Class BravoHotelGame.BravoHotelMK3DSpectatorPawn
struct ABravoHotelMK3DSpectatorPawn : AMK3DSpectatorPawn {
	Unknown ReplayController; //  0x3a8 Size(8)
	float DefaultSpeed; //  0x3b0 Size(4)
	float CurrentSpeedLevel; //  0x3b4 Size(4)
	float MinSpeedLevel; //  0x3b8 Size(4)
	float MaxSpeedLevel; //  0x3bc Size(4)

	void SetCameraMaxSpeed(float SpeedLevel); // Function BravoHotelGame.BravoHotelMK3DSpectatorPawn.SetCameraMaxSpeed(Final|Native|Public|BlueprintCallable) // <Game+0x1f686c0>
};

// Class BravoHotelGame.BravoHotelMoveElevator
struct ABravoHotelMoveElevator : UActor {
	Unknown CurrentStateType; //  0x318 Size(1)
	float CurrentMovingTime; //  0x31c Size(4)

	void OnRep_ChangeElevatorState(); // Function BravoHotelGame.BravoHotelMoveElevator.OnRep_ChangeElevatorState(Final|Native|Public) // <Game+0x1f68d50>
};

// Class BravoHotelGame.BravoHotelMutiplayerPhysicsActor
struct ABravoHotelMutiplayerPhysicsActor : UActor {
	Unknown RootNode; //  0x310 Size(8)
	Unknown SendController; //  0x318 Size(8)
	Unknown BoxMesh; //  0x360 Size(8)
	char LoopAction; //  0x368 Size(1)
	char StartAction; //  0x369 Size(1)
	Unknown RepMoveTransform; //  0x370 Size(30)

	void OpRep_StartAction(); // Function BravoHotelGame.BravoHotelMutiplayerPhysicsActor.OpRep_StartAction(Final|Native|Private) // <Game+0x1f692d0>
};

// Class BravoHotelGame.BravoHotelMuzzleEffectCompo
struct UBravoHotelMuzzleEffectCompot : UActorComponent {
	struct FName MuzzleAttachPoint; //  0xb0 Size(8)
	Unknown ChancePool; //  0xb8 Size(10)
	int32_t BulletCountToSpawnMultiFireEffect; //  0xc8 Size(4)
	int32_t SpawnInterval; //  0xcc Size(4)
	struct FName MuzzleAttachPoint_1P; //  0xe0 Size(8)
	struct FName MuzzleAttachPoint_ADS; //  0xe8 Size(8)
	Unknown MuzzleEffects; //  0xf0 Size(50)
	Unknown ReadyEffect; //  0x140 Size(8)
	Unknown WarmupEffect; //  0x148 Size(8)
	struct FName WarmupAlphaParameter; //  0x150 Size(8)
	float WarmupAlphaTime; //  0x158 Size(4)
	Unknown WarmupAlphaCurve; //  0x160 Size(8)
	Unknown TimerHandle_WarmupOff; //  0x168 Size(8)
	Unknown TimerHandle_WarmupUpdate; //  0x170 Size(8)
	Unknown CurrentMuzzleType; //  0x178 Size(1)
	Unknown MuzzleFlashComponent; //  0x180 Size(8)
	Unknown MuzzleSmokeComponent; //  0x188 Size(8)
	Unknown ReadyEffectComponent; //  0x190 Size(8)
	Unknown WarmupEffectComponent; //  0x198 Size(8)
	float PrevSpawnTime; //  0x1a0 Size(4)
	char bAttachSpawnedEffect; //  0x1a4 Size(1)
	char bUsePreShootRotationToFlash; //  0x1a5 Size(1)

	void TimerFunction_WarmupUpdate(); // Function BravoHotelGame.BravoHotelMuzzleEffectCompot.TimerFunction_WarmupUpdate(Final|Native|Protected) // <Game+0x1f697f0>
};

// Class BravoHotelGame.BravohotelNetSyncComponent
struct UBravohotelNetSyncComponent : USceneComponent {
	char IsParentsSync; //  0x238 Size(1)
	char IsSimulatePhysics; //  0x239 Size(1)
	char IsCollisionEnabled; //  0x23a Size(1)
	char IsEverTick; //  0x23b Size(1)
};

// Class BravoHotelGame.BravoHotelNetworkDelayWidget
struct UBravoHotelNetworkDelayWidget : UUserWidget {
	int32_t DefaultTableIndex; //  0x250 Size(4)
	Unknown T_DelayMessage; //  0x258 Size(8)
};

// Class BravoHotelGame.BravoHotelNetworkManager
struct UBravoHotelNetworkManager : Object {
	Unknown NetworkSocket; //  0x28 Size(10)
	Unknown NetworkWebSocket; //  0x38 Size(20)
	Unknown HttpService; //  0x58 Size(8)
	char bHttpServiceEnable; //  0x60 Size(1)
	Unknown UserInfo; //  0x220 Size(90)
	Unknown FriendList; //  0x2b0 Size(10)
	Unknown PartyInfo; //  0x2d8 Size(28)
	Unknown PartyInvitaion; //  0x300 Size(30)
	Unknown OnlineSubsystemFriends; //  0x330 Size(30)
	Unknown ParentGameInstance; //  0x4f8 Size(8)

	char IsSocketAlive(); // Function BravoHotelGame.BravoHotelNetworkManager.IsSocketAlive(Final|Native|Public) // <Game+0x1f734c0>
};

// Class BravoHotelGame.BravoHotelObjectSyncMannagerBase
struct ABravoHotelObjectSyncMannagerBase : UActor {
	Unknown SyncInfo; //  0x310 Size(4)
	Unknown MannagedPool; //  0x318 Size(50)
};

// Class BravoHotelGame.BravoHotelPainCausingComponent
struct UBravoHotelPainCausingComponent : UActorComponent {
	float DamagePerSec; //  0xb0 Size(4)
	Unknown DamageType; //  0xb8 Size(8)
	float PainInterval; //  0xc0 Size(4)
	char bEntryPain; //  0xc4 Size(1)
	Unknown DamageInstigator; //  0xc8 Size(8)
	Unknown DamagedActors; //  0xd8 Size(10)

	void UnregisterActorOutOfCircle(Unknown Actor); // Function BravoHotelGame.BravoHotelPainCausingComponent.UnregisterActorOutOfCircle(Final|Native|Public) // <Game+0x1f7b670>
};

// Class BravoHotelGame.BravoHotelParachuteTriggerBox
struct ABravoHotelParachuteTriggerBox : UActor {
	Unknown BoxComponent; //  0x310 Size(8)
	Unknown ArrowComponent; //  0x318 Size(8)
	char bLaunch; //  0x320 Size(1)
	float LaunchForce; //  0x324 Size(4)
	float ParachuteDelayTime; //  0x328 Size(4)
	float ParachuteDelayTimeByFalling; //  0x32c Size(4)

	Unknown GetLanuchForce(); // Function BravoHotelGame.BravoHotelParachuteTriggerBox.GetLanuchForce(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <Game+0x1f7b860>
};

// Class BravoHotelGame.BravoHotelPerkComponent
struct UBravoHotelPerkComponent : UActorComponent {
	Unknown RepPerkInfos; //  0xc0 Size(118)
	struct FMulticastInlineDelegate OnPerkInfoChanged; //  0x1d8 Size(10)

	void PerkInfoChanged__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelPerkComponent.PerkInfoChanged__DelegateSignature(MulticastDelegate|Public|Delegate) // <Game+0x23a73f0>
};

// Class BravoHotelGame.BravoHotelPersonalSupplyBoxSlotItemWidget
struct UBravoHotelPersonalSupplyBoxSlotItemWidget : UUserWidget {
	char IsWeaponData; //  0x248 Size(1)
	char IsConsumableItemData; //  0x249 Size(1)
	Unknown WeaponItemData; //  0x250 Size(98)
	Unknown ConsumableItemData; //  0x2e8 Size(100)

	void SetWeaponInfo(Unknown& NewWeaponItemData); // Function BravoHotelGame.BravoHotelPersonalSupplyBoxSlotItemWidget.SetWeaponInfo(Event|Public|HasOutParms|BlueprintEvent) // <Game+0x23a73f0>
};

// Class BravoHotelGame.BravoHotelPersonalSupplyBoxWidget
struct UBravoHotelPersonalSupplyBoxWidget : UUserWidget {
	Unknown HaveWeaponList; //  0x248 Size(10)
	Unknown ConsumableItemList; //  0x258 Size(10)
	Unknown CurSortType; //  0x268 Size(1)
	Unknown CurConsumableItemDatas; //  0x270 Size(50)
	Unknown CurWeapon; //  0x2c0 Size(98)
	Unknown DefaultWeapon; //  0x358 Size(98)
	char IsFreeSupply; //  0x3f0 Size(1)
	char bIsDefaultWeapon; //  0x3f1 Size(1)

	void UpdateWeaponItemEquipState(Unknown& WeaponItem, char IsUnEquip); // Function BravoHotelGame.BravoHotelPersonalSupplyBoxWidget.UpdateWeaponItemEquipState(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x1f7f560>
};

// Class BravoHotelGame.BravoHotelPhysicalMaterial
struct UBravoHotelPhysicalMaterial : UPhysicalMaterial {
	float Friction_OutBlueZone; //  0x80 Size(4)
	char AllowPenetration; //  0x84 Size(1)
	char bAllowPenetrationToThrowWeapon; //  0x85 Size(1)
	float Toughness; //  0x88 Size(4)
	float RefrationOnPenetration; //  0x8c Size(4)
	char bUseDefaultNoImpactEffect; //  0x90 Size(1)
	Unknown ImpactEffect; //  0x98 Size(8)
	Unknown ImpactDecalMaterial; //  0xa0 Size(10)
	Unknown ImpactEffect_OutBlueZone; //  0xb0 Size(8)
	Unknown ImpactDecalMaterial_OutBlueZone; //  0xb8 Size(10)
	float ImpactDecalSize; //  0xc8 Size(4)
	Unknown ImpactDecalScale; //  0xcc Size(c)
	char PlayFootstepEffectWhenMovementInteractionTriggered; //  0xd8 Size(1)
	Unknown OverrideFootstepEffects; //  0xe0 Size(50)
	Unknown FootstepEffect; //  0x130 Size(8)
	Unknown FootstepEffect_OutBlueZone; //  0x138 Size(8)
	Unknown FootstepDecalMaterial; //  0x140 Size(10)
	Unknown FootstepDecalMaterial_OutBlueZone; //  0x150 Size(10)
	Unknown VehicleEffect; //  0x160 Size(8)
	Unknown VehicleEffect_OutBlueZone; //  0x168 Size(8)
	Unknown VehicleWreckEffect; //  0x170 Size(8)
	Unknown VehicleWreckEffect_OutBlueZone; //  0x178 Size(8)
	Unknown OverlapSound; //  0x180 Size(8)
	char bUseSurfaceAsSnowfield; //  0x188 Size(1)
	char bCanProne; //  0x189 Size(1)
	float SlopeSpeedModifier; //  0x18c Size(4)
	int32_t TerrainType; //  0x190 Size(4)
	Unknown ImpactAudioEvents; //  0x198 Size(50)

	struct FName GetSurfaceName(); // Function BravoHotelGame.BravoHotelPhysicalMaterial.GetSurfaceName(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game+0x1f7f900>
};

// Class BravoHotelGame.BravoHotelPlayerCameraManager
struct ABravoHotelPlayerCameraManager : APlayerCameraManager {
	float ServerUpdateCameraInterval; //  0x2b28 Size(4)
	Unknown TimedCameraPostProcessDatas; //  0x2b50 Size(10)
	Unknown TimedCameraEffectDatas; //  0x2b60 Size(10)

	void UpdateTimedCameraPostProcess(Unknown& TargetData); // Function BravoHotelGame.BravoHotelPlayerCameraManager.UpdateTimedCameraPostProcess(Final|Native|Public|HasOutParms) // <Game+0x1f81a70>
};

// Class BravoHotelGame.BravoHotelPlayerController
struct ABravoHotelPlayerController : APlayerController {
	Unknown ConversationComponent; //  0x6f8 Size(8)
	Unknown QuestComponent; //  0x700 Size(8)
	Unknown SavedCharacterPawn; //  0xbc8 Size(8)
	Unknown OnDamagedCameraShake; //  0xe38 Size(8)
	Unknown OnDamagedADSCameraShake; //  0x1298 Size(8)
	Unknown ThrowingWeaponExplosionCameraShake; //  0xd98 Size(8)
	Unknown RedZoneExplosionCameraShake; //  0xbf8 Size(8)
	float FragmentCloseExplosionCameraShakeScale; //  0xbb8 Size(4)
	float FragmentMidExplosionCameraShakeScale; //  0x12cc Size(4)
	float FragmentFarExplosionCameraShakeScale; //  0x1328 Size(4)
	float FragmentCloseExplosionDistance; //  0xcb0 Size(4)
	float FragmentMidExplosionDistance; //  0x1350 Size(4)
	float FragmentFarExplosionDistance; //  0xef8 Size(4)
	float FragmentChangeStateDelayTime; //  0xcf0 Size(4)
	float FragmentCloseExplosionSoundDistance; //  0x12d8 Size(4)
	float FragmentMidExplosionSoundDistance; //  0xfac Size(4)
	float FragmentFarExplosionSoundDistance; //  0x1160 Size(4)
	float FragmentCloseExplosionSoundTime; //  0xf50 Size(4)
	float FragmentMidExplosionSoundTime; //  0xbbc Size(4)
	float FragmentFarExplosionSoundTime; //  0x1304 Size(4)
	char bIsTeamSpectator; //  0xcc6 Size(1)
	Unknown SpectatorHUDClass; //  0xba8 Size(8)
	float LoseWidgetShowDelay; //  0xb9c Size(4)
	Unknown MatchEndSimpleResult; //  0x11e8 Size(a8)
	Unknown CurrentSpectatingMode; //  0xd40 Size(1)
	Unknown LastSpectatorTargetPawn; //  0x1388 Size(8)
	Unknown WatchingPCs; //  0x1318 Size(10)
	Unknown RadialDamageInfos; //  0xec0 Size(10)
	Unknown ItemRecipeTreeWidgetClass; //  0xee0 Size(8)
	struct FMulticastInlineDelegate Delegate_OnFinishMatchEndAnimation; //  0x708 Size(10)
	Unknown SpectatingPlayerHUD; //  0x1358 Size(8)
	Unknown TimerHandle_SetStateSpectator; //  0xe08 Size(8)
	Unknown PerkDeckPopup; //  0xda0 Size(8)
	struct FMulticastInlineDelegate OnResetTeamPlayersInfo; //  0x718 Size(10)
	char ResetTeamPlayersInfo; //  0xd41 Size(1)
	Unknown ClientBlueZone; //  0xd00 Size(8)
	Unknown PP_BlueZone; //  0x10e8 Size(8)
	char bInfiniteAmmo; //  0x12a4 Size(1)
	Unknown PlayerStateList; //  0xbd0 Size(10)
	Unknown DeathCamFocus; //  0x1290 Size(8)
	float DeathCamTime; //  0x10e0 Size(4)
	char bEnableLevelStreamimngDistanceScaleByZ; //  0x1109 Size(1)
	char bUseLevelStreamimngPriorityByZ; //  0x10b0 Size(1)
	Unknown LevelStreamingPrioritiesByZ; //  0xd58 Size(10)
	Unknown MovePointList; //  0xee8 Size(10)
	Unknown TeleportPointList; //  0xce0 Size(10)
	char bEnableHideGun; //  0x10c0 Size(1)
	char bEnableDestroyGun; //  0xccc Size(1)
	char bHideActorMode; //  0x1378 Size(1)
	Unknown PingComponent; //  0xff0 Size(8)
	Unknown UseItemMenuList; //  0x1198 Size(50)
	Unknown HideObjectStack; //  0x1180 Size(10)
	Unknown AuthorizedRigidBodiesOnClient; //  0x10a0 Size(10)
	Unknown DeathCamClass; //  0xfc8 Size(8)
	Unknown SpawnedWinCam; //  0xd10 Size(8)
	Unknown SpawnedDeathCam; //  0x12a8 Size(8)
	Unknown SpawnedFieldViewCam; //  0x1100 Size(8)
	Unknown SpawnedResusciatedCam; //  0xcd0 Size(8)
	struct FMulticastInlineDelegate DelegatePayGoldOnChangeDeck; //  0xfd0 Size(10)
	struct FMulticastInlineDelegate DelegatePayGoldOnSelectDeck; //  0xe90 Size(10)
	struct FMulticastInlineDelegate DelegatePayGoldOnChangeDeckList; //  0xd88 Size(10)
	struct FMulticastInlineDelegate DelegateChoosePerkDeck; //  0xca0 Size(10)
	int32_t ChangeDeckBasePrice; //  0x1134 Size(4)
	float ChangeDeckMultiflier; //  0xcfc Size(4)
	int32_t MaxChangeDeckCount; //  0xc88 Size(4)
	int32_t SelectDeckPrice; //  0x1394 Size(4)
	int32_t MaxChangeDeckListCount; //  0x12a0 Size(4)
	struct FMulticastInlineDelegate DelegateAddLog; //  0x730 Size(10)
	uint32_t AccountGold; //  0xe2c Size(4)
	uint32_t PaidAccountGold; //  0xd34 Size(4)
	Unknown DebugInfo; //  0xe00 Size(8)
	struct FMulticastInlineDelegate DelegateDataEventCharacte; //  0x8c8 Size(10)
	struct FMulticastInlineDelegate DelegateDataEventCharacteUidList; //  0x8d8 Size(10)
	struct FMulticastInlineDelegate DelegateOnKillOtherPlayer; //  0x8e8 Size(10)
	struct FMulticastInlineDelegate DelegateOnKnockDownOtherPlayer; //  0x8f8 Size(10)
	struct FMulticastInlineDelegate DelegateOnWhoKilledMe; //  0x908 Size(10)
	struct TSoftClassPtr<UObject> SoftCheatWidgetClass; //  0x1078 Size(28)
	Unknown CheatWidget; //  0xfc0 Size(8)
	float SmartPingMenuDelayTime; //  0xd84 Size(4)
	char HasSpawnBook; //  0xcc5 Size(1)
	Unknown SpawnBookLocation; //  0x1128 Size(c)
	Unknown NameTooltips; //  0x1308 Size(10)
	float AutoNameTooltipDistance; //  0xd44 Size(4)
	float AutoNameTooltipSecond; //  0xcd8 Size(4)
	Unknown TimeHandle_ScreenCapture; //  0xdf8 Size(8)
	Unknown DuplicatedReconnectTimeout_TimerHandle; //  0x918 Size(8)
	float RequestResuscitationTimeStamp; //  0x924 Size(4)
	char bIsResuscitated; //  0x928 Size(1)
	Unknown Resuscitater; //  0x12e0 Size(8)
	Unknown TempResuscitater; //  0xff8 Size(8)
	Unknown TempResuscitatedTarget; //  0xfe0 Size(8)
	Unknown CurrentVictimPlayerState; //  0xd68 Size(8)
	Unknown SuspectController; //  0x1168 Size(8)
	Unknown SpawnedItemList; //  0xe40 Size(50)
	float MinMaterialItemSearchDistance; //  0xe28 Size(4)
	float MaxMaterialItemSearchDistance; //  0xba0 Size(4)
	float RemoveMaterialItemDistance; //  0x12ec Size(4)
	float MaterialItemSearchShowCount; //  0x1074 Size(4)
	float ReSearchWaitingTime; //  0xcc8 Size(4)
	float MaterialItemPingLifeTime; //  0xcb4 Size(4)
	char ImmediatelyRemovePing; //  0xbf4 Size(1)
	float EquipItemMaterialItemAutorSearchTime; //  0x1164 Size(4)
	float LastEquipItemLifeTime; //  0x114c Size(4)
	char IgnoreStartStateSearchMaterial; //  0xbb5 Size(1)
	float SearchDelayTime; //  0x1390 Size(4)
	Unknown TimeHandle_MaterialSearchDelay; //  0xfe8 Size(8)
	Unknown TimeHandle_RemoveMaterialPing; //  0xed8 Size(8)
	Unknown TimeHandle_SearchMaterialPing; //  0x1380 Size(8)
	Unknown TimeHandle_CheckEquipItemMaterialItemAutorSearch; //  0xbe8 Size(8)
	Unknown TimeHandle_CheckLastEquipItemInit; //  0x1110 Size(8)
	struct FName LastEquipItem; //  0xcf4 Size(8)
	Unknown SelectRecipeItem; //  0xc8c Size(10)
	char bForceCheckSearchMaterialItems; //  0xefd Size(1)
	struct FMulticastInlineDelegate DelegateSelectSearchMaterialItem; //  0x1118 Size(10)
	struct FMulticastInlineDelegate DelegateEnableMaterialSearch; //  0x10f0 Size(10)
	struct FMulticastInlineDelegate DelegateEnableExpertWeaponMaterialSearch; //  0xc68 Size(10)
	struct FMulticastInlineDelegate DelegateMaterialSearchNoti; //  0x1360 Size(10)
	struct FMulticastInlineDelegate DelegateShowWeightMap; //  0xb78 Size(10)
	struct FMulticastInlineDelegate DelegateInventoryState; //  0xb88 Size(10)
	Unknown PreSpectatorTargetPawn; //  0xe20 Size(8)
	Unknown NoResponseNetworkClass; //  0x1060 Size(8)
	Unknown SpawnedSupplyBoxList; //  0xda8 Size(50)
	int32_t SelectedPersonalSupplyBoxOwnerID; //  0x106c Size(4)
	float ShowUseBoostItemMenuDelayTime; //  0xb98 Size(4)
	char bIgnoreInputCloseUI; //  0x1300 Size(1)

	void UnEquipItem(struct FName& ItemKey); // Function BravoHotelGame.BravoHotelPlayerController.UnEquipItem(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x1f93690>
};

// Class BravoHotelGame.BravoHotelPlayerHUD
struct ABravoHotelPlayerHUD : ABravoHotelBaseHUD {
	Unknown CrosshairMgr; //  0x418 Size(8)
	Unknown LastTargetPawn; //  0x420 Size(8)
	Unknown PlayerInfos; //  0x428 Size(10)
	Unknown BattleRoyaleGameState; //  0x438 Size(8)
	Unknown BravoHotelGameState; //  0x440 Size(8)
	struct FMulticastInlineDelegate OnChangedPlayerInfosDelegate; //  0x450 Size(10)
	float CurrentSkillRadius; //  0x46c Size(4)
	char bReplayOptionFireDirection; //  0x470 Size(1)
	char bReplayOptionHitted; //  0x471 Size(1)
	char bReplayOptionDeathPosition; //  0x472 Size(1)
	char bReplayOptionPersonalSupplyBox; //  0x473 Size(1)
	char bReplayOptionTransportDropBox; //  0x474 Size(1)
	struct FMulticastInlineDelegate OnToggleWidgetDelegate; //  0x478 Size(10)
	Unknown FireModeSound; //  0x490 Size(8)
	Unknown PlayerKillSound; //  0x498 Size(8)
	Unknown PlayerDuoKillSound; //  0x4a0 Size(8)
	Unknown LastPlayerInSquardKillSound; //  0x4a8 Size(8)
	Unknown LastPlayerInDuoKillSound; //  0x4b0 Size(8)
	Unknown PlayerAssistSound; //  0x4b8 Size(8)
	Unknown PlayerDiedSound; //  0x4c0 Size(8)
	Unknown RequestResuscitationEvent; //  0x4c8 Size(8)
	Unknown InventoryWidgetClass; //  0x4d0 Size(8)
	Unknown InventoryWidget; //  0x4d8 Size(8)
	struct TSoftClassPtr<UObject> SoftInventoryInfoWidgetClass; //  0x4e0 Size(28)
	Unknown InventoryWidget_Ori; //  0x508 Size(8)
	Unknown InventoryWidget_Web; //  0x510 Size(8)
	Unknown BravoHotelMainWidget; //  0x518 Size(8)
	struct TSoftClassPtr<UObject> SoftMainWidgetClass; //  0x520 Size(28)
	Unknown CustomMatchWidget; //  0x548 Size(8)
	Unknown MainWidgetEx; //  0x550 Size(8)
	Unknown MainWidgetExClass; //  0x558 Size(8)
	struct TSoftClassPtr<UObject> SoftMainWidgetExClass; //  0x560 Size(28)
	Unknown SpectatorWidget; //  0x588 Size(8)
	Unknown SpectatorWidgetClass; //  0x590 Size(8)
	struct TSoftClassPtr<UObject> SoftSpectatorWidgetClass; //  0x598 Size(28)
	Unknown ReplayWidget; //  0x5c0 Size(8)
	Unknown ReplayWidgetClass; //  0x5c8 Size(8)
	struct TSoftClassPtr<UObject> SoftReplayWidgetClass; //  0x5d0 Size(28)
	Unknown WorldMapWidget; //  0x5f8 Size(8)
	Unknown WorldMapWidgetClass; //  0x600 Size(8)
	struct TSoftClassPtr<UObject> SoftWorldMapWidgetClass; //  0x608 Size(28)
	Unknown SkillMapWidget; //  0x630 Size(8)
	Unknown SkillMapWidgetClass; //  0x638 Size(8)
	struct TSoftClassPtr<UObject> SoftSkillMapWidgetClass; //  0x640 Size(28)
	Unknown BlackMarketWidget; //  0x668 Size(8)
	Unknown MatchEndWidget; //  0x670 Size(8)
	Unknown MatchEndWidgetClass; //  0x678 Size(8)
	struct TSoftClassPtr<UObject> SoftMatchEndWidgetClass; //  0x680 Size(28)
	char bEnableWorldmap; //  0x6f0 Size(1)
	char bEnableMinimap; //  0x6f1 Size(1)
	struct TSoftClassPtr<UObject> SoftTestWidgetClass; //  0x6f8 Size(28)
	struct TSoftClassPtr<UObject> SoftWorldTeleportWidgetClass; //  0x720 Size(28)
	struct TSoftClassPtr<UObject> SoftReplayZoneClass; //  0x748 Size(28)
	struct TSoftClassPtr<UObject> SoftItemSpawnDebugWidgetClass; //  0x770 Size(28)
	struct TSoftClassPtr<UObject> SoftItemSpawnRateWidgetClass; //  0x798 Size(28)
	Unknown TestWidget; //  0x7c0 Size(8)
	struct TSoftClassPtr<UObject> SoftCustomMatchWidgetClass; //  0x7c8 Size(28)
	Unknown CinematicWidget; //  0x7f0 Size(8)
	struct TSoftClassPtr<UObject> CinematicWidgetClass; //  0x7f8 Size(28)
	Unknown MediaPlayerWidget; //  0x820 Size(8)
	struct TSoftClassPtr<UObject> MediaPlayerWidgetClass; //  0x828 Size(28)

	void UpdateKillCount(); // Function BravoHotelGame.BravoHotelPlayerHUD.UpdateKillCount(Final|Native|Public) // <Game+0x1f98410>
};

// Class BravoHotelGame.BravoHotelPlayerIconWidget
struct UBravoHotelPlayerIconWidget : UUserWidget {
	Unknown Canvas_Main; //  0x248 Size(8)
	Unknown RotationGroup; //  0x250 Size(8)
	Unknown Canvas_Replay; //  0x258 Size(8)
	Unknown IconSwitcher; //  0x260 Size(8)
	Unknown Text_PlayerNum; //  0x268 Size(8)
	Unknown Text_PlayerName; //  0x270 Size(8)
	Unknown Img_Disconnect; //  0x278 Size(8)
	Unknown Img_KnockDown; //  0x280 Size(8)
	Unknown Img_Alive; //  0x288 Size(8)
	Unknown Img_Death; //  0x290 Size(8)
	Unknown Img_Vehicle; //  0x298 Size(8)
	Unknown Img_Parachute; //  0x2a0 Size(8)
	Unknown Img_Critical; //  0x2a8 Size(8)
	Unknown Img_Sight; //  0x2b0 Size(8)
	Unknown Img_Arrow; //  0x2b8 Size(8)
	Unknown Img_BackRound; //  0x2c0 Size(8)
	Unknown Img_TargetCam; //  0x2c8 Size(8)
	Unknown Img_TargetCamDummy; //  0x2d0 Size(8)
	Unknown SizeBox_RequestResuscitatio; //  0x2d8 Size(8)
	Unknown BT_UserName; //  0x2e0 Size(8)
	Unknown Anim_Bouncing; //  0x2e8 Size(8)
	Unknown PlayerStateRef; //  0x2f0 Size(8)
	Unknown TeamColorTableRef; //  0x2f8 Size(8)
	char bIsFreeCam; //  0x300 Size(1)
	char bIsReplaying; //  0x301 Size(1)
	char bIsKillCam; //  0x302 Size(1)
	char bIsInNetCullDistance; //  0x303 Size(1)
	char bIsRequestResuscitation; //  0x304 Size(1)

	void UpdateInfo(); // Function BravoHotelGame.BravoHotelPlayerIconWidget.UpdateInfo(Final|Native|Protected) // <Game+0x1f989a0>
};

// Class BravoHotelGame.BravoHotelPlayerInfoProgressSlotWidget
struct UBravoHotelPlayerInfoProgressSlotWidget : UUserWidget {
	Unknown SizeBox_main; //  0x248 Size(8)
	Unknown Image_bg; //  0x250 Size(8)
	Unknown MainProgressBar; //  0x258 Size(8)
	Unknown CureLimitProgressBar; //  0x260 Size(8)
	Unknown TargetProgressBar; //  0x268 Size(8)
	Unknown BeforeProgressBar; //  0x270 Size(8)
	Unknown ShortTimeProgressBar; //  0x278 Size(8)
	Unknown DangerHp; //  0x280 Size(8)
	Unknown Anim_Increase; //  0x288 Size(8)
	Unknown Anim_AdditionalHP; //  0x290 Size(8)
	Unknown DefaultSlotSprite; //  0x298 Size(8)
	Unknown FirstSlotSprite; //  0x2a0 Size(8)
	Unknown LastSlotSprite; //  0x2a8 Size(8)
	int32_t MaxHealth; //  0x2b0 Size(4)
	char bIsKnockOutMode; //  0x2b4 Size(1)

	void SetProgressPercent(Unknown InProgressBar, int32_t InHealth); // Function BravoHotelGame.BravoHotelPlayerInfoProgressSlotWidget.SetProgressPercent(Final|Native|Public) // <Game+0x1f98f50>
};

// Class BravoHotelGame.BravoHotelPlayerInfoProgressWidget
struct UBravoHotelPlayerInfoProgressWidget : UUserWidget {
	Unknown TargetPawn; //  0x248 Size(8)
	float CurrentHealthIncreaseSpeed; //  0x250 Size(4)
	float CurrentHealthDecreaseSpeed; //  0x254 Size(4)
	float BeforeHealthInterpSpeedRate; //  0x258 Size(4)
	float BeforeHealthTimerDelayRate; //  0x25c Size(4)
	Unknown HorizontalBox_Main; //  0x2a0 Size(8)
	Unknown T_CurrentHealth; //  0x2a8 Size(8)
	Unknown T_MaxHealth; //  0x2b0 Size(8)
	int32_t LastMaxHealth; //  0x2b8 Size(4)
	int32_t HealthPerSlot; //  0x2bc Size(4)
	float CureLimitPercent; //  0x2c0 Size(4)
	int32_t AnimAdditionalHealth; //  0x2c4 Size(4)
	char bIsDangerHP; //  0x2c8 Size(1)
	Unknown PlayerInfoProgressSlotWidgetClass; //  0x2d0 Size(8)
	struct FMulticastInlineDelegate Delegate_OnPlayerInfoSlotSizeChanged; //  0x2d8 Size(10)

	void UpdateOverHealing(int32_t InNewHealth, char bFlag); // Function BravoHotelGame.BravoHotelPlayerInfoProgressWidget.UpdateOverHealing(Event|Protected|BlueprintEvent) // <Game+0x23a73f0>
};

// Class BravoHotelGame.BravoHotelPlayerInfoWidget
struct UBravoHotelPlayerInfoWidget : UUserWidget {
	Unknown WidgetSwitcher_Lung; //  0x248 Size(8)
	Unknown ProgressBar_Lung; //  0x250 Size(8)
	Unknown BuffListPanel; //  0x2b0 Size(8)
	Unknown GameBuffSlot_Boost; //  0x2b8 Size(8)

	void UpdateWidgetBuff(int32_t KeyIndex, float Timer, float MaxTime); // Function BravoHotelGame.BravoHotelPlayerInfoWidget.UpdateWidgetBuff(Final|Native|Public|BlueprintCallable) // <Game+0x1f9b370>
};

// Class BravoHotelGame.BHReplicatedPlayerInfo
struct UBHReplicatedPlayerInfo : UActorComponent {
	struct FName UID; //  0xc0 Size(8)
	int32_t UniquePlayerId; //  0xc8 Size(4)
	Unknown SeasonInfo; //  0xcc Size(18)
	int32_t CurrentPCTypeID; //  0xe4 Size(4)
	Unknown TeamIndex; //  0xe8 Size(1)
	Unknown TeamSize; //  0xe9 Size(1)
	int32_t TeamPlayerIconIndex; //  0xec Size(4)
	Unknown CurrentPerkDeckInfo; //  0xf0 Size(70)
	Unknown SupplyInfoFromServer; //  0x160 Size(48)
	Unknown SupplyWeaponInfo; //  0x1a8 Size(30)
	char bIsSuspiciousUser; //  0x1d8 Size(1)
	Unknown Newb; //  0x1e0 Size(20)

	void OnRep_TeamIndex(); // Function BravoHotelGame.BHReplicatedPlayerInfo.OnRep_TeamIndex(Final|Native|Protected) // <Game+0x1f9ef10>
};

// Class BravoHotelGame.BHReplicatedPlayStat
struct UBHReplicatedPlayStat : UActorComponent {
	char bAlive; //  0xc0 Size(1)
	char InOuterArea; //  0xc1 Size(1)
	uint16_t kills; //  0xc2 Size(2)
	uint16_t assists; //  0xc4 Size(2)
	uint16_t Deaths; //  0xc6 Size(2)
	uint16_t Revives; //  0xc8 Size(2)
	uint16_t Resuscitates; //  0xca Size(2)
	int32_t CurrentPerkClassLev; //  0xcc Size(4)
	Unknown WatchedCount; //  0xd0 Size(1)

	void OnRep_Kills(); // Function BravoHotelGame.BHReplicatedPlayStat.OnRep_Kills(Final|Native|Protected) // <Game+0x1f9ee70>
};

// Class BravoHotelGame.BHReplicatedAppearanceInfo
struct UBHReplicatedAppearanceInfo : UActorComponent {
	Unknown AppearanceInfo; //  0xc0 Size(14)
	Unknown TimerHandle_ReplicatedAppearanceInfo; //  0xd8 Size(8)

	void OnRep_ReplicatedAppearanceInfo(); // Function BravoHotelGame.BHReplicatedAppearanceInfo.OnRep_ReplicatedAppearanceInfo(Final|Native|Protected) // <Game+0x1f9eeb0>
};

// Class BravoHotelGame.BravoHotelPlayerState
struct ABravoHotelPlayerState : APlayerState {
	char bCriticalTime; //  0x418 Size(1)
	struct FString MatchingTeamID; //  0x420 Size(10)
	uint32_t MatchingTeamIdHash; //  0x430 Size(4)
	Unknown MatchableCountByDS; //  0x434 Size(1)
	struct FString PlayerSessionId; //  0x438 Size(10)
	int32_t LoginMemberIndex; //  0x458 Size(4)
	Unknown TeamPlayers; //  0x460 Size(10)
	Unknown ReplicatedPlayerInfo; //  0x598 Size(8)
	Unknown ReplicatedPlayStat; //  0x5a0 Size(8)
	Unknown ReplicatedAppearanceInfo; //  0x5a8 Size(8)
	struct FMulticastInlineDelegate OnChangePlayerState; //  0x5b0 Size(10)
	Unknown OwnerCharacter; //  0x5c8 Size(8)
	Unknown InNmPerkVechicleInfo; //  0x5d0 Size(28)
	Unknown SubState; //  0x5f8 Size(8)
	Unknown DummyInfo; //  0x600 Size(58)
	Unknown GamePlayStatistics; //  0x658 Size(8)
	Unknown CurrentState; //  0x661 Size(1)
	char bIsTalking; //  0x67a Size(1)
	Unknown PersonalSupplyBoxAdditionalItemList; //  0x680 Size(10)
	int32_t MaterialItemPingIndex; //  0x74c Size(4)
	Unknown MaterialPingList; //  0x750 Size(50)
	int32_t LocalPingIndex; //  0x7a0 Size(4)
	Unknown LocalPingList; //  0x7a8 Size(50)
	Unknown ExpertWeaponPing; //  0x7f8 Size(28)

	char TryGetMarker(Unknown& OutMarkerPosition); // Function BravoHotelGame.BravoHotelPlayerState.TryGetMarker(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // <Game+0x1f9f6b0>
};

// Class BravoHotelGame.BravoHotelPlayerSubState
struct ABravoHotelPlayerSubState : UActor {
	Unknown PingInfo; //  0x310 Size(38)
	Unknown PingLocalLocation; //  0x348 Size(c)
	Unknown RoutePingInfo; //  0x358 Size(10)
	Unknown Location; //  0x380 Size(c)
	uint16_t RotationYaw; //  0x38c Size(2)
	int32_t Health; //  0x390 Size(4)
	char bIsDisconnect; //  0x394 Size(1)
	char bIsRetired; //  0x395 Size(1)
	int32_t MaxHealth; //  0x398 Size(4)
	Unknown CurrentState; //  0x39c Size(1)
	Unknown CharacterState; //  0x39d Size(1)
	int32_t FireCount; //  0x3a0 Size(4)
	int32_t CurrentEquipWeaponID; //  0x3a4 Size(4)
	char bIsFireWeapon; //  0x3a8 Size(1)
	int32_t RemainGoldentime; //  0x3ac Size(4)
	int32_t MaxGoldentime; //  0x3b0 Size(4)
	char bRequestResuscitation; //  0x3b4 Size(1)
	char VoiceTeamTalk; //  0x3b5 Size(1)
	char VoiceAreaTalk; //  0x3b6 Size(1)

	void OnRep_RequestResuscitation(); // Function BravoHotelGame.BravoHotelPlayerSubState.OnRep_RequestResuscitation(Final|Native|Protected) // <Game+0x1fa0540>
};

// Class BravoHotelGame.BravoHotelPoolingActorCompo
struct UBravoHotelPoolingActorCompot : UActorComponent {
	Unknown DefaultPoolingActor; //  0xb0 Size(50)
	Unknown ActorPoolInfos; //  0x100 Size(50)
};

// Class BravoHotelGame.BravoHotelPopupManager
struct UBravoHotelPopupManager : Object {
	Unknown WidgetLayer; //  0x30 Size(10)
	Unknown NetworkDelayPopupWidgetRef; //  0x40 Size(8)
};

// Class BravoHotelGame.BravoHotelProjectile
struct ABravoHotelProjectile : ABravoHotelProjectileBase {
	Unknown SphereCollision; //  0x310 Size(8)
	Unknown Projectile; //  0x318 Size(8)
	Unknown RealisticProjectile; //  0x320 Size(8)
	Unknown BulletEffect; //  0x328 Size(8)
	Unknown TrailEffectInWater; //  0x330 Size(8)
	float Damage; //  0x338 Size(4)
	Unknown StartLocation; //  0x33c Size(c)
	char bInWater; //  0x348 Size(1)
	Unknown TrailEffectsList; //  0x350 Size(50)
	Unknown BulletEffectsList; //  0x3a0 Size(50)
	Unknown StopEffectsList; //  0x3f0 Size(50)
	char bSpawnTrailEffect; //  0x440 Size(1)
	Unknown TrailNames; //  0x448 Size(10)
	Unknown TrailLocation; //  0x458 Size(c)
	Unknown TrailRotation; //  0x464 Size(c)
	char bChangeBulletEffect; //  0x470 Size(1)
	struct FString BulletEffectName; //  0x478 Size(10)
	Unknown StopEffectNames; //  0x488 Size(10)
	Unknown AuthorityController; //  0x498 Size(8)

	void SpawnTrailEffect(); // Function BravoHotelGame.BravoHotelProjectile.SpawnTrailEffect(Final|Native|Protected) // <Game+0x1fa24f0>
};

// Class BravoHotelGame.BravoHotelProjectileBullet
struct ABravoHotelProjectileBullet : ABravoHotelProjectile {
	Unknown BeginOverlapHitResults; //  0x4a8 Size(10)
	Unknown HitActors; //  0x4c0 Size(10)
	float ImpulsePowerRate; //  0x4d0 Size(4)
	Unknown ProjectileDamageType; //  0x4d8 Size(8)
	Unknown Flyb; //  0x4e0 Size(8)
	Unknown BulletSpawnLocation; //  0x4e8 Size(c)
	Unknown Flyb; //  0x4f8 Size(8)
	char bStopUpdateFlyby; //  0x500 Size(1)
	Unknown TimerHandle_UpdateFlyby; //  0x508 Size(8)
	Unknown TargetPawn; //  0x518 Size(8)

	void UpdateFlyby(); // Function BravoHotelGame.BravoHotelProjectileBullet.UpdateFlyby(Final|Native|Protected) // <Game+0x1fa2940>
};

// Class BravoHotelGame.BravoHotelProjectileGrenade
struct ABravoHotelProjectileGrenade : ABravoHotelProjectileBase {
	char bIgnoreOwner; //  0x310 Size(1)
	float Damage; //  0x314 Size(4)
	float MinimumDamage; //  0x318 Size(4)
	float DamageFalloff; //  0x31c Size(4)
	float ImpulseStrength; //  0x320 Size(4)
	char bCanApplyImpulseByBounce; //  0x324 Size(1)
	char bOverrideDropSpeed; //  0x325 Size(1)
	float DropSpeed; //  0x328 Size(4)
	Unknown HitDamageTypeClass; //  0x330 Size(8)
	Unknown DamageTypeClass; //  0x338 Size(8)
	Unknown SphereCollision; //  0x340 Size(8)
	Unknown Projectile; //  0x348 Size(8)
	Unknown TrailParticleComponent; //  0x350 Size(8)
	Unknown ProjectileMovement; //  0x358 Size(8)
	Unknown TimerHandle_GrenadeExplosio; //  0x360 Size(8)
	Unknown GrenadeExplosionEffectScale; //  0x368 Size(c)
	char bUseActorRotationGrenadeExplosionEffect; //  0x374 Size(1)
	Unknown GrenadeExplosionEffect; //  0x378 Size(8)
	Unknown GrenadeExplosionEffectInWater; //  0x380 Size(8)
	Unknown TrailEffectInWater; //  0x388 Size(8)
	Unknown SuperTrailEffect; //  0x390 Size(8)
	Unknown NormalTrailEffect; //  0x398 Size(8)
	char bNeedToDeactiveTrailParticle; //  0x3a0 Size(1)
	float SuperTrailViewDistance; //  0x3a4 Size(4)
	Unknown ShiningEffectComponent; //  0x3a8 Size(8)
	Unknown ShiningEffect; //  0x3b0 Size(8)
	float ShiningEffectViewDistance; //  0x3b8 Size(4)
	Unknown GrenadeTrailEffectInWater; //  0x3c0 Size(8)
	Unknown AkAudioComponent; //  0x3c8 Size(8)
	Unknown ExplodeEvent; //  0x3d0 Size(8)
	Unknown ExplodeEventInWater; //  0x3d8 Size(8)
	Unknown BoundEvent; //  0x3e0 Size(8)
	float RemainExplodeTime; //  0x3e8 Size(4)
	float InsideEffectRange; //  0x3ec Size(4)
	float EffectRange; //  0x3f0 Size(4)
	float TriggerRange; //  0x3f4 Size(4)
	Unknown LoopSoundHandle; //  0x3f8 Size(4)
	char bEnableActiveGrenade; //  0x3fc Size(1)
	char bLocalSameTeam; //  0x3fd Size(1)
	Unknown OverlapCharacters; //  0x400 Size(10)
	Unknown DotDamagedActors; //  0x410 Size(10)
	struct FName GrenadeWeaponName; //  0x420 Size(8)
	float HitDamage; //  0x428 Size(4)
	float HitDamageToCharacter; //  0x42c Size(4)
	float PenetrateDamage; //  0x430 Size(4)
	char bInWater; //  0x434 Size(1)
	int32_t BounceCount; //  0x438 Size(4)
	char bUseCookingTime; //  0x43c Size(1)
	char bUseBoobyTrap; //  0x43d Size(1)
	char bActiveByHit; //  0x43e Size(1)
	char bNeedServerDamage; //  0x43f Size(1)
	float Boob; //  0x440 Size(4)
	float InitialSpeed; //  0x444 Size(4)
	Unknown InitialVelocity; //  0x448 Size(c)
	char bUseRotaionProjectileMesh; //  0x454 Size(1)
	Unknown RotationSpeed; //  0x458 Size(c)
	char bIsStopSimulate; //  0x464 Size(1)
	Unknown GuidedLocation; //  0x468 Size(c)
	Unknown TimerHandle_BoobyTrap; //  0x478 Size(8)
	Unknown ProjectileGrenadeState; //  0x480 Size(1)
	char bUseActiveTriggerActorLocation; //  0x481 Size(1)
	Unknown TriggerActor; //  0x488 Size(8)
	char bApplyShortRangeHitDamage; //  0x4a8 Size(1)
	float ShortRangeHitDamageDistance; //  0x4ac Size(4)
	float ShortRangeHitDamageMultiply; //  0x4b0 Size(4)
	struct FName WeaponId; //  0x4b8 Size(8)
	struct FName ItemId; //  0x4c0 Size(8)
	char bMarkActiveGrenade; //  0x4c8 Size(1)
	char DamageAffectedByObstacle; //  0x578 Size(1)
	float ExplosionEffectRange; //  0x57c Size(4)
	float ExplosionCameraShakeScaleMin; //  0x580 Size(4)
	float ExplosionCameraShakeScaleMax; //  0x584 Size(4)
	float ExplosionDeafenDurationMin; //  0x588 Size(4)
	float ExplosionDeafenDutationMax; //  0x58c Size(4)
	float ExplosionDeafenDistanceLevelClose; //  0x590 Size(4)
	float ExplosionDeafenDistanceLevelMid; //  0x594 Size(4)
	Unknown ExplosionCameraShake; //  0x598 Size(8)
	Unknown ConditionedWeaponInfo; //  0x5a0 Size(20)
	Unknown DecalRotation; //  0x5c0 Size(c)
	Unknown AllowedDamageType; //  0x5e0 Size(10)
	float Health; //  0x5f0 Size(4)
	struct FMulticastInlineDelegate OnExplosion; //  0x5f8 Size(10)
	struct FMulticastInlineDelegate OnActiveBoobyTrapDelegate; //  0x608 Size(10)
	Unknown TimerHandle_CheckWarningVoiceEvent; //  0x618 Size(8)
	Unknown ExplosionOriginDeltaLocatio; //  0x620 Size(c)

	void UpdateTrailParticle(); // Function BravoHotelGame.BravoHotelProjectileGrenade.UpdateTrailParticle(Final|Native|Protected) // <Game+0x1fa4760>
};

// Class BravoHotelGame.BravoHotelProjectileFireAx
struct ABravoHotelProjectileFireAx : ABravoHotelProjectileGrenade {
	Unknown SimulationActorClass; //  0x638 Size(8)
	char bAttachAbsolutely; //  0x640 Size(1)
	Unknown Flyb; //  0x648 Size(8)
	Unknown FlybachAbs; //  0x650 Size(4)

	void OnAudioEmitterUnregistered(); // Function BravoHotelGame.BravoHotelProjectileFireAx.OnAudioEmitterUnregistered(Final|Native|Private) // <Game+0x1fa2b40>
};

// Class BravoHotelGame.BravoHotelProjectileFlame
struct ABravoHotelProjectileFlame : ABravoHotelProjectile {
	Unknown OverlappedVehicles; //  0x4a8 Size(50)
	Unknown FlameParticle; //  0x4f8 Size(8)
	Unknown FlameEndParticle; //  0x500 Size(8)
	Unknown AkAudioComponent; //  0x508 Size(8)
	Unknown FireCellClass; //  0x510 Size(8)
	float LifeTime; //  0x518 Size(4)
	float DamageTime; //  0x51c Size(4)
	float FireDamage; //  0x520 Size(4)
	float FireShrinkTime; //  0x524 Size(4)
	float FireCellSpawnTime; //  0x528 Size(4)
	float FirePropagationRange; //  0x52c Size(4)
	int32_t FirePropagationLevelMax; //  0x530 Size(4)
	float FirePropagationLevelWidth; //  0x534 Size(4)
	Unknown FirePropagationDivideAnglePerLevel; //  0x538 Size(10)
	Unknown Flyb; //  0x548 Size(8)
	Unknown FlybPropag; //  0x550 Size(4)
	struct FName WeaponName; //  0x554 Size(8)
	struct FString NewWeaponName; //  0x560 Size(10)
};

// Class BravoHotelGame.BravoHotelProjectileGrenadeBomb
struct ABravoHotelProjectileGrenadeBomb : ABravoHotelProjectileGrenade {
	float LandHeight; //  0x638 Size(4)
	char bUsingActiveGrenadeByTick; //  0x63c Size(1)
	Unknown DamageCollisionType; //  0x63d Size(1)
	char bIgnoreCollision; //  0x63e Size(1)
	Unknown ExplosionGroundDecalMaterial; //  0x650 Size(8)
	Unknown ExplosionGroundDecalSize; //  0x658 Size(c)
	Unknown ExplosionGroundDecalComponent; //  0x668 Size(8)
	Unknown AuthorController; //  0x670 Size(8)

	void AddExplosionDecalEffect(); // Function BravoHotelGame.BravoHotelProjectileGrenadeBomb.AddExplosionDecalEffect(Final|Native|Protected) // <Game+0x1fa4ac0>
};

// Class BravoHotelGame.BravoHotelProjectileGrenadeC4
struct ABravoHotelProjectileGrenadeC4 : ABravoHotelProjectileGrenade {
	Unknown ExplosionGroundDecalMaterial; //  0x638 Size(8)
	Unknown ExplosionGroundDecalSize; //  0x640 Size(c)
	Unknown ExplosionGroundDecalComponent; //  0x650 Size(8)
	float ActiveDelayTime; //  0x660 Size(4)
	Unknown TrapEffect; //  0x668 Size(8)
	Unknown TrapTriggerEffect; //  0x670 Size(8)
	Unknown TrapDestoryEffect; //  0x678 Size(8)
	Unknown TrapLoopStartEvent; //  0x680 Size(8)
	Unknown TrapLoopStopEvent; //  0x688 Size(8)
	Unknown TrapTriggerEvent; //  0x690 Size(8)
	Unknown AttachEvent; //  0x698 Size(8)
	Unknown TrapLoopSoundHandle; //  0x6a0 Size(4)
	Unknown AttachedComponent; //  0x6a8 Size(8)
	Unknown TimerHandle_CheckAttachedCo; //  0x6b0 Size(8)
	int32_t HitItem; //  0x6b8 Size(4)
	float ExplosionOriginDeltaLocationt; //  0x6bc Size(4)

	void OnAudioEmitterUnregistered(); // Function BravoHotelGame.BravoHotelProjectileGrenadeC4.OnAudioEmitterUnregistered(Final|Native|Protected) // <Game+0x1fa4d40>
};

// Class BravoHotelGame.BravoHotelProjectileGrenadeDynamite
struct ABravoHotelProjectileGrenadeDynamite : ABravoHotelProjectileGrenade {
	Unknown ExplosionGroundDecalMaterial; //  0x638 Size(8)
	Unknown ExplosionGroundDecalSize; //  0x640 Size(c)
	Unknown ExplosionGroundDecalComponent; //  0x650 Size(8)

	void AddExplosionDecalEffect(); // Function BravoHotelGame.BravoHotelProjectileGrenadeDynamite.AddExplosionDecalEffect(Final|Native|Protected) // <Game+0x1fa4ed0>
};

// Class BravoHotelGame.BravoHotelProjectileGrenadeFlashbang
struct ABravoHotelProjectileGrenadeFlashbang : ABravoHotelProjectileGrenade {
	Unknown AngleCurve; //  0x638 Size(8)
	Unknown TimeCurve; //  0x640 Size(8)
	Unknown PostProcessFlashBangClass; //  0x648 Size(8)
	float PostProcessDurationTime; //  0x650 Size(4)
	float PostProcessRateTime; //  0x654 Size(4)
	Unknown BlindCharacters; //  0x658 Size(10)
	Unknown TimeHandler_ActiveFlashBang; //  0x668 Size(8)
	Unknown Boob; //  0x680 Size(8)
	Unknown BoobHandler_Act; //  0x688 Size(8)
	Unknown Boob; //  0x690 Size(8)
	Unknown BoobHandler_Act; //  0x698 Size(8)
	Unknown Boob; //  0x6a0 Size(8)
	Unknown BoobHandler_Act; //  0x6a8 Size(8)
	Unknown Boob; //  0x6b0 Size(4)

	void PlayFlashbangGrenade(); // Function BravoHotelGame.BravoHotelProjectileGrenadeFlashbang.PlayFlashbangGrenade(Final|Native|Protected) // <Game+0x1fa5380>
};

// Class BravoHotelGame.BravoHotelProjectileGrenadeFragment
struct ABravoHotelProjectileGrenadeFragment : ABravoHotelProjectileGrenade {
	Unknown ExplosionGroundDecalMaterial; //  0x638 Size(8)
	Unknown ExplosionGroundDecalSize; //  0x640 Size(c)
	Unknown ExplosionGroundDecalComponent; //  0x650 Size(8)
	Unknown GroundDecalDynamicMaterial; //  0x658 Size(8)
	Unknown Flyb; //  0x668 Size(8)
	Unknown FlybndDeca; //  0x670 Size(4)

	void AddExplosionDecalEffect(); // Function BravoHotelGame.BravoHotelProjectileGrenadeFragment.AddExplosionDecalEffect(Final|Native|Protected) // <Game+0x1fa5510>
};

// Class BravoHotelGame.BravoHotelProjectileGrenadeMolotovCocktail
struct ABravoHotelProjectileGrenadeMolotovCocktail : ABravoHotelProjectileGrenade {
	Unknown FireStartSound; //  0x638 Size(8)
	Unknown FireEndSound; //  0x640 Size(8)
	Unknown FireLoopSoundHandle; //  0x648 Size(4)
	Unknown TimeHandle_EndFirewallSound; //  0x650 Size(8)
	Unknown MolotovFireTrailParticle; //  0x658 Size(8)
	Unknown Boob; //  0x660 Size(8)
	Unknown BoobtovFireTrai; //  0x668 Size(8)
	Unknown Boob; //  0x670 Size(8)
	Unknown BoobtovFireTrai; //  0x678 Size(8)
	Unknown Boob; //  0x680 Size(8)
	Unknown BoobtovFireTrai; //  0x688 Size(8)
	Unknown Boob; //  0x690 Size(4)
	Unknown TimeHandler_ActiveMolotovCo; //  0x698 Size(8)
	Unknown FireCellClass; //  0x6a8 Size(8)
	Unknown MolotovFireCells; //  0x6b0 Size(10)
	Unknown TimeHandle_SpreadingMolotov; //  0x6c8 Size(8)
	Unknown TimeHandle_ShrinkingMolotov; //  0x6d0 Size(8)
	Unknown FireLocations; //  0x6d8 Size(10)
	Unknown FirePropagations; //  0x6e8 Size(10)
	float FireSpreadFirstDelayTime; //  0x778 Size(4)
	float FireSpreadTime; //  0x77c Size(4)
	float FireShrinkTime; //  0x780 Size(4)
	char bEnableFireWall; //  0x7c8 Size(1)
	int32_t FireWallCellCount; //  0x7cc Size(4)
	float FireWallCellWidth; //  0x7d0 Size(4)
	int32_t FirePropagationLevelMax; //  0x7d4 Size(4)
	float FirePropagationLevelWidth; //  0x7d8 Size(4)
	Unknown FirePropagationDivideAnglePerLevel; //  0x7e0 Size(10)

	void SpreadingFirePropagation(); // Function BravoHotelGame.BravoHotelProjectileGrenadeMolotovCocktail.SpreadingFirePropagation(Final|Native|Protected) // <Game+0x1fa5c60>
};

// Class BravoHotelGame.BravoHotelProjectileGrenadeNuclear
struct ABravoHotelProjectileGrenadeNuclear : ABravoHotelProjectileGrenade {
	Unknown ExplosionGroundDecalMaterial; //  0x638 Size(8)
	Unknown ExplosionGroundDecalSize; //  0x640 Size(c)
	Unknown FallingEvent; //  0x650 Size(8)
	float FallingSoundDelayTime; //  0x658 Size(4)
	Unknown ExplosionGroundDecalComponent; //  0x660 Size(8)
	float LandHeight; //  0x680 Size(4)
	Unknown AuthorController; //  0x688 Size(8)
};

// Class BravoHotelGame.BravoHotelProjectileGrenadeSmoke
struct ABravoHotelProjectileGrenadeSmoke : ABravoHotelProjectileGrenade {
	Unknown SmokeTrailEffectComponent; //  0x638 Size(8)
	Unknown SpawnedSmokeFxComponent; //  0x640 Size(8)
	float SmokeLifeTime; //  0x648 Size(4)
	int32_t SmokeTranslucencySortPriority; //  0x64c Size(4)
	Unknown SmokeStartEvent; //  0x650 Size(8)
	Unknown SmokeEndEvent; //  0x658 Size(8)
	float SeeThroughSmokeOpacity; //  0x660 Size(4)
	float OpacityInSpeed; //  0x664 Size(4)
	float OpacityOutSpeed; //  0x668 Size(4)
	float SmokeCheckTime; //  0x66c Size(4)
	float PoisonCheckTime; //  0x670 Size(4)
	float PoisonCheckRange; //  0x674 Size(4)
	Unknown SmokeDebuffs; //  0x678 Size(10)
	char bActiveSmokeGrenade; //  0x688 Size(1)
	char bActiveSmokeEffect; //  0x689 Size(1)
	Unknown SpawnLocations; //  0x690 Size(10)
	Unknown AICharacters; //  0x7a8 Size(10)

	void SmokeEffectFinished(Unknown PSystem); // Function BravoHotelGame.BravoHotelProjectileGrenadeSmoke.SmokeEffectFinished(Final|Native|Public) // <Game+0x1fa6660>
};

// Class BravoHotelGame.BravoHotelProjectileMolotovFireCell
struct ABravoHotelProjectileMolotovFireCell : UActor {
	Unknown FireRoot; //  0x310 Size(8)
	Unknown FireEffect; //  0x318 Size(8)
	float LifeTime; //  0x320 Size(4)
	Unknown DamagedCharacters; //  0x328 Size(10)
	Unknown Attacker; //  0x338 Size(8)
	Unknown OwnerProjectileGrenade; //  0x340 Size(8)
	int32_t DamageTime; //  0x348 Size(4)
	float FireDamage; //  0x34c Size(4)
	float LimitRange; //  0x350 Size(4)
	char bIgnoreAttacker; //  0x354 Size(1)
	Unknown HitComponent; //  0x358 Size(8)
	Unknown TimerHandle_CheckHitComponent; //  0x360 Size(8)
	Unknown TimeHandle_LifeTime; //  0x368 Size(8)
	Unknown TimeHandle_CheckDistanceToPlayer; //  0x370 Size(8)
	Unknown DamageTypeClass; //  0x378 Size(8)
	Unknown LocalPlayingCharacter; //  0x384 Size(8)

	void OnOverlapEnd(Unknown OverlappedComponent, Unknown OtherActor, Unknown OtherComp, int32_t OtherBodyIndex); // Function BravoHotelGame.BravoHotelProjectileMolotovFireCell.OnOverlapEnd(Final|Native|Protected) // <Game+0x1fa6bd0>
};

// Class BravoHotelGame.BravoHotelQuestComponent
struct UBravoHotelQuestComponent : UActorComponent {
	Unknown SeasonQuestInfos; //  0xb0 Size(10)
	struct FMulticastInlineDelegate OnScenarioQuestStartDelegate; //  0xc0 Size(10)
	struct FMulticastInlineDelegate OnScenarioQuestUpdateDelegate; //  0xd0 Size(10)
	struct FMulticastInlineDelegate OnScenarioQuestStopDelegate; //  0xe0 Size(10)
	Unknown ScenarioQuestInfo; //  0xf0 Size(30)
	Unknown ScenarioWidgetClass; //  0x138 Size(8)
	Unknown CurrentScenarioWidget; //  0x140 Size(8)

	void StopScenarioQuest(); // Function BravoHotelGame.BravoHotelQuestComponent.StopScenarioQuest(Final|Native|Public|BlueprintCallable) // <Game+0x1fa7e00>
};

// Class BravoHotelGame.BravoHotelQuestManager
struct UBravoHotelQuestManager : Object {
	Unknown AddQuestEventDelegates; //  0xa8 Size(50)
};

// Class BravoHotelGame.BravoHotelRangedWeapon
struct ABravoHotelRangedWeapon : ABravoHotelWeaponBase {
	Unknown AttachmentComponent; //  0x2130 Size(8)
	Unknown MainWidgetRef; //  0x1fb8 Size(8)
	char bLoopedFireAnim; //  0x1d9c Size(1)
	Unknown FireAnim; //  0x2250 Size(10)
	Unknown FireWeaponAnim; //  0x1f58 Size(10)
	Unknown BoltActionPlayerAnim; //  0x22c0 Size(10)
	Unknown BoltActionWeaponAnim; //  0x1ea8 Size(10)
	Unknown BoltActionPronePlayerAnim; //  0x21d8 Size(10)
	Unknown BoltActionProneWeaponAnim; //  0x1c18 Size(10)
	char bIsEquippingVerticalgrip; //  0x1c28 Size(1)
	Unknown JointTargetLocationL; //  0x2280 Size(c)
	Unknown JointTargetLocationR; //  0x2100 Size(c)
	Unknown EffectorLocationR; //  0x2148 Size(c)
	float DeltaCollideHandIKDistance; //  0x2168 Size(4)
	char bAttachToCamera; //  0x2080 Size(1)
	int32_t FiringCountToLoop; //  0x2268 Size(4)
	Unknown FireSounds1P; //  0x1da8 Size(20)
	Unknown FireSounds3P; //  0x2178 Size(20)
	Unknown NoAmmoEvent; //  0x2170 Size(8)
	char bIsADS; //  0x1e70 Size(1)
	char bIsKeepingADS_WhileBoltAction; //  0x2070 Size(1)
	char bIsGatlingWeapon; //  0x2298 Size(1)
	Unknown DamgeCorrectCurveByVelocity; //  0x2078 Size(8)
	Unknown MuzzleEffectComponent; //  0x1c38 Size(8)
	Unknown OverrideMuzzleFlashList; //  0x1ec8 Size(50)
	Unknown OverrideMuzzleSmokeList; //  0x2088 Size(50)
	Unknown CurrentOverrideMuzzleFlash_NoAttach; //  0x2118 Size(8)
	Unknown CurrentOverrideMuzzleSmoke_NoAttach; //  0x1de8 Size(8)
	Unknown ShellCasingArrows; //  0x1e60 Size(10)
	Unknown FireLoopSoundHandle; //  0x1c14 Size(4)
	Unknown WarmupPlayingHandle; //  0x2158 Size(4)
	Unknown BulletParticleSpawnArrow; //  0x2160 Size(8)
	char bSpawnBulletParticleOnFire; //  0x1c68 Size(1)
	Unknown RecoilComponent; //  0x22b0 Size(8)
	Unknown ProjectileClass; //  0x1dd0 Size(8)
	char bServerShot; //  0x1da0 Size(1)
	Unknown RecoilCurve; //  0x1f18 Size(8)
	Unknown DamageDistanceCurve; //  0x1f40 Size(8)
	Unknown SpreadScaleFactorsOnDefault; //  0x1c70 Size(10)
	Unknown SpreadScaleFactorsOnFiring; //  0x1e90 Size(10)
	struct FName FireSocketName; //  0x1f34 Size(8)
	Unknown WeaponRecoilType; //  0x1e58 Size(1)
	Unknown ZeroPointAngles; //  0x21c8 Size(10)
	Unknown DefaultZeroingDistance; //  0x2138 Size(10)
	int32_t ProjectileRandomSeed; //  0x21b4 Size(4)
	Unknown IncendiaryInfo; //  0x2238 Size(14)
	Unknown SpawnedFireCells; //  0x1cd8 Size(10)
	Unknown ExplosionInfo; //  0x20dc Size(10)
	char bCanSkipSpawnProjectile; //  0x1e5a Size(1)
	int32_t CurrentZeroPointIndex; //  0x21a0 Size(4)
	char bIsColliding; //  0x2154 Size(1)
	char bIsADSColliding; //  0x1c50 Size(1)
	char bIsAimingDownside; //  0x1c10 Size(1)
	float CollideAlpha; //  0x229c Size(4)
	float CollideTraceLength; //  0x1f94 Size(4)
	Unknown CollideTraceStartDelta; //  0x1fa0 Size(c)
	Unknown CrouchCollideTraceStartDelta; //  0x1f6c Size(c)
