// Enum BravoHotelGame.EBuffEventType
enum class EBuffEventType : uint8 {
	EBuffEventType = 0
	EBuffEventType = 1
	EBuffEventType = 2
	EBuffEventType = 3
	EBuffEventType = 4
	EBuffEventType = 5
	EBuffEventType = 6
	EBuffEventType = 7
	EBuffEventType = 8
	EBuffEventType = 9
	EBuffEventType = 10
	EBuffEventType = 11
	EBuffEventType = 12
	EBuffEventType = 13
	EBuffEventType = 14
	EBuffEventType = 15
	EBuffEventType = 16
	EBuffEventType = 17
	EBuffEventType = 18
	EBuffEventType = 19
	EBuffEventType = 20
	EBuffEventType = 21
	EBuffEventType = 22
	EBuffEventType = 23
	EBuffEventType = 24
	EBuffEventType = 25
	EBuffEventType = 26
	EBuffEventType = 27
	EBuffEventType = 28
	EBuffEventType = 29
	EBuffEventType = 30
	EBuffEventType = 31
	EBuffEventType = 32
	EBuffEventType = 33
	EBuffEventType = 34
	EBuffEventType = 35
	EBuffEventType = 36
	EBuffEventType = 37
	EBuffEventType = 38
	EBuffEventType = 39
	EBuffEventType = 40
	EBuffEventType = 41
	EBuffEventType = 42
	EBuffEventType = 43
	EBuffEventType = 44
	EBuffEventType = 45
	EBuffEventType = 46
	EBuffEventType = 47
	EBuffEventType = 48
	EBuffEventType = 49
	EBuffEventType = 50
	EBuffEventType = 51
	EBuffEventType = 52
	EBuffEventType = 53
	EBuffEventType = 54
	EBuffEventType = 55
	EBuffEventType = 56
	EBuffEventType = 57
	EBuffEventType = 255
};

// Enum BravoHotelGame.EWeaponType
enum class EWeaponType : uint8 {
	EWeaponType = 0
	EWeaponType = 1
	EWeaponType = 2
	EWeaponType = 3
	EWeaponType = 4
	EWeaponType = 5
	EWeaponType = 6
	EWeaponType = 7
	EWeaponType = 8
	EWeaponType = 9
	EWeaponType = 10
	EWeaponType = 101
	EWeaponType = 102
	EWeaponType = 103
	EWeaponType = 104
	EWeaponType = 105
	EWeaponType = 106
};

// Enum BravoHotelGame.EWeaponBuffEventType
enum class EWeaponBuffEventType : uint8 {
	EWeaponBuffEventType = 0
	EWeaponBuffEventType = 1
	EWeaponBuffEventType = 2
	EWeaponBuffEventType = 3
	EWeaponBuffEventType = 4
	EWeaponBuffEventType = 5
	EWeaponBuffEventType = 6
	EWeaponBuffEventType = 7
	EWeaponBuffEventType = 8
	EWeaponBuffEventType = 9
	EWeaponBuffEventType = 10
	EWeaponBuffEventType = 11
	EWeaponBuffEventType = 255
};

// Enum BravoHotelGame.EMediaPlayerState
enum class EMediaPlayerState : uint8 {
	EMediaPlayerState = 0
	EMediaPlayerState = 1
	EMediaPlayerState = 2
};

// Enum BravoHotelGame.EAircraftFlightState
enum class EAircraftFlightState : uint8 {
	EAircraftFlightState = 0
	EAircraftFlightState = 1
	EAircraftFlightState = 2
	EAircraftFlightState = 3
	EAircraftFlightState = 4
	EAircraftFlightState = 5
};

// Enum BravoHotelGame.EAircraftMovementMethod
enum class EAircraftMovementMethod : uint8 {
	EAircraftMovementMethod = 0
	EAircraftMovementMethod = 1
};

// Enum BravoHotelGame.EPickupRoot
enum class EPickupRoot : uint8 {
	EPickupRoot = 0
	EPickupRoot = 1
	EPickupRoot = 2
	EPickupRoot = 3
	EPickupRoot = 4
	EPickupRoot = 255
	EPickupRoot = 256
};

// Enum BravoHotelGame.EItemBindType
enum class EItemBindType : uint8 {
	EItemBindType = 0
	EItemBindType = 1
	EItemBindType = 2
	EItemBindType = 3
	EItemBindType = 4
};

// Enum BravoHotelGame.EInventoryItemState
enum class EInventoryItemState : uint8 {
	EInventoryItemState = 0
	EInventoryItemState = 1
	EInventoryItemState = 2
	EInventoryItemState = 3
	EInventoryItemState = 4
	EInventoryItemState = 5
	EInventoryItemState = 6
	EInventoryItemState = 7
	EInventoryItemState = 8
};

// Enum BravoHotelGame.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
};

// Enum BravoHotelGame.EAbilityCase
enum class EAbilityCase : uint8 {
	EAbilityCase = 0
	EAbilityCase = 1
	EAbilityCase = 2
	EAbilityCase = 3
	EAbilityCase = 4
	EAbilityCase = 5
	EAbilityCase = 6
	EAbilityCase = 7
	EAbilityCase = 8
	EAbilityCase = 9
	EAbilityCase = 10
	EAbilityCase = 11
	EAbilityCase = 12
	EAbilityCase = 13
	EAbilityCase = 14
	EAbilityCase = 15
	EAbilityCase = 16
	EAbilityCase = 17
	EAbilityCase = 18
	EAbilityCase = 19
	EAbilityCase = 20
	EAbilityCase = 21
	EAbilityCase = 22
};

// Enum BravoHotelGame.ECharacterConditionType
enum class ECharacterConditionType : uint8 {
	ECharacterConditionType = 0
	ECharacterConditionType = 1
	ECharacterConditionType = 2
	ECharacterConditionType = 3
	ECharacterConditionType = 4
	ECharacterConditionType = 5
	ECharacterConditionType = 6
	ECharacterConditionType = 7
	ECharacterConditionType = 8
	ECharacterConditionType = 9
	ECharacterConditionType = 10
	ECharacterConditionType = 11
	ECharacterConditionType = 12
	ECharacterConditionType = 13
	ECharacterConditionType = 14
	ECharacterConditionType = 15
	ECharacterConditionType = 16
	ECharacterConditionType = 17
	ECharacterConditionType = 18
	ECharacterConditionType = 19
	ECharacterConditionType = 20
	ECharacterConditionType = 21
	ECharacterConditionType = 22
	ECharacterConditionType = 23
	ECharacterConditionType = 24
	ECharacterConditionType = 25
	ECharacterConditionType = 26
	ECharacterConditionType = 27
	ECharacterConditionType = 28
	ECharacterConditionType = 29
	ECharacterConditionType = 30
	ECharacterConditionType = 31
	ECharacterConditionType = 32
	ECharacterConditionType = 33
	ECharacterConditionType = 34
	ECharacterConditionType = 35
	ECharacterConditionType = 36
	ECharacterConditionType = 37
	ECharacterConditionType = 38
	ECharacterConditionType = 39
	ECharacterConditionType = 40
	ECharacterConditionType = 41
	ECharacterConditionType = 42
	ECharacterConditionType = 43
	ECharacterConditionType = 44
	ECharacterConditionType = 45
	ECharacterConditionType = 46
	ECharacterConditionType = 47
	ECharacterConditionType = 48
	ECharacterConditionType = 49
	ECharacterConditionType = 50
	ECharacterConditionType = 51
	ECharacterConditionType = 52
	ECharacterConditionType = 53
	ECharacterConditionType = 54
	ECharacterConditionType = 55
	ECharacterConditionType = 56
	ECharacterConditionType = 57
};

// Enum BravoHotelGame.EPerkLevelUpType
enum class EPerkLevelUpType : uint8 {
	EPerkLevelUpType = 0
	EPerkLevelUpType = 1
	EPerkLevelUpType = 2
	EPerkLevelUpType = 3
	EPerkLevelUpType = 4
	EPerkLevelUpType = 5
};

// Enum BravoHotelGame.EPerkSlotFlag
enum class EPerkSlotFlag : uint8 {
	EPerkSlotFlag = 0
	EPerkSlotFlag = 1
	EPerkSlotFlag = 2
	EPerkSlotFlag = 4
	EPerkSlotFlag = 255
	EPerkSlotFlag = 256
};

// Enum BravoHotelGame.ECastingUIType
enum class ECastingUIType : uint8 {
	ECastingUIType = 0
	ECastingUIType = 1
	ECastingUIType = 2
	ECastingUIType = 3
	ECastingUIType = 4
	ECastingUIType = 5
	ECastingUIType = 6
	ECastingUIType = 7
};

// Enum BravoHotelGame.ESettingType
enum class ESettingType : uint8 {
	ESettingType = 0
	ESettingType = 1
	ESettingType = 2
	ESettingType = 3
	ESettingType = 4
	ESettingType = 5
	ESettingType = 6
	ESettingType = 7
	ESettingType = 8
	ESettingType = 9
	ESettingType = 10
	ESettingType = 11
	ESettingType = 12
	ESettingType = 13
	ESettingType = 14
	ESettingType = 15
	ESettingType = 16
	ESettingType = 17
	ESettingType = 18
	ESettingType = 19
	ESettingType = 20
	ESettingType = 21
	ESettingType = 22
	ESettingType = 23
	ESettingType = 24
	ESettingType = 25
	ESettingType = 26
	ESettingType = 27
	ESettingType = 28
	ESettingType = 29
	ESettingType = 30
	ESettingType = 31
	ESettingType = 32
	ESettingType = 33
	ESettingType = 34
	ESettingType = 35
	ESettingType = 36
	ESettingType = 37
	ESettingType = 38
	ESettingType = 39
	ESettingType = 40
	ESettingType = 41
	ESettingType = 42
	ESettingType = 43
	ESettingType = 44
	ESettingType = 45
	ESettingType = 46
	ESettingType = 47
	ESettingType = 48
	ESettingType = 49
	ESettingType = 50
	ESettingType = 51
	ESettingType = 52
	ESettingType = 53
	ESettingType = 54
	ESettingType = 55
	ESettingType = 56
	ESettingType = 57
	ESettingType = 58
	ESettingType = 59
	ESettingType = 60
	ESettingType = 61
	ESettingType = 62
	ESettingType = 63
	ESettingType = 64
	ESettingType = 65
	ESettingType = 66
	ESettingType = 67
	ESettingType = 68
	ESettingType = 69
	ESettingType = 70
	ESettingType = 71
	ESettingType = 72
	ESettingType = 73
	ESettingType = 74
	ESettingType = 75
	ESettingType = 76
	ESettingType = 77
	ESettingType = 78
	ESettingType = 79
	ESettingType = 80
	ESettingType = 81
	ESettingType = 82
	ESettingType = 83
	ESettingType = 84
	ESettingType = 85
	ESettingType = 86
	ESettingType = 87
	ESettingType = 88
	ESettingType = 89
	ESettingType = 90
	ESettingType = 91
	ESettingType = 92
	ESettingType = 93
	ESettingType = 94
	ESettingType = 95
	ESettingType = 96
	ESettingType = 97
	ESettingType = 98
	ESettingType = 99
	ESettingType = 100
	ESettingType = 101
	ESettingType = 102
	ESettingType = 103
	ESettingType = 104
	ESettingType = 105
	ESettingType = 106
	ESettingType = 107
	ESettingType = 108
	ESettingType = 109
	ESettingType = 110
	ESettingType = 111
	ESettingType = 112
	ESettingType = 113
	ESettingType = 114
	ESettingType = 115
	ESettingType = 116
	ESettingType = 117
	ESettingType = 118
	ESettingType = 119
	ESettingType = 120
	ESettingType = 121
};

// Enum BravoHotelGame.EPlosiveSoundDetectionType
enum class EPlosiveSoundDetectionType : uint8 {
	EPlosiveSoundDetectionType = 0
	EPlosiveSoundDetectionType = 1
	EPlosiveSoundDetectionType = 2
	EPlosiveSoundDetectionType = 3
	EPlosiveSoundDetectionType = 4
};

// Enum BravoHotelGame.ELandingReason
enum class ELandingReason : uint8 {
	ELandingReason = 0
	ELandingReason = 1
	ELandingReason = 2
	ELandingReason = 3
	ELandingReason = 4
	ELandingReason = 5
	ELandingReason = 6
	ELandingReason = 7
	ELandingReason = 8
	ELandingReason = 9
	ELandingReason = 10
	ELandingReason = 11
	ELandingReason = 12
	ELandingReason = 13
	ELandingReason = 14
};

// Enum BravoHotelGame.ELeanState
enum class ELeanState : uint8 {
	ELeanState = 0
	ELeanState = 1
	ELeanState = 2
	ELeanState = 3
};

// Enum BravoHotelGame.ItemWidgetDragType
enum class ItemWidgetDragType : uint8 {
	ItemWidgetDragType = 0
	ItemWidgetDragType = 1
	ItemWidgetDragType = 2
	ItemWidgetDragType = 3
	ItemWidgetDragType = 4
	ItemWidgetDragType = 5
	ItemWidgetDragType = 6
	ItemWidgetDragType = 7
};

// Enum BravoHotelGame.EWearableItemType
enum class EWearableItemType : uint8 {
	EWearableItemType = 0
	EWearableItemType = 1
	EWearableItemType = 2
	EWearableItemType = 3
	EWearableItemType = 4
	EWearableItemType = 5
	EWearableItemType = 6
	EWearableItemType = 7
	EWearableItemType = 8
	EWearableItemType = 9
	EWearableItemType = 10
	EWearableItemType = 11
	EWearableItemType = 12
	EWearableItemType = 13
	EWearableItemType = 14
	EWearableItemType = 16
	EWearableItemType = 17
	EWearableItemType = 18
	EWearableItemType = 255
	EWearableItemType = 256
};

// Enum BravoHotelGame.ECharacterAbilityType
enum class ECharacterAbilityType : uint8 {
	ECharacterAbilityType = 0
	ECharacterAbilityType = 1
	ECharacterAbilityType = 2
	ECharacterAbilityType = 3
	ECharacterAbilityType = 4
	ECharacterAbilityType = 5
	ECharacterAbilityType = 6
	ECharacterAbilityType = 7
	ECharacterAbilityType = 8
	ECharacterAbilityType = 9
	ECharacterAbilityType = 10
	ECharacterAbilityType = 11
	ECharacterAbilityType = 12
	ECharacterAbilityType = 13
	ECharacterAbilityType = 14
	ECharacterAbilityType = 15
	ECharacterAbilityType = 16
	ECharacterAbilityType = 17
	ECharacterAbilityType = 18
	ECharacterAbilityType = 19
	ECharacterAbilityType = 20
	ECharacterAbilityType = 21
	ECharacterAbilityType = 22
	ECharacterAbilityType = 23
	ECharacterAbilityType = 24
	ECharacterAbilityType = 25
	ECharacterAbilityType = 26
	ECharacterAbilityType = 27
	ECharacterAbilityType = 28
	ECharacterAbilityType = 29
	ECharacterAbilityType = 30
	ECharacterAbilityType = 31
	ECharacterAbilityType = 32
	ECharacterAbilityType = 33
	ECharacterAbilityType = 34
	ECharacterAbilityType = 35
	ECharacterAbilityType = 36
	ECharacterAbilityType = 37
	ECharacterAbilityType = 38
	ECharacterAbilityType = 39
	ECharacterAbilityType = 40
	ECharacterAbilityType = 41
	ECharacterAbilityType = 42
	ECharacterAbilityType = 43
	ECharacterAbilityType = 44
	ECharacterAbilityType = 45
	ECharacterAbilityType = 46
	ECharacterAbilityType = 47
	ECharacterAbilityType = 48
	ECharacterAbilityType = 49
	ECharacterAbilityType = 50
	ECharacterAbilityType = 51
	ECharacterAbilityType = 52
};

// Enum BravoHotelGame.EConditionType
enum class EConditionType : uint8 {
	EConditionType = 0
	EConditionType = 1
	EConditionType = 2
	EConditionType = 3
	EConditionType = 4
};

// Enum BravoHotelGame.EThrowingWeaponState
enum class EThrowingWeaponState : uint8 {
	EThrowingWeaponState = 0
	EThrowingWeaponState = 1
	EThrowingWeaponState = 2
	EThrowingWeaponState = 3
	EThrowingWeaponState = 4
	EThrowingWeaponState = 5
	EThrowingWeaponState = 6
	EThrowingWeaponState = 7
};

// Enum BravoHotelGame.EFireType
enum class EFireType : uint8 {
	EFireType = 0
	EFireType = 1
	EFireType = 2
	EFireType = 3
	EFireType = 4
	EFireType = 5
	EFireType = 6
};

// Enum BravoHotelGame.ECharacterState
enum class ECharacterState : uint8 {
	ECharacterState = 0
	ECharacterState = 1
	ECharacterState = 2
	ECharacterState = 3
	ECharacterState = 4
	ECharacterState = 5
	ECharacterState = 6
	ECharacterState = 7
	ECharacterState = 8
	ECharacterState = 9
	ECharacterState = 10
	ECharacterState = 11
	ECharacterState = 12
	ECharacterState = 13
	ECharacterState = 14
	ECharacterState = 15
	ECharacterState = 16
	ECharacterState = 17
	ECharacterState = 18
	ECharacterState = 19
};

// Enum BravoHotelGame.EGrenadeThrowingType
enum class EGrenadeThrowingType : uint8 {
	EGrenadeThrowingType = 0
	EGrenadeThrowingType = 1
	EGrenadeThrowingType = 2
	EGrenadeThrowingType = 3
};

// Enum BravoHotelGame.EWaterDepthType
enum class EWaterDepthType : uint8 {
	EWaterDepthType = 0
	EWaterDepthType = 1
	EWaterDepthType = 2
	EWaterDepthType = 3
	EWaterDepthType = 4
	EWaterDepthType = 5
	EWaterDepthType = 6
};

// Enum BravoHotelGame.ECharacterBuffType
enum class ECharacterBuffType : uint8 {
	ECharacterBuffType = 0
	ECharacterBuffType = 2
	ECharacterBuffType = 4
	ECharacterBuffType = 8
	ECharacterBuffType = 16
	ECharacterBuffType = 32
	ECharacterBuffType = 33
};

// Enum BravoHotelGame.ESuperPeopleClass
enum class ESuperPeopleClass : uint8 {
	ESuperPeopleClass = 0
	ESuperPeopleClass = 1
	ESuperPeopleClass = 2
	ESuperPeopleClass = 3
	ESuperPeopleClass = 4
	ESuperPeopleClass = 5
	ESuperPeopleClass = 6
	ESuperPeopleClass = 7
	ESuperPeopleClass = 8
	ESuperPeopleClass = 9
	ESuperPeopleClass = 10
	ESuperPeopleClass = 11
	ESuperPeopleClass = 12
	ESuperPeopleClass = 13
};

// Enum BravoHotelGame.ECharacterAudioEventType
enum class ECharacterAudioEventType : uint8 {
	ECharacterAudioEventType = 0
	ECharacterAudioEventType = 1
	ECharacterAudioEventType = 2
	ECharacterAudioEventType = 3
	ECharacterAudioEventType = 4
	ECharacterAudioEventType = 5
	ECharacterAudioEventType = 6
};

// Enum BravoHotelGame.EBattleRoyaleState
enum class EBattleRoyaleState : uint8 {
	EBattleRoyaleState = 0
	EBattleRoyaleState = 1
	EBattleRoyaleState = 2
	EBattleRoyaleState = 3
	EBattleRoyaleState = 4
	EBattleRoyaleState = 5
	EBattleRoyaleState = 6
};

// Enum BravoHotelGame.ECharacterGroundState
enum class ECharacterGroundState : uint8 {
	ECharacterGroundState = 0
	ECharacterGroundState = 1
	ECharacterGroundState = 2
	ECharacterGroundState = 3
	ECharacterGroundState = 4
};

// Enum BravoHotelGame.EToggleWidgetModeType
enum class EToggleWidgetModeType : uint8 {
	EToggleWidgetModeType = 0
	EToggleWidgetModeType = 1
	EToggleWidgetModeType = 2
	EToggleWidgetModeType = 3
	EToggleWidgetModeType = 4
	EToggleWidgetModeType = 5
};

// Enum BravoHotelGame.ETargetHealthType
enum class ETargetHealthType : uint8 {
	ETargetHealthType = 0
	ETargetHealthType = 1
	ETargetHealthType = 2
	ETargetHealthType = 3
};

// Enum BravoHotelGame.EInteractionType
enum class EInteractionType : uint8 {
	EInteractionType = 0
	EInteractionType = 1
	EInteractionType = 2
	EInteractionType = 3
	EInteractionType = 4
	EInteractionType = 5
	EInteractionType = 6
	EInteractionType = 7
	EInteractionType = 8
	EInteractionType = 9
	EInteractionType = 10
	EInteractionType = 11
	EInteractionType = 12
	EInteractionType = 13
	EInteractionType = 14
};

// Enum BravoHotelGame.EProjectileGrenadeState
enum class EProjectileGrenadeState : uint8 {
	EProjectileGrenadeState = 0
	EProjectileGrenadeState = 1
	EProjectileGrenadeState = 2
	EProjectileGrenadeState = 3
	EProjectileGrenadeState = 4
	EProjectileGrenadeState = 5
	EProjectileGrenadeState = 6
};

// Enum BravoHotelGame.EInDoorAdjustmentTarget
enum class EInDoorAdjustmentTarget : uint8 {
	EInDoorAdjustmentTarget = 0
	EInDoorAdjustmentTarget = 1
	EInDoorAdjustmentTarget = 2
	EInDoorAdjustmentTarget = 4
	EInDoorAdjustmentTarget = 5
};

// Enum BravoHotelGame.EKeySettingType
enum class EKeySettingType : uint8 {
	EKeySettingType = 0
	EKeySettingType = 1
	EKeySettingType = 2
	EKeySettingType = 3
	EKeySettingType = 4
	EKeySettingType = 5
	EKeySettingType = 6
	EKeySettingType = 7
	EKeySettingType = 8
	EKeySettingType = 9
	EKeySettingType = 10
	EKeySettingType = 11
	EKeySettingType = 12
	EKeySettingType = 13
	EKeySettingType = 14
	EKeySettingType = 15
	EKeySettingType = 16
	EKeySettingType = 17
	EKeySettingType = 18
	EKeySettingType = 19
	EKeySettingType = 20
	EKeySettingType = 21
	EKeySettingType = 22
	EKeySettingType = 23
	EKeySettingType = 24
	EKeySettingType = 25
	EKeySettingType = 26
	EKeySettingType = 27
	EKeySettingType = 28
	EKeySettingType = 29
	EKeySettingType = 30
	EKeySettingType = 31
	EKeySettingType = 32
	EKeySettingType = 33
	EKeySettingType = 34
	EKeySettingType = 35
	EKeySettingType = 36
	EKeySettingType = 37
	EKeySettingType = 38
	EKeySettingType = 39
	EKeySettingType = 40
	EKeySettingType = 41
	EKeySettingType = 42
	EKeySettingType = 43
	EKeySettingType = 44
	EKeySettingType = 45
	EKeySettingType = 46
	EKeySettingType = 47
	EKeySettingType = 48
	EKeySettingType = 49
	EKeySettingType = 50
	EKeySettingType = 51
	EKeySettingType = 52
	EKeySettingType = 53
	EKeySettingType = 54
	EKeySettingType = 55
	EKeySettingType = 56
	EKeySettingType = 57
	EKeySettingType = 58
	EKeySettingType = 59
	EKeySettingType = 60
	EKeySettingType = 61
	EKeySettingType = 62
	EKeySettingType = 63
	EKeySettingType = 64
	EKeySettingType = 65
	EKeySettingType = 66
	EKeySettingType = 67
	EKeySettingType = 68
	EKeySettingType = 69
	EKeySettingType = 70
	EKeySettingType = 71
	EKeySettingType = 72
	EKeySettingType = 73
	EKeySettingType = 74
	EKeySettingType = 75
	EKeySettingType = 76
	EKeySettingType = 77
	EKeySettingType = 78
	EKeySettingType = 79
	EKeySettingType = 80
	EKeySettingType = 81
	EKeySettingType = 82
	EKeySettingType = 83
	EKeySettingType = 84
	EKeySettingType = 85
	EKeySettingType = 86
	EKeySettingType = 87
	EKeySettingType = 88
	EKeySettingType = 89
	EKeySettingType = 90
	EKeySettingType = 91
	EKeySettingType = 92
	EKeySettingType = 93
	EKeySettingType = 94
	EKeySettingType = 95
	EKeySettingType = 96
	EKeySettingType = 97
	EKeySettingType = 98
	EKeySettingType = 99
	EKeySettingType = 100
	EKeySettingType = 101
	EKeySettingType = 102
	EKeySettingType = 103
	EKeySettingType = 104
	EKeySettingType = 105
	EKeySettingType = 106
	EKeySettingType = 107
	EKeySettingType = 108
	EKeySettingType = 109
	EKeySettingType = 110
	EKeySettingType = 111
	EKeySettingType = 112
	EKeySettingType = 113
	EKeySettingType = 114
	EKeySettingType = 115
	EKeySettingType = 116
	EKeySettingType = 117
	EKeySettingType = 118
	EKeySettingType = 119
	EKeySettingType = 120
	EKeySettingType = 121
	EKeySettingType = 122
	EKeySettingType = 123
	EKeySettingType = 124
	EKeySettingType = 125
	EKeySettingType = 126
	EKeySettingType = 127
	EKeySettingType = 128
	EKeySettingType = 129
	EKeySettingType = 130
	EKeySettingType = 131
	EKeySettingType = 132
	EKeySettingType = 133
	EKeySettingType = 134
	EKeySettingType = 135
	EKeySettingType = 136
	EKeySettingType = 137
	EKeySettingType = 138
	EKeySettingType = 139
	EKeySettingType = 140
	EKeySettingType = 141
};

// Enum BravoHotelGame.EWeaponAttachmentItem
enum class EWeaponAttachmentItem : uint8 {
	EWeaponAttachmentItem = 0
	EWeaponAttachmentItem = 1
	EWeaponAttachmentItem = 2
	EWeaponAttachmentItem = 3
	EWeaponAttachmentItem = 4
	EWeaponAttachmentItem = 5
	EWeaponAttachmentItem = 6
	EWeaponAttachmentItem = 7
	EWeaponAttachmentItem = 8
	EWeaponAttachmentItem = 9
	EWeaponAttachmentItem = 10
	EWeaponAttachmentItem = 11
	EWeaponAttachmentItem = 12
	EWeaponAttachmentItem = 13
	EWeaponAttachmentItem = 14
	EWeaponAttachmentItem = 15
	EWeaponAttachmentItem = 16
	EWeaponAttachmentItem = 17
	EWeaponAttachmentItem = 18
	EWeaponAttachmentItem = 19
	EWeaponAttachmentItem = 20
	EWeaponAttachmentItem = 21
	EWeaponAttachmentItem = 22
	EWeaponAttachmentItem = 23
	EWeaponAttachmentItem = 24
	EWeaponAttachmentItem = 25
	EWeaponAttachmentItem = 26
	EWeaponAttachmentItem = 27
	EWeaponAttachmentItem = 28
	EWeaponAttachmentItem = 29
	EWeaponAttachmentItem = 30
	EWeaponAttachmentItem = 31
	EWeaponAttachmentItem = 32
	EWeaponAttachmentItem = 33
	EWeaponAttachmentItem = 34
	EWeaponAttachmentItem = 35
	EWeaponAttachmentItem = 36
	EWeaponAttachmentItem = 37
	EWeaponAttachmentItem = 38
	EWeaponAttachmentItem = 39
	EWeaponAttachmentItem = 40
	EWeaponAttachmentItem = 41
	EWeaponAttachmentItem = 42
	EWeaponAttachmentItem = 43
	EWeaponAttachmentItem = 44
	EWeaponAttachmentItem = 45
	EWeaponAttachmentItem = 46
	EWeaponAttachmentItem = 47
};

// Enum BravoHotelGame.ECustomMovementMode
enum class ECustomMovementMode : uint8 {
	ECustomMovementMode = 0
	ECustomMovementMode = 1
	ECustomMovementMode = 2
	ECustomMovementMode = 3
	ECustomMovementMode = 4
	ECustomMovementMode = 5
	ECustomMovementMode = 6
};

// Enum BravoHotelGame.EMouseSensitivityState
enum class EMouseSensitivityState : uint8 {
	EMouseSensitivityState = 0
	EMouseSensitivityState = 1
	EMouseSensitivityState = 2
	EMouseSensitivityState = 3
	EMouseSensitivityState = 4
	EMouseSensitivityState = 5
	EMouseSensitivityState = 6
	EMouseSensitivityState = 7
	EMouseSensitivityState = 8
	EMouseSensitivityState = 9
	EMouseSensitivityState = 10
	EMouseSensitivityState = 11
	EMouseSensitivityState = 12
	EMouseSensitivityState = 13
};

// Enum BravoHotelGame.ECharacterConditionedAbilityType
enum class ECharacterConditionedAbilityType : uint8 {
	ECharacterConditionedAbilityType = 0
	ECharacterConditionedAbilityType = 1
	ECharacterConditionedAbilityType = 2
	ECharacterConditionedAbilityType = 3
	ECharacterConditionedAbilityType = 4
	ECharacterConditionedAbilityType = 5
	ECharacterConditionedAbilityType = 6
	ECharacterConditionedAbilityType = 7
	ECharacterConditionedAbilityType = 8
	ECharacterConditionedAbilityType = 9
	ECharacterConditionedAbilityType = 10
	ECharacterConditionedAbilityType = 11
	ECharacterConditionedAbilityType = 12
	ECharacterConditionedAbilityType = 13
	ECharacterConditionedAbilityType = 14
	ECharacterConditionedAbilityType = 15
	ECharacterConditionedAbilityType = 16
	ECharacterConditionedAbilityType = 17
	ECharacterConditionedAbilityType = 18
	ECharacterConditionedAbilityType = 19
	ECharacterConditionedAbilityType = 20
	ECharacterConditionedAbilityType = 21
	ECharacterConditionedAbilityType = 22
	ECharacterConditionedAbilityType = 23
	ECharacterConditionedAbilityType = 24
	ECharacterConditionedAbilityType = 25
	ECharacterConditionedAbilityType = 26
	ECharacterConditionedAbilityType = 27
	ECharacterConditionedAbilityType = 28
	ECharacterConditionedAbilityType = 29
	ECharacterConditionedAbilityType = 30
	ECharacterConditionedAbilityType = 31
	ECharacterConditionedAbilityType = 32
	ECharacterConditionedAbilityType = 33
	ECharacterConditionedAbilityType = 34
	ECharacterConditionedAbilityType = 35
	ECharacterConditionedAbilityType = 36
	ECharacterConditionedAbilityType = 37
	ECharacterConditionedAbilityType = 38
	ECharacterConditionedAbilityType = 39
	ECharacterConditionedAbilityType = 40
	ECharacterConditionedAbilityType = 41
	ECharacterConditionedAbilityType = 42
	ECharacterConditionedAbilityType = 43
	ECharacterConditionedAbilityType = 44
	ECharacterConditionedAbilityType = 45
	ECharacterConditionedAbilityType = 46
	ECharacterConditionedAbilityType = 47
	ECharacterConditionedAbilityType = 48
	ECharacterConditionedAbilityType = 49
	ECharacterConditionedAbilityType = 50
	ECharacterConditionedAbilityType = 51
	ECharacterConditionedAbilityType = 52
	ECharacterConditionedAbilityType = 53
	ECharacterConditionedAbilityType = 54
	ECharacterConditionedAbilityType = 55
	ECharacterConditionedAbilityType = 56
	ECharacterConditionedAbilityType = 57
	ECharacterConditionedAbilityType = 58
	ECharacterConditionedAbilityType = 59
};

// Enum BravoHotelGame.EPingType
enum class EPingType : uint8 {
	EPingType = 0
	EPingType = 1
	EPingType = 2
	EPingType = 3
	EPingType = 4
	EPingType = 5
	EPingType = 6
	EPingType = 7
	EPingType = 8
	EPingType = 9
	EPingType = 10
	EPingType = 11
	EPingType = 12
	EPingType = 13
	EPingType = 14
	EPingType = 15
	EPingType = 16
	EPingType = 17
	EPingType = 18
};

// Enum BravoHotelGame.ELogTag
enum class ELogTag : uint8 {
	ELogTag = 0
	ELogTag = 1
	ELogTag = 2
};

// Enum BravoHotelGame.ELoadingScreenType
enum class ELoadingScreenType : uint8 {
	ELoadingScreenType = 0
	ELoadingScreenType = 1
	ELoadingScreenType = 2
	ELoadingScreenType = 3
	ELoadingScreenType = 4
	ELoadingScreenType = 5
	ELoadingScreenType = 6
	ELoadingScreenType = 7
	ELoadingScreenType = 8
	ELoadingScreenType = 9
};

// Enum BravoHotelGame.EHUDMessageType
enum class EHUDMessageType : uint8 {
	EHUDMessageType = 0
	EHUDMessageType = 1
	EHUDMessageType = 2
	EHUDMessageType = 3
	EHUDMessageType = 4
	EHUDMessageType = 5
	EHUDMessageType = 6
	EHUDMessageType = 7
	EHUDMessageType = 8
	EHUDMessageType = 9
	EHUDMessageType = 10
	EHUDMessageType = 11
	EHUDMessageType = 12
	EHUDMessageType = 13
	EHUDMessageType = 14
	EHUDMessageType = 15
	EHUDMessageType = 16
	EHUDMessageType = 17
	EHUDMessageType = 18
	EHUDMessageType = 19
	EHUDMessageType = 20
	EHUDMessageType = 21
	EHUDMessageType = 22
	EHUDMessageType = 23
	EHUDMessageType = 24
	EHUDMessageType = 25
	EHUDMessageType = 26
	EHUDMessageType = 27
	EHUDMessageType = 28
	EHUDMessageType = 29
	EHUDMessageType = 30
	EHUDMessageType = 31
	EHUDMessageType = 32
};

// Enum BravoHotelGame.EHUDMessageTableType
enum class EHUDMessageTableType : uint8 {
	EHUDMessageTableType = 0
	EHUDMessageTableType = 1
	EHUDMessageTableType = 2
	EHUDMessageTableType = 3
	EHUDMessageTableType = 4
};

// Enum BravoHotelGame.EPresenceState
enum class EPresenceState : uint8 {
	EPresenceState = 0
	EPresenceState = 1
	EPresenceState = 2
	EPresenceState = 3
};

// Enum BravoHotelGame.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
};

// Enum BravoHotelGame.EKeySettingSubType
enum class EKeySettingSubType : uint8 {
	EKeySettingSubType = 0
	EKeySettingSubType = 1
	EKeySettingSubType = 2
	EKeySettingSubType = 3
	EKeySettingSubType = 4
	EKeySettingSubType = 5
	EKeySettingSubType = 6
	EKeySettingSubType = 7
	EKeySettingSubType = 8
	EKeySettingSubType = 9
	EKeySettingSubType = 10
	EKeySettingSubType = 11
	EKeySettingSubType = 12
	EKeySettingSubType = 13
	EKeySettingSubType = 14
	EKeySettingSubType = 15
	EKeySettingSubType = 16
};

// Enum BravoHotelGame.ESlotType
enum class ESlotType : uint8 {
	ESlotType = 0
	ESlotType = 1
	ESlotType = 2
	ESlotType = 3
	ESlotType = 4
	ESlotType = 5
};

// Enum BravoHotelGame.ESettingBigType
enum class ESettingBigType : uint8 {
	ESettingBigType = 0
	ESettingBigType = 1
	ESettingBigType = 2
	ESettingBigType = 3
	ESettingBigType = 4
	ESettingBigType = 5
	ESettingBigType = 6
};

// Enum BravoHotelGame.EPersonalSupplyBoxPingType
enum class EPersonalSupplyBoxPingType : uint8 {
	EPersonalSupplyBoxPingType = 0
	EPersonalSupplyBoxPingType = 1
	EPersonalSupplyBoxPingType = 2
	EPersonalSupplyBoxPingType = 3
};

// Enum BravoHotelGame.CheatParamType
enum class CheatParamType : uint8 {
	CheatParamType = 0
	CheatParamType = 1
	CheatParamType = 2
	CheatParamType = 3
	CheatParamType = 4
};

// Enum BravoHotelGame.EItemPingIconType
enum class EItemPingIconType : uint8 {
	EItemPingIconType = 0
	EItemPingIconType = 1
	EItemPingIconType = 2
	EItemPingIconType = 3
	EItemPingIconType = 4
	EItemPingIconType = 5
	EItemPingIconType = 6
	EItemPingIconType = 7
	EItemPingIconType = 8
	EItemPingIconType = 9
};

// Enum BravoHotelGame.EWeaponFireMode
enum class EWeaponFireMode : uint8 {
	EWeaponFireMode = 0
	EWeaponFireMode = 1
	EWeaponFireMode = 2
	EWeaponFireMode = 3
};

// Enum BravoHotelGame.ELoadingType
enum class ELoadingType : uint8 {
	ELoadingType = 0
	ELoadingType = 1
	ELoadingType = 2
	ELoadingType = 3
};

// Enum BravoHotelGame.EWeaponAttachmentBarrel
enum class EWeaponAttachmentBarrel : uint8 {
	EWeaponAttachmentBarrel = 0
	EWeaponAttachmentBarrel = 1
	EWeaponAttachmentBarrel = 2
	EWeaponAttachmentBarrel = 3
};

// Enum BravoHotelGame.EWeaponAttachmentMuzzleDevice
enum class EWeaponAttachmentMuzzleDevice : uint8 {
	EWeaponAttachmentMuzzleDevice = 0
	EWeaponAttachmentMuzzleDevice = 1
	EWeaponAttachmentMuzzleDevice = 2
	EWeaponAttachmentMuzzleDevice = 3
	EWeaponAttachmentMuzzleDevice = 4
	EWeaponAttachmentMuzzleDevice = 5
	EWeaponAttachmentMuzzleDevice = 6
	EWeaponAttachmentMuzzleDevice = 7
	EWeaponAttachmentMuzzleDevice = 8
	EWeaponAttachmentMuzzleDevice = 9
	EWeaponAttachmentMuzzleDevice = 10
	EWeaponAttachmentMuzzleDevice = 11
	EWeaponAttachmentMuzzleDevice = 12
};

// Enum BravoHotelGame.EWeaponAttachmentStock
enum class EWeaponAttachmentStock : uint8 {
	EWeaponAttachmentStock = 0
	EWeaponAttachmentStock = 1
	EWeaponAttachmentStock = 2
	EWeaponAttachmentStock = 3
	EWeaponAttachmentStock = 4
	EWeaponAttachmentStock = 5
	EWeaponAttachmentStock = 6
};

// Enum BravoHotelGame.EWeaponAttachmentMagazine
enum class EWeaponAttachmentMagazine : uint8 {
	EWeaponAttachmentMagazine = 0
	EWeaponAttachmentMagazine = 1
	EWeaponAttachmentMagazine = 2
	EWeaponAttachmentMagazine = 3
	EWeaponAttachmentMagazine = 4
	EWeaponAttachmentMagazine = 5
	EWeaponAttachmentMagazine = 6
	EWeaponAttachmentMagazine = 7
	EWeaponAttachmentMagazine = 8
	EWeaponAttachmentMagazine = 9
	EWeaponAttachmentMagazine = 10
	EWeaponAttachmentMagazine = 11
	EWeaponAttachmentMagazine = 12
	EWeaponAttachmentMagazine = 13
	EWeaponAttachmentMagazine = 14
};

// Enum BravoHotelGame.EWeaponAttachmentGrip
enum class EWeaponAttachmentGrip : uint8 {
	EWeaponAttachmentGrip = 0
	EWeaponAttachmentGrip = 1
	EWeaponAttachmentGrip = 2
	EWeaponAttachmentGrip = 3
};

// Enum BravoHotelGame.EWeaponAttachmentType
enum class EWeaponAttachmentType : uint8 {
	EWeaponAttachmentType = 0
	EWeaponAttachmentType = 1
	EWeaponAttachmentType = 2
	EWeaponAttachmentType = 3
	EWeaponAttachmentType = 4
	EWeaponAttachmentType = 5
	EWeaponAttachmentType = 6
	EWeaponAttachmentType = 7
	EWeaponAttachmentType = 8
	EWeaponAttachmentType = 9
	EWeaponAttachmentType = 10
	EWeaponAttachmentType = 11
	EWeaponAttachmentType = 12
	EWeaponAttachmentType = 13
};

// Enum BravoHotelGame.EWeaponAttachmentUseType
enum class EWeaponAttachmentUseType : uint8 {
	EWeaponAttachmentUseType = 0
	EWeaponAttachmentUseType = 1
	EWeaponAttachmentUseType = 2
	EWeaponAttachmentUseType = 3
};

// Enum BravoHotelGame.EThrowingWeaponType
enum class EThrowingWeaponType : uint8 {
	EThrowingWeaponType = 0
	EThrowingWeaponType = 1
	EThrowingWeaponType = 2
	EThrowingWeaponType = 3
	EThrowingWeaponType = 4
	EThrowingWeaponType = 5
	EThrowingWeaponType = 6
};

// Enum BravoHotelGame.EGuideWidgetType
enum class EGuideWidgetType : uint8 {
	EGuideWidgetType = 0
	EGuideWidgetType = 1
	EGuideWidgetType = 2
	EGuideWidgetType = 3
	EGuideWidgetType = 4
	EGuideWidgetType = 5
	EGuideWidgetType = 6
	EGuideWidgetType = 7
	EGuideWidgetType = 8
	EGuideWidgetType = 9
	EGuideWidgetType = 10
	EGuideWidgetType = 11
};

// Enum BravoHotelGame.EBravoHotel_ZipUtilityCompressionFormat
enum class EBravoHotel_ZipUtilityCompressionFormat : uint8 {
	EBravoHotel_ZipUtilityCompressionFormat = 0
	EBravoHotel_ZipUtilityCompressionFormat = 1
	EBravoHotel_ZipUtilityCompressionFormat = 2
	EBravoHotel_ZipUtilityCompressionFormat = 3
	EBravoHotel_ZipUtilityCompressionFormat = 4
	EBravoHotel_ZipUtilityCompressionFormat = 5
	EBravoHotel_ZipUtilityCompressionFormat = 6
	EBravoHotel_ZipUtilityCompressionFormat = 7
	EBravoHotel_ZipUtilityCompressionFormat = 8
	EBravoHotel_ZipUtilityCompressionFormat = 9
	EBravoHotel_ZipUtilityCompressionFormat = 10
	EBravoHotel_ZipUtilityCompressionFormat = 11
};

// Enum BravoHotelGame.EAudioSettingType
enum class EAudioSettingType : uint8 {
	EAudioSettingType = 0
	EAudioSettingType = 1
	EAudioSettingType = 2
	EAudioSettingType = 3
	EAudioSettingType = 4
	EAudioSettingType = 5
	EAudioSettingType = 6
	EAudioSettingType = 7
};

// Enum BravoHotelGame.EBeginReportWidgetType
enum class EBeginReportWidgetType : uint8 {
	EBeginReportWidgetType = 0
	EBeginReportWidgetType = 1
	EBeginReportWidgetType = 2
	EBeginReportWidgetType = 3
	EBeginReportWidgetType = 4
};

// Enum BravoHotelGame.EGameExitType
enum class EGameExitType : uint8 {
	EGameExitType = 0
	EGameExitType = 1
	EGameExitType = 2
	EGameExitType = 3
};

// Enum BravoHotelGame.ELobbyExitType
enum class ELobbyExitType : uint8 {
	ELobbyExitType = 0
	ELobbyExitType = 1
	ELobbyExitType = 2
	ELobbyExitType = 3
	ELobbyExitType = 4
	ELobbyExitType = 5
};

// Enum BravoHotelGame.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
	E = 4
	E = 5
};

// Enum BravoHotelGame.ENormalType
enum class ENormalType : uint8 {
	ENormalType = 0
	ENormalType = 1
	ENormalType = 2
	ENormalType = 3
	ENormalType = 4
	ENormalType = 5
	ENormalType = 6
	ENormalType = 7
	ENormalType = 8
	ENormalType = 9
	ENormalType = 10
	ENormalType = 11
	ENormalType = 12
	ENormalType = 13
	ENormalType = 14
	ENormalType = 15
	ENormalType = 16
	ENormalType = 17
};

// Enum BravoHotelGame.EDevelopmentStatus
enum class EDevelopmentStatus : uint8 {
	EDevelopmentStatus = 0
	EDevelopmentStatus = 1
	EDevelopmentStatus = 2
	EDevelopmentStatus = 3
};

// Enum BravoHotelGame.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
};

// Enum BravoHotelGame.EItemRarity
enum class EItemRarity : uint8 {
	EItemRarity = 0
	EItemRarity_1 = 0
	EItemRarity_2 = 1
	EItemRarity_3 = 2
	EItemRarity_4 = 3
	EItemRarity_5 = 4
	EItemRarity_6 = 5
	EItemRarity_7 = 6
	EItemRarity_8 = 7
	EItemRarity_9 = 8
	EItemRarity_10 = 9
	EItemRarity_11 = 10
	EItemRarity = 11
};

// Enum BravoHotelGame.EGenderType
enum class EGenderType : uint8 {
	EGenderType = 0
	EGenderType = 1
	EGenderType = 2
	EGenderType = 3
	EGenderType = 4
};

// Enum BravoHotelGame.EItemLifeTimeType
enum class EItemLifeTimeType : uint8 {
	EItemLifeTimeType = 0
	EItemLifeTimeType = 1
	EItemLifeTimeType = 2
	EItemLifeTimeType = 3
	EItemLifeTimeType = 4
	EItemLifeTimeType = 5
};

// Enum BravoHotelGame.EConsumablesItemType
enum class EConsumablesItemType : uint8 {
	EConsumablesItemType = 0
	EConsumablesItemType = 1
	EConsumablesItemType = 2
	EConsumablesItemType = 3
	EConsumablesItemType = 4
	EConsumablesItemType = 5
	EConsumablesItemType = 6
	EConsumablesItemType = 7
	EConsumablesItemType = 8
	EConsumablesItemType = 9
	EConsumablesItemType = 10
	EConsumablesItemType = 11
	EConsumablesItemType = 12
	EConsumablesItemType = 255
	EConsumablesItemType = 256
};

// Enum BravoHotelGame.EItemType
enum class EItemType : uint8 {
	EItemType = 0
	EItemType = 1
	EItemType = 2
	EItemType = 3
	EItemType = 4
	EItemType = 5
	EItemType = 6
	EItemType = 7
	EItemType = 8
	EItemType = 9
	EItemType = 10
	EItemType = 11
	EItemType = 12
	EItemType = 13
};

// Enum BravoHotelGame.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
};

// Enum BravoHotelGame.EPlayerState
enum class EPlayerState : uint8 {
	EPlayerState = 0
	EPlayerState = 1
	EPlayerState = 2
	EPlayerState = 3
	EPlayerState = 4
	EPlayerState = 5
	EPlayerState = 6
	EPlayerState = 7
	EPlayerState = 8
	EPlayerState = 9
	EPlayerState = 10
	EPlayerState = 11
	EPlayerState = 12
	EPlayerState = 13
};

// Enum BravoHotelGame.EItemSpawnPriorityType
enum class EItemSpawnPriorityType : uint8 {
	EItemSpawnPriorityType = 0
	EItemSpawnPriorityType = 1
	EItemSpawnPriorityType = 2
	EItemSpawnPriorityType = 3
};

// Enum BravoHotelGame.ESpectatingMode
enum class ESpectatingMode : uint8 {
	ESpectatingMode = 0
	ESpectatingMode = 1
	ESpectatingMode = 2
	ESpectatingMode = 3
	ESpectatingMode = 4
	ESpectatingMode = 5
};

// Enum BravoHotelGame.EPlayerBehavior
enum class EPlayerBehavior : uint8 {
	EPlayerBehavior = 0
	EPlayerBehavior = 1
	EPlayerBehavior = 2
	EPlayerBehavior = 3
	EPlayerBehavior = 4
	EPlayerBehavior = 5
	EPlayerBehavior = 6
	EPlayerBehavior = 7
	EPlayerBehavior = 8
};

// Enum BravoHotelGame.EPromotionCondition
enum class EPromotionCondition : uint8 {
	EPromotionCondition = 0
	EPromotionCondition = 1
};

// Enum BravoHotelGame.EProjectileBehavior
enum class EProjectileBehavior : uint8 {
	EProjectileBehavior = 0
	EProjectileBehavior = 1
	EProjectileBehavior = 2
	EProjectileBehavior = 3
};

// Enum BravoHotelGame.EQuestTaskType
enum class EQuestTaskType : uint8 {
	EQuestTaskType = 0
	EQuestTaskType = 1
	EQuestTaskType = 2
	EQuestTaskType = 3
	EQuestTaskType = 4
	EQuestTaskType = 5
	EQuestTaskType = 6
	EQuestTaskType = 7
	EQuestTaskType = 8
	EQuestTaskType = 9
	EQuestTaskType = 10
	EQuestTaskType = 11
};

// Enum BravoHotelGame.EVehicleState
enum class EVehicleState : uint8 {
	EVehicleState = 1
	EVehicleState = 2
	EVehicleState = 3
	EVehicleState = 4
	EVehicleState = 5
	EVehicleState = 6
	EVehicleState = 7
	EVehicleState = 8
	EVehicleState = 9
};

// Enum BravoHotelGame.EQuestState
enum class EQuestState : uint8 {
	EQuestState = 0
	EQuestState = 1
	EQuestState = 2
	EQuestState = 3
	EQuestState = 4
};

// Enum BravoHotelGame.EDediGameCheatType
enum class EDediGameCheatType : uint8 {
	EDediGameCheatType = 0
	EDediGameCheatType = 1
	EDediGameCheatType = 2
};

// Enum BravoHotelGame.EMatchingType
enum class EMatchingType : uint8 {
	EMatchingType = 0
	EMatchingType = 1
	EMatchingType = 2
	EMatchingType = 4
	EMatchingType = 5
};

// Enum BravoHotelGame.EGameViewType
enum class EGameViewType : uint8 {
	EGameViewType = 0
	EGameViewType = 1
	EGameViewType = 2
	EGameViewType = 3
};

// Enum BravoHotelGame.ELoginType
enum class ELoginType : uint8 {
	ELoginType = 0
	ELoginType = 1
	ELoginType = 2
	ELoginType = 3
	ELoginType = 4
	ELoginType = 5
};

// Enum BravoHotelGame.EGameMode
enum class EGameMode : uint8 {
	EGameMode = 0
	EGameMode = 1
	EGameMode = 2
	EGameMode = 3
	EGameMode = 4
	EGameMode = 5
};

// Enum BravoHotelGame.EBluseZoneState
enum class EBluseZoneState : uint8 {
	EBluseZoneState = 0
	EBluseZoneState = 1
	EBluseZoneState = 2
	EBluseZoneState = 3
	EBluseZoneState = 4
};

// Enum BravoHotelGame.EWorldMapAreaWidgetType
enum class EWorldMapAreaWidgetType : uint8 {
	EWorldMapAreaWidgetType = 0
	EWorldMapAreaWidgetType = 1
	EWorldMapAreaWidgetType = 2
	EWorldMapAreaWidgetType = 3
	EWorldMapAreaWidgetType = 4
	EWorldMapAreaWidgetType = 5
	EWorldMapAreaWidgetType = 6
	EWorldMapAreaWidgetType = 7
	EWorldMapAreaWidgetType = 8
	EWorldMapAreaWidgetType = 9
	EWorldMapAreaWidgetType = 10
	EWorldMapAreaWidgetType = 11
	EWorldMapAreaWidgetType = 12
	EWorldMapAreaWidgetType = 13
	EWorldMapAreaWidgetType = 14
	EWorldMapAreaWidgetType = 15
	EWorldMapAreaWidgetType = 16
	EWorldMapAreaWidgetType = 17
	EWorldMapAreaWidgetType = 18
	EWorldMapAreaWidgetType = 19
	EWorldMapAreaWidgetType = 20
	EWorldMapAreaWidgetType = 21
	EWorldMapAreaWidgetType = 22
};

// Enum BravoHotelGame.EBroadCastTeamType
enum class EBroadCastTeamType : uint8 {
	EBroadCastTeamType = 0
	EBroadCastTeamType = 1
	EBroadCastTeamType = 2
	EBroadCastTeamType = 3
	EBroadCastTeamType = 4
};

// Enum BravoHotelGame.EBroadCastKillMessageType
enum class EBroadCastKillMessageType : uint8 {
	EBroadCastKillMessageType = 0
	EBroadCastKillMessageType = 1
	EBroadCastKillMessageType = 2
	EBroadCastKillMessageType = 3
	EBroadCastKillMessageType = 4
	EBroadCastKillMessageType = 5
};

// Enum BravoHotelGame.EStatupAnimType
enum class EStatupAnimType : uint8 {
	EStatupAnimType = 0
	EStatupAnimType = 1
	EStatupAnimType = 2
	EStatupAnimType = 3
	EStatupAnimType = 4
	EStatupAnimType = 5
	EStatupAnimType = 6
};

// Enum BravoHotelGame.ESceneType
enum class ESceneType : uint8 {
	ESceneType = 0
	ESceneType = 1
	ESceneType = 2
	ESceneType = 3
	ESceneType = 4
	ESceneType = 5
	ESceneType = 6
	ESceneType = 7
	ESceneType = 8
	ESceneType = 9
	ESceneType = 10
	ESceneType = 11
	ESceneType = 12
	ESceneType = 13
};

// Enum BravoHotelGame.ELoginFlow
enum class ELoginFlow : uint8 {
	ELoginFlow = 0
	ELoginFlow = 1
	ELoginFlow = 2
	ELoginFlow = 3
	ELoginFlow = 4
};

// Enum BravoHotelGame.ESteamPresenceState
enum class ESteamPresenceState : uint8 {
	ESteamPresenceState = 0
	ESteamPresenceState = 1
	ESteamPresenceState = 2
	ESteamPresenceState = 3
	ESteamPresenceState = 4
	ESteamPresenceState = 5
	ESteamPresenceState = 6
};

// Enum BravoHotelGame.EVehicleWheelType
enum class EVehicleWheelType : uint8 {
	EVehicleWheelType = 0
	EVehicleWheelType = 1
	EVehicleWheelType = 2
	EVehicleWheelType = 3
	EVehicleWheelType = 4
};

// Enum BravoHotelGame.EWeaponAnimationType
enum class EWeaponAnimationType : uint8 {
	EWeaponAnimationType = 0
	EWeaponAnimationType = 1
	EWeaponAnimationType = 2
	EWeaponAnimationType = 3
	EWeaponAnimationType = 4
	EWeaponAnimationType = 5
	EWeaponAnimationType = 6
	EWeaponAnimationType = 7
	EWeaponAnimationType = 8
	EWeaponAnimationType = 9
	EWeaponAnimationType = 10
};

// Enum BravoHotelGame.EWeaponState
enum class EWeaponState : uint8 {
	EWeaponState = 0
	EWeaponState = 1
	EWeaponState = 2
	EWeaponState = 3
	EWeaponState = 4
	EWeaponState = 5
};

// Enum BravoHotelGame.EWeaponAttachmentMagazineType
enum class EWeaponAttachmentMagazineType : uint8 {
	EWeaponAttachmentMagazineType = 0
	EWeaponAttachmentMagazineType = 1
	EWeaponAttachmentMagazineType = 2
	EWeaponAttachmentMagazineType = 3
	EWeaponAttachmentMagazineType = 4
};

// Enum BravoHotelGame.EWeaponRecoilType
enum class EWeaponRecoilType : uint8 {
	EWeaponRecoilType_2 = 0
	EWeaponRecoilType_3 = 1
	EWeaponRecoilType = 2
};

// Enum BravoHotelGame.ETeamType
enum class ETeamType : uint8 {
	ETeamType = 0
	ETeamType = 1
	ETeamType = 2
	ETeamType = 3
	ETeamType = 4
};

// Enum BravoHotelGame.EBattleRoyalTeamState
enum class EBattleRoyalTeamState : uint8 {
	EBattleRoyalTeamState = 0
	EBattleRoyalTeamState = 1
	EBattleRoyalTeamState = 2
	EBattleRoyalTeamState = 3
};

// Enum BravoHotelGame.EBoxStateType
enum class EBoxStateType : uint8 {
	EBoxStateType = 0
	EBoxStateType = 1
	EBoxStateType = 2
	EBoxStateType = 3
	EBoxStateType = 4
	EBoxStateType = 5
};

// Enum BravoHotelGame.EAssignReason
enum class EAssignReason : uint8 {
	EAssignReason = 0
	EAssignReason = 1
	EAssignReason = 2
	EAssignReason = 3
	EAssignReason = 4
	EAssignReason = 5
};

// Enum BravoHotelGame.EPersonalSupplyBoxState
enum class EPersonalSupplyBoxState : uint8 {
	EPersonalSupplyBoxState = 0
	EPersonalSupplyBoxState = 1
	EPersonalSupplyBoxState = 2
	EPersonalSupplyBoxState = 3
	EPersonalSupplyBoxState = 4
	EPersonalSupplyBoxState = 5
	EPersonalSupplyBoxState = 6
};

// Enum BravoHotelGame.ECharacterClassFlag
enum class ECharacterClassFlag : uint8 {
	ECharacterClassFlag = 0
	ECharacterClassFlag = 1
	ECharacterClassFlag = 2
	ECharacterClassFlag = 4
	ECharacterClassFlag = 8
	ECharacterClassFlag = 16
	ECharacterClassFlag = 32
	ECharacterClassFlag = 64
	ECharacterClassFlag = 128
	ECharacterClassFlag = 255
	ECharacterClassFlag = 256
};

// Enum BravoHotelGame.ECharacterMovmentStateType
enum class ECharacterMovmentStateType : uint8 {
	ECharacterMovmentStateType = 0
	ECharacterMovmentStateType = 1
	ECharacterMovmentStateType = 2
	ECharacterMovmentStateType = 3
	ECharacterMovmentStateType = 4
	ECharacterMovmentStateType = 5
	ECharacterMovmentStateType = 6
	ECharacterMovmentStateType = 7
	ECharacterMovmentStateType = 8
	ECharacterMovmentStateType = 9
	ECharacterMovmentStateType = 10
	ECharacterMovmentStateType = 11
	ECharacterMovmentStateType = 12
	ECharacterMovmentStateType = 13
	ECharacterMovmentStateType = 14
	ECharacterMovmentStateType = 15
	ECharacterMovmentStateType = 16
	ECharacterMovmentStateType = 17
	ECharacterMovmentStateType = 18
	ECharacterMovmentStateType = 19
	ECharacterMovmentStateType = 20
	ECharacterMovmentStateType = 21
	ECharacterMovmentStateType = 22
	ECharacterMovmentStateType = 23
	ECharacterMovmentStateType = 24
	ECharacterMovmentStateType = 25
};

// Enum BravoHotelGame.EBuffTargetType
enum class EBuffTargetType : uint8 {
	EBuffTargetType = 0
	EBuffTargetType = 1
	EBuffTargetType = 2
	EBuffTargetType = 3
};

// Enum BravoHotelGame.EAbilityCombineType
enum class EAbilityCombineType : uint8 {
	EAbilityCombineType = 0
	EAbilityCombineType = 1
	EAbilityCombineType = 2
	EAbilityCombineType = 3
	EAbilityCombineType = 4
	EAbilityCombineType = 5
	EAbilityCombineType = 6
};

// Enum BravoHotelGame.ESoundCondition
enum class ESoundCondition : int32 {
	ESoundCondition = 1
	ESoundCondition = 2
	ESoundCondition = 4
	ESoundCondition = 8
	ESoundCondition = 16
	ESoundCondition = 32
	ESoundCondition = 64
	ESoundCondition = 128
	ESoundCondition = 256
	ESoundCondition = 512
	ESoundCondition = 1024
	ESoundCondition = 2048
	ESoundCondition = 4096
	ESoundCondition = 8192
	ESoundCondition = 16384
	ESoundCondition = 32768
	ESoundCondition = 65536
	ESoundCondition = 131072
	ESoundCondition = 262144
	ESoundCondition = 524288
	ESoundCondition = 1048576
	ESoundCondition = 2097152
	ESoundCondition = 2097153
};

// Enum BravoHotelGame.EAppAudioState
enum class EAppAudioState : uint8 {
	EAppAudioState = 0
	EAppAudioState = 1
	EAppAudioState = 2
	EAppAudioState = 3
	EAppAudioState = 4
	EAppAudioState = 5
	EAppAudioState = 6
};

// Enum BravoHotelGame.EIndoorConditionTargets
enum class EIndoorConditionTargets : uint8 {
	EIndoorConditionTargets = 1
	EIndoorConditionTargets = 2
	EIndoorConditionTargets = 3
	EIndoorConditionTargets = 4
};

// Enum BravoHotelGame.EOcclusionMethod
enum class EOcclusionMethod : uint8 {
	EOcclusionMethod = 0
	EOcclusionMethod = 1
	EOcclusionMethod = 2
	EOcclusionMethod = 3
};

// Enum BravoHotelGame.ECrosshairPosition
enum class ECrosshairPosition : uint8 {
	ECrosshairPosition = 0
	ECrosshairPosition = 1
	ECrosshairPosition = 2
	ECrosshairPosition = 3
	ECrosshairPosition = 4
	ECrosshairPosition = 5
	ECrosshairPosition = 6
};

// Enum BravoHotelGame.EContentsType
enum class EContentsType : uint8 {
	EContentsType = 0
	EContentsType = 1
	EContentsType = 2
	EContentsType = 3
	EContentsType = 4
	EContentsType = 5
	EContentsType = 6
	EContentsType = 7
	EContentsType = 8
	EContentsType = 9
	EContentsType = 10
	EContentsType = 11
	EContentsType = 12
	EContentsType = 13
	EContentsType = 14
	EContentsType = 15
	EContentsType = 16
};

// Enum BravoHotelGame.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
	E = 4
	E = 5
};

// Enum BravoHotelGame.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
};

// Enum BravoHotelGame.EItemLogType
enum class EItemLogType : uint8 {
	EItemLogType = 0
	EItemLogType = 1
	EItemLogType = 2
	EItemLogType = 3
	EItemLogType = 4
	EItemLogType = 5
	EItemLogType = 6
	EItemLogType = 7
};

// Enum BravoHotelGame.EDataItemType
enum class EDataItemType : uint8 {
	EDataItemType = 0
	EDataItemType = 1
	EDataItemType = 2
	EDataItemType = 3
	EDataItemType = 4
};

// Enum BravoHotelGame.EClientGameContentsType
enum class EClientGameContentsType : uint8 {
	EClientGameContentsType = 0
	EClientGameContentsType = 1
	EClientGameContentsType = 2
	EClientGameContentsType = 3
	EClientGameContentsType = 4
	EClientGameContentsType = 5
	EClientGameContentsType = 6
	EClientGameContentsType = 7
	EClientGameContentsType = 8
	EClientGameContentsType = 9
	EClientGameContentsType = 10
	EClientGameContentsType = 11
	EClientGameContentsType = 12
	EClientGameContentsType = 13
	EClientGameContentsType = 14
	EClientGameContentsType = 15
	EClientGameContentsType = 16
	EClientGameContentsType = 17
	EClientGameContentsType = 18
	EClientGameContentsType = 19
	EClientGameContentsType = 20
	EClientGameContentsType = 21
	EClientGameContentsType = 22
	EClientGameContentsType = 23
	EClientGameContentsType = 24
	EClientGameContentsType = 25
	EClientGameContentsType = 26
	EClientGameContentsType = 27
	EClientGameContentsType = 28
	EClientGameContentsType = 29
	EClientGameContentsType = 30
	EClientGameContentsType = 31
	EClientGameContentsType = 32
	EClientGameContentsType = 33
	EClientGameContentsType = 34
	EClientGameContentsType = 35
	EClientGameContentsType = 36
	EClientGameContentsType = 37
	EClientGameContentsType = 38
	EClientGameContentsType = 39
	EClientGameContentsType = 40
	EClientGameContentsType = 41
	EClientGameContentsType = 42
	EClientGameContentsType = 43
	EClientGameContentsType = 44
	EClientGameContentsType = 45
};

// Enum BravoHotelGame.EEventTypeClientGameStateData
enum class EEventTypeClientGameStateData : uint8 {
	EEventTypeClientGameStateData = 0
	EEventTypeClientGameStateData = 1
	EEventTypeClientGameStateData = 2
	EEventTypeClientGameStateData = 3
	EEventTypeClientGameStateData = 4
};

// Enum BravoHotelGame.EEventTypeClientGameWeaponData
enum class EEventTypeClientGameWeaponData : uint8 {
	EEventTypeClientGameWeaponData = 0
	EEventTypeClientGameWeaponData = 1
	EEventTypeClientGameWeaponData = 2
	EEventTypeClientGameWeaponData = 3
	EEventTypeClientGameWeaponData = 4
};

// Enum BravoHotelGame.EEventTypeClientGameInventoryData
enum class EEventTypeClientGameInventoryData : uint8 {
	EEventTypeClientGameInventoryData = 0
	EEventTypeClientGameInventoryData = 1
	EEventTypeClientGameInventoryData = 2
	EEventTypeClientGameInventoryData = 3
};

// Enum BravoHotelGame.EEventTypeClientGameVehicleData
enum class EEventTypeClientGameVehicleData : uint8 {
	EEventTypeClientGameVehicleData = 0
	EEventTypeClientGameVehicleData = 1
	EEventTypeClientGameVehicleData = 2
	EEventTypeClientGameVehicleData = 3
	EEventTypeClientGameVehicleData = 4
};

// Enum BravoHotelGame.EEventTypeClientGameRevivalData
enum class EEventTypeClientGameRevivalData : uint8 {
	EEventTypeClientGameRevivalData = 0
	EEventTypeClientGameRevivalData = 1
	EEventTypeClientGameRevivalData = 2
	EEventTypeClientGameRevivalData = 3
};

// Enum BravoHotelGame.EEventTypeClientGameDiedData
enum class EEventTypeClientGameDiedData : uint8 {
	EEventTypeClientGameDiedData = 0
	EEventTypeClientGameDiedData = 1
	EEventTypeClientGameDiedData = 2
	EEventTypeClientGameDiedData = 3
};

// Enum BravoHotelGame.EEventTypeClientGameKnockDownedData
enum class EEventTypeClientGameKnockDownedData : uint8 {
	EEventTypeClientGameKnockDownedData = 0
	EEventTypeClientGameKnockDownedData = 1
	EEventTypeClientGameKnockDownedData = 2
	EEventTypeClientGameKnockDownedData = 3
};

// Enum BravoHotelGame.EEventTypeClientGameBattleData
enum class EEventTypeClientGameBattleData : uint8 {
	EEventTypeClientGameBattleData = 0
	EEventTypeClientGameBattleData = 1
	EEventTypeClientGameBattleData = 2
	EEventTypeClientGameBattleData = 3
	EEventTypeClientGameBattleData = 4
	EEventTypeClientGameBattleData = 5
	EEventTypeClientGameBattleData = 6
};

// Enum BravoHotelGame.EEventTypeClientGameThrowableData
enum class EEventTypeClientGameThrowableData : uint8 {
	EEventTypeClientGameThrowableData = 0
	EEventTypeClientGameThrowableData = 1
	EEventTypeClientGameThrowableData = 2
};

// Enum BravoHotelGame.EEventTypeClientGameInteractionData
enum class EEventTypeClientGameInteractionData : uint8 {
	EEventTypeClientGameInteractionData = 0
	EEventTypeClientGameInteractionData = 1
	EEventTypeClientGameInteractionData = 2
	EEventTypeClientGameInteractionData = 3
	EEventTypeClientGameInteractionData = 4
	EEventTypeClientGameInteractionData = 5
};

// Enum BravoHotelGame.EEventTypeClientGameItemSearchData
enum class EEventTypeClientGameItemSearchData : uint8 {
	EEventTypeClientGameItemSearchData = 0
	EEventTypeClientGameItemSearchData = 1
	EEventTypeClientGameItemSearchData = 2
};

// Enum BravoHotelGame.EEventTypeClientGameItemData
enum class EEventTypeClientGameItemData : uint8 {
	EEventTypeClientGameItemData = 0
	EEventTypeClientGameItemData = 1
	EEventTypeClientGameItemData = 2
	EEventTypeClientGameItemData = 3
	EEventTypeClientGameItemData = 4
	EEventTypeClientGameItemData = 5
	EEventTypeClientGameItemData = 6
	EEventTypeClientGameItemData = 7
	EEventTypeClientGameItemData = 8
	EEventTypeClientGameItemData = 9
	EEventTypeClientGameItemData = 10
};

// Enum BravoHotelGame.EEventTypeClientGameSkillData
enum class EEventTypeClientGameSkillData : uint8 {
	EEventTypeClientGameSkillData = 0
	EEventTypeClientGameSkillData = 1
	EEventTypeClientGameSkillData = 2
	EEventTypeClientGameSkillData = 3
};

// Enum BravoHotelGame.EEventTypeClientGameSupplyBoxData
enum class EEventTypeClientGameSupplyBoxData : uint8 {
	EEventTypeClientGameSupplyBoxData = 0
	EEventTypeClientGameSupplyBoxData = 1
	EEventTypeClientGameSupplyBoxData = 2
	EEventTypeClientGameSupplyBoxData = 3
};

// Enum BravoHotelGame.EEventTypeClientData
enum class EEventTypeClientData : int32 {
	EEventTypeClientData = 0
	EEventTypeClientData = 10101
	EEventTypeClientData = 10102
	EEventTypeClientData = 10103
	EEventTypeClientData = 10104
	EEventTypeClientData = 10105
};

// Enum BravoHotelGame.EEventTypeWorldItemData
enum class EEventTypeWorldItemData : int32 {
	EEventTypeWorldItemData = 0
	EEventTypeWorldItemData = 50101
	EEventTypeWorldItemData = 50102
	EEventTypeWorldItemData = 50103
	EEventTypeWorldItemData = 50104
};

// Enum BravoHotelGame.EEventTypeUseItemData
enum class EEventTypeUseItemData : int32 {
	EEventTypeUseItemData = 0
	EEventTypeUseItemData = 40301
	EEventTypeUseItemData = 40302
	EEventTypeUseItemData = 40303
	EEventTypeUseItemData = 40304
};

// Enum BravoHotelGame.EEventTypeSupplyData
enum class EEventTypeSupplyData : uint8 {
	EEventTypeSupplyData = 0
	EEventTypeSupplyData = 1
	EEventTypeSupplyData = 2
	EEventTypeSupplyData = 3
};

// Enum BravoHotelGame.EEventTypeTransportData
enum class EEventTypeTransportData : uint8 {
	EEventTypeTransportData = 0
	EEventTypeTransportData = 1
	EEventTypeTransportData = 2
	EEventTypeTransportData = 3
	EEventTypeTransportData = 4
	EEventTypeTransportData = 5
};

// Enum BravoHotelGame.EEventTypeRedZoneData
enum class EEventTypeRedZoneData : uint8 {
	EEventTypeRedZoneData = 0
	EEventTypeRedZoneData = 1
	EEventTypeRedZoneData = 2
	EEventTypeRedZoneData = 3
};

// Enum BravoHotelGame.EEventTypeBlueZoneData
enum class EEventTypeBlueZoneData : uint8 {
	EEventTypeBlueZoneData = 0
	EEventTypeBlueZoneData = 1
	EEventTypeBlueZoneData = 2
	EEventTypeBlueZoneData = 3
	EEventTypeBlueZoneData = 4
	EEventTypeBlueZoneData = 5
};

// Enum BravoHotelGame.EEventTypeBattleRoyalData
enum class EEventTypeBattleRoyalData : uint8 {
	EEventTypeBattleRoyalData = 0
	EEventTypeBattleRoyalData = 1
	EEventTypeBattleRoyalData = 2
	EEventTypeBattleRoyalData = 3
	EEventTypeBattleRoyalData = 4
	EEventTypeBattleRoyalData = 5
	EEventTypeBattleRoyalData = 6
	EEventTypeBattleRoyalData = 7
};

// Enum BravoHotelGame.EEventTypeWeaponData
enum class EEventTypeWeaponData : int32 {
	EEventTypeWeaponData = 0
	EEventTypeWeaponData = 40201
	EEventTypeWeaponData = 40202
	EEventTypeWeaponData = 40203
	EEventTypeWeaponData = 40204
	EEventTypeWeaponData = 40205
	EEventTypeWeaponData = 40206
	EEventTypeWeaponData = 40207
	EEventTypeWeaponData = 40208
};

// Enum BravoHotelGame.EEventTypeCharacterFlyingData
enum class EEventTypeCharacterFlyingData : uint8 {
	EEventTypeCharacterFlyingData = 0
	EEventTypeCharacterFlyingData = 1
	EEventTypeCharacterFlyingData = 2
	EEventTypeCharacterFlyingData = 3
	EEventTypeCharacterFlyingData = 4
};

// Enum BravoHotelGame.EEventTypeCharacterData
enum class EEventTypeCharacterData : int32 {
	EEventTypeCharacterData = 0
	EEventTypeCharacterData = 40101
	EEventTypeCharacterData = 40102
	EEventTypeCharacterData = 40103
	EEventTypeCharacterData = 40104
	EEventTypeCharacterData = 40105
	EEventTypeCharacterData = 40106
	EEventTypeCharacterData = 40107
	EEventTypeCharacterData = 40108
	EEventTypeCharacterData = 40109
	EEventTypeCharacterData = 40110
	EEventTypeCharacterData = 40111
	EEventTypeCharacterData = 40112
	EEventTypeCharacterData = 40113
	EEventTypeCharacterData = 40114
	EEventTypeCharacterData = 40115
	EEventTypeCharacterData = 40116
	EEventTypeCharacterData = 40117
	EEventTypeCharacterData = 40118
	EEventTypeCharacterData = 40119
	EEventTypeCharacterData = 40120
	EEventTypeCharacterData = 40121
	EEventTypeCharacterData = 40122
	EEventTypeCharacterData = 40123
	EEventTypeCharacterData = 40124
	EEventTypeCharacterData = 40125
	EEventTypeCharacterData = 40126
	EEventTypeCharacterData = 40127
	EEventTypeCharacterData = 40128
	EEventTypeCharacterData = 40129
	EEventTypeCharacterData = 40130
	EEventTypeCharacterData = 40131
	EEventTypeCharacterData = 40132
	EEventTypeCharacterData = 40133
	EEventTypeCharacterData = 40134
	EEventTypeCharacterData = 40135
	EEventTypeCharacterData = 40136
	EEventTypeCharacterData = 40137
	EEventTypeCharacterData = 40138
	EEventTypeCharacterData = 40139
	EEventTypeCharacterData = 40140
	EEventTypeCharacterData = 40141
	EEventTypeCharacterData = 40142
	EEventTypeCharacterData = 40143
	EEventTypeCharacterData = 40144
	EEventTypeCharacterData = 40145
	EEventTypeCharacterData = 40146
};

// Enum BravoHotelGame.EEventTypePlayerData
enum class EEventTypePlayerData : int32 {
	EEventTypePlayerData = 0
	EEventTypePlayerData = 30101
	EEventTypePlayerData = 30102
	EEventTypePlayerData = 30103
	EEventTypePlayerData = 30104
};

// Enum BravoHotelGame.EEventTypeGameData
enum class EEventTypeGameData : int32 {
	EEventTypeGameData = 0
	EEventTypeGameData = 20101
	EEventTypeGameData = 20102
	EEventTypeGameData = 20103
	EEventTypeGameData = 20104
};

// Enum BravoHotelGame.EBlackmarketGearSortType
enum class EBlackmarketGearSortType : uint8 {
	EBlackmarketGearSortType = 0
	EBlackmarketGearSortType = 1
	EBlackmarketGearSortType = 2
	EBlackmarketGearSortType = 3
	EBlackmarketGearSortType = 4
	EBlackmarketGearSortType = 5
};

// Enum BravoHotelGame.EBlackmarketCustomSortType
enum class EBlackmarketCustomSortType : uint8 {
	EBlackmarketCustomSortType = 0
	EBlackmarketCustomSortType = 1
};

// Enum BravoHotelGame.EBlackmarketConsumableSortType
enum class EBlackmarketConsumableSortType : uint8 {
	EBlackmarketConsumableSortType = 0
	EBlackmarketConsumableSortType = 1
	EBlackmarketConsumableSortType = 2
	EBlackmarketConsumableSortType = 3
	EBlackmarketConsumableSortType = 4
	EBlackmarketConsumableSortType = 5
};

// Enum BravoHotelGame.EBlackmarketWearableSortType
enum class EBlackmarketWearableSortType : uint8 {
	EBlackmarketWearableSortType = 0
	EBlackmarketWearableSortType = 1
	EBlackmarketWearableSortType = 2
	EBlackmarketWearableSortType = 3
	EBlackmarketWearableSortType = 4
	EBlackmarketWearableSortType = 5
};

// Enum BravoHotelGame.EBlackmarketAttachmentSortType
enum class EBlackmarketAttachmentSortType : uint8 {
	EBlackmarketAttachmentSortType = 0
	EBlackmarketAttachmentSortType = 1
	EBlackmarketAttachmentSortType = 2
	EBlackmarketAttachmentSortType = 3
	EBlackmarketAttachmentSortType = 4
	EBlackmarketAttachmentSortType = 5
	EBlackmarketAttachmentSortType = 6
	EBlackmarketAttachmentSortType = 7
	EBlackmarketAttachmentSortType = 8
};

// Enum BravoHotelGame.EBlackmarketAmmoSortType
enum class EBlackmarketAmmoSortType : uint8 {
	EBlackmarketAmmoSortType = 0
	EBlackmarketAmmoSortType = 1
	EBlackmarketAmmoSortType = 2
	EBlackmarketAmmoSortType = 3
	EBlackmarketAmmoSortType = 4
};

// Enum BravoHotelGame.EBlackmarketWeaponSortType
enum class EBlackmarketWeaponSortType : uint8 {
	EBlackmarketWeaponSortType = 0
	EBlackmarketWeaponSortType = 1
	EBlackmarketWeaponSortType = 2
	EBlackmarketWeaponSortType = 3
	EBlackmarketWeaponSortType = 4
	EBlackmarketWeaponSortType = 5
	EBlackmarketWeaponSortType = 6
	EBlackmarketWeaponSortType = 7
	EBlackmarketWeaponSortType = 8
	EBlackmarketWeaponSortType = 9
	EBlackmarketWeaponSortType = 10
};

// Enum BravoHotelGame.EBlackmarketTabType
enum class EBlackmarketTabType : uint8 {
	EBlackmarketTabType = 0
	EBlackmarketTabType = 1
	EBlackmarketTabType = 2
	EBlackmarketTabType = 3
	EBlackmarketTabType = 4
	EBlackmarketTabType = 5
	EBlackmarketTabType = 6
	EBlackmarketTabType = 7
	EBlackmarketTabType = 8
	EBlackmarketTabType = 9
	EBlackmarketTabType = 10
};

// Enum BravoHotelGame.EDoorSoundType
enum class EDoorSoundType : uint8 {
	EDoorSoundType = 0
	EDoorSoundType = 1
	EDoorSoundType = 2
	EDoorSoundType = 3
	EDoorSoundType = 4
	EDoorSoundType = 5
	EDoorSoundType = 6
	EDoorSoundType = 7
};

// Enum BravoHotelGame.EElevatorStateType
enum class EElevatorStateType : uint8 {
	EElevatorStateType = 0
	EElevatorStateType = 1
	EElevatorStateType = 2
};

// Enum BravoHotelGame.EElevatorDoorStateType
enum class EElevatorDoorStateType : uint8 {
	EElevatorDoorStateType = 0
	EElevatorDoorStateType = 1
	EElevatorDoorStateType = 2
	EElevatorDoorStateType = 3
	EElevatorDoorStateType = 4
	EElevatorDoorStateType = 5
};

// Enum BravoHotelGame.ENetworkLoginFlowFlags
enum class ENetworkLoginFlowFlags : uint8 {
	ENetworkLoginFlowFlags = 0
	ENetworkLoginFlowFlags = 1
	ENetworkLoginFlowFlags = 2
	ENetworkLoginFlowFlags = 4
	ENetworkLoginFlowFlags = 5
	ENetworkLoginFlowFlags = 7
	ENetworkLoginFlowFlags = 8
};

// Enum BravoHotelGame.EGameResultWidgetMode
enum class EGameResultWidgetMode : uint8 {
	EGameResultWidgetMode = 0
	EGameResultWidgetMode = 1
	EGameResultWidgetMode = 2
	EGameResultWidgetMode = 3
	EGameResultWidgetMode = 4
	EGameResultWidgetMode = 5
	EGameResultWidgetMode = 6
};

// Enum BravoHotelGame.EGoogleCloudType
enum class EGoogleCloudType : uint8 {
	EGoogleCloudType = 0
	EGoogleCloudType = 1
	EGoogleCloudType = 2
	EGoogleCloudType = 3
};

// Enum BravoHotelGame.EItemEquipType
enum class EItemEquipType : uint8 {
	EItemEquipType = 0
	EItemEquipType = 1
	EItemEquipType = 2
};

// Enum BravoHotelGame.EItemLocation
enum class EItemLocation : uint8 {
	EItemLocation = 0
	EItemLocation = 1
	EItemLocation = 2
	EItemLocation = 3
};

// Enum BravoHotelGame.EBattleMode
enum class EBattleMode : uint8 {
	EBattleMode = 1
	EBattleMode = 2
	EBattleMode = 4
	EBattleMode = 5
};

// Enum BravoHotelGame.EWebGameServerMode
enum class EWebGameServerMode : uint8 {
	EWebGameServerMode = 0
	EWebGameServerMode = 1
	EWebGameServerMode = 2
	EWebGameServerMode = 3
	EWebGameServerMode = 4
};

// Enum BravoHotelGame.ECompareItemType
enum class ECompareItemType : uint8 {
	ECompareItemType = 0
	ECompareItemType = 1
	ECompareItemType = 2
	ECompareItemType = 3
};

// Enum BravoHotelGame.EItemEffectSubParticleSpawnState
enum class EItemEffectSubParticleSpawnState : uint8 {
	EItemEffectSubParticleSpawnState = 0
	EItemEffectSubParticleSpawnState = 1
	EItemEffectSubParticleSpawnState = 2
};

// Enum BravoHotelGame.EPatrolDirection
enum class EPatrolDirection : uint8 {
	EPatrolDirection = 0
	EPatrolDirection = 1
	EPatrolDirection = 2
};

// Enum BravoHotelGame.EEventLogType
enum class EEventLogType : uint8 {
	EEventLogType = 0
	EEventLogType = 1
	EEventLogType = 2
	EEventLogType = 3
	EEventLogType = 4
	EEventLogType = 5
	EEventLogType = 6
	EEventLogType = 7
	EEventLogType = 8
	EEventLogType = 9
	EEventLogType = 10
	EEventLogType = 11
	EEventLogType = 12
	EEventLogType = 13
	EEventLogType = 14
	EEventLogType = 15
	EEventLogType = 16
	EEventLogType = 17
	EEventLogType = 18
	EEventLogType = 19
	EEventLogType = 20
	EEventLogType = 21
	EEventLogType = 22
	EEventLogType = 23
	EEventLogType = 24
	EEventLogType = 25
	EEventLogType = 26
	EEventLogType = 27
	EEventLogType = 28
	EEventLogType = 29
	EEventLogType = 30
	EEventLogType = 31
	EEventLogType = 32
	EEventLogType = 33
	EEventLogType = 34
};

// Enum BravoHotelGame.EMoveElevatorStateType
enum class EMoveElevatorStateType : uint8 {
	EMoveElevatorStateType = 0
	EMoveElevatorStateType = 1
	EMoveElevatorStateType = 2
	EMoveElevatorStateType = 3
	EMoveElevatorStateType = 4
};

// Enum BravoHotelGame.ECloudPlatformType
enum class ECloudPlatformType : uint8 {
	ECloudPlatformType = 0
	ECloudPlatformType = 1
	ECloudPlatformType = 2
};

// Enum BravoHotelGame.EClientOutGameContentsType
enum class EClientOutGameContentsType : uint8 {
	EClientOutGameContentsType = 0
	EClientOutGameContentsType = 1
	EClientOutGameContentsType = 2
	EClientOutGameContentsType = 3
	EClientOutGameContentsType = 4
	EClientOutGameContentsType = 5
	EClientOutGameContentsType = 6
	EClientOutGameContentsType = 7
	EClientOutGameContentsType = 8
	EClientOutGameContentsType = 9
	EClientOutGameContentsType = 10
	EClientOutGameContentsType = 11
	EClientOutGameContentsType = 12
	EClientOutGameContentsType = 13
	EClientOutGameContentsType = 14
	EClientOutGameContentsType = 15
	EClientOutGameContentsType = 16
	EClientOutGameContentsType = 17
	EClientOutGameContentsType = 18
};

// Enum BravoHotelGame.EEventTypeClientOutGameFirstClientRunData
enum class EEventTypeClientOutGameFirstClientRunData : uint8 {
	EEventTypeClientOutGameFirstClientRunData = 0
	EEventTypeClientOutGameFirstClientRunData = 1
	EEventTypeClientOutGameFirstClientRunData = 2
	EEventTypeClientOutGameFirstClientRunData = 3
	EEventTypeClientOutGameFirstClientRunData = 4
	EEventTypeClientOutGameFirstClientRunData = 5
	EEventTypeClientOutGameFirstClientRunData = 6
	EEventTypeClientOutGameFirstClientRunData = 7
	EEventTypeClientOutGameFirstClientRunData = 8
	EEventTypeClientOutGameFirstClientRunData = 9
	EEventTypeClientOutGameFirstClientRunData = 10
	EEventTypeClientOutGameFirstClientRunData = 11
	EEventTypeClientOutGameFirstClientRunData = 12
	EEventTypeClientOutGameFirstClientRunData = 13
	EEventTypeClientOutGameFirstClientRunData = 14
	EEventTypeClientOutGameFirstClientRunData = 15
	EEventTypeClientOutGameFirstClientRunData = 16
	EEventTypeClientOutGameFirstClientRunData = 17
	EEventTypeClientOutGameFirstClientRunData = 18
	EEventTypeClientOutGameFirstClientRunData = 19
};

// Enum BravoHotelGame.EEventTypeClientOutGameTutorialData
enum class EEventTypeClientOutGameTutorialData : uint8 {
	EEventTypeClientOutGameTutorialData = 0
	EEventTypeClientOutGameTutorialData = 1
	EEventTypeClientOutGameTutorialData = 2
	EEventTypeClientOutGameTutorialData = 3
	EEventTypeClientOutGameTutorialData = 4
	EEventTypeClientOutGameTutorialData = 5
};

// Enum BravoHotelGame.EEventTypeClientOutGameExitData
enum class EEventTypeClientOutGameExitData : uint8 {
	EEventTypeClientOutGameExitData = 0
	EEventTypeClientOutGameExitData = 1
	EEventTypeClientOutGameExitData = 2
};

// Enum BravoHotelGame.EEventTypeClientOutGameActionData
enum class EEventTypeClientOutGameActionData : uint8 {
	EEventTypeClientOutGameActionData = 0
	EEventTypeClientOutGameActionData = 1
	EEventTypeClientOutGameActionData = 2
};

// Enum BravoHotelGame.EEventTypeClientOutGameLoginData
enum class EEventTypeClientOutGameLoginData : uint8 {
	EEventTypeClientOutGameLoginData = 0
	EEventTypeClientOutGameLoginData = 1
	EEventTypeClientOutGameLoginData = 2
	EEventTypeClientOutGameLoginData = 3
};

// Enum BravoHotelGame.EEventTypeClientOutGameMatchingData
enum class EEventTypeClientOutGameMatchingData : uint8 {
	EEventTypeClientOutGameMatchingData = 0
	EEventTypeClientOutGameMatchingData = 1
	EEventTypeClientOutGameMatchingData = 2
	EEventTypeClientOutGameMatchingData = 3
};

// Enum BravoHotelGame.EItemSortType
enum class EItemSortType : uint8 {
	EItemSortType = 0
	EItemSortType = 1
	EItemSortType = 2
	EItemSortType = 3
	EItemSortType = 4
	EItemSortType = 5
	EItemSortType = 6
};

// Enum BravoHotelGame.EPickUpItemEffectType
enum class EPickUpItemEffectType : uint8 {
	EPickUpItemEffectType = 0
	EPickUpItemEffectType = 1
	EPickUpItemEffectType = 2
	EPickUpItemEffectType = 3
};

// Enum BravoHotelGame.EPopupWidgetButtonFlags
enum class EPopupWidgetButtonFlags : uint8 {
	EPopupWidgetButtonFlags = 0
	EPopupWidgetButtonFlags = 1
	EPopupWidgetButtonFlags = 2
	EPopupWidgetButtonFlags = 4
	EPopupWidgetButtonFlags = 5
};

// Enum BravoHotelGame.EAchievementState
enum class EAchievementState : uint8 {
	EAchievementState = 0
	EAchievementState = 1
	EAchievementState = 2
	EAchievementState = 3
};

// Enum BravoHotelGame.EAchievementType
enum class EAchievementType : uint8 {
	EAchievementType = 0
	EAchievementType = 1
	EAchievementType = 2
	EAchievementType = 3
	EAchievementType = 4
};

// Enum BravoHotelGame.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
};

// Enum BravoHotelGame.EDropBoxState
enum class EDropBoxState : uint8 {
	EDropBoxState = 0
	EDropBoxState = 1
	EDropBoxState = 2
	EDropBoxState = 3
	EDropBoxState = 4
	EDropBoxState = 5
};

// Enum BravoHotelGame.EGameLoadingStep
enum class EGameLoadingStep : uint8 {
	EGameLoadingStep = 0
	EGameLoadingStep = 1
	EGameLoadingStep = 2
	EGameLoadingStep = 3
};

// Enum BravoHotelGame.ELanguageType
enum class ELanguageType : uint8 {
	ELanguageType = 0
	ELanguageType = 1
	ELanguageType = 2
	ELanguageType = 3
	ELanguageType = 4
	ELanguageType = 5
	ELanguageType = 6
	ELanguageType = 7
	ELanguageType = 8
	ELanguageType = 9
};

// Enum BravoHotelGame.EMailMsgTag
enum class EMailMsgTag : uint8 {
	EMailMsgTag = 0
	EMailMsgTag = 1
	EMailMsgTag = 2
	EMailMsgTag = 3
};

// Enum BravoHotelGame.EMailMsgSaveOption
enum class EMailMsgSaveOption : uint8 {
	EMailMsgSaveOption = 0
	EMailMsgSaveOption = 1
	EMailMsgSaveOption = 2
	EMailMsgSaveOption = 3
};

// Enum BravoHotelGame.EMailMsgType
enum class EMailMsgType : uint8 {
	EMailMsgType = 0
	EMailMsgType = 1
	EMailMsgType = 2
};

// Enum BravoHotelGame.ECommunicatorType
enum class ECommunicatorType : uint8 {
	ECommunicatorType = 0
	ECommunicatorType = 1
	ECommunicatorType = 2
	ECommunicatorType = 3
	ECommunicatorType = 4
};

// Enum BravoHotelGame.EBlockType
enum class EBlockType : uint8 {
	EBlockType = 0
	EBlockType = 1
	EBlockType = 2
	EBlockType = 3
};

// Enum BravoHotelGame.EBroadCastKillerType
enum class EBroadCastKillerType : uint8 {
	EBroadCastKillerType = 0
	EBroadCastKillerType = 1
	EBroadCastKillerType = 2
	EBroadCastKillerType = 3
	EBroadCastKillerType = 4
};

// Enum BravoHotelGame.EAutoMoveSnapshotActionType
enum class EAutoMoveSnapshotActionType : uint8 {
	EAutoMoveSnapshotActionType = 0
	EAutoMoveSnapshotActionType = 1
	EAutoMoveSnapshotActionType = 2
	EAutoMoveSnapshotActionType = 3
	EAutoMoveSnapshotActionType = 4
	EAutoMoveSnapshotActionType = 5
	EAutoMoveSnapshotActionType = 6
	EAutoMoveSnapshotActionType = 7
	EAutoMoveSnapshotActionType = 8
};

// Enum BravoHotelGame.EMatchRateCaseType
enum class EMatchRateCaseType : uint8 {
	EMatchRateCaseType = 0
	EMatchRateCaseType = 1
	EMatchRateCaseType = 2
	EMatchRateCaseType = 3
	EMatchRateCaseType = 4
	EMatchRateCaseType = 5
	EMatchRateCaseType = 6
	EMatchRateCaseType = 7
};

// Enum BravoHotelGame.EDeafenDistanceLevel
enum class EDeafenDistanceLevel : uint8 {
	EDeafenDistanceLevel = 0
	EDeafenDistanceLevel = 1
	EDeafenDistanceLevel = 2
	EDeafenDistanceLevel = 3
};

// Enum BravoHotelGame.EMouseCursorType
enum class EMouseCursorType : uint8 {
	EMouseCursorType = 0
	EMouseCursorType = 1
	EMouseCursorType = 2
};

// Enum BravoHotelGame.EStatusType
enum class EStatusType : uint8 {
	EStatusType = 0
	EStatusType = 1
	EStatusType = 2
	EStatusType = 3
};

// Enum BravoHotelGame.EPlayerListSortType
enum class EPlayerListSortType : uint8 {
	EPlayerListSortType = 0
	EPlayerListSortType = 1
	EPlayerListSortType = 2
	EPlayerListSortType = 3
	EPlayerListSortType = 4
};

// Enum BravoHotelGame.CheatSubType
enum class CheatSubType : uint8 {
	CheatSubType = 0
	CheatSubType = 1
	CheatSubType = 2
	CheatSubType = 3
	CheatSubType = 4
	CheatSubType = 5
	CheatSubType = 6
	CheatSubType = 7
	CheatSubType = 8
	CheatSubType = 9
	CheatSubType = 10
};

// Enum BravoHotelGame.CheatMainType
enum class CheatMainType : uint8 {
	CheatMainType = 0
	CheatMainType = 1
	CheatMainType = 2
	CheatMainType = 3
	CheatMainType = 4
};

// Enum BravoHotelGame.EVehicleTransmissionType
enum class EVehicleTransmissionType : uint8 {
	EVehicleTransmissionType = 0
	EVehicleTransmissionType = 1
	EVehicleTransmissionType = 2
	EVehicleTransmissionType = 3
};

// Enum BravoHotelGame.EDoorState
enum class EDoorState : uint8 {
	EDoorState = 0
	EDoorState = 1
	EDoorState = 2
	EDoorState = 3
	EDoorState = 4
	EDoorState = 5
	EDoorState = 6
};

// Enum BravoHotelGame.EPingActorType
enum class EPingActorType : uint8 {
	EPingActorType = 0
	EPingActorType = 1
	EPingActorType = 2
	EPingActorType = 3
	EPingActorType = 4
};

// Enum BravoHotelGame.EPingIconAnimationStateType
enum class EPingIconAnimationStateType : uint8 {
	EPingIconAnimationStateType = 0
	EPingIconAnimationStateType = 1
	EPingIconAnimationStateType = 2
	EPingIconAnimationStateType = 3
};

// Enum BravoHotelGame.EPingIconLoopAnimationType
enum class EPingIconLoopAnimationType : uint8 {
	EPingIconLoopAnimationType = 0
	EPingIconLoopAnimationType = 1
	EPingIconLoopAnimationType = 2
	EPingIconLoopAnimationType = 3
	EPingIconLoopAnimationType = 4
	EPingIconLoopAnimationType = 5
};

// Enum BravoHotelGame.EPingIconTransitionAnimationType
enum class EPingIconTransitionAnimationType : uint8 {
	EPingIconTransitionAnimationType = 0
	EPingIconTransitionAnimationType = 1
	EPingIconTransitionAnimationType = 2
	EPingIconTransitionAnimationType = 3
	EPingIconTransitionAnimationType = 4
};

// Enum BravoHotelGame.ETimeOfDayType
enum class ETimeOfDayType : uint8 {
	ETimeOfDayType = 0
	ETimeOfDayType = 1
	ETimeOfDayType = 2
	ETimeOfDayType = 3
};

// Enum BravoHotelGame.EWaterViewCameraType
enum class EWaterViewCameraType : uint8 {
	EWaterViewCameraType = 0
	EWaterViewCameraType = 1
	EWaterViewCameraType = 2
	EWaterViewCameraType = 3
};

// Enum BravoHotelGame.ECharacterVoicePriorityType
enum class ECharacterVoicePriorityType : uint8 {
	ECharacterVoicePriorityType = 0
	ECharacterVoicePriorityType = 1
	ECharacterVoicePriorityType = 2
};

// Enum BravoHotelGame.ECharacterVoiceRPCType
enum class ECharacterVoiceRPCType : uint8 {
	ECharacterVoiceRPCType = 0
	ECharacterVoiceRPCType = 1
	ECharacterVoiceRPCType = 2
	ECharacterVoiceRPCType = 3
};

// Enum BravoHotelGame.ESteamAvatarSize
enum class ESteamAvatarSize : uint8 {
	ESteamAvatarSize = 0
	ESteamAvatarSize = 1
	ESteamAvatarSize = 2
	ESteamAvatarSize = 3
	ESteamAvatarSize = 4
};

// Enum BravoHotelGame.EUpLoadDataType
enum class EUpLoadDataType : uint8 {
	EUpLoadDataType = 0
	EUpLoadDataType = 1
	EUpLoadDataType = 2
	EUpLoadDataType = 3
};

// Enum BravoHotelGame.EMovementDirection
enum class EMovementDirection : uint8 {
	EMovementDirection = 0
	EMovementDirection = 1
	EMovementDirection = 2
};

// Enum BravoHotelGame.ECardinalDirection
enum class ECardinalDirection : uint8 {
	ECardinalDirection = 0
	ECardinalDirection = 1
	ECardinalDirection = 2
	ECardinalDirection = 3
	ECardinalDirection = 4
};

// Enum BravoHotelGame.EVehicleExitSide
enum class EVehicleExitSide : uint8 {
	EVehicleExitSide = 0
	EVehicleExitSide = 1
	EVehicleExitSide = 2
	EVehicleExitSide = 3
};

// Enum BravoHotelGame.EVehicleEffect
enum class EVehicleEffect : uint8 {
	EVehicleEffect = 0
	EVehicleEffect = 1
	EVehicleEffect = 2
	EVehicleEffect = 3
	EVehicleEffect = 4
};

// Enum BravoHotelGame.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
	E = 4
};

// Enum BravoHotelGame.EPerkSpawnType
enum class EPerkSpawnType : uint8 {
	EPerkSpawnType = 0
	EPerkSpawnType = 1
	EPerkSpawnType = 2
};

// Enum BravoHotelGame.ESurviveType
enum class ESurviveType : uint8 {
	ESurviveType = 0
	ESurviveType = 1
	ESurviveType = 2
	ESurviveType = 3
	ESurviveType = 4
	ESurviveType = 5
};

// Enum BravoHotelGame.ESimpleWeaponAnimationType
enum class ESimpleWeaponAnimationType : uint8 {
	ESimpleWeaponAnimationType = 0
	ESimpleWeaponAnimationType = 1
	ESimpleWeaponAnimationType = 2
};

// Enum BravoHotelGame.ELadderState
enum class ELadderState : uint8 {
	ELadderState = 0
	ELadderState = 1
	ELadderState = 2
	ELadderState = 3
	ELadderState = 4
	ELadderState = 5
	ELadderState = 6
	ELadderState = 7
};

// Enum BravoHotelGame.ELadderInteractionType
enum class ELadderInteractionType : uint8 {
	ELadderInteractionType = 0
	ELadderInteractionType = 1
	ELadderInteractionType = 2
	ELadderInteractionType = 3
	ELadderInteractionType = 4
	ELadderInteractionType = 5
};

// Enum BravoHotelGame.EWeaponAttachmentSight
enum class EWeaponAttachmentSight : uint8 {
	EWeaponAttachmentSight = 0
	EWeaponAttachmentSight = 1
	EWeaponAttachmentSight = 2
	EWeaponAttachmentSight = 3
	EWeaponAttachmentSight = 4
	EWeaponAttachmentSight = 5
	EWeaponAttachmentSight = 6
	EWeaponAttachmentSight = 7
	EWeaponAttachmentSight = 8
};

// Enum BravoHotelGame.EProjectileType
enum class EProjectileType : uint8 {
	EProjectileType = 0
	EProjectileType = 1
	EProjectileType = 2
	EProjectileType = 3
	EProjectileType = 4
	EProjectileType = 5
	EProjectileType = 6
	EProjectileType = 7
};

// Enum BravoHotelGame.ETerrainType
enum class ETerrainType : int32 {
	ETerrainType = 0
	ETerrainType = 2
	ETerrainType = 4
	ETerrainType = 8
	ETerrainType = 16
	ETerrainType = 32
	ETerrainType = 64
	ETerrainType = 128
	ETerrainType = 256
	ETerrainType = 512
	ETerrainType = 513
};

// Enum BravoHotelGame.EHumanWeaponHitArea
enum class EHumanWeaponHitArea : uint8 {
	EHumanWeaponHitArea = 0
	EHumanWeaponHitArea = 1
	EHumanWeaponHitArea = 2
	EHumanWeaponHitArea = 3
	EHumanWeaponHitArea = 4
	EHumanWeaponHitArea = 5
	EHumanWeaponHitArea = 6
	EHumanWeaponHitArea = 7
	EHumanWeaponHitArea = 8
	EHumanWeaponHitArea = 9
	EHumanWeaponHitArea = 10
	EHumanWeaponHitArea = 11
	EHumanWeaponHitArea = 12
	EHumanWeaponHitArea = 13
	EHumanWeaponHitArea = 14
};

// Enum BravoHotelGame.EWeaponHitArea
enum class EWeaponHitArea : uint8 {
	EWeaponHitArea = 0
	EWeaponHitArea = 1
	EWeaponHitArea = 2
	EWeaponHitArea = 3
	EWeaponHitArea = 4
};

// Enum BravoHotelGame.EVehicleSoundFlag
enum class EVehicleSoundFlag : uint8 {
	EVehicleSoundFlag = 0
	EVehicleSoundFlag = 1
	EVehicleSoundFlag = 2
	EVehicleSoundFlag = 4
	EVehicleSoundFlag = 5
};

// Enum BravoHotelGame.EVehicleNetProperty
enum class EVehicleNetProperty : uint8 {
	EVehicleNetProperty = 0
	EVehicleNetProperty = 1
	EVehicleNetProperty = 2
	EVehicleNetProperty = 4
	EVehicleNetProperty = 8
	EVehicleNetProperty = 16
	EVehicleNetProperty = 17
};

// Enum BravoHotelGame.VoiceChannelType
enum class VoiceChannelType : uint8 {
	VoiceChannelType = 0
	VoiceChannelType = 1
	VoiceChannelType = 2
	VoiceChannelType = 3
};

// Enum BravoHotelGame.PTTKey
enum class PTTKey : uint8 {
	PTTKey = 0
	PTTKey = 1
	PTTKey = 2
	PTTKey = 3
	PTTKey = 4
};

// Enum BravoHotelGame.EWeightMapBitCheck
enum class EWeightMapBitCheck : uint8 {
	EWeightMapBitCheck = 0
	EWeightMapBitCheck = 1
	EWeightMapBitCheck = 2
	EWeightMapBitCheck = 4
	EWeightMapBitCheck = 5
};

// Enum BravoHotelGame.EWeightMapLandType
enum class EWeightMapLandType : uint8 {
	EWeightMapLandType = 0
	EWeightMapLandType = 1
	EWeightMapLandType = 2
	EWeightMapLandType = 3
};

// Enum BravoHotelGame.EWeightMapDescentType
enum class EWeightMapDescentType : uint8 {
	EWeightMapDescentType = 0
	EWeightMapDescentType = 1
	EWeightMapDescentType = 2
	EWeightMapDescentType = 3
};

// Enum BravoHotelGame.EParkourDebugType
enum class EParkourDebugType : uint8 {
	EParkourDebugType = 0
	EParkourDebugType = 1
	EParkourDebugType = 2
	EParkourDebugType = 4
	EParkourDebugType = 8
	EParkourDebugType = 16
	EParkourDebugType = 32
	EParkourDebugType = 64
	EParkourDebugType = 128
	EParkourDebugType = 255
	EParkourDebugType = 256
};

// Class BravoHotelGame.AmbientSoundVolume
struct AAmbientSoundVolume : AVolume {
	struct FString Ambience; // 0x348 (16)
	int32_t Priority; // 0x358 (4)

	void OnOverlapEnd(struct Unknown OverlappedComponent, struct Unknown OtherActor, struct Unknown OtherComp, int32_t OtherBodyIndex); // Function BravoHotelGame.AmbientSoundVolume.OnOverlapEnd(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4D330>
	void OnOverlapBegin(struct Unknown OverlappedComponent, struct Unknown OtherActor, struct Unknown OtherComp, int32_t OtherBodyIndex, char bFromSweep, struct Unknown& SweepResult); // Function BravoHotelGame.AmbientSoundVolume.OnOverlapBegin(Final|Native|Protected|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4D120>
};

// Class BravoHotelGame.AnimNotifyState_PlaySound
struct UAnimNotifyState_PlaySound : UAnimNotifyState {
	struct Unknown Sound; // 0x30 (8)
	float VolumeMultiplier; // 0x38 (4)
	float PitchMultiplier; // 0x3C (4)
	char bFollow : 0; // 0x40 (1)
	struct FName AttachName; // 0x44 (8)
};

// Class BravoHotelGame.BravoHotelGameMode
struct ABravoHotelGameMode : ABravoHotelGameModeBase {
	char bFriendlyFire : 0; // 0x3FC (1)
	struct Unknown PoolingActorComponent; // 0x400 (8)
	struct Unknown MapDataTableHandle; // 0x408 (16)
	struct TMap<Unknown, Unknown>Unknown PCReceivedPlayerInfos; // 0x418 (80)
	struct Unknown* TestAIControllerClass; // 0x468 (8)
	char UsingOuterBlueZone : 0; // 0x4E1 (1)
	struct FName SelectedPlayZoneName; // 0x4E4 (8)
	struct Unknown* BlueZoneClass; // 0x4F0 (8)
	struct FString CQRType; // 0x4F8 (16)
	struct Unknown BlueZone; // 0x570 (8)

	void SetTestAIChangeLocation(struct Unknown AIController); // Function BravoHotelGame.BravoHotelGameMode.SetTestAIChangeLocation(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F264C0>
	float GetCurrentOutOfCircleDamage(); // Function BravoHotelGame.BravoHotelGameMode.GetCurrentOutOfCircleDamage(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F26490>
	struct Unknown GetBlueZone(); // Function BravoHotelGame.BravoHotelGameMode.GetBlueZone(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F26460>
};

// Class BravoHotelGame.BattleRoyaleGameMode
struct ABattleRoyaleGameMode : ABravoHotelGameMode {
	struct TArray<Unknown> RemovePendingPlayerArray; // 0x578 (16)
	enum class Unknow GameViewType; // 0x588 (1)
	enum class Unknow MatchingType; // 0x589 (1)
	int32_t TeamSize; // 0x58C (4)
	struct FString Training; // 0x590 (16)
	int32_t AIGrade; // 0x5A0 (4)
	struct FMulticastInlineDelegate UpdateSurvivalCircleDelegate; // 0x5A8 (16)
	struct TMap<Unknown, Unknown>Unknown TeamInfoMap; // 0x5F0 (80)
	char WinnerTeamIndex; // 0x640 (1)
	struct TArray<Unknown> SendPlayerEndedEvent; // 0x648 (16)
	struct TArray<Unknown> SendPlayerRankedEvent; // 0x658 (16)
	struct Unknown* AircraftViewPawnClass; // 0x680 (8)
	struct Unknown* AircraftFlightPawnClass; // 0x688 (8)
	char bAutoStart : 0; // 0x690 (1)
	float StartingPlayerCountRate; // 0x694 (4)
	int32_t WaitingTime; // 0x698 (4)
	int32_t ReadyTime; // 0x69C (4)
	int32_t DescentDelay; // 0x6A0 (4)
	int32_t DescentableTime; // 0x6A4 (4)
	struct Unknown AircraftFlight; // 0x6A8 (8)
	char bIsUseAircraft : 0; // 0x6B0 (1)
	char bUseAircraftViewPawn : 0; // 0x6C5 (1)
	char bEndlessGame : 0; // 0x6C6 (1)
	struct TArray<Unknown> DamageInfoArray; // 0x6E0 (16)
	struct Unknown* RedZoneManagerClass; // 0x6F8 (8)
	struct Unknown RedZoneManager; // 0x700 (8)
	struct Unknown* PersonalSupplyBoxManagerClass; // 0x788 (8)
	struct Unknown PersonalSupplyBoxManager; // 0x790 (8)
	struct Unknown DivisionItemCountResult; // 0x798 (16)
	char DisivisonComplete : 0; // 0x7A8 (1)
	struct Unknown StandardGroupKeyCountInfo; // 0x990 (88)
	struct TMap<Unknown, Unknown>Unknown AreaSpawnRateList; // 0x9E8 (80)
	struct Unknown BlueZoneSpawnRateInfo; // 0xA38 (136)
	struct FName BlueZoneSpawnRateKey; // 0xAC0 (8)
	struct Unknown NoneData; // 0xAC8 (136)
	struct TMap<Unknown, Unknown>Unknown VehicleAreaSpawnRateList; // 0xB50 (80)
	struct Unknown VehicleBlueZoneSpawnRateInfo; // 0xBA0 (120)
	struct FName VehicleBlueZoneSpawnRateKey; // 0xC18 (8)
	struct Unknown NoneVehicleData; // 0xC20 (120)
	struct Unknown CustomBlueZoneSpawnRateInfo; // 0xC98 (40)
	struct TMap<Unknown, Unknown>Unknown CustomAreaSpawnRateList; // 0xCC0 (80)
	struct Unknown CustomVehicleBlueZoneSpawnRateInfo; // 0xD10 (40)
	struct TMap<Unknown, Unknown>Unknown CustomVehicleAreaSpawnRateList; // 0xD38 (80)
	float ItemDivisionDelay; // 0xD90 (4)
	char UsingWorldItemSpawnTalbeInBlue : 0; // 0xD94 (1)
	char ItemSpawnInBlueZone : 0; // 0xD95 (1)
	char UnlimitItemSpawnCnt : 0; // 0xD96 (1)
	int32_t MaxItemDivisionCountAtOnce; // 0xD98 (4)
	char ItemDivisionLevelLoadComplet : 0; // 0xD9C (1)
	char ItemDivisionGameReady : 0; // 0xD9D (1)
	char UsingMaxPickUpItemSpawnCount : 0; // 0xD9E (1)
	int32_t MaxPickUpItemSpawnCount; // 0xDA0 (4)
	char UsingMaxVehicleSpawnCount : 0; // 0xDA4 (1)
	int32_t MaxVehicleSpawnCount; // 0xDA8 (4)
	int32_t MaxPickUpVehicleSpawnCount; // 0xDAC (4)
	char UsingDynamicMaxPickUpItemSpawnCount : 0; // 0xDB0 (1)
	struct Unknown ItemSpawnLimitInfo; // 0xDB4 (20)
	char GCRecordData : 0; // 0xDC8 (1)
	struct FString GCRecordDataTitle; // 0xDD0 (16)
	char RecordBuildingData : 0; // 0xDE0 (1)
	char RecordPersonalSupplyBoxData : 0; // 0xDE1 (1)
	struct Unknown ItemSpawnRateCurve; // 0xDE8 (8)
	struct Unknown VehicleSpawnRateCurve; // 0xDF0 (8)
	int32_t CurrentSpawnVehicleCount; // 0xDF8 (4)
	int32_t CurrentDivisionItemCount; // 0xDFC (4)
	struct TArray<Unknown> CheckCharacters; // 0xE18 (16)
	struct TArray<Unknown> LoadCompleteList; // 0xE38 (16)
	struct TArray<Unknown> AutoBotIds; // 0xE50 (16)
	struct TArray<Unknown> AutoBotInfoSendIDList; // 0xE60 (16)

	void UpdateSurvivalCircleDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode.UpdateSurvivalCircleDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void UpdateItemSpawnState(); // Function BravoHotelGame.BattleRoyaleGameMode.UpdateItemSpawnState(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4E4B0>
	void UpdateCheckStartPlayCharacters(); // Function BravoHotelGame.BattleRoyaleGameMode.UpdateCheckStartPlayCharacters(Final|Native|Private) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4E490>
	void ServerCheat(char Active, enum class Unknow Type); // Function BravoHotelGame.BattleRoyaleGameMode.ServerCheat(Net|NetReliableNative|Event|Public|NetClient) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4E3C0>
	void OnBattleRoyalStateChanged(enum class Unknow PrevState, enum class Unknow CurrentState); // Function BravoHotelGame.BattleRoyaleGameMode.OnBattleRoyalStateChanged(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4E300>
	struct FString GetSpawnAreaName(struct Unknown Player); // Function BravoHotelGame.BattleRoyaleGameMode.GetSpawnAreaName(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4E220>
	struct Unknown GetRedZoneManager(); // Function BravoHotelGame.BattleRoyaleGameMode.GetRedZoneManager(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4E1F0>
	enum class Unknow GetBattleRoyaleState(); // Function BravoHotelGame.BattleRoyaleGameMode.GetBattleRoyaleState(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4E1C0>
	void DestroyRedZoneManager(); // Function BravoHotelGame.BattleRoyaleGameMode.DestroyRedZoneManager(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4E1A0>
	char CreateRedZoneManager(); // Function BravoHotelGame.BattleRoyaleGameMode.CreateRedZoneManager(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4E170>
	void Cheat(char Active, int8_t Type); // Function BravoHotelGame.BattleRoyaleGameMode.Cheat(Final|Exec|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4E0B0>
	void AddAIPlayerByTimer(char bByTimer); // Function BravoHotelGame.BattleRoyaleGameMode.AddAIPlayerByTimer(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4E020>
};

// Class BravoHotelGame.BattleRoyaleGameMode_Login
struct ABattleRoyaleGameMode_Login : ABravoHotelGameModeBase {
	float MatchingTimeout; // 0x3F8 (4)
	struct TArray<Unknown> PlayerPawnList; // 0x400 (16)
	struct Unknown CustomizeCharacter; // 0x410 (8)
	struct Unknown RankingCharacter; // 0x418 (8)
	struct Unknown AppearingMotionCharacter; // 0x420 (8)
	struct Unknown Loading_TimerHandle; // 0x538 (8)
	struct Unknown PartyInfo_TimerHandle; // 0x540 (8)
	struct Unknown Ping_TimerHandle; // 0x548 (8)
	struct Unknown GeeGeeLoginToken_TimerHandle; // 0x550 (8)
	struct Unknown SteamLoginToken_TimerHandle; // 0x558 (8)
	struct Unknown AveragePingRequest_TimerHandle; // 0x560 (8)
	struct Unknown DuplicatedReconnectTimeout_TimerHandle; // 0x568 (8)
	struct FMulticastInlineDelegate OnLoginSucceeded; // 0x578 (16)
	struct FMulticastInlineDelegate OnLoginNotify; // 0x588 (16)
	struct FMulticastInlineDelegate OnLoginFailed; // 0x598 (16)
	struct FMulticastInlineDelegate OnMatchingPending; // 0x5A8 (16)
	struct FMulticastInlineDelegate OnMatchingStarted; // 0x5B8 (16)
	struct FMulticastInlineDelegate OnMatchingSucceeded; // 0x5C8 (16)
	struct FMulticastInlineDelegate OnMatchingFailed; // 0x5D8 (16)
	struct FMulticastInlineDelegate OnPartyInvited; // 0x5E8 (16)
	struct FMulticastInlineDelegate OnPartyInfoChanged; // 0x5F8 (16)
	struct FMulticastInlineDelegate OnPartyMemberInfoChanged; // 0x608 (16)
	struct FMulticastInlineDelegate OnMatchingSettingsChanged; // 0x618 (16)
	struct FMulticastInlineDelegate OnCreateCharacter; // 0x628 (16)
	struct FMulticastInlineDelegate OnTrainingModeOffDelegate; // 0x638 (16)

	void UpdatePCInfo(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.UpdatePCInfo(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4FEB0>
	void StartTutorialPlay(char bOpeningTutorial); // Function BravoHotelGame.BattleRoyaleGameMode_Login.StartTutorialPlay(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4FE20>
	void StartLoginEx(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.StartLoginEx(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4FE00>
	void StartLogin(struct TMap<Unknown, Unknown>Unknown& AppIDs, struct TMap<Unknown, Unknown>Unknown& LoginKeys, enum class Unknow Type); // Function BravoHotelGame.BattleRoyaleGameMode_Login.StartLogin(Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4FBD0>
	void SetVisibleRankingCharacter(char bState); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SetVisibleRankingCharacter(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4FB40>
	void SetRankingCharacter(struct Unknown SpawnCharacter); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SetRankingCharacter(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4FAC0>
	void SetPawnList(struct TArray<Unknown>& PawnList); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SetPawnList(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4FA10>
	void SetCustomizeCharacter(struct Unknown SpawnCustomizeCharacter); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SetCustomizeCharacter(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4F990>
	void SetAppearingMotionCharacter(struct Unknown MeshComponent); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SetAppearingMotionCharacter(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4F910>
	void SendTrainingModeOff(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SendTrainingModeOff(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4F8F0>
	void ResponseTrainingModeOff__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.ResponseTrainingModeOff__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void PartyMemberInfoChanged__DelegateSignature(struct FString MemberUID, struct Unknown& MemberInfo); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.PartyMemberInfoChanged__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void PartyInvited__DelegateSignature(struct Unknown& Invitation); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.PartyInvited__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void PartyInfoChanged__DelegateSignature(struct Unknown& PartyInfo); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.PartyInfoChanged__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnReadFriendsListComplete(int32_t LocalPlayerNum, char bWasSuccessful, struct FString ListName, struct FString PlatformName); // Function BravoHotelGame.BattleRoyaleGameMode_Login.OnReadFriendsListComplete(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4F770>
	void MatchingSucceeded__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.MatchingSucceeded__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MatchingStarted__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.MatchingStarted__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MatchingSettingsChanged__DelegateSignature(struct Unknown& Settings); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.MatchingSettingsChanged__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MatchingPending__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.MatchingPending__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MatchingFailed__DelegateSignature(int32_t ErrorCode, struct FString ExtraDescription); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.MatchingFailed__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void LoginSucceeded__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.LoginSucceeded__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void LoginNotify__DelegateSignature(struct FString Parameters); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.LoginNotify__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void LoginFailed__DelegateSignature(int32_t ErrorIndex, struct FString ErrorID, struct FString Parameters); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.LoginFailed__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	struct TArray<Unknown> GetServicePlatforms(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.GetServicePlatforms(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4F690>
	struct FString GetServicePlatformName(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.GetServicePlatformName(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4F610>
	struct Unknown GetLobbyPawn(int32_t Index); // Function BravoHotelGame.BattleRoyaleGameMode_Login.GetLobbyPawn(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4F580>
	struct Unknown GetCustomizePawn(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.GetCustomizePawn(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4F550>
	void EquipDefaultWeapon(struct Unknown TargetCharacter, struct FName& ItemRowName, int32_t TargetWeaponSlotIndex); // Function BravoHotelGame.BattleRoyaleGameMode_Login.EquipDefaultWeapon(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E4F440>
	void CreateCharacter__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.CreateCharacter__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// Class BravoHotelGame.BravoHotelGameState
struct ABravoHotelGameState : AGameState {
	char MatchWinnerTeam; // 0x380 (1)
	struct Unknown WinnerPlayerState; // 0x388 (8)
	int32_t TimeRemaining; // 0x390 (4)
	struct FName CurrentSeasonID; // 0x394 (8)
	int32_t PerkMode; // 0x39C (4)
	int32_t RecipeMode; // 0x3A0 (4)
	int32_t MaxPerkCount; // 0x3A4 (4)
	int32_t OverrideUltimateLev; // 0x3A8 (4)
	struct TMap<Unknown, Unknown>Unknown PerkClassNumCap; // 0x3B0 (80)
	struct TMap<Unknown, Unknown>Unknown PerkClassWeightModifier; // 0x400 (80)
	struct TArray<Unknown> PerkClassBlock; // 0x450 (16)
	char bBlockSpawnVehicle : 0; // 0x460 (1)
	char bBlockRedZone : 0; // 0x461 (1)
	char PerkLevelUpAllUserSame : 0; // 0x462 (1)
	struct FString CQRKey; // 0x468 (16)
	enum class Unknow GameViewType; // 0x478 (1)
	enum class Unknow MatchingType; // 0x479 (1)
	struct FName ExpertWeaponTableID; // 0x47C (8)
	int32_t PersonalSupplyBoxPositionType; // 0x484 (4)
	char NoDelaySpawnPersonalSupplyBox : 0; // 0x488 (1)
	char MustSpawnPersonalSupplyBox : 0; // 0x489 (1)
	int32_t RetiredPlayerCount; // 0x48C (4)
	struct TMap<Unknown, Unknown>Unknown UniqueIDPlayerStates; // 0x490 (80)
	struct Unknown MatchID; // 0x4E0 (16)
	struct FString GameServerID; // 0x4F0 (16)
	struct Unknown DefaultClassSelectInfo; // 0x510 (40)
	struct Unknown DefaultClassChangeInfo; // 0x538 (72)
	struct Unknown CurrentGameSettingInfo; // 0x580 (136)
	char IsUsingOuterAreaBlueZone : 0; // 0x608 (1)
	struct Unknown BlueZone; // 0x610 (8)
	struct FMulticastInlineDelegate OnBlueZoneDelegate; // 0x618 (16)
	struct FMulticastInlineDelegate OnChangePerkModeDelegate; // 0x628 (16)
	float RecoilModifier_AR; // 0x654 (4)
	float RecoilModifier_SMG; // 0x658 (4)
	float RecoilModifier_SG; // 0x65C (4)
	float RecoilModifier_DMR; // 0x660 (4)
	float RecoilModifier_SR; // 0x664 (4)

	void ShowTimeHUDMessage(); // Function BravoHotelGame.BravoHotelGameState.ShowTimeHUDMessage(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F2B3B0>
	void OnRep_TimeRemaining(); // Function BravoHotelGame.BravoHotelGameState.OnRep_TimeRemaining(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F2B390>
	void OnRep_RecipeMode(); // Function BravoHotelGame.BravoHotelGameState.OnRep_RecipeMode(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F2B370>
	void OnRep_PerkMode(); // Function BravoHotelGame.BravoHotelGameState.OnRep_PerkMode(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F2B350>
	void OnRep_OverrideUltimateLevel(); // Function BravoHotelGame.BravoHotelGameState.OnRep_OverrideUltimateLevel(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F2B330>
	void OnRep_CurrentGameSettingInfo(); // Function BravoHotelGame.BravoHotelGameState.OnRep_CurrentGameSettingInfo(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F2B310>
	void OnRep_BlueZone(); // Function BravoHotelGame.BravoHotelGameState.OnRep_BlueZone(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F2B2F0>
	void OnChangePerkModeDelegate__DelegateSignature(int32_t PerkMode); // DelegateFunction BravoHotelGame.BravoHotelGameState.OnChangePerkModeDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	char IsDuplicateSelectPossible(); // Function BravoHotelGame.BravoHotelGameState.IsDuplicateSelectPossible(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F2B2C0>
	char IsCurrentStatusParty(); // Function BravoHotelGame.BravoHotelGameState.IsCurrentStatusParty(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F2B290>
	struct Unknown GetPlayerStateByUniqueID(int32_t UniqueID); // Function BravoHotelGame.BravoHotelGameState.GetPlayerStateByUniqueID(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F2B200>
	struct FString GetMatchIDString(); // Function BravoHotelGame.BravoHotelGameState.GetMatchIDString(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F2B170>
	struct Unknown GetBlueZone(); // Function BravoHotelGame.BravoHotelGameState.GetBlueZone(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F2B140>
	void ChangeRemainTime(int32_t RemainTime); // Function BravoHotelGame.BravoHotelGameState.ChangeRemainTime(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F2B0B0>
	void BlueZoneDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelGameState.BlueZoneDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// Class BravoHotelGame.BattleRoyaleGameState
struct ABattleRoyaleGameState : ABravoHotelGameState {
	char IsNewItemSpawnMode : 0; // 0x668 (1)
	int32_t TeamSize; // 0x66C (4)
	enum class Unknow GameRule; // 0x670 (1)
	enum class Unknow BattleRoyaleState; // 0x671 (1)
	int32_t TotalPlayerCount; // 0x674 (4)
	int32_t TotalAIPlayerCount; // 0x678 (4)
	int32_t CurrentPlayerCount; // 0x67C (4)
	int32_t CurrentTeamCount; // 0x680 (4)
	int32_t TotalTeamCount; // 0x684 (4)
	struct FMulticastInlineDelegate OnBattleRoyalStateChanged; // 0x688 (16)
	struct FMulticastInlineDelegate OnRocketLaunch; // 0x698 (16)
	struct FMulticastInlineDelegate OnItemSpawnModeChanged; // 0x6A8 (16)
	struct FMulticastInlineDelegate OnChangeRemainTime; // 0x6B8 (16)
	char bCheckSeaLevelZ : 0; // 0x6C8 (1)
	float SeaLevelZ; // 0x6CC (4)
	int32_t GhostPlayerCountForTest; // 0x6D4 (4)
	struct FMulticastInlineDelegate OnRepTeamSize; // 0x6D8 (16)
	struct TArray<Unknown> CharacterDiedInfos; // 0x6E8 (16)
	struct TArray<Unknown> TeamEndInfos; // 0x6F8 (16)
	struct TArray<Unknown> AirCraftBoardingInfos; // 0x708 (16)
	struct Unknown redzone; // 0x718 (8)
	struct Unknown RedZoneManager; // 0x720 (8)
	struct FMulticastInlineDelegate AirCraftDescentPlayerInfoEvent; // 0x780 (16)
	struct FMulticastInlineDelegate EndAirCraftBoardingPlayerEvent; // 0x790 (16)
	struct Unknown AircraftFlightRef; // 0x7A0 (8)
	struct FMulticastInlineDelegate OnRepCurrentPlayerCount; // 0x7A8 (16)
	struct FMulticastInlineDelegate OnRepCurrentTeamCount; // 0x7B8 (16)
	struct FMulticastInlineDelegate OnUpdateClassCount; // 0x7C8 (16)
	struct TArray<Unknown> RestoreList; // 0x7D8 (16)
	struct Unknown TimerHandle_MoveToLobbyLevel; // 0x7F0 (8)
	struct TMap<Unknown, Unknown>Unknown CurrentClassCounts; // 0x7F8 (80)
	int32_t AutoBotCount; // 0x848 (4)

	void SetDescentPlayerInfo(int32_t PlayerId); // Function BravoHotelGame.BattleRoyaleGameState.SetDescentPlayerInfo(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E51750>
	void SetAutoBotCount(int32_t Count); // Function BravoHotelGame.BattleRoyaleGameState.SetAutoBotCount(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E516D0>
	void SetAirCraftBoardingPlayerInfo(char IsTeam, int32_t TeamID, int32_t PlayerId); // Function BravoHotelGame.BattleRoyaleGameState.SetAirCraftBoardingPlayerInfo(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E515D0>
	void ResetAirCraftBoardingPlayerInfo(); // Function BravoHotelGame.BattleRoyaleGameState.ResetAirCraftBoardingPlayerInfo(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E515B0>
	void RemainTimeDelegate__DelegateSignature(int32_t RemainTime); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.RemainTimeDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnUpdateClassCount__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.OnUpdateClassCount__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnRocketLaunch__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.OnRocketLaunch__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnRepTeamSize__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.OnRepTeamSize__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnRepCurrentPlayerCount__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.OnRepCurrentPlayerCount__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnRep_TeamSize(); // Function BravoHotelGame.BattleRoyaleGameState.OnRep_TeamSize(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E51590>
	void OnRep_CurrentTeamCount(); // Function BravoHotelGame.BattleRoyaleGameState.OnRep_CurrentTeamCount(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E51570>
	void OnRep_CurrentPlayerCount(); // Function BravoHotelGame.BattleRoyaleGameState.OnRep_CurrentPlayerCount(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E51550>
	void OnRep_ChangeNewItemSpawnMode(); // Function BravoHotelGame.BattleRoyaleGameState.OnRep_ChangeNewItemSpawnMode(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E51530>
	void OnRep_BattleRoyaleState(); // Function BravoHotelGame.BattleRoyaleGameState.OnRep_BattleRoyaleState(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E51510>
	void MulticastOnRocketLaunch(); // Function BravoHotelGame.BattleRoyaleGameState.MulticastOnRocketLaunch(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E514F0>
	void MulticastMoveToLobbyLevel(); // Function BravoHotelGame.BattleRoyaleGameState.MulticastMoveToLobbyLevel(Net|NetReliableNative|Event|NetMulticast|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E514D0>
	void ItemSpawnModeDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.ItemSpawnModeDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	float GetSeaLevelZ(); // Function BravoHotelGame.BattleRoyaleGameState.GetSeaLevelZ(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E514A0>
	struct Unknown GetRedZone(); // Function BravoHotelGame.BattleRoyaleGameState.GetRedZone(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E51470>
	void FindAirCraftFlightActor(); // Function BravoHotelGame.BattleRoyaleGameState.FindAirCraftFlightActor(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E51450>
	void EndAirCraftBoardingPlayer__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.EndAirCraftBoardingPlayer__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EndAirCraftBoardingPlayer(); // Function BravoHotelGame.BattleRoyaleGameState.EndAirCraftBoardingPlayer(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E51430>
	void DoRestore(); // Function BravoHotelGame.BattleRoyaleGameState.DoRestore(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E51410>
	void DoMoveToLobbyLevel(float DelayTime); // Function BravoHotelGame.BattleRoyaleGameState.DoMoveToLobbyLevel(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E51390>
	void ClientExcuteEndAirCraftBoardingPlayerEvent(); // Function BravoHotelGame.BattleRoyaleGameState.ClientExcuteEndAirCraftBoardingPlayerEvent(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E51370>
	void ClientExcuteAirCraftDescentPlayerInfoEvent(int32_t AirCraftID, int32_t SeatID, int32_t PlayerId); // Function BravoHotelGame.BattleRoyaleGameState.ClientExcuteAirCraftDescentPlayerInfoEvent(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E51280>
	void BattleRoyalStateChanged__DelegateSignature(enum class Unknow PrevState, enum class Unknow CurrentState); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.BattleRoyalStateChanged__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void AirCraftDescentPlayerInfo__DelegateSignature(int32_t AirCraftID, int32_t SeatID, int32_t PlayerId); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.AirCraftDescentPlayerInfo__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// Class BravoHotelGame.BHPersonalSupplyBox
struct ABHPersonalSupplyBox : UActor {
	char NeedInit : 0; // 0x310 (1)
	struct Unknown RootBoxComponent; // 0x320 (8)
	struct Unknown InteractiveSphereComponent; // 0x328 (8)
	struct Unknown InteractiveCancleSphereComponent; // 0x330 (8)
	struct FName BoxName; // 0x338 (8)
	struct TArray<Unknown> RelatedPlayerIds; // 0x340 (16)
	enum class Unknow CurrentStateType; // 0x359 (1)
	char CheckRePosition : 0; // 0x35A (1)
	struct Unknown TimeHandle_CheckRePosition; // 0x360 (8)
	int32_t CustomIndex; // 0x368 (4)
	char TraceLand : 0; // 0x36C (1)
	struct Unknown TimerHandle_Destroy; // 0x370 (8)

	void UpdateCheckRePosition(); // Function BravoHotelGame.BHPersonalSupplyBox.UpdateCheckRePosition(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E526B0>
	void RequestRePosition(float StartZ, float EndZ); // Function BravoHotelGame.BHPersonalSupplyBox.RequestRePosition(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E525F0>
	void RePosition(struct Unknown& NewLocation); // Function BravoHotelGame.BHPersonalSupplyBox.RePosition(Final|Native|Public|HasOutParms|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E52560>
	void OnRep_SetStateType(); // Function BravoHotelGame.BHPersonalSupplyBox.OnRep_SetStateType(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E52540>
	void OnRep_RelatedPlayerIds(); // Function BravoHotelGame.BHPersonalSupplyBox.OnRep_RelatedPlayerIds(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E52520>
	void OnRep_CheckRePosition(); // Function BravoHotelGame.BHPersonalSupplyBox.OnRep_CheckRePosition(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E52500>
	void OnRecall(); // Function BravoHotelGame.BHPersonalSupplyBox.OnRecall(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnOverlapEnd(struct Unknown OverlappedComponent, struct Unknown OtherActor, struct Unknown OtherComp, int32_t OtherBodyIndex); // Function BravoHotelGame.BHPersonalSupplyBox.OnOverlapEnd(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E523C0>
	void OnOverlapBegin(struct Unknown OverlappedComponent, struct Unknown OtherActor, struct Unknown OtherComp, int32_t OtherBodyIndex, char bFromSweep, struct Unknown& SweepResult); // Function BravoHotelGame.BHPersonalSupplyBox.OnOverlapBegin(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E521B0>
	void OnChangeState(enum class Unknow StateType); // Function BravoHotelGame.BHPersonalSupplyBox.OnChangeState(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnAssigned(); // Function BravoHotelGame.BHPersonalSupplyBox.OnAssigned(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	char IsReplatedBP(); // Function BravoHotelGame.BHPersonalSupplyBox.IsReplatedBP(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E52180>
	void GetRelatedPlayerIds(struct TArray<Unknown>& outList); // Function BravoHotelGame.BHPersonalSupplyBox.GetRelatedPlayerIds(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E520D0>
	void DestroyBox(); // Function BravoHotelGame.BHPersonalSupplyBox.DestroyBox(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E520B0>
	void ChangeBoxMesh(char IsMyBox); // Function BravoHotelGame.BHPersonalSupplyBox.ChangeBoxMesh(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// Class BravoHotelGame.BravoHotelDropBoxActor
struct ABravoHotelDropBoxActor : UActor {
	enum class Unknow RootType; // 0x310 (1)
	struct Unknown RootBoxComponent; // 0x318 (8)
	struct Unknown InventoryComponent; // 0x320 (8)
	struct Unknown InteractiveSphereComponent; // 0x328 (8)
	struct Unknown InteractiveCancleSphereComponent; // 0x330 (8)
	struct FName DropperNickName; // 0x338 (8)
	struct FName BoxName; // 0x340 (8)
	int32_t RarityIndex; // 0x348 (4)
	struct Unknown DetectedCharacter; // 0x350 (8)

	void SetItemInBlueprint(struct FName& ItemKey); // Function BravoHotelGame.BravoHotelDropBoxActor.SetItemInBlueprint(Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnOverlapEnd(struct Unknown OverlappedComponent, struct Unknown OtherActor, struct Unknown OtherComp, int32_t OtherBodyIndex); // Function BravoHotelGame.BravoHotelDropBoxActor.OnOverlapEnd(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F1CF90>
	void OnOverlapBegin(struct Unknown OverlappedComponent, struct Unknown OtherActor, struct Unknown OtherComp, int32_t OtherBodyIndex, char bFromSweep, struct Unknown& SweepResult); // Function BravoHotelGame.BravoHotelDropBoxActor.OnOverlapBegin(Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F1CD90>
	void OnDeactivated(); // Function BravoHotelGame.BravoHotelDropBoxActor.OnDeactivated(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnBoxChanged(); // Function BravoHotelGame.BravoHotelDropBoxActor.OnBoxChanged(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F1CD70>
	void OnActivated(); // Function BravoHotelGame.BravoHotelDropBoxActor.OnActivated(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void AddItemsToBox(struct TArray<Unknown>& ItemsToSpawn); // Function BravoHotelGame.BravoHotelDropBoxActor.AddItemsToBox(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F1CC90>
};

// Class BravoHotelGame.BHPersonalSupplyBoxDummy
struct ABHPersonalSupplyBoxDummy : ABravoHotelDropBoxActor {
	int32_t playerGUID; // 0x390 (4)
};

// Class BravoHotelGame.BHPersonalSupplyBoxManager
struct ABHPersonalSupplyBoxManager : AInfo {
	struct Unknown* SupplyBoxClass; // 0x310 (8)
	struct TArray<Unknown> ListPhaseInfo; // 0x318 (16)
	int32_t CurrentPhaseNum; // 0x328 (4)
	struct TArray<Unknown> ListUsableSupplyBox; // 0x330 (16)
	struct TMap<Unknown, Unknown>Unknown MapSupplyBox; // 0x340 (80)
	struct FName TestRandomTableID; // 0x390 (8)
	char UseTestRandom : 0; // 0x398 (1)
	struct TArray<Unknown> SpawnedSupplyBoxList; // 0x3B0 (16)
	struct TArray<Unknown> ForceSpawnedSupplyBoxList; // 0x3C0 (16)

	void SetCurrentPhaseNum(int32_t PhaseNum); // Function BravoHotelGame.BHPersonalSupplyBoxManager.SetCurrentPhaseNum(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E52B80>
	void RecallAll(); // Function BravoHotelGame.BHPersonalSupplyBoxManager.RecallAll(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E52B60>
	void ReassignAll(char Force); // Function BravoHotelGame.BHPersonalSupplyBoxManager.ReassignAll(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E52AD0>
};

// Class BravoHotelGame.BravoHotelCharacter
struct ABravoHotelCharacter : ACharacter {
	struct Unknown AudioComponent; // 0x30E8 (8)
	struct Unknown CameraBase; // 0x2E40 (8)
	struct Unknown CameraAssistant3P; // 0x1390 (8)
	struct Unknown Camera3P; // 0x908 (8)
	struct Unknown CharacterBackLight; // 0x1E28 (8)
	struct Unknown CharacterBackLightSecond; // 0x36A8 (8)
	float BackLightIntensity_FPP; // 0x3768 (4)
	float BackLightIntensity_ADS; // 0x36D8 (4)
	struct TArray<Unknown> BuffParticleComponents; // 0x24B8 (16)
	struct Unknown MutableComponent; // 0x24F8 (8)
	struct Unknown InteractiveSphereComponent; // 0x1A70 (8)
	struct Unknown InteractiveCancleSphereComponent; // 0x29B0 (8)
	struct Unknown Parachute; // 0x2718 (8)
	struct Unknown WaterParticleSystem; // 0x3830 (8)
	struct Unknown FlameDamageParticleComponent; // 0x3720 (8)
	struct Unknown FlameDamageParticle; // 0x36C0 (8)
	struct Unknown STMComponent; // 0x2D60 (8)
	struct Unknown ActionComponent; // 0xB58 (8)
	struct Unknown PerkComponent; // 0x1F80 (8)
	struct Unknown TeamInfoUpdaterComponentRef; // 0x10E8 (8)
	struct Unknown TimeHandle_MolotovDotDamage; // 0xB90 (8)
	struct Unknown Stand_FlameDotDamageAnim; // 0xEE8 (16)
	struct Unknown Prone_FlameDotDamageAnim; // 0x850 (16)
	struct TArray<Unknown> FlameDamageInfos; // 0x2820 (16)
	struct FString NPCNickName; // 0x1F60 (16)
	char bAllowToggleCamera : 0; // 0x1730 (1)
	char bThirdPerson : 0; // 0x1D18 (1)
	float SprintingMoveRightModifier; // 0x11E0 (4)
	float LeanValue; // 0x1168 (4)
	float LeanDegreeMax; // 0x2CA4 (4)
	float LeanUpdateSpeed; // 0x12BC (4)
	enum class Unknow SaveLeanState; // 0x29C4 (1)
	enum class Unknow PrevLeanState; // 0x1684 (1)
	char bFixLeanDegreeMax : 0; // 0x20E0 (1)
	char bFixFPPFoV : 0; // 0x161C (1)
	float Health; // 0x10E0 (4)
	float ShortTimeHealth; // 0x12F0 (4)
	float TargetHealth; // 0x2D18 (4)
	float BandageTargetHealth; // 0x11C8 (4)
	float OverHealHealth; // 0xA80 (4)
	struct Unknown* PP_Preset_ShortHealth; // 0x9A8 (8)
	struct Unknown PPInst_ShortHealth; // 0x2010 (8)
	struct TMap<Unknown, Unknown>Unknown TargetHealthMap; // 0x2040 (80)
	float Oxygen; // 0x3208 (4)
	float SteadyPoint; // 0x14B0 (4)
	int8_t BoostPercent; // 0xD50 (1)
	float Default3PFOV; // 0x3708 (4)
	float Default3PFOV_AOS; // 0x2784 (4)
	float Default3PFOV_AMP; // 0xA94 (4)
	float Default3PFOV_HeartBeatSensor; // 0xCA8 (4)
	float Default3PFOV_SkillMAP; // 0x16F8 (4)
	float ForwardAxisValue; // 0x36B8 (4)
	float RightAxisValue; // 0x2250 (4)
	float InputMovementAttenuationTime; // 0x281C (4)
	float InputMovementAttenuationTimeIdleToCrouch; // 0x30D0 (4)
	float InputMovementAttenuationTimeIdleToProne; // 0xC98 (4)
	float InputMovementAttenuationTimeProneToIdle; // 0xE30 (4)
	float InputMovementAttenuationValueIdleToCrouch; // 0x9B8 (4)
	float InputMovementAttenuationValueIdleToProne; // 0x1524 (4)
	float InputMovementAttenuationValueProneToIdle; // 0x20D0 (4)
	float InputMovementAttenuationValue; // 0xF2C (4)
	char bMovementKeyPushed : 0; // 0x29A8 (1)
	char bLastMovementKeyPushed : 0; // 0xB20 (1)
	char bMovementInputLock : 0; // 0x27D9 (1)
	struct Unknown InputAxisOnLockMovement; // 0x3358 (8)
	char bInputKeyJump : 0; // 0x27ED (1)
	float DoubleTapDelay_ToggleLean; // 0x2B0C (4)
	char bShouldSprint : 0; // 0x1D08 (1)
	enum class Unknow FireTypeComplete; // 0x21B8 (1)
	struct Unknown PerBoneDamageTable; // 0x3738 (8)
	struct Unknown MeleeDamageTable; // 0x2CF0 (8)
	struct Unknown PistolsDamageTable; // 0x1AE8 (8)
	struct Unknown ShotgunsDamageTable; // 0x2848 (8)
	struct Unknown SMGsDamageTable; // 0x1718 (8)
	struct Unknown A; // 0x1460 (8)
	struct Unknown DMRsDamageTable; // 0xDC8 (8)
	struct Unknown S; // 0x3668 (8)
	struct Unknown* BrokenHelmetClass; // 0xBD0 (8)
	char bNeedToSpawnBrokenEquipment : 0; // 0x1AC8 (1)
	float BrokenEquipmentLevel; // 0x1064 (4)
	struct Unknown BrokenEquipmentDamagedDirection; // 0x253C (12)
	enum class Unknow BrokenEquipmentType; // 0x21D8 (1)
	enum class Unknow InteractionType; // 0x3499 (1)
	float InteractionTraceDistance; // 0x2FA4 (4)
	struct Unknown DetectedInteractionActor; // 0xCA0 (8)
	struct Unknown DetectedInteractionComponet; // 0x26D8 (8)
	struct Unknown DetectedVehicleSeatComponent; // 0x1FA0 (8)
	struct TArray<Unknown> DetectedInteractionCancleActors; // 0x2520 (16)
	struct TMap<Unknown, Unknown>Unknown InteractionDistRatioMap; // 0x1318 (80)
	float ResurrectionCameraBlendTime; // 0x31A0 (4)
	struct Unknown* PostProcessResurrectionClass; // 0x1458 (8)
	struct Unknown ResurrectionEffectCurve; // 0x13A8 (8)
	struct TScriptInterface<IUnknown> ResurrectionMaterialController; // 0x3368 (16)
	struct Unknown DetectedPickableItem; // 0x11D0 (8)
	struct TArray<Unknown> DetectedItemList; // 0x2490 (16)
	struct TArray<Unknown> DetectedBoxList; // 0x1050 (16)
	struct TArray<Unknown> DetectedStealableList; // 0x26B0 (16)
	struct TArray<Unknown> DetectedItemHideList; // 0x8D8 (16)
	struct Unknown TimerHandle_CheckDetectedItemList; // 0xF38 (8)
	struct Unknown InventoryComponent; // 0x1DD8 (8)
	struct Unknown AbilityComponent; // 0x1440 (8)
	struct Unknown DoorComponent; // 0x13E0 (8)
	struct Unknown ParkourComponent; // 0x1BA8 (8)
	struct Unknown BlueZoneGameRule; // 0x2008 (8)
	struct Unknown VoiceComponent; // 0x2440 (8)
	struct Unknown LadderComponent; // 0xF78 (8)
	struct Unknown StationaryCharInfo; // 0xB98 (8)
	struct Unknown CharacterReplication; // 0x2278 (8)
	struct Unknown CombineAnim_Stand; // 0x8B8 (16)
	struct Unknown CombineAnim_Prone; // 0x3810 (16)
	struct Unknown RepairAnim_Stand; // 0x2CF8 (16)
	struct Unknown RepairAnim_Prone; // 0x21A0 (16)
	struct Unknown CurrentPickupMontage; // 0x1188 (8)
	struct Unknown PickUpAnim_Unarmed_Floor; // 0x25F8 (16)
	struct Unknown PickUpAnim_Unarmed_Table; // 0x2ED8 (16)
	struct Unknown PickUpAnim_Unarmed_Crouch; // 0x3240 (16)
	struct Unknown PickUpAnim_Unarmed_Prone; // 0x2990 (16)
	struct Unknown PickUpAnim_Rifle_Floor; // 0x1070 (16)
	struct Unknown PickUpAnim_Rifle_Table; // 0x2B88 (16)
	struct Unknown PickUpAnim_Rifle_Crouch; // 0x25D8 (16)
	struct Unknown PickUpAnim_Rifle_Prone; // 0x31A8 (16)
	struct Unknown PickUpAnim_Pistol_Floor; // 0x2C20 (16)
	struct Unknown PickUpAnim_Pistol_Table; // 0x3110 (16)
	struct Unknown PickUpAnim_Pistol_Crouch; // 0x2168 (16)
	struct Unknown PickUpAnim_Pistol_Prone; // 0xE20 (16)
	struct Unknown DoorAnim_Open; // 0x10F0 (16)
	struct Unknown DoorAnim_Close; // 0x1590 (16)
	struct Unknown DoorAnim_Kick; // 0x2A48 (16)
	struct Unknown MovementAnim_GetUpFromBack; // 0x14F0 (16)
	struct Unknown MovementAnim_GetUpFromFront; // 0x33C8 (16)
	struct Unknown ConditionAnim_ShakeOut_Unarmed; // 0x2D78 (16)
	struct Unknown ConditionAnim_ShakeOut_Rifle; // 0x19D0 (16)
	struct TArray<Unknown> MeleeAnim_Punch_Idle; // 0x2EF8 (16)
	struct TArray<Unknown> MeleeAnim_Punch_Crouch; // 0x3758 (16)
	struct Unknown MeleeAnim_Punch_Jump; // 0x3560 (16)
	struct TArray<Unknown> MeleeAnim_Rifle_Idle; // 0x21C0 (16)
	struct TArray<Unknown> MeleeAnim_Rifle_Crouch; // 0x3268 (16)
	struct TArray<Unknown> MeleeAnim_Pistol_Idle; // 0x2D28 (16)
	struct TArray<Unknown> MeleeAnim_Pistol_Crouch; // 0x1408 (16)
	struct TArray<Unknown> DeathAnim_Crouch; // 0x2790 (16)
	struct TArray<Unknown> DeathAnim_FlameDamage; // 0x7C8 (16)
	struct TArray<Unknown> DeathAnim_Grenade; // 0xD58 (16)
	struct TArray<Unknown> DeathAnim_HeadShot; // 0x15D8 (16)
	struct TArray<Unknown> DeathAnim_Natural; // 0x1B90 (16)
	struct TArray<Unknown> DeathAnim_Rifle; // 0x1570 (16)
	struct TArray<Unknown> DeathAnim_Shotgun; // 0x2468 (16)
	struct TArray<Unknown> DeathAnim_Sprint; // 0x890 (16)
	struct TArray<Unknown> DeathAnim_Falling; // 0xC28 (16)
	struct Unknown DeathAnim_ClosedEyes; // 0x1D00 (8)
	struct Unknown PickUpStartEvent; // 0x2D68 (8)
	struct Unknown PickUpBackpackEvent; // 0x10D8 (8)
	struct Unknown EquipAnim_MainWeapon1; // 0x26C8 (16)
	struct Unknown EquipAnim_MainWeapon1_Prone; // 0x2240 (16)
	struct Unknown EquipAnim_MainWeapon2; // 0x2A80 (16)
	struct Unknown EquipAnim_MainWeapon2_Prone; // 0x37B8 (16)
	struct Unknown EquipAnim_SubWeapon; // 0x2E48 (16)
	struct Unknown EquipAnim_SubWeapon_Prone; // 0x2680 (16)
	struct Unknown EquipAnim_Melee; // 0x1F70 (16)
	struct Unknown EquipAnim_Melee_Prone; // 0x1430 (16)
	struct Unknown EquipAnim_Amplifier; // 0x1B58 (16)
	struct Unknown EquipAnim_Amplifier_Prone; // 0x2310 (16)
	struct Unknown EquipAnim_HeartBeatSensor; // 0x33E8 (16)
	struct Unknown EquipAnim_HeartBeatSensor_Prone; // 0x1AD0 (16)
	struct Unknown SlidingAnim; // 0x8C8 (16)
	struct Unknown RollingAnim; // 0xB40 (16)
	struct Unknown KnockbackRollingAnim; // 0xA18 (16)
	struct Unknown EquipAnim_ThrowingWeapon; // 0x3740 (16)
	struct Unknown EquipAnim_Prone_ThrowingWeapon; // 0x10C8 (16)
	struct Unknown UnequipAnim_MainWeapon1; // 0x1398 (16)
	struct Unknown UnequipAnim_MainWeapon1_Prone; // 0x1858 (16)
	struct Unknown UnequipAnim_MainWeapon2; // 0x35B0 (16)
	struct Unknown UnequipAnim_MainWeapon2_Prone; // 0xB00 (16)
	struct Unknown UnequipAnim_SubWeapon; // 0x868 (16)
	struct Unknown UnequipAnim_SubWeapon_Prone; // 0x2F18 (16)
	struct Unknown UnequipAnim_Melee; // 0x2018 (16)
	struct Unknown UnequipAnim_Melee_Prone; // 0x1380 (16)
	struct Unknown UnequipAnim_Amplifier; // 0x2830 (16)
	struct Unknown UnequipAnim_Amplifier_Prone; // 0x1C90 (16)
	struct Unknown UnequipAnim_HeartBeatSensor; // 0x3190 (16)
	struct Unknown UnequipAnim_HeartBeatSensor_Prone; // 0x1BD8 (16)
	struct Unknown UnequipAnim_ThrowingWeapon; // 0x29E8 (16)
	struct Unknown UnequipAnim_Prone_ThrowingWeapon; // 0x20E8 (16)
	struct Unknown LandingAnim_LandStop; // 0x13B8 (16)
	struct Unknown LandingAnim_Parachute; // 0x3778 (16)
	struct Unknown LandingAnim_Unarmed; // 0x20A0 (16)
	struct Unknown LandingAnim_Rifle; // 0x2AE8 (16)
	struct Unknown LandingAnim_Pistol; // 0x11A8 (16)
	struct TArray<Unknown> ResuscitationAnimSets; // 0xC08 (16)
	struct TArray<Unknown> WeaponEquipEvents; // 0x2B58 (16)
	struct TArray<Unknown> AttachmentEquipEvents; // 0x32C0 (16)
	struct TArray<Unknown> WearableEquipEvents; // 0x37A0 (16)
	struct TArray<Unknown> ConsumablesEvents; // 0x1128 (16)
	struct Unknown MedipackUseEvent; // 0x24D0 (8)
	struct Unknown ItemDropEvent; // 0xE40 (8)
	struct Unknown ADSEnterEvent; // 0x2090 (8)
	struct Unknown ADSEnterEvent_Digital; // 0xB80 (8)
	struct Unknown ADSExitEvent; // 0x2610 (8)
	struct Unknown ADSExitEvent_Digital; // 0x32E0 (8)
	struct Unknown AOSEnterEvent; // 0x3A38 (8)
	struct Unknown AOSExitEvent; // 0x37D8 (8)
	struct Unknown AMPEnterEvent; // 0x3730 (8)
	struct Unknown AMPExitEvent; // 0x3920 (8)
	struct Unknown AMPNoiseEvent; // 0xAA8 (8)
	struct Unknown AMPNoiseStopEvent; // 0x1090 (8)
	struct Unknown PlosiveSoundDetection3LvEvent; // 0x1A50 (8)
	struct Unknown HeartBeatSensorEnterEvent; // 0x1138 (8)
	struct Unknown HeartBeatSensorExitEvent; // 0x1F48 (8)
	struct Unknown HeartBeatSensorNoiseEvent; // 0x3018 (8)
	struct Unknown HeartBeatSensorNoiseStopEvent; // 0x22E0 (8)
	struct Unknown DamagedEvent; // 0x36D0 (8)
	struct Unknown HitEvent; // 0x31C8 (8)
	struct Unknown SnowAreaEnteringEvent; // 0x1220 (8)
	struct Unknown UltimateSprintEvent; // 0x33B0 (8)
	char bIsParachuteLanding : 0; // 0x36F0 (1)
	float ParachuteLandingHeight; // 0x81C (4)
	struct Unknown StartDescendingEvent; // 0x3A18 (8)
	struct Unknown ParachuteFoldEvent; // 0x20C8 (8)
	struct Unknown TimerHandle_Sequnce; // 0x3028 (8)
	struct Unknown TeamPosition; // 0xEF8 (8)
	float AdditionalTeamPositionWidgetHeight; // 0x2648 (4)
	float TeamPositionWidgetInterpSpeed; // 0x2780 (4)
	float CurrentTeamPositionHeight; // 0x31EC (4)
	struct FMulticastInlineDelegate OnChangeDetectedItems; // 0x1880 (16)
	char bIsArmedBeforeAction : 0; // 0x2CA0 (1)
	struct FMulticastInlineDelegate Delegate_OnViewCameraInWater; // 0x23E8 (16)
	struct FMulticastInlineDelegate Delegate_OnViewCameraOutWater; // 0x3178 (16)
	char bInSmoke : 0; // 0x2A32 (1)
	struct FMulticastInlineDelegate Delegate_OnInSmoke; // 0xC38 (16)
	struct FMulticastInlineDelegate Delegate_OnOutSmoke; // 0x30F0 (16)
	struct TArray<Unknown> SmokeActors; // 0x1F88 (16)
	struct Unknown SwimDiveEvent; // 0x1110 (8)
	char bIsEnterIndoorVolume : 0; // 0x1AF4 (1)
	struct Unknown SkyLightRef; // 0x8A8 (8)
	float PrevSkyLightIntensityCache; // 0x22D4 (4)
	struct Unknown PrevSkyLightOcclusionTintCache; // 0x36B4 (4)
	float SkyLightCurrentPriority; // 0x3168 (4)
	struct TArray<Unknown> OverlappedInDoorVolumes; // 0x2DF8 (16)
	struct Unknown LastSteppedSurface; // 0x1C80 (8)
	char SurfaceType; // 0x2428 (1)
	char SurfaceType_LastTick; // 0x344C (1)
	float MP_SnowInterpSpeed; // 0xD88 (4)
	struct Unknown TimerHandle_BreathEffect; // 0x21D0 (8)
	struct Unknown BreathParticleComponent; // 0x1D70 (8)
	struct Unknown BreathParticle_Idle; // 0xD30 (8)
	struct Unknown BreathParticle_Moving; // 0x37E0 (8)
	struct Unknown InWaterParticle; // 0x2700 (8)
	struct FMulticastInlineDelegate OnUpdateMutableDelegate; // 0x2D88 (16)
	struct Unknown OverlapWaterVolume; // 0x3578 (8)
	char bIsMelee : 0; // 0xD78 (1)
	char bIsMeleeJumpAttack : 0; // 0x994 (1)
	char bCanJumpMeleeAttack : 0; // 0xD10 (1)
	char bIsMeleeAttackBlocked : 0; // 0x12B8 (1)
	float LastMeleeAttackTime; // 0xD74 (4)
	struct Unknown CurrentMeleeAnimSlot; // 0x2C90 (16)
	struct TArray<Unknown> ActorsToIgnore_Melee; // 0x2DA8 (16)
	struct TArray<Unknown> MeshesToIgnore_Melee; // 0x1208 (16)
	float UnarmedMeleeDamage_Ground; // 0x36BC (4)
	float UnarmedMeleeDamage_Jump; // 0x28F0 (4)
	char bIsFired : 0; // 0x2290 (1)
	char bWantsToFire : 0; // 0x839 (1)
	char bWantsToAOS : 0; // 0x1069 (1)
	char bIsLanded : 0; // 0xFC0 (1)
	float FiredTimeCount; // 0x9C4 (4)
	float StartFireTime; // 0x1628 (4)
	char bIsADSFireToCamera : 0; // 0x3580 (1)
	float FireToCameraLocationCorrection; // 0x2F80 (4)
	struct Unknown ArmsLagRotation; // 0x810 (12)
	float ArmsLagDeltaMin; // 0x2B70 (4)
	float ArmsLagDeltaMax; // 0x13B0 (4)
	float DefaultsArmsLagRotationMax; // 0xB64 (4)
	float DefaultsArmsLagRotationSpeed; // 0x28BC (4)
	struct TMap<Unknown, Unknown>Unknown ArmsLags; // 0x2A98 (80)
	float ArmsLagBaseModify; // 0x1F50 (4)
	float ArmsLagWeaponModify; // 0x11FC (4)
	struct Unknown ArmsLagWeaponRotation; // 0xBB8 (12)
	struct Unknown ADSDeltaRotation; // 0x1518 (12)
	struct Unknown ADSEndLocation; // 0x320C (12)
	char bSteadyAim : 0; // 0x1DFC (1)
	struct Unknown LastSwayRotationOnSteadyAim; // 0x1AA8 (12)
	struct Unknown SteadyAimReadyEvent; // 0x1748 (8)
	struct Unknown SteadyAimStartEvent; // 0x25E8 (8)
	struct Unknown SteadyAimEndEvent; // 0x29E0 (8)
	float HeadShotBloodEffectDistance; // 0x7F0 (4)
	struct Unknown HeadShotHelmetFxEmitterTemplate; // 0x1510 (8)
	float BoltActionDelayTime; // 0x1AB4 (4)
	char bWaitingADSReturn : 0; // 0x2A31 (1)
	float ADSReturnEnableTime; // 0x84C (4)
	float Delay_AOSToADS; // 0xB24 (4)
	char bNeedToBeADS : 0; // 0x3410 (1)
	struct Unknown TimerHandle_ADSProcess; // 0x2B80 (8)
	struct Unknown* PP_Preset_ADS; // 0x2F58 (8)
	struct Unknown PPInst_ADS; // 0x28C0 (8)
	float ReplayInputForwardAxisValue; // 0x12A0 (4)
	float ReplayInputRightAxisValue; // 0x20C0 (4)
	struct Unknown CurrentInputAxis; // 0x26A0 (8)
	struct FMulticastInlineDelegate Delegate_OnCameraViewModeChanged; // 0x5E8 (16)
	struct Unknown ZoomInAudioEvent_Digital; // 0x2450 (8)
	struct Unknown ZoomOutAudioEvent_Digital; // 0x1DD0 (8)
	float ZoomAudioEventRepeatDelay; // 0x25F4 (4)
	float ZoomAudioEventLastPlayTime; // 0x3794 (4)
	struct FMulticastInlineDelegate OnPickableItemDetected; // 0x628 (16)
	float OverHeadTraceDistance; // 0xF30 (4)
	char bShouldAdjustOverHead : 0; // 0x33D8 (1)
	float UpdateAnimationDistance; // 0x1538 (4)
	char bIsDisarming : 0; // 0x658 (1)
	struct Unknown ResuscitationStopEv; // 0xA88 (8)
	struct Unknown ResuscitatingCharacter; // 0x1FE8 (8)
	float RequestResuscitationCoolTime; // 0xF20 (4)
	struct Unknown CurrentResuscitationAnimSlot; // 0xF88 (16)
	struct Unknown TimerHandle_SetIsFired; // 0x3A48 (8)
	float KillAssistValidTime; // 0x3450 (4)
	int32_t KillAssistMaxCount; // 0xF28 (4)
	float KnockOutAssistValidTime; // 0x2904 (4)
	int32_t KnockOutAssistMaxCount; // 0xC88 (4)
	struct TArray<Unknown> AssistInfo; // 0x1950 (16)
	float ThrowingWeaponFireDelay; // 0x2A64 (4)
	float PreShootDeltaSecond; // 0xFD0 (4)
	char bIsParachuteAvailable : 0; // 0x1BD1 (1)
	float ParachuteInputForward; // 0x2FE0 (4)
	float ParachuteInputRight; // 0x7A8 (4)
	float ParachuteForwardMomentum; // 0x13D4 (4)
	struct Unknown ParachuteLastRotator; // 0x3428 (12)
	float CurrentParachuteMaxMomentum; // 0x910 (4)
	float ParachuteMaxMomentum; // 0xE94 (4)
	float ParachuteMomentumAcc; // 0x15D0 (4)
	float ParachuteMomentumDeacc; // 0x15E8 (4)
	float ParachuteMomentumZ; // 0x1BA4 (4)
	float DescentInputVectorAcc; // 0x26F8 (4)
	float ParachuteInputVectorAcc; // 0x1F54 (4)
	float ParachuteVelocityChangeFinalRate; // 0x32AC (4)
	float ParachuteVelocityChangeZDecRate; // 0xB3C (4)
	float ParachuteLandingVelocityZ; // 0x1930 (4)
	float ParachuteLandingVelocityXY; // 0xF60 (4)
	float ForwardMomentumRangeMin; // 0x1734 (4)
	float ForwardMomentumRangeMax; // 0xAEC (4)
	float CurrentYawSpeed; // 0x1CE0 (4)
	float CurrentRollSpeed; // 0x2908 (4)
	float CurrentPitchSpeed; // 0x2E58 (4)
	float MinPitchInParachute; // 0x3128 (4)
	float MaxPitchInParachute; // 0x2408 (4)
	float GlidePitchInParachute; // 0x9E8 (4)
	float MinRollInParachute; // 0x2A90 (4)
	float MaxRollInParachute; // 0x3424 (4)
	float MaxRollInParachuteVelocity; // 0x1378 (4)
	float ParachuteTurnSpeedYaw; // 0x2B74 (4)
	float ParachuteTurnSpeedPitch; // 0x2818 (4)
	float ParachuteTurnSpeedRoll; // 0x2A00 (4)
	float ParachuteTurnChangeSpeedYaw; // 0x2098 (4)
	float ParachuteTurnChangeSpeedPitch; // 0x2178 (4)
	float ParachuteTurnChangeSpeedRoll; // 0x386C (4)
	float HeightToGetInParachuteFromLand; // 0x2FA0 (4)
	float ForceHeightToGetInParachute; // 0x2A34 (4)
	struct Unknown ReplicatedParachuteVelocity; // 0x12D0 (12)
	struct Unknown ParachutePitchCurve; // 0x14B8 (8)
	struct TArray<Unknown> ParachuteSkinMaterials; // 0x1868 (16)
	struct Unknown CurrentParachuteSkin; // 0x1760 (8)
	char bChangeNearClipPlane : 0; // 0x2CA9 (1)
	float DescentStartZPosition; // 0x2B78 (4)
	float ParachuteAvailableFallingDistance; // 0xD28 (4)
	float DescentZ; // 0xDA0 (4)
	float SeaLevelZ; // 0x800 (4)
	float SaveMaxWalkSpeed; // 0x37D0 (4)
	float SaveCameraBoomLocationZ; // 0x2D0C (4)
	float PosToGetInParachute; // 0x2C1C (4)
	struct Unknown* AccelerationPPClass; // 0x3130 (8)
	struct Unknown RadialOnDescentCurv; // 0x998 (8)
	float RadialRate; // 0x3798 (4)
	float DescentBlurWidth; // 0x15A0 (4)
	struct Unknown AccelerationPPInst; // 0x27B8 (8)
	float TargetSpringArmLengthDescent; // 0x1850 (4)
	float SpeedSpringArmLengthDesecnt; // 0x1A5C (4)
	char bDescentCameraShakeLoop : 0; // 0x2A10 (1)
	float DescentCameraShakeDelay; // 0x2590 (4)
	struct Unknown* DescentCameraShake; // 0x1300 (8)
	struct Unknown CloudFxEmitterTemplate; // 0x1F58 (8)
	struct Unknown CloudFxInDescent; // 0x3438 (8)
	float VelocityZ_LandStop; // 0x1A3C (4)
	float VelocityZ_Falling; // 0x3138 (4)
	float PrevMeshRelativeZ; // 0x349C (4)
	float PronedEyeHeight; // 0x2EE8 (4)
	char bIsProneWeaponIdle : 0; // 0x316C (1)
	char bIsAutoSprint : 0; // 0x2F38 (1)
	float PronedDeltaHeightCamera3P; // 0x256C (4)
	float CrouchedDeltaHeightCamera3P; // 0x1154 (4)
	float CrouchMovedDeltaHeightCamera3P; // 0x1CF8 (4)
	float StandDeltaHeightCamera3P; // 0x20F8 (4)
	float StandSprintDeltaHeightCamera3P; // 0x2708 (4)
	struct Unknown Camera1PInterpSrc; // 0x2154 (12)
	struct Unknown Camera3PInterpSrc; // 0x928 (12)
	struct Unknown Camera3PInterpDst; // 0x1678 (12)
	float TargetArmLength; // 0x3664 (4)
	float TargetArmLengthInterpSpeed; // 0x2C30 (4)
	float TargetArmLengthInterpSpeed_AMP; // 0x1084 (4)
	float TargetArmLengthInterpSpeed_HeartBeatSensor; // 0x1ACC (4)
	float TargetFieldOfView; // 0x3238 (4)
	struct Unknown TargetSocketOffset; // 0x1644 (12)
	float DefaultCameraLag; // 0x1098 (4)
	float ReturnCameraLag; // 0xE58 (4)
	struct Unknown DefaultSocketOffset_VehicleAOS; // 0x289C (12)
	struct Unknown DefaultSocketOffset_LeftHipshot; // 0x31D4 (12)
	struct Unknown DefaultSocketOffset_Hipshot; // 0xBA0 (12)
	struct Unknown DefaultSocketOffset_RightHipshot; // 0x20B4 (12)
	struct Unknown DefaultSocketOffset_LeftLeanAOS; // 0x2F94 (12)
	struct Unknown DefaultSocketOffset_RightLeanAOS; // 0x7AC (12)
	struct Unknown DefaultSocketOffset_LeftAOS_Idle; // 0x2554 (12)
	struct Unknown DefaultSocketOffset_RightAOS_Idle; // 0x31E0 (12)
	struct Unknown DefaultSocketOffset_LeftAOS_Crouch; // 0x9C8 (12)
	struct Unknown DefaultSocketOffset_RightAOS_Crouch; // 0x2480 (12)
	struct Unknown DefaultSocketOffset_LeftAOS_Prone; // 0x36E0 (12)
	struct Unknown DefaultSocketOffset_RightAOS_Prone; // 0x2BA0 (12)
	struct Unknown DefaultTargetOffset_HipShot; // 0x2F0C (12)
	struct Unknown DefaultTargetOffset_AOS_Stand_Idle; // 0x28C8 (12)
	struct Unknown DefaultTargetOffset_AOS_Stand_Lean; // 0x1CB8 (12)
	struct Unknown DefaultTargetOffset_AOS_Crouch_Idle; // 0x83C (12)
	struct Unknown DefaultTargetOffset_AOS_Crouch_Lean; // 0x1E08 (12)
	float DefaultTargetArmLength_Hipshot; // 0x2160 (4)
	float DefaultTargetArmLength_AOS; // 0xA90 (4)
	float Camera3P_FOV_InterpSpeed; // 0xA14 (4)
	float Camera3P_AMP_FOV_InterpSpeed; // 0x1948 (4)
	float Camera3P_HeartBeatSensor_FOV_InterpSpeed; // 0x2F8C (4)
	float Camera3P_Lean_InterpSpeed; // 0x2518 (4)
	struct Unknown* DeathCamClass; // 0xC70 (8)
	float DeathBeginTime; // 0x3A54 (4)
	struct Unknown BodyBaseSkeletalMesh; // 0x668 (8)
	char bNeedToUpdatePreviewPawn : 0; // 0x3544 (1)
	struct Unknown Mutable_MaleInstance; // 0x11C0 (8)
	struct Unknown Mutable_FemaleInstance; // 0x2B98 (8)
	struct Unknown* InventoryCharacterClass; // 0x2300 (8)
	struct Unknown InventoryCharacter; // 0xBC8 (8)
	struct FMulticastInlineDelegate OnUpdateCastingDelegate; // 0x6B0 (16)
	int32_t UsingBackpackItemIndex; // 0xA28 (4)
	float ItemInterruptInputSeconds; // 0x31B8 (4)
	struct Unknown CastingItemTimer; // 0x1298 (8)
	struct Unknown CastingSupplyTimer; // 0x1780 (8)
	struct Unknown CastingItemMontageTimer; // 0x23F8 (8)
	struct Unknown LastCastingItemAnimSlot_Stand; // 0x1560 (16)
	struct Unknown LastCastingItemAnimSlot_Prone; // 0x13E8 (16)
	struct TArray<Unknown> CastingStopEvents; // 0x2BF0 (16)
	char bIsCastingItem : 0; // 0x1E14 (1)
	struct Unknown CompletedCastingInfo; // 0x2E5C (8)
	int32_t BasicSetting_gender; // 0x2198 (4)
	int32_t BasicSetting_face; // 0x15C8 (4)
	int32_t BasicSetting_face_color; // 0x2028 (4)
	int32_t BasicSetting_hair; // 0x24AC (4)
	int32_t BasicSetting_hair_color; // 0x142C (4)
	int32_t BasicSetting_makeup; // 0x36DC (4)
	struct TArray<Unknown> BasicSettingItemInfos; // 0x1FD0 (16)
	struct FName CombineTargetRecipe; // 0x1A88 (8)
	struct TArray<Unknown> CombineTargetMaterials; // 0x3550 (16)
	struct Unknown CombineCompleteAudioEvent; // 0x14A8 (8)
	char bEnabledFur : 0; // 0x1FA8 (1)
	struct FName WearableNameHasFur; // 0x32D0 (8)
	float CooldownTimeForEnterVehicle; // 0x25D4 (4)
	float CoolDownTimeForUseLadder; // 0x3728 (4)
	struct TArray<Unknown> NearbyVehicles; // 0x2258 (16)
	struct FMulticastInlineDelegate Delegate_OnEnteredVehicle; // 0x6C0 (16)
	float MaxVehicleEscapeSpeed; // 0x9A0 (4)
	struct Unknown PreviousVehicleSeat; // 0x2720 (8)
	struct TArray<Unknown> ProjectileGrenades; // 0x2268 (16)
	struct FMulticastInlineDelegate OnChangeProjectilePredict; // 0x2D50 (16)
	char IsBlind : 0; // 0x141C (1)
	struct FMulticastInlineDelegate OnAirCraftDelegate; // 0x21E0 (16)
	struct FMulticastInlineDelegate OnCharacterGroundStateChangeDelegate; // 0x15F8 (16)
	float FlashBangAngle; // 0x820 (4)
	struct Unknown* PostProcessFlashBangClass; // 0x2E70 (8)
	struct Unknown GrenadeFlashBangStartEvent; // 0x1370 (8)
	struct Unknown GrenadeFlashBangEndEvent; // 0x3710 (8)
	struct Unknown GrenadeFragmentExplosionSineStopEvent; // 0x9F0 (8)
	struct Unknown* PostProcessBloodHitClass; // 0x31C0 (8)
	struct Unknown DamagedDissolveAnimationCurve; // 0x1DC0 (8)
	struct Unknown PostProcessBloodHit; // 0x2420 (8)
	float DamagedDissolveRateTime; // 0x1268 (4)
	float DamagedTermTime; // 0x1540 (4)
	float DamagedDissolveAnimaitionMaxTime; // 0x2A60 (4)
	float HitBlinkTime; // 0x32A8 (4)
	float InternalDamagedTermTime; // 0xDE4 (4)
	float InternalHitBlinkTime; // 0x1FE0 (4)
	float DamagedDissolveAnimationValue; // 0x27F0 (4)
	char IsEndTermTime : 0; // 0x1A38 (1)
	char IsPlayingDamage : 0; // 0xA98 (1)
	char IsHit : 0; // 0x12CC (1)
	char IsDissolve : 0; // 0xC90 (1)
	char DamageReset : 0; // 0x26C0 (1)
	int32_t HitBlinkState; // 0x2608 (4)
	int32_t CurrentDamageCount; // 0x990 (4)
	int32_t DissolveCount; // 0x2504 (4)
	struct Unknown* PostProcessOuterPlayZoneClass; // 0x22E8 (8)
	float ShowTimePostProcessOuterPlayZone; // 0x11E8 (4)
	struct Unknown TimerHandle_OuterPlayZone; // 0x3100 (8)
	struct Unknown* PostProcessBlueZoneHitClass; // 0x14E8 (8)
	struct Unknown TimerHandle_BlueZone; // 0x1DF0 (8)
	struct Unknown* PostProcessMagneticHitClass; // 0x2D20 (8)
	struct Unknown PostProcessMagneticHit; // 0xBD8 (8)
	struct Unknown MagneticDamagedDissolveAnimationCurve; // 0x2778 (8)
	float MagneticDamagedTermTime; // 0x2A6C (4)
	float MagneticDamagedDissolveAnimaitionMaxTime; // 0x2F84 (4)
	float MagneticHitBlinkTime; // 0x3414 (4)
	float InternalMagneticDamagedTermTime; // 0x2888 (4)
	float InternalMagneticHitBlinkTime; // 0x1AF0 (4)
	float MagneticDamagedDissolveAnimationValue; // 0x2BE8 (4)
	float BluezoneMaterialOnTime; // 0x830 (4)
	char IsMagneticEndTermTime : 0; // 0x1BD2 (1)
	char IsMagneticDamage : 0; // 0x27DA (1)
	char IsMagneticHit : 0; // 0x2840 (1)
	char IsMagneticDissolve : 0; // 0x2808 (1)
	char MagneticDamageReset : 0; // 0x3498 (1)
	struct Unknown* PostProcessDustClass; // 0x26E8 (8)
	struct Unknown DustDissolveAnimationCurve; // 0x3980 (8)
	struct Unknown PostProcessDust; // 0x15B0 (8)
	float DustDissolveAnimaitionMaxTime; // 0x17AC (4)
	float DustDissolveDelayTime; // 0xB88 (4)
	float InternalDustDissolv; // 0xB14 (4)
	float DustDissolveAnimationValue; // 0x9D4 (4)
	char IsOnDust : 0; // 0x2B7C (1)
	char IsDustDissolve : 0; // 0x23E0 (1)
	char DustReset : 0; // 0x1898 (1)
	struct Unknown* PP_Preset_PickupOutline; // 0x1190 (8)
	struct Unknown PP_PickupOutlineRef; // 0x2560 (8)
	float CurrentOutlineThickness; // 0x24A8 (4)
	float MaxOutlineThickness; // 0x2568 (4)
	float OutlineThicknessInterpSpeed; // 0x1F98 (4)
	float CurrentCameraModifyerX; // 0x1D50 (4)
	float CurrentCameraModifyerY; // 0x228C (4)
	enum class Unknow CurrentEMouseSensitivityState; // 0x33F8 (1)
	char bPendingOpenDoor : 0; // 0x2CA8 (1)
	struct Unknown KickTargetDoor; // 0x1160 (8)
	struct Unknown DoorBreachingParticle; // 0x3228 (8)
	struct Unknown WindowBreachingParticle; // 0x2A08 (8)
	struct Unknown BreachingAudioEvent; // 0x1698 (8)
	struct Unknown BreachingAudioEvent_Silence; // 0x3788 (8)
	struct Unknown AnimInstance; // 0x26F0 (8)
	struct Unknown PostprocessAnimInstance; // 0x16F0 (8)
	struct Unknown AnimInstance_FPP; // 0x1CD8 (8)
	struct Unknown BravoHotelGameState; // 0x2810 (8)
	struct Unknown BravoHotelPlayerController; // 0x3800 (8)
	int32_t IdleNum; // 0x34E0 (4)
	float IdleWaitingTime; // 0x25D0 (4)
	struct FName LevelUpEffectBuffName; // 0x12B0 (8)
	struct TArray<Unknown> DefaultBuffName; // 0x2430 (16)
	struct TArray<Unknown> DefaultPerkInfo; // 0x1AB8 (16)
	struct TArray<Unknown> UberUser; // 0x2458 (16)
	struct TArray<Unknown> CurrentPerkInfos; // 0x3348 (16)
	struct Unknown UltimatePerkInfo; // 0x3278 (40)
	struct TArray<Unknown> PerkUIInfos; // 0x1668 (16)
	struct Unknown UltimateUIInfo; // 0x3840 (44)
	struct TArray<Unknown> CurrentPerkCards; // 0x1198 (16)
	struct TArray<Unknown> MutableBuffList; // 0x1750 (16)
	enum class Unknow CurrentSkillType; // 0x1C10 (1)
	struct FMulticastInlineDelegate OnChangeFireType; // 0x1608 (16)
	int32_t CurrentReadyToSnipeGrade; // 0x260C (4)
	struct FMulticastInlineDelegate Delegate_OnEndSearchInstinct; // 0x1D20 (16)
	struct TArray<Unknown> UsedTrapList; // 0x2670 (16)
	enum class Unknow PerkLevelUpType; // 0x3A40 (1)
	int32_t ActiveSkillInitIndex; // 0xC6C (4)
	int32_t ActiveSkillCount; // 0x270C (4)
	struct Unknown CurrentDisplayAbility; // 0x2984 (12)
	struct TArray<Unknown> LoadedClasses; // 0x1548 (16)
	int32_t PerkDeckChangingCount; // 0x2D38 (4)
	struct FMulticastInlineDelegate OnMovementInputPressedDelegate; // 0x708 (16)
	char bIsMoving : 0; // 0xBE0 (1)
	char bForceMoving : 0; // 0xC18 (1)
	struct Unknown* LastDamagedType; // 0x31F0 (8)
	float LastDamagedAmount; // 0x22D8 (4)
	struct Unknown* LastHitType; // 0x3750 (8)
	struct Unknown LastSimulatedTakeDamageInfo; // 0x948 (72)
	struct Unknown DebuffHitResult; // 0x398C (136)
	struct Unknown* DebuffHitDamageType; // 0x28F8 (8)
	struct TArray<Unknown> TakeDamageMontageList; // 0x10B8 (16)
	struct Unknown BloodSplatterEffect; // 0x36F8 (8)
	struct Unknown PunchEffect; // 0x1BF8 (8)
	struct Unknown ThrowingWeaponDirectHitEffect; // 0x1200 (8)
	float BloodEffectNearbyDist; // 0x122C (4)
	struct Unknown DefaultItemSetting; // 0x1000 (56)
	struct Unknown DefaultWearableSetting; // 0x2C00 (24)
	struct TArray<Unknown> BlackMarketItemPresetList; // 0x37E8 (16)
	struct FMulticastInlineDelegate OnCanProneFailedDelegate; // 0x720 (16)
	float MinDamageableFallingSpeed; // 0x211C (4)
	float MaxDamageableFallingSpeed; // 0xFE0 (4)
	float MinDamageableFallingSpeedFromVehicle; // 0x2B10 (4)
	float MaxDamageableFallingSpeedFromVehicle; // 0xB10 (4)
	enum class Unknow LandingReason; // 0xD11 (1)
	struct FMulticastInlineDelegate Delegate_OnExitFallingState; // 0x14D8 (16)
	struct TArray<Unknown> OverlappedPhysicMaterials; // 0x1248 (16)
	float BushSoundSpawnDelay; // 0x17A8 (4)
	float BushLandingDamageMultiplier; // 0x2E64 (4)
	struct TSet<Unknown> OverlappedCantProneComponent; // 0x1C30 (80)
	char bIsInsideBlueZone : 0; // 0x178D (1)
	char bIsSpectated : 0; // 0x1A58 (1)
	struct TMap<Unknown, Unknown>Unknown Camera3P_DeltaTargetOffsets; // 0x1980 (80)
	char b : 0; // 0x924 (1)
	char bUpdateDeathRotation : 0; // 0x2A58 (1)
	struct Unknown RagdollLocation; // 0xD68 (12)
	struct Unknown RagdollVelocity; // 0x8F0 (12)
	struct Unknown LastDamageType; // 0x8E8 (8)
	float Ragdoll_ZOffset; // 0x1D34 (4)
	char bApplyRagdollForce : 0; // 0x3014 (1)
	struct Unknown BravoHotelCharacterMovement; // 0x750 (8)
	char PrevMovementMode; // 0x2B14 (1)
	char NewMovementMode; // 0x11DC (1)
	enum class Unknow PrevCustomMovementMode; // 0x27D8 (1)
	enum class Unknow NewCustomMovementMode; // 0xF08 (1)
	struct Unknown MovementInputVector; // 0x1F38 (12)
	struct Unknown TimerHandle_HideParachute; // 0x758 (8)
	struct Unknown Timeline_TunnelEffect; // 0x35C0 (152)
	struct TMap<Unknown, Unknown>Unknown Curve_TunnelEffect; // 0x3930 (80)
	struct Unknown Timeline_CameraInterp; // 0x17B8 (152)
	struct Unknown Curve_CameraInterp; // 0x2E78 (8)
	struct Unknown Curve_AdsCameraInterp; // 0x918 (8)
	struct Unknown TimerHandle_MinTimeJumpingBeforeLand; // 0x3440 (8)
	float MinTimeJumpingBeforeLand; // 0x2DE4 (4)
	float DescentXYAcc; // 0x2E18 (4)
	float DescentAirControl; // 0x1A90 (4)
	float DescentSpeed; // 0x1934 (4)
	float DescentGravityScale; // 0x1D14 (4)
	float DescentDeacceleration; // 0x8FC (4)
	float DescentMaxAcceleration; // 0x8A4 (4)
	struct Unknown DescentCameraLocation; // 0x2280 (12)
	float ParachuteAirControl; // 0x37CC (4)
	float ParachuteSpeed; // 0x2E68 (4)
	float ParachuteGravity; // 0x1558 (4)
	float ParachuteDeacceleration; // 0xFBC (4)
	float ParachuteMaxAcceleration; // 0xC94 (4)
	struct Unknown ParachuteCameraLocation; // 0x1448 (12)
	float ParachuteSocketOffsetY; // 0x1D0C (4)
	float ParachuteSocketDeltaOffsetZ; // 0x1C20 (4)
	float ParachuteReadyToLandHeight; // 0x3548 (4)
	float ParachuteQuickLandingStartHeight; // 0x2C48 (4)
	float ParachuteQuickLandingStartRadius; // 0x392C (4)
	float ParachuteQuickLandingVelocityModifierXY; // 0x1978 (4)
	float ParachuteQuickLandingVelocityModifierZ; // 0x11D8 (4)
	float ParachuteQuickLandingDMGRate; // 0x1938 (4)
	char bCanQuickLanding : 0; // 0x2108 (1)
	struct Unknown LastQuickLandingAllowedLocation; // 0x3538 (12)
	struct Unknown ParachuteTargetCameraLocation; // 0x3670 (12)
	float ParachuteTargetCameraSpeed; // 0x26FC (4)
	float ParachuteTargetArmLengthSpeedStart; // 0x8A0 (4)
	float ParachuteTargetArmLengthSpeedEnd; // 0xFA8 (4)
	struct Unknown* ParachuteUnfoldCameraShake; // 0x3418 (8)
	struct Unknown BreathStartEvent; // 0x29A0 (8)
	struct Unknown BreathEndEvent; // 0x1D38 (8)
	struct Unknown BreathStopEvent; // 0xFC8 (8)
	struct Unknown SprintingBeginRange; // 0x365C (8)
	struct Unknown SprintingRange; // 0xB28 (8)
	float ReduceCharacterSpeedTime; // 0x2DB8 (4)
	float InternalReduceCharacterSpeedTime; // 0x13C8 (4)
	char IsInReduceSpeedExplosionRange : 0; // 0x3188 (1)
	struct Unknown PostProcessEffectsTable; // 0xAD0 (8)
	struct TMap<Unknown, Unknown>Unknown PostProcessAssignedList; // 0x16A0 (80)
	struct TArray<Unknown> PostProcessBuffList; // 0x28A8 (16)
	struct Unknown RenderSettingsTable; // 0xFA0 (8)
	char bUpdateRenderSettings : 0; // 0x1C11 (1)
	int32_t CurrentTerrainType; // 0x15A8 (4)
	struct Unknown AttachInAircraftOffset; // 0x2A38 (12)
	struct Unknown AttachInAircraftRotationOffset; // 0x33A4 (12)
	struct Unknown AttachInAircraftCameraLocaiton; // 0x1720 (12)
	float InitSpringArmLengthInAircraft; // 0x3824 (4)
	float TargetSpringArmLengthInAircraft; // 0xDA4 (4)
	float SpeedSpringArmLengthInAirCraft; // 0x2F08 (4)
	float PrevBloomIntensity; // 0x29F8 (4)
	float PrevBloomThreshold; // 0x2A5C (4)
	float TargetBloomIntensityInAirCraft; // 0x26C4 (4)
	float SpeedBloomIntensityInAirCraft; // 0x1BB8 (4)
	float BloomStartDelayTimeInAirCraft; // 0x1BA0 (4)
	float CineDurationTimeMax; // 0x2710 (4)
	float CineTextAnimationAppearTime; // 0x9C0 (4)
	float GetPerkOnStartTime; // 0x32A0 (4)
	struct Unknown FPSK_Camera; // 0xD48 (8)
	struct Unknown ADSCameraScene; // 0x1B78 (8)
	struct Unknown FPSK_MutableArms; // 0x3108 (8)
	struct Unknown FPSK_Arms; // 0xBE8 (8)
	struct Unknown FPSK_CameraHeight; // 0x2E08 (12)
	float FPSK_CameraProbe; // 0x1CC4 (4)
	float FPSK_CameraPitchDeltaX; // 0x3808 (4)
	struct Unknown FPSK_CameraLocation_Idle; // 0x2548 (12)
	struct FName FPSK_CameraBone_Idle; // 0x11B8 (8)
	struct Unknown FPSK_CameraLocation_ADS; // 0xF54 (12)
	struct Unknown FPSK_CameraLocation_Parkour; // 0x1420 (12)
	struct FName FPSK_CameraBone_Parkour; // 0x2D70 (8)
	float FPSK_CameraHeight_Stand; // 0x824 (4)
	float FPSK_CameraHeight_Crouch; // 0x3390 (4)
	float FPSK_CameraHeight_Prone; // 0x1AE0 (4)
	struct Unknown FPSK_CameraLocation_Collide; // 0x103C (12)
	struct Unknown FPSK_CameraLocation_LeftLeanDelta; // 0x263C (12)
	struct Unknown FPSK_CameraLocation_RightLeanDelta; // 0xFF4 (12)
	float FPSK_CameraLocation_CollideAlpha; // 0x2A68 (4)
	struct Unknown FPSK_StartCameraHeight; // 0x2530 (12)
	struct Unknown FPSK_DestCameraHeight; // 0xAF0 (12)
	struct Unknown FPSK_WeaponShadow; // 0x37F8 (8)
	struct Unknown FPSK_SightShadow; // 0x27E0 (8)
	struct Unknown FPSK_GripShadow; // 0x1FC8 (8)
	struct Unknown FPSK_MagazineShadow; // 0x12C0 (8)
	struct Unknown FPSK_StockShadow; // 0x1D80 (8)
	struct Unknown FPSK_TacticalAttachmentShadow; // 0x1CE8 (8)
	struct Unknown FPSK_BarrelShadow; // 0x2EF0 (8)
	struct Unknown FPSK_MuzzleShadow; // 0x1AA0 (8)
	struct TArray<Unknown> FPSK_WeaponAttachments; // 0x3900 (16)
	char bFPSK_UseCustomCurv : 0; // 0x9B0 (1)
	char bFPSK_IsDefaultTransformUpdated : 0; // 0x9BC (1)
	char bFPSK_IsFPSMode : 0; // 0x2639 (1)
	struct Unknown FPSK_CurrentWeaponTransform; // 0x22A0 (48)
	struct Unknown FPSK_IdleWeaponTransform; // 0x2850 (48)
	struct Unknown FPSK_CollideWeaponTransform; // 0x2FB0 (48)
	struct Unknown FPSK_ADS_DefaultWeaponTransform; // 0x34B0 (48)
	struct Unknown FPSK_ADS_TargetWeaponTransform; // 0xDF0 (48)
	struct Unknown FPSK_ADS_DefaultWeaponTransform_BasicSightCache; // 0x2B20 (48)
	struct Unknown FPSK_ADS_DefaultWeaponTransform_CurrentSightCache; // 0x1D90 (48)
	struct Unknown FPSK_ADS_WeaponTransform; // 0x2CC0 (48)
	float FPSK_ADSFOV; // 0x2BD4 (4)
	float FPSK_AOSFOV; // 0x3434 (4)
	float FPSK_DefaultFOV; // 0x36C8 (4)
	float FPSK_CurrentMagnificationFactor; // 0x1100 (4)
	float FPSK_TargetMagnificationFactor; // 0x1D30 (4)
	struct Unknown MPC_WeaponFov; // 0x28D8 (8)
	struct Unknown FPSK_CurrentCameraRelativeLocation; // 0xDD4 (12)
	float FPSK_ADSAlpha; // 0x31D0 (4)
	float FPSK_StartFOV_Delta; // 0x1E18 (4)
	float CameraInterpPlayRate; // 0x3570 (4)
	float AdsCameraInterpPlayRate; // 0x1DC8 (4)
	float FPSK_TargetADSAlpha; // 0xFAC (4)
	struct Unknown FPSK_Timeline_Sway_Idle; // 0x2338 (152)
	struct Unknown FPSK_Timeline_Sway_Move; // 0x3038 (152)
	struct Unknown FPSK_Curve_Sway_Idle_Default; // 0x1770 (8)
	struct Unknown FPSK_Curve_Sway_Move_Default; // 0x11F0 (8)
	struct Unknown FPSK_Curve_Sway_Scale_With_; // 0x20D8 (8)
	struct Unknown FPSK_Curve_Sway_Idle; // 0x2A28 (8)
	struct Unknown FPSK_Curve_Sway_Mov; // 0xD40 (8)
	char bUseFPSK_Sway : 0; // 0x1238 (1)
	float FPSK_SwayAlpha; // 0x22D0 (4)
	float FPSK_SwayAlphaMin; // 0x3820 (4)
	float FPSK_SwayAlphaMax; // 0x1544 (4)
	float FPSK_SwayScale; // 0xE90 (4)
	struct Unknown FPSK_SwayRotationIdle; // 0x15EC (12)
	struct Unknown FPSK_SwayRotationMove; // 0xED8 (12)
	struct Unknown FPSK_SwayRotationDeltaForSteadyAim; // 0x2D98 (12)
	float FPSK_SwayInterpSpeed; // 0x1FC4 (4)
	struct Unknown FPSK_LeanRotation; // 0x123C (12)
	struct Unknown FPSK_LeanLocation; // 0x3148 (12)
	struct Unknown FPSK_CurrentCollideWeaponTransform; // 0x2120 (48)
	float FPSK_CollideAlpha; // 0x1878 (4)
	float FPSK_CollideAngle; // 0x2BAC (4)
	float FPSK_CollideAngle_LocalCache; // 0x2900 (4)
	char bFPSK_IsCollide : 0; // 0xB8C (1)
	struct TMap<Unknown, Unknown>Unknown FPSK_Curves_TunnelEffect; // 0x19E8 (80)
	float FPSK_TargetFOV; // 0x1088 (4)
	struct Unknown TimerHandle_NoCarLandingDamageToTeam; // 0x27C0 (8)
	float InAircraftNearClipPlane; // 0x36EC (4)
	struct TArray<Unknown> AIBot_SearchedEnemyList; // 0x1B80 (16)
	char bEnableCustomDepth : 0; // 0x2F50 (1)
	struct Unknown TimerHandle_HurtCondition; // 0x3030 (8)
	float ProneDamageScaleInRedZone; // 0x1E04 (4)
	struct Unknown BlueZoneFreezeEvent; // 0x3170 (8)
	struct Unknown BlueZoneFreezeStopEvent; // 0x1768 (8)
	struct Unknown BlueZoneDroneEvent; // 0x7F8 (8)
	struct Unknown BlueZoneDroneStopEvd; // 0x2298 (8)
	struct Unknown SupplyBoxNotifyAlertMe; // 0xB18 (8)
	struct Unknown SupplyBoxNotifyAlertOther; // 0x30D8 (8)
	float CheckFreezeDistance; // 0xBF4 (4)
	float CheckDroneDistance; // 0x3704 (4)
	struct Unknown DefaultSocketOffset_LeftLeanAMP; // 0x1CA0 (12)
	struct Unknown DefaultSocketOffset_RightLeanAMP; // 0x1A60 (12)
	struct Unknown DefaultSocketOffset_RightAMP; // 0xB30 (12)
	struct Unknown DefaultSocketOffset_LeftAMP; // 0xABC (12)
	float DefaultTargetArmLength_AMP; // 0xFF0 (4)
	float AmplifierFocusDistance; // 0x3250 (4)
	struct Unknown DefaultSocketOffset_LeftLeanHeartBeatSensor; // 0x1D60 (12)
	struct Unknown DefaultSocketOffset_RightLeanHeartBeatSensor; // 0x202C (12)
	struct Unknown DefaultSocketOffset_RightHeartBeatSensor; // 0x27CC (12)
	struct Unknown DefaultSocketOffset_LeftHeartBeatSensor; // 0x2574 (12)
	float DefaultTargetArmLength_HeartBeatSensor; // 0x2F44 (4)
	float HeartBeatSensorFocusDistance; // 0x1584 (4)
	float CameraFocusDistanceAOS; // 0x8B0 (4)
	float AirWalkStartTime; // 0xFD8 (4)
	struct Unknown TimerHandle_StopAirWalk; // 0x1FF8 (8)
	float AirWalkBestRecord; // 0x1E00 (4)
	float AirWalkTotalRecord; // 0x2570 (4)
	struct Unknown AirWalkAudioEvent; // 0x1CF0 (8)
	float CurrentAirWalkVelocityZ; // 0x1400 (4)
	float AirWalkDuration; // 0x2150 (4)
	float AirWalkGravity; // 0x21BC (4)
	struct Unknown PersonalSupplySystemComponent; // 0x3838 (8)
	enum class Unknow PrevNetworkSmoothingMode; // 0xB60 (1)
	struct Unknown TimeHandle_SkyDive; // 0x778 (8)
	char bActiveCriticalTime : 0; // 0x3828 (1)
	float CriticalTimeTickInterval; // 0x22F8 (4)
	float CriticalTimeLimitTime; // 0x1790 (4)
	struct Unknown CriticalTimeMeshLocaiton; // 0x2E30 (12)
	struct TMap<Unknown, Unknown>Unknown CriticalTimeComponentTickIntervals; // 0x32E8 (80)
	float ParachuteEnableHieght; // 0x1290 (4)
	struct Unknown ParachuteTriggerBox; // 0x2000 (8)
	struct Unknown CurHit; // 0x3870 (136)
	struct Unknown Curve_Sliding; // 0x9E0 (8)
	struct Unknown ParticleSystem_Sliding; // 0x1308 (8)
	struct Unknown ParticleSystemComponent_Sliding; // 0x1048 (8)
	float SlidingStartTime; // 0xDD0 (4)
	enum class Unknow GroundStateBeforeSliding; // 0x29FC (1)
	struct TMap<Unknown, Unknown>Unknown ReplicateIndexPerkMap; // 0x21F0 (80)
	int16_t SlidingBuffIndex; // 0x1BB4 (2)
	char bPendingStopSliding : 0; // 0x1588 (1)
	float RollingStartTime; // 0x376C (4)
	struct Unknown* PostProcessWetFogClass; // 0x1960 (8)
	struct TArray<Unknown> ActiveWetFogAreas; // 0x2DE8 (16)
	struct Unknown WetFogInfo; // 0x3458 (32)
	struct Unknown WetFogZoneInfo; // 0xF64 (12)
	struct Unknown TimerHandle_WetFog; // 0xD20 (8)
	struct Unknown* PostProcessBlackOutClass; // 0x1108 (8)
	struct TArray<Unknown> ActivePowerInterruptions; // 0x2DC0 (16)
	struct Unknown BlackOutInfo; // 0xE98 (32)
	struct Unknown TimerHandle_BlackOut; // 0xFE8 (8)
	struct Unknown StartBlackOutAudioEvent; // 0x1B00 (8)
	struct Unknown StartBlackOutParticle; // 0x1620 (8)
	struct Unknown StartBlackOutParticleComponent; // 0xE50 (8)
	struct FMulticastInlineDelegate OnSpawnBlackOutDelegate; // 0x2C80 (16)
	struct Unknown* PostProcessForceFieldClass; // 0x9F8 (8)
	struct TArray<Unknown> ActiveForceFields; // 0x3400 (16)
	struct Unknown ForceFieldInfo; // 0x2650 (32)
	struct Unknown TimerHandle_ForceField; // 0x3480 (8)
	struct Unknown* SuperBarrierClass; // 0x12A8 (8)
	char UsingSimulationBox : 0; // 0x344D (1)
	char HiddenSimulationBox : 0; // 0x27DC (1)
	float SimulationBoxHeight; // 0x2330 (4)
	struct TSoftClassPtr<UObject> SimulationBoxClass; // 0x3588 (40)
	struct FMulticastInlineDelegate OnCompleteActiveSkillDelegate; // 0x1A40 (16)
	struct Unknown BombingTargetActor; // 0x1FB8 (8)
	struct Unknown StartBomingEvent; // 0x22F0 (8)
	char IsBombing : 0; // 0x20E1 (1)
	struct Unknown BombingInfo; // 0x2FF0 (36)
	float AutoAimRadius; // 0x3478 (4)
	float AutoAimDistance; // 0xFE4 (4)
	char bShowAutoAimDebug : 0; // 0xDE0 (1)
	struct Unknown TeleportFxTemplate; // 0x3770 (8)
	struct Unknown TeleportTraceFxTemplate; // 0x24E8 (8)
	float TeleportDisappearTime; // 0xD94 (4)
	float TeleportAppearTime; // 0x3140 (4)
	float RocketJumpGravity; // 0x21B4 (4)
	struct Unknown RocketJumpAudioEvent; // 0xD80 (8)
	struct Unknown RocketJumpLandedAudioEvent; // 0x1AF8 (8)
	struct Unknown ParticleSystem_RocketJump; // 0x17A0 (8)
	struct Unknown ParticleSystem_RocketJumpTrail; // 0x808 (8)
	struct Unknown ParticleSystem_RocketJumpLanded; // 0x2F60 (8)
	struct Unknown RocketJumpTrailEffect; // 0xC20 (8)
	char bFinishMeteorJump : 0; // 0xBC4 (1)
	float MeteorJumpGravity; // 0x1FAC (4)
	char bMeteorStrikeBlockingHit : 0; // 0x1BD0 (1)
	struct TArray<Unknown> MeteorGrenadeProjectileClass; // 0x2F28 (16)
	struct Unknown MeteorJumpAudioEvent; // 0x3230 (8)
	struct Unknown MeteorJumpLandedAudioEvent; // 0x7A0 (8)
	struct Unknown ParticleSystem_MeteorJump; // 0x7C0 (8)
	struct Unknown ParticleSystem_MeteorJumpTrail; // 0x2FE8 (8)
	struct Unknown ParticleSystem_MeteorJumpLanded; // 0x2D48 (8)
	struct Unknown MeteorJumpTrailEffect; // 0x2FA8 (8)
	struct Unknown MeteorTarget; // 0x1230 (8)
	struct TArray<Unknown> ThrownFlashbangs; // 0x32B0 (16)
	struct TArray<Unknown> ThrownMolotovCocktails; // 0xC78 (16)
	struct TArray<Unknown> ThrownC4s; // 0x1528 (16)
	char bIsUltimateSprint : 0; // 0xAB8 (1)
	char IgnoreInteraction : 0; // 0x1218 (1)
	struct FMulticastInlineDelegate OnChangeCharacterStateDelegate; // 0x2A18 (16)
	int32_t LogSize; // 0x1140 (4)
	struct Unknown TimeHandle_RequestBuildingInfo; // 0x1890 (8)
	float LogIntervalTime; // 0x1DF8 (4)
	int32_t LogRequestSize; // 0x3A58 (4)
	struct TArray<Unknown> LogList; // 0x2E20 (16)
	struct TArray<Unknown> LogJsonList; // 0x25B8 (16)
	struct Unknown GodEffect1; // 0x2410 (8)
	struct Unknown GodEffect2; // 0x940 (8)
	struct Unknown ParticleSystem_Knockout; // 0x1970 (8)
	struct Unknown RepSimulatedHittedDamage; // 0x31F8 (16)
	float FirstTimeHittedDamage; // 0x25F0 (4)
	float LastTimeHittedDamage; // 0x11E4 (4)
	struct Unknown GodParticle; // 0x2448 (8)
	char NeedFindPersonalSupplyBoxLocation : 0; // 0xA00 (1)
	int32_t PersonalSupplyBoxRePositionCount; // 0x34A0 (4)
	char UsingPersonalSupplyBoxWeightMap : 0; // 0x17B0 (1)
	char UsingPersonalSupplyBoxRePosition : 0; // 0x1583 (1)
	float PersonalSupplyBoxRePositionDistance; // 0xFB4 (4)
	struct Unknown TimeHandle_Ultimate_Recon; // 0xC48 (8)
	struct Unknown AnimSlot_Ultimate_Recon; // 0x2A70 (16)
	char bIsUltimate_Recon : 0; // 0x1B70 (1)
	struct Unknown AvoidHeadShotMontage; // 0x1650 (8)
	struct Unknown SteelHelmetSound; // 0xF40 (8)
	struct Unknown StuntmanRollingDir; // 0x10A8 (12)
	float StuntmanStartTime; // 0x162C (4)
	struct Unknown TimerHandle_Stuntman; // 0x3120 (8)
	char bNeedToUpdateNitroBoost : 0; // 0x21B0 (1)
	float NitroBoostTorqueScale; // 0xD98 (4)
	struct Unknown NitroBoomTargetVehicle; // 0x13F8 (8)
	char bNeedToUpdateNitroBoom : 0; // 0x3700 (1)
	float NitroBoomDuration; // 0xA9C (4)
	char bNeedToDrawNitroBoomTarget : 0; // 0x1368 (1)
	struct Unknown NitroBoomTargetLocation; // 0x2CAC (12)
	float NitroBoomLastVehicleSetTime; // 0x172C (4)
	char bNeedToUpdateUltimate_Driver : 0; // 0x22FC (1)
	char bNeedToCheckPlosiveSoundDetection : 0; // 0x79C (1)
	struct Unknown EnteredElevatorRef; // 0x37B0 (8)
	float OuterDamage; // 0x780 (4)
	struct Unknown TimerHandle_InOuterArea; // 0x788 (8)
	struct Unknown TimerHandle_UpdateInOuterArea; // 0x790 (8)
	struct FMulticastInlineDelegate DelegateCheckSupplyCost; // 0x3218 (16)
	struct Unknown SecuredCache; // 0xFB0 (4)
	struct Unknown DamageCorrectValueByPenetrationDepthCurve; // 0x1D58 (8)
	struct Unknown AircraftFlightRef; // 0x2BE0 (8)

	void WearItem(enum class Unknow Slot, struct FString UniqueKey, char bUpdateSkeletalMesh); // Function BravoHotelGame.BravoHotelCharacter.WearItem(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED9970>
	char WasMeshRecentlyRenderedOnScreen(float Tolerance); // Function BravoHotelGame.BravoHotelCharacter.WasMeshRecentlyRenderedOnScreen(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED98E0>
	char WantToFPSMode(); // Function BravoHotelGame.BravoHotelCharacter.WantToFPSMode(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED9850>
	char WantsToRocketJump(); // Function BravoHotelGame.BravoHotelCharacter.WantsToRocketJump(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED98B0>
	char WantsToMeteorJump(); // Function BravoHotelGame.BravoHotelCharacter.WantsToMeteorJump(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED9880>
	char ValidateEquippedWeaponsInVehicle(int32_t WeaponIndex); // Function BravoHotelGame.BravoHotelCharacter.ValidateEquippedWeaponsInVehicle(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED97C0>
	void ValidateCameraInterp(); // Function BravoHotelGame.BravoHotelCharacter.ValidateCameraInterp(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED97A0>
	void UpdateWetFogPP(char bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdateWetFogPP(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED9710>
	void UpdateWalking_Prone(); // Function BravoHotelGame.BravoHotelCharacter.UpdateWalking_Prone(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED96F0>
	void UpdateWalking(); // Function BravoHotelGame.BravoHotelCharacter.UpdateWalking(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED96D0>
	void UpdateUltimate_Recon(); // Function BravoHotelGame.BravoHotelCharacter.UpdateUltimate_Recon(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED96B0>
	void UpdateTunnelEffect(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdateTunnelEffect(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED9630>
	void UpdateTimeline(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateTimeline(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED95B0>
	void UpdateTerrainType(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateTerrainType(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED9530>
	void UpdateTargetHealth(enum class Unknow Type, float InTargetHealth); // Function BravoHotelGame.BravoHotelCharacter.UpdateTargetHealth(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED9470>
	void UpdateSurfaceType(); // Function BravoHotelGame.BravoHotelCharacter.UpdateSurfaceType(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED9450>
	void UpdateStatupMaterialEffect(); // Function BravoHotelGame.BravoHotelCharacter.UpdateStatupMaterialEffect(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED9430>
	void UpdateSliding(); // Function BravoHotelGame.BravoHotelCharacter.UpdateSliding(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED9410>
	void UpdateRolling(); // Function BravoHotelGame.BravoHotelCharacter.UpdateRolling(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED93F0>
	void UpdateReplaceFreeLook(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateReplaceFreeLook(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED9370>
	void UpdateRenderSettings(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateRenderSettings(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED92F0>
	void UpdatePowerInterruptionPP(char bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdatePowerInterruptionPP(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED9260>
	void UpdatePostProcess_Indoor(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdatePostProcess_Indoor(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED91E0>
	void UpdatePostProcess_FPP(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdatePostProcess_FPP(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED9160>
	void UpdatePostProcess_CameraMonoChrome(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdatePostProcess_CameraMonoChrome(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED90E0>
	void UpdatePostProcess_ADS(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdatePostProcess_ADS(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED9060>
	void UpdatePostProcess(struct FName RowName, float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdatePostProcess(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8F90>
	void UpdatePassengerLocation(); // Function BravoHotelGame.BravoHotelCharacter.UpdatePassengerLocation(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8F70>
	void UpdateOuterPlayZonePP(char bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdateOuterPlayZonePP(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8EE0>
	void UpdateNitroBoom(); // Function BravoHotelGame.BravoHotelCharacter.UpdateNitroBoom(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8EC0>
	void UpdateNearClipPlane(); // Function BravoHotelGame.BravoHotelCharacter.UpdateNearClipPlane(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8EA0>
	void UpdateMutableMesh(); // Function BravoHotelGame.BravoHotelCharacter.UpdateMutableMesh(Native|Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8E80>
	void UpdateMutableBuffList(); // Function BravoHotelGame.BravoHotelCharacter.UpdateMutableBuffList(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8E60>
	void UpdateMutable__DelegateSignature(struct Unknown Character); // DelegateFunction BravoHotelGame.BravoHotelCharacter.UpdateMutable__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void UpdateMeleeAttack(struct Unknown MeleeAnimNotifyClass, char bDrawDebugObject); // Function BravoHotelGame.BravoHotelCharacter.UpdateMeleeAttack(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8D90>
	void UpdateLeanValue(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateLeanValue(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8D10>
	void UpdateKnockOutParticle(); // Function BravoHotelGame.BravoHotelCharacter.UpdateKnockOutParticle(Final|Native|Private) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8CF0>
	void UpdateJetpackFuel(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateJetpackFuel(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8C70>
	void UpdateInteractionType(struct Unknown& Hit); // Function BravoHotelGame.BravoHotelCharacter.UpdateInteractionType(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8B90>
	void UpdateInRagdoll(); // Function BravoHotelGame.BravoHotelCharacter.UpdateInRagdoll(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8B70>
	void UpdateIdleNum(); // Function BravoHotelGame.BravoHotelCharacter.UpdateIdleNum(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8B50>
	void UpdateGroundFriction(); // Function BravoHotelGame.BravoHotelCharacter.UpdateGroundFriction(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8B30>
	void UpdateFurActivation(); // Function BravoHotelGame.BravoHotelCharacter.UpdateFurActivation(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8B10>
	void UpdateFPSMode(); // Function BravoHotelGame.BravoHotelCharacter.UpdateFPSMode(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8A20>
	void UpdateForceFieldPP(char bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdateForceFieldPP(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8A80>
	void UpdateFireInput(); // Function BravoHotelGame.BravoHotelCharacter.UpdateFireInput(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8A60>
	void UpdateFalling(); // Function BravoHotelGame.BravoHotelCharacter.UpdateFalling(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8A40>
	void UpdateDrive(); // Function BravoHotelGame.BravoHotelCharacter.UpdateDrive(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x151AF10>
	void UpdateDebuffState(); // Function BravoHotelGame.BravoHotelCharacter.UpdateDebuffState(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8A00>
	void UpdateCharacterOutlineMaterial(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCharacterOutlineMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8980>
	void UpdateCharacterMagneticDamagedMaterial(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCharacterMagneticDamagedMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8900>
	void UpdateCharacterDustMaterial(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCharacterDustMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8880>
	void UpdateCharacterDamagedMaterial(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCharacterDamagedMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8800>
	void UpdateCastingUI(); // Function BravoHotelGame.BravoHotelCharacter.UpdateCastingUI(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED87E0>
	void UpdateCameraPPByBuff(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCameraPPByBuff(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8760>
	void UpdateCameraPP(char bIsOn, float StartValue, float TargetValue, float InTime, float OutTime, struct FName AnimName, struct Unknown* PPPresetClass, struct Unknown& DeactiveTimer, char bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdateCameraPP(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED84C0>
	void UpdateCameraInterp(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdateCameraInterp(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8440>
	void UpdateCamera(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCamera(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED83C0>
	void UpdateBreathEffect(); // Function BravoHotelGame.BravoHotelCharacter.UpdateBreathEffect(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED83A0>
	void UpdateBlueZonePP(char bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdateBlueZonePP(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8310>
	void UpdateAreaInfo(struct TArray<Unknown> TargetActiveAreas, struct Unknown& TargetSkillZoneInfo); // Function BravoHotelGame.BravoHotelCharacter.UpdateAreaInfo(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED81B0>
	void UpdateAOSMode(); // Function BravoHotelGame.BravoHotelCharacter.UpdateAOSMode(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8110>
	void UpdateADSReturnTrigger(); // Function BravoHotelGame.BravoHotelCharacter.UpdateADSReturnTrigger(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED80F0>
	void UpdateAdsCameraInterp(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdateAdsCameraInterp(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8130>
	void UnProne(char bClientSimulation); // Function BravoHotelGame.BravoHotelCharacter.UnProne(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED8040>
	void UnlockMovementInput(); // Function BravoHotelGame.BravoHotelCharacter.UnlockMovementInput(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED80D0>
	void TryRetreat(char InIsRandomLocation, struct Unknown InTargetLocation); // Function BravoHotelGame.BravoHotelCharacter.TryRetreat(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7F60>
	void TryNuclear(struct Unknown InTargetLocation); // Function BravoHotelGame.BravoHotelCharacter.TryNuclear(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7ED0>
	void TryExitLadder(char bIsForce); // Function BravoHotelGame.BravoHotelCharacter.TryExitLadder(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7E40>
	struct Unknown TraceSteppedSurface(); // Function BravoHotelGame.BravoHotelCharacter.TraceSteppedSurface(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7E10>
	void ThrowingGrenade(); // Function BravoHotelGame.BravoHotelCharacter.ThrowingGrenade(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7DF0>
	void TestSpawnPersonalSupplyBox(struct Unknown& ServerLocation); // Function BravoHotelGame.BravoHotelCharacter.TestSpawnPersonalSupplyBox(Final|Native|Public|HasOutParms|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7D60>
	void TestMultiPersonalSupplyBox(float Distance, int32_t Count); // Function BravoHotelGame.BravoHotelCharacter.TestMultiPersonalSupplyBox(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7C90>
	void TestEndItemSpawnSimulationBox(struct Unknown& Data, struct FString Msg); // Function BravoHotelGame.BravoHotelCharacter.TestEndItemSpawnSimulationBox(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7B30>
	void StopRagdoll(); // Function BravoHotelGame.BravoHotelCharacter.StopRagdoll(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7B10>
	void StopPostProcessEffects(struct FName RowName, char bImmediately); // Function BravoHotelGame.BravoHotelCharacter.StopPostProcessEffects(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7A40>
	void StopPlayingPickupAnim(); // Function BravoHotelGame.BravoHotelCharacter.StopPlayingPickupAnim(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7A20>
	void StopAllPostProcessEffects(); // Function BravoHotelGame.BravoHotelCharacter.StopAllPostProcessEffects(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7A00>
	void StartTunnelEffect(); // Function BravoHotelGame.BravoHotelCharacter.StartTunnelEffect(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED79E0>
	void StartSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.StartSteadyAim(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED79C0>
	void StartStatupMaterialEffect(struct Unknown& StatupParams); // Function BravoHotelGame.BravoHotelCharacter.StartStatupMaterialEffect(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7910>
	void StartSpawnBlackOut(float DelayTime); // Function BravoHotelGame.BravoHotelCharacter.StartSpawnBlackOut(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7890>
	void StartReplaceFreeLook(); // Function BravoHotelGame.BravoHotelCharacter.StartReplaceFreeLook(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7870>
	void StartRagdoll(); // Function BravoHotelGame.BravoHotelCharacter.StartRagdoll(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7850>
	void StartPostProcessEffects(struct FName RowName); // Function BravoHotelGame.BravoHotelCharacter.StartPostProcessEffects(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED77D0>
	void StartFalling(); // Function BravoHotelGame.BravoHotelCharacter.StartFalling(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED77B0>
	void StartDescending(); // Function BravoHotelGame.BravoHotelCharacter.StartDescending(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7790>
	void StartCastingUI(enum class Unknow CastingUIType, struct FName SourceName, float MaxTime, struct Unknown Target); // Function BravoHotelGame.BravoHotelCharacter.StartCastingUI(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7640>
	void StartADSProcess_2(); // Function BravoHotelGame.BravoHotelCharacter.StartADSProcess_2(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7620>
	void SpectatedDelegate__DelegateSignature(char bIsSpectated); // DelegateFunction BravoHotelGame.BravoHotelCharacter.SpectatedDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	struct Unknown SpawnSkillTargeting(struct FName& ActorName, struct Unknown& InSpawnLocation, float Radius); // Function BravoHotelGame.BravoHotelCharacter.SpawnSkillTargeting(Final|Native|Public|HasOutParms|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED74F0>
	void SpawnRandomWeapon(); // Function BravoHotelGame.BravoHotelCharacter.SpawnRandomWeapon(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED74A0>
	void SpawnBrokenEquipment(); // Function BravoHotelGame.BravoHotelCharacter.SpawnBrokenEquipment(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7480>
	void SimulatedTakeDamage(); // Function BravoHotelGame.BravoHotelCharacter.SimulatedTakeDamage(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7460>
	void ShowTeleportAppearEffect(); // Function BravoHotelGame.BravoHotelCharacter.ShowTeleportAppearEffect(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED7440>
	void ShowSkillMap(float Radius); // Function BravoHotelGame.BravoHotelCharacter.ShowSkillMap(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED73C0>
	void ShowParachuteMesh(char bVisibility, char bIsWithParachute); // Function BravoHotelGame.BravoHotelCharacter.ShowParachuteMesh(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED72F0>
	void ShowKeyActions(); // Function BravoHotelGame.BravoHotelCharacter.ShowKeyActions(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED72D0>
	void ShowInventoryNotEnoughSpaceMessage(); // Function BravoHotelGame.BravoHotelCharacter.ShowInventoryNotEnoughSpaceMessage(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED72B0>
	void ShowInteractiveForPickup(struct Unknown& InteractionInfo, struct Unknown& ItemInfo); // Function BravoHotelGame.BravoHotelCharacter.ShowInteractiveForPickup(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED70E0>
	void ShowInteractiveForAction(struct Unknown& InteractionInfo); // Function BravoHotelGame.BravoHotelCharacter.ShowInteractiveForAction(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6FC0>
	void ShowInteractionWidget(struct Unknown InteractionInfo); // Function BravoHotelGame.BravoHotelCharacter.ShowInteractionWidget(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6E50>
	void ShowHUDbySequence(); // Function BravoHotelGame.BravoHotelCharacter.ShowHUDbySequence(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6E30>
	void ShowHeartBeatSensorEffect(char IsHeartBeatSensorEffect, float HeartBeatSensorLength); // Function BravoHotelGame.BravoHotelCharacter.ShowHeartBeatSensorEffect(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ShowCloudFxInDescent(char bWantsToShow); // Function BravoHotelGame.BravoHotelCharacter.ShowCloudFxInDescent(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6DA0>
	void ShowAmplifierEffect(char IsAmplifierEffect, float AmplifierLength); // Function BravoHotelGame.BravoHotelCharacter.ShowAmplifierEffect(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ShouldSprinting(char bNewShouldSprinting); // Function BravoHotelGame.BravoHotelCharacter.ShouldSprinting(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6D10>
	char ShouldAdjustInDoor(enum class Unknow InTarget); // Function BravoHotelGame.BravoHotelCharacter.ShouldAdjustInDoor(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6C80>
	void SetVisibleOutBlueZoneBlizzard(char Visible); // Function BravoHotelGame.BravoHotelCharacter.SetVisibleOutBlueZoneBlizzard(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetTunnelEffectRatio(float Ratio); // Function BravoHotelGame.BravoHotelCharacter.SetTunnelEffectRatio(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6C00>
	void SetTeleportEffect(char bStart); // Function BravoHotelGame.BravoHotelCharacter.SetTeleportEffect(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6B70>
	void SetTeamInfoVisibility(char IsVisible); // Function BravoHotelGame.BravoHotelCharacter.SetTeamInfoVisibility(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetTargetHealth(enum class Unknow Type, float InTargetHealth, float InUsableHealth); // Function BravoHotelGame.BravoHotelCharacter.SetTargetHealth(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6A70>
	void SetSteadyAim(char SteadyAim); // Function BravoHotelGame.BravoHotelCharacter.SetSteadyAim(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED69E0>
	void SetState(enum class Unknow NewState, char b); // Function BravoHotelGame.BravoHotelCharacter.SetState(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6910>
	void SetSavedPlayerState(struct Unknown PState); // Function BravoHotelGame.BravoHotelCharacter.SetSavedPlayerState(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6870>
	void SetReplicatedAnimMontage(struct Unknown NewAnimMontageTPP, struct Unknown NewAnimMontageFPP); // Function BravoHotelGame.BravoHotelCharacter.SetReplicatedAnimMontage(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED67B0>
	void SetRecordingCharacterTickRate(float TickRate); // Function BravoHotelGame.BravoHotelCharacter.SetRecordingCharacterTickRate(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetRandomValuesToCustomizableObject(); // Function BravoHotelGame.BravoHotelCharacter.SetRandomValuesToCustomizableObject(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6790>
	void SetRandomIdleNum(); // Function BravoHotelGame.BravoHotelCharacter.SetRandomIdleNum(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6770>
	void SetProjectileGrenadeActor(struct Unknown Grenade); // Function BravoHotelGame.BravoHotelCharacter.SetProjectileGrenadeActor(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED66F0>
	void SetParkourTestComponentIndex(int32_t IndexKey); // Function BravoHotelGame.BravoHotelCharacter.SetParkourTestComponentIndex(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6670>
	void SetNearClipPlane(float NearClipPlane); // Function BravoHotelGame.BravoHotelCharacter.SetNearClipPlane(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED65F0>
	void SetMolotovFlameDotDamage(); // Function BravoHotelGame.BravoHotelCharacter.SetMolotovFlameDotDamage(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED65D0>
	void SetMagneticDmgDissolveAnimationCurve(); // Function BravoHotelGame.BravoHotelCharacter.SetMagneticDmgDissolveAnimationCurve(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED65B0>
	void SetMagneticDamagedCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.SetMagneticDamagedCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6590>
	void SetLocalChargingGauge(char bStart); // Function BravoHotelGame.BravoHotelCharacter.SetLocalChargingGauge(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6500>
	void SetLadderComponent(struct Unknown NewLadder); // Function BravoHotelGame.BravoHotelCharacter.SetLadderComponent(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6480>
	void SetIsMelee(char bNewMelee, char bNewMeleeJumpAttack); // Function BravoHotelGame.BravoHotelCharacter.SetIsMelee(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED63B0>
	void SetIsLanded(char bNewLanded); // Function BravoHotelGame.BravoHotelCharacter.SetIsLanded(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6320>
	void SetIsInsideBlueZone(char bIsInsideBlueZone); // Function BravoHotelGame.BravoHotelCharacter.SetIsInsideBlueZone(Final|Native|Protected|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6290>
	void SetIsFreeLook(char bNewFreeLook); // Function BravoHotelGame.BravoHotelCharacter.SetIsFreeLook(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6200>
	void SetIsFired(char bNewFired, float AutoDeactiveDelayTime); // Function BravoHotelGame.BravoHotelCharacter.SetIsFired(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6130>
	void SetInternalMagneticDamagedDissolveCharacterMaterial(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.SetInternalMagneticDamagedDissolveCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED60B0>
	void SetInternalMagneticDamagedCharacterMaterial(char bOn); // Function BravoHotelGame.BravoHotelCharacter.SetInternalMagneticDamagedCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6020>
	void SetInternalMagneticDamagedCharacterBackGroundMaterial_On(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalMagneticDamagedCharacterBackGroundMaterial_On(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED6000>
	void SetInternalMagneticDamagedCharacterBackGroundMaterial_Off(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalMagneticDamagedCharacterBackGroundMaterial_Off(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5FE0>
	void SetInternalDustDissolveCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDustDissolveCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5FC0>
	void SetInternalDustCharacterMaterial(char bOn); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDustCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5F30>
	void SetInternalDamagedDissolveCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDamagedDissolveCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5F10>
	void SetInternalDamagedCharacterMaterial(char bOn); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDamagedCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5E80>
	void SetInternalDamagedCharacterBackGroundMaterial_On(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDamagedCharacterBackGroundMaterial_On(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5E60>
	void SetInternalDamagedCharacterBackGroundMaterial_Off(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDamagedCharacterBackGroundMaterial_Off(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5E40>
	void SetInteractiveNoHide(char NoHide); // Function BravoHotelGame.BravoHotelCharacter.SetInteractiveNoHide(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5DB0>
	void SetInteractiveCustomMode(int32_t ModeNum); // Function BravoHotelGame.BravoHotelCharacter.SetInteractiveCustomMode(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5D30>
	void SetInteractionType(enum class Unknow NewType); // Function BravoHotelGame.BravoHotelCharacter.SetInteractionType(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5CB0>
	void SetInReduceSpeedExplosionRange(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.SetInReduceSpeedExplosionRange(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5C30>
	void SetFoundVehicleLocations(struct Unknown& InCarScanUIInfo); // Function BravoHotelGame.BravoHotelCharacter.SetFoundVehicleLocations(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5B60>
	void SetFlashBangPlaySound(); // Function BravoHotelGame.BravoHotelCharacter.SetFlashBangPlaySound(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5B40>
	void SetFlashBangEndSound(); // Function BravoHotelGame.BravoHotelCharacter.SetFlashBangEndSound(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5B20>
	void SetFlashBangAngle(float Angle); // Function BravoHotelGame.BravoHotelCharacter.SetFlashBangAngle(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5AA0>
	void SetFireType(enum class Unknow NewFireType); // Function BravoHotelGame.BravoHotelCharacter.SetFireType(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5A20>
	void SetDustDissolveAnimationCurve(); // Function BravoHotelGame.BravoHotelCharacter.SetDustDissolveAnimationCurve(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5A00>
	void SetDustCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.SetDustCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED59E0>
	void SetDissolveAnimationCurveData(); // Function BravoHotelGame.BravoHotelCharacter.SetDissolveAnimationCurveData(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED59C0>
	void SetDescentVariables(float NewAirControl, float NewMaxWalkSpeed, float NewGravityScale, float NewBarkingDecelerationFalling, float NewMaxAcceleration, struct Unknown NewCameraRelativeLocation, char bForceLocation); // Function BravoHotelGame.BravoHotelCharacter.SetDescentVariables(Final|Native|Public|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED57A0>
	void SetDefaultCameraLag(float NewDefaultCameraLag); // Function BravoHotelGame.BravoHotelCharacter.SetDefaultCameraLag(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5720>
	void SetDamagedFlashBang(float FlashBangValue); // Function BravoHotelGame.BravoHotelCharacter.SetDamagedFlashBang(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED56A0>
	void SetDamagedCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.SetDamagedCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5680>
	void SetChargingGauge(char bStart); // Function BravoHotelGame.BravoHotelCharacter.SetChargingGauge(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED55F0>
	void SetCharacterMovementMode(char Mode); // Function BravoHotelGame.BravoHotelCharacter.SetCharacterMovementMode(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5570>
	void SetCharacterIntheWater(); // Function BravoHotelGame.BravoHotelCharacter.SetCharacterIntheWater(Native|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5550>
	void SetCameraLag(char bEnable); // Function BravoHotelGame.BravoHotelCharacter.SetCameraLag(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED54C0>
	void SetCameraAssistComponent(char bSpectactor); // Function BravoHotelGame.BravoHotelCharacter.SetCameraAssistComponent(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5430>
	void SetBackLightComponentsActive(char bNewActive); // Function BravoHotelGame.BravoHotelCharacter.SetBackLightComponentsActive(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED53A0>
	void SetArmedState(char bDoArm, char bPlayUnequipAnimation, char bOrdered); // Function BravoHotelGame.BravoHotelCharacter.SetArmedState(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5280>
	void SetADSReturnTimer(float ADSReturnDelayTime); // Function BravoHotelGame.BravoHotelCharacter.SetADSReturnTimer(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED5170>
	void SetActiveFur(char bActive); // Function BravoHotelGame.BravoHotelCharacter.SetActiveFur(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetActiveBreathEffect(char bNewActive); // Function BravoHotelGame.BravoHotelCharacter.SetActiveBreathEffect(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED51F0>
	void ServerWindowBreaching(struct TArray<Unknown> TargetDamagedCharacters); // Function BravoHotelGame.BravoHotelCharacter.ServerWindowBreaching(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED50B0>
	void ServerUseBackpackItem(int32_t BackpackItemIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerUseBackpackItem(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED4FF0>
	void ServerUpdateRagdollVariables(struct Unknown NewRagdollVelocity, struct Unknown NewRagdollLocation, struct Unknown NewActorLocation); // Function BravoHotelGame.BravoHotelCharacter.ServerUpdateRagdollVariables(Net|Native|Event|Protected|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED4E60>
	void ServerUpdateNearbyVehicles(struct TArray<Unknown> AddedVehicles, struct TArray<Unknown> RemovedVehicles); // Function BravoHotelGame.BravoHotelCharacter.ServerUpdateNearbyVehicles(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED4D40>
	void ServerUpdateCamera(struct Unknown InCameraInfo); // Function BravoHotelGame.BravoHotelCharacter.ServerUpdateCamera(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED4C80>
	void ServerTryUseLadder(struct Unknown DetectedLadder); // Function BravoHotelGame.BravoHotelCharacter.ServerTryUseLadder(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED4BC0>
	void ServerTryExitVehicle(enum class Unknow NextState); // Function BravoHotelGame.BravoHotelCharacter.ServerTryExitVehicle(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED4B10>
	void ServerTryExitLadder(); // Function BravoHotelGame.BravoHotelCharacter.ServerTryExitLadder(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED4AC0>
	void ServerTryEnterVehicle(struct Unknown TargetVehicleSeat); // Function BravoHotelGame.BravoHotelCharacter.ServerTryEnterVehicle(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED4A00>
	void ServerTryElevatorInteraction(struct Unknown ElevatorActor, struct Unknown ElevatorComponet); // Function BravoHotelGame.BravoHotelCharacter.ServerTryElevatorInteraction(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED4900>
	void ServerTryDropBoxInteraction(struct Unknown TmpDropBox); // Function BravoHotelGame.BravoHotelCharacter.ServerTryDropBoxInteraction(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED4840>
	void ServerTotalAirWalkDistance(float TotalDistance); // Function BravoHotelGame.BravoHotelCharacter.ServerTotalAirWalkDistance(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED4790>
	void ServerTestSpawnPersonalBox(float X, float Y); // Function BravoHotelGame.BravoHotelCharacter.ServerTestSpawnPersonalBox(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED4690>
	void ServerTakeDamage_Radial(float DamageAmount, struct Unknown DamageEvent, struct Unknown TargetCharacter); // Function BravoHotelGame.BravoHotelCharacter.ServerTakeDamage_Radial(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED4410>
	void ServerTakeDamage_Point(float DamageAmount, struct Unknown DamageEvent, struct Unknown TargetCharacter); // Function BravoHotelGame.BravoHotelCharacter.ServerTakeDamage_Point(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED4260>
	void ServerTakeDamage(float DamageAmount, struct Unknown DamageEvent, struct Unknown TargetCharacter); // Function BravoHotelGame.BravoHotelCharacter.ServerTakeDamage(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED4110>
	void ServerStopUltimate_Recon(); // Function BravoHotelGame.BravoHotelCharacter.ServerStopUltimate_Recon(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED40C0>
	void ServerStopSliding(); // Function BravoHotelGame.BravoHotelCharacter.ServerStopSliding(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED4070>
	void ServerStopRolling(); // Function BravoHotelGame.BravoHotelCharacter.ServerStopRolling(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED4020>
	void ServerStopRevive(struct Unknown RevivedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerStopRevive(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED3F60>
	void ServerStopResuscitation(struct Unknown ResuscitatedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerStopResuscitation(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED3EA0>
	void ServerStopMontage(struct Unknown AnimMontage, float BlendTime); // Function BravoHotelGame.BravoHotelCharacter.ServerStopMontage(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED3DA0>
	void ServerStartUltimate_Recon(struct Unknown InitialImpulse); // Function BravoHotelGame.BravoHotelCharacter.ServerStartUltimate_Recon(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED3CF0>
	void ServerStartStuntman(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartStuntman(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED3CA0>
	void ServerStartSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartSteadyAim(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED3C50>
	void ServerStartSliding(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartSliding(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED3C00>
	void ServerStartRolling(struct Unknown TargetRollingImpulse); // Function BravoHotelGame.BravoHotelCharacter.ServerStartRolling(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED3B50>
	void ServerStartRocketJump(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartRocketJump(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED3B00>
	void ServerStartRevive(struct Unknown RevivedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerStartRevive(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED3A40>
	void ServerStartResuscitation(struct Unknown ResuscitatedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerStartResuscitation(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED3980>
	void ServerStartMeteorJump(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartMeteorJump(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED3930>
	void ServerStartKickDoor(struct Unknown TargetDoor); // Function BravoHotelGame.BravoHotelCharacter.ServerStartKickDoor(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED3870>
	void ServerStartDescenting(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartDescenting(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED3820>
	void ServerSpawnPersonalBox(struct Unknown SpawnPersonalBoxData, struct Unknown DebugData); // Function BravoHotelGame.BravoHotelCharacter.ServerSpawnPersonalBox(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED36B0>
	void ServerSpawnPerk(struct Unknown SpawnPerkData); // Function BravoHotelGame.BravoHotelCharacter.ServerSpawnPerk(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED35A0>
	void ServerSpawnBombing(struct Unknown SpawnLocation); // Function BravoHotelGame.BravoHotelCharacter.ServerSpawnBombing(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED34F0>
	void ServerSetUpdateRenderSettings(char bValue); // Function BravoHotelGame.BravoHotelCharacter.ServerSetUpdateRenderSettings(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED3430>
	void ServerSetState(enum class Unknow NewState); // Function BravoHotelGame.BravoHotelCharacter.ServerSetState(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED3380>
	void ServerSetSearchInstinctLocation(struct Unknown InSearchInstinctLocation); // Function BravoHotelGame.BravoHotelCharacter.ServerSetSearchInstinctLocation(Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED32D0>
	void ServerSetRemoteViewRotForDriver(uint16_t SendPitch, uint16_t SendYaw); // Function BravoHotelGame.BravoHotelCharacter.ServerSetRemoteViewRotForDriver(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED31D0>
	void ServerSetProjectileGrenadeState(struct Unknown Grenade, enum class Unknow NewState, struct Unknown NewTriggerActor); // Function BravoHotelGame.BravoHotelCharacter.ServerSetProjectileGrenadeState(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED30A0>
	void ServerSetParachuteTargetRotator(struct Unknown NewRotation); // Function BravoHotelGame.BravoHotelCharacter.ServerSetParachuteTargetRotator(Net|Native|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED2FF0>
	void ServerSetLeanState(enum class Unknow NewLeanState, float InLeanDegreeMax); // Function BravoHotelGame.BravoHotelCharacter.ServerSetLeanState(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED2EF0>
	void ServerSetIsParachuteLanding(char Flag, float Height); // Function BravoHotelGame.BravoHotelCharacter.ServerSetIsParachuteLanding(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED2DF0>
	void ServerSetIsMelee(char bNewMelee); // Function BravoHotelGame.BravoHotelCharacter.ServerSetIsMelee(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED2D30>
	void ServerSetIsFreeLook(char bNewFreeLook); // Function BravoHotelGame.BravoHotelCharacter.ServerSetIsFreeLook(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED2C70>
	void ServerSetInteractionType(enum class Unknow NewType); // Function BravoHotelGame.BravoHotelCharacter.ServerSetInteractionType(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED2BC0>
	void ServerSetInSmoke(char bNewSmoke); // Function BravoHotelGame.BravoHotelCharacter.ServerSetInSmoke(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED2B00>
	void ServerSetFireType(enum class Unknow NewFireType); // Function BravoHotelGame.BravoHotelCharacter.ServerSetFireType(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED2A50>
	void ServerSetCustomBuoyancySwimMode(char Mode); // Function BravoHotelGame.BravoHotelCharacter.ServerSetCustomBuoyancySwimMode(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED2990>
	void ServerSetChargingGauge(char bStart); // Function BravoHotelGame.BravoHotelCharacter.ServerSetChargingGauge(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED28D0>
	void ServerSetCastingUI(enum class Unknow CastingUIType, struct FName SourceName, float MaxTime, struct Unknown Target); // Function BravoHotelGame.BravoHotelCharacter.ServerSetCastingUI(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED2750>
	void ServerSetBoostPercent(int8_t Percent); // Function BravoHotelGame.BravoHotelCharacter.ServerSetBoostPercent(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED26A0>
	void ServerSetActorRotation(struct Unknown NewRotation); // Function BravoHotelGame.BravoHotelCharacter.ServerSetActorRotation(Net|Native|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED25F0>
	void ServerSetActorLocationAndRotation(struct Unknown NewLocation, struct Unknown NewRotation); // Function BravoHotelGame.BravoHotelCharacter.ServerSetActorLocationAndRotation(Net|Native|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED24C0>
	void ServerSetActiveSkillsKeyNameList(struct TArray<Unknown> KeyNameList); // Function BravoHotelGame.BravoHotelCharacter.ServerSetActiveSkillsKeyNameList(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED2400>
	void ServerSendInvalidHitInfos(struct TArray<Unknown> InvalidHitInofs); // Function BravoHotelGame.BravoHotelCharacter.ServerSendInvalidHitInfos(Net|Native|Event|Public|NetServer) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED2360>
	void ServerSelectThrowingWeaponThrowingType(enum class Unknow NewThrowingType); // Function BravoHotelGame.BravoHotelCharacter.ServerSelectThrowingWeaponThrowingType(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED22B0>
	void ServerRewindMontage(struct Unknown AnimMontage); // Function BravoHotelGame.BravoHotelCharacter.ServerRewindMontage(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED21F0>
	void ServerResetVehicleSearch(); // Function BravoHotelGame.BravoHotelCharacter.ServerResetVehicleSearch(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED21A0>
	void ServerResetSearchInstinct(); // Function BravoHotelGame.BravoHotelCharacter.ServerResetSearchInstinct(Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED2150>
	void ServerReselectPerkDeck(); // Function BravoHotelGame.BravoHotelCharacter.ServerReselectPerkDeck(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED2100>
	void ServerRequestPayGold(int32_t ActionCode, int32_t Amount); // Function BravoHotelGame.BravoHotelCharacter.ServerRequestPayGold(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED2000>
	void ServerRequestBuildingItemSpawnState(struct Unknown Building); // Function BravoHotelGame.BravoHotelCharacter.ServerRequestBuildingItemSpawnState(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED1F40>
	void ServerRequestBuildingItemSpawnList(int32_t Size, float IntervalTime, char ToJson); // Function BravoHotelGame.BravoHotelCharacter.ServerRequestBuildingItemSpawnList(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED1E00>
	void ServerRequestBuildingCount(); // Function BravoHotelGame.BravoHotelCharacter.ServerRequestBuildingCount(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED1DB0>
	void ServerQuickLanding(struct Unknown ClientActorLocation); // Function BravoHotelGame.BravoHotelCharacter.ServerQuickLanding(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED1D00>
	void ServerPlayMontage(struct Unknown AnimMontageTPP, struct Unknown AnimMontageFPP); // Function BravoHotelGame.BravoHotelCharacter.ServerPlayMontage(Net|NetReliableNative|Event|Protected|NetServer|BlueprintCallable|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED1C00>
	void ServerPickUpInBox(struct Unknown DropBoxActor, int8_t ItemIndex, int32_t GainQuantity, int32_t WeaponSlotIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerPickUpInBox(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED1A80>
	void ServerPersonalBoxRePosition(struct Unknown TargetSupplyBox, struct Unknown NewLocation, struct FString HitActorName); // Function BravoHotelGame.BravoHotelCharacter.ServerPersonalBoxRePosition(Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED1930>
	void ServerMoveItem(struct Unknown SourceActor, enum class Unknow SourceSlotType, struct Unknown SourceItemInfo, struct Unknown TargetActor, enum class Unknow TargetSlotType, int32_t TargetIndex, int32_t GainQuantity); // Function BravoHotelGame.BravoHotelCharacter.ServerMoveItem(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED16A0>
	void ServerMeteorStrike(); // Function BravoHotelGame.BravoHotelCharacter.ServerMeteorStrike(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED1650>
	void ServerMaxAirWalkDistance(float MaxDistance); // Function BravoHotelGame.BravoHotelCharacter.ServerMaxAirWalkDistance(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED15A0>
	void ServerLaunchCharacter(struct Unknown LaunchVelocity); // Function BravoHotelGame.BravoHotelCharacter.ServerLaunchCharacter(Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED14D0>
	void ServerJetpackBooster(char bNewJackpack); // Function BravoHotelGame.BravoHotelCharacter.ServerJetpackBooster(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED1410>
	void ServerJetpackAim(char bNewJetpackAim); // Function BravoHotelGame.BravoHotelCharacter.ServerJetpackAim(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED1350>
	void ServerInputState(int8_t Forward, int8_t Right); // Function BravoHotelGame.BravoHotelCharacter.ServerInputState(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED1260>
	void ServerInputFPSOnly(char bFlag); // Function BravoHotelGame.BravoHotelCharacter.ServerInputFPSOnly(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED11A0>
	void ServerHealthRegain(float Amount, enum class Unknow BuffType); // Function BravoHotelGame.BravoHotelCharacter.ServerHealthRegain(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED10A0>
	void ServerHandleDamageToVehicleDestructibleComponent(struct Unknown DestructibleComponent, struct Unknown HitDetails, struct Unknown ImpactVelocity); // Function BravoHotelGame.BravoHotelCharacter.ServerHandleDamageToVehicleDestructibleComponent(Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED0E60>
	void ServerForceUpdateTerrainType(); // Function BravoHotelGame.BravoHotelCharacter.ServerForceUpdateTerrainType(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED0E10>
	void ServerFireMode(); // Function BravoHotelGame.BravoHotelCharacter.ServerFireMode(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED0DC0>
	void ServerFailedActiveSkill_2(); // Function BravoHotelGame.BravoHotelCharacter.ServerFailedActiveSkill_2(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED0D70>
	void ServerFailedActiveSkill_1(); // Function BravoHotelGame.BravoHotelCharacter.ServerFailedActiveSkill_1(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED0D20>
	void ServerEscapeTheFlames(struct Unknown FlameDamageInfo); // Function BravoHotelGame.BravoHotelCharacter.ServerEscapeTheFlames(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED0BE0>
	void ServerEquipPerk(enum class Unknow Slot, struct FName PerkName, int32_t Level, char Reset); // Function BravoHotelGame.BravoHotelCharacter.ServerEquipPerk(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED0A60>
	void ServerEndSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.ServerEndSteadyAim(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED0A10>
	void ServerEndRevive(struct Unknown RevivedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerEndRevive(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED0950>
	void ServerEndResuscitation(struct Unknown ResuscitatedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerEndResuscitation(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED0890>
	void ServerDoWalking(char bNewWalking); // Function BravoHotelGame.BravoHotelCharacter.ServerDoWalking(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED0680>
	void ServerDoSprinting(char bNewSprinting); // Function BravoHotelGame.BravoHotelCharacter.ServerDoSprinting(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED05C0>
	void ServerDoRetreat(struct Unknown NewLocation, struct Unknown NewRotation, float RandomDistanceMax); // Function BravoHotelGame.BravoHotelCharacter.ServerDoRetreat(Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED0440>
	void ServerDoProne(char bNewProne); // Function BravoHotelGame.BravoHotelCharacter.ServerDoProne(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED0380>
	void ServerDoPickUpItemOrWeapon(int32_t WeaponSlotIndex, struct Unknown PickableItem, int32_t GainQuantity); // Function BravoHotelGame.BravoHotelCharacter.ServerDoPickUpItemOrWeapon(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED0250>
	void ServerDoorBreaching(struct Unknown TargetDoor, char bIsDamageCauserFrontOfDoor, struct TArray<Unknown> TargetDamagedCharacters); // Function BravoHotelGame.BravoHotelCharacter.ServerDoorBreaching(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED0740>
	void ServerDoNuclear(struct Unknown SpawnLocation, struct Unknown NewNuclearInfo); // Function BravoHotelGame.BravoHotelCharacter.ServerDoNuclear(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED0140>
	void ServerDoAirWalk(char bNewAirWalk, float InDuration, float InGravity); // Function BravoHotelGame.BravoHotelCharacter.ServerDoAirWalk(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ED0000>
	void ServerDamageInFlames(struct Unknown FlameDamageInfo); // Function BravoHotelGame.BravoHotelCharacter.ServerDamageInFlames(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECFEC0>
	void ServerCompletedCombine(); // Function BravoHotelGame.BravoHotelCharacter.ServerCompletedCombine(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECFE70>
	void ServerClearCastingUI(); // Function BravoHotelGame.BravoHotelCharacter.ServerClearCastingUI(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECFE20>
	void ServerChoosePerkDeck(int32_t ChooseIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerChoosePerkDeck(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECFD60>
	void ServerCheckLineTrace(); // Function BravoHotelGame.BravoHotelCharacter.ServerCheckLineTrace(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECFD10>
	void ServerChangeGender(); // Function BravoHotelGame.BravoHotelCharacter.ServerChangeGender(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECFCC0>
	void ServerCancleActiveSkill(int32_t CancleActiveSkillSlot); // Function BravoHotelGame.BravoHotelCharacter.ServerCancleActiveSkill(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECFC00>
	void ServerBuildingCountCheck(); // Function BravoHotelGame.BravoHotelCharacter.ServerBuildingCountCheck(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECFBB0>
	void ServerBeginCombine(struct FName RecipeKey); // Function BravoHotelGame.BravoHotelCharacter.ServerBeginCombine(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECFAF0>
	void ServerBeginCastingBackpackItem(int32_t BackpackItemIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerBeginCastingBackpackItem(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECFA30>
	void ServerAttachToComponent(struct Unknown AttachingActor, struct Unknown AttachedComponent, struct Unknown AttachLocation, struct Unknown AttachNormal); // Function BravoHotelGame.BravoHotelCharacter.ServerAttachToComponent(Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECF880>
	void ServerApplyDamage(float DamageAmount, struct Unknown DamageEvent, struct Unknown EventInstigator, struct Unknown DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.ServerApplyDamage(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECF6F0>
	void ServerAddPerk(int32_t Count); // Function BravoHotelGame.BravoHotelCharacter.ServerAddPerk(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECF630>
	void ServerAddExpToPerk(enum class Unknow Slot, int32_t ExpValue); // Function BravoHotelGame.BravoHotelCharacter.ServerAddExpToPerk(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECF530>
	void ServerActiveSkill(int32_t ActiveSkillSlot); // Function BravoHotelGame.BravoHotelCharacter.ServerActiveSkill(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECF470>
	void ServerActionDestructObject(struct Unknown DestructibleActor, struct Unknown DestructibleComponent, struct Unknown Location, float Damage, float EffectRange); // Function BravoHotelGame.BravoHotelCharacter.ServerActionDestructObject(Net|Native|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECF2A0>
	void ServerAbortCombine(); // Function BravoHotelGame.BravoHotelCharacter.ServerAbortCombine(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECF250>
	void ServerAbortCastingBackpackItem(int32_t BackpackItemIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerAbortCastingBackpackItem(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECF190>
	void SelectThrowingWeaponThrowingType(); // Function BravoHotelGame.BravoHotelCharacter.SelectThrowingWeaponThrowingType(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECF170>
	void SelectPerkDeck(struct FName DeckName); // Function BravoHotelGame.BravoHotelCharacter.SelectPerkDeck(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECF0F0>
	void RifleMeleeAttack(); // Function BravoHotelGame.BravoHotelCharacter.RifleMeleeAttack(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECF0D0>
	void RevertGeneralSettingNearClipPlane(); // Function BravoHotelGame.BravoHotelCharacter.RevertGeneralSettingNearClipPlane(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECF0B0>
	void ResetTargetHealth(); // Function BravoHotelGame.BravoHotelCharacter.ResetTargetHealth(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECF090>
	void ResetPerkDeckUI(); // Function BravoHotelGame.BravoHotelCharacter.ResetPerkDeckUI(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECF070>
	void ResetOxygen(); // Function BravoHotelGame.BravoHotelCharacter.ResetOxygen(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECF050>
	void ResetMagneticDamagedCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.ResetMagneticDamagedCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECF030>
	void ResetLanding(); // Function BravoHotelGame.BravoHotelCharacter.ResetLanding(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECF010>
	void ResetIdleNum(); // Function BravoHotelGame.BravoHotelCharacter.ResetIdleNum(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECEFF0>
	void ResetFlashBangPP(); // Function BravoHotelGame.BravoHotelCharacter.ResetFlashBangPP(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECEFD0>
	void ResetDustCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.ResetDustCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECEFB0>
	void ResetDamagedCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.ResetDamagedCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECEF90>
	void ResendHUDInfo(); // Function BravoHotelGame.BravoHotelCharacter.ResendHUDInfo(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECEF70>
	void RequestServerBuildingCount(); // Function BravoHotelGame.BravoHotelCharacter.RequestServerBuildingCount(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECEF50>
	void RequestNearBuildingItemSpawnState(); // Function BravoHotelGame.BravoHotelCharacter.RequestNearBuildingItemSpawnState(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECEF30>
	void RequestAllBuildingItemSpawnInfo(int32_t RequestSize, float IntervalTime, char ToJson); // Function BravoHotelGame.BravoHotelCharacter.RequestAllBuildingItemSpawnInfo(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECEE20>
	void ReplaceFreeLookImmediately(); // Function BravoHotelGame.BravoHotelCharacter.ReplaceFreeLookImmediately(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECEE00>
	void RemoveWearableItem(enum class Unknow Slot, char bUpdateSkeletalMesh); // Function BravoHotelGame.BravoHotelCharacter.RemoveWearableItem(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECED30>
	void RemoveThrownMolotov(struct Unknown MolotovCocktail); // Function BravoHotelGame.BravoHotelCharacter.RemoveThrownMolotovame(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECECB0>
	void RemoveThrownFlashbang(struct Unknown Flashbang); // Function BravoHotelGame.BravoHotelCharacter.RemoveThrownFlashbang(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECEC30>
	void RemoveTargetHealth(enum class Unknow Type); // Function BravoHotelGame.BravoHotelCharacter.RemoveTargetHealth(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECEBB0>
	void RemoveShortTimeHealth(struct Unknown HealthOwner); // Function BravoHotelGame.BravoHotelCharacter.RemoveShortTimeHealth(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECEB30>
	void RemoveEquippingWearableItems(); // Function BravoHotelGame.BravoHotelCharacter.RemoveEquippingWearableItems(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECEB10>
	void RemoveDetectedStealable(struct Unknown NewCharacter); // Function BravoHotelGame.BravoHotelCharacter.RemoveDetectedStealable(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECEA90>
	void RemoveDetectedItem(struct Unknown NewPickup); // Function BravoHotelGame.BravoHotelCharacter.RemoveDetectedItem(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECEA10>
	void RemoveDetectedDropBox(struct Unknown NewPickup); // Function BravoHotelGame.BravoHotelCharacter.RemoveDetectedDropBox(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE990>
	void RemoveCondition(enum class Unknow ConditionType, enum class Unknow Key); // Function BravoHotelGame.BravoHotelCharacter.RemoveCondition(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE8D0>
	void RemoveCameraPP(struct Unknown* TargetPPPresetClass); // Function BravoHotelGame.BravoHotelCharacter.RemoveCameraPP(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE850>
	void RemoveBackpackShield(struct Unknown& DamageEvent); // Function BravoHotelGame.BravoHotelCharacter.RemoveBackpackShield(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE730>
	struct FName RemoveArmShield(struct Unknown& TargetHitResult, struct Unknown& ShotDirection); // Function BravoHotelGame.BravoHotelCharacter.RemoveArmShield(Final|Native|Public|HasOutParms|HasDefaults|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE5F0>
	void RemoveAllWearableItem2(); // Function BravoHotelGame.BravoHotelCharacter.RemoveAllWearableItem2(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE5B0>
	void RemoveAllWearableItem(); // Function BravoHotelGame.BravoHotelCharacter.RemoveAllWearableItem(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE5D0>
	void RemoveAllFoundVehicleLocations(); // Function BravoHotelGame.BravoHotelCharacter.RemoveAllFoundVehicleLocations(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE590>
	void RemoveAllDetectedItems(); // Function BravoHotelGame.BravoHotelCharacter.RemoveAllDetectedItems(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE570>
	void RemoveAllBackpackItem(); // Function BravoHotelGame.BravoHotelCharacter.RemoveAllBackpackItem(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE550>
	void RefreshAppearanceInfo(); // Function BravoHotelGame.BravoHotelCharacter.RefreshAppearanceInfo(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE530>
	void ReduceCharacterSpeedInGrenadeExplosionRange(); // Function BravoHotelGame.BravoHotelCharacter.ReduceCharacterSpeedInGrenadeExplosionRange(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE510>
	void ReconnectProcess(); // Function BravoHotelGame.BravoHotelCharacter.ReconnectProcess(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE4F0>
	void ReceiverVoice(struct FName Idx); // Function BravoHotelGame.BravoHotelCharacter.ReceiverVoice(Net|NetReliableNative|Event|Public|NetClient) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE460>
	void ReadyTeleport(); // Function BravoHotelGame.BravoHotelCharacter.ReadyTeleport(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReadyGivePerkEvent(); // Function BravoHotelGame.BravoHotelCharacter.ReadyGivePerkEvent(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void PunchOnGround(); // Function BravoHotelGame.BravoHotelCharacter.PunchOnGround(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE440>
	void PunchOnAir(); // Function BravoHotelGame.BravoHotelCharacter.PunchOnAir(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE420>
	void Prone(char bClientSimulation); // Function BravoHotelGame.BravoHotelCharacter.Prone(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE390>
	void PrintAllDetectedItems(); // Function BravoHotelGame.BravoHotelCharacter.PrintAllDetectedItems(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE370>
	void PrepareLanding(enum class Unknow InLandingReason); // Function BravoHotelGame.BravoHotelCharacter.PrepareLanding(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE2F0>
	void PlaySoundPlosiveSoundDetection3Lv(); // Function BravoHotelGame.BravoHotelCharacter.PlaySoundPlosiveSoundDetection3Lv(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE2D0>
	void PlayMontageTakeDamage(); // Function BravoHotelGame.BravoHotelCharacter.PlayMontageTakeDamage(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE2B0>
	void PlayHitSoundForInstigator(); // Function BravoHotelGame.BravoHotelCharacter.PlayHitSoundForInstigator(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE290>
	void PlayDeathAnimation(struct Unknown DeathAnimSlot, char bIsForce, struct Unknown Force, struct Unknown DeathRotation); // Function BravoHotelGame.BravoHotelCharacter.PlayDeathAnimation(Final|Native|Private|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECE110>
	struct Unknown PlayCharacterSound(struct Unknown Event, struct TArray<Unknown>& Conditions); // Function BravoHotelGame.BravoHotelCharacter.PlayCharacterSound(Final|BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECDFE0>
	void PlayCameraShakeDescenting(); // Function BravoHotelGame.BravoHotelCharacter.PlayCameraShakeDescenting(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECDFC0>
	void PistolMeleeAttack(); // Function BravoHotelGame.BravoHotelCharacter.PistolMeleeAttack(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECDFA0>
	void PickableItemDetected__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.PickableItemDetected__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void PhysicsImpulse_OnServer(struct Unknown PhysicsActor, struct Unknown Impulse, struct FName BoneName); // Function BravoHotelGame.BravoHotelCharacter.PhysicsImpulse_OnServer(Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECDE40>
	void PhysicsImpulse_Multicast(struct Unknown PhysicsActor, struct Unknown Impulse, struct FName BoneName); // Function BravoHotelGame.BravoHotelCharacter.PhysicsImpulse_Multicast(Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECDD20>
	void PhysicsActor_OnServ(struct Unknown PhysicsActor, struct Unknown a); // Function BravoHotelGame.BravoHotelCharacter.PhysicsActor_OnServam(Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECDBC0>
	void PhysicsActor_Multicast(struct Unknown PhysicsActor, struct Unknown a); // Function BravoHotelGame.BravoHotelCharacter.PhysicsActor_Multicast(Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECDA80>
	void PhasePerkLevelUpTimer(float DelayTime, int32_t UpCount); // Function BravoHotelGame.BravoHotelCharacter.PhasePerkLevelUpTimer(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD9B0>
	void PhasePerkLevelUpReady(); // Function BravoHotelGame.BravoHotelCharacter.PhasePerkLevelUpReady(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD990>
	void PhasePerkLevelUp(int32_t UpCount); // Function BravoHotelGame.BravoHotelCharacter.PhasePerkLevelUp(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD910>
	void PerkSpinEvent(char bShow, int32_t Count, enum class Unknow Slot); // Function BravoHotelGame.BravoHotelCharacter.PerkSpinEvent(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnViewCameraOutWater__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnViewCameraOutWater__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnViewCameraInWater__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnViewCameraInWater__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnUpdateStartReady(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateStartReady(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD890>
	void OnUpdatePassenger(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdatePassenger(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD510>
	void OnUpdateParachuting(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateParachuting(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD810>
	void OnUpdateLadder(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateLadder(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD610>
	void OnUpdateKnockout(float fDeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateKnockout(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD790>
	void OnUpdateInAircraftCinematic(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateInAircraftCinematic(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD710>
	void OnUpdateInAircraft(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateInAircraft(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD690>
	void OnUpdateEndReady(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateEndReady(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD610>
	void OnUpdateDriverPossessedPawn(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateDriverPossessedPawn(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD590>
	void OnUpdateDriver(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateDriver(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD510>
	void OnUpdateDescent(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateDescent(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD490>
	void OnUpdateDeath(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateDeath(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD410>
	void OnUpdateCriticalTime(float fDeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateCriticalTime(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD390>
	void OnUpdateBattle(float fDeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateBattle(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD310>
	void OnToggleWidget(enum class Unknow& ToggleType); // Function BravoHotelGame.BravoHotelCharacter.OnToggleWidget(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD280>
	void OnThrowingGrenadeMontageEnded(struct Unknown Montage, char bInterrupted); // Function BravoHotelGame.BravoHotelCharacter.OnThrowingGrenadeMontageEnded(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC280>
	void OnStartCineAircraft(struct Unknown InAircraftFlight); // Function BravoHotelGame.BravoHotelCharacter.OnStartCineAircraft(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD200>
	void OnSpawnBlackOutDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnSpawnBlackOutDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnSetBaseElevator(struct Unknown baseComponent); // Function BravoHotelGame.BravoHotelCharacter.OnSetBaseElevator(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD180>
	void OnRep_UnderWater(char& LastFlag); // Function BravoHotelGame.BravoHotelCharacter.OnRep_UnderWater(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD0D0>
	void OnRep_SteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_SteadyAim(Final|Native|Private) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD0B0>
	void OnRep_NeedFindPersonalSupplyBoxLocation(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_NeedFindPersonalSupplyBoxLocation(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD010>
	void OnRep_Health(float& LastHealth); // Function BravoHotelGame.BravoHotelCharacter.OnRep_Health(Final|Native|Private|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECCF50>
	void OnRep_FPSK_TargetMagnificationFactor(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_FPSK_TargetMagnificationFactor(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECCF10>
	void OnRep_CurrentPerkInfos(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_CurrentPerkInfos(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECCEF0>
	void OnRep_CurrentPerkDeck(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_CurrentPerkDeck(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECCEB0>
	void OnRep_BoostPercent(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_BoostPercent(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECCE70>
	void OnRep_bInSmoke(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_bInSmoke(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECD160>
	void OnRep_BandageTargetHealth(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_BandageTargetHealth(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECCE50>
	void OnPinOffMontageEnded(struct Unknown Montage, char bInterrupted); // Function BravoHotelGame.BravoHotelCharacter.OnPinOffMontageEnded(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC280>
	void OnParachuteSkinDataLoaded(struct TSoftObjectPtr<Unknown> TargetParachuteSkin); // Function BravoHotelGame.BravoHotelCharacter.OnParachuteSkinDataLoaded(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECCD30>
	void OnOverlapEnd(struct Unknown OverlappedComponent, struct Unknown OtherActor, struct Unknown OtherComp, int32_t OtherBodyIndex); // Function BravoHotelGame.BravoHotelCharacter.OnOverlapEnd(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECCBF0>
	void OnOverlapBegin(struct Unknown OverlappedComponent, struct Unknown OtherActor, struct Unknown OtherComp, int32_t OtherBodyIndex, char bFromSweep, struct Unknown& SweepResult); // Function BravoHotelGame.BravoHotelCharacter.OnOverlapBegin(Final|Native|Protected|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC9E0>
	void OnOutSmoke__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnOutSmoke__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnOriginRebasing(struct Unknown World, struct Unknown PreviosWorldOriginLocation, struct Unknown OriginLocation); // Function BravoHotelGame.BravoHotelCharacter.OnOriginRebasing(Native|Public|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC8B0>
	void OnMovementUpdated(float DeltaSeconds, struct Unknown OldLocation, struct Unknown OldVelocity); // Function BravoHotelGame.BravoHotelCharacter.OnMovementUpdated(Final|Native|Protected|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC790>
	void OnMovementInputPressed__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnMovementInputPressed__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnInstigatorHitCharacter(struct Unknown* DamageTypeClass); // Function BravoHotelGame.BravoHotelCharacter.OnInstigatorHitCharacter(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC710>
	void OnInSmoke__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnInSmoke__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnInputStopFreeLook(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStopFreeLook(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC6F0>
	void OnInputStopFire(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStopFire(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC6D0>
	void OnInputStopBoostItemMenu(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStopBoostItemMenu(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC6B0>
	void OnInputStartSprinting(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStartSprinting(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC690>
	void OnInputStartMovement(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStartMovement(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x151AF10>
	void OnInputStartFreeLook(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStartFreeLook(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC670>
	void OnInputSmartPingMenuWorldMap(); // Function BravoHotelGame.BravoHotelCharacter.OnInputSmartPingMenuWorldMap(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC650>
	void OnInputSmartPingMenu2WorldMap(); // Function BravoHotelGame.BravoHotelCharacter.OnInputSmartPingMenu2WorldMap(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC610>
	void OnInputSmartPingMenu(); // Function BravoHotelGame.BravoHotelCharacter.OnInputSmartPingMenu(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC630>
	void OnInputReleaseCrouch(); // Function BravoHotelGame.BravoHotelCharacter.OnInputReleaseCrouch(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC5F0>
	void OnInputFPSOnly(); // Function BravoHotelGame.BravoHotelCharacter.OnInputFPSOnly(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC5D0>
	void OnInputEndSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.OnInputEndSteadyAim(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC5B0>
	void OnInitializedFSM(struct Unknown Context); // Function BravoHotelGame.BravoHotelCharacter.OnInitializedFSM(Native|Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC520>
	void OnHitMeteorStrike(struct Unknown HitComponent, struct Unknown OtherActor, struct Unknown OtherComp, struct Unknown NormalImpulse, struct Unknown& Hit); // Function BravoHotelGame.BravoHotelCharacter.OnHitMeteorStrike(Final|Native|Public|HasOutParms|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC350>
	void OnGrenadeCookMontageEnded(struct Unknown Montage, char bInterrupted); // Function BravoHotelGame.BravoHotelCharacter.OnGrenadeCookMontageEnded(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC280>
	void OnFinishRocketJump(); // Function BravoHotelGame.BravoHotelCharacter.OnFinishRocketJump(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC260>
	void OnFinishMeteorJump(); // Function BravoHotelGame.BravoHotelCharacter.OnFinishMeteorJump(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC240>
	void OnFinishAirWalk(); // Function BravoHotelGame.BravoHotelCharacter.OnFinishAirWalk(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC220>
	void OnExitStartReady(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitStartReady(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECBE40>
	void OnExitPassenger(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitPassenger(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC160>
	void OnExitParachuting(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitParachuting(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC0E0>
	void OnExitLadder(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitLadder(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC060>
	void OnExitKnockout(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitKnockout(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECBFE0>
	void OnExitInAircraftCinematic(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitInAircraftCinematic(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECBF60>
	void OnExitInAircraft(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitInAircraft(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECBEE0>
	void OnExitHipShot(); // Function BravoHotelGame.BravoHotelCharacter.OnExitHipShot(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x151AF10>
	void OnExitHeartBeatSensor(); // Function BravoHotelGame.BravoHotelCharacter.OnExitHeartBeatSensor(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECBEC0>
	void OnExitForceFieldDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnExitForceFieldDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnExitFallingState__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnExitFallingState__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnExitEndReady(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitEndReady(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECBE40>
	void OnExitedVehicle(); // Function BravoHotelGame.BravoHotelCharacter.OnExitedVehicle(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC200>
	void OnExitedElevator(); // Function BravoHotelGame.BravoHotelCharacter.OnExitedElevator(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECC1E0>
	void OnExitDriverPossessedPawn(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitDriverPossessedPawn(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECBDC0>
	void OnExitDriver(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitDriver(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECBD40>
	void OnExitDescent(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitDescent(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECBCC0>
	void OnExitDeath(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitDeath(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECBC40>
	void OnExitCriticalTime(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitCriticalTime(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECBBC0>
	void OnExitBattle(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitBattle(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECBB40>
	void OnExitAOS(); // Function BravoHotelGame.BravoHotelCharacter.OnExitAOS(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECBB20>
	void OnExitAMP(); // Function BravoHotelGame.BravoHotelCharacter.OnExitAMP(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECBB00>
	void OnExitADS(char bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnExitADS(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECBA70>
	void OnEnterHipShot(char bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnEnterHipShot(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB940>
	void OnEnterHeartBeatSensor(char bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnEnterHeartBeatSensor(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB8B0>
	void OnEnteredVehicle__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnEnteredVehicle__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnEnteredVehicle(); // Function BravoHotelGame.BravoHotelCharacter.OnEnteredVehicle(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECBA50>
	void OnEnteredElevator(struct Unknown OutElevatorRef); // Function BravoHotelGame.BravoHotelCharacter.OnEnteredElevator(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB9D0>
	void OnEnterAOS(char bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnEnterAOS(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB820>
	void OnEnterAMP(char bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnEnterAMP(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB790>
	void OnEnterADS(char bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnEnterADS(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB700>
	void OnEndSearchInstinct__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnEndSearchInstinct__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnEndCineAircraft(); // Function BravoHotelGame.BravoHotelCharacter.OnEndCineAircraft(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB6E0>
	void OnDeath(); // Function BravoHotelGame.BravoHotelCharacter.OnDeath(Native|Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB6C0>
	void OnDamaged(struct Unknown* DamageTypeClass, float DamageAmount); // Function BravoHotelGame.BravoHotelCharacter.OnDamaged(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB5F0>
	void OnConditionStarted(enum class Unknow NewCondition); // Function BravoHotelGame.BravoHotelCharacter.OnConditionStarted(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB570>
	void OnConditionEnded(enum class Unknow NewCondition); // Function BravoHotelGame.BravoHotelCharacter.OnConditionEnded(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB4F0>
	void OnCompleteActiveSkillDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnCompleteActiveSkillDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnCheckSupplyCost__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnCheckSupplyCost__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnCharacterGroundStateChange__DelegateSignature(enum class Unknow State); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnCharacterGroundStateChange__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnChangeWeaponAttachments(); // Function BravoHotelGame.BravoHotelCharacter.OnChangeWeaponAttachments(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB410>
	void OnChangeTeleportState(char IsStart); // Function BravoHotelGame.BravoHotelCharacter.OnChangeTeleportState(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB380>
	void OnChangeProjectilePredict(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangeProjectilePredict(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnChangeFireType__DelegateSignature(enum class Unknow PreFireType, enum class Unknow NewFireType); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangeFireType__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnChangeEquipWeaponStateIntheWater(char bState); // Function BravoHotelGame.BravoHotelCharacter.OnChangeEquipWeaponStateIntheWater(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB2F0>
	void OnChangeDetectedItems__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangeDetectedItems__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnChangedDediSettings(enum class Unknow SettingType, float Value); // Function BravoHotelGame.BravoHotelCharacter.OnChangedDediSettings(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB430>
	void OnChangeCurrentWeapon(); // Function BravoHotelGame.BravoHotelCharacter.OnChangeCurrentWeapon(Final|Native|Private) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB2D0>
	void OnChangeCharacterState__DelegateSignature(enum class Unknow& StateType); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangeCharacterState__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnCameraViewModeChanged__DelegateSignature(char bIsThirdPerson); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnCameraViewModeChanged__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnBoxChanged(); // Function BravoHotelGame.BravoHotelCharacter.OnBoxChanged(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EBDF30>
	void OnBlueZoneFollowingChanged(struct Unknown Checker, char bIsFollowing); // Function BravoHotelGame.BravoHotelCharacter.OnBlueZoneFollowingChanged(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB200>
	void OnBeginStartReady(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginStartReady(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB1E0>
	void OnBeginPassenger(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginPassenger(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB1C0>
	void OnBeginParachuting(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginParachuting(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB1A0>
	void OnBeginLadder(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginLadder(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB180>
	void OnBeginKnockout(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginKnockout(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB160>
	void OnBeginInAircraftCinematic(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginInAircraftCinematic(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB140>
	void OnBeginInAircraft(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginInAircraft(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB120>
	void OnBeginEndReady(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginEndReady(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB100>
	void OnBeginDriverPossessedPawn(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginDriverPossessedPawn(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB0E0>
	void OnBeginDriver(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginDriver(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB0C0>
	void OnBeginDescent(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginDescent(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB0A0>
	void OnBeginDeath(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginDeath(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB080>
	void OnBeginCriticalTime(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginCriticalTime(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB060>
	void OnBeginBattle(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginBattle(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECB040>
	void OnBattleRoyalStateChanged(enum class Unknow PrevState, enum class Unknow CurrentState); // Function BravoHotelGame.BravoHotelCharacter.OnBattleRoyalStateChanged(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECAF80>
	void OnAttackOtherCharacterWithRangedWeapon__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnAttackOtherCharacterWithRangedWeapon__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnAnyUpdateState(struct Unknown Context, struct FName WithStateName, char WithStateID, float WithStateTime); // Function BravoHotelGame.BravoHotelCharacter.OnAnyUpdateState(Native|Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECAE40>
	void OnAnyExitState(struct Unknown Context, struct FName WithStateName, char WithStateID); // Function BravoHotelGame.BravoHotelCharacter.OnAnyExitState(Native|Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECAD40>
	void OnAnyBeginState(struct Unknown Context, struct FName WithStateName, char WithStateID, char WithPrevious); // Function BravoHotelGame.BravoHotelCharacter.OnAnyBeginState(Native|Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECAC00>
	void OnAnimInitialized(); // Function BravoHotelGame.BravoHotelCharacter.OnAnimInitialized(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECABE0>
	void OnAirCraftDelegate__DelegateSignature(char State); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnAirCraftDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void NextParkourTestComponent(); // Function BravoHotelGame.BravoHotelCharacter.NextParkourTestComponent(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x151AF10>
	void NeedCheckCurrentBuff(); // Function BravoHotelGame.BravoHotelCharacter.NeedCheckCurrentBuff(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECABC0>
	void MultiEndAppearingVehicle(struct Unknown TargetVehicle, struct Unknown* TargetClass, struct Unknown TargetTransform); // Function BravoHotelGame.BravoHotelCharacter.MultiEndAppearingVehicle(Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC9630>
	void MultiDisappearingVehicle(struct Unknown TargetVehicle); // Function BravoHotelGame.BravoHotelCharacter.MultiDisappearingVehicle(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC95A0>
	void MulticastWindowBreaching(); // Function BravoHotelGame.BravoHotelCharacter.MulticastWindowBreaching(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECABA0>
	void MulticastUpdateRagdollVariables(struct Unknown NewRagdollVelocity, struct Unknown NewRagdollLocation, struct Unknown NewActorLocation); // Function BravoHotelGame.BravoHotelCharacter.MulticastUpdateRagdollVariables(Net|Native|Event|NetMulticast|Protected|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECAA10>
	void MulticastTakePointDamage(struct Unknown DamageInfo); // Function BravoHotelGame.BravoHotelCharacter.MulticastTakePointDamage(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECA940>
	void MulticastStopMontage(struct Unknown AnimMontage, float BlendTime); // Function BravoHotelGame.BravoHotelCharacter.MulticastStopMontage(Net|NetReliableNative|Event|NetMulticast|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECA870>
	void MulticastSimulatedTakeDamage(struct Unknown RepSimulatedInfo); // Function BravoHotelGame.BravoHotelCharacter.MulticastSimulatedTakeDamage(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECA7C0>
	void MulticastSimulatedHittedDamage(struct Unknown RepSimulatedInfo); // Function BravoHotelGame.BravoHotelCharacter.MulticastSimulatedHittedDamage(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECA720>
	void MulticastSetInteractiveShpere(char bActive); // Function BravoHotelGame.BravoHotelCharacter.MulticastSetInteractiveShpere(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECA690>
	void MulticastRewindMontage(struct Unknown AnimMontage); // Function BravoHotelGame.BravoHotelCharacter.MulticastRewindMontage(Net|NetReliableNative|Event|NetMulticast|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECA600>
	void MulticastRemoveAttachedUsableItem(); // Function BravoHotelGame.BravoHotelCharacter.MulticastRemoveAttachedUsableItem(Net|NetReliableNative|Event|NetMulticast|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECA5E0>
	void MulticastPlayMontage(char bPlayOnLocalClient, struct Unknown AnimMontageTPP, struct Unknown AnimMontageFPP); // Function BravoHotelGame.BravoHotelCharacter.MulticastPlayMontage(Net|NetReliableNative|Event|NetMulticast|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECA4D0>
	void MulticastPlayCharacterSound(enum class Unknow AudioEventType, char TypeIndex); // Function BravoHotelGame.BravoHotelCharacter.MulticastPlayCharacterSound(Net|Native|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECA410>
	void MulticastObjectDestruction(struct Unknown DestructibleActor, struct Unknown DestructibleComponent, struct Unknown Location, float Damage, float EffectRange); // Function BravoHotelGame.BravoHotelCharacter.MulticastObjectDestruction(Net|Native|Event|NetMulticast|Public|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECA280>
	void MulticastInAircraft(struct Unknown AircraftFlight, float AttachYaw); // Function BravoHotelGame.BravoHotelCharacter.MulticastInAircraft(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECA1B0>
	void MulticastHandleDamageToVehicleDestructibleComponent(struct Unknown DestructibleComponent, struct Unknown HitDetails, struct Unknown ImpactVelocity); // Function BravoHotelGame.BravoHotelCharacter.MulticastHandleDamageToVehicleDestructibleComponent(Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1ECA000>
	void MulticastExceptOwnerStopAnimMontage(struct Unknown MontageToStopTPP, struct Unknown MontageToStopFPP); // Function BravoHotelGame.BravoHotelCharacter.MulticastExceptOwnerStopAnimMontage(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC9F30>
	void MulticastEndCombine(char bSuccess, struct FName TargetRecipe); // Function BravoHotelGame.BravoHotelCharacter.MulticastEndCombine(Net|NetReliableNative|Event|NetMulticast|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC9E60>
	void MulticastEndCastingBackpackItem(char bSuccess, struct FName ItemKey); // Function BravoHotelGame.BravoHotelCharacter.MulticastEndCastingBackpackItem(Net|NetReliableNative|Event|NetMulticast|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC9D90>
	void MulticastDoorObjectDestruction(struct Unknown DoorActor, struct Unknown DamageEvent, struct Unknown EventInstigator, struct Unknown DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.MulticastDoorObjectDestruction(Net|Native|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC9C10>
	void MulticastDoorBreaching(struct Unknown BreachingParticleLocation, struct Unknown BreachingParticleRotation); // Function BravoHotelGame.BravoHotelCharacter.MulticastDoorBreaching(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC9B30>
	void MulticastBravoHotelHIDestructionObejct(struct Unknown BravoHotelDestructibleComponent, float Damage, struct Unknown DamageEvent, struct Unknown EventInstigator, struct Unknown DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.MulticastBravoHotelHIDestructionObejct(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC9970>
	void MulticastBravoHotelDestructionObejct(struct Unknown BravoHotelDestructibleComponent, float Damage, struct Unknown DamageEvent, struct Unknown EventInstigator, struct Unknown DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.MulticastBravoHotelDestructionObejct(Net|Native|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC97B0>
	void MultiAppearingVehicle(struct Unknown TargetVehicle, struct Unknown* TargetClass, struct Unknown TargetTransform); // Function BravoHotelGame.BravoHotelCharacter.MultiAppearingVehicle(Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC9420>
	void MuiticastSetUpdateRenderSettings(char bValue); // Function BravoHotelGame.BravoHotelCharacter.MuiticastSetUpdateRenderSettings(Net|Native|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC9390>
	void MoveRightOnDescent(float DeltaTime, float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.MoveRightOnDescent(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC92D0>
	void MoveRight(float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.MoveRight(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC9250>
	void MoveForwardOnDescent(float DeltaTime, float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.MoveForwardOnDescent(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC9190>
	void MoveForward(float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.MoveForward(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC9110>
	void MarkBrokenEquipmentNeedToSpawn(int32_t Equipmentlevel, struct Unknown& DamageImpulseDir, enum class Unknow& EquipmentType); // Function BravoHotelGame.BravoHotelCharacter.MarkBrokenEquipmentNeedToSpawn(Final|Native|Public|HasOutParms|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8FF0>
	void ManageRotation(); // Function BravoHotelGame.BravoHotelCharacter.ManageRotation(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8FD0>
	void ManageMovementMode(); // Function BravoHotelGame.BravoHotelCharacter.ManageMovementMode(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8FB0>
	void ManageDebuffState(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.ManageDebuffState(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8F30>
	void LockMovementInput(); // Function BravoHotelGame.BravoHotelCharacter.LockMovementInput(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8F10>
	void LoadMouseSensitivty(); // Function BravoHotelGame.BravoHotelCharacter.LoadMouseSensitivty(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8EF0>
	void KillPerkLevelUpTimer(float DelayTime, int32_t UpCount, int32_t KillCount); // Function BravoHotelGame.BravoHotelCharacter.KillPerkLevelUpTimer(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8DE0>
	void KillPerkLevelUpReady(int32_t KillCount); // Function BravoHotelGame.BravoHotelCharacter.KillPerkLevelUpReady(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8D60>
	void KillPerkLevelUp(int32_t UpCount, int32_t KillCount); // Function BravoHotelGame.BravoHotelCharacter.KillPerkLevelUp(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8CA0>
	void KillGivePerkEvent(int32_t KillCount); // Function BravoHotelGame.BravoHotelCharacter.KillGivePerkEvent(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void K2_UpdateMutable_PreviewPawn(char bChangeGender); // Function BravoHotelGame.BravoHotelCharacter.K2_UpdateMutable_PreviewPawn(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void K2_OnStartProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function BravoHotelGame.BravoHotelCharacter.K2_OnStartProne(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void K2_OnGoParachute(); // Function BravoHotelGame.BravoHotelCharacter.K2_OnGoParachute(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void K2_OnEndProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function BravoHotelGame.BravoHotelCharacter.K2_OnEndProne(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void K2_OnCameraViewModeChanged(char bIsThirdPerson); // Function BravoHotelGame.BravoHotelCharacter.K2_OnCameraViewModeChanged(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void K2_OnAddControllerYawInput(float Val); // Function BravoHotelGame.BravoHotelCharacter.K2_OnAddControllerYawInput(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	struct Unknown K2_GetPerkLevelUpData(); // Function BravoHotelGame.BravoHotelCharacter.K2_GetPerkLevelUpData(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8C30>
	struct Unknown K2_GetPerkDeckData(); // Function BravoHotelGame.BravoHotelCharacter.K2_GetPerkDeckData(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8BC0>
	struct Unknown K2_GetPerkClassLevelUpElement(int32_t Level); // Function BravoHotelGame.BravoHotelCharacter.K2_GetPerkClassLevelUpElement(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC89F0>
	void K2_FPSK_OnStartADS(); // Function BravoHotelGame.BravoHotelCharacter.K2_FPSK_OnStartADS(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void K2_FPSK_OnEndADS(); // Function BravoHotelGame.BravoHotelCharacter.K2_FPSK_OnEndADS(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void K2_EnterSceneOfWin(); // Function BravoHotelGame.BravoHotelCharacter.K2_EnterSceneOfWin(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void K2_Cheat_ToggleCharacterDebugCamera(); // Function BravoHotelGame.BravoHotelCharacter.K2_Cheat_ToggleCharacterDebugCamera(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	char IsWantsToJetpackAim(); // Function BravoHotelGame.BravoHotelCharacter.IsWantsToJetpackAim(Final|Native|Public|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC89C0>
	char IsWantsToJetpack(); // Function BravoHotelGame.BravoHotelCharacter.IsWantsToJetpack(Final|Native|Public|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8990>
	char IsViewPointInWaterVolume(); // Function BravoHotelGame.BravoHotelCharacter.IsViewPointInWaterVolume(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8960>
	char IsVehicleState(enum class Unknow State); // Function BravoHotelGame.BravoHotelCharacter.IsVehicleState(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC88D0>
	char IsVehiclePassenger(); // Function BravoHotelGame.BravoHotelCharacter.IsVehiclePassenger(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC88A0>
	char IsVehicleDriver(); // Function BravoHotelGame.BravoHotelCharacter.IsVehicleDriver(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8870>
	char IsThirdPerson(); // Function BravoHotelGame.BravoHotelCharacter.IsThirdPerson(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8840>
	char IsSwimming(); // Function BravoHotelGame.BravoHotelCharacter.IsSwimming(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8810>
	char IsSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.IsSteadyAim(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC87E0>
	char IsSprinting(); // Function BravoHotelGame.BravoHotelCharacter.IsSprinting(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC87B0>
	char IsShowingLandingPosition(); // Function BravoHotelGame.BravoHotelCharacter.IsShowingLandingPosition(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8780>
	char IsReviving(); // Function BravoHotelGame.BravoHotelCharacter.IsReviving(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8700>
	char IsResuscitating(); // Function BravoHotelGame.BravoHotelCharacter.IsResuscitating(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8680>
	char IsRecommendedPerkDeck(struct FName& PerkName); // Function BravoHotelGame.BravoHotelCharacter.IsRecommendedPerkDeck(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC85E0>
	char IsReadyToSnipe(); // Function BravoHotelGame.BravoHotelCharacter.IsReadyToSnipe(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC85C0>
	char IsProneStateTransitioning(); // Function BravoHotelGame.BravoHotelCharacter.IsProneStateTransitioning(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8590>
	char IsProne(); // Function BravoHotelGame.BravoHotelCharacter.IsProne(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8560>
	char IsPlayingPickupAnim(); // Function BravoHotelGame.BravoHotelCharacter.IsPlayingPickupAnim(Final|Native|Public|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8530>
	char IsPlayingEquipAnim(); // Function BravoHotelGame.BravoHotelCharacter.IsPlayingEquipAnim(Final|Native|Public|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8500>
	char IsPlayingCastingAnim(); // Function BravoHotelGame.BravoHotelCharacter.IsPlayingCastingAnim(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC84D0>
	char IsPlayerReplayViewMode(); // Function BravoHotelGame.BravoHotelCharacter.IsPlayerReplayViewMode(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC84A0>
	char IsPendingKickDoor(); // Function BravoHotelGame.BravoHotelCharacter.IsPendingKickDoor(Final|Native|Public|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8470>
	char IsOverlapWaterVolume(); // Function BravoHotelGame.BravoHotelCharacter.IsOverlapWaterVolume(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8440>
	char IsOnLadder(); // Function BravoHotelGame.BravoHotelCharacter.IsOnLadder(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8410>
	char IsOnIceLand(); // Function BravoHotelGame.BravoHotelCharacter.IsOnIceLand(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC83E0>
	char IsOnDescent(); // Function BravoHotelGame.BravoHotelCharacter.IsOnDescent(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC83B0>
	char IsMaxLevel(); // Function BravoHotelGame.BravoHotelCharacter.IsMaxLevel(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8380>
	char IsMale(); // Function BravoHotelGame.BravoHotelCharacter.IsMale(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8350>
	char IsLockedInventory(); // Function BravoHotelGame.BravoHotelCharacter.IsLockedInventory(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8320>
	char IsLocalPlayerControlledPawn(); // Function BravoHotelGame.BravoHotelCharacter.IsLocalPlayerControlledPawn(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8260>
	char IsLocallyPlaying(char bIncludeSpectedPawn); // Function BravoHotelGame.BravoHotelCharacter.IsLocallyPlaying(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8290>
	char IsLandStop(); // Function BravoHotelGame.BravoHotelCharacter.IsLandStop(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8230>
	char IsKicking(); // Function BravoHotelGame.BravoHotelCharacter.IsKicking(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8200>
	char IsJumping(); // Function BravoHotelGame.BravoHotelCharacter.IsJumping(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC81D0>
	char IsJumpAttacking(); // Function BravoHotelGame.BravoHotelCharacter.IsJumpAttacking(Final|Native|Public|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC81A0>
	char IsInVehicle(); // Function BravoHotelGame.BravoHotelCharacter.IsInVehicle(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8170>
	char IsInstancedFoliageActor(struct Unknown TargetActor); // Function BravoHotelGame.BravoHotelCharacter.IsInstancedFoliageActor(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	char IsInSkydiving(); // Function BravoHotelGame.BravoHotelCharacter.IsInSkydiving(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8140>
	char IsInParachute(); // Function BravoHotelGame.BravoHotelCharacter.IsInParachute(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8110>
	char IsInForceField(); // Function BravoHotelGame.BravoHotelCharacter.IsInForceField(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC80E0>
	char IsInDoor(); // Function BravoHotelGame.BravoHotelCharacter.IsInDoor(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC80B0>
	char IsInAircraft(); // Function BravoHotelGame.BravoHotelCharacter.IsInAircraft(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8080>
	char IsHipShot(); // Function BravoHotelGame.BravoHotelCharacter.IsHipShot(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8050>
	char IsFoundVehicleSearch(); // Function BravoHotelGame.BravoHotelCharacter.IsFoundVehicleSearch(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC8020>
	char IsFoundSearchInstinct(); // Function BravoHotelGame.BravoHotelCharacter.IsFoundSearchInstinct(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7FF0>
	char IsFollowReplayViewMode(); // Function BravoHotelGame.BravoHotelCharacter.IsFollowReplayViewMode(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7FC0>
	char IsFirstPerson(); // Function BravoHotelGame.BravoHotelCharacter.IsFirstPerson(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7F90>
	char IsFiring(); // Function BravoHotelGame.BravoHotelCharacter.IsFiring(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7F60>
	char IsEnoughtSupplyGold(); // Function BravoHotelGame.BravoHotelCharacter.IsEnoughtSupplyGold(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7F30>
	char IsEnemyFor(struct Unknown OtherPlayerController); // Function BravoHotelGame.BravoHotelCharacter.IsEnemyFor(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7EA0>
	char IsEnemyCharacter(struct Unknown OtherCharacter); // Function BravoHotelGame.BravoHotelCharacter.IsEnemyCharacter(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7E10>
	char IsEnableSpawnSupplyBox(struct Unknown TargetActor, struct FString& OutResult); // Function BravoHotelGame.BravoHotelCharacter.IsEnableSpawnSupplyBox(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	char IsDisconnected(); // Function BravoHotelGame.BravoHotelCharacter.IsDisconnected(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7DE0>
	char IsCustomBuoyancySwimMode(); // Function BravoHotelGame.BravoHotelCharacter.IsCustomBuoyancySwimMode(Final|Native|Public|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7DB0>
	char IsCurrentThrowingWeapon(); // Function BravoHotelGame.BravoHotelCharacter.IsCurrentThrowingWeapon(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7D80>
	char IsControllerTargetPawn(); // Function BravoHotelGame.BravoHotelCharacter.IsControllerTargetPawn(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7D50>
	char IsCondition(enum class Unknow ConditionType); // Function BravoHotelGame.BravoHotelCharacter.IsCondition(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7CC0>
	char IsClimbing(); // Function BravoHotelGame.BravoHotelCharacter.IsClimbing(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7C90>
	char IsChargingGauge(); // Function BravoHotelGame.BravoHotelCharacter.IsChargingGauge(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7C60>
	char IsCharacterPositionUnderWaterSurface(); // Function BravoHotelGame.BravoHotelCharacter.IsCharacterPositionUnderWaterSurface(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7C30>
	char IsChangingWeapon(); // Function BravoHotelGame.BravoHotelCharacter.IsChangingWeapon(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7C00>
	char IsCastingBackpackItem(); // Function BravoHotelGame.BravoHotelCharacter.IsCastingBackpackItem(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7BD0>
	char IsBuff(enum class Unknow BuffType); // Function BravoHotelGame.BravoHotelCharacter.IsBuff(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7B40>
	char IsBeginner(); // Function BravoHotelGame.BravoHotelCharacter.IsBeginner(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7B10>
	char IsAppearanceReplicated(); // Function BravoHotelGame.BravoHotelCharacter.IsAppearanceReplicated(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7AE0>
	char IsAOS(); // Function BravoHotelGame.BravoHotelCharacter.IsAOS(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7890>
	char IsAlive(); // Function BravoHotelGame.BravoHotelCharacter.IsAlive(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7AB0>
	char IsAirWalking(); // Function BravoHotelGame.BravoHotelCharacter.IsAirWalking(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7A80>
	char IsADS(); // Function BravoHotelGame.BravoHotelCharacter.IsADS(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7860>
	char IsActiveLeanDamageBuff(); // Function BravoHotelGame.BravoHotelCharacter.IsActiveLeanDamageBuff(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7A50>
	char IsActiveHeartBeatSensor(); // Function BravoHotelGame.BravoHotelCharacter.IsActiveHeartBeatSensor(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7A20>
	char IsActiveCastingUIWithType(enum class Unknow& InCastingUIType); // Function BravoHotelGame.BravoHotelCharacter.IsActiveCastingUIWithType(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7980>
	char IsActiveCastingUI(); // Function BravoHotelGame.BravoHotelCharacter.IsActiveCastingUI(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7950>
	char IsActiveAmplifier(); // Function BravoHotelGame.BravoHotelCharacter.IsActiveAmplifier(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7920>
	char IsActionWithWeapon(); // Function BravoHotelGame.BravoHotelCharacter.IsActionWithWeapon(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC78F0>
	char IsABot(); // Function BravoHotelGame.BravoHotelCharacter.IsABot(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7830>
	char IsAbleUltimate(); // Function BravoHotelGame.BravoHotelCharacter.IsAbleUltimate(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC78C0>
	void InternalSimulatedTakeDamage(struct Unknown& RepSimulatedInfo); // Function BravoHotelGame.BravoHotelCharacter.InternalSimulatedTakeDamage(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7770>
	void InternalSimulatedHittedDamage(struct Unknown& RepDamageInfo); // Function BravoHotelGame.BravoHotelCharacter.InternalSimulatedHittedDamage(Final|Native|Private|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC76B0>
	void InternalJetpackBooster(char bNewJackpack); // Function BravoHotelGame.BravoHotelCharacter.InternalJetpackBooster(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7620>
	void InternalJetpackAim(char bNewJetpackAim); // Function BravoHotelGame.BravoHotelCharacter.InternalJetpackAim(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7590>
	void InternalInAircraft(struct Unknown AircraftFlight, float AttachYaw, char bCheckCinematic); // Function BravoHotelGame.BravoHotelCharacter.InternalInAircraft(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7480>
	void InitTimeline(); // Function BravoHotelGame.BravoHotelCharacter.InitTimeline(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7440>
	void InitRecordingCharacter(); // Function BravoHotelGame.BravoHotelCharacter.InitRecordingCharacter(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void InitializeStateAtCriticalTime(); // Function BravoHotelGame.BravoHotelCharacter.InitializeStateAtCriticalTime(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7460>
	void InitCustomizableObjectInstance(); // Function BravoHotelGame.BravoHotelCharacter.InitCustomizableObjectInstance(Native|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7420>
	void HideSkillMap(); // Function BravoHotelGame.BravoHotelCharacter.HideSkillMap(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7400>
	void HideInteractive(); // Function BravoHotelGame.BravoHotelCharacter.HideInteractive(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC73E0>
	void HideHUDbySequence(); // Function BravoHotelGame.BravoHotelCharacter.HideHUDbySequence(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC73C0>
	void HealthTick(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.HealthTick(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7340>
	char HasWeaponOfType(enum class Unknow WeaponType); // Function BravoHotelGame.BravoHotelCharacter.HasWeaponOfType(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC72B0>
	void HandleDamageToVehicleDestructibleComponent(struct Unknown DestructibleComponent, struct Unknown HitDetails, struct Unknown ImpactVelocity); // Function BravoHotelGame.BravoHotelCharacter.HandleDamageToVehicleDestructibleComponent(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC7100>
	void GoParachute(); // Function BravoHotelGame.BravoHotelCharacter.GoParachute(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC70E0>
	void GoIncapacitated(char bCriticalTime, struct Unknown& DamageInstigatorInfo); // Function BravoHotelGame.BravoHotelCharacter.GoIncapacitated(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC6FC0>
	void GoForceParachute(); // Function BravoHotelGame.BravoHotelCharacter.GoForceParachute(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC6FA0>
	void GiveEquipment(); // Function BravoHotelGame.BravoHotelCharacter.GiveEquipment(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC6F80>
	int32_t GetZeroPointDistance(); // Function BravoHotelGame.BravoHotelCharacter.GetZeroPointDistance(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EC6F50>
