// Enum BravoHotelGame.EBuffEventType
enum class EBuffEventType : uint8_t {
	None = 0,
	ActiveSkill00 = 1,
	ActiveSkill01 = 2,
	ActiveSkill02 = 3,
	ActiveSkill03 = 4,
	CancleActiveSkill00 = 5,
	CancleActiveSkill01 = 6,
	CancleActiveSkill02 = 7,
	CancleActiveSkill03 = 8,
	ReactiveSkill00 = 9,
	ReactiveSkill01 = 10,
	ReactiveSkill02 = 11,
	ReactiveSkill03 = 12,
	TT_Wood = 13,
	TT_Rock = 14,
	TT_Indoor = 15,
	TT_Fence = 16,
	TT_Grass = 17,
	TT_Cliff = 18,
	TT_Water = 19,
	TT_Air = 20,
	TT_Vehicle = 21,
	Hited = 22,
	Damaged = 23,
	ZeroHP = 24,
	Death = 25,
	ArmorBreak = 26,
	TeamKnockDown = 27,
	AfterLanding = 28,
	Prone3Second = 29,
	Health25Percent = 30,
	FillFuel = 31,
	Landed = 32,
	CarLanded = 33,
	ExitVehicle = 34,
	KickDoor = 35,
	RevivingTeam = 36,
	ResuscitatingTeam = 37,
	UsingMedicine = 38,
	UsingItem = 39,
	Jump = 40,
	Retreat = 41,
	Nuclear = 42,
	IntoSmoke = 43,
	OutofSmoke = 44,
	FireAxShot = 45,
	StartParkour = 46,
	OnTakeHeadShot = 47,
	ChangeWeapon = 48,
	Fire = 49,
	OnEnterADS = 50,
	WindowBreaching = 51,
	IntoWaterPhysicsVolume = 52,
	OutofWaterPhysicsVolume = 53,
	IntoWetFog = 54,
	OutofWetFog = 55,
	Reloading = 56,
	MAX = 57,
	NoIndex = 255,
};

// Enum BravoHotelGame.EWeaponType
enum class EWeaponType : uint8_t {
	WT_None = 0,
	WT_Assault = 1,
	WT_DMR = 2,
	WT_SMG = 3,
	WT_SniperRifle = 4,
	WT_Shotgun = 5,
	WT_Pistol = 6,
	WT_ThrowingWeapon = 7,
	WT_Melee = 8,
	WT_SecondaryWeapon = 9,
	WT_PerkWeapon = 10,
	WT_MainWeapon = 101,
	WT_SubWeapon = 102,
	WT_FlareGun = 103,
	WT_LMG = 104,
	WT_All = 105,
	WT_MAX = 106,
};

// Enum BravoHotelGame.EWeaponBuffEventType
enum class EWeaponBuffEventType : uint8_t {
	None = 0,
	HeadShotZeroHPEnemy = 1,
	LastShot = 2,
	ZeroHPEnemy = 3,
	ThrowingZeroHP = 4,
	TargetHit = 5,
	SRShot = 6,
	DMRShot = 7,
	Shot = 8,
	ActiveGrenade = 9,
	NoAmmoReload = 10,
	MAX = 11,
	NoIndex = 255,
};

// Enum BravoHotelGame.EMediaPlayerState
enum class EMediaPlayerState : uint8_t {
	MPS_Play = 0,
	MPS_End = 1,
	MPS_MAX = 2,
};

// Enum BravoHotelGame.EAircraftFlightState
enum class EAircraftFlightState : uint8_t {
	AFS_None = 0,
	AFS_Distributing = 1,
	AFS_ReadyToScramble = 2,
	AFS_Scrambling = 3,
	AFS_End = 4,
	AFS_MAX = 5,
};

// Enum BravoHotelGame.EAircraftMovementMethod
enum class EAircraftMovementMethod : uint8_t {
	AMT_USING_SPEED = 0,
	AMT_USING_MAX = 1,
};

// Enum BravoHotelGame.EPickupRoot
enum class EPickupRoot : uint8_t {
	PR_World = 0,
	PR_DeadBody = 1,
	PR_TransportSupply = 2,
	PR_PersonalSupply = 3,
	PR_Skill = 4,
	PR_None = 255,
	PR_MAX = 256,
};

// Enum BravoHotelGame.EItemBindType
enum class EItemBindType : uint8_t {
	None = 0,
	Supply = 1,
	Bindable = 2,
	Binded = 3,
	EItemBindType_MAX = 4,
};

// Enum BravoHotelGame.EInventoryItemState
enum class EInventoryItemState : uint8_t {
	IIS_None = 0,
	IIS_World = 1,
	IIS_Inventory = 2,
	IIS_Wearing = 3,
	IIS_Equipped = 4,
	IIS_AttachWeapon = 5,
	IIS_Dropped = 6,
	IIS_MaterialSlot = 7,
	IIS_MAX = 8,
};

// Enum BravoHotelGame.EReplicationItemListType
enum class EReplicationItemListType : uint8_t {
	None = 0,
	BackPackItem = 1,
	MaterialItem = 2,
	EReplicationItemListType_MAX = 3,
};

// Enum BravoHotelGame.EAbilityCase
enum class EAbilityCase : uint8_t {
	AC_None = 0,
	AC_Base = 1,
	AC_Booster = 2,
	AC_Wearable = 3,
	AC_OutOfSteady = 4,
	AC_NoDamage = 5,
	AC_KnockOut = 6,
	AC_Death = 7,
	AC_UseLadder = 8,
	AC_ClimbUp = 9,
	AC_Cheat = 10,
	AC_Damaged = 11,
	AC_UnderWater = 12,
	AC_CastingItem = 13,
	AC_IceLand = 14,
	AC_Reviving = 15,
	AC_KickDoor = 16,
	AC_Sliding = 17,
	AC_Rolling = 18,
	AC_Knockback = 19,
	AC_Ultimate = 20,
	AC_DriverBuff = 21,
	AC_Max = 22,
};

// Enum BravoHotelGame.ECharacterConditionType
enum class ECharacterConditionType : uint8_t {
	CCT_None = 0,
	CCT_NoDamage = 1,
	CCT_NoSprint = 2,
	CCT_NoSteadyAim = 3,
	CCT_NoOxygen = 4,
	CCT_KnockOut = 5,
	CCT_CantAttack = 6,
	CCT_CantAction = 7,
	CCT_CantMove = 8,
	CCT_CantRotation = 9,
	CCT_CantGainItem = 10,
	CCT_CantChangeGroundState = 11,
	CCT_PerfectShot = 12,
	CCT_Cold = 13,
	CCT_Heat = 14,
	CCT_Burn = 15,
	CCT_Wet = 16,
	CCT_Hurt = 17,
	CCT_Stun = 18,
	CCT_SpatialSense = 19,
	CCT_Deafen = 20,
	CCT_Teleport = 21,
	CCT_InWetFog = 22,
	CCT_BlackOut = 23,
	CCT_ForceField = 24,
	CCT_Amplifier = 25,
	CCT_HeartBeatSensor = 26,
	CCT_Resurrection = 27,
	CCT_CanSliding = 28,
	CCT_CanChangeGroundStateOnWater = 29,
	CCT_CanBreaching = 30,
	CCT_NoFallingDamage = 31,
	CCT_NoLandingAnim = 32,
	CCT_WalkSilently = 33,
	CCT_MoveSilently = 34,
	CCT_AllSilently = 35,
	CCT_WaterSilently = 36,
	CCT_UseFlashbangBoobyTrap = 37,
	CCT_RocketJump = 38,
	CCT_SuperThrowingTrail = 39,
	CCT_HelmetSound = 40,
	CCT_GoodMoveOnWater = 41,
	CCT_BreakSilentlyPakour = 42,
	CCT_AvoidHeadShot = 43,
	CCT_HeadBanging = 44,
	CCT_HandSpeed = 45,
	CCT_HandSpeedADS = 46,
	CCT_SkipBoltAction = 47,
	CCT_Stuntman = 48,
	CCT_SeeThroughSmoke = 49,
	CCT_JetpackBooster = 50,
	CCT_JetpackAimBooster = 51,
	CCT_MeteorJump = 52,
	CCT_KeepHealthOne = 53,
	CCT_CantDropItem = 54,
	CCT_LockCurrentWeapon = 55,
	CCT_NoCarLandingDamageToTeam = 56,
	CCT_Max = 57,
};

// Enum BravoHotelGame.EPerkLevelUpType
enum class EPerkLevelUpType : uint8_t {
	Default = 0,
	ByBuff = 1,
	ByKill = 2,
	ByPhase = 3,
	ByGameStart = 4,
	EPerkLevelUpType_MAX = 5,
};

// Enum BravoHotelGame.EPerkSlotFlag
enum class EPerkSlotFlag : uint8_t {
	PSF_None = 0,
	PSF_Red = 1,
	PSF_Green = 2,
	PSF_Blue = 4,
	PSF_All = 255,
	PSF_MAX = 256,
};

// Enum BravoHotelGame.ECastingUIType
enum class ECastingUIType : uint8_t {
	CUT_Item = 0,
	CUT_Revive = 1,
	CUT_Resuscitation = 2,
	CUT_PersonalSupplyBox = 3,
	CUT_Reload = 4,
	CUT_Combine = 5,
	CUT_Repair = 6,
	CUT_MAX = 7,
};

// Enum BravoHotelGame.ESettingType
enum class ESettingType : uint8_t {
	Begin = 0,
	Graphic_Begin = 1,
	Graphic_Language = 2,
	Graphic_Resolution = 3,
	Graphic_ResolutionX = 4,
	Graphic_ResolutionY = 5,
	Graphic_DisplayMod = 6,
	Graphic_Gamma = 7,
	Graphic_Sharpen = 8,
	Graphic_FieldOfView = 9,
	Graphic_ResolutionScale = 10,
	Graphic_TotalGraphic = 11,
	Graphic_FoliageDensity = 12,
	Graphic_AntiAliasing = 13,
	Graphic_PostProcessing = 14,
	Graphic_ShdowQuality = 15,
	Graphic_ShadingQuality = 16,
	Graphic_ViewDistanceQuality = 17,
	Graphic_TextureQuality = 18,
	Graphic_EffectQuality = 19,
	Graphic_VSync = 20,
	Graphic_SmoothFrameRate = 21,
	Graphic_ConfirmTime = 22,
	Graphic_Reflex = 23,
	Graphic_DLSS = 24,
	Graphic_MaxFrameRate = 25,
	Graphic_MaxLobbyFrameRate = 26,
	Graphic_DepthOfField = 27,
	Graphic_FSR = 28,
	Graphic_End = 29,
	Audio_Begin = 30,
	Audio_MasterVolumeOnOff = 31,
	Audio_Master = 32,
	Audio_Music = 33,
	Audio_Effect = 34,
	Audio_UI = 35,
	Audio_VoiceInputMode = 36,
	Audio_VoiceChanel = 37,
	Audio_VoiceInput = 38,
	Audio_VoiceOutput = 39,
	Audio_End = 40,
	Key = 41,
	Control_Begin = 42,
	Control_VerticalModifier = 43,
	Control_GeneralSensitivity = 44,
	Control_VehicleDriverSensitivity = 45,
	Control_TargetingSensitivity = 46,
	Control_TotalSensitivity = 47,
	Control_UsingDetailSensitivity = 48,
	Control_ADSSensitivity = 49,
	Control_2XSensitivity = 50,
	Control_4XSensitivity = 51,
	Control_6XSensitivity = 52,
	Control_8XSensitivity = 53,
	Control_15XSensitivity = 54,
	Control_ToggleCrouch = 55,
	Control_ToggleWalk = 56,
	Control_ToggleSprint = 57,
	Control_ToggleFreeLook = 58,
	Control_ToggleSteadyAim = 59,
	Control_ToggleExLean = 60,
	Control_ToggleAOS = 61,
	Control_ToggleADS = 62,
	Control_ReverseLeftAndRight = 63,
	Control_ReverseUpAndDown = 64,
	Control_End = 65,
	GamePlay_Begin = 66,
	GamePlay_ARFireMode = 67,
	GamePlay_SMGFireMode = 68,
	GamePlay_SRFireMode = 69,
	GamePlay_DMRFireMode = 70,
	GamePlay_PistolFireMode = 71,
	GamePlay_AutoReload = 72,
	GamePlay_ImmediateAttachment = 73,
	GamePlay_InheritAttachment = 74,
	GamePlay_ShowPerkSlot = 75,
	GamePlay_ShowSmartPing = 76,
	GamePlay_ShowSmartPingSupplyBox = 77,
	GamePlay_ShowSmartPingLightPole = 78,
	GamePlay_NetworkDebugStatistics = 79,
	GamePlay_EnableShowClassUI = 80,
	GamePlay_ShowUseaableItemEffect = 81,
	GamePlay_AmmoEffect = 82,
	GamePlay_MedicalLv3Effect = 83,
	GamePlay_MedicalLv2Effect = 84,
	GamePlay_MedicalLv1Effect = 85,
	GamePlay_RedBoostEffect = 86,
	GamePlay_GreenBoostEffect = 87,
	GamePlay_BlueBoostEffect = 88,
	GamePlay_AutoUse_MedicalLv1 = 89,
	GamePlay_AutoUse_MedicalLv2 = 90,
	GamePlay_AutoUse_MedicalLv3 = 91,
	GamePlay_AutoLadder = 92,
	GamePlay_ShowGuideWidget = 93,
	GamePlay_SearchMaterialItem = 94,
	GamePlay_SearchExpertWeaponItem = 95,
	GamePlay_ShowDamageLog = 96,
	GamePlay_InventoryOrder = 97,
	GamePlay_InventoryScrollSpeed = 98,
	GamePlay_PlayTutorial = 99,
	GamePlay_RePlayTutorial = 100,
	GamePlay_CrossHair = 101,
	GamePlay_CustomUseItem1 = 102,
	GamePlay_CustomUseItem2 = 103,
	GamePlay_CustomUseItem3 = 104,
	GamePlay_CustomUseItem4 = 105,
	GamePlay_CustomUseItem5 = 106,
	GamePlay_CustomUseItem6 = 107,
	GamePlay_CustomUseItem7 = 108,
	GamePlay_CustomUseItem8 = 109,
	GamePlay_End = 110,
	Dev_Begin = 111,
	Dev_AAFilterSize = 112,
	Dev_AACurrentFrameWeight = 113,
	Dev_AASamples = 114,
	Dev_TonemapperSharpen = 115,
	Dev_TemporalAAcatmullRom = 116,
	Dev_TemppralAApauseCorrect = 117,
	Dev_End = 118,
	ShowInventoryCharacter = 119,
	Version = 120,
	All = 121,
	End = 122,
	ESettingType_MAX = 123,
};

// Enum BravoHotelGame.EPlosiveSoundDetectionType
enum class EPlosiveSoundDetectionType : uint8_t {
	EPSDT_None = 0,
	EPSDT_Craft = 1,
	EPSDT_Capsule = 2,
	EPSDT_Skill = 3,
	EPSDT_MAX = 4,
};

// Enum BravoHotelGame.ELandingReason
enum class ELandingReason : uint8_t {
	LR_None = 0,
	LR_Jump = 1,
	LR_Descent = 2,
	LR_VehicleEscape = 3,
	LR_VehicleExit = 4,
	LR_VehicleCrash = 5,
	LR_VehicleAutoEscape = 6,
	LR_Parkour = 7,
	LR_RocketJump = 8,
	LR_Knockback = 9,
	LR_Stuntman = 10,
	LR_QuickLanding = 11,
	LR_Jetpack = 12,
	LR_MeteorJump = 13,
	LR_MAX = 14,
};

// Enum BravoHotelGame.ELeanState
enum class ELeanState : uint8_t {
	LS_Left = 0,
	LS_Middle = 1,
	LS_Right = 2,
	LS_MAX = 3,
};

// Enum BravoHotelGame.ItemWidgetDragType
enum class ItemWidgetDragType : uint8_t {
	ProximitySlot = 0,
	TransportSlot = 1,
	EquipSlot = 2,
	WeaponSlot = 3,
	AttachmentSlot = 4,
	RecipeSlot = 5,
	MaterialSlot = 6,
	ItemWidgetDragType_MAX = 7,
};

// Enum BravoHotelGame.EWearableItemType
enum class EWearableItemType : uint8_t {
	WIT_Hair = 0,
	WIT_Face = 1,
	WIT_Helmet = 2,
	WIT_Bag = 3,
	WIT_Armor = 4,
	WIT_GhillieSuit = 5,
	WIT_Hat = 6,
	WIT_Eyewear = 7,
	WIT_Mask = 8,
	WIT_Top = 9,
	WIT_Outer = 10,
	WIT_Gloves = 11,
	WIT_Bottom = 12,
	WIT_Shoes = 13,
	WIT_Parachute = 14,
	WIT_ParachuteBag = 16,
	WIT_Clipping = 17,
	WIT_Body = 18,
	WIT_None = 255,
	WIT_MAX = 256,
};

// Enum BravoHotelGame.ECharacterAbilityType
enum class ECharacterAbilityType : uint8_t {
	CAT_None = 0,
	CAT_MaxHP = 1,
	CAT_BoostHP = 2,
	CAT_MaxOxygen = 3,
	CAT_UseBreath = 4,
	CAT_MoveSpeed = 5,
	CAT_HealOfTime = 6,
	CAT_MaxCapacity = 7,
	CAT_ReloadSpeed = 8,
	CAT_BoltActionSpeed = 9,
	CAT_BoosterTime = 10,
	CAT_ExpBoost = 11,
	CAT_MaxSteady = 12,
	CAT_KnockOutHealth = 13,
	CAT_ADSSpeed = 14,
	CAT_ChangeWeaponSpeed = 15,
	CAT_RevivedHealth = 16,
	CAT_RevivingHealth = 17,
	CAT_ReviveSpeed = 18,
	CAT_ResuscitateSpeed = 19,
	CAT_ListeningRange = 20,
	CAT_ActSilently = 21,
	CAT_MoveWhileUsing = 22,
	CAT_BoostHealAmount = 23,
	CAT_HealTeamOne = 24,
	CAT_VehicleArmor = 25,
	CAT_ParkourSpeed = 26,
	CAT_VehicleEfficiency = 27,
	CAT_DamageReduceOwnBomb = 28,
	CAT_ProtectFlashBang = 29,
	CAT_IncressStun = 30,
	CAT_IncressFlameTime = 31,
	CAT_IncressFrameDamage = 32,
	CAT_ParachuteFallingSpeed = 33,
	CAT_IncressGrenadeBurstRange = 34,
	CAT_IncressHealLimit = 35,
	CAT_IncressAmplifierRange = 36,
	CAT_IncressHeartBeatSensorRange = 37,
	CAT_RocketJumpModifier = 38,
	CAT_GravityModifier = 39,
	CAT_LeftLeanAngleModifier = 40,
	CAT_RightLeanAngleModifier = 41,
	CAT_LeftLeanSpeedModifier = 42,
	CAT_RightLeanSpeedModifier = 43,
	CAT_SuperThrowingTrailViewDistance = 44,
	CAT_ShiningThrowProjectileViewDistance = 45,
	CAT_FindParachutesDistance = 46,
	CAT_BulletproofGlass = 47,
	CAT_HeatScanRange = 48,
	CAT_ReduceBuffCooltime = 49,
	CAT_MeteorJumpModifier = 50,
	CAT_IncressAirControl = 51,
	CAT_MAX = 52,
};

// Enum BravoHotelGame.EConditionType
enum class EConditionType : uint8_t {
	CT_None = 0,
	CT_Switch = 1,
	CT_RTPC = 2,
	CT_State = 3,
	CT_MAX = 4,
};

// Enum BravoHotelGame.EThrowingWeaponState
enum class EThrowingWeaponState : uint8_t {
	ETWS_Idle = 0,
	ETWS_TakeOut = 1,
	ETWS_Ready = 2,
	ETWS_Cook = 3,
	ETWS_Throw = 4,
	ETWS_Drop = 5,
	ETWS_Fire = 6,
	ETWS_MAX = 7,
};

// Enum BravoHotelGame.EFireType
enum class EFireType : uint8_t {
	FT_None = 0,
	FT_HipShot = 1,
	FT_AOS = 2,
	FT_ADS = 3,
	FT_AMP = 4,
	FT_HBS = 5,
	FT_MAX = 6,
};

// Enum BravoHotelGame.ECharacterState
enum class ECharacterState : uint8_t {
	CS_None = 0,
	CS_Battle = 1,
	CS_InAircraft = 2,
	CS_Descent = 3,
	CS_Parachuting = 4,
	CS_Knockout = 5,
	CS_Death = 6,
	CS_Driver = 7,
	CS_DriverPossessedPawn = 8,
	CS_Passenger1 = 9,
	CS_Passenger2 = 10,
	CS_Passenger3 = 11,
	CS_Passenger4 = 12,
	CS_Passenger5 = 13,
	CS_Ladder = 14,
	CS_CriticalTime = 15,
	CS_InAircraftCinematic = 16,
	CS_StartReady = 17,
	CS_EndReady = 18,
	CS_Max = 19,
};

// Enum BravoHotelGame.EGrenadeThrowingType
enum class EGrenadeThrowingType : uint8_t {
	EGTT_None = 0,
	EGTT_OverThrow = 1,
	EGTT_UnderThrow = 2,
	EGTT_MAX = 3,
};

// Enum BravoHotelGame.EWaterDepthType
enum class EWaterDepthType : uint8_t {
	WDT_NoWater = 0,
	WDT_Shallow = 1,
	WDT_NoProne = 2,
	WDT_NoCrouch = 3,
	WDT_SurfaceWater = 4,
	WDT_UnderWater = 5,
	WDT_MAX = 6,
};

// Enum BravoHotelGame.ECharacterBuffType
enum class ECharacterBuffType : uint8_t {
	CBT_None = 0,
	CBT_Booster = 2,
	CBT_Bandage = 4,
	CBT_OutOfSteady = 8,
	CBT_Reviving = 16,
	CBT_NoDamage = 32,
	CBT_MAX = 33,
};

// Enum BravoHotelGame.ESuperPeopleClass
enum class ESuperPeopleClass : uint8_t {
	ESPC_None = 0,
	ESPC_Gatling = 1,
	ESPC_SGMaster = 2,
	ESPC_StrikingForces = 3,
	ESPC_Sniper = 4,
	ESPC_Recon = 5,
	ESPC_Gas = 6,
	ESPC_Marine = 7,
	ESPC_Teleporter = 8,
	ESPC_SWAT = 9,
	ESPC_WeaponMaster = 10,
	ESPC_Nuclear = 11,
	ESPC_Driver = 12,
	ESPC_MAX = 13,
};

// Enum BravoHotelGame.ECharacterAudioEventType
enum class ECharacterAudioEventType : uint8_t {
	EquipWearable = 0,
	EquipAttachment = 1,
	EquipWeapon = 2,
	PickupBackpack = 3,
	PickupStartEvent = 4,
	PickupConsumables = 5,
	ECharacterAudioEventType_MAX = 6,
};

// Enum BravoHotelGame.EBattleRoyaleState
enum class EBattleRoyaleState : uint8_t {
	EBRS_None = 0,
	EBRS_Waiting = 1,
	EBRS_Ready = 2,
	EBRS_CheckStartPlay = 3,
	EBRS_Play = 4,
	EBRS_MatchEnd = 5,
	EBRS_MAX = 6,
};

// Enum BravoHotelGame.ECharacterGroundState
enum class ECharacterGroundState : uint8_t {
	CGS_None = 0,
	CGS_Stand = 1,
	CGS_Crouch = 2,
	CGS_Prone = 3,
	CGS_MAX = 4,
};

// Enum BravoHotelGame.EToggleWidgetModeType
enum class EToggleWidgetModeType : uint8_t {
	TWMT_None = 0,
	TWMT_Inventory = 1,
	TWMT_WorldMap = 2,
	TWMT_BlackMarket = 3,
	TWMT_SkillMap = 4,
	TWMT_MAX = 5,
};

// Enum BravoHotelGame.ETargetHealthType
enum class ETargetHealthType : uint8_t {
	ETHT_Casting = 0,
	ETHT_Inventory = 1,
	ETHT_Bandage = 2,
	ETHT_MAX = 3,
};

// Enum BravoHotelGame.EInteractionType
enum class EInteractionType : uint8_t {
	IT_None = 0,
	IT_Item = 1,
	IT_Door = 2,
	IT_Revive = 3,
	IT_Vehicle = 4,
	IT_DropBox = 5,
	IT_PersonalSupplyBox = 6,
	IT_PersonalSupplyBoxFailed = 7,
	IT_Elevator = 8,
	IT_Ladder = 9,
	IT_OnLadder = 10,
	IT_Resuscitation = 11,
	IT_Parachute = 12,
	IT_MeteorStrike = 13,
	IT_MAX = 14,
};

// Enum BravoHotelGame.EProjectileGrenadeState
enum class EProjectileGrenadeState : uint8_t {
	EPGS_Idle = 0,
	EPGS_Active = 1,
	EPGS_ActiveBoobyTrap = 2,
	EPGS_DestroyWithoutActive = 3,
	EPGS_ActiveByDamage = 4,
	EPGS_Deactive = 5,
	EPGS_MAX = 6,
};

// Enum BravoHotelGame.EInDoorAdjustmentTarget
enum class EInDoorAdjustmentTarget : uint8_t {
	IAT_None = 0,
	IAT_ThirdPersonCamera = 1,
	IAT_Audio_DEPRECATED = 2,
	IAT_PostProcess = 4,
	IAT_MAX = 5,
};

// Enum BravoHotelGame.EKeySettingType
enum class EKeySettingType : uint8_t {
	Key_Begin = 0,
	Key_MoveForward = 1,
	Key_MoveBack = 2,
	Key_MoveLeft = 3,
	Key_MoveRight = 4,
	Key_Walk = 5,
	Key_Sprint = 6,
	Key_Crouch = 7,
	Key_Prone = 8,
	Key_LeanRight = 9,
	Key_LeanLeft = 10,
	Key_Interaction = 11,
	Key_FPSOnly = 12,
	Key_ToggleAutoSprint = 13,
	Key_FreeLook = 14,
	Key_JumpParkour = 15,
	Key_Jump = 16,
	Key_Parkour = 17,
	Key_MoveUp = 18,
	Key_MoveDown = 19,
	Key_Fire = 20,
	Key_AltFire = 21,
	Key_AOS = 22,
	Key_ADS = 23,
	Key_Reload = 24,
	Key_ChangeWeaponUpside = 25,
	Key_ChangeWeaponDownside = 26,
	Key_WeapSlot_01 = 27,
	Key_WeapSlot_02 = 28,
	Key_WeapSlot_03 = 29,
	Key_WeapSlot_04 = 30,
	Key_WeapSlot_05 = 31,
	Key_ThrowWeapon = 32,
	Key_Fragment = 33,
	Key_Flashbang = 34,
	Key_Smoke = 35,
	Key_Molotove = 36,
	Key_ActiveSkill00 = 37,
	Key_CancleActiveSkill00 = 38,
	Key_ActiveSkill01 = 39,
	Key_DisArm = 40,
	Key_FireMode = 41,
	Key_ChangeThrowingMotion = 42,
	Key_CookThrowingWeapon = 43,
	Key_ZoomIn = 44,
	Key_ZoomOut = 45,
	Key_ZeroingDistanceUp = 46,
	Key_ZeroingDistanceDown = 47,
	Key_SteadyAim = 48,
	Key_UseTopRecoverItem = 49,
	Key_UseMediPack_Lv3 = 50,
	Key_UseMediPack_Lv2 = 51,
	Key_UseMediPack_Lv1 = 52,
	Key_BoostItemMenu = 53,
	Key_UseBoostItem = 54,
	Key_CustomUseItem = 55,
	Key_UseStrongPainkiller = 56,
	Key_UsePowerDrink = 57,
	Key_UseEnergyBar = 58,
	Key_UseTopSkillBook = 59,
	Key_UseRedBook = 60,
	Key_UseGreenBook = 61,
	Key_UseBlueBook = 62,
	Key_UseWhiteBook = 63,
	Key_UseBalckBook = 64,
	Key_VehicleMoveForward = 65,
	Key_VehicleMoveBack = 66,
	Key_VehicleMoveLeft = 67,
	Key_VehicleMoveRight = 68,
	Key_Handbrake = 69,
	Key_Nitro = 70,
	Key_VehicleHorn = 71,
	Key_VehicleSeat0 = 72,
	Key_VehicleSeat1 = 73,
	Key_VehicleSeat2 = 74,
	Key_VehicleSeat3 = 75,
	Key_VehicleSeat4 = 76,
	Key_WorldMap = 77,
	Key_MiniMap = 78,
	Key_Inventory = 79,
	Key_OptionMenu = 80,
	Key_SmartPing = 81,
	Key_OnlySmartPing = 82,
	Key_SmartPingMenu = 83,
	Key_SmartPingAgree = 84,
	Key_InsertMarker = 85,
	Key_DeleteMarker = 86,
	Key_AddMarker = 87,
	Key_SmartPingWorldMap = 88,
	Key_SmartPingMenuWorldMap = 89,
	Key_OnlySmartPingWorldMap = 90,
	Key_SmartPingAgreeWorldMap = 91,
	Key_RoutePing = 92,
	Key_DeleteRoutePing = 93,
	Key_InsertMarkerWorldMap = 94,
	Key_DeleteMarkerWorldMap = 95,
	Key_ToggleInGameHUD = 96,
	Key_ToggleGuideWidget = 97,
	Key_WorldMapMoveToPlayer = 98,
	Key_PushToTalk = 99,
	Key_MasterVolumeToggle = 100,
	Key_MasterVolumeUp = 101,
	Key_MasterVolumeDown = 102,
	Key_ShowNextPlayer = 103,
	Key_ShowPrePlayer = 104,
	Key_Combine01 = 105,
	Key_Combine02 = 106,
	Key_Combine03 = 107,
	Key_Combine04 = 108,
	Key_Combine05 = 109,
	Key_Combine06 = 110,
	Key_Combine07 = 111,
	Key_Combine08 = 112,
	Key_Combine09 = 113,
	Key_Combine10 = 114,
	Key_MK3DSpectatorPawn_SpeedUp = 115,
	Key_MK3DSpectatorPawn_SpeedDown = 116,
	Key_MK3DSpectatorPawn_ResetSpeed = 117,
	Key_MK3DReplayController_ReplayPause = 118,
	Key_MK3DReplayController_FreeCamera = 119,
	Key_MK3DReplayController_SetPlayerCameraForTargetInRecording = 120,
	Key_MK3DReplayController_IncreaseSpeedByIndex = 121,
	Key_MK3DReplayController_DecreaseSpeedByIndex = 122,
	Key_MK3DReplayController_GoToBeginTime = 123,
	Key_MK3DReplayController_GoToEndTime = 124,
	Key_MK3DReplayController_FindActorsByCursor = 125,
	Key_PlayerCamera = 126,
	Key_FollowCamera = 127,
	Key_TimeLineWidget = 128,
	Key_PlayerListWidget = 129,
	Key_PerkDeckWidget = 130,
	Key_ItemListWidget = 131,
	Key_MK3DSpectatorPawn_MoveForward = 132,
	Key_MK3DSpectatorPawn_MoveBack = 133,
	Key_MK3DSpectatorPawn_MoveLeft = 134,
	Key_MK3DSpectatorPawn_MoveRight = 135,
	Key_MK3DSpectatorPawn_MoveUp = 136,
	Key_MK3DSpectatorPawn_MoveDown = 137,
	Key_MK3DSpectatorPawn_Turn = 138,
	Key_MK3DSpectatorPawn_LookUp = 139,
	Key_End = 140,
	Key_MAX = 141,
};

// Enum BravoHotelGame.EWeaponAttachmentItem
enum class EWeaponAttachmentItem : uint8_t {
	WA_None = 0,
	WA_Sight_Basic = 1,
	WA_Sight_Reddot = 2,
	WA_Sight_Holo = 3,
	WA_Sight_2X = 4,
	WA_Sight_4X = 5,
	WA_Sight_8X = 6,
	WA_Sight_15X = 7,
	WA_Sight_Digital = 8,
	WA_Muzzle_AR_Silencer = 9,
	WA_Muzzle_AR_Compensator = 10,
	WA_Muzzle_AR_Suppressor = 11,
	WA_Muzzle_SMG_Silencer = 12,
	WA_Muzzle_SMG_Compensator = 13,
	WA_Muzzle_SMG_Suppressor = 14,
	WA_Muzzle_SR_Silencer = 15,
	WA_Muzzle_SR_Compensator = 16,
	WA_Muzzle_SR_Suppressor = 17,
	WA_Muzzle_Shotgun_Choke = 18,
	WA_Muzzle_Pistol_Silencer = 19,
	WA_Barrel_Basic = 20,
	WA_Barrel_Short = 21,
	WA_Barrel_Long = 22,
	WA_Mag_Basic = 23,
	WA_Mag_AR_QuickDraw = 24,
	WA_Mag_AR_Extended = 25,
	WA_Mag_AR_ExtendedQuickDraw = 26,
	WA_Mag_SMG_QuickDraw = 27,
	WA_Mag_SMG_Extended = 28,
	WA_Mag_SMG_ExtendedQuickDraw = 29,
	WA_Mag_SR_QuickDraw = 30,
	WA_Mag_SR_Extended = 31,
	WA_Mag_SR_ExtendedQuickDraw = 32,
	WA_Mag_Pistol_QuickDraw = 33,
	WA_Mag_Pistol_Extended = 34,
	WA_Mag_Pistol_ExtendedQuickDraw = 35,
	WA_Grip_Angled = 36,
	WA_Grip_Vertical = 37,
	WA_Stock_Shotgun_BulletLoops = 38,
	WA_Stock_SR_BulletLoops = 39,
	WA_Stock_SR_CheekPad = 40,
	WA_Stock_Tactical = 41,
	WA_Stock_MP = 42,
	WA_Perk01_Basic = 43,
	WA_Perk02_Basic = 44,
	WA_Perk03_Basic = 45,
	WA_Perk04_Basic = 46,
	WA_MAX = 47,
};

// Enum BravoHotelGame.ECustomMovementMode
enum class ECustomMovementMode : uint8_t {
	CMOVE_None = 0,
	CMOVE_Ragdoll = 1,
	CMOVE_Descent = 2,
	CMOVE_Drive = 3,
	CMOVE_Ladder = 4,
	CMOVE_Jetpack = 5,
	CMOVE_MAX = 6,
};

// Enum BravoHotelGame.EMouseSensitivityState
enum class EMouseSensitivityState : uint8_t {
	EMSS_None = 0,
	EMSS_Default = 1,
	EMSS_VehicleDriver = 2,
	EMSS_Targeting = 3,
	EMSS_Total = 4,
	EMSS_UsingDetail = 5,
	EMSS_ADS = 6,
	EMSS_2X = 7,
	EMSS_4X = 8,
	EMSS_6X = 9,
	EMSS_8X = 10,
	EMSS_15X = 11,
	EMSS_Vertical = 12,
	EMSS_MAX = 13,
};

// Enum BravoHotelGame.ECharacterConditionedAbilityType
enum class ECharacterConditionedAbilityType : uint8_t {
	CCAT_None = 0,
	CCAT_Searchable = 1,
	CCAT_DamageReduce = 2,
	CCAT_Armor = 3,
	CCAT_Durability = 4,
	CCAT_HorizontalRecoil = 5,
	CCAT_VerticalRecoil = 6,
	CCAT_MoveSpeed = 7,
	CCAT_Sway = 8,
	CCAT_DamageIncress = 9,
	CCAT_Post_DamageIncress = 10,
	CCAT_Accuracy = 11,
	CCAT_MovePenalty = 12,
	CCAT_ArmorDamage = 13,
	CCAT_HealAmount = 14,
	CCAT_UseSpeed = 15,
	CCAT_UseSpeedOnDamage = 16,
	CCAT_AdditionalItem = 17,
	CCAT_IncressRange = 18,
	CCAT_ReloadSpeed = 19,
	CCAT_ADSSpeed = 20,
	CCAT_RateOfFire = 21,
	CCAT_JumpHeight = 22,
	CCAT_DecressRampSpeedPenalty = 23,
	CCAT_LadderSpeed = 24,
	CCAT_LandedSpeed = 25,
	CCAT_DamageReduceOnBack = 26,
	CCAT_DamageReduceOnFront = 27,
	CCAT_IncressMazineCapacity = 28,
	CCAT_IncressBullet = 29,
	CCAT_DamageReduceOver200m = 30,
	CCAT_DamageReduceIn25m = 31,
	CCAT_DamageIncressBySpeed = 32,
	CCAT_Post_DamageIncressBySpeed = 33,
	CCAT_DamageReduceBySpeed = 34,
	CCAT_DamageIncressReverseSpeed = 35,
	CCAT_DamageReduceReverseSpeed = 36,
	CCAT_AirWalkDistance = 37,
	CCAT_DamageIncressBySnipeReady = 38,
	CCAT_DamageIncressByAntiAirFire = 39,
	CCAT_AutoAimWeight = 40,
	CCAT_AutoAimRadius = 41,
	CCAT_IncressThrowingWeaponDamage = 42,
	CCAT_IncressThrowingWeaponFireCount = 43,
	CCAT_IncressMaxCountFlashbangBoobyTrap = 44,
	CCAT_IncressRangeFlashbangBoobyTrap = 45,
	CCAT_IncressBurstCount = 46,
	CCAT_DamageIncressOnBlueZoneBorder = 47,
	CCAT_DamageReduceOnBlueZoneBorder = 48,
	CCAT_AdditionalConsumeAmmo = 49,
	CCAT_BoosterItemEffective = 50,
	CCAT_IncressThrowingWeaponHitDamage = 51,
	CCAT_IncressRangeMolotovCocktailBoobyTrap = 52,
	CCAT_IncressThrownRange = 53,
	CCAT_IncressThrownAnimSpeed = 54,
	CCAT_IncressFirePropagationLevel = 55,
	CCAT_IncressDeafenRange = 56,
	CCAT_InvisibleDamageIncress = 57,
	CCAT_InvisibleDamageReduce = 58,
	CCAT_MAX = 59,
};

// Enum BravoHotelGame.EPingType
enum class EPingType : uint8_t {
	PT_NoneTarget = 0,
	PT_Attack = 1,
	PT_Move = 2,
	PT_Item = 3,
	PT_Location = 4,
	PT_Vehicle = 5,
	PT_Support = 6,
	PT_SupplyBoxNoti = 7,
	PT_Caution = 8,
	PT_MenuEnd = 9,
	PT_Enemy = 10,
	PT_SkillEnemy = 11,
	PT_Ok = 12,
	PT_PersonalSupplyBox = 13,
	PT_Book = 14,
	PT_RequestResurrection = 15,
	PT_Material = 16,
	PT_Custom = 17,
	PT_MAX = 18,
};

// Enum BravoHotelGame.ELogTag
enum class ELogTag : uint8_t {
	LT_None = 0,
	LT_SmartPing = 1,
	LT_MAX = 2,
};

// Enum BravoHotelGame.ELoadingScreenType
enum class ELoadingScreenType : uint8_t {
	LST_None = 0,
	LST_First = 1,
	LST_Default = 2,
	LST_World = 3,
	LST_Lobby = 4,
	LST_RePlay = 5,
	LST_Move = 6,
	LST_Tutorial = 7,
	LST_TutorialOut = 8,
	LST_MAX = 9,
};

// Enum BravoHotelGame.EHUDMessageType
enum class EHUDMessageType : uint8_t {
	HMT_BlueZoneDesc = 0,
	HMT_BlueZoneName = 1,
	HMT_GameCountDown = 2,
	HMT_GameCountDownNum = 3,
	HMT_GameStartMessage = 4,
	HMT_ChangeClassInfo = 5,
	HMT_KillMessage = 6,
	HMT_KillCount = 7,
	HMT_LevelUpMessage = 8,
	HMT_WarningMessage = 9,
	HMT_SupplyMessage = 10,
	HMT_BroadcastMessage = 11,
	HMT_TeamKillWarning = 12,
	HMT_ActionDescription = 13,
	HMT_Action = 14,
	HMT_CastingMessage = 15,
	HMT_CastingCount = 16,
	HMT_CastingCancelInfo = 17,
	HMT_ActionMessage = 18,
	HMT_CoreInfo = 19,
	HMT_ZeroingDistance = 20,
	HMT_PlayerReportInfo = 21,
	HMT_SpectatorCount = 22,
	HMT_PlayerInfo = 23,
	HMT_RoundOverInfo = 24,
	HMT_RoundOver = 25,
	HMT_GuideWidget = 26,
	HMT_Resuscitating = 27,
	HMT_RequestMessage = 28,
	HMT_EndResuscitated = 29,
	HMT_ItemCancelMessage = 30,
	HMT_End = 31,
	HMT_MAX = 32,
};

// Enum BravoHotelGame.EHUDMessageTableType
enum class EHUDMessageTableType : uint8_t {
	HMTT_Waiting = 0,
	HMTT_Playing = 1,
	HMTT_Spectating = 2,
	HMTT_MatchEnd = 3,
	HMTT_MAX = 4,
};

// Enum BravoHotelGame.EPresenceState
enum class EPresenceState : uint8_t {
	PS_Offline = 0,
	PS_Online = 1,
	PS_Ingame = 2,
	PS_MAX = 3,
};

// Enum BravoHotelGame.ERandomType
enum class ERandomType : uint8_t {
	RT_None = 0,
	RT_Package = 1,
	RT_PickOne = 2,
	RT_MAX = 3,
};

// Enum BravoHotelGame.EKeySettingSubType
enum class EKeySettingSubType : uint8_t {
	None = 0,
	Normal = 1,
	Battle = 2,
	ScopeMode = 3,
	Throw = 4,
	Item = 5,
	Vehicle = 6,
	VehicleSeat = 7,
	UI = 8,
	Swimming = 9,
	SmartPing = 10,
	SmartPingWorldMap = 11,
	SmartPingMenu = 12,
	Voice = 13,
	Spectate = 14,
	Replay = 15,
	EKeySettingSubType_MAX = 16,
};

// Enum BravoHotelGame.ESlotType
enum class ESlotType : uint8_t {
	Slider = 0,
	ComboBox = 1,
	Select = 2,
	KeyInput = 3,
	Button = 4,
	ESlotType_MAX = 5,
};

// Enum BravoHotelGame.ESettingBigType
enum class ESettingBigType : uint8_t {
	Graphic = 0,
	Audio = 1,
	Key = 2,
	Control = 3,
	GamePlay = 4,
	Dev = 5,
	ESettingBigType_MAX = 6,
};

// Enum BravoHotelGame.EPersonalSupplyBoxPingType
enum class EPersonalSupplyBoxPingType : uint8_t {
	PPT_None = 0,
	PPT_Opened = 1,
	PPT_NotOpen = 2,
	PPT_MAX = 3,
};

// Enum BravoHotelGame.CheatParamType
enum class CheatParamType : uint8_t {
	CPT_Intger = 0,
	CPT_Float = 1,
	CPT_String = 2,
	CPT_Bool = 3,
	CPT_MAX = 4,
};

// Enum BravoHotelGame.EItemPingIconType
enum class EItemPingIconType : uint8_t {
	IPIT_None = 0,
	IPIT_GUN = 1,
	IPIT_Melee = 2,
	IPIT_Grenade = 3,
	IPIT_Equipment = 4,
	IPIT_WearItem = 5,
	IPIT_Attachment = 6,
	IPIT_Recover = 7,
	IPIT_Armor = 8,
	IPIT_MAX = 9,
};

// Enum BravoHotelGame.EWeaponFireMode
enum class EWeaponFireMode : uint8_t {
	EFM_Single = 0,
	EFM_Burst = 1,
	EFM_Auto = 2,
	EFM_MAX = 3,
};

// Enum BravoHotelGame.ELoadingType
enum class ELoadingType : uint8_t {
	ELT_Magazine = 0,
	ELT_OneByOne = 1,
	ELT_OneByOne_StripperClip = 2,
	ELT_MAX = 3,
};

// Enum BravoHotelGame.EWeaponAttachmentBarrel
enum class EWeaponAttachmentBarrel : uint8_t {
	WA_Barrel_Basic = 0,
	WA_Barrel_Short = 1,
	WA_Barrel_Long = 2,
	WA_Barrel_MAX = 3,
};

// Enum BravoHotelGame.EWeaponAttachmentMuzzleDevice
enum class EWeaponAttachmentMuzzleDevice : uint8_t {
	WA_Muzzle_Basic = 0,
	WA_Muzzle_AR_Silencer = 1,
	WA_Muzzle_AR_Compensator = 2,
	WA_Muzzle_AR_Suppressor = 3,
	WA_Muzzle_SMG_Silencer = 4,
	WA_Muzzle_SMG_Compensator = 5,
	WA_Muzzle_SMG_Suppressor = 6,
	WA_Muzzle_SR_Silencer = 7,
	WA_Muzzle_SR_Compensator = 8,
	WA_Muzzle_SR_Suppressor = 9,
	WA_Muzzle_Shotgun_Choke = 10,
	WA_Muzzle_Pistol_Silencer = 11,
	WA_Muzzle_MAX = 12,
};

// Enum BravoHotelGame.EWeaponAttachmentStock
enum class EWeaponAttachmentStock : uint8_t {
	WA_Stock_Basic = 0,
	WA_Stock_Shotgun_BulletLoops = 1,
	WA_Stock_SR_BulletLoops = 2,
	WA_Stock_SR_CheekPad = 3,
	WA_Stock_Tactical = 4,
	WA_Stock_MP = 5,
	WA_Stock_MAX = 6,
};

// Enum BravoHotelGame.EWeaponAttachmentMagazine
enum class EWeaponAttachmentMagazine : uint8_t {
	WA_Mag_None = 0,
	WA_Mag_Basic = 1,
	WA_Mag_AR_QuickDraw = 2,
	WA_Mag_AR_Extended = 3,
	WA_Mag_AR_ExtendedQuickDraw = 4,
	WA_Mag_SMG_QuickDraw = 5,
	WA_Mag_SMG_Extended = 6,
	WA_Mag_SMG_ExtendedQuickDraw = 7,
	WA_Mag_SR_QuickDraw = 8,
	WA_Mag_SR_Extended = 9,
	WA_Mag_SR_ExtendedQuickDraw = 10,
	WA_Mag_Pistol_QuickDraw = 11,
	WA_Mag_Pistol_Extended = 12,
	WA_Mag_Pistol_ExtendedQuickDraw = 13,
	WA_Mag_MAX = 14,
};

// Enum BravoHotelGame.EWeaponAttachmentGrip
enum class EWeaponAttachmentGrip : uint8_t {
	WA_Grip_Basic = 0,
	WA_Grip_Angled = 1,
	WA_Grip_Vertical = 2,
	WA_Grip_MAX = 3,
};

// Enum BravoHotelGame.EWeaponAttachmentType
enum class EWeaponAttachmentType : uint8_t {
	WAT_None = 0,
	WAT_Sight = 1,
	WAT_MuzzleDevice = 2,
	WAT_Stock = 3,
	WAT_Grip = 4,
	WAT_Magazine = 5,
	WAT_Barrel = 6,
	WAT_TacticalAttachment = 7,
	WAT_Body = 8,
	WAT_Perk01 = 9,
	WAT_Perk02 = 10,
	WAT_Perk03 = 11,
	WAT_Perk04 = 12,
	WAT_Max = 13,
};

// Enum BravoHotelGame.EWeaponAttachmentUseType
enum class EWeaponAttachmentUseType : uint8_t {
	WAU_NotUse = 0,
	WAU_Use = 1,
	WAU_UseFixed = 2,
	WAU_MAX = 3,
};

// Enum BravoHotelGame.EThrowingWeaponType
enum class EThrowingWeaponType : uint8_t {
	ETWT_None = 0,
	ETWT_Grenade_Frag = 1,
	ETWT_Grenade_Smoke = 2,
	ETWT_Grenade_Flash = 3,
	ETWT_Grenade_Molotov = 4,
	ETWT_Greande_Max = 5,
	ETWT_MAX = 6,
};

// Enum BravoHotelGame.EGuideWidgetType
enum class EGuideWidgetType : uint8_t {
	GWT_Parachuting = 0,
	GWT_Ladder = 1,
	GWT_Descent = 2,
	GWT_Swim = 3,
	GWT_Drive = 4,
	GWT_ADS = 5,
	GWT_ADSZoom = 6,
	GWT_WorldMap = 7,
	GWT_Spectate = 8,
	GWT_SmartPing = 9,
	GWT_UseItem = 10,
	GWT_MAX = 11,
};

// Enum BravoHotelGame.EBravoHotel_ZipUtilityCompressionFormat
enum class EBravoHotel_ZipUtilityCompressionFormat : uint8_t {
	BP_COMPRESSION_FORMAT_UNKNOWN = 0,
	BP_COMPRESSION_FORMAT_SEVEN_ZIP = 1,
	BP_COMPRESSION_FORMAT_ZIP = 2,
	BP_COMPRESSION_FORMAT_GZIP = 3,
	BP_COMPRESSION_FORMAT_BZIP2 = 4,
	BP_COMPRESSION_FORMAT_RAR = 5,
	BP_COMPRESSION_FORMAT_TAR = 6,
	BP_COMPRESSION_FORMAT_ISO = 7,
	BP_COMPRESSION_FORMAT_CAB = 8,
	BP_COMPRESSION_FORMAT_LZMA = 9,
	BP_COMPRESSION_FORMAT_LZMA86 = 10,
	BP_COMPRESSION_FORMAT_MAX = 11,
};

// Enum BravoHotelGame.EAudioSettingType
enum class EAudioSettingType : uint8_t {
	Master = 0,
	Music = 1,
	VoiceInput = 2,
	VoiceOutput = 3,
	Effect = 4,
	Embient = 5,
	UI = 6,
	EAudioSettingType_MAX = 7,
};

// Enum BravoHotelGame.EBeginReportWidgetType
enum class EBeginReportWidgetType : uint8_t {
	BRWT_None = 0,
	BRWT_MatchEnd_Ranking = 1,
	BRWT_Spectator_Hud = 2,
	BRWT_Replay_Timeline = 3,
	BRWT_MAX = 4,
};

// Enum BravoHotelGame.EGameExitType
enum class EGameExitType : uint8_t {
	EGET_None = 0,
	EGET_Lobby = 1,
	EGET_Exit = 2,
	EGET_MAX = 3,
};

// Enum BravoHotelGame.ELobbyExitType
enum class ELobbyExitType : uint8_t {
	ELET_None = 0,
	ELET_Game = 1,
	ELET_Replay = 2,
	ELET_TutorialPlay = 3,
	ELET_Exit = 4,
	ELET_MAX = 5,
};

// Enum BravoHotelGame.EReportType
enum class EReportType : uint8_t {
	RT_None = 0,
	RT_Report = 1,
	RT_Replay = 2,
	RT_DeathCam = 3,
	RT_Spectator = 4,
	RT_MAX = 5,
};

// Enum BravoHotelGame.ENormalType
enum class ENormalType : uint8_t {
	None = 0,
	RankPoint = 1,
	KillPoint = 2,
	DMGPoint = 3,
	SurvivalPoint = 4,
	SupplyBoxOpen = 5,
	DropCoin = 6,
	AcquireCoin = 7,
	DropRecipe = 8,
	AcquireRecipe = 9,
	ChangeDeck = 10,
	Resuscitation = 11,
	RequestResuscitation = 12,
	RandomGold = 13,
	RandomRankGold = 14,
	SelectDeckMode = 15,
	ChangeDeckList = 16,
	ENormalType_MAX = 17,
};

// Enum BravoHotelGame.EDevelopmentStatus
enum class EDevelopmentStatus : uint8_t {
	DP_InProgress = 0,
	DP_Done = 1,
	DP_Release = 2,
	DP_MAX = 3,
};

// Enum BravoHotelGame.ERewardChangeType
enum class ERewardChangeType : uint8_t {
	RT_DoNotReward = 0,
	RT_Reward = 1,
	RT_MAX = 2,
};

// Enum BravoHotelGame.EItemRarity
enum class EItemRarity : uint8_t {
	Level_None = 0,
	Level_1 = 0,
	Level_2 = 1,
	Level_3 = 2,
	Level_4 = 3,
	Level_5 = 4,
	Level_6 = 5,
	Level_7 = 6,
	Level_8 = 7,
	Level_9 = 8,
	Level_10 = 9,
	Level_11 = 10,
	Level_MAX = 11,
};

// Enum BravoHotelGame.EGenderType
enum class EGenderType : uint8_t {
	GT_None = 0,
	GT_Male = 1,
	GT_Female = 2,
	GT_ALL = 3,
	GT_MAX = 4,
};

// Enum BravoHotelGame.EItemLifeTimeType
enum class EItemLifeTimeType : uint8_t {
	ILTT_None = 0,
	ILTT_Etheral = 1,
	ILTT_LimitTime = 2,
	ILTT_LimitCount = 3,
	ILTT_LimitTimeCount = 4,
	ILTT_MAX = 5,
};

// Enum BravoHotelGame.EConsumablesItemType
enum class EConsumablesItemType : uint8_t {
	CON_Kitmid = 0,
	CON_Kitbig = 1,
	CON_Energybar = 2,
	CON_Powerdrink = 3,
	CON_Painkiller = 4,
	CON_Perk = 5,
	CON_Safety = 6,
	CON_Package = 7,
	CON_Plastic = 8,
	CON_Aluminium = 9,
	CON_Wood = 10,
	CON_Bolt = 11,
	CON_Coin = 12,
	CON_None = 255,
	CON_MAX = 256,
};

// Enum BravoHotelGame.EItemType
enum class EItemType : uint8_t {
	IT_None = 0,
	IT_Medical = 1,
	IT_Weapon = 2,
	IT_WeaponAttachment = 3,
	IT_Wearable = 4,
	IT_Ammo = 5,
	IT_Vehicle = 6,
	IT_Chest = 7,
	IT_Usable = 8,
	IT_Material = 9,
	IT_Recipe = 10,
	IT_Skin = 11,
	IT_Unknown = 12,
	IT_MAX = 13,
};

// Enum BravoHotelGame.EResultUIType
enum class EResultUIType : uint8_t {
	Simple = 0,
	Team = 1,
	Match = 2,
	EResultUIType_MAX = 3,
};

// Enum BravoHotelGame.EPlayerState
enum class EPlayerState : uint8_t {
	PS_None = 0,
	PS_Spawn = 1,
	PS_Waiting = 2,
	PS_InAircraft_Waiting = 3,
	PS_InAircraft_Ready = 4,
	PS_Descent = 5,
	PS_Parachuting = 6,
	PS_Playing = 7,
	PS_Death = 8,
	PS_Spectating = 9,
	PS_MatchEnd = 10,
	PS_TeamEnd = 11,
	PS_Respawn = 12,
	PS_MAX = 13,
};

// Enum BravoHotelGame.EItemSpawnPriorityType
enum class EItemSpawnPriorityType : uint8_t {
	ISPT_Important = 0,
	ISPT_UnImportant = 1,
	ISPT_Force = 2,
	ISPT_MAX = 3,
};

// Enum BravoHotelGame.ESpectatingMode
enum class ESpectatingMode : uint8_t {
	SM_None = 0,
	SM_Solo = 1,
	SM_Team = 2,
	SM_OtherTeam = 3,
	SM_Free = 4,
	SM_MAX = 5,
};

// Enum BravoHotelGame.EPlayerBehavior
enum class EPlayerBehavior : uint8_t {
	PB_KnockDown = 0,
	PB_Alive = 1,
	PB_Death = 2,
	PB_Vehicle = 3,
	PB_AirCraft = 4,
	PB_Parachute = 5,
	PB_Disconnect = 6,
	PB_CriticalTime = 7,
	PB_MAX = 8,
};

// Enum BravoHotelGame.EPromotionCondition
enum class EPromotionCondition : uint8_t {
	PC_RankRate = 0,
	PC_MAX = 1,
};

// Enum BravoHotelGame.EProjectileBehavior
enum class EProjectileBehavior : uint8_t {
	PB_Bounce_Only = 0,
	PB_Penetrate_Only = 1,
	PB_Bounce_And_Penetrate = 2,
	PB_MAX = 3,
};

// Enum BravoHotelGame.EQuestTaskType
enum class EQuestTaskType : uint8_t {
	None = 0,
	Dummy = 1,
	Kill = 2,
	PickUp = 3,
	UseItem = 4,
	Combine = 5,
	ActiveSkill = 6,
	Weapon = 7,
	Map = 8,
	Inventory = 9,
	PersonalSupplyOpen = 10,
	EQuestTaskType_MAX = 11,
};

// Enum BravoHotelGame.EVehicleState
enum class EVehicleState : uint8_t {
	Spawned = 1,
	Standby = 2,
	Idle = 3,
	Driving = 4,
	Holding = 5,
	Flooded = 6,
	Exploded = 7,
	Disabled = 8,
	EVehicleState_MAX = 9,
};

// Enum BravoHotelGame.EQuestState
enum class EQuestState : uint8_t {
	QS_None = 0,
	QS_Ready = 1,
	QS_Progress = 2,
	QS_Complete = 3,
	QS_MAX = 4,
};

// Enum BravoHotelGame.EDediGameCheatType
enum class EDediGameCheatType : uint8_t {
	EGCT_None = 0,
	EGCT_UnlockRoomLimit = 1,
	EGCT_MAX = 2,
};

// Enum BravoHotelGame.EMatchingType
enum class EMatchingType : uint8_t {
	MT_Unknown = 0,
	MT_Solo = 1,
	MT_Duo = 2,
	MT_Squad = 4,
	MT_MAX = 5,
};

// Enum BravoHotelGame.EGameViewType
enum class EGameViewType : uint8_t {
	GVT_Unknown = 0,
	GVT_TPP = 1,
	GVT_FPP = 2,
	GVT_MAX = 3,
};

// Enum BravoHotelGame.ELoginType
enum class ELoginType : uint8_t {
	LT_Name = 0,
	LT_Account = 1,
	LT_Geegee = 2,
	LT_Steam = 3,
	LT_GeegeeWithSteam = 4,
	LT_MAX = 5,
};

// Enum BravoHotelGame.EGameMode
enum class EGameMode : uint8_t {
	GM_BattleRoyale = 0,
	GM_DeathMatch = 1,
	GM_BattleRoyale_DEV = 2,
	GM_BattleRoyale_QA = 3,
	GM_BattleRoyale_STAGING = 4,
	GM_MAX = 5,
};

// Enum BravoHotelGame.EBluseZoneState
enum class EBluseZoneState : uint8_t {
	EBRS_None = 0,
	EBZS_SurvivalCircleLulled = 1,
	EBRS_SurvivalCircleShrinking = 2,
	EBRS_Delay = 3,
	EBluseZoneState_MAX = 4,
};

// Enum BravoHotelGame.EWorldMapAreaWidgetType
enum class EWorldMapAreaWidgetType : uint8_t {
	WAWT_RedZone = 0,
	WAWT_Nuclear = 1,
	WAWT_FindLandingPosition = 2,
	WAWT_FindLandingPositionTry = 3,
	WAWT_SearchInstinct = 4,
	WAWT_VehicleSearch = 5,
	WAWT_SpatialSense = 6,
	WAWT_CarScan = 7,
	WAWT_CarScanTry = 8,
	WAWT_UltimateVehicle = 9,
	WAWT_NitroBoom = 10,
	WAWT_TransportAircraft = 11,
	WAWT_TransportDropBox = 12,
	WAWT_MaterialItem = 13,
	WAWT_LocalPing = 14,
	WAWT_ExpertWeaponItem = 15,
	WAWT_Amplifier = 16,
	WAWT_HeartBeatSensor = 17,
	WAWT_Trap = 18,
	WAWT_Craft = 19,
	WAWT_Capsule = 20,
	WAWT_Skill = 21,
	WAWT_MAX = 22,
};

// Enum BravoHotelGame.EBroadCastTeamType
enum class EBroadCastTeamType : uint8_t {
	None = 0,
	Enemy = 1,
	Friendly = 2,
	Me = 3,
	EBroadCastTeamType_MAX = 4,
};

// Enum BravoHotelGame.EBroadCastKillMessageType
enum class EBroadCastKillMessageType : uint8_t {
	None = 0,
	Kill = 1,
	Knockout = 2,
	Resuscitated = 3,
	Kicked = 4,
	EBroadCastKillMessageType_MAX = 5,
};

// Enum BravoHotelGame.EStatupAnimType
enum class EStatupAnimType : uint8_t {
	SAT_None = 0,
	SAT_Weapon1 = 1,
	SAT_Weapon2 = 2,
	SAT_Helmet = 3,
	SAT_Armor = 4,
	SAT_Bag = 5,
	SAT_MAX = 6,
};

// Enum BravoHotelGame.ESceneType
enum class ESceneType : uint8_t {
	Scene_Begin = 0,
	Scene_GammaSettings = 1,
	Scene_CompanyLogo = 2,
	Scene_SupportProgram = 3,
	Scene_OpeningMovie = 4,
	Scene_Login = 5,
	Scene_TermsConditions = 6,
	Scene_CreateCharacter = 7,
	Scene_StartScenarioMode = 8,
	Scene_TutorialMovie = 9,
	Scene_PlayTutorial = 10,
	Scene_Lobby = 11,
	Scene_End = 12,
	Scene_MAX = 13,
};

// Enum BravoHotelGame.ELoginFlow
enum class ELoginFlow : uint8_t {
	Flow_Begin = 0,
	Flow_Catalogue = 1,
	Flow_WaitingTicket = 2,
	Flow_ServicePlatform = 3,
	Flow_End = 4,
	Flow_MAX = 5,
};

// Enum BravoHotelGame.ESteamPresenceState
enum class ESteamPresenceState : uint8_t {
	Online = 0,
	Offline = 1,
	Away = 2,
	ExtendedAway = 3,
	DoNotDisturb = 4,
	Chat = 5,
	ESteamPresenceState_MAX = 6,
};

// Enum BravoHotelGame.EVehicleWheelType
enum class EVehicleWheelType : uint8_t {
	VWT_Ground = 0,
	VWT_Water = 1,
	VWT_Wrecked = 2,
	_COUNT_ = 3,
	EVehicleWheelType_MAX = 4,
};

// Enum BravoHotelGame.EWeaponAnimationType
enum class EWeaponAnimationType : uint8_t {
	EWAT_Unarmed = 0,
	EWAT_AssaultRifle = 1,
	EWAT_SMG = 2,
	EWAT_SniperRifle = 3,
	EWAT_Shotgun = 4,
	EWAT_Pistol = 5,
	EWAT_ThrowingWeapon = 6,
	EWAT_Amplifier = 7,
	EWAT_MeleeWeapon = 8,
	EWAT_HeartBeatSensor = 9,
	EWAT_MAX = 10,
};

// Enum BravoHotelGame.EWeaponState
enum class EWeaponState : uint8_t {
	EWS_Idle = 0,
	EWS_Firing = 1,
	EWS_Reloading = 2,
	EWS_BoltAction = 3,
	EWS_Equipping = 4,
	EWS_MAX = 5,
};

// Enum BravoHotelGame.EWeaponAttachmentMagazineType
enum class EWeaponAttachmentMagazineType : uint8_t {
	WA_Mag_None = 0,
	WA_Mag_QuickDraw = 1,
	WA_Mag_Extended = 2,
	WA_Mag_ExtendedQuickDraw = 3,
	WA_Mag_MAX = 4,
};

// Enum BravoHotelGame.EWeaponRecoilType
enum class EWeaponRecoilType : uint8_t {
	EWRT_2 = 0,
	EWRT_3 = 1,
	EWRT_MAX = 2,
};

// Enum BravoHotelGame.ETeamType
enum class ETeamType : uint8_t {
	None = 0,
	UserOnly = 1,
	AIOnly = 2,
	All = 3,
	ETeamType_MAX = 4,
};

// Enum BravoHotelGame.EBattleRoyalTeamState
enum class EBattleRoyalTeamState : uint8_t {
	None = 0,
	Alive = 1,
	Ranked = 2,
	EBattleRoyalTeamState_MAX = 3,
};

// Enum BravoHotelGame.EBoxStateType
enum class EBoxStateType : uint8_t {
	None = 0,
	Show = 1,
	Opened = 2,
	Closed = 3,
	Hide = 4,
	EBoxStateType_MAX = 5,
};

// Enum BravoHotelGame.EAssignReason
enum class EAssignReason : uint8_t {
	None = 0,
	WithTeam = 1,
	MinMax = 2,
	InMax = 3,
	All = 4,
	EAssignReason_MAX = 5,
};

// Enum BravoHotelGame.EPersonalSupplyBoxState
enum class EPersonalSupplyBoxState : uint8_t {
	None = 0,
	Unassigned = 1,
	Assigned = 2,
	Opened = 3,
	TakeSome = 4,
	TakeItAll = 5,
	EPersonalSupplyBoxState_MAX = 6,
};

// Enum BravoHotelGame.ECharacterClassFlag
enum class ECharacterClassFlag : uint8_t {
	CCF_None = 0,
	CCF_Novice = 1,
	CCF_Shooter = 2,
	CCF_Survivor = 4,
	CCF_Assault = 8,
	CCF_Medic = 16,
	CCF_Scout = 32,
	CCF_Demolition = 64,
	CCF_SuperRookie = 128,
	CCF_All = 255,
	CCF_MAX = 256,
};

// Enum BravoHotelGame.ECharacterMovmentStateType
enum class ECharacterMovmentStateType : uint8_t {
	CMST_None = 0,
	CMST_ProneWalk = 1,
	CMST_ProneRun = 2,
	CMST_ProneSprint = 3,
	CMST_CrouchWalk = 4,
	CMST_CrouchRun = 5,
	CMST_CrouchSprint = 6,
	CMST_StandWalk = 7,
	CMST_StandRun = 8,
	CMST_StandSprint = 9,
	CMST_Moving = 10,
	CMST_Jump = 11,
	CMST_Swim = 12,
	CMST_Using = 13,
	CMST_Reviving = 14,
	CMST_Resuscitating = 15,
	CMST_Vehicle = 16,
	CMST_Reload = 17,
	CMST_FullAttachment = 18,
	CMST_Firing = 19,
	CMST_LeftLean = 20,
	CMST_RightLean = 21,
	CMST_KnockOut = 22,
	CMST_HeadBanging = 23,
	CMST_Burning = 24,
	CMST_MAX = 25,
};

// Enum BravoHotelGame.EBuffTargetType
enum class EBuffTargetType : uint8_t {
	BTT_Character = 0,
	BTT_Vehicle = 1,
	BTT_Weapon = 2,
	BTT_MAX = 3,
};

// Enum BravoHotelGame.EAbilityCombineType
enum class EAbilityCombineType : uint8_t {
	ACT_None = 0,
	ACT_Plus = 1,
	ACT_Multiply = 2,
	ACT_PercentPluse = 3,
	ACT_PercentMultiply = 4,
	ACT_PercentMinusMultiply = 5,
	ACT_MAX = 6,
};

// Enum BravoHotelGame.ESoundCondition
enum class ESoundCondition : int32_t {
	SC_Local = 1,
	SC_WeaponModel = 2,
	SC_Water = 4,
	SC_WeaponADS = 8,
	SC_FoleyType = 16,
	SC_BulletType = 32,
	SC_VehicleImpactType = 64,
	SC_VehicleImpulse = 128,
	SC_DamageType = 256,
	SC_DamageAmount = 512,
	SC_AmbienceType = 1024,
	SC_AmbienceSpace = 2048,
	SC_Surface = 4096,
	SC_WeaponSilencer = 8192,
	SC_CharacterState = 16384,
	SC_WeaponFireRate = 32768,
	SC_FootstepType = 65536,
	SC_BushLoudness = 131072,
	SC_CharacterType = 262144,
	SC_ActSilently = 524288,
	SC_MysterySlate = 1048576,
	SC_EnergyBar = 2097152,
	SC_MAX = 2097153,
};

// Enum BravoHotelGame.EAppAudioState
enum class EAppAudioState : uint8_t {
	Normal = 0,
	Cinematic = 1,
	Loading = 2,
	Menu = 3,
	Background = 4,
	Tutorial = 5,
	EAppAudioState_MAX = 6,
};

// Enum BravoHotelGame.EIndoorConditionTargets
enum class EIndoorConditionTargets : uint8_t {
	Character = 1,
	Weapon = 2,
	All = 3,
	EIndoorConditionTargets_MAX = 4,
};

// Enum BravoHotelGame.EOcclusionMethod
enum class EOcclusionMethod : uint8_t {
	Adaptive = 0,
	Absolute = 1,
	Legacy = 2,
	EOcclusionMethod_MAX = 3,
};

// Enum BravoHotelGame.ECrosshairPosition
enum class ECrosshairPosition : uint8_t {
	CP_Left = 0,
	CP_Top = 1,
	CP_Right = 2,
	CP_Bottom = 3,
	CP_Center = 4,
	__COUNT__ = 5,
	ECrosshairPosition_MAX = 6,
};

// Enum BravoHotelGame.EContentsType
enum class EContentsType : uint8_t {
	ECT_None = 0,
	ECT_GameInfo = 1,
	ECT_CharacterInfo = 2,
	ECT_Matching_RP_Info = 3,
	ECT_SupplyBox_Spawn = 4,
	ECT_Bulezone_Info = 5,
	ECT_Transport_Info = 6,
	ECT_Redzone_Info = 7,
	ECT_Vehicle_Spawn_Info = 8,
	ECT_Item_Spawn_Info = 9,
	ECT_LogIn = 10,
	ECT_LobbyReady = 11,
	ECT_MatchIn = 12,
	ECT_LogOut = 13,
	ECT_LogAbusing = 14,
	ECT_LogKickedUsers = 15,
	ECT_MAX = 16,
};

// Enum BravoHotelGame.EReportIndex
enum class EReportIndex : uint8_t {
	RI_None = 0,
	RI_ImproperName = 1,
	RI_CheatProgram = 2,
	RI_DisruptionGame = 3,
	RI_AbnormalBehavior = 4,
	RI_MAX = 5,
};

// Enum BravoHotelGame.ERecipeSearchType
enum class ERecipeSearchType : uint8_t {
	RST_None = 0,
	RST_Auto = 1,
	RST_Select = 2,
	RST_MAX = 3,
};

// Enum BravoHotelGame.EItemLogType
enum class EItemLogType : uint8_t {
	None = 0,
	Division = 1,
	TrySpawn = 2,
	Spawned = 3,
	Gain = 4,
	RateDivision = 5,
	RateDelete = 6,
	Max = 7,
};

// Enum BravoHotelGame.EDataItemType
enum class EDataItemType : uint8_t {
	DIT_None = 0,
	DIT_Book = 1,
	DIT_Booster = 2,
	DIT_Medical = 3,
	DIT_MAX = 4,
};

// Enum BravoHotelGame.EClientGameContentsType
enum class EClientGameContentsType : uint8_t {
	CGCT_None = 0,
	CGCT_Change_Class = 1,
	CGCT_Weapon_Equip = 2,
	CGCT_Item_Pickup = 3,
	CGCT_Exchange_Parts = 4,
	CGCT_Weapon_UnEquip = 5,
	CGCT_Item_Drop = 6,
	CGCT_Recovery_Item_Use = 7,
	CGCT_EnergyBar_Item_Use = 8,
	CGCT_Recipe_Item_Search = 9,
	CGCT_Recipe_Item_Combine = 10,
	CGCT_Player_LevelUp = 11,
	CGCT_SupplyBox_Open = 12,
	CGCT_SupplyBox_Change = 13,
	CGCT_Hited_Player = 14,
	CGCT_Hit_Player = 15,
	CGCT_KnockDowned_Player = 16,
	CGCT_KnockDown_Player = 17,
	CGCT_Death_Player = 18,
	CGCT_Kill_Player = 19,
	CGCT_Hit_Rate = 20,
	CGCT_Revival_Player = 21,
	CGCT_GoldenTime_Start_Player = 22,
	CGCT_GoldenTime_Revival_Player = 23,
	CGCT_CoolTime_Skill = 24,
	CGCT_Active_Skill = 25,
	CGCT_Vehicle_Board_Info = 26,
	CGCT_Vehicle_Alight_Info = 27,
	CGCT_Vehicle_ChangeSeat_Info = 28,
	CGCT_Vehicle_Hit_Player = 29,
	CGCT_Vehicle_Destroy_Player = 30,
	CGCT_CharacterControl_Info = 31,
	CGCT_Parkour_Interaction = 32,
	CGCT_Door_Interaction = 33,
	CGCT_Parachute_Interaction = 34,
	CGCT_Ladder_Interaction = 35,
	CGCT_Throwable_Use = 36,
	CGCT_Report_Illegal_Users = 37,
	CGCT_Game_Start = 38,
	CGCT_Game_Exit = 39,
	CGCT_Game_Escape = 40,
	CGCT_Game_LiveTime = 41,
	CGCT_Game_Network = 42,
	CGCT_Game_EarlyTechReport = 43,
	CGCT_Game_TechReport = 44,
	CGCT_Game_PackageLoadingFailure = 45,
	CGCT_Game_ADSAimPattern = 46,
	CGCT_MAX = 47,
};

// Enum BravoHotelGame.EEventTypeClientGameStateData
enum class EEventTypeClientGameStateData : uint8_t {
	None = 0,
	Game_Start = 1,
	Game_Exit = 2,
	Game_Escape = 3,
	Game_LiveTime = 4,
	Max = 5,
};

// Enum BravoHotelGame.EEventTypeClientGameWeaponData
enum class EEventTypeClientGameWeaponData : uint8_t {
	None = 0,
	Armed = 1,
	Unarmed = 2,
	Reload = 3,
	Max = 4,
};

// Enum BravoHotelGame.EEventTypeClientGameInventoryData
enum class EEventTypeClientGameInventoryData : uint8_t {
	None = 0,
	Open = 1,
	Close = 2,
	Max = 3,
};

// Enum BravoHotelGame.EEventTypeClientGameVehicleData
enum class EEventTypeClientGameVehicleData : uint8_t {
	None = 0,
	Vehicle_Board_Info = 1,
	Vehicle_Alight_Info = 2,
	Vehicle_ChangeSeat_Info = 3,
	Max = 4,
};

// Enum BravoHotelGame.EEventTypeClientGameRevivalData
enum class EEventTypeClientGameRevivalData : uint8_t {
	None = 0,
	Revival_Player = 1,
	GoldenTime_Revival_Player = 2,
	Max = 3,
};

// Enum BravoHotelGame.EEventTypeClientGameDiedData
enum class EEventTypeClientGameDiedData : uint8_t {
	None = 0,
	Death_Player = 1,
	Kill_Player = 2,
	Max = 3,
};

// Enum BravoHotelGame.EEventTypeClientGameKnockDownedData
enum class EEventTypeClientGameKnockDownedData : uint8_t {
	None = 0,
	KnockDowned_Player = 1,
	KnockDown_Player = 2,
	Max = 3,
};

// Enum BravoHotelGame.EEventTypeClientGameBattleData
enum class EEventTypeClientGameBattleData : uint8_t {
	None = 0,
	Hited_Player = 1,
	Hit_Player = 2,
	Vehicle_Hit_Player = 3,
	Vehicle_Destroy_Player = 4,
	GoldenTime_Start_Player = 5,
	Max = 6,
};

// Enum BravoHotelGame.EEventTypeClientGameThrowableData
enum class EEventTypeClientGameThrowableData : uint8_t {
	None = 0,
	Throwable_Use = 1,
	Max = 2,
};

// Enum BravoHotelGame.EEventTypeClientGameInteractionData
enum class EEventTypeClientGameInteractionData : uint8_t {
	None = 0,
	Parkour = 1,
	Door = 2,
	Parachute = 3,
	Ladder = 4,
	Max = 5,
};

// Enum BravoHotelGame.EEventTypeClientGameItemSearchData
enum class EEventTypeClientGameItemSearchData : uint8_t {
	None = 0,
	Recipe_Item_Search = 1,
	Max = 2,
};

// Enum BravoHotelGame.EEventTypeClientGameItemData
enum class EEventTypeClientGameItemData : uint8_t {
	None = 0,
	Weapon_Equip = 1,
	Item_Pickup = 2,
	Exchange_Parts = 3,
	Weapon_UnEquip = 4,
	Item_Drop = 5,
	Recovery_Item_Use = 6,
	EnergyBar_Item_Use = 7,
	Recipe_Item_Combine = 8,
	Item_Use = 9,
	Max = 10,
};

// Enum BravoHotelGame.EEventTypeClientGameSkillData
enum class EEventTypeClientGameSkillData : uint8_t {
	None = 0,
	CoolTime_Skill = 1,
	Active_Skill = 2,
	Max = 3,
};

// Enum BravoHotelGame.EEventTypeClientGameSupplyBoxData
enum class EEventTypeClientGameSupplyBoxData : uint8_t {
	None = 0,
	SupplyBox_Open = 1,
	SupplyBox_Change = 2,
	Max = 3,
};

// Enum BravoHotelGame.EEventTypeClientData
enum class EEventTypeClientData : int32_t {
	None = 0,
	LogIn = 10101,
	LobbyReady = 10102,
	MatchIn = 10103,
	LogOut = 10104,
	Max = 10105,
};

// Enum BravoHotelGame.EEventTypeWorldItemData
enum class EEventTypeWorldItemData : int32_t {
	None = 0,
	Spawned = 50101,
	Picked = 50102,
	VehicleSpawned = 50103,
	Max = 50104,
};

// Enum BravoHotelGame.EEventTypeUseItemData
enum class EEventTypeUseItemData : int32_t {
	None = 0,
	Heal = 40301,
	Boost = 40302,
	SkillBook = 40303,
	Max = 40304,
};

// Enum BravoHotelGame.EEventTypeSupplyData
enum class EEventTypeSupplyData : uint8_t {
	None = 0,
	Created = 1,
	Opend = 2,
	Max = 3,
};

// Enum BravoHotelGame.EEventTypeTransportData
enum class EEventTypeTransportData : uint8_t {
	None = 0,
	Created = 1,
	SpawnFirst = 2,
	SpawnSecond = 3,
	Destroyed = 4,
	Max = 5,
};

// Enum BravoHotelGame.EEventTypeRedZoneData
enum class EEventTypeRedZoneData : uint8_t {
	None = 0,
	Created = 1,
	Destroyed = 2,
	Max = 3,
};

// Enum BravoHotelGame.EEventTypeBlueZoneData
enum class EEventTypeBlueZoneData : uint8_t {
	None = 0,
	Created = 1,
	SurvivalCircleLulled = 2,
	SurvivalCircleShrinking = 3,
	Delay = 4,
	Max = 5,
};

// Enum BravoHotelGame.EEventTypeBattleRoyalData
enum class EEventTypeBattleRoyalData : uint8_t {
	None = 0,
	Ready = 1,
	GameStart = 2,
	AircraftStart = 3,
	AircraftEnableDescent = 4,
	AircraftEnd = 5,
	MatchEnd = 6,
	Max = 7,
};

// Enum BravoHotelGame.EEventTypeWeaponData
enum class EEventTypeWeaponData : int32_t {
	None = 0,
	Fire = 40201,
	Reload = 40202,
	HitShotCount = 40203,
	Kill = 40204,
	TeamKill = 40205,
	SelfKill = 40206,
	KnockOut = 40207,
	Max = 40208,
};

// Enum BravoHotelGame.EEventTypeCharacterFlyingData
enum class EEventTypeCharacterFlyingData : uint8_t {
	None = 0,
	Diving = 1,
	Parachute = 2,
	Landing = 3,
	Max = 4,
};

// Enum BravoHotelGame.EEventTypeCharacterData
enum class EEventTypeCharacterData : int32_t {
	None = 0,
	Created = 40101,
	Death = 40102,
	BeKnockedOuted = 40103,
	BeKnockOutedHeadShot = 40104,
	HeadShotCount = 40105,
	BeHeadShoted = 40106,
	BeRecoveryed = 40107,
	Recovery = 40108,
	BeResuscitated = 40109,
	Damaged = 40110,
	HitShotCount = 40111,
	UsingBook = 40112,
	UsingBooster = 40113,
	UsingMedical = 40114,
	HealAmount = 40115,
	GainRP = 40116,
	FinalRank = 40117,
	LoserScore = 40118,
	AssistCount = 40119,
	LevelUp = 40120,
	ClassChanged = 40121,
	GetUltimate = 40122,
	ShotCount = 40123,
	LastState = 40124,
	VehicleIExplosion = 40125,
	DestroyTire = 40126,
	VehicleDamage = 40127,
	LoadKill = 40128,
	OpenPersonalSupplyBox = 40129,
	WeaponDurability = 40130,
	OpenAirDropBox = 40131,
	DestroyHelicopter = 40132,
	TotalAirWalkDistance = 40133,
	MaxAirWalkDistance = 40134,
	Reconnected = 40135,
	AccountGoldGameStart = 40136,
	AccountGoldGameEnd = 40137,
	FarmingGold = 40138,
	RandomBonusGold = 40139,
	RemainCoinGold = 40140,
	PaidCoinGold = 40141,
	PaidAccountGold = 40142,
	ClassChangedGold = 40143,
	SupplyboxOpenedGold = 40144,
	RequestResuscitatedGold = 40145,
	ResuscitatedGold = 40146,
	Max = 40147,
};

// Enum BravoHotelGame.EEventTypePlayerData
enum class EEventTypePlayerData : int32_t {
	None = 0,
	LogIn = 30101,
	LogOut = 30102,
	Disconnected = 30103,
	Max = 30104,
};

// Enum BravoHotelGame.EEventTypeGameData
enum class EEventTypeGameData : int32_t {
	None = 0,
	GameStart = 20101,
	Ready = 20102,
	MatchEnd = 20103,
	Max = 20104,
};

// Enum BravoHotelGame.EBlackmarketGearSortType
enum class EBlackmarketGearSortType : uint8_t {
	EGEARSORT_ITEM_NAME = 0,
	EGEARSORT_TYPE = 1,
	EGEARSORT_ARMOR = 2,
	EGEARSORT_CAPACITY = 3,
	EGEARSORT_DECREASE_RELOAD_TIME = 4,
	EGEARSORT_MAX = 5,
};

// Enum BravoHotelGame.EBlackmarketCustomSortType
enum class EBlackmarketCustomSortType : uint8_t {
	ECUSTOMSORT_ITEM_NAME = 0,
	ECUSTOMSORT_ITEM_MAX = 1,
};

// Enum BravoHotelGame.EBlackmarketConsumableSortType
enum class EBlackmarketConsumableSortType : uint8_t {
	ECONSUMABLESORT_ITEM_NAME = 0,
	ECONSUMABLESORT_WEIGHT = 1,
	ECONSUMABLESORT_HEALTH = 2,
	ECONSUMABLESORT_ADRENALINE = 3,
	ECONSUMABLESORT_FUEL = 4,
	ECONSUMABLESORT_MAX = 5,
};

// Enum BravoHotelGame.EBlackmarketWearableSortType
enum class EBlackmarketWearableSortType : uint8_t {
	EWEARABLESORT_ITEM_NAME = 0,
	EWEARABLESORT_TYPE = 1,
	EWEARABLESORT_ARMOR = 2,
	EWEARABLESORT_CAPACITY = 3,
	EWEARABLESORT_DECREASE_RELOAD_TIME = 4,
	EWEARABLESORT_MAX = 5,
};

// Enum BravoHotelGame.EBlackmarketAttachmentSortType
enum class EBlackmarketAttachmentSortType : uint8_t {
	EATTACHMENTSORT_ITEM_NAME = 0,
	EATTACHMENTSORT_TYPE = 1,
	EATTACHMENTSORT_WEIGHT = 2,
	EATTACHMENTSORT_DECREASE_RELOAD_TIME = 3,
	EATTACHMENTSORT_VERTICAL_REDUCE = 4,
	EATTACHMENTSORT_HORIZENTAL_REDUCE = 5,
	EATTACHMENTSORT_INCREASE_RATE_OF_FIRE = 6,
	EATTACHMENTSORT_BURST_SPEED = 7,
	EATTACHMENTSORT_MAX = 8,
};

// Enum BravoHotelGame.EBlackmarketAmmoSortType
enum class EBlackmarketAmmoSortType : uint8_t {
	EAMMOSORT_ITEM_NAME = 0,
	EAMMOSORT_WEIGHT = 1,
	EAMMOSORT_COUNT = 2,
	EAMMOSORT_TOTALWEIGHT = 3,
	EAMMOSORT_MAX = 4,
};

// Enum BravoHotelGame.EBlackmarketWeaponSortType
enum class EBlackmarketWeaponSortType : uint8_t {
	EWEAPONSORT_ITEM_NAME = 0,
	EWEAPONSORT_AMMO = 1,
	EWEAPONSORT_DAMAGE = 2,
	EWEAPONSORT_FIRERATE = 3,
	EWEAPONSORT_MAGSIZE = 4,
	EWEAPONSORT_FIREMODE = 5,
	EWEAPONSORT_RELOADTIME = 6,
	EWEAPONSORT_PROJECTILEVELOCITY = 7,
	EWEAPONSORT_MOVESPEED = 8,
	EWEAPONSORT_WEIGHT = 9,
	EWEAPONSORT_MAX = 10,
};

// Enum BravoHotelGame.EBlackmarketTabType
enum class EBlackmarketTabType : uint8_t {
	ETAB_WEAPON = 0,
	ETAB_AMMO = 1,
	ETAB_ATTACHMENT = 2,
	ETAB_WEARABLE = 3,
	ETAB_CONSUMABLE = 4,
	ETAB_CUSTOM = 5,
	ETAB_VEHICLE = 6,
	ETAB_GEAR = 7,
	ETAB_PERK = 8,
	ETAB_PRESET = 9,
	ETAB_MAX = 10,
};

// Enum BravoHotelGame.EDoorSoundType
enum class EDoorSoundType : uint8_t {
	DST_HingedWood = 0,
	DST_HingedWoodBig = 1,
	DST_HingedGlass = 2,
	DST_HingedMetal = 3,
	DST_SlideWood = 4,
	DST_SlideGlass = 5,
	DST_SlideMetal = 6,
	DST_MAX = 7,
};

// Enum BravoHotelGame.EElevatorStateType
enum class EElevatorStateType : uint8_t {
	Moved = 0,
	Moving = 1,
	EElevatorStateType_MAX = 2,
};

// Enum BravoHotelGame.EElevatorDoorStateType
enum class EElevatorDoorStateType : uint8_t {
	None = 0,
	OpeningDoor = 1,
	OpenDoorCompleted = 2,
	ClosingDoor = 3,
	CloseDoorCompleted = 4,
	EElevatorDoorStateType_MAX = 5,
};

// Enum BravoHotelGame.ENetworkLoginFlowFlags
enum class ENetworkLoginFlowFlags : uint8_t {
	NLFF_None = 0,
	NLFF_HttpLogin = 1,
	NLFF_UserInfo = 2,
	NLFF_WebSocketLogin = 4,
	NLFF_Completed_PIE = 5,
	NLFF_Completed = 7,
	NLFF_MAX = 8,
};

// Enum BravoHotelGame.EGameResultWidgetMode
enum class EGameResultWidgetMode : uint8_t {
	GRWM_None = 0,
	GRWM_Died = 1,
	GRWM_TeamEnd = 2,
	GRWM_WinStart = 3,
	GRWM_LooseResult = 4,
	GRWM_MatchEnd = 5,
	GRWM_MAX = 6,
};

// Enum BravoHotelGame.EGoogleCloudType
enum class EGoogleCloudType : uint8_t {
	None = 0,
	PubSub = 1,
	FileUpload = 2,
	Max = 3,
};

// Enum BravoHotelGame.EItemEquipType
enum class EItemEquipType : uint8_t {
	ITEM_Equip = 0,
	ITEM_UnEquip = 1,
	ITEM_MAX = 2,
};

// Enum BravoHotelGame.EItemLocation
enum class EItemLocation : uint8_t {
	LOC_Inven = 0,
	LOC_Equip = 1,
	LOC_Weapon = 2,
	LOC_MAX = 3,
};

// Enum BravoHotelGame.EBattleMode
enum class EBattleMode : uint8_t {
	BATTLE_MODE_solo = 1,
	BATTLE_MODE_duo = 2,
	BATTLE_MODE_squad = 4,
	BATTLE_MODE_MAX = 5,
};

// Enum BravoHotelGame.EWebGameServerMode
enum class EWebGameServerMode : uint8_t {
	WEB_Login = 0,
	WEB_Game = 1,
	WEB_Game_For_DS = 2,
	WEB_Wait = 3,
	WEB_MAX = 4,
};

// Enum BravoHotelGame.ECompareItemType
enum class ECompareItemType : uint8_t {
	CIT_SAME = 0,
	CIT_UP = 1,
	CIT_DOWN = 2,
	CIT_MAX = 3,
};

// Enum BravoHotelGame.EItemEffectSubParticleSpawnState
enum class EItemEffectSubParticleSpawnState : uint8_t {
	IESP_SpawnPassive = 0,
	IESP_SpawnActive = 1,
	IESP_MAX = 2,
};

// Enum BravoHotelGame.EPatrolDirection
enum class EPatrolDirection : uint8_t {
	Forward = 0,
	Reverse = 1,
	EPatrolDirection_MAX = 2,
};

// Enum BravoHotelGame.EEventLogType
enum class EEventLogType : uint8_t {
	None = 0,
	PcInfo = 1,
	GameOption = 2,
	Fps = 3,
	Exit = 4,
	AccountCreate = 5,
	AccountLogIn = 6,
	AccountLogOut = 7,
	CreateCharacter = 8,
	PartyInfo = 9,
	MatchJoin = 10,
	MatchJoinFail = 11,
	JoinGame = 12,
	JoinGameFail = 13,
	SkyDive = 14,
	GainItem = 15,
	UsingItem = 16,
	EquipItemState = 17,
	AttachItemState = 18,
	CharacterMove = 19,
	CharacterBehavior = 20,
	CharacterAttack = 21,
	CharacterHit = 22,
	CharacterKnockDown = 23,
	CharacterRecorver = 24,
	CharacterDeath = 25,
	CharacterCycleInfo = 26,
	VechicleInfo = 27,
	DestructObject = 28,
	GameEnd = 29,
	GameCycleInfo = 30,
	BlueZoneInfo = 31,
	RedZoneInfo = 32,
	SupplyInfo = 33,
	Max = 34,
};

// Enum BravoHotelGame.EMoveElevatorStateType
enum class EMoveElevatorStateType : uint8_t {
	LowerMoving = 0,
	UpperMoving = 1,
	LowerMoved = 2,
	UpperMoved = 3,
	EMoveElevatorStateType_MAX = 4,
};

// Enum BravoHotelGame.ECloudPlatformType
enum class ECloudPlatformType : uint8_t {
	CloudPlatform_Google = 0,
	CloudPlatform_Aws = 1,
	CloudPlatform_MAX = 2,
};

// Enum BravoHotelGame.EClientOutGameContentsType
enum class EClientOutGameContentsType : uint8_t {
	COGCT_None = 0,
	COGCT_First_Client_Run = 1,
	COGCT_Tutorial_Play_Exit = 2,
	COGCT_Tutorial_Play_Complete = 3,
	COGCT_Tutorial_Movie_Skip = 4,
	COGCT_Tutorial_Movie_Watch = 5,
	COGCT_Training_Mode_Off = 6,
	COGCT_Enter_Lobby = 7,
	COGCT_Clean_Campaign = 8,
	COGCT_Matching_Success = 9,
	COGCT_Matching_Cancel = 10,
	COGCT_Login_Forbid = 11,
	COGCT_Login_Success = 12,
	COGCT_Lobby_UI_Action = 13,
	COGCT_Lobby_Game_Exit = 14,
	COGCT_Connecting_Success = 15,
	COGCT_Connecting_Fail = 16,
	COGCT_Disconnected_FromDS = 17,
	COGCT_Common_Error = 18,
	COGCT_MAX = 19,
};

// Enum BravoHotelGame.EEventTypeClientOutGameFirstClientRunData
enum class EEventTypeClientOutGameFirstClientRunData : uint8_t {
	None = 0,
	FirstClient_Start = 1,
	FirstClient_Character_Look = 2,
	FirstClient_Character_Clothes = 3,
	FirstClient_Character_NickName = 4,
	FirstClient_Character_NickNameCheck = 5,
	FirstClient_Character_NickNameConfirm = 6,
	FirstClient_Character_Created = 7,
	FirstClient_Training_Mode_Off = 8,
	FirstClient_Tutorial_Movie_Start = 9,
	FirstClient_Tutorial_Movie_Skip = 10,
	FirstClient_Tutorial_Movie_Watch = 11,
	FirstClient_Tutorial_Play_Start = 12,
	FirstClient_Tutorial_Play_Exit = 13,
	FirstClient_Tutorial_Play_Complete = 14,
	FirstClient_Lobby_Enter = 15,
	FirstClient_Clean_Campaign_Complete = 16,
	FirstClient_Matching_Start = 17,
	FirstClient_Matching_Success = 18,
	Max = 19,
};

// Enum BravoHotelGame.EEventTypeClientOutGameTutorialData
enum class EEventTypeClientOutGameTutorialData : uint8_t {
	None = 0,
	Tutorial_Play_Exit = 1,
	Tutorial_Play_Complete = 2,
	Tutorial_Movie_Skip = 3,
	Tutorial_Movie_Watch = 4,
	Max = 5,
};

// Enum BravoHotelGame.EEventTypeClientOutGameExitData
enum class EEventTypeClientOutGameExitData : uint8_t {
	None = 0,
	Game_Exit = 1,
	Max = 2,
};

// Enum BravoHotelGame.EEventTypeClientOutGameActionData
enum class EEventTypeClientOutGameActionData : uint8_t {
	None = 0,
	UI_Action = 1,
	Max = 2,
};

// Enum BravoHotelGame.EEventTypeClientOutGameLoginData
enum class EEventTypeClientOutGameLoginData : uint8_t {
	None = 0,
	Login_Forbid = 1,
	Login_Success = 2,
	Max = 3,
};

// Enum BravoHotelGame.EEventTypeClientOutGameMatchingData
enum class EEventTypeClientOutGameMatchingData : uint8_t {
	None = 0,
	Matching_Success = 1,
	Matching_Cancel = 2,
	Max = 3,
};

// Enum BravoHotelGame.EItemSortType
enum class EItemSortType : uint8_t {
	IST_All = 0,
	IST_Attachment = 1,
	IST_Booster = 2,
	IST_Capsule = 3,
	IST_Equipment = 4,
	IST_Remedy = 5,
	IST_MAX = 6,
};

// Enum BravoHotelGame.EPickUpItemEffectType
enum class EPickUpItemEffectType : uint8_t {
	IE_None = 0,
	IE_Origin = 1,
	IE_Weak = 2,
	IE_MAX = 3,
};

// Enum BravoHotelGame.EPopupWidgetButtonFlags
enum class EPopupWidgetButtonFlags : uint8_t {
	BT_None = 0,
	BT_Ok = 1,
	BT_Cancel = 2,
	BT_Waiting = 4,
	BT_MAX = 5,
};

// Enum BravoHotelGame.EAchievementState
enum class EAchievementState : uint8_t {
	AS_None = 0,
	AS_Progress = 1,
	AS_Complete = 2,
	AS_MAX = 3,
};

// Enum BravoHotelGame.EAchievementType
enum class EAchievementType : uint8_t {
	AT_None = 0,
	AT_GamePlay = 1,
	AT_Social = 2,
	AT_Event = 3,
	AT_MAX = 4,
};

// Enum BravoHotelGame.ERemoteControlState
enum class ERemoteControlState : uint8_t {
	ERCS_None = 0,
	ERCS_SwitchON = 1,
	ERCS_Deactive = 2,
	ERCS_MAX = 3,
};

// Enum BravoHotelGame.EDropBoxState
enum class EDropBoxState : uint8_t {
	None = 0,
	CutoffParachute = 1,
	Landing = 2,
	OldBox = 3,
	Open = 4,
	EDropBoxState_MAX = 5,
};

// Enum BravoHotelGame.EGameLoadingStep
enum class EGameLoadingStep : uint8_t {
	EGLS_None = 0,
	EGLS_LoadingStart = 1,
	EGLS_LoadingEnd = 2,
	EGLS_MAX = 3,
};

// Enum BravoHotelGame.ELanguageType
enum class ELanguageType : uint8_t {
	LT_Korean = 0,
	LT_English = 1,
	LT_Chinese = 2,
	LT_French = 3,
	LT_Deutsch = 4,
	LT_Espanol = 5,
	LT_Portugues = 6,
	LT_Russian = 7,
	LT_Japanese = 8,
	LT_MAX = 9,
};

// Enum BravoHotelGame.EMailMsgTag
enum class EMailMsgTag : uint8_t {
	None = 0,
	Mail_TAG_Payment = 1,
	Mail_TAG_Report = 2,
	Mail_TAG_System = 3,
	EMailMsgTag_MAX = 4,
};

// Enum BravoHotelGame.EMailMsgSaveOption
enum class EMailMsgSaveOption : uint8_t {
	received = 0,
	sent = 1,
	all = 2,
	EMailMsgSaveOption_MAX = 3,
};

// Enum BravoHotelGame.EMailMsgType
enum class EMailMsgType : uint8_t {
	Receive = 0,
	Send = 1,
	EMailMsgType_MAX = 2,
};

// Enum BravoHotelGame.ECommunicatorType
enum class ECommunicatorType : uint8_t {
	Player = 0,
	Custom = 1,
	GM_QnA = 2,
	Master_Shop = 3,
	ECommunicatorType_MAX = 4,
};

// Enum BravoHotelGame.EBlockType
enum class EBlockType : uint8_t {
	BT_Account = 0,
	BT_IP = 1,
	BT_Hardware = 2,
	BT_MAX = 3,
};

// Enum BravoHotelGame.EBroadCastKillerType
enum class EBroadCastKillerType : uint8_t {
	None = 0,
	Killer = 1,
	SubKiller = 2,
	Assist = 3,
	EBroadCastKillerType_MAX = 4,
};

// Enum BravoHotelGame.EAutoMoveSnapshotActionType
enum class EAutoMoveSnapshotActionType : uint8_t {
	None = 0,
	StartRun = 1,
	StopRun = 2,
	StartParkour = 3,
	StartJump = 4,
	StopJump = 5,
	StartInteraction = 6,
	StopInteraction = 7,
	EAutoMoveSnapshotActionType_MAX = 8,
};

// Enum BravoHotelGame.EMatchRateCaseType
enum class EMatchRateCaseType : uint8_t {
	None = 0,
	Rank = 1,
	LifeTime = 2,
	Damage = 3,
	Assist = 4,
	Kill = 5,
	HeadKill = 6,
	Max = 7,
};

// Enum BravoHotelGame.EDeafenDistanceLevel
enum class EDeafenDistanceLevel : uint8_t {
	EDDL_Close = 0,
	EDDL_Mid = 1,
	EDDL_Far = 2,
	EDDL_MAX = 3,
};

// Enum BravoHotelGame.EMouseCursorType
enum class EMouseCursorType : uint8_t {
	EMCT_Default = 0,
	EMCT_Nuclear = 1,
	EMCT_MAX = 2,
};

// Enum BravoHotelGame.EStatusType
enum class EStatusType : uint8_t {
	ST_Power = 0,
	ST_Speed = 1,
	ST_Health = 2,
	ST_MAX = 3,
};

// Enum BravoHotelGame.EPlayerListSortType
enum class EPlayerListSortType : uint8_t {
	ByAlive = 0,
	ByDistance = 1,
	ByKillCount = 2,
	E_Last = 3,
	EPlayerListSortType_MAX = 4,
};

// Enum BravoHotelGame.CheatSubType
enum class CheatSubType : uint8_t {
	CST_None = 0,
	CST_Replay = 1,
	CST_Coherent = 2,
	CST_RedZone = 3,
	CST_BlueZone = 4,
	CST_Character = 5,
	CST_Inventory = 6,
	CST_Weapon = 7,
	CST_Vehicle = 8,
	CST_PersonalSupply = 9,
	CST_MAX = 10,
};

// Enum BravoHotelGame.CheatMainType
enum class CheatMainType : uint8_t {
	CMT_GamePlay = 0,
	CMT_Contents = 1,
	CMT_Optimization = 2,
	CMT_Etc = 3,
	CMT_MAX = 4,
};

// Enum BravoHotelGame.EVehicleTransmissionType
enum class EVehicleTransmissionType : uint8_t {
	Auto_PhysX = 0,
	Auto_Movement = 1,
	Manual = 2,
	EVehicleTransmissionType_MAX = 3,
};

// Enum BravoHotelGame.EDoorState
enum class EDoorState : uint8_t {
	DS_Destructed = 0,
	DS_Closed = 1,
	DS_Opened = 2,
	DS_Closing = 3,
	DS_Opening = 4,
	DS_Kicking = 5,
	DS_MAX = 6,
};

// Enum BravoHotelGame.EPingActorType
enum class EPingActorType : uint8_t {
	PAT_None = 0,
	PAT_Pawn = 1,
	PAT_Item = 2,
	PAT_Vehicle = 3,
	PAT_MAX = 4,
};

// Enum BravoHotelGame.EPingIconAnimationStateType
enum class EPingIconAnimationStateType : uint8_t {
	Enter = 0,
	Hold = 1,
	Exit = 2,
	EPingIconAnimationStateType_MAX = 3,
};

// Enum BravoHotelGame.EPingIconLoopAnimationType
enum class EPingIconLoopAnimationType : uint8_t {
	None = 0,
	PulseSlow = 1,
	PulseFast = 2,
	Spin = 3,
	Bounce = 4,
	EPingIconLoopAnimationType_MAX = 5,
};

// Enum BravoHotelGame.EPingIconTransitionAnimationType
enum class EPingIconTransitionAnimationType : uint8_t {
	None = 0,
	Slide = 1,
	Bounce = 2,
	Scale = 3,
	EPingIconTransitionAnimationType_MAX = 4,
};

// Enum BravoHotelGame.ETimeOfDayType
enum class ETimeOfDayType : uint8_t {
	ETOD_MidDay = 0,
	ETOD_Dusk = 1,
	ETOD_Dawn = 2,
	ETOD_MAX = 3,
};

// Enum BravoHotelGame.EWaterViewCameraType
enum class EWaterViewCameraType : uint8_t {
	WVCT_None = 0,
	WVCT_InWater = 1,
	WVCT_OutWater = 2,
	WVCT_MAX = 3,
};

// Enum BravoHotelGame.ECharacterVoicePriorityType
enum class ECharacterVoicePriorityType : uint8_t {
	CVoice_DoNotRun = 0,
	CVoice_PreStop_DoRun = 1,
	CVoice_MAX = 2,
};

// Enum BravoHotelGame.ECharacterVoiceRPCType
enum class ECharacterVoiceRPCType : uint8_t {
	CVoice_RPC_Local = 0,
	CVoice_RPC_Team = 1,
	CVoice_RPC_All = 2,
	CVoice_RPC_MAX = 3,
};

// Enum BravoHotelGame.ESteamAvatarSize
enum class ESteamAvatarSize : uint8_t {
	None = 0,
	AvatarSmall = 1,
	AvatarMedium = 2,
	AvatarLarge = 3,
	ESteamAvatarSize_MAX = 4,
};

// Enum BravoHotelGame.EUpLoadDataType
enum class EUpLoadDataType : uint8_t {
	None = 0,
	Normal = 1,
	ItemSpawn = 2,
	Max = 3,
};

// Enum BravoHotelGame.EMovementDirection
enum class EMovementDirection : uint8_t {
	MD_Forwards = 0,
	MD_Backwards = 1,
	MD_MAX = 2,
};

// Enum BravoHotelGame.ECardinalDirection
enum class ECardinalDirection : uint8_t {
	CD_North = 0,
	CD_East = 1,
	CD_West = 2,
	CD_South = 3,
	CD_MAX = 4,
};

// Enum BravoHotelGame.EVehicleExitSide
enum class EVehicleExitSide : uint8_t {
	VDS_Left = 0,
	VDS_Right = 1,
	VDS_Virtual = 2,
	VDS_MAX = 3,
};

// Enum BravoHotelGame.EVehicleEffect
enum class EVehicleEffect : uint8_t {
	EVE_None = 0,
	EVE_GunShot = 1,
	EVE_Explosion = 2,
	EVE_Drive_Concrete = 3,
	EVE_MAX = 4,
};

// Enum BravoHotelGame.ERedZoneSelectType
enum class ERedZoneSelectType : uint8_t {
	All = 0,
	WithinBlueZone = 1,
	WithinWhiteZone = 2,
	BetweenBlueZoneAndWhiteZone = 3,
	ERedZoneSelectType_MAX = 4,
};

// Enum BravoHotelGame.EPerkSpawnType
enum class EPerkSpawnType : uint8_t {
	PST_Near = 0,
	PST_Random = 1,
	PST_MAX = 2,
};

// Enum BravoHotelGame.ESurviveType
enum class ESurviveType : uint8_t {
	EST_None = 0,
	EST_Survive = 1,
	EST_Knockout = 2,
	EST_CriticalTime = 3,
	EST_Death = 4,
	EST_MAX = 5,
};

// Enum BravoHotelGame.ESimpleWeaponAnimationType
enum class ESimpleWeaponAnimationType : uint8_t {
	EWAT_Default = 0,
	EWAT_Rifle = 1,
	EWAT_MAX = 2,
};

// Enum BravoHotelGame.ELadderState
enum class ELadderState : uint8_t {
	LS_NotLadder = 0,
	LS_UseLadder = 1,
	LS_SnapToLadder = 2,
	LS_ClimbLadder = 3,
	LS_OnLadder = 4,
	LS_Sliding = 5,
	LS_DownLadder = 6,
	LS_MAX = 7,
};

// Enum BravoHotelGame.ELadderInteractionType
enum class ELadderInteractionType : uint8_t {
	LIT_DirectSnap = 0,
	LIT_DownIn = 1,
	LIT_UpIn = 2,
	LIT_DownOut = 3,
	LIT_UpOut = 4,
	LIT_MAX = 5,
};

// Enum BravoHotelGame.EWeaponAttachmentSight
enum class EWeaponAttachmentSight : uint8_t {
	WA_Sight_Basic = 0,
	WA_Sight_Reddot = 1,
	WA_Sight_Holo = 2,
	WA_Sight_2X = 3,
	WA_Sight_4X = 4,
	WA_Sight_8X = 5,
	WA_Sight_15X = 6,
	WA_Sight_Digital = 7,
	WA_Sight_MAX = 8,
};

// Enum BravoHotelGame.EProjectileType
enum class EProjectileType : uint8_t {
	PT_5_56mm = 0,
	PT_7_62mm = 1,
	PT_9mm = 2,
	PT_45ACP = 3,
	PT_12Gauge = 4,
	PT_300Magnum = 5,
	PT_44Magnum = 6,
	PT_MAX = 7,
};

// Enum BravoHotelGame.ETerrainType
enum class ETerrainType : int32_t {
	TT_None = 0,
	TT_Wood = 2,
	TT_Rock = 4,
	TT_Indoor = 8,
	TT_Fence = 16,
	TT_Grass = 32,
	TT_Cliff = 64,
	TT_Water = 128,
	TT_Air = 256,
	TT_Vehicle = 512,
	TT_MAX = 513,
};

// Enum BravoHotelGame.EHumanWeaponHitArea
enum class EHumanWeaponHitArea : uint8_t {
	HWHA_None = 0,
	HWHA_Head = 1,
	HWHA_Neck = 2,
	HWHA_Shoudler = 3,
	HWHA_Chest = 4,
	HWHA_Stomach = 5,
	HWHA_UpperWaist = 6,
	HWHA_LowerWaist = 7,
	HWHA_Thigh = 8,
	HWHA_Shank = 9,
	HWHA_Foot = 10,
	HWHA_UpperArm = 11,
	HWHA_LowerArm = 12,
	HWHA_Hand = 13,
	HWHA_MAX = 14,
};

// Enum BravoHotelGame.EWeaponHitArea
enum class EWeaponHitArea : uint8_t {
	HHA_None = 0,
	HHA_Head = 1,
	HHA_UpperBody = 2,
	HHA_LowerBody = 3,
	HHA_MAX = 4,
};

// Enum BravoHotelGame.EVehicleSoundFlag
enum class EVehicleSoundFlag : uint8_t {
	None = 0,
	Engine = 1,
	Horn = 2,
	Handbrake = 4,
	EVehicleSoundFlag_MAX = 5,
};

// Enum BravoHotelGame.EVehicleNetProperty
enum class EVehicleNetProperty : uint8_t {
	VNP_None = 0,
	VNP_HealthPoint = 1,
	VNP_TireHealthPoint = 2,
	VNP_IsBoosting = 4,
	VNP_FuelAmount = 8,
	VNP_ReplicatedMovement = 16,
	VNP_MAX = 17,
};

// Enum BravoHotelGame.VoiceChannelType
enum class VoiceChannelType : uint8_t {
	NonPositional = 0,
	Positional = 1,
	Echo = 2,
	VoiceChannelType_MAX = 3,
};

// Enum BravoHotelGame.PTTKey
enum class PTTKey : uint8_t {
	PTTNoChannel = 0,
	PTTAreaChannel = 1,
	PTTTeamChannel = 2,
	PTTLobbyTeamChannel = 3,
	PTTKey_MAX = 4,
};

// Enum BravoHotelGame.EWeightMapBitCheck
enum class EWeightMapBitCheck : uint8_t {
	None = 0,
	CheckLand = 1,
	CheckDescent = 2,
	CheckPersonalSupplyBox = 4,
	EWeightMapBitCheck_MAX = 5,
};

// Enum BravoHotelGame.EWeightMapLandType
enum class EWeightMapLandType : uint8_t {
	WLT_Error = 0,
	WLT_Land = 1,
	WLT_Water = 2,
	WLT_MAX = 3,
};

// Enum BravoHotelGame.EWeightMapDescentType
enum class EWeightMapDescentType : uint8_t {
	WDT_Error = 0,
	WDT_Enable = 1,
	WDT_Disable = 2,
	WDT_MAX = 3,
};

// Enum BravoHotelGame.EParkourDebugType
enum class EParkourDebugType : uint8_t {
	PDT_None = 0,
	PDT_First = 1,
	PDT_Hole = 2,
	PDT_Position = 4,
	PDT_Hand = 8,
	PDT_Tickness = 16,
	PDT_Falling = 32,
	PDT_Hit = 64,
	PDT_LedgeGrab = 128,
	PDT_All = 255,
	PDT_MAX = 256,
};

// Class BravoHotelGame.AmbientSoundVolume
class AAmbientSoundVolume : public AVolume {

public:

	struct FString Ambience; // 0x350 (16)
	int32_t Priority; // 0x360 (4)

	void OnOverlapEnd(struct UPrimitiveComponent OverlappedComponent, struct UActor OtherActor, struct UPrimitiveComponent OtherComp, int32_t OtherBodyIndex); // Function BravoHotelGame.AmbientSoundVolume.OnOverlapEnd(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E6F410>
	void OnOverlapBegin(struct UPrimitiveComponent OverlappedComponent, struct UActor OtherActor, struct UPrimitiveComponent OtherComp, int32_t OtherBodyIndex, char bFromSweep, struct FHitResult& SweepResult); // Function BravoHotelGame.AmbientSoundVolume.OnOverlapBegin(Final|Native|Protected|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E6F200>
};

// Class BravoHotelGame.AnimNotifyState_PlaySound
class UAnimNotifyState_PlaySound : public UAnimNotifyState {

public:

	struct USoundBase Sound; // 0x30 (8)
	float VolumeMultiplier; // 0x38 (4)
	float PitchMultiplier; // 0x3C (4)
	char bFollow : 0; // 0x40 (1)
	struct FName AttachName; // 0x44 (8)
};

// Class BravoHotelGame.BravoHotelGameMode
class ABravoHotelGameMode : public ABravoHotelGameModeBase {

public:

	char bFriendlyFire : 0; // 0x404 (1)
	struct UBravoHotelPoolingActorComponent PoolingActorComponent; // 0x408 (8)
	struct FDataTableRowHandle MapDataTableHandle; // 0x410 (16)
	struct TMap<struct FString, struct APlayerController> PCReceivedPlayerInfos; // 0x420 (80)
	struct UClass* TestAIControllerClass; // 0x470 (8)
	char UsingOuterBlueZone : 0; // 0x4E9 (1)
	struct FName SelectedPlayZoneName; // 0x4EC (8)
	struct UClass* BlueZoneClass; // 0x4F8 (8)
	struct FString CQRType; // 0x500 (16)
	struct ABravoHotelBlueZone BlueZone; // 0x578 (8)

	void SetTestAIChangeLocation(struct AAIController AIController); // Function BravoHotelGame.BravoHotelGameMode.SetTestAIChangeLocation(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F4A5D0>
	float GetCurrentOutOfCircleDamage(); // Function BravoHotelGame.BravoHotelGameMode.GetCurrentOutOfCircleDamage(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F4A5A0>
	struct ABravoHotelBlueZone GetBlueZone(); // Function BravoHotelGame.BravoHotelGameMode.GetBlueZone(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F4A570>
};

// Class BravoHotelGame.BattleRoyaleGameMode
class ABattleRoyaleGameMode : public ABravoHotelGameMode {

public:

	struct TArray<struct APlayerState> RemovePendingPlayerArray; // 0x580 (16)
	enum class EGameViewType GameViewType; // 0x590 (1)
	enum class EMatchingType MatchingType; // 0x591 (1)
	int32_t TeamSize; // 0x594 (4)
	struct FString Training; // 0x598 (16)
	int32_t AIGrade; // 0x5A8 (4)
	struct FMulticastInlineDelegate UpdateSurvivalCircleDelegate; // 0x5B0 (16)
	struct TMap<char, struct FTeamInfo> TeamInfoMap; // 0x600 (80)
	char WinnerTeamIndex; // 0x650 (1)
	struct TArray<struct FName> SendPlayerEndedEvent; // 0x658 (16)
	struct TArray<int32_t> SendPlayerRankedEvent; // 0x668 (16)
	struct UClass* AircraftViewPawnClass; // 0x690 (8)
	struct UClass* AircraftFlightPawnClass; // 0x698 (8)
	char bAutoStart : 0; // 0x6A0 (1)
	float StartingPlayerCountRate; // 0x6A4 (4)
	int32_t WaitingTime; // 0x6A8 (4)
	int32_t ReadyTime; // 0x6AC (4)
	int32_t DescentDelay; // 0x6B0 (4)
	int32_t DescentableTime; // 0x6B4 (4)
	struct ABravoHotelAircraftFlight AircraftFlight; // 0x6B8 (8)
	char bIsUseAircraft : 0; // 0x6C0 (1)
	char bUseAircraftViewPawn : 0; // 0x6D5 (1)
	char bEndlessGame : 0; // 0x6D6 (1)
	struct TArray<struct FDamageInfo> DamageInfoArray; // 0x6F0 (16)
	struct UClass* RedZoneManagerClass; // 0x708 (8)
	struct ABravoHotelRedZoneManager RedZoneManager; // 0x710 (8)
	struct UClass* PersonalSupplyBoxManagerClass; // 0x7A8 (8)
	struct ABHPersonalSupplyBoxManager PersonalSupplyBoxManager; // 0x7B0 (8)
	struct FLogBuildCountData DivisionItemCountResult; // 0x7B8 (16)
	char DisivisonComplete : 0; // 0x7C8 (1)
	struct FStandardGroupKeyCountInfo StandardGroupKeyCountInfo; // 0x9B0 (88)
	struct TMap<struct FName, struct FAreaSpawnRateInfo> AreaSpawnRateList; // 0xA08 (80)
	struct FAreaSpawnRateInfo BlueZoneSpawnRateInfo; // 0xA58 (136)
	struct FName BlueZoneSpawnRateKey; // 0xAE0 (8)
	struct FAreaSpawnRateInfo NoneData; // 0xAE8 (136)
	struct TMap<struct FName, struct FVehicleAreaSpawnRateInfo> VehicleAreaSpawnRateList; // 0xB70 (80)
	struct FVehicleAreaSpawnRateInfo VehicleBlueZoneSpawnRateInfo; // 0xBC0 (120)
	struct FName VehicleBlueZoneSpawnRateKey; // 0xC38 (8)
	struct FVehicleAreaSpawnRateInfo NoneVehicleData; // 0xC40 (120)
	struct FLocalSpawnRate CustomBlueZoneSpawnRateInfo; // 0xCB8 (40)
	struct TMap<struct FName, struct FLocalSpawnRate> CustomAreaSpawnRateList; // 0xCE0 (80)
	struct FLocalSpawnRate CustomVehicleBlueZoneSpawnRateInfo; // 0xD30 (40)
	struct TMap<struct FName, struct FLocalSpawnRate> CustomVehicleAreaSpawnRateList; // 0xD58 (80)
	float ItemDivisionDelay; // 0xDB0 (4)
	char UsingWorldItemSpawnTalbeInBlueZone : 0; // 0xDB4 (1)
	char ItemSpawnInBlueZone : 0; // 0xDB5 (1)
	char UnlimitItemSpawnCnt : 0; // 0xDB6 (1)
	int32_t MaxItemDivisionCountAtOnce; // 0xDB8 (4)
	char ItemDivisionLevelLoadComplet : 0; // 0xDBC (1)
	char ItemDivisionGameReady : 0; // 0xDBD (1)
	char UsingMaxPickUpItemSpawnCount : 0; // 0xDBE (1)
	int32_t MaxPickUpItemSpawnCount; // 0xDC0 (4)
	char UsingMaxVehicleSpawnCount : 0; // 0xDC4 (1)
	int32_t MaxVehicleSpawnCount; // 0xDC8 (4)
	int32_t MaxPickUpVehicleSpawnCount; // 0xDCC (4)
	char UsingDynamicMaxPickUpItemSpawnCount : 0; // 0xDD0 (1)
	struct FItemSpawnLimitInfo ItemSpawnLimitInfo; // 0xDD4 (20)
	char GCRecordData : 0; // 0xDE8 (1)
	struct FString GCRecordDataTitle; // 0xDF0 (16)
	char RecordBuildingData : 0; // 0xE00 (1)
	char RecordPersonalSupplyBoxData : 0; // 0xE01 (1)
	struct UCurveFloat ItemSpawnRateCurve; // 0xE08 (8)
	struct UCurveFloat VehicleSpawnRateCurve; // 0xE10 (8)
	int32_t CurrentSpawnVehicleCount; // 0xE18 (4)
	int32_t CurrentDivisionItemCount; // 0xE1C (4)
	struct TArray<struct ABravoHotelCharacter> CheckCharacters; // 0xE38 (16)
	struct TArray<struct FLoadBuildingInfo> LoadCompleteList; // 0xE58 (16)
	struct TArray<int32_t> AutoBotIds; // 0xE70 (16)
	struct TArray<int32_t> AutoBotInfoSendIDList; // 0xE80 (16)

	void UpdateSurvivalCircleDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode.UpdateSurvivalCircleDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void UpdateItemSpawnState(); // Function BravoHotelGame.BattleRoyaleGameMode.UpdateItemSpawnState(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E705A0>
	void UpdateCheckStartPlayCharacters(); // Function BravoHotelGame.BattleRoyaleGameMode.UpdateCheckStartPlayCharacters(Final|Native|Private) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E70580>
	void ServerCheat(char Active, enum class EDediGameCheatType Type); // Function BravoHotelGame.BattleRoyaleGameMode.ServerCheat(Net|NetReliableNative|Event|Public|NetClient) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E704B0>
	void OnBattleRoyalStateChanged(enum class EBattleRoyaleState PrevState, enum class EBattleRoyaleState CurrentState); // Function BravoHotelGame.BattleRoyaleGameMode.OnBattleRoyalStateChanged(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E703F0>
	struct FString GetSpawnAreaName(struct AController Player); // Function BravoHotelGame.BattleRoyaleGameMode.GetSpawnAreaName(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E70310>
	struct ABravoHotelRedZoneManager GetRedZoneManager(); // Function BravoHotelGame.BattleRoyaleGameMode.GetRedZoneManager(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E702E0>
	enum class EBattleRoyaleState GetBattleRoyaleState(); // Function BravoHotelGame.BattleRoyaleGameMode.GetBattleRoyaleState(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E702B0>
	void DestroyRedZoneManager(); // Function BravoHotelGame.BattleRoyaleGameMode.DestroyRedZoneManager(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E70290>
	char CreateRedZoneManager(); // Function BravoHotelGame.BattleRoyaleGameMode.CreateRedZoneManager(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E70260>
	void Cheat(char Active, int8_t Type); // Function BravoHotelGame.BattleRoyaleGameMode.Cheat(Final|Exec|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E701A0>
	void AddAIPlayerByTimer(char bByTimer); // Function BravoHotelGame.BattleRoyaleGameMode.AddAIPlayerByTimer(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E70110>
};

// Class BravoHotelGame.BattleRoyaleGameMode_Login
class ABattleRoyaleGameMode_Login : public ABravoHotelGameModeBase {

public:

	float MatchingTimeout; // 0x400 (4)
	struct TArray<struct FPlayerPawnList> PlayerPawnList; // 0x408 (16)
	struct ACharacter CustomizeCharacter; // 0x418 (8)
	struct ACharacter RankingCharacter; // 0x420 (8)
	struct USkeletalMeshComponent AppearingMotionCharacter; // 0x428 (8)
	struct FTimerHandle Loading_TimerHandle; // 0x540 (8)
	struct FTimerHandle PartyInfo_TimerHandle; // 0x548 (8)
	struct FTimerHandle Ping_TimerHandle; // 0x550 (8)
	struct FTimerHandle GeeGeeLoginToken_TimerHandle; // 0x558 (8)
	struct FTimerHandle SteamLoginToken_TimerHandle; // 0x560 (8)
	struct FTimerHandle AveragePingRequest_TimerHandle; // 0x568 (8)
	struct FTimerHandle DuplicatedReconnectTimeout_TimerHandle; // 0x570 (8)
	struct FMulticastInlineDelegate OnLoginSucceeded; // 0x588 (16)
	struct FMulticastInlineDelegate OnLoginNotify; // 0x598 (16)
	struct FMulticastInlineDelegate OnLoginFailed; // 0x5A8 (16)
	struct FMulticastInlineDelegate OnMatchingPending; // 0x5B8 (16)
	struct FMulticastInlineDelegate OnMatchingStarted; // 0x5C8 (16)
	struct FMulticastInlineDelegate OnMatchingSucceeded; // 0x5D8 (16)
	struct FMulticastInlineDelegate OnMatchingFailed; // 0x5E8 (16)
	struct FMulticastInlineDelegate OnPartyInvited; // 0x5F8 (16)
	struct FMulticastInlineDelegate OnPartyInfoChanged; // 0x608 (16)
	struct FMulticastInlineDelegate OnPartyMemberInfoChanged; // 0x618 (16)
	struct FMulticastInlineDelegate OnMatchingSettingsChanged; // 0x628 (16)
	struct FMulticastInlineDelegate OnCreateCharacter; // 0x638 (16)
	struct FMulticastInlineDelegate OnTrainingModeOffDelegate; // 0x648 (16)

	void UpdatePCInfo(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.UpdatePCInfo(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E72070>
	void StartTutorialPlay(char bOpeningTutorial); // Function BravoHotelGame.BattleRoyaleGameMode_Login.StartTutorialPlay(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E71FE0>
	void StartLoginEx(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.StartLoginEx(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E71FC0>
	void StartLogin(struct TMap<struct FString, struct FString>& AppIDs, struct TMap<struct FString, struct FString>& LoginKeys, enum class ELoginType Type); // Function BravoHotelGame.BattleRoyaleGameMode_Login.StartLogin(Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E71D90>
	void ShowValidationFailedPopup(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.ShowValidationFailedPopup(Final|Native|Protected|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E71D70>
	void SetVisibleRankingCharacter(char bState); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SetVisibleRankingCharacter(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E71CE0>
	void SetRankingCharacter(struct ACharacter SpawnCharacter); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SetRankingCharacter(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E71C60>
	void SetPawnList(struct TArray<struct ACharacter>& PawnList); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SetPawnList(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E71BB0>
	void SetCustomizeCharacter(struct ACharacter SpawnCustomizeCharacter); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SetCustomizeCharacter(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E71B30>
	void SetAppearingMotionCharacter(struct USkeletalMeshComponent MeshComponent); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SetAppearingMotionCharacter(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E71AB0>
	void SendTrainingModeOff(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.SendTrainingModeOff(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E71A90>
	void ResponseTrainingModeOff__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.ResponseTrainingModeOff__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void PartyMemberInfoChanged__DelegateSignature(struct FString MemberUID, struct FBravoHotelPartyMemberInfo& MemberInfo); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.PartyMemberInfoChanged__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void PartyInvited__DelegateSignature(struct FBravoHotelPartyInvitation& Invitation); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.PartyInvited__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void PartyInfoChanged__DelegateSignature(struct FBravoHotelPartyInfo& PartyInfo); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.PartyInfoChanged__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnReadFriendsListComplete(int32_t LocalPlayerNum, char bWasSuccessful, struct FString ListName, struct FString PlatformName); // Function BravoHotelGame.BattleRoyaleGameMode_Login.OnReadFriendsListComplete(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E71910>
	void MatchingSucceeded__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.MatchingSucceeded__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void MatchingStarted__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.MatchingStarted__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void MatchingSettingsChanged__DelegateSignature(struct FBravoHotelMatchingSettings& Settings); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.MatchingSettingsChanged__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void MatchingPending__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.MatchingPending__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void MatchingFailed__DelegateSignature(int32_t ErrorCode, struct FString ExtraDescription); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.MatchingFailed__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void LoginSucceeded__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.LoginSucceeded__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void LoginNotify__DelegateSignature(struct FString Parameters); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.LoginNotify__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void LoginFailed__DelegateSignature(int32_t ErrorIndex, struct FString ErrorID, struct FString Parameters); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.LoginFailed__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	char IsValidationPassed(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.IsValidationPassed(Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E718C0>
	struct TArray<struct FString> GetServicePlatforms(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.GetServicePlatforms(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E717E0>
	struct FString GetServicePlatformName(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.GetServicePlatformName(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E71760>
	struct ABravoHotelCharacter GetLobbyPawn(int32_t Index); // Function BravoHotelGame.BattleRoyaleGameMode_Login.GetLobbyPawn(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E716D0>
	struct ABravoHotelCharacter GetCustomizePawn(); // Function BravoHotelGame.BattleRoyaleGameMode_Login.GetCustomizePawn(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E716A0>
	void EquipDefaultWeapon(struct ABravoHotelCharacter TargetCharacter, struct FName& ItemRowName, int32_t TargetWeaponSlotIndex); // Function BravoHotelGame.BattleRoyaleGameMode_Login.EquipDefaultWeapon(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E71590>
	void CreateCharacter__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameMode_Login.CreateCharacter__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
};

// Class BravoHotelGame.BravoHotelGameState
class ABravoHotelGameState : public AGameState {

public:

	char MatchWinnerTeam; // 0x388 (1)
	struct ABravoHotelPlayerState WinnerPlayerState; // 0x390 (8)
	int32_t TimeRemaining; // 0x398 (4)
	struct FName CurrentSeasonID; // 0x39C (8)
	int32_t PerkMode; // 0x3A4 (4)
	int32_t RecipeMode; // 0x3A8 (4)
	int32_t MaxPerkCount; // 0x3AC (4)
	int32_t OverrideUltimateLevel; // 0x3B0 (4)
	struct TMap<struct FName, int32_t> PerkClassNumCap; // 0x3B8 (80)
	struct TMap<struct FName, float> PerkClassWeightModifier; // 0x408 (80)
	struct TArray<struct FName> PerkClassBlock; // 0x458 (16)
	char bBlockSpawnVehicle : 0; // 0x468 (1)
	char bBlockRedZone : 0; // 0x469 (1)
	char PerkLevelUpAllUserSame : 0; // 0x46A (1)
	struct FString CQRKey; // 0x470 (16)
	enum class EGameViewType GameViewType; // 0x480 (1)
	enum class EMatchingType MatchingType; // 0x481 (1)
	struct FDateTime StartGameTime; // 0x488 (8)
	struct FName ExpertWeaponTableID; // 0x490 (8)
	int32_t PersonalSupplyBoxPositionType; // 0x498 (4)
	char NoDelaySpawnPersonalSupplyBox : 0; // 0x49C (1)
	char MustSpawnPersonalSupplyBox : 0; // 0x49D (1)
	int32_t RetiredPlayerCount; // 0x4A0 (4)
	struct TMap<int32_t, struct ABravoHotelPlayerState> UniqueIDPlayerStates; // 0x4A8 (80)
	struct FGuid MatchID; // 0x4F8 (16)
	struct FString GameServerID; // 0x508 (16)
	struct FGameSettingClassSelectInfoElement DefaultClassSelectInfo; // 0x528 (40)
	struct FGameSettingClassChangeInfoElement DefaultClassChangeInfo; // 0x550 (72)
	struct FGameSettingInfo CurrentGameSettingInfo; // 0x598 (136)
	char IsUsingOuterAreaBlueZone : 0; // 0x620 (1)
	struct ABravoHotelBlueZone BlueZone; // 0x628 (8)
	struct FMulticastInlineDelegate OnBlueZoneDelegate; // 0x630 (16)
	struct FMulticastInlineDelegate OnChangePerkModeDelegate; // 0x640 (16)
	float RecoilModifier_AR; // 0x66C (4)
	float RecoilModifier_SMG; // 0x670 (4)
	float RecoilModifier_SG; // 0x674 (4)
	float RecoilModifier_DMR; // 0x678 (4)
	float RecoilModifier_SR; // 0x67C (4)

	void ShowTimeHUDMessage(); // Function BravoHotelGame.BravoHotelGameState.ShowTimeHUDMessage(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F4F5F0>
	void OnRep_TimeRemaining(); // Function BravoHotelGame.BravoHotelGameState.OnRep_TimeRemaining(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F4F5D0>
	void OnRep_RecipeMode(); // Function BravoHotelGame.BravoHotelGameState.OnRep_RecipeMode(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F4F5B0>
	void OnRep_PerkMode(); // Function BravoHotelGame.BravoHotelGameState.OnRep_PerkMode(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F4F590>
	void OnRep_OverrideUltimateLevel(); // Function BravoHotelGame.BravoHotelGameState.OnRep_OverrideUltimateLevel(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F4F570>
	void OnRep_CurrentGameSettingInfo(); // Function BravoHotelGame.BravoHotelGameState.OnRep_CurrentGameSettingInfo(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F4F550>
	void OnRep_BlueZone(); // Function BravoHotelGame.BravoHotelGameState.OnRep_BlueZone(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F4F530>
	void OnChangePerkModeDelegate__DelegateSignature(int32_t PerkMode); // DelegateFunction BravoHotelGame.BravoHotelGameState.OnChangePerkModeDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	char IsDuplicateSelectPossible(); // Function BravoHotelGame.BravoHotelGameState.IsDuplicateSelectPossible(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F4F500>
	char IsCurrentStatusParty(); // Function BravoHotelGame.BravoHotelGameState.IsCurrentStatusParty(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F4F4D0>
	struct ABravoHotelPlayerState GetPlayerStateByUniqueID(int32_t UniqueID); // Function BravoHotelGame.BravoHotelGameState.GetPlayerStateByUniqueID(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F4F440>
	struct FString GetMatchIDString(); // Function BravoHotelGame.BravoHotelGameState.GetMatchIDString(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F4F3B0>
	struct ABravoHotelBlueZone GetBlueZone(); // Function BravoHotelGame.BravoHotelGameState.GetBlueZone(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F4F380>
	void ChangeRemainTime(int32_t RemainTime); // Function BravoHotelGame.BravoHotelGameState.ChangeRemainTime(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F4F2F0>
	void BlueZoneDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelGameState.BlueZoneDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
};

// Class BravoHotelGame.BattleRoyaleGameState
class ABattleRoyaleGameState : public ABravoHotelGameState {

public:

	char IsNewItemSpawnMode : 0; // 0x680 (1)
	int32_t TeamSize; // 0x684 (4)
	enum class EGameMode GameRule; // 0x688 (1)
	enum class EBattleRoyaleState BattleRoyaleState; // 0x689 (1)
	int32_t TotalPlayerCount; // 0x68C (4)
	int32_t TotalAIPlayerCount; // 0x690 (4)
	int32_t CurrentPlayerCount; // 0x694 (4)
	int32_t CurrentTeamCount; // 0x698 (4)
	int32_t TotalTeamCount; // 0x69C (4)
	struct FMulticastInlineDelegate OnBattleRoyalStateChanged; // 0x6A0 (16)
	struct FMulticastInlineDelegate OnRocketLaunch; // 0x6B0 (16)
	struct FMulticastInlineDelegate OnItemSpawnModeChanged; // 0x6C0 (16)
	struct FMulticastInlineDelegate OnChangeRemainTime; // 0x6D0 (16)
	char bCheckSeaLevelZ : 0; // 0x6E0 (1)
	float SeaLevelZ; // 0x6E4 (4)
	int32_t GhostPlayerCountForTest; // 0x6EC (4)
	struct FMulticastInlineDelegate OnRepTeamSize; // 0x6F0 (16)
	struct TArray<struct FCharacterDiedInfo> CharacterDiedInfos; // 0x700 (16)
	struct TArray<struct FTeamEndInfo> TeamEndInfos; // 0x710 (16)
	struct TArray<struct FAirCraftBoardingPlayerList> AirCraftBoardingInfos; // 0x720 (16)
	struct ABravoHotelRedZone redzone; // 0x730 (8)
	struct ABravoHotelRedZoneManager RedZoneManager; // 0x738 (8)
	struct FMulticastInlineDelegate AirCraftDescentPlayerInfoEvent; // 0x798 (16)
	struct FMulticastInlineDelegate EndAirCraftBoardingPlayerEvent; // 0x7A8 (16)
	struct ABravoHotelAircraftFlight AircraftFlightRef; // 0x7B8 (8)
	struct FMulticastInlineDelegate OnRepCurrentPlayerCount; // 0x7C0 (16)
	struct FMulticastInlineDelegate OnRepCurrentTeamCount; // 0x7D0 (16)
	struct FMulticastInlineDelegate OnUpdateClassCount; // 0x7E0 (16)
	struct TArray<struct Object> RestoreList; // 0x7F0 (16)
	struct FTimerHandle TimerHandle_MoveToLobbyLevel; // 0x808 (8)
	struct TMap<struct FName, int32_t> CurrentClassCounts; // 0x810 (80)
	int32_t AutoBotCount; // 0x860 (4)

	void SetDescentPlayerInfo(int32_t PlayerId); // Function BravoHotelGame.BattleRoyaleGameState.SetDescentPlayerInfo(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E73910>
	void SetAutoBotCount(int32_t Count); // Function BravoHotelGame.BattleRoyaleGameState.SetAutoBotCount(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E73890>
	void SetAirCraftBoardingPlayerInfo(char IsTeam, int32_t TeamID, int32_t PlayerId); // Function BravoHotelGame.BattleRoyaleGameState.SetAirCraftBoardingPlayerInfo(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E73790>
	void ResetAirCraftBoardingPlayerInfo(); // Function BravoHotelGame.BattleRoyaleGameState.ResetAirCraftBoardingPlayerInfo(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E73770>
	void RemainTimeDelegate__DelegateSignature(int32_t RemainTime); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.RemainTimeDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnUpdateClassCount__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.OnUpdateClassCount__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnRocketLaunch__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.OnRocketLaunch__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnRepTeamSize__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.OnRepTeamSize__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnRepCurrentPlayerCount__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.OnRepCurrentPlayerCount__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnRep_TeamSize(); // Function BravoHotelGame.BattleRoyaleGameState.OnRep_TeamSize(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E73750>
	void OnRep_CurrentTeamCount(); // Function BravoHotelGame.BattleRoyaleGameState.OnRep_CurrentTeamCount(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E73730>
	void OnRep_CurrentPlayerCount(); // Function BravoHotelGame.BattleRoyaleGameState.OnRep_CurrentPlayerCount(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E73710>
	void OnRep_ChangeNewItemSpawnMode(); // Function BravoHotelGame.BattleRoyaleGameState.OnRep_ChangeNewItemSpawnMode(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E736F0>
	void OnRep_BattleRoyaleState(); // Function BravoHotelGame.BattleRoyaleGameState.OnRep_BattleRoyaleState(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E736D0>
	void MulticastOnRocketLaunch(); // Function BravoHotelGame.BattleRoyaleGameState.MulticastOnRocketLaunch(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E736B0>
	void MulticastMoveToLobbyLevel(); // Function BravoHotelGame.BattleRoyaleGameState.MulticastMoveToLobbyLevel(Net|NetReliableNative|Event|NetMulticast|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E73690>
	void ItemSpawnModeDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.ItemSpawnModeDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	float GetSeaLevelZ(); // Function BravoHotelGame.BattleRoyaleGameState.GetSeaLevelZ(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E73660>
	struct ABravoHotelRedZone GetRedZone(); // Function BravoHotelGame.BattleRoyaleGameState.GetRedZone(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E73630>
	void FindAirCraftFlightActor(); // Function BravoHotelGame.BattleRoyaleGameState.FindAirCraftFlightActor(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E73610>
	void EndAirCraftBoardingPlayer__DelegateSignature(); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.EndAirCraftBoardingPlayer__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void EndAirCraftBoardingPlayer(); // Function BravoHotelGame.BattleRoyaleGameState.EndAirCraftBoardingPlayer(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E735F0>
	void DoRestore(); // Function BravoHotelGame.BattleRoyaleGameState.DoRestore(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E735D0>
	void DoMoveToLobbyLevel(float DelayTime); // Function BravoHotelGame.BattleRoyaleGameState.DoMoveToLobbyLevel(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E73550>
	void ClientExcuteEndAirCraftBoardingPlayerEvent(); // Function BravoHotelGame.BattleRoyaleGameState.ClientExcuteEndAirCraftBoardingPlayerEvent(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E73530>
	void ClientExcuteAirCraftDescentPlayerInfoEvent(int32_t AirCraftID, int32_t SeatID, int32_t PlayerId); // Function BravoHotelGame.BattleRoyaleGameState.ClientExcuteAirCraftDescentPlayerInfoEvent(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E73440>
	void BattleRoyalStateChanged__DelegateSignature(enum class EBattleRoyaleState PrevState, enum class EBattleRoyaleState CurrentState); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.BattleRoyalStateChanged__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void AirCraftDescentPlayerInfo__DelegateSignature(int32_t AirCraftID, int32_t SeatID, int32_t PlayerId); // DelegateFunction BravoHotelGame.BattleRoyaleGameState.AirCraftDescentPlayerInfo__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
};

// Class BravoHotelGame.BHPersonalSupplyBox
class ABHPersonalSupplyBox : public UActor {

public:

	char NeedInit : 0; // 0x318 (1)
	struct UBoxComponent RootBoxComponent; // 0x328 (8)
	struct USphereComponent InteractiveSphereComponent; // 0x330 (8)
	struct UBoxComponent InteractiveCancleSphereComponent; // 0x338 (8)
	struct FName BoxName; // 0x340 (8)
	struct TArray<int32_t> RelatedPlayerIds; // 0x348 (16)
	enum class EBoxStateType CurrentStateType; // 0x361 (1)
	char CheckRePosition : 0; // 0x362 (1)
	struct FTimerHandle TimeHandle_CheckRePosition; // 0x368 (8)
	int32_t CustomIndex; // 0x370 (4)
	char TraceLand : 0; // 0x374 (1)
	struct FTimerHandle TimerHandle_Destroy; // 0x378 (8)

	void UpdateCheckRePosition(); // Function BravoHotelGame.BHPersonalSupplyBox.UpdateCheckRePosition(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E74860>
	void RequestRePosition(float StartZ, float EndZ); // Function BravoHotelGame.BHPersonalSupplyBox.RequestRePosition(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E747A0>
	void RePosition(struct FVector& NewLocation); // Function BravoHotelGame.BHPersonalSupplyBox.RePosition(Final|Native|Public|HasOutParms|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E74710>
	void OnRep_SetStateType(); // Function BravoHotelGame.BHPersonalSupplyBox.OnRep_SetStateType(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E746F0>
	void OnRep_RelatedPlayerIds(); // Function BravoHotelGame.BHPersonalSupplyBox.OnRep_RelatedPlayerIds(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E746D0>
	void OnRep_CheckRePosition(); // Function BravoHotelGame.BHPersonalSupplyBox.OnRep_CheckRePosition(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E746B0>
	void OnRecall(); // Function BravoHotelGame.BHPersonalSupplyBox.OnRecall(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnOverlapEnd(struct UPrimitiveComponent OverlappedComponent, struct UActor OtherActor, struct UPrimitiveComponent OtherComp, int32_t OtherBodyIndex); // Function BravoHotelGame.BHPersonalSupplyBox.OnOverlapEnd(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E74570>
	void OnOverlapBegin(struct UPrimitiveComponent OverlappedComponent, struct UActor OtherActor, struct UPrimitiveComponent OtherComp, int32_t OtherBodyIndex, char bFromSweep, struct FHitResult& SweepResult); // Function BravoHotelGame.BHPersonalSupplyBox.OnOverlapBegin(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E74360>
	void OnChangeState(enum class EBoxStateType StateType); // Function BravoHotelGame.BHPersonalSupplyBox.OnChangeState(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnAssigned(); // Function BravoHotelGame.BHPersonalSupplyBox.OnAssigned(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	char IsReplatedBP(); // Function BravoHotelGame.BHPersonalSupplyBox.IsReplatedBP(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E74330>
	void GetRelatedPlayerIds(struct TArray<int32_t>& outList); // Function BravoHotelGame.BHPersonalSupplyBox.GetRelatedPlayerIds(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E74280>
	void DestroyBox(); // Function BravoHotelGame.BHPersonalSupplyBox.DestroyBox(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E74260>
	void ChangeBoxMesh(char IsMyBox); // Function BravoHotelGame.BHPersonalSupplyBox.ChangeBoxMesh(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
};

// Class BravoHotelGame.BravoHotelDropBoxActor
class ABravoHotelDropBoxActor : public UActor {

public:

	enum class EPickupRoot RootType; // 0x318 (1)
	struct UBoxComponent RootBoxComponent; // 0x320 (8)
	struct UDropBoxInventoryComponent InventoryComponent; // 0x328 (8)
	struct USphereComponent InteractiveSphereComponent; // 0x330 (8)
	struct UBoxComponent InteractiveCancleSphereComponent; // 0x338 (8)
	struct FName DropperNickName; // 0x340 (8)
	struct FName BoxName; // 0x348 (8)
	int32_t RarityIndex; // 0x350 (4)
	struct ABravoHotelCharacter DetectedCharacter; // 0x358 (8)

	void SetItemInBlueprint(struct FName& ItemKey); // Function BravoHotelGame.BravoHotelDropBoxActor.SetItemInBlueprint(Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnOverlapEnd(struct UPrimitiveComponent OverlappedComponent, struct UActor OtherActor, struct UPrimitiveComponent OtherComp, int32_t OtherBodyIndex); // Function BravoHotelGame.BravoHotelDropBoxActor.OnOverlapEnd(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F41020>
	void OnOverlapBegin(struct UPrimitiveComponent OverlappedComponent, struct UActor OtherActor, struct UPrimitiveComponent OtherComp, int32_t OtherBodyIndex, char bFromSweep, struct FHitResult& SweepResult); // Function BravoHotelGame.BravoHotelDropBoxActor.OnOverlapBegin(Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F40E20>
	void OnDeactivated(); // Function BravoHotelGame.BravoHotelDropBoxActor.OnDeactivated(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnBoxChanged(); // Function BravoHotelGame.BravoHotelDropBoxActor.OnBoxChanged(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F40E00>
	void OnActivated(); // Function BravoHotelGame.BravoHotelDropBoxActor.OnActivated(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void AddItemsToBox(struct TArray<struct FSpawnItemResult>& ItemsToSpawn); // Function BravoHotelGame.BravoHotelDropBoxActor.AddItemsToBox(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F40D20>
};

// Class BravoHotelGame.BHPersonalSupplyBoxDummy
class ABHPersonalSupplyBoxDummy : public ABravoHotelDropBoxActor {

public:

	int32_t playerGUID; // 0x398 (4)
};

// Class BravoHotelGame.BHPersonalSupplyBoxManager
class ABHPersonalSupplyBoxManager : public AInfo {

public:

	struct UClass* SupplyBoxClass; // 0x318 (8)
	struct TArray<struct FPersonalSupplyPhaseInfo> ListPhaseInfo; // 0x320 (16)
	int32_t CurrentPhaseNum; // 0x330 (4)
	struct TArray<struct ABHPersonalSupplyBox> ListUsableSupplyBox; // 0x338 (16)
	struct TMap<int32_t, struct ABHPersonalSupplyBox> MapSupplyBox; // 0x348 (80)
	struct FName TestRandomTableID; // 0x398 (8)
	char UseTestRandom : 0; // 0x3A0 (1)
	struct TArray<struct ABHPersonalSupplyBox> SpawnedSupplyBoxList; // 0x3B8 (16)
	struct TArray<struct ABHPersonalSupplyBox> ForceSpawnedSupplyBoxList; // 0x3C8 (16)

	void SetCurrentPhaseNum(int32_t PhaseNum); // Function BravoHotelGame.BHPersonalSupplyBoxManager.SetCurrentPhaseNum(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E74D40>
	void RecallAll(); // Function BravoHotelGame.BHPersonalSupplyBoxManager.RecallAll(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E74D20>
	void ReassignAll(char Force); // Function BravoHotelGame.BHPersonalSupplyBoxManager.ReassignAll(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E74C90>
};

// Class BravoHotelGame.BravoHotelCharacter
class ABravoHotelCharacter : public ACharacter {

public:

	struct UAkComponent AudioComponent; // 0x1C80 (8)
	struct USceneComponent CameraBase; // 0x17C0 (8)
	struct USpringArmComponent CameraAssistant3P; // 0x1508 (8)
	struct UBravoHotelCameraComponent Camera3P; // 0x1140 (8)
	struct UPointLightComponent CharacterBackLight; // 0xA30 (8)
	struct UPointLightComponent CharacterBackLightSecond; // 0x1EC0 (8)
	float BackLightIntensity_FPP; // 0xB40 (4)
	float BackLightIntensity_ADS; // 0x1260 (4)
	struct TArray<struct UParticleSystemComponent> BuffParticleComponents; // 0xEF0 (16)
	struct UCustomizableSkeletalComponent MutableComponent; // 0xAA8 (8)
	struct USphereComponent InteractiveSphereComponent; // 0x2480 (8)
	struct USphereComponent InteractiveCancleSphereComponent; // 0x31E8 (8)
	struct USkeletalMeshComponent Parachute; // 0x3858 (8)
	struct UParticleSystemComponent WaterParticleSystem; // 0xE78 (8)
	struct UParticleSystemComponent FlameDamageParticleComponent; // 0x1D50 (8)
	struct UParticleSystem FlameDamageParticle; // 0x34E8 (8)
	struct UBravoHotelSTMComponent STMComponent; // 0x2DF8 (8)
	struct UBravoHotelActionComponent ActionComponent; // 0x1E20 (8)
	struct UBravoHotelPerkComponent PerkComponent; // 0xD48 (8)
	struct UTeamInfoUpdaterComponent TeamInfoUpdaterComponentRef; // 0x2758 (8)
	struct FTimerHandle TimeHandle_MolotovDotDamage; // 0x1538 (8)
	struct FAnimSlot Stand_FlameDotDamageAnim; // 0xBF0 (16)
	struct FAnimSlot Prone_FlameDotDamageAnim; // 0xDA8 (16)
	struct TArray<struct FMolotovFlameDotDamageInfo> FlameDamageInfos; // 0x3600 (16)
	struct FString NPCNickName; // 0x10C8 (16)
	char bAllowToggleCamera : 0; // 0x839 (1)
	char bThirdPerson : 0; // 0x24B9 (1)
	float SprintingMoveRightModifier; // 0x1C90 (4)
	float LeanValue; // 0x37B4 (4)
	float LeanDegreeMax; // 0x1540 (4)
	float LeanUpdateSpeed; // 0x934 (4)
	enum class ELeanState SaveLeanState; // 0x2DA8 (1)
	enum class ELeanState PrevLeanState; // 0x33F1 (1)
	char bFixLeanDegreeMax : 0; // 0x1330 (1)
	char bFixFPPFoV : 0; // 0x20F4 (1)
	float Health; // 0xC40 (4)
	float ShortTimeHealth; // 0x1E28 (4)
	float TargetHealth; // 0x17EC (4)
	float BandageTargetHealth; // 0x9E0 (4)
	float OverHealHealth; // 0xD78 (4)
	struct UClass* PP_Preset_ShortHealth; // 0x1BE0 (8)
	struct UCameraPostProcessPreset PPInst_ShortHealth; // 0x2990 (8)
	struct TMap<enum class ETargetHealthType, struct FTargetHealthInfo> TargetHealthMap; // 0x11F8 (80)
	float Oxygen; // 0x2264 (4)
	float SteadyPoint; // 0x3720 (4)
	int8_t BoostPercent; // 0x15B8 (1)
	float Default3PFOV; // 0x1E90 (4)
	float Default3PFOV_AOS; // 0xCEC (4)
	float Default3PFOV_AMP; // 0x11F0 (4)
	float Default3PFOV_HeartBeatSensor; // 0x3800 (4)
	float Default3PFOV_SkillMAP; // 0x36CC (4)
	float ForwardAxisValue; // 0x2ED0 (4)
	float RightAxisValue; // 0x38C0 (4)
	float InputMovementAttenuationTime; // 0x30B4 (4)
	float InputMovementAttenuationTimeIdleToCrouch; // 0x2260 (4)
	float InputMovementAttenuationTimeIdleToProne; // 0x2498 (4)
	float InputMovementAttenuationTimeProneToIdle; // 0x24D8 (4)
	float InputMovementAttenuationValueIdleToCrouch; // 0x99C (4)
	float InputMovementAttenuationValueIdleToProne; // 0x2CF4 (4)
	float InputMovementAttenuationValueProneToIdle; // 0x1378 (4)
	float InputMovementAttenuationValue; // 0x1B18 (4)
	char bMovementKeyPushed : 0; // 0x1B98 (1)
	char bLastMovementKeyPushed : 0; // 0xD50 (1)
	char bMovementInputLock : 0; // 0x3324 (1)
	struct FVector2D InputAxisOnLockMovement; // 0x22FC (8)
	char bInputKeyJump : 0; // 0x2278 (1)
	float DoubleTapDelay_ToggleLean; // 0xD10 (4)
	char bShouldSprint : 0; // 0x2284 (1)
	enum class EFireType FireTypeComplete; // 0x1068 (1)
	struct UDataTable PerBoneDamageTable; // 0x30C0 (8)
	struct UDataTable MeleeDamageTable; // 0xCC8 (8)
	struct UDataTable PistolsDamageTable; // 0x1B90 (8)
	struct UDataTable ShotgunsDamageTable; // 0x39D0 (8)
	struct UDataTable SMGsDamageTable; // 0xD98 (8)
	struct UDataTable ARsDamageTable; // 0x2248 (8)
	struct UDataTable DMRsDamageTable; // 0x2308 (8)
	struct UDataTable SRsDamageTable; // 0x2838 (8)
	struct UClass* BrokenHelmetClass; // 0x2410 (8)
	char bNeedToSpawnBrokenEquipment : 0; // 0x2E20 (1)
	float BrokenEquipmentLevel; // 0xF00 (4)
	struct FVector BrokenEquipmentDamagedDirection; // 0x1DD0 (12)
	enum class EWearableItemType BrokenEquipmentType; // 0x2110 (1)
	enum class EInteractionType InteractionType; // 0xD58 (1)
	float InteractionTraceDistance; // 0x1550 (4)
	struct UActor DetectedInteractionActor; // 0x3330 (8)
	struct UPrimitiveComponent DetectedInteractionComponet; // 0x2BD0 (8)
	struct USceneComponent DetectedVehicleSeatComponent; // 0x31B8 (8)
	struct TArray<struct UActor> DetectedInteractionCancleActors; // 0x2068 (16)
	struct TMap<struct UClass*, float> InteractionDistRatioMap; // 0x25B0 (80)
	float ResurrectionCameraBlendTime; // 0x8AC (4)
	struct UClass* PostProcessResurrectionClass; // 0x1770 (8)
	struct UCurveFloat ResurrectionEffectCurve; // 0xCD8 (8)
	struct TScriptInterface<IMaterialControllableInterface> ResurrectionMaterialController; // 0x1130 (16)
	struct ABravoHotelPickup DetectedPickableItem; // 0x37E8 (8)
	struct TArray<struct ABravoHotelPickup> DetectedItemList; // 0x3840 (16)
	struct TArray<struct ABravoHotelDropBoxActor> DetectedBoxList; // 0x2CC8 (16)
	struct TArray<struct ABravoHotelCharacter> DetectedStealableList; // 0x970 (16)
	struct TArray<struct ABravoHotelPickup> DetectedItemHideList; // 0x30C8 (16)
	struct FTimerHandle TimerHandle_CheckDetectedItemList; // 0xC60 (8)
	struct UPlayerInventoryComponent InventoryComponent; // 0x2EE0 (8)
	struct UBravoHotelAbilityComponent AbilityComponent; // 0x1060 (8)
	struct UBravoHotelDoorComponent DoorComponent; // 0x3790 (8)
	struct UParkourComponent ParkourComponent; // 0x2760 (8)
	struct UBravoHotelBlueZoneGameRule BlueZoneGameRule; // 0x2050 (8)
	struct UBravoHotelVoiceComponent VoiceComponent; // 0x3458 (8)
	struct ULadderComponent LadderComponent; // 0x33C8 (8)
	struct UBHStationaryCharInfo StationaryCharInfo; // 0x1280 (8)
	struct UBHCharacterReplication CharacterReplication; // 0xA98 (8)
	struct FAnimSlot CombineAnim_Stand; // 0x1048 (16)
	struct FAnimSlot CombineAnim_Prone; // 0xFC0 (16)
	struct FAnimSlot RepairAnim_Stand; // 0x3000 (16)
	struct FAnimSlot RepairAnim_Prone; // 0x1970 (16)
	struct UAnimMontage CurrentPickupMontage; // 0x19D8 (8)
	struct FAnimSlot PickUpAnim_Unarmed_Floor; // 0x2C50 (16)
	struct FAnimSlot PickUpAnim_Unarmed_Table; // 0xAE0 (16)
	struct FAnimSlot PickUpAnim_Unarmed_Crouch; // 0x8C8 (16)
	struct FAnimSlot PickUpAnim_Unarmed_Prone; // 0x3340 (16)
	struct FAnimSlot PickUpAnim_Rifle_Floor; // 0x31A0 (16)
	struct FAnimSlot PickUpAnim_Rifle_Table; // 0x1380 (16)
	struct FAnimSlot PickUpAnim_Rifle_Crouch; // 0x9D0 (16)
	struct FAnimSlot PickUpAnim_Rifle_Prone; // 0xFE0 (16)
	struct FAnimSlot PickUpAnim_Pistol_Floor; // 0x1858 (16)
	struct FAnimSlot PickUpAnim_Pistol_Table; // 0x36E0 (16)
	struct FAnimSlot PickUpAnim_Pistol_Crouch; // 0x11E0 (16)
	struct FAnimSlot PickUpAnim_Pistol_Prone; // 0x2F68 (16)
	struct FAnimSlot DoorAnim_Open; // 0x28D0 (16)
	struct FAnimSlot DoorAnim_Close; // 0x3968 (16)
	struct FAnimSlot DoorAnim_Kick; // 0x3558 (16)
	struct FAnimSlot MovementAnim_GetUpFromBack; // 0x3598 (16)
	struct FAnimSlot MovementAnim_GetUpFromFront; // 0x32E8 (16)
	struct FAnimSlot ConditionAnim_ShakeOut_Unarmed; // 0x23C8 (16)
	struct FAnimSlot ConditionAnim_ShakeOut_Rifle; // 0x20B0 (16)
	struct TArray<struct FAnimSlot> MeleeAnim_Punch_Idle; // 0x1580 (16)
	struct TArray<struct FAnimSlot> MeleeAnim_Punch_Crouch; // 0x28B0 (16)
	struct FAnimSlot MeleeAnim_Punch_Jump; // 0x2D60 (16)
	struct TArray<struct FAnimSlot> MeleeAnim_Rifle_Idle; // 0x1898 (16)
	struct TArray<struct FAnimSlot> MeleeAnim_Rifle_Crouch; // 0x1030 (16)
	struct TArray<struct FAnimSlot> MeleeAnim_Pistol_Idle; // 0x19A0 (16)
	struct TArray<struct FAnimSlot> MeleeAnim_Pistol_Crouch; // 0xCF0 (16)
	struct TArray<struct FAnimSlot> DeathAnim_Crouch; // 0x8B8 (16)
	struct TArray<struct FAnimSlot> DeathAnim_FlameDamage; // 0x2AA8 (16)
	struct TArray<struct FAnimSlot> DeathAnim_Grenade; // 0x33A8 (16)
	struct TArray<struct FAnimSlot> DeathAnim_HeadShot; // 0x29B0 (16)
	struct TArray<struct FAnimSlot> DeathAnim_Natural; // 0x1C00 (16)
	struct TArray<struct FAnimSlot> DeathAnim_Rifle; // 0x1488 (16)
	struct TArray<struct FAnimSlot> DeathAnim_Shotgun; // 0x2320 (16)
	struct TArray<struct FAnimSlot> DeathAnim_Sprint; // 0x36F8 (16)
	struct TArray<struct FAnimSlot> DeathAnim_Falling; // 0x35A8 (16)
	struct UAnimationAsset DeathAnim_ClosedEyes; // 0x32C0 (8)
	struct UAkAudioEvent PickUpStartEvent; // 0x2A18 (8)
	struct UAkAudioEvent PickUpBackpackEvent; // 0x3718 (8)
	struct FAnimSlot EquipAnim_MainWeapon1; // 0x1C58 (16)
	struct FAnimSlot EquipAnim_MainWeapon1_Prone; // 0x2418 (16)
	struct FAnimSlot EquipAnim_MainWeapon2; // 0x23B8 (16)
	struct FAnimSlot EquipAnim_MainWeapon2_Prone; // 0x9F0 (16)
	struct FAnimSlot EquipAnim_SubWeapon; // 0xD60 (16)
	struct FAnimSlot EquipAnim_SubWeapon_Prone; // 0x1E00 (16)
	struct FAnimSlot EquipAnim_Melee; // 0x1830 (16)
	struct FAnimSlot EquipAnim_Melee_Prone; // 0x2D78 (16)
	struct FAnimSlot EquipAnim_Amplifier; // 0x32D0 (16)
	struct FAnimSlot EquipAnim_Amplifier_Prone; // 0x3750 (16)
	struct FAnimSlot EquipAnim_HeartBeatSensor; // 0xEA0 (16)
	struct FAnimSlot EquipAnim_HeartBeatSensor_Prone; // 0x1B00 (16)
	struct FAnimSlot SlidingAnim; // 0x2D30 (16)
	struct FAnimSlot RollingAnim; // 0x3298 (16)
	struct FAnimSlot KnockbackRollingAnim; // 0x2980 (16)
	struct FAnimSlot EquipAnim_ThrowingWeapon; // 0x2970 (16)
	struct FAnimSlot EquipAnim_Prone_ThrowingWeapon; // 0x22A8 (16)
	struct FAnimSlot UnequipAnim_MainWeapon1; // 0x1E98 (16)
	struct FAnimSlot UnequipAnim_MainWeapon1_Prone; // 0x3200 (16)
	struct FAnimSlot UnequipAnim_MainWeapon2; // 0x2DD0 (16)
	struct FAnimSlot UnequipAnim_MainWeapon2_Prone; // 0x38D0 (16)
	struct FAnimSlot UnequipAnim_SubWeapon; // 0x23F0 (16)
	struct FAnimSlot UnequipAnim_SubWeapon_Prone; // 0x2340 (16)
	struct FAnimSlot UnequipAnim_Melee; // 0xC30 (16)
	struct FAnimSlot UnequipAnim_Melee_Prone; // 0x3238 (16)
	struct FAnimSlot UnequipAnim_Amplifier; // 0x1070 (16)
	struct FAnimSlot UnequipAnim_Amplifier_Prone; // 0x1108 (16)
	struct FAnimSlot UnequipAnim_HeartBeatSensor; // 0x10E0 (16)
	struct FAnimSlot UnequipAnim_HeartBeatSensor_Prone; // 0x1940 (16)
	struct FAnimSlot UnequipAnim_ThrowingWeapon; // 0x1080 (16)
	struct FAnimSlot UnequipAnim_Prone_ThrowingWeapon; // 0x1398 (16)
	struct FAnimSlot LandingAnim_LandStop; // 0x2D98 (16)
	struct FAnimSlot LandingAnim_Parachute; // 0x1780 (16)
	struct FAnimSlot LandingAnim_Unarmed; // 0x1000 (16)
	struct FAnimSlot LandingAnim_Rifle; // 0x2A98 (16)
	struct FAnimSlot LandingAnim_Pistol; // 0x33D0 (16)
	struct TArray<struct FResuscitationAnimSet> ResuscitationAnimSets; // 0x12F8 (16)
	struct TArray<struct UAkAudioEvent> WeaponEquipEvents; // 0x1BB0 (16)
	struct TArray<struct UAkAudioEvent> AttachmentEquipEvents; // 0x37B8 (16)
	struct TArray<struct UAkAudioEvent> WearableEquipEvents; // 0x2BC0 (16)
	struct TArray<struct UAkAudioEvent> ConsumablesEvents; // 0x3698 (16)
	struct UAkAudioEvent MedipackUseEvent; // 0x1090 (8)
	struct UAkAudioEvent ItemDropEvent; // 0x12C8 (8)
	struct UAkAudioEvent ADSEnterEvent; // 0x3088 (8)
	struct UAkAudioEvent ADSEnterEvent_Digital; // 0xB28 (8)
	struct UAkAudioEvent ADSExitEvent; // 0x3030 (8)
	struct UAkAudioEvent ADSExitEvent_Digital; // 0x36F0 (8)
	struct UAkAudioEvent AOSEnterEvent; // 0x2490 (8)
	struct UAkAudioEvent AOSExitEvent; // 0x2EF0 (8)
	struct UAkAudioEvent AMPEnterEvent; // 0x1BA0 (8)
	struct UAkAudioEvent AMPExitEvent; // 0x30D8 (8)
	struct UAkAudioEvent AMPNoiseEvent; // 0xF98 (8)
	struct UAkAudioEvent AMPNoiseStopEvent; // 0x2E18 (8)
	struct UAkAudioEvent PlosiveSoundDetection3LvEvent; // 0x3788 (8)
	struct UAkAudioEvent HeartBeatSensorEnterEvent; // 0x3B08 (8)
	struct UAkAudioEvent HeartBeatSensorExitEvent; // 0x1288 (8)
	struct UAkAudioEvent HeartBeatSensorNoiseEvent; // 0x1B38 (8)
	struct UAkAudioEvent HeartBeatSensorNoiseStopEvent; // 0xCC0 (8)
	struct UAkAudioEvent DamagedEvent; // 0x1018 (8)
	struct UAkAudioEvent HitEvent; // 0x3A88 (8)
	struct UAkAudioEvent SnowAreaEnteringEvent; // 0x1460 (8)
	struct UAkAudioEvent UltimateSprintEvent; // 0x20A8 (8)
	char bIsParachuteLanding : 0; // 0x2A30 (1)
	float ParachuteLandingHeight; // 0x106C (4)
	struct UAkAudioEvent StartDescendingEvent; // 0x1B20 (8)
	struct UAkAudioEvent ParachuteFoldEvent; // 0x2BF8 (8)
	struct FTimerHandle TimerHandle_Sequnce; // 0x2798 (8)
	struct UWidgetComponent TeamPosition; // 0xCA8 (8)
	float AdditionalTeamPositionWidgetHeight; // 0x376C (4)
	float TeamPositionWidgetInterpSpeed; // 0x2A34 (4)
	float CurrentTeamPositionHeight; // 0x2010 (4)
	struct FMulticastInlineDelegate OnChangeDetectedItems; // 0xE40 (16)
	char bIsArmedBeforeAction : 0; // 0x36B8 (1)
	struct FMulticastInlineDelegate Delegate_OnViewCameraInWater; // 0x37C8 (16)
	struct FMulticastInlineDelegate Delegate_OnViewCameraOutWater; // 0x3830 (16)
	char bInSmoke : 0; // 0x17D9 (1)
	struct FMulticastInlineDelegate Delegate_OnInSmoke; // 0x1FB8 (16)
	struct FMulticastInlineDelegate Delegate_OnOutSmoke; // 0x3228 (16)
	struct TArray<struct UActor> SmokeActors; // 0x28F8 (16)
	struct UAkAudioEvent SwimDiveEvent; // 0xD08 (8)
	char bIsEnterIndoorVolume : 0; // 0x1D00 (1)
	struct USkyLightComponent SkyLightRef; // 0x36B0 (8)
	float PrevSkyLightIntensityCache; // 0x29C0 (4)
	struct FColor PrevSkyLightOcclusionTintCache; // 0x1010 (4)
	float SkyLightCurrentPriority; // 0x1AE8 (4)
	struct TArray<struct UInDoorVolumeComponent> OverlappedInDoorVolumes; // 0x27A8 (16)
	struct UBravoHotelPhysicalMaterial LastSteppedSurface; // 0x1790 (8)
	char SurfaceType; // 0x330B (1)
	char SurfaceType_LastTick; // 0x12DC (1)
	float MP_SnowInterpSpeed; // 0x9A4 (4)
	struct FTimerHandle TimerHandle_BreathEffect; // 0x2778 (8)
	struct UParticleSystemComponent BreathParticleComponent; // 0x36A8 (8)
	struct UParticleSystem BreathParticle_Idle; // 0x1350 (8)
	struct UParticleSystem BreathParticle_Moving; // 0x830 (8)
	struct UParticleSystem InWaterParticle; // 0xFF0 (8)
	struct FMulticastInlineDelegate OnUpdateMutableDelegate; // 0x2868 (16)
	struct ABravoHotelWaterPhysicsVolume OverlapWaterVolume; // 0x20D8 (8)
	char bIsMelee : 0; // 0x151D (1)
	char bIsMeleeJumpAttack : 0; // 0xA80 (1)
	char bCanJumpMeleeAttack : 0; // 0x2600 (1)
	char bIsMeleeAttackBlocked : 0; // 0x22A0 (1)
	float LastMeleeAttackTime; // 0x1D78 (4)
	struct FAnimSlot CurrentMeleeAnimSlot; // 0x8F0 (16)
	struct TArray<struct UActor> ActorsToIgnore_Melee; // 0x1728 (16)
	struct TArray<struct UPrimitiveComponent> MeshesToIgnore_Melee; // 0x35F0 (16)
	float UnarmedMeleeDamage_Ground; // 0x1CAC (4)
	float UnarmedMeleeDamage_Jump; // 0x1C30 (4)
	char bIsFired : 0; // 0x29E8 (1)
	char bWantsToFire : 0; // 0x36D0 (1)
	char bWantsToAOS : 0; // 0x24DC (1)
	char bIsLanded : 0; // 0x1EE0 (1)
	float FiredTimeCount; // 0x2B28 (4)
	float StartFireTime; // 0x3060 (4)
	char bIsADSFireToCamera : 0; // 0x1798 (1)
	float FireToCameraLocationCorrection; // 0x12B0 (4)
	struct FRotator ArmsLagRotation; // 0x2F28 (12)
	float ArmsLagDeltaMin; // 0x28F0 (4)
	float ArmsLagDeltaMax; // 0x3B60 (4)
	float DefaultsArmsLagRotationMax; // 0xAA4 (4)
	float DefaultsArmsLagRotationSpeed; // 0x1BA8 (4)
	struct TMap<enum class EWeaponAttachmentItem, struct FBravoHotelArmsLag> ArmsLags; // 0x27E8 (80)
	float ArmsLagBaseModify; // 0x2258 (4)
	float ArmsLagWeaponModify; // 0x3038 (4)
	struct FRotator ArmsLagWeaponRotation; // 0x2CB8 (12)
	struct FRotator ADSDeltaRotation; // 0x18B0 (12)
	struct FVector ADSEndLocation; // 0x27D8 (12)
	char bSteadyAim : 0; // 0x1F14 (1)
	struct FVector LastSwayRotationOnSteadyAim; // 0x2CD8 (12)
	struct UAkAudioEvent SteadyAimReadyEvent; // 0x39E8 (8)
	struct UAkAudioEvent SteadyAimStartEvent; // 0x3538 (8)
	struct UAkAudioEvent SteadyAimEndEvent; // 0x2048 (8)
	float HeadShotBloodEffectDistance; // 0xA10 (4)
	struct UParticleSystem HeadShotHelmetFxEmitterTemplate; // 0x14D0 (8)
	float BoltActionDelayTime; // 0x3924 (4)
	char bWaitingADSReturn : 0; // 0x2A3D (1)
	float ADSReturnEnableTime; // 0x24C4 (4)
	float Delay_AOSToADS; // 0x3610 (4)
	char bNeedToBeADS : 0; // 0x35BC (1)
	struct FTimerHandle TimerHandle_ADSProcess; // 0x28C8 (8)
	struct UClass* PP_Preset_ADS; // 0x27A0 (8)
	struct UCameraPostProcessPreset PPInst_ADS; // 0x24B0 (8)
	float ReplayInputForwardAxisValue; // 0x1F08 (4)
	float ReplayInputRightAxisValue; // 0x1C2C (4)
	struct FVector2D CurrentInputAxis; // 0x1254 (8)
	struct FMulticastInlineDelegate Delegate_OnCameraViewModeChanged; // 0x5E8 (16)
	struct UAkAudioEvent ZoomInAudioEvent_Digital; // 0x33F8 (8)
	struct UAkAudioEvent ZoomOutAudioEvent_Digital; // 0xF48 (8)
	float ZoomAudioEventRepeatDelay; // 0x1854 (4)
	float ZoomAudioEventLastPlayTime; // 0x11D8 (4)
	struct FMulticastInlineDelegate OnPickableItemDetected; // 0x628 (16)
	float OverHeadTraceDistance; // 0x2A38 (4)
	char bShouldAdjustOverHead : 0; // 0x2D10 (1)
	float UpdateAnimationDistance; // 0x2ED8 (4)
	char bIsDisarming : 0; // 0x668 (1)
	struct UAkAudioEvent ResuscitationStopEvents; // 0x3508 (8)
	struct ABravoHotelCharacter ResuscitatingCharacter; // 0x2D00 (8)
	float RequestResuscitationCoolTime; // 0xFA4 (4)
	struct FAnimSlot CurrentResuscitationAnimSlot; // 0x3528 (16)
	struct FTimerHandle TimerHandle_SetIsFired; // 0x1F00 (8)
	float KillAssistValidTime; // 0x31CC (4)
	int32_t KillAssistMaxCount; // 0x1930 (4)
	float KnockOutAssistValidTime; // 0x1F0C (4)
	int32_t KnockOutAssistMaxCount; // 0x12C0 (4)
	struct TArray<struct FAssistInfo> AssistInfo; // 0x20C8 (16)
	float ThrowingWeaponFireDelay; // 0x1308 (4)
	float PreShootDeltaSecond; // 0x2998 (4)
	char bIsParachuteAvailable : 0; // 0x35CC (1)
	float ParachuteInputForward; // 0xFA0 (4)
	float ParachuteInputRight; // 0xF04 (4)
	float ParachuteForwardMomentum; // 0x1570 (4)
	struct FRotator ParachuteLastRotator; // 0x820 (12)
	float CurrentParachuteMaxMomentum; // 0x1C94 (4)
	float ParachuteMaxMomentum; // 0x2254 (4)
	float ParachuteMomentumAcc; // 0x2F34 (4)
	float ParachuteMomentumDeacc; // 0x3690 (4)
	float ParachuteMomentumZ; // 0x20C0 (4)
	float DescentInputVectorAcc; // 0x36BC (4)
	float ParachuteInputVectorAcc; // 0x1B30 (4)
	float ParachuteVelocityChangeFinalRate; // 0x37E0 (4)
	float ParachuteVelocityChangeZDecRate; // 0x990 (4)
	float ParachuteLandingVelocityZ; // 0x20C4 (4)
	float ParachuteLandingVelocityXY; // 0x2120 (4)
	float ForwardMomentumRangeMin; // 0x35C8 (4)
	float ForwardMomentumRangeMax; // 0x1430 (4)
	float CurrentYawSpeed; // 0x35E4 (4)
	float CurrentRollSpeed; // 0x1818 (4)
	float CurrentPitchSpeed; // 0x2750 (4)
	float MinPitchInParachute; // 0x1044 (4)
	float MaxPitchInParachute; // 0xA50 (4)
	float GlidePitchInParachute; // 0x1DDC (4)
	float MinRollInParachute; // 0x12D8 (4)
	float MaxRollInParachute; // 0x1420 (4)
	float MaxRollInParachuteVelocity; // 0x1528 (4)
	float ParachuteTurnSpeedYaw; // 0x2BD8 (4)
	float ParachuteTurnSpeedPitch; // 0x2548 (4)
	float ParachuteTurnSpeedRoll; // 0xF50 (4)
	float ParachuteTurnChangeSpeedYaw; // 0x10D8 (4)
	float ParachuteTurnChangeSpeedPitch; // 0x1BAC (4)
	float ParachuteTurnChangeSpeedRoll; // 0x2028 (4)
	float HeightToGetInParachuteFromLand; // 0x12E8 (4)
	float ForceHeightToGetInParachuteFromLand; // 0xD40 (4)
	struct FVector_NetQuantize ReplicatedParachuteVelocity; // 0x1CB8 (12)
	struct UCurveFloat ParachutePitchCurve; // 0x1590 (8)
	struct TArray<struct TSoftObjectPtr<UMaterialInterface>> ParachuteSkinMaterials; // 0x24A0 (16)
	struct UMaterialInterface CurrentParachuteSkin; // 0x3428 (8)
	char bChangeNearClipPlane : 0; // 0x3851 (1)
	float DescentStartZPosition; // 0x211C (4)
	float ParachuteAvailableFallingDistance; // 0x1274 (4)
	float DescentZ; // 0xCE8 (4)
	float SeaLevelZ; // 0x1D74 (4)
	float SaveMaxWalkSpeed; // 0x36D8 (4)
	float SaveCameraBoomLocationZ; // 0x9E8 (4)
	float PosToGetInParachute; // 0xCE4 (4)
	struct UClass* AccelerationPPClass; // 0x28A0 (8)
	struct UCurveFloat RadialOnDescentCurve; // 0x3328 (8)
	float RadialRate; // 0x2CC4 (4)
	float DescentBlurWidth; // 0x2D5C (4)
	struct UCameraPostProcessPreset AccelerationPPInst; // 0x29F8 (8)
	float TargetSpringArmLengthDescent; // 0xC00 (4)
	float SpeedSpringArmLengthDesecnt; // 0x3400 (4)
	char bDescentCameraShakeLoop : 0; // 0x1EF8 (1)
	float DescentCameraShakeDelay; // 0x1CD4 (4)
	struct UClass* DescentCameraShake; // 0xE60 (8)
	struct UParticleSystem CloudFxEmitterTemplate; // 0xED8 (8)
	struct UParticleSystemComponent CloudFxInDescent; // 0xC78 (8)
	float VelocityZ_LandStop; // 0x2270 (4)
	float VelocityZ_Falling; // 0x2CA0 (4)
	float PrevMeshRelativeZ; // 0x9E4 (4)
	float PronedEyeHeight; // 0x126C (4)
	char bIsProneWeaponIdle : 0; // 0x330A (1)
	char bIsAutoSprint : 0; // 0x3080 (1)
	float PronedDeltaHeightCamera3P; // 0xAB0 (4)
	float CrouchedDeltaHeightCamera3P; // 0x2510 (4)
	float CrouchMovedDeltaHeightCamera3P; // 0x2934 (4)
	float StandDeltaHeightCamera3P; // 0x2F20 (4)
	float StandSprintDeltaHeightCamera3P; // 0x2274 (4)
	struct FVector Camera1PInterpSrc; // 0x3510 (12)
	struct FVector Camera3PInterpSrc; // 0x3448 (12)
	struct FVector Camera3PInterpDst; // 0x37A8 (12)
	float TargetArmLength; // 0x2BF0 (4)
	float TargetArmLengthInterpSpeed; // 0x1B14 (4)
	float TargetArmLengthInterpSpeed_AMP; // 0x3250 (4)
	float TargetArmLengthInterpSpeed_HeartBeatSensor; // 0x1990 (4)
	float TargetFieldOfView; // 0x1D64 (4)
	struct FVector TargetSocketOffset; // 0xA18 (12)
	float DefaultCameraLag; // 0x33E8 (4)
	float ReturnCameraLag; // 0xBE8 (4)
	struct FVector DefaultSocketOffset_VehicleAOS; // 0xA44 (12)
	struct FVector DefaultSocketOffset_LeftHipshot; // 0xA38 (12)
	struct FVector DefaultSocketOffset_Hipshot; // 0x2A0C (12)
	struct FVector DefaultSocketOffset_RightHipshot; // 0x2288 (12)
	struct FVector DefaultSocketOffset_LeftLeanAOS; // 0x2DE0 (12)
	struct FVector DefaultSocketOffset_RightLeanAOS; // 0x186C (12)
	struct FVector DefaultSocketOffset_LeftAOS_Idle; // 0x3810 (12)
	struct FVector DefaultSocketOffset_RightAOS_Idle; // 0x2A40 (12)
	struct FVector DefaultSocketOffset_LeftAOS_Crouch; // 0x91C (12)
	struct FVector DefaultSocketOffset_RightAOS_Crouch; // 0x1478 (12)
	struct FVector DefaultSocketOffset_LeftAOS_Prone; // 0x2C78 (12)
	struct FVector DefaultSocketOffset_RightAOS_Prone; // 0x3568 (12)
	struct FVector DefaultTargetOffset_HipShot; // 0x3180 (12)
	struct FVector DefaultTargetOffset_AOS_Stand_Idle; // 0xC50 (12)
	struct FVector DefaultTargetOffset_AOS_Stand_Lean; // 0x14FC (12)
	struct FVector DefaultTargetOffset_AOS_Crouch_Idle; // 0xA60 (12)
	struct FVector DefaultTargetOffset_AOS_Crouch_Lean; // 0x1D10 (12)
	float DefaultTargetArmLength_Hipshot; // 0x2A2C (4)
	float DefaultTargetArmLength_AOS; // 0x1598 (4)
	float Camera3P_FOV_InterpSpeed; // 0x10F8 (4)
	float Camera3P_AMP_FOV_InterpSpeed; // 0x2A5C (4)
	float Camera3P_HeartBeatSensor_FOV_InterpSpeed; // 0x317C (4)
	float Camera3P_Lean_InterpSpeed; // 0x1268 (4)
	struct UClass* DeathCamClass; // 0x7E0 (8)
	float DeathBeginTime; // 0x2114 (4)
	struct USkeletalMesh BodyBaseSkeletalMesh; // 0x678 (8)
	char bNeedToUpdatePreviewPawn : 0; // 0x3309 (1)
	struct UCustomizableObjectInstance Mutable_MaleInstance; // 0xA88 (8)
	struct UCustomizableObjectInstance Mutable_FemaleInstance; // 0x1338 (8)
	struct UClass* InventoryCharacterClass; // 0x1E38 (8)
	struct ABravoHotelInventoryCharacter InventoryCharacter; // 0x1920 (8)
	struct FMulticastInlineDelegate OnUpdateCastingDelegate; // 0x6C0 (16)
	int32_t UsingBackpackItemIndex; // 0xE38 (4)
	float ItemInterruptInputSeconds; // 0x1344 (4)
	struct FTimerHandle CastingItemTimer; // 0x2468 (8)
	struct FTimerHandle CastingSupplyTimer; // 0x3218 (8)
	struct FTimerHandle CastingItemMontageTimer; // 0x24D0 (8)
	struct FAnimSlot LastCastingItemAnimSlot_Stand; // 0x38B0 (16)
	struct FAnimSlot LastCastingItemAnimSlot_Prone; // 0x1EE8 (16)
	struct TArray<struct UAkAudioEvent> CastingStopEvents; // 0x19F8 (16)
	char bIsCastingItem : 0; // 0xB30 (1)
	struct FCompletedCasting CompletedCastingInfo; // 0x303C (8)
	int32_t BasicSetting_gender; // 0x35E8 (4)
	int32_t BasicSetting_face; // 0x3A04 (4)
	int32_t BasicSetting_face_color; // 0x2F08 (4)
	int32_t BasicSetting_hair; // 0xA90 (4)
	int32_t BasicSetting_hair_color; // 0x1A38 (4)
	int32_t BasicSetting_makeup; // 0x1BF8 (4)
	struct TArray<struct FInventoryItemInfo> BasicSettingItemInfos; // 0x7B0 (16)
	struct FName CombineTargetRecipe; // 0x928 (8)
	struct TArray<struct FName> CombineTargetMaterials; // 0x23D8 (16)
	struct UAkAudioEvent CombineCompleteAudioEvent; // 0xF40 (8)
	char bEnabledFur : 0; // 0x9C0 (1)
	struct FName WearableNameHasFur; // 0x2AB8 (8)
	float CooldownTimeForEnterVehicle; // 0x3A94 (4)
	float CoolDownTimeForUseLadder; // 0x198C (4)
	struct TArray<struct ABravoHotelVehicle> NearbyVehicles; // 0x3050 (16)
	struct FMulticastInlineDelegate Delegate_OnEnteredVehicle; // 0x6D0 (16)
	float MaxVehicleEscapeSpeed; // 0x1D5C (4)
	struct UBravoHotelVehicleSeatComponent PreviousVehicleSeat; // 0x35D8 (8)
	struct TArray<struct ABravoHotelProjectileGrenade> ProjectileGrenades; // 0x2B18 (16)
	struct FMulticastInlineDelegate OnChangeProjectilePredictPath; // 0x3070 (16)
	char IsBlind : 0; // 0x1E44 (1)
	struct FMulticastInlineDelegate OnAirCraftDelegate; // 0xF88 (16)
	struct FMulticastInlineDelegate OnCharacterGroundStateChangeDelegate; // 0x1358 (16)
	float FlashBangAngle; // 0xF38 (4)
	struct UClass* PostProcessFlashBangClass; // 0x3B00 (8)
	struct UAkAudioEvent GrenadeFlashBangStartEvent; // 0x27D0 (8)
	struct UAkAudioEvent GrenadeFlashBangEndEvent; // 0x3688 (8)
	struct UAkAudioEvent GrenadeFragmentExplosionSineStopEvent; // 0x3958 (8)
	struct UClass* PostProcessBloodHitClass; // 0x39C8 (8)
	struct UCurveFloat DamagedDissolveAnimationCurve; // 0xD70 (8)
	struct UCameraPostProcessPreset PostProcessBloodHit; // 0x1458 (8)
	float DamagedDissolveRateTime; // 0x2470 (4)
	float DamagedTermTime; // 0x3B64 (4)
	float DamagedDissolveAnimaitionMaxTime; // 0x19C8 (4)
	float HitBlinkTime; // 0x7C0 (4)
	float InternalDamagedTermTime; // 0xF68 (4)
	float InternalHitBlinkTime; // 0x1FB4 (4)
	float DamagedDissolveAnimationValue; // 0x2860 (4)
	char IsEndTermTime : 0; // 0x808 (1)
	char IsPlayingDamage : 0; // 0x30A0 (1)
	char IsHit : 0; // 0x151C (1)
	char IsDissolve : 0; // 0x3308 (1)
	char DamageReset : 0; // 0xCE0 (1)
	int32_t HitBlinkState; // 0x3900 (4)
	int32_t CurrentDamageCount; // 0x3048 (4)
	int32_t DissolveCount; // 0x2100 (4)
	struct UClass* PostProcessOuterPlayZoneClass; // 0x2C68 (8)
	float ShowTimePostProcessOuterPlayZone; // 0x1514 (4)
	struct FTimerHandle TimerHandle_OuterPlayZone; // 0x2F10 (8)
	struct UClass* PostProcessBlueZoneHitClass; // 0x3578 (8)
	struct FTimerHandle TimerHandle_BlueZone; // 0x33E0 (8)
	struct UClass* PostProcessMagneticHitClass; // 0x2C70 (8)
	struct UCameraPostProcessPreset PostProcessMagneticHit; // 0x840 (8)
	struct UCurveFloat MagneticDamagedDissolveAnimationCurve; // 0x2788 (8)
	float MagneticDamagedTermTime; // 0x1554 (4)
	float MagneticDamagedDissolveAnimaitionMaxTime; // 0x1C10 (4)
	float MagneticHitBlinkTime; // 0x3454 (4)
	float InternalMagneticDamagedTermTime; // 0x1434 (4)
	float InternalMagneticHitBlinkTime; // 0x3248 (4)
	float MagneticDamagedDissolveAnimationValue; // 0x2FA0 (4)
	float BluezoneMaterialOnTime; // 0x2BB8 (4)
	char IsMagneticEndTermTime : 0; // 0x1AEC (1)
	char IsMagneticDamage : 0; // 0xA54 (1)
	char IsMagneticHit : 0; // 0x1040 (1)
	char IsMagneticDissolve : 0; // 0x324C (1)
	char MagneticDamageReset : 0; // 0x2560 (1)
	struct UClass* PostProcessDustClass; // 0x3938 (8)
	struct UCurveFloat DustDissolveAnimationCurve; // 0x37D8 (8)
	struct UCameraPostProcessPreset PostProcessDust; // 0x2668 (8)
	float DustDissolveAnimaitionMaxTime; // 0x2754 (4)
	float DustDissolveDelayTime; // 0x22C8 (4)
	float InternalDustDissolveDelayTime; // 0x1928 (4)
	float DustDissolveAnimationValue; // 0x994 (4)
	char IsOnDust : 0; // 0x3850 (1)
	char IsDustDissolve : 0; // 0x3AF0 (1)
	char DustReset : 0; // 0x2C94 (1)
	struct UClass* PP_Preset_PickupOutline; // 0x1098 (8)
	struct UCameraPostProcessPreset PP_PickupOutlineRef; // 0x7C8 (8)
	float CurrentOutlineThickness; // 0x2CAC (4)
	float MaxOutlineThickness; // 0x2D1C (4)
	float OutlineThicknessInterpSpeed; // 0x1CC8 (4)
	float CurrentCameraModifyerX; // 0x1524 (4)
	float CurrentCameraModifyerY; // 0xC18 (4)
	enum class EMouseSensitivityState CurrentEMouseSensitivityState; // 0x2350 (1)
	char bPendingOpenDoor : 0; // 0x838 (1)
	struct ABravoHotelDoor KickTargetDoor; // 0x2578 (8)
	struct UParticleSystem DoorBreachingParticle; // 0x33A0 (8)
	struct UParticleSystem WindowBreachingParticle; // 0x15C0 (8)
	struct UAkAudioEvent BreachingAudioEvent; // 0x1C78 (8)
	struct UAkAudioEvent BreachingAudioEvent_Silence; // 0x1390 (8)
	struct UBravoHotelAnimInstance AnimInstance; // 0x17F8 (8)
	struct UBravoHotelAnimInstancePostprocess PostprocessAnimInstance; // 0x1438 (8)
	struct UBravoHotelAnimInstanceFPP AnimInstance_FPP; // 0x2B48 (8)
	struct ABravoHotelGameState BravoHotelGameState; // 0xE18 (8)
	struct ABravoHotelPlayerController BravoHotelPlayerController; // 0x3418 (8)
	int32_t IdleNum; // 0x1020 (4)
	float IdleWaitingTime; // 0x1850 (4)
	struct FName LevelUpEffectBuffName; // 0xA58 (8)
	struct TArray<struct FName> DefaultBuffName; // 0x2A68 (16)
	struct TArray<struct FPerkInfo> DefaultPerkInfo; // 0x9B0 (16)
	struct TArray<struct FString> UberUser; // 0xC90 (16)
	struct TArray<struct FPerkInfo> CurrentPerkInfos; // 0x2400 (16)
	struct FPerkInfo UltimatePerkInfo; // 0x3AA0 (40)
	struct TArray<struct FPerkUIInfo> PerkUIInfos; // 0x2F58 (16)
	struct FPerkUIInfo UltimateUIInfo; // 0xAF8 (44)
	struct TArray<struct FPerkDeckElement> CurrentPerkCards; // 0x39D8 (16)
	struct TArray<struct FMutableData> MutableBuffList; // 0xBA0 (16)
	enum class EBuffEventType CurrentSkillType; // 0x2CA8 (1)
	struct FMulticastInlineDelegate OnChangeFireType; // 0x2840 (16)
	int32_t CurrentReadyToSnipeGrade; // 0x1A4C (4)
	struct FMulticastInlineDelegate Delegate_OnEndSearchInstinct; // 0x2618 (16)
	struct TArray<struct UActor> UsedTrapList; // 0x20E0 (16)
	enum class EPerkLevelUpType PerkLevelUpType; // 0x2B30 (1)
	int32_t ActiveSkillInitIndex; // 0x35B8 (4)
	int32_t ActiveSkillCount; // 0xF78 (4)
	struct FDisplayAbility CurrentDisplayAbility; // 0xC04 (12)
	struct TArray<struct UClass*> LoadedClasses; // 0x2880 (16)
	int32_t PerkDeckChangingCount; // 0x161C (4)
	struct FMulticastInlineDelegate OnMovementInputPressedDelegate; // 0x718 (16)
	char bIsMoving : 0; // 0x2690 (1)
	char bForceMoving : 0; // 0x1934 (1)
	struct UClass* LastDamagedType; // 0x2268 (8)
	float LastDamagedAmount; // 0x38E0 (4)
	struct UClass* LastHitType; // 0x2D40 (8)
	struct FBravoHotelTakeDamageInfo LastSimulatedTakeDamageInfo; // 0x3980 (72)
	struct FHitResult DebuffHitResult; // 0x1F28 (136)
	struct UClass* DebuffHitDamageType; // 0xFD8 (8)
	struct TArray<struct FAnimSlot> TakeDamageMontageList; // 0xD20 (16)
	struct UParticleSystem BloodSplatterEffect; // 0x1998 (8)
	struct UParticleSystem PunchEffect; // 0x1DE0 (8)
	struct UParticleSystem ThrowingWeaponDirectHitEffect; // 0x33C0 (8)
	float BloodEffectNearbyDist; // 0xF34 (4)
	struct FBravoHotelDefaultItemSetting DefaultItemSetting; // 0x1498 (56)
	struct FBravoHotelDefaultWearableSetting DefaultWearableSetting; // 0xAB8 (24)
	struct TArray<struct FBravoHotelItemPresetForBlackMarket> BlackMarketItemPresetList; // 0xB48 (16)
	struct FMulticastInlineDelegate OnCanProneFailedDelegate; // 0x730 (16)
	float MinDamageableFallingSpeed; // 0xE20 (4)
	float MaxDamageableFallingSpeed; // 0x3224 (4)
	float MinDamageableFallingSpeedFromVehicle; // 0x2930 (4)
	float MaxDamageableFallingSpeedFromVehicle; // 0x2AC0 (4)
	enum class ELandingReason LandingReason; // 0x8A8 (1)
	struct FMulticastInlineDelegate Delegate_OnExitFallingState; // 0x1468 (16)
	struct TArray<struct TWeakObjectPtr<struct UBravoHotelPhysicalMaterial>> OverlappedPhysicMaterials; // 0x1C18 (16)
	float BushSoundSpawnDelay; // 0x22DC (4)
	float BushLandingDamageMultiplier; // 0x33EC (4)
	struct TSet<struct UPrimitiveComponent> OverlappedCantProneComponent; // 0x3860 (80)
	char bIsInsideBlueZone : 0; // 0x1FD0 (1)
	char bIsSpectated : 0; // 0xCA0 (1)
	struct TMap<struct FName, struct FVector> Camera3P_DeltaTargetOffsets; // 0x2B58 (80)
	char bReplaceFreeLook : 0; // 0x2FB0 (1)
	char bUpdateDeathRotation : 0; // 0xDE8 (1)
	struct FVector RagdollLocation; // 0x2A20 (12)
	struct FVector RagdollVelocity; // 0x10A8 (12)
	struct UDamageType LastDamageType; // 0x2EC8 (8)
	float Ragdoll_ZOffset; // 0x3350 (4)
	char bApplyRagdollForce : 0; // 0x930 (1)
	struct UBravoHotelCharacterMovementComponent BravoHotelCharacterMovement; // 0x760 (8)
	char PrevMovementMode; // 0x2F24 (1)
	char NewMovementMode; // 0x2058 (1)
	enum class ECustomMovementMode PrevCustomMovementMode; // 0xD00 (1)
	enum class ECustomMovementMode NewCustomMovementMode; // 0x373C (1)
	struct FVector MovementInputVector; // 0x7E8 (12)
	struct FTimerHandle TimerHandle_HideParachute; // 0x768 (8)
	struct FTimeline Timeline_TunnelEffect; // 0x26A8 (152)
	struct TMap<enum class EWeaponAttachmentItem, struct UCurveFloat> Curve_TunnelEffect; // 0x3488 (80)
	struct FTimeline Timeline_CameraInterp; // 0x2E28 (152)
	struct UCurveFloat Curve_CameraInterp; // 0x1428 (8)
	struct UCurveFloat Curve_AdsCameraInterp; // 0x2090 (8)
	struct FTimerHandle TimerHandle_MinTimeJumpingBeforeLand; // 0x17F0 (8)
	float MinTimeJumpingBeforeLand; // 0x17CC (4)
	float DescentXYAcc; // 0x9A8 (4)
	float DescentAirControl; // 0x1E40 (4)
	float DescentSpeed; // 0x24C0 (4)
	float DescentGravityScale; // 0xCD0 (4)
	float DescentDeacceleration; // 0x2508 (4)
	float DescentMaxAcceleration; // 0x3320 (4)
	struct FVector DescentCameraLocation; // 0x2B3C (12)
	float ParachuteAirControl; // 0x2EE8 (4)
	float ParachuteSpeed; // 0x2744 (4)
	float ParachuteGravity; // 0x1938 (4)
	float ParachuteDeacceleration; // 0x848 (4)
	float ParachuteMaxAcceleration; // 0x7F8 (4)
	struct FVector ParachuteCameraLocation; // 0x1E2C (12)
	float ParachuteSocketOffsetY; // 0x1EB0 (4)
	float ParachuteSocketDeltaOffsetZ; // 0x274C (4)
	float ParachuteReadyToLandHeight; // 0x2774 (4)
	float ParachuteQuickLandingStartHeight; // 0xA24 (4)
	float ParachuteQuickLandingStartRadius; // 0x35EC (4)
	float ParachuteQuickLandingVelocityModifierXY; // 0xD54 (4)
	float ParachuteQuickLandingVelocityModifierZ; // 0x2D2C (4)
	float ParachuteQuickLandingDMGRate; // 0x192C (4)
	char bCanQuickLanding : 0; // 0x2FB8 (1)
	struct FVector LastQuickLandingAllowedLocation; // 0x3ADC (12)
	struct FVector ParachuteTargetCameraLocation; // 0x1950 (12)
	float ParachuteTargetCameraSpeed; // 0x1D60 (4)
	float ParachuteTargetArmLengthSpeedStart; // 0x1CC4 (4)
	float ParachuteTargetArmLengthSpeedEnd; // 0x203C (4)
	struct UClass* ParachuteUnfoldCameraShake; // 0xF28 (8)
	struct UAkAudioEvent BreathStartEvent; // 0x33B8 (8)
	struct UAkAudioEvent BreathEndEvent; // 0x1EA8 (8)
	struct UAkAudioEvent BreathStopEvent; // 0x27B8 (8)
	struct FVector2D SprintingBeginRange; // 0x3440 (8)
	struct FVector2D SprintingRange; // 0xA00 (8)
	float ReduceCharacterSpeedTime; // 0x34F4 (4)
	float InternalReduceCharacterSpeedTime; // 0x3AE8 (4)
	char IsInReduceSpeedExplosionRange : 0; // 0x17C8 (1)
	struct UDataTable PostProcessEffectsTable; // 0x2E08 (8)
	struct TMap<struct FName, struct FBravoHotelPostProcessSettings> PostProcessAssignedList; // 0x2358 (80)
	struct TArray<struct UClass*> PostProcessBuffList; // 0x3770 (16)
	struct UDataTable RenderSettingsTable; // 0x19C0 (8)
	char bUpdateRenderSettings : 0; // 0x2594 (1)
	int32_t CurrentTerrainType; // 0x2460 (4)
	struct FVector AttachInAircraftOffset; // 0x1DC4 (12)
	struct FRotator AttachInAircraftRotationOffset; // 0x1A08 (12)
	struct FVector AttachInAircraftCameraLocaiton; // 0x3094 (12)
	float InitSpringArmLengthInAircraft; // 0x2488 (4)
	float TargetSpringArmLengthInAircraft; // 0x23E8 (4)
	float SpeedSpringArmLengthInAirCraft; // 0x3768 (4)
	float PrevBloomIntensity; // 0x12EC (4)
	float PrevBloomThreshold; // 0x2B2C (4)
	float TargetBloomIntensityInAirCraft; // 0x34F8 (4)
	float SpeedBloomIntensityInAirCraft; // 0x2ED4 (4)
	float BloomStartDelayTimeInAirCraft; // 0x2F78 (4)
	float CineDurationTimeMax; // 0x2D58 (4)
	float CineTextAnimationAppearTime; // 0x2E00 (4)
	float GetPerkOnStartTime; // 0x17A8 (4)
	struct UBravoHotelCameraComponent FPSK_Camera; // 0x3908 (8)
	struct USceneComponent ADSCameraScene; // 0x3500 (8)
	struct UCustomizableSkeletalComponent FPSK_MutableArms; // 0x3548 (8)
	struct USkeletalMeshComponent FPSK_Arms; // 0x1820 (8)
	struct FVector FPSK_CameraHeight; // 0x30A4 (12)
	float FPSK_CameraProbe; // 0x17B8 (4)
	float FPSK_CameraPitchDeltaX; // 0xE00 (4)
	struct FVector FPSK_CameraLocation_Idle; // 0x15A0 (12)
	struct FName FPSK_CameraBone_Idle; // 0x35C0 (8)
	struct FVector FPSK_CameraLocation_ADS; // 0xD88 (12)
	struct FVector FPSK_CameraLocation_Parkour; // 0x253C (12)
	struct FName FPSK_CameraBone_Parkour; // 0x17E0 (8)
	float FPSK_CameraHeight_Stand; // 0x32AC (4)
	float FPSK_CameraHeight_Crouch; // 0x1CA8 (4)
	float FPSK_CameraHeight_Prone; // 0x2BBC (4)
	struct FVector FPSK_CameraLocation_Collide; // 0x25A0 (12)
	struct FVector FPSK_CameraLocation_LeftLeanDelta; // 0x3AF4 (12)
	struct FVector FPSK_CameraLocation_RightLeanDelta; // 0x38E4 (12)
	float FPSK_CameraLocation_CollideAlpha; // 0x129C (4)
	struct FVector FPSK_StartCameraHeight; // 0x1AF0 (12)
	struct FVector FPSK_DestCameraHeight; // 0x3914 (12)
	struct USkeletalMeshComponent FPSK_WeaponShadow; // 0x22C0 (8)
	struct UStaticMeshComponent FPSK_SightShadow; // 0x10B8 (8)
	struct UStaticMeshComponent FPSK_GripShadow; // 0x1C68 (8)
	struct UStaticMeshComponent FPSK_MagazineShadow; // 0x35D0 (8)
	struct UStaticMeshComponent FPSK_StockShadow; // 0x2CE8 (8)
	struct UStaticMeshComponent FPSK_TacticalAttachmentShadow; // 0x2A50 (8)
	struct USkeletalMeshComponent FPSK_BarrelShadow; // 0x2A00 (8)
	struct USkeletalMeshComponent FPSK_MuzzleShadow; // 0x12D0 (8)
	struct TArray<struct UMeshComponent> FPSK_WeaponAttachments; // 0x1808 (16)
	char bFPSK_UseCustomCurve : 0; // 0x2D70 (1)
	char bFPSK_IsDefaultTransformUpdated : 0; // 0x32CC (1)
	char bFPSK_IsFPSMode : 0; // 0x1800 (1)
	struct FTransform FPSK_CurrentWeaponTransform; // 0x1D90 (48)
	struct FTransform FPSK_IdleWeaponTransform; // 0x1740 (48)
	struct FTransform FPSK_CollideWeaponTransform; // 0x2FD0 (48)
	struct FTransform FPSK_ADS_DefaultWeaponTransform; // 0x1FE0 (48)
	struct FTransform FPSK_ADS_TargetWeaponTransform; // 0x3360 (48)
	struct FTransform FPSK_ADS_DefaultWeaponTransform_BasicSightCache; // 0x3260 (48)
	struct FTransform FPSK_ADS_DefaultWeaponTransform_CurrentSightCache; // 0x1D20 (48)
	struct FTransform FPSK_ADS_WeaponTransform; // 0x2430 (48)
	float FPSK_ADSFOV; // 0x2FBC (4)
	float FPSK_AOSFOV; // 0x36D4 (4)
	float FPSK_DefaultFOV; // 0x1EB4 (4)
	float FPSK_CurrentMagnificationFactor; // 0x1B10 (4)
	float FPSK_TargetMagnificationFactor; // 0x1450 (4)
	struct UMaterialParameterCollection MPC_WeaponFov; // 0x17A0 (8)
	struct FVector FPSK_CurrentCameraRelativeLocation; // 0x2A84 (12)
	float FPSK_ADSAlpha; // 0x23EC (4)
	float FPSK_StartFOV_Delta; // 0x3594 (4)
	float CameraInterpPlayRate; // 0x3738 (4)
	float AdsCameraInterpPlayRate; // 0x22BC (4)
	float FPSK_TargetADSAlpha; // 0x2428 (4)
	struct FTimeline FPSK_Timeline_Sway_Idle; // 0x1A50 (152)
	struct FTimeline FPSK_Timeline_Sway_Move; // 0x1690 (152)
	struct UCurveVector FPSK_Curve_Sway_Idle_Default; // 0x19E0 (8)
	struct UCurveVector FPSK_Curve_Sway_Move_Default; // 0x1BF0 (8)
	struct UCurveFloat FPSK_Curve_Sway_Scale_With_Fov; // 0x3468 (8)
	struct UCurveVector FPSK_Curve_Sway_Idle; // 0x17D0 (8)
	struct UCurveVector FPSK_Curve_Sway_Move; // 0x2768 (8)
	char bUseFPSK_Sway : 0; // 0x3210 (1)
	float FPSK_SwayAlpha; // 0x2A90 (4)
	float FPSK_SwayAlphaMin; // 0x7F4 (4)
	float FPSK_SwayAlphaMax; // 0xFFC (4)
	float FPSK_SwayScale; // 0x1ECC (4)
	struct FRotator FPSK_SwayRotationIdle; // 0x2104 (12)
	struct FRotator FPSK_SwayRotationMove; // 0x1248 (12)
	struct FRotator FPSK_SwayRotationDeltaForSteadyAim; // 0x2078 (12)
	float FPSK_SwayInterpSpeed; // 0x3780 (4)
	struct FRotator FPSK_LeanRotation; // 0x3948 (12)
	struct FVector FPSK_LeanLocation; // 0x960 (12)
	struct FTransform FPSK_CurrentCollideWeaponTransform; // 0x1150 (48)
	float FPSK_CollideAlpha; // 0x3A84 (4)
	float FPSK_CollideAngle; // 0xAF4 (4)
	float FPSK_CollideAngle_LocalCache; // 0x2F1C (4)
	char bFPSK_IsCollide : 0; // 0x2BA8 (1)
	struct TMap<enum class EWeaponAttachmentItem, struct UCurveFloat> FPSK_Curves_TunnelEffect; // 0x3618 (80)
	float FPSK_TargetFOV; // 0x3708 (4)
	struct FTimerHandle TimerHandle_NoCarLandingDamageToTeam; // 0x2040 (8)
	float InAircraftNearClipPlane; // 0x3520 (4)
	struct TArray<struct ABravoHotelCharacter> AIBot_SearchedEnemyList; // 0x3390 (16)
	char bEnableCustomDepth : 0; // 0x2898 (1)
	struct FTimerHandle TimerHandle_HurtCondition; // 0x3828 (8)
	float ProneDamageScaleInRedZone; // 0x10C0 (4)
	struct UAkAudioEvent BlueZoneFreezeEvent; // 0x31F8 (8)
	struct UAkAudioEvent BlueZoneFreezeStopEvent; // 0x1578 (8)
	struct UAkAudioEvent BlueZoneDroneEvent; // 0xFD0 (8)
	struct UAkAudioEvent BlueZoneDroneStopEvent; // 0x19D0 (8)
	struct UAkAudioEvent SupplyBoxNotifyAlertMe; // 0x22E0 (8)
	struct UAkAudioEvent SupplyBoxNotifyAlertOther; // 0x2650 (8)
	float CheckFreezeDistance; // 0x2A58 (4)
	float CheckDroneDistance; // 0x2CB4 (4)
	struct FVector DefaultSocketOffset_LeftLeanAMP; // 0x2474 (12)
	struct FVector DefaultSocketOffset_RightLeanAMP; // 0x39F0 (12)
	struct FVector DefaultSocketOffset_RightAMP; // 0xDD0 (12)
	struct FVector DefaultSocketOffset_LeftAMP; // 0x27C0 (12)
	float DefaultTargetArmLength_AMP; // 0x22D8 (4)
	float AmplifierFocusDistance; // 0x2F18 (4)
	struct FVector DefaultSocketOffset_LeftLeanHeartBeatSensor; // 0x2A78 (12)
	struct FVector DefaultSocketOffset_RightLeanHeartBeatSensor; // 0x1F18 (12)
	struct FVector DefaultSocketOffset_RightHeartBeatSensor; // 0x29A0 (12)
	struct FVector DefaultSocketOffset_LeftHeartBeatSensor; // 0x2D4C (12)
	float DefaultTargetArmLength_HeartBeatSensor; // 0x38C8 (4)
	float HeartBeatSensorFocusDistance; // 0x3178 (4)
	float CameraFocusDistanceAOS; // 0x1618 (4)
	float AirWalkStartTime; // 0x2C60 (4)
	struct FTimerHandle TimerHandle_StopAirWalk; // 0x2608 (8)
	float AirWalkBestRecord; // 0x1058 (4)
	float AirWalkTotalRecord; // 0x2590 (4)
	struct UAkAudioEvent AirWalkAudioEvent; // 0x1D08 (8)
	float CurrentAirWalkVelocityZ; // 0xFF8 (4)
	float AirWalkDuration; // 0x19B4 (4)
	float AirWalkGravity; // 0x1518 (4)
	struct UBHPersonalSupplySystemComponent PersonalSupplySystemComponent; // 0x20F8 (8)
	enum class ENetworkSmoothingMode PrevNetworkSmoothingMode; // 0x10A0 (1)
	struct FTimerHandle TimeHandle_SkyDive; // 0x788 (8)
	char bActiveCriticalTime : 0; // 0x1868 (1)
	float CriticalTimeTickInterval; // 0x2C64 (4)
	float CriticalTimeLimitTime; // 0x2024 (4)
	struct FVector CriticalTimeMeshLocaiton; // 0x2554 (12)
	struct TMap<struct UActorComponent, float> CriticalTimeComponentTickIntervals; // 0x2AC8 (80)
	float ParachuteEnableHieght; // 0x29C4 (4)
	struct ABravoHotelParachuteTriggerBox ParachuteTriggerBox; // 0x3588 (8)
	struct FHitResult CurHit; // 0x30E8 (136)
	struct UCurveFloat Curve_Sliding; // 0x2338 (8)
	struct UParticleSystem ParticleSystem_Sliding; // 0x15B0 (8)
	struct UParticleSystemComponent ParticleSystemComponent_Sliding; // 0x22D0 (8)
	float SlidingStartTime; // 0x2748 (4)
	enum class ECharacterGroundState GroundStateBeforeSliding; // 0xAA1 (1)
	struct TMap<int16_t, int32_t> ReplicateIndexPerkMap; // 0x2C00 (80)
	int16_t SlidingBuffIndex; // 0x2CF0 (2)
	char bPendingStopSliding : 0; // 0x2FC0 (1)
	float RollingStartTime; // 0x38F0 (4)
	struct UClass* PostProcessWetFogClass; // 0x8E0 (8)
	struct TArray<struct ABravoHotelAreaSkillZone> ActiveWetFogAreas; // 0x980 (16)
	struct FAreaSkillZoneInfo WetFogInfo; // 0x1C38 (32)
	struct FWetFogZoneInfo WetFogZoneInfo; // 0x2030 (12)
	struct FTimerHandle TimerHandle_WetFog; // 0x3190 (8)
	struct UClass* PostProcessBlackOutClass; // 0x2598 (8)
	struct TArray<struct ABravoHotelAreaSkillZone> ActivePowerInterruptions; // 0x31D0 (16)
	struct FAreaSkillZoneInfo BlackOutInfo; // 0x1A18 (32)
	struct FTimerHandle TimerHandle_BlackOut; // 0x10F0 (8)
	struct UAkAudioEvent StartBlackOutAudioEvent; // 0x20A0 (8)
	struct UParticleSystem StartBlackOutParticle; // 0x1120 (8)
	struct UParticleSystemComponent StartBlackOutParticleComponent; // 0x3420 (8)
	struct FMulticastInlineDelegate OnSpawnBlackOutDelegate; // 0x2DC0 (16)
	struct UClass* PostProcessForceFieldClass; // 0x18A8 (8)
	struct TArray<struct ABravoHotelAreaSkillZone> ActiveForceFields; // 0x1310 (16)
	struct FAreaSkillZoneInfo ForceFieldInfo; // 0x1878 (32)
	struct FTimerHandle TimerHandle_ForceField; // 0xBB8 (8)
	struct UClass* SuperBarrierClass; // 0xC10 (8)
	char UsingSimulationBox : 0; // 0x2938 (1)
	char HiddenSimulationBox : 0; // 0x1264 (1)
	float SimulationBoxHeight; // 0x3674 (4)
	struct TSoftClassPtr<UObject> SimulationBoxClass; // 0x24E0 (40)
	struct FMulticastInlineDelegate OnCompleteActiveSkillDelegate; // 0x2EF8 (16)
	struct ABravoHotelSkillTargetingBase BombingTargetActor; // 0x1448 (8)
	struct UAkAudioEvent StartBomingEvent; // 0x1100 (8)
	char IsBombing : 0; // 0x2CF8 (1)
	struct FBombingInfo BombingInfo; // 0x93C (36)
	float AutoAimRadius; // 0x1D70 (4)
	float AutoAimDistance; // 0x30B8 (4)
	char bShowAutoAimDebug : 0; // 0xE80 (1)
	struct UParticleSystem TeleportFxTemplate; // 0x2EC0 (8)
	struct UParticleSystem TeleportTraceFxTemplate; // 0x1320 (8)
	float TeleportDisappearTime; // 0x15BC (4)
	float TeleportAppearTime; // 0x3044 (4)
	float RocketJumpGravity; // 0x1CD0 (4)
	struct UAkAudioEvent RocketJumpAudioEvent; // 0xB38 (8)
	struct UAkAudioEvent RocketJumpLandedAudioEvent; // 0xEE8 (8)
	struct UParticleSystem ParticleSystem_RocketJump; // 0x3460 (8)
	struct UParticleSystem ParticleSystem_RocketJumpTrail; // 0x3960 (8)
	struct UParticleSystem ParticleSystem_RocketJumpLanded; // 0x30E0 (8)
	struct UParticleSystemComponent RocketJumpTrailEffect; // 0x17B0 (8)
	char bFinishMeteorJump : 0; // 0x1368 (1)
	float MeteorJumpGravity; // 0x3680 (4)
	char bMeteorStrikeBlockingHit : 0; // 0x3910 (1)
	struct TArray<struct UClass*> MeteorGrenadeProjectileClass; // 0x3430 (16)
	struct UAkAudioEvent MeteorJumpAudioEvent; // 0x1530 (8)
	struct UAkAudioEvent MeteorJumpLandedAudioEvent; // 0x1E88 (8)
	struct UParticleSystem ParticleSystem_MeteorJump; // 0xF58 (8)
	struct UParticleSystem ParticleSystem_MeteorJumpTrail; // 0x1D88 (8)
	struct UParticleSystem ParticleSystem_MeteorJumpLanded; // 0x2060 (8)
	struct UParticleSystemComponent MeteorJumpTrailEffect; // 0x2310 (8)
	struct UActor MeteorTarget; // 0x2628 (8)
	struct TArray<struct ABravoHotelProjectileGrenadeFlashbang> ThrownFlashbangs; // 0x19E8 (16)
	struct TArray<struct ABravoHotelProjectileGrenadeMolotovCocktail> ThrownMolotovCocktails; // 0x3010 (16)
	struct TArray<struct ABravoHotelProjectileGrenadeC4> ThrownC4s; // 0x2960 (16)
	char bIsUltimateSprint : 0; // 0x17D8 (1)
	char IgnoreInteraction : 0; // 0xE99 (1)
	struct FMulticastInlineDelegate OnChangeCharacterStateDelegate; // 0x2950 (16)
	int32_t LogSize; // 0x2514 (4)
	struct FTimerHandle TimeHandle_RequestBuildingInfo; // 0x1D80 (8)
	float LogIntervalTime; // 0x9A0 (4)
	int32_t LogRequestSize; // 0x1DC0 (4)
	struct TArray<struct FString> LogList; // 0x2658 (16)
	struct TArray<struct FString> LogJsonList; // 0x1BC0 (16)
	struct UParticleSystem GodEffect1; // 0x2018 (8)
	struct UParticleSystem GodEffect2; // 0x1028 (8)
	struct UParticleSystem ParticleSystem_Knockout; // 0x2C98 (8)
	struct FRepSimulatedHittedDamage RepSimulatedHittedDamage; // 0x22E8 (16)
	float FirstTimeHittedDamage; // 0x258C (4)
	float LastTimeHittedDamage; // 0x2908 (4)
	struct UParticleSystemComponent GodParticle; // 0x1A40 (8)
	char NeedFindPersonalSupplyBoxLocation : 0; // 0x2098 (1)
	int32_t PersonalSupplyBoxRePositionCount; // 0xFB8 (4)
	char UsingPersonalSupplyBoxWeightMap : 0; // 0x1558 (1)
	char UsingPersonalSupplyBoxRePosition : 0; // 0xF30 (1)
	float PersonalSupplyBoxRePositionDistance; // 0x12F0 (4)
	struct FTimerHandle TimeHandle_Ultimate_Recon; // 0x800 (8)
	struct FAnimSlot AnimSlot_Ultimate_Recon; // 0x1CD8 (16)
	char bIsUltimate_Recon : 0; // 0xEB0 (1)
	struct UAnimMontage AvoidHeadShotMontage; // 0x1FC8 (8)
	struct UAkAudioEvent SteelHelmetSound; // 0x908 (8)
	struct FVector StuntmanRollingDir; // 0xC84 (12)
	float StuntmanStartTime; // 0x1B28 (4)
	struct FTimerHandle TimerHandle_Stuntman; // 0x2BB0 (8)
	char bNeedToUpdateNitroBoost : 0; // 0xBB0 (1)
	float NitroBoostTorqueScale; // 0x24C8 (4)
	struct ABravoHotelVehicle NitroBoomTargetVehicle; // 0x1118 (8)
	char bNeedToUpdateNitroBoom : 0; // 0x3220 (1)
	float NitroBoomDuration; // 0x1C14 (4)
	char bNeedToDrawNitroBoomTarget : 0; // 0x1128 (1)
	struct FVector NitroBoomTargetLocation; // 0x3064 (12)
	float NitroBoomLastVehicleSetTime; // 0x3174 (4)
	char bNeedToUpdateUltimate_Driver : 0; // 0x2B50 (1)
	char bNeedToCheckPlosiveSoundDetection : 0; // 0x1A48 (1)
	struct ABravoHotelMoveElevator EnteredElevatorRef; // 0xD38 (8)
	float OuterDamage; // 0x790 (4)
	struct FTimerHandle TimerHandle_InOuterArea; // 0x798 (8)
	struct FTimerHandle TimerHandle_UpdateInOuterArea; // 0x7A0 (8)
	struct FMulticastInlineDelegate DelegateCheckSupplyCost; // 0x32F8 (16)
	struct FSecuredVariablesCache SecuredCache; // 0x2D74 (4)
	struct UCurveFloat DamageCorrectValueByPenetrationDepthCurve; // 0xDE0 (8)
	struct ABravoHotelAircraftFlight AircraftFlightRef; // 0x2890 (8)
	float InventoryScrollSpeed; // 0x7A8 (4)
	struct TMap<struct FName, int32_t> HitPartsIndex; // 0x15C8 (80)
	struct FTimerHandle TimerHandle_Abusing_InvalidGameThread; // 0x2298 (8)

	void WearItem(enum class EWearableItemType Slot, struct FString UniqueKey, char bUpdateSkeletalMesh); // Function BravoHotelGame.BravoHotelCharacter.WearItem(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFBB50>
	char WasMeshRecentlyRenderedOnScreen(float Tolerance); // Function BravoHotelGame.BravoHotelCharacter.WasMeshRecentlyRenderedOnScreen(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFBAC0>
	char WantToFPSMode(); // Function BravoHotelGame.BravoHotelCharacter.WantToFPSMode(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFBA30>
	char WantsToRocketJump(); // Function BravoHotelGame.BravoHotelCharacter.WantsToRocketJump(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFBA90>
	char WantsToMeteorJump(); // Function BravoHotelGame.BravoHotelCharacter.WantsToMeteorJump(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFBA60>
	char ValidateEquippedWeaponsInVehicle(int32_t WeaponIndex); // Function BravoHotelGame.BravoHotelCharacter.ValidateEquippedWeaponsInVehicle(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB9A0>
	void ValidateCameraInterp(); // Function BravoHotelGame.BravoHotelCharacter.ValidateCameraInterp(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB980>
	void UpdateWetFogPP(char bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdateWetFogPP(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB8F0>
	void UpdateWalking_Prone(); // Function BravoHotelGame.BravoHotelCharacter.UpdateWalking_Prone(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB8D0>
	void UpdateWalking(); // Function BravoHotelGame.BravoHotelCharacter.UpdateWalking(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB8B0>
	void UpdateUltimate_Recon(); // Function BravoHotelGame.BravoHotelCharacter.UpdateUltimate_Recon(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB890>
	void UpdateTunnelEffect(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdateTunnelEffect(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB810>
	void UpdateTimeline(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateTimeline(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB790>
	void UpdateTerrainType(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateTerrainType(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB710>
	void UpdateTargetHealth(enum class ETargetHealthType Type, float InTargetHealth); // Function BravoHotelGame.BravoHotelCharacter.UpdateTargetHealth(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB650>
	void UpdateSurfaceType(); // Function BravoHotelGame.BravoHotelCharacter.UpdateSurfaceType(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB630>
	void UpdateStatupMaterialEffect(); // Function BravoHotelGame.BravoHotelCharacter.UpdateStatupMaterialEffect(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB610>
	void UpdateSliding(); // Function BravoHotelGame.BravoHotelCharacter.UpdateSliding(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB5F0>
	void UpdateRolling(); // Function BravoHotelGame.BravoHotelCharacter.UpdateRolling(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB5D0>
	void UpdateReplaceFreeLook(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateReplaceFreeLook(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB550>
	void UpdateRenderSettings(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateRenderSettings(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB4D0>
	void UpdatePowerInterruptionPP(char bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdatePowerInterruptionPP(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB440>
	void UpdatePostProcess_Indoor(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdatePostProcess_Indoor(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB3C0>
	void UpdatePostProcess_FPP(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdatePostProcess_FPP(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB340>
	void UpdatePostProcess_CameraMonoChrome(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdatePostProcess_CameraMonoChrome(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB2C0>
	void UpdatePostProcess_ADS(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdatePostProcess_ADS(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB240>
	void UpdatePostProcess(struct FName RowName, float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdatePostProcess(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB170>
	void UpdatePassengerLocation(); // Function BravoHotelGame.BravoHotelCharacter.UpdatePassengerLocation(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB150>
	void UpdateOuterPlayZonePP(char bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdateOuterPlayZonePP(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB0C0>
	void UpdateNitroBoom(); // Function BravoHotelGame.BravoHotelCharacter.UpdateNitroBoom(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB0A0>
	void UpdateNearClipPlane(); // Function BravoHotelGame.BravoHotelCharacter.UpdateNearClipPlane(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB080>
	void UpdateMutableMesh(); // Function BravoHotelGame.BravoHotelCharacter.UpdateMutableMesh(Native|Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB060>
	void UpdateMutableBuffList(); // Function BravoHotelGame.BravoHotelCharacter.UpdateMutableBuffList(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFB040>
	void UpdateMutable__DelegateSignature(struct ABravoHotelCharacter Character); // DelegateFunction BravoHotelGame.BravoHotelCharacter.UpdateMutable__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void UpdateMeleeAttack(struct UBravoHotelAnimNotifyState_Melee MeleeAnimNotifyClass, char bDrawDebugObject); // Function BravoHotelGame.BravoHotelCharacter.UpdateMeleeAttack(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFAF70>
	void UpdateLeanValue(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateLeanValue(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFAEF0>
	void UpdateKnockOutParticle(); // Function BravoHotelGame.BravoHotelCharacter.UpdateKnockOutParticle(Final|Native|Private) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFAED0>
	void UpdateJetpackFuel(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateJetpackFuel(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFAE50>
	void UpdateInventoryOrder(); // Function BravoHotelGame.BravoHotelCharacter.UpdateInventoryOrder(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFAE30>
	void UpdateInteractionType(struct FHitResult& Hit); // Function BravoHotelGame.BravoHotelCharacter.UpdateInteractionType(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFAD50>
	void UpdateInRagdoll(); // Function BravoHotelGame.BravoHotelCharacter.UpdateInRagdoll(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFAD30>
	void UpdateIdleNum(); // Function BravoHotelGame.BravoHotelCharacter.UpdateIdleNum(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFAD10>
	void UpdateGroundFriction(); // Function BravoHotelGame.BravoHotelCharacter.UpdateGroundFriction(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFACF0>
	void UpdateFurActivation(); // Function BravoHotelGame.BravoHotelCharacter.UpdateFurActivation(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFACD0>
	void UpdateFPSMode(); // Function BravoHotelGame.BravoHotelCharacter.UpdateFPSMode(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFABE0>
	void UpdateForceFieldPP(char bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdateForceFieldPP(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFAC40>
	void UpdateFireInput(); // Function BravoHotelGame.BravoHotelCharacter.UpdateFireInput(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFAC20>
	void UpdateFalling(); // Function BravoHotelGame.BravoHotelCharacter.UpdateFalling(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFAC00>
	void UpdateDrive(); // Function BravoHotelGame.BravoHotelCharacter.UpdateDrive(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1531970>
	void UpdateDebuffState(); // Function BravoHotelGame.BravoHotelCharacter.UpdateDebuffState(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFABC0>
	void UpdateCharacterOutlineMaterial(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCharacterOutlineMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFAB40>
	void UpdateCharacterMagneticDamagedMaterial(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCharacterMagneticDamagedMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFAAC0>
	void UpdateCharacterDustMaterial(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCharacterDustMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFAA40>
	void UpdateCharacterDamagedMaterial(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCharacterDamagedMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFA9C0>
	void UpdateCastingUI(); // Function BravoHotelGame.BravoHotelCharacter.UpdateCastingUI(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFA9A0>
	void UpdateCameraPPByBuff(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCameraPPByBuff(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFA920>
	void UpdateCameraPP(char bIsOn, float StartValue, float TargetValue, float InTime, float OutTime, struct FName AnimName, struct UClass* PPPresetClass, struct FTimerHandle& DeactiveTimer, char bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdateCameraPP(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFA680>
	void UpdateCameraInterp(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdateCameraInterp(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFA600>
	void UpdateCamera(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.UpdateCamera(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFA580>
	void UpdateBreathEffect(); // Function BravoHotelGame.BravoHotelCharacter.UpdateBreathEffect(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFA560>
	void UpdateBlueZonePP(char bForce); // Function BravoHotelGame.BravoHotelCharacter.UpdateBlueZonePP(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFA4D0>
	void UpdateAreaInfo(struct TArray<struct ABravoHotelAreaSkillZone> TargetActiveAreas, struct FAreaSkillZoneInfo& TargetSkillZoneInfo); // Function BravoHotelGame.BravoHotelCharacter.UpdateAreaInfo(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFA370>
	void UpdateAOSMode(); // Function BravoHotelGame.BravoHotelCharacter.UpdateAOSMode(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFA2D0>
	void UpdateADSReturnTrigger(); // Function BravoHotelGame.BravoHotelCharacter.UpdateADSReturnTrigger(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFA2B0>
	void UpdateAdsCameraInterp(float Value); // Function BravoHotelGame.BravoHotelCharacter.UpdateAdsCameraInterp(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFA2F0>
	void UnProne(char bClientSimulation); // Function BravoHotelGame.BravoHotelCharacter.UnProne(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFA200>
	void UnlockMovementInput(); // Function BravoHotelGame.BravoHotelCharacter.UnlockMovementInput(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFA290>
	void TryRetreat(char InIsRandomLocation, struct FVector InTargetLocation); // Function BravoHotelGame.BravoHotelCharacter.TryRetreat(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFA120>
	void TryNuclear(struct FVector InTargetLocation); // Function BravoHotelGame.BravoHotelCharacter.TryNuclear(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFA090>
	void TryExitLadder(char bIsForce); // Function BravoHotelGame.BravoHotelCharacter.TryExitLadder(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EFA000>
	struct UBravoHotelPhysicalMaterial TraceSteppedSurface(); // Function BravoHotelGame.BravoHotelCharacter.TraceSteppedSurface(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9FD0>
	void ThrowingGrenade(); // Function BravoHotelGame.BravoHotelCharacter.ThrowingGrenade(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9FB0>
	void TestSpawnPersonalSupplyBox(struct FVector& ServerLocation); // Function BravoHotelGame.BravoHotelCharacter.TestSpawnPersonalSupplyBox(Final|Native|Public|HasOutParms|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9F20>
	void TestMultiPersonalSupplyBox(float Distance, int32_t Count); // Function BravoHotelGame.BravoHotelCharacter.TestMultiPersonalSupplyBox(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9E50>
	void TestEndItemSpawnSimulationBox(struct FSpawnPerkData& Data, struct FString Msg); // Function BravoHotelGame.BravoHotelCharacter.TestEndItemSpawnSimulationBox(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9CF0>
	void StopRagdoll(); // Function BravoHotelGame.BravoHotelCharacter.StopRagdoll(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9CD0>
	void StopPostProcessEffects(struct FName RowName, char bImmediately); // Function BravoHotelGame.BravoHotelCharacter.StopPostProcessEffects(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9C00>
	void StopPlayingPickupAnim(); // Function BravoHotelGame.BravoHotelCharacter.StopPlayingPickupAnim(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9BE0>
	void StopAllPostProcessEffects(); // Function BravoHotelGame.BravoHotelCharacter.StopAllPostProcessEffects(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9BC0>
	void StartTunnelEffect(); // Function BravoHotelGame.BravoHotelCharacter.StartTunnelEffect(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9BA0>
	void StartSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.StartSteadyAim(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9B80>
	void StartStatupMaterialEffect(struct FStatupAnimParameters& StatupParams); // Function BravoHotelGame.BravoHotelCharacter.StartStatupMaterialEffect(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9AD0>
	void StartSpawnBlackOut(float DelayTime); // Function BravoHotelGame.BravoHotelCharacter.StartSpawnBlackOut(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9A50>
	void StartReplaceFreeLook(); // Function BravoHotelGame.BravoHotelCharacter.StartReplaceFreeLook(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9A30>
	void StartRagdoll(); // Function BravoHotelGame.BravoHotelCharacter.StartRagdoll(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9A10>
	void StartPostProcessEffects(struct FName RowName); // Function BravoHotelGame.BravoHotelCharacter.StartPostProcessEffects(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9990>
	void StartFalling(); // Function BravoHotelGame.BravoHotelCharacter.StartFalling(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9970>
	void StartDescending(); // Function BravoHotelGame.BravoHotelCharacter.StartDescending(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9950>
	void StartCastingUI(enum class ECastingUIType CastingUIType, struct FName SourceName, float MaxTime, struct ABravoHotelCharacter Target); // Function BravoHotelGame.BravoHotelCharacter.StartCastingUI(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9800>
	void StartADSProcess_2(); // Function BravoHotelGame.BravoHotelCharacter.StartADSProcess_2(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF97E0>
	void SpectatedDelegate__DelegateSignature(char bIsSpectated); // DelegateFunction BravoHotelGame.BravoHotelCharacter.SpectatedDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	struct ABravoHotelSkillTargetingBase SpawnSkillTargeting(struct FName& ActorName, struct FVector& InSpawnLocation, float Radius); // Function BravoHotelGame.BravoHotelCharacter.SpawnSkillTargeting(Final|Native|Public|HasOutParms|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF96B0>
	void SpawnRandomWeapon(); // Function BravoHotelGame.BravoHotelCharacter.SpawnRandomWeapon(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9660>
	void SpawnBrokenEquipment(); // Function BravoHotelGame.BravoHotelCharacter.SpawnBrokenEquipment(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9640>
	void SimulatedTakeDamage(); // Function BravoHotelGame.BravoHotelCharacter.SimulatedTakeDamage(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9620>
	void ShowTeleportAppearEffect(); // Function BravoHotelGame.BravoHotelCharacter.ShowTeleportAppearEffect(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9600>
	void ShowSkillMap(float Radius); // Function BravoHotelGame.BravoHotelCharacter.ShowSkillMap(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9580>
	void ShowParachuteMesh(char bVisibility, char bIsWithParachute); // Function BravoHotelGame.BravoHotelCharacter.ShowParachuteMesh(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF94B0>
	void ShowKeyActions(); // Function BravoHotelGame.BravoHotelCharacter.ShowKeyActions(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9490>
	void ShowInventoryNotEnoughSpaceMessage(); // Function BravoHotelGame.BravoHotelCharacter.ShowInventoryNotEnoughSpaceMessage(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9470>
	void ShowInteractiveForPickup(struct FInteraction& InteractionInfo, struct FInventoryItemInfo& ItemInfo); // Function BravoHotelGame.BravoHotelCharacter.ShowInteractiveForPickup(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF92A0>
	void ShowInteractiveForAction(struct FInteraction& InteractionInfo); // Function BravoHotelGame.BravoHotelCharacter.ShowInteractiveForAction(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9180>
	void ShowInteractionWidget(struct FInteraction InteractionInfo); // Function BravoHotelGame.BravoHotelCharacter.ShowInteractionWidget(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF9010>
	void ShowHUDbySequence(); // Function BravoHotelGame.BravoHotelCharacter.ShowHUDbySequence(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8FF0>
	void ShowHeartBeatSensorEffect(char IsHeartBeatSensorEffect, float HeartBeatSensorLength); // Function BravoHotelGame.BravoHotelCharacter.ShowHeartBeatSensorEffect(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void ShowCloudFxInDescent(char bWantsToShow); // Function BravoHotelGame.BravoHotelCharacter.ShowCloudFxInDescent(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8F60>
	void ShowAmplifierEffect(char IsAmplifierEffect, float AmplifierLength); // Function BravoHotelGame.BravoHotelCharacter.ShowAmplifierEffect(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void ShouldSprinting(char bNewShouldSprinting); // Function BravoHotelGame.BravoHotelCharacter.ShouldSprinting(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8ED0>
	char ShouldAdjustInDoor(enum class EInDoorAdjustmentTarget InTarget); // Function BravoHotelGame.BravoHotelCharacter.ShouldAdjustInDoor(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8E40>
	void SetVisibleOutBlueZoneBlizzard(char Visible); // Function BravoHotelGame.BravoHotelCharacter.SetVisibleOutBlueZoneBlizzard(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void SetTunnelEffectRatio(float Ratio); // Function BravoHotelGame.BravoHotelCharacter.SetTunnelEffectRatio(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8DC0>
	void SetTeleportEffect(char bStart); // Function BravoHotelGame.BravoHotelCharacter.SetTeleportEffect(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8D30>
	void SetTeamInfoVisibility(char IsVisible); // Function BravoHotelGame.BravoHotelCharacter.SetTeamInfoVisibility(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void SetTargetHealth(enum class ETargetHealthType Type, float InTargetHealth, float InUsableHealth); // Function BravoHotelGame.BravoHotelCharacter.SetTargetHealth(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8C30>
	void SetSteadyAim(char SteadyAim); // Function BravoHotelGame.BravoHotelCharacter.SetSteadyAim(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8BA0>
	void SetState(enum class ECharacterState NewState, char bReplicated); // Function BravoHotelGame.BravoHotelCharacter.SetState(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8AD0>
	void SetSavedPlayerState(struct APlayerState PState); // Function BravoHotelGame.BravoHotelCharacter.SetSavedPlayerState(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8A30>
	void SetReplicatedAnimMontage(struct UAnimMontage NewAnimMontageTPP, struct UAnimMontage NewAnimMontageFPP); // Function BravoHotelGame.BravoHotelCharacter.SetReplicatedAnimMontage(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8970>
	void SetRecordingCharacterTickRate(float TickRate); // Function BravoHotelGame.BravoHotelCharacter.SetRecordingCharacterTickRate(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void SetRandomValuesToCustomizableObject(); // Function BravoHotelGame.BravoHotelCharacter.SetRandomValuesToCustomizableObject(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8950>
	void SetRandomIdleNum(); // Function BravoHotelGame.BravoHotelCharacter.SetRandomIdleNum(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8930>
	void SetProjectileGrenadeActor(struct ABravoHotelProjectileGrenade Grenade); // Function BravoHotelGame.BravoHotelCharacter.SetProjectileGrenadeActor(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF88B0>
	void SetParkourTestComponentIndex(int32_t IndexKey); // Function BravoHotelGame.BravoHotelCharacter.SetParkourTestComponentIndex(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8830>
	void SetNearClipPlane(float NearClipPlane); // Function BravoHotelGame.BravoHotelCharacter.SetNearClipPlane(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF87B0>
	void SetMolotovFlameDotDamage(); // Function BravoHotelGame.BravoHotelCharacter.SetMolotovFlameDotDamage(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8790>
	void SetMagneticDmgDissolveAnimationCurve(); // Function BravoHotelGame.BravoHotelCharacter.SetMagneticDmgDissolveAnimationCurve(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8770>
	void SetMagneticDamagedCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.SetMagneticDamagedCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8750>
	void SetLocalChargingGauge(char bStart); // Function BravoHotelGame.BravoHotelCharacter.SetLocalChargingGauge(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF86C0>
	void SetLadderComponent(struct ULadderComponent NewLadder); // Function BravoHotelGame.BravoHotelCharacter.SetLadderComponent(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8640>
	void SetIsMelee(char bNewMelee, char bNewMeleeJumpAttack); // Function BravoHotelGame.BravoHotelCharacter.SetIsMelee(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8570>
	void SetIsLanded(char bNewLanded); // Function BravoHotelGame.BravoHotelCharacter.SetIsLanded(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF84E0>
	void SetIsInsideBlueZone(char bIsInsideBlueZone); // Function BravoHotelGame.BravoHotelCharacter.SetIsInsideBlueZone(Final|Native|Protected|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8450>
	void SetIsFreeLook(char bNewFreeLook); // Function BravoHotelGame.BravoHotelCharacter.SetIsFreeLook(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF83C0>
	void SetIsFired(char bNewFired, float AutoDeactiveDelayTime); // Function BravoHotelGame.BravoHotelCharacter.SetIsFired(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF82F0>
	void SetInternalMagneticDamagedDissolveCharacterMaterial(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.SetInternalMagneticDamagedDissolveCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8270>
	void SetInternalMagneticDamagedCharacterMaterial(char bOn); // Function BravoHotelGame.BravoHotelCharacter.SetInternalMagneticDamagedCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF81E0>
	void SetInternalMagneticDamagedCharacterBackGroundMaterial_On(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalMagneticDamagedCharacterBackGroundMaterial_On(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF81C0>
	void SetInternalMagneticDamagedCharacterBackGroundMaterial_Off(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalMagneticDamagedCharacterBackGroundMaterial_Off(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF81A0>
	void SetInternalDustDissolveCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDustDissolveCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8180>
	void SetInternalDustCharacterMaterial(char bOn); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDustCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF80F0>
	void SetInternalDamagedDissolveCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDamagedDissolveCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF80D0>
	void SetInternalDamagedCharacterMaterial(char bOn); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDamagedCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8040>
	void SetInternalDamagedCharacterBackGroundMaterial_On(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDamagedCharacterBackGroundMaterial_On(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8020>
	void SetInternalDamagedCharacterBackGroundMaterial_Off(); // Function BravoHotelGame.BravoHotelCharacter.SetInternalDamagedCharacterBackGroundMaterial_Off(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF8000>
	void SetInteractiveNoHide(char NoHide); // Function BravoHotelGame.BravoHotelCharacter.SetInteractiveNoHide(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7F70>
	void SetInteractiveCustomMode(int32_t ModeNum); // Function BravoHotelGame.BravoHotelCharacter.SetInteractiveCustomMode(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7EF0>
	void SetInteractionType(enum class EInteractionType NewType); // Function BravoHotelGame.BravoHotelCharacter.SetInteractionType(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7E70>
	void SetInReduceSpeedExplosionRange(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.SetInReduceSpeedExplosionRange(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7DF0>
	void SetFoundVehicleLocations(struct FCarScanUIInfo& InCarScanUIInfo); // Function BravoHotelGame.BravoHotelCharacter.SetFoundVehicleLocations(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7D20>
	void SetFlashBangPlaySound(); // Function BravoHotelGame.BravoHotelCharacter.SetFlashBangPlaySound(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7D00>
	void SetFlashBangEndSound(); // Function BravoHotelGame.BravoHotelCharacter.SetFlashBangEndSound(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7CE0>
	void SetFlashBangAngle(float Angle); // Function BravoHotelGame.BravoHotelCharacter.SetFlashBangAngle(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7C60>
	void SetFireType(enum class EFireType NewFireType); // Function BravoHotelGame.BravoHotelCharacter.SetFireType(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7BE0>
	void SetDustDissolveAnimationCurve(); // Function BravoHotelGame.BravoHotelCharacter.SetDustDissolveAnimationCurve(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7BC0>
	void SetDustCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.SetDustCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7BA0>
	void SetDissolveAnimationCurveData(); // Function BravoHotelGame.BravoHotelCharacter.SetDissolveAnimationCurveData(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7B80>
	void SetDescentVariables(float NewAirControl, float NewMaxWalkSpeed, float NewGravityScale, float NewBarkingDecelerationFalling, float NewMaxAcceleration, struct FVector NewCameraRelativeLocation, char bForceLocation); // Function BravoHotelGame.BravoHotelCharacter.SetDescentVariables(Final|Native|Public|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7960>
	void SetDefaultCameraLag(float NewDefaultCameraLag); // Function BravoHotelGame.BravoHotelCharacter.SetDefaultCameraLag(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF78E0>
	void SetDamagedFlashBang(float FlashBangValue); // Function BravoHotelGame.BravoHotelCharacter.SetDamagedFlashBang(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7860>
	void SetDamagedCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.SetDamagedCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7840>
	void SetChargingGauge(char bStart); // Function BravoHotelGame.BravoHotelCharacter.SetChargingGauge(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF77B0>
	void SetCharacterMovementMode(char Mode); // Function BravoHotelGame.BravoHotelCharacter.SetCharacterMovementMode(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7730>
	void SetCharacterIntheWater(); // Function BravoHotelGame.BravoHotelCharacter.SetCharacterIntheWater(Native|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7710>
	void SetCameraLag(char bEnable); // Function BravoHotelGame.BravoHotelCharacter.SetCameraLag(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7680>
	void SetCameraAssistComponent(char bSpectactor); // Function BravoHotelGame.BravoHotelCharacter.SetCameraAssistComponent(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF75F0>
	void SetBackLightComponentsActive(char bNewActive); // Function BravoHotelGame.BravoHotelCharacter.SetBackLightComponentsActive(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7560>
	void SetArmedState(char bDoArm, char bPlayUnequipAnimation, char bOrdered); // Function BravoHotelGame.BravoHotelCharacter.SetArmedState(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7440>
	void SetADSReturnTimer(float ADSReturnDelayTime); // Function BravoHotelGame.BravoHotelCharacter.SetADSReturnTimer(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7330>
	void SetActiveFur(char bActive); // Function BravoHotelGame.BravoHotelCharacter.SetActiveFur(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void SetActiveBreathEffect(char bNewActive); // Function BravoHotelGame.BravoHotelCharacter.SetActiveBreathEffect(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF73B0>
	void ServerWindowBreaching(struct TArray<struct ABravoHotelCharacter> TargetDamagedCharacters); // Function BravoHotelGame.BravoHotelCharacter.ServerWindowBreaching(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7270>
	void ServerUseBackpackItem(int32_t BackpackItemIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerUseBackpackItem(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF71B0>
	void ServerUpdateRagdollVariables(struct FVector NewRagdollVelocity, struct FVector NewRagdollLocation, struct FVector NewActorLocation); // Function BravoHotelGame.BravoHotelCharacter.ServerUpdateRagdollVariables(Net|Native|Event|Protected|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF7020>
	void ServerUpdateNearbyVehicles(struct TArray<struct ABravoHotelVehicle> AddedVehicles, struct TArray<struct ABravoHotelVehicle> RemovedVehicles); // Function BravoHotelGame.BravoHotelCharacter.ServerUpdateNearbyVehicles(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF6F00>
	void ServerUpdateCamera(struct FRepCameraInfo InCameraInfo); // Function BravoHotelGame.BravoHotelCharacter.ServerUpdateCamera(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF6E40>
	void ServerTryUseLadder(struct ABravoHotelLadder DetectedLadder); // Function BravoHotelGame.BravoHotelCharacter.ServerTryUseLadder(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF6D80>
	void ServerTryExitVehicle(enum class ECharacterState NextState); // Function BravoHotelGame.BravoHotelCharacter.ServerTryExitVehicle(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF6CD0>
	void ServerTryExitLadder(); // Function BravoHotelGame.BravoHotelCharacter.ServerTryExitLadder(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF6C80>
	void ServerTryEnterVehicle(struct UBravoHotelVehicleSeatComponent TargetVehicleSeat); // Function BravoHotelGame.BravoHotelCharacter.ServerTryEnterVehicle(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF6BC0>
	void ServerTryElevatorInteraction(struct UActor ElevatorActor, struct UPrimitiveComponent ElevatorComponet); // Function BravoHotelGame.BravoHotelCharacter.ServerTryElevatorInteraction(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF6AC0>
	void ServerTryDropBoxInteraction(struct UActor TmpDropBox); // Function BravoHotelGame.BravoHotelCharacter.ServerTryDropBoxInteraction(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF6A00>
	void ServerTotalAirWalkDistance(float TotalDistance); // Function BravoHotelGame.BravoHotelCharacter.ServerTotalAirWalkDistance(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF6950>
	void ServerTestSpawnPersonalBox(float X, float Y); // Function BravoHotelGame.BravoHotelCharacter.ServerTestSpawnPersonalBox(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF6850>
	void ServerTakeDamage_Radial(float DamageAmount, struct FBravoHotelDamageEvent_Radial DamageEvent, struct ABravoHotelCharacter TargetCharacter); // Function BravoHotelGame.BravoHotelCharacter.ServerTakeDamage_Radial(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF65D0>
	void ServerTakeDamage_Point(float DamageAmount, struct FBravoHotelDamageEvent_Point DamageEvent, struct ABravoHotelCharacter TargetCharacter); // Function BravoHotelGame.BravoHotelCharacter.ServerTakeDamage_Point(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF6420>
	void ServerTakeDamage(float DamageAmount, struct FDamageEvent DamageEvent, struct ABravoHotelCharacter TargetCharacter); // Function BravoHotelGame.BravoHotelCharacter.ServerTakeDamage(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF62D0>
	void ServerStopUltimate_Recon(); // Function BravoHotelGame.BravoHotelCharacter.ServerStopUltimate_Recon(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF6280>
	void ServerStopSliding(); // Function BravoHotelGame.BravoHotelCharacter.ServerStopSliding(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF6230>
	void ServerStopRolling(); // Function BravoHotelGame.BravoHotelCharacter.ServerStopRolling(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF61E0>
	void ServerStopRevive(struct UActor RevivedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerStopRevive(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF6120>
	void ServerStopResuscitation(struct UActor ResuscitatedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerStopResuscitation(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF6060>
	void ServerStopMontage(struct UAnimMontage AnimMontage, float BlendTime); // Function BravoHotelGame.BravoHotelCharacter.ServerStopMontage(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF5F60>
	void ServerStartUltimate_Recon(struct FVector_NetQuantize InitialImpulse); // Function BravoHotelGame.BravoHotelCharacter.ServerStartUltimate_Recon(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF5EB0>
	void ServerStartStuntman(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartStuntman(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF5E60>
	void ServerStartSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartSteadyAim(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF5E10>
	void ServerStartSliding(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartSliding(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF5DC0>
	void ServerStartRolling(struct FVector_NetQuantize TargetRollingImpulse); // Function BravoHotelGame.BravoHotelCharacter.ServerStartRolling(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF5D10>
	void ServerStartRocketJump(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartRocketJump(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF5CC0>
	void ServerStartRevive(struct UActor RevivedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerStartRevive(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF5C00>
	void ServerStartResuscitation(struct UActor ResuscitatedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerStartResuscitation(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF5B40>
	void ServerStartMeteorJump(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartMeteorJump(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF5AF0>
	void ServerStartKickDoor(struct ABravoHotelDoor TargetDoor); // Function BravoHotelGame.BravoHotelCharacter.ServerStartKickDoor(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF5A30>
	void ServerStartDescenting(); // Function BravoHotelGame.BravoHotelCharacter.ServerStartDescenting(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF59E0>
	void ServerSpawnPersonalBox(struct FSpawnPerkData SpawnPersonalBoxData, struct FDebugSupplyBoxInfo DebugData); // Function BravoHotelGame.BravoHotelCharacter.ServerSpawnPersonalBox(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF5870>
	void ServerSpawnPerk(struct FSpawnPerkData SpawnPerkData); // Function BravoHotelGame.BravoHotelCharacter.ServerSpawnPerk(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF5760>
	void ServerSpawnBombing(struct FVector_NetQuantize SpawnLocation); // Function BravoHotelGame.BravoHotelCharacter.ServerSpawnBombing(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF56B0>
	void ServerSetUpdateRenderSettings(char bValue); // Function BravoHotelGame.BravoHotelCharacter.ServerSetUpdateRenderSettings(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF55F0>
	void ServerSetState(enum class ECharacterState NewState); // Function BravoHotelGame.BravoHotelCharacter.ServerSetState(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF5540>
	void ServerSetSearchInstinctLocation(struct FVector_NetQuantize InSearchInstinctLocation); // Function BravoHotelGame.BravoHotelCharacter.ServerSetSearchInstinctLocation(Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF5490>
	void ServerSetRemoteViewRotForDriver(uint16_t SendPitch, uint16_t SendYaw); // Function BravoHotelGame.BravoHotelCharacter.ServerSetRemoteViewRotForDriver(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF5390>
	void ServerSetProjectileGrenadeState(struct ABravoHotelProjectileGrenade Grenade, enum class EProjectileGrenadeState NewState, struct UActor NewTriggerActor); // Function BravoHotelGame.BravoHotelCharacter.ServerSetProjectileGrenadeState(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF5260>
	void ServerSetParachuteTargetRotator(struct FRotator NewRotation); // Function BravoHotelGame.BravoHotelCharacter.ServerSetParachuteTargetRotator(Net|Native|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF51B0>
	void ServerSetLeanState(enum class ELeanState NewLeanState, float InLeanDegreeMax); // Function BravoHotelGame.BravoHotelCharacter.ServerSetLeanState(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF50B0>
	void ServerSetIsParachuteLanding(char Flag, float Height); // Function BravoHotelGame.BravoHotelCharacter.ServerSetIsParachuteLanding(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF4FB0>
	void ServerSetIsMelee(char bNewMelee); // Function BravoHotelGame.BravoHotelCharacter.ServerSetIsMelee(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF4EF0>
	void ServerSetIsFreeLook(char bNewFreeLook); // Function BravoHotelGame.BravoHotelCharacter.ServerSetIsFreeLook(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF4E30>
	void ServerSetInteractionType(enum class EInteractionType NewType); // Function BravoHotelGame.BravoHotelCharacter.ServerSetInteractionType(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF4D80>
	void ServerSetInSmoke(char bNewSmoke); // Function BravoHotelGame.BravoHotelCharacter.ServerSetInSmoke(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF4CC0>
	void ServerSetFireType(enum class EFireType NewFireType); // Function BravoHotelGame.BravoHotelCharacter.ServerSetFireType(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF4C10>
	void ServerSetCustomBuoyancySwimMode(char Mode); // Function BravoHotelGame.BravoHotelCharacter.ServerSetCustomBuoyancySwimMode(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF4B50>
	void ServerSetChargingGauge(char bStart); // Function BravoHotelGame.BravoHotelCharacter.ServerSetChargingGauge(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF4A90>
	void ServerSetCastingUI(enum class ECastingUIType CastingUIType, struct FName SourceName, float MaxTime, struct ABravoHotelCharacter Target); // Function BravoHotelGame.BravoHotelCharacter.ServerSetCastingUI(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF4910>
	void ServerSetBoostPercent(int8_t Percent); // Function BravoHotelGame.BravoHotelCharacter.ServerSetBoostPercent(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF4860>
	void ServerSetActorRotation(struct FRotator NewRotation); // Function BravoHotelGame.BravoHotelCharacter.ServerSetActorRotation(Net|Native|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF47B0>
	void ServerSetActorLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation); // Function BravoHotelGame.BravoHotelCharacter.ServerSetActorLocationAndRotation(Net|Native|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF4680>
	void ServerSetActiveSkillsKeyNameList(struct TArray<struct FName> KeyNameList); // Function BravoHotelGame.BravoHotelCharacter.ServerSetActiveSkillsKeyNameList(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF45C0>
	void ServerSendInvalidHitInfos(struct TArray<struct FRepInvalidHitInfo> InvalidHitInofs); // Function BravoHotelGame.BravoHotelCharacter.ServerSendInvalidHitInfos(Net|Native|Event|Public|NetServer) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF4520>
	void ServerSelectThrowingWeaponThrowingType(enum class EGrenadeThrowingType NewThrowingType); // Function BravoHotelGame.BravoHotelCharacter.ServerSelectThrowingWeaponThrowingType(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF4470>
	void ServerRewindMontage(struct UAnimMontage AnimMontage); // Function BravoHotelGame.BravoHotelCharacter.ServerRewindMontage(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF43B0>
	void ServerResetVehicleSearch(); // Function BravoHotelGame.BravoHotelCharacter.ServerResetVehicleSearch(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF4360>
	void ServerResetSearchInstinct(); // Function BravoHotelGame.BravoHotelCharacter.ServerResetSearchInstinct(Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF4310>
	void ServerReselectPerkDeck(); // Function BravoHotelGame.BravoHotelCharacter.ServerReselectPerkDeck(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF42C0>
	void ServerRequestPayGold(int32_t ActionCode, int32_t Amount); // Function BravoHotelGame.BravoHotelCharacter.ServerRequestPayGold(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF41C0>
	void ServerRequestBuildingItemSpawnState(struct ABravoHotelBuilding Building); // Function BravoHotelGame.BravoHotelCharacter.ServerRequestBuildingItemSpawnState(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF4100>
	void ServerRequestBuildingItemSpawnList(int32_t Size, float IntervalTime, char ToJson); // Function BravoHotelGame.BravoHotelCharacter.ServerRequestBuildingItemSpawnList(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF3FC0>
	void ServerRequestBuildingCount(); // Function BravoHotelGame.BravoHotelCharacter.ServerRequestBuildingCount(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF3F70>
	void ServerQuickLanding(struct FVector_NetQuantize ClientActorLocation); // Function BravoHotelGame.BravoHotelCharacter.ServerQuickLanding(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF3EC0>
	void ServerPlayMontage(struct UAnimMontage AnimMontageTPP, struct UAnimMontage AnimMontageFPP); // Function BravoHotelGame.BravoHotelCharacter.ServerPlayMontage(Net|NetReliableNative|Event|Protected|NetServer|BlueprintCallable|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF3DC0>
	void ServerPickUpInBox(struct ABravoHotelDropBoxActor DropBoxActor, int8_t ItemIndex, int32_t GainQuantity, int32_t WeaponSlotIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerPickUpInBox(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF3C40>
	void ServerPersonalBoxRePosition(struct ABHPersonalSupplyBox TargetSupplyBox, struct FVector NewLocation, struct FString HitActorName); // Function BravoHotelGame.BravoHotelCharacter.ServerPersonalBoxRePosition(Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF3AF0>
	void ServerMoveItem(struct UActor SourceActor, enum class ItemWidgetDragType SourceSlotType, struct FInventoryItemInfo SourceItemInfo, struct UActor TargetActor, enum class ItemWidgetDragType TargetSlotType, int32_t TargetIndex, int32_t GainQuantity); // Function BravoHotelGame.BravoHotelCharacter.ServerMoveItem(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF3860>
	void ServerMeteorStrike(); // Function BravoHotelGame.BravoHotelCharacter.ServerMeteorStrike(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF3810>
	void ServerMaxAirWalkDistance(float MaxDistance); // Function BravoHotelGame.BravoHotelCharacter.ServerMaxAirWalkDistance(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF3760>
	void ServerLaunchCharacter(struct FVector LaunchVelocity); // Function BravoHotelGame.BravoHotelCharacter.ServerLaunchCharacter(Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF3690>
	void ServerJetpackBooster(char bNewJackpack); // Function BravoHotelGame.BravoHotelCharacter.ServerJetpackBooster(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF35D0>
	void ServerJetpackAim(char bNewJetpackAim); // Function BravoHotelGame.BravoHotelCharacter.ServerJetpackAim(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF3510>
	void ServerInputState(int8_t Forward, int8_t Right); // Function BravoHotelGame.BravoHotelCharacter.ServerInputState(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF3420>
	void ServerInputFPSOnly(char bFlag); // Function BravoHotelGame.BravoHotelCharacter.ServerInputFPSOnly(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF3360>
	void ServerHandleDamageToVehicleDestructibleComponent(struct UBravoHotelDestructibleComponent DestructibleComponent, struct FHitResult HitDetails, struct FVector ImpactVelocity); // Function BravoHotelGame.BravoHotelCharacter.ServerHandleDamageToVehicleDestructibleComponent(Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF3120>
	void ServerForceUpdateTerrainType(); // Function BravoHotelGame.BravoHotelCharacter.ServerForceUpdateTerrainType(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF30D0>
	void ServerFireMode(); // Function BravoHotelGame.BravoHotelCharacter.ServerFireMode(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF3080>
	void ServerFailedActiveSkill_2(); // Function BravoHotelGame.BravoHotelCharacter.ServerFailedActiveSkill_2(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF3030>
	void ServerFailedActiveSkill_1(); // Function BravoHotelGame.BravoHotelCharacter.ServerFailedActiveSkill_1(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF2FE0>
	void ServerEscapeTheFlames(struct FMolotovFlameDotDamageInfo FlameDamageInfo); // Function BravoHotelGame.BravoHotelCharacter.ServerEscapeTheFlames(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF2EA0>
	void ServerEquipPerk(enum class EPerkSlotFlag Slot, struct FName PerkName, int32_t Level, char Reset); // Function BravoHotelGame.BravoHotelCharacter.ServerEquipPerk(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF2D20>
	void ServerEndSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.ServerEndSteadyAim(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF2CD0>
	void ServerEndRevive(struct UActor RevivedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerEndRevive(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF2C10>
	void ServerEndResuscitation(struct UActor ResuscitatedActor); // Function BravoHotelGame.BravoHotelCharacter.ServerEndResuscitation(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF2B50>
	void ServerDoWalking(char bNewWalking); // Function BravoHotelGame.BravoHotelCharacter.ServerDoWalking(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF2940>
	void ServerDoSprinting(char bNewSprinting); // Function BravoHotelGame.BravoHotelCharacter.ServerDoSprinting(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF2880>
	void ServerDoRetreat(struct FVector NewLocation, struct FRotator NewRotation, float RandomDistanceMax); // Function BravoHotelGame.BravoHotelCharacter.ServerDoRetreat(Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF2700>
	void ServerDoProne(char bNewProne); // Function BravoHotelGame.BravoHotelCharacter.ServerDoProne(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF2640>
	void ServerDoPickUpItemOrWeapon(int32_t WeaponSlotIndex, struct ABravoHotelPickup PickableItem, int32_t GainQuantity); // Function BravoHotelGame.BravoHotelCharacter.ServerDoPickUpItemOrWeapon(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF2510>
	void ServerDoorBreaching(struct ABravoHotelDoor TargetDoor, char bIsDamageCauserFrontOfDoor, struct TArray<struct ABravoHotelCharacter> TargetDamagedCharacters); // Function BravoHotelGame.BravoHotelCharacter.ServerDoorBreaching(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF2A00>
	void ServerDoNuclear(struct FVector_NetQuantize SpawnLocation); // Function BravoHotelGame.BravoHotelCharacter.ServerDoNuclear(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF2460>
	void ServerDoAirWalk(char bNewAirWalk, float InDuration, float InGravity); // Function BravoHotelGame.BravoHotelCharacter.ServerDoAirWalk(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF2320>
	void ServerDamageInFlames(struct FMolotovFlameDotDamageInfo FlameDamageInfo); // Function BravoHotelGame.BravoHotelCharacter.ServerDamageInFlames(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF21E0>
	void ServerCompletedCombine(); // Function BravoHotelGame.BravoHotelCharacter.ServerCompletedCombine(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF2190>
	void ServerClearCastingUI(); // Function BravoHotelGame.BravoHotelCharacter.ServerClearCastingUI(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF2140>
	void ServerChoosePerkDeck(int32_t ChooseIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerChoosePerkDeck(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF2080>
	void ServerCheckLineTrace(); // Function BravoHotelGame.BravoHotelCharacter.ServerCheckLineTrace(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF2030>
	void ServerChangeGender(); // Function BravoHotelGame.BravoHotelCharacter.ServerChangeGender(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1FE0>
	void ServerCancleActiveSkill(int32_t CancleActiveSkillSlot); // Function BravoHotelGame.BravoHotelCharacter.ServerCancleActiveSkill(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1F20>
	void ServerBuildingCountCheck(); // Function BravoHotelGame.BravoHotelCharacter.ServerBuildingCountCheck(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1ED0>
	void ServerBeginCombine(struct FName RecipeKey); // Function BravoHotelGame.BravoHotelCharacter.ServerBeginCombine(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1E10>
	void ServerBeginCastingBackpackItem(int32_t BackpackItemIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerBeginCastingBackpackItem(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1D50>
	void ServerAttachToComponent(struct UActor AttachingActor, struct UPrimitiveComponent AttachedComponent, struct FVector AttachLocation, struct FVector AttachNormal); // Function BravoHotelGame.BravoHotelCharacter.ServerAttachToComponent(Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1BA0>
	void ServerApplyDamage(float DamageAmount, struct FDamageEvent DamageEvent, struct AController EventInstigator, struct UActor DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.ServerApplyDamage(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1A10>
	void ServerAddPerk(int32_t Count); // Function BravoHotelGame.BravoHotelCharacter.ServerAddPerk(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1950>
	void ServerAddExpToPerk(enum class EPerkSlotFlag Slot, int32_t ExpValue); // Function BravoHotelGame.BravoHotelCharacter.ServerAddExpToPerk(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1850>
	void ServerActiveSkill(int32_t ActiveSkillSlot); // Function BravoHotelGame.BravoHotelCharacter.ServerActiveSkill(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1790>
	void ServerActionDestructObject(struct ADestructibleActor DestructibleActor, struct UDestructibleComponent DestructibleComponent, struct FVector Location, float Damage, float EffectRange); // Function BravoHotelGame.BravoHotelCharacter.ServerActionDestructObject(Net|Native|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF15C0>
	void ServerAbusingLog_InvalidGameThread(struct FString FunctionName); // Function BravoHotelGame.BravoHotelCharacter.ServerAbusingLog_InvalidGameThread(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF14F0>
	void ServerAbortCombine(); // Function BravoHotelGame.BravoHotelCharacter.ServerAbortCombine(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF14A0>
	void ServerAbortCastingBackpackItem(int32_t BackpackItemIndex); // Function BravoHotelGame.BravoHotelCharacter.ServerAbortCastingBackpackItem(Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF13E0>
	void SelectThrowingWeaponThrowingType(); // Function BravoHotelGame.BravoHotelCharacter.SelectThrowingWeaponThrowingType(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF13C0>
	void SelectPerkDeck(struct FName DeckName); // Function BravoHotelGame.BravoHotelCharacter.SelectPerkDeck(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1340>
	void RifleMeleeAttack(); // Function BravoHotelGame.BravoHotelCharacter.RifleMeleeAttack(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1320>
	void RevertGeneralSettingNearClipPlane(); // Function BravoHotelGame.BravoHotelCharacter.RevertGeneralSettingNearClipPlane(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1300>
	void ResetTargetHealth(); // Function BravoHotelGame.BravoHotelCharacter.ResetTargetHealth(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF12E0>
	void ResetPerkDeckUI(); // Function BravoHotelGame.BravoHotelCharacter.ResetPerkDeckUI(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF12C0>
	void ResetOxygen(); // Function BravoHotelGame.BravoHotelCharacter.ResetOxygen(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF12A0>
	void ResetMagneticDamagedCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.ResetMagneticDamagedCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1280>
	void ResetLanding(); // Function BravoHotelGame.BravoHotelCharacter.ResetLanding(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1260>
	void ResetIdleNum(); // Function BravoHotelGame.BravoHotelCharacter.ResetIdleNum(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1240>
	void ResetFlashBangPP(); // Function BravoHotelGame.BravoHotelCharacter.ResetFlashBangPP(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1220>
	void ResetDustCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.ResetDustCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1200>
	void ResetDamagedCharacterMaterial(); // Function BravoHotelGame.BravoHotelCharacter.ResetDamagedCharacterMaterial(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF11E0>
	void ResetAbusingLog_InvalidGameThread(); // Function BravoHotelGame.BravoHotelCharacter.ResetAbusingLog_InvalidGameThread(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF11C0>
	void ResendHUDInfo(); // Function BravoHotelGame.BravoHotelCharacter.ResendHUDInfo(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF11A0>
	void RequestServerBuildingCount(); // Function BravoHotelGame.BravoHotelCharacter.RequestServerBuildingCount(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1180>
	void RequestProximityUpdate(); // Function BravoHotelGame.BravoHotelCharacter.RequestProximityUpdate(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1160>
	void RequestNearBuildingItemSpawnState(); // Function BravoHotelGame.BravoHotelCharacter.RequestNearBuildingItemSpawnState(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1140>
	void RequestAllBuildingItemSpawnInfo(int32_t RequestSize, float IntervalTime, char ToJson); // Function BravoHotelGame.BravoHotelCharacter.RequestAllBuildingItemSpawnInfo(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1030>
	void ReplaceFreeLookImmediately(); // Function BravoHotelGame.BravoHotelCharacter.ReplaceFreeLookImmediately(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF1010>
	void RemoveWearableItem(enum class EWearableItemType Slot, char bUpdateSkeletalMesh); // Function BravoHotelGame.BravoHotelCharacter.RemoveWearableItem(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0F40>
	void RemoveThrownMolotovCocktail(struct ABravoHotelProjectileGrenadeMolotovCocktail MolotovCocktail); // Function BravoHotelGame.BravoHotelCharacter.RemoveThrownMolotovCocktail(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0EC0>
	void RemoveThrownFlashbang(struct ABravoHotelProjectileGrenadeFlashbang Flashbang); // Function BravoHotelGame.BravoHotelCharacter.RemoveThrownFlashbang(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0E40>
	void RemoveTargetHealth(enum class ETargetHealthType Type); // Function BravoHotelGame.BravoHotelCharacter.RemoveTargetHealth(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0DC0>
	void RemoveShortTimeHealth(struct Object HealthOwner); // Function BravoHotelGame.BravoHotelCharacter.RemoveShortTimeHealth(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0D40>
	void RemoveForceFieldBuff(); // Function BravoHotelGame.BravoHotelCharacter.RemoveForceFieldBuff(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0D20>
	void RemoveEquippingWearableItems(); // Function BravoHotelGame.BravoHotelCharacter.RemoveEquippingWearableItems(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0D00>
	void RemoveDetectedStealable(struct ABravoHotelCharacter NewCharacter); // Function BravoHotelGame.BravoHotelCharacter.RemoveDetectedStealable(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0C80>
	void RemoveDetectedItem(struct ABravoHotelPickup NewPickup); // Function BravoHotelGame.BravoHotelCharacter.RemoveDetectedItem(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0C00>
	void RemoveDetectedDropBox(struct ABravoHotelDropBoxActor NewPickup); // Function BravoHotelGame.BravoHotelCharacter.RemoveDetectedDropBox(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0B80>
	void RemoveCondition(enum class ECharacterConditionType ConditionType, enum class EAbilityCase Key); // Function BravoHotelGame.BravoHotelCharacter.RemoveCondition(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0AC0>
	void RemoveCameraPP(struct UClass* TargetPPPresetClass); // Function BravoHotelGame.BravoHotelCharacter.RemoveCameraPP(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0A40>
	void RemoveBackpackShield(struct FBravoHotelDamageEvent_Point& DamageEvent); // Function BravoHotelGame.BravoHotelCharacter.RemoveBackpackShield(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0920>
	struct FName RemoveArmShield(struct FHitResult& TargetHitResult, struct FVector& ShotDirection); // Function BravoHotelGame.BravoHotelCharacter.RemoveArmShield(Final|Native|Public|HasOutParms|HasDefaults|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF07E0>
	void RemoveAllWearableItem2(); // Function BravoHotelGame.BravoHotelCharacter.RemoveAllWearableItem2(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF07A0>
	void RemoveAllWearableItem(); // Function BravoHotelGame.BravoHotelCharacter.RemoveAllWearableItem(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF07C0>
	void RemoveAllFoundVehicleLocations(); // Function BravoHotelGame.BravoHotelCharacter.RemoveAllFoundVehicleLocations(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0780>
	void RemoveAllDetectedItems(); // Function BravoHotelGame.BravoHotelCharacter.RemoveAllDetectedItems(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0760>
	void RemoveAllBackpackItem(); // Function BravoHotelGame.BravoHotelCharacter.RemoveAllBackpackItem(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0740>
	void RefreshAppearanceInfo(); // Function BravoHotelGame.BravoHotelCharacter.RefreshAppearanceInfo(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0720>
	void ReduceCharacterSpeedInGrenadeExplosionRange(); // Function BravoHotelGame.BravoHotelCharacter.ReduceCharacterSpeedInGrenadeExplosionRange(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0700>
	void ReconnectProcess(); // Function BravoHotelGame.BravoHotelCharacter.ReconnectProcess(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF06E0>
	void ReceiverVoice(struct FName Idx); // Function BravoHotelGame.BravoHotelCharacter.ReceiverVoice(Net|NetReliableNative|Event|Public|NetClient) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0650>
	void ReadyTeleport(); // Function BravoHotelGame.BravoHotelCharacter.ReadyTeleport(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void ReadyGivePerkEvent(); // Function BravoHotelGame.BravoHotelCharacter.ReadyGivePerkEvent(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void PunchOnGround(); // Function BravoHotelGame.BravoHotelCharacter.PunchOnGround(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0630>
	void PunchOnAir(); // Function BravoHotelGame.BravoHotelCharacter.PunchOnAir(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0610>
	void Prone(char bClientSimulation); // Function BravoHotelGame.BravoHotelCharacter.Prone(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0580>
	void PrintAllDetectedItems(); // Function BravoHotelGame.BravoHotelCharacter.PrintAllDetectedItems(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0560>
	void PrepareLanding(enum class ELandingReason InLandingReason); // Function BravoHotelGame.BravoHotelCharacter.PrepareLanding(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF04E0>
	void PlaySoundPlosiveSoundDetection3Lv(); // Function BravoHotelGame.BravoHotelCharacter.PlaySoundPlosiveSoundDetection3Lv(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF04C0>
	void PlayMontageTakeDamage(); // Function BravoHotelGame.BravoHotelCharacter.PlayMontageTakeDamage(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF04A0>
	void PlayHitSoundForInstigator(); // Function BravoHotelGame.BravoHotelCharacter.PlayHitSoundForInstigator(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0480>
	void PlayDeathAnimation(struct FAnimSlot DeathAnimSlot, char bIsForce, struct FVector Force, struct FRotator DeathRotation); // Function BravoHotelGame.BravoHotelCharacter.PlayDeathAnimation(Final|Native|Private|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0300>
	struct FAudioPlayingHandle PlayCharacterSound(struct UAkAudioEvent Event, struct TArray<struct FAudioCondition>& Conditions); // Function BravoHotelGame.BravoHotelCharacter.PlayCharacterSound(Final|BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF01D0>
	void PlayCameraShakeDescenting(); // Function BravoHotelGame.BravoHotelCharacter.PlayCameraShakeDescenting(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF01B0>
	void PistolMeleeAttack(); // Function BravoHotelGame.BravoHotelCharacter.PistolMeleeAttack(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0190>
	void PickableItemDetected__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.PickableItemDetected__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void PhysicsImpulse_OnServer(struct ABravoHotelMutiplayerPhysicsActor PhysicsActor, struct FVector Impulse, struct FName BoneName); // Function BravoHotelGame.BravoHotelCharacter.PhysicsImpulse_OnServer(Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EF0030>
	void PhysicsImpulse_Multicast(struct ABravoHotelMutiplayerPhysicsActor PhysicsActor, struct FVector Impulse, struct FName BoneName); // Function BravoHotelGame.BravoHotelCharacter.PhysicsImpulse_Multicast(Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEFF10>
	void PhysicsActor_OnServer(struct ABravoHotelMutiplayerPhysicsActor PhysicsActor, struct FTransform actorTransform); // Function BravoHotelGame.BravoHotelCharacter.PhysicsActor_OnServer(Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEFDB0>
	void PhysicsActor_Multicast(struct ABravoHotelMutiplayerPhysicsActor PhysicsActor, struct FTransform actorTransform); // Function BravoHotelGame.BravoHotelCharacter.PhysicsActor_Multicast(Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEFC70>
	void PhasePerkLevelUpTimer(float DelayTime, int32_t UpCount); // Function BravoHotelGame.BravoHotelCharacter.PhasePerkLevelUpTimer(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEFBA0>
	void PhasePerkLevelUpReady(); // Function BravoHotelGame.BravoHotelCharacter.PhasePerkLevelUpReady(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEFB80>
	void PhasePerkLevelUp(int32_t UpCount); // Function BravoHotelGame.BravoHotelCharacter.PhasePerkLevelUp(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEFB00>
	void PerkSpinEvent(char bShow, int32_t Count, enum class EPerkSlotFlag Slot); // Function BravoHotelGame.BravoHotelCharacter.PerkSpinEvent(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnViewCameraOutWater__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnViewCameraOutWater__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnViewCameraInWater__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnViewCameraInWater__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnUpdateStartReady(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateStartReady(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEFA80>
	void OnUpdatePassenger(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdatePassenger(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF700>
	void OnUpdateParachuting(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateParachuting(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEFA00>
	void OnUpdateLadder(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateLadder(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF800>
	void OnUpdateKnockout(float fDeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateKnockout(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF980>
	void OnUpdateInAircraftCinematic(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateInAircraftCinematic(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF900>
	void OnUpdateInAircraft(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateInAircraft(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF880>
	void OnUpdateEndReady(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateEndReady(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF800>
	void OnUpdateDriverPossessedPawn(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateDriverPossessedPawn(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF780>
	void OnUpdateDriver(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateDriver(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF700>
	void OnUpdateDescent(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateDescent(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF680>
	void OnUpdateDeath(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateDeath(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF600>
	void OnUpdateCriticalTime(float fDeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateCriticalTime(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF580>
	void OnUpdateBattle(float fDeltaTime); // Function BravoHotelGame.BravoHotelCharacter.OnUpdateBattle(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF500>
	void OnToggleWidget(enum class EToggleWidgetModeType& ToggleType); // Function BravoHotelGame.BravoHotelCharacter.OnToggleWidget(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF470>
	void OnThrowingGrenadeMontageEnded(struct UAnimMontage Montage, char bInterrupted); // Function BravoHotelGame.BravoHotelCharacter.OnThrowingGrenadeMontageEnded(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE470>
	void OnStartCineAircraft(struct UActor InAircraftFlight); // Function BravoHotelGame.BravoHotelCharacter.OnStartCineAircraft(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF3F0>
	void OnSpawnBlackOutDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnSpawnBlackOutDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnSetBaseElevator(struct UPrimitiveComponent baseComponent); // Function BravoHotelGame.BravoHotelCharacter.OnSetBaseElevator(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF370>
	void OnRep_UnderWater(char& LastFlag); // Function BravoHotelGame.BravoHotelCharacter.OnRep_UnderWater(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF2C0>
	void OnRep_SteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_SteadyAim(Final|Native|Private) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF2A0>
	void OnRep_NeedFindPersonalSupplyBoxLocation(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_NeedFindPersonalSupplyBoxLocation(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF200>
	void OnRep_Health(float& LastHealth); // Function BravoHotelGame.BravoHotelCharacter.OnRep_Health(Final|Native|Private|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF140>
	void OnRep_FPSK_TargetMagnificationFactor(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_FPSK_TargetMagnificationFactor(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF100>
	void OnRep_CurrentPerkInfos(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_CurrentPerkInfos(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF0E0>
	void OnRep_CurrentPerkDeck(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_CurrentPerkDeck(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF0A0>
	void OnRep_BoostPercent(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_BoostPercent(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF060>
	void OnRep_bInSmoke(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_bInSmoke(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF350>
	void OnRep_BandageTargetHealth(); // Function BravoHotelGame.BravoHotelCharacter.OnRep_BandageTargetHealth(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEF040>
	void OnPinOffMontageEnded(struct UAnimMontage Montage, char bInterrupted); // Function BravoHotelGame.BravoHotelCharacter.OnPinOffMontageEnded(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE470>
	void OnParachuteSkinDataLoaded(struct TSoftObjectPtr<UMaterialInterface> TargetParachuteSkin); // Function BravoHotelGame.BravoHotelCharacter.OnParachuteSkinDataLoaded(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEEF20>
	void OnOverlapEnd(struct UPrimitiveComponent OverlappedComponent, struct UActor OtherActor, struct UPrimitiveComponent OtherComp, int32_t OtherBodyIndex); // Function BravoHotelGame.BravoHotelCharacter.OnOverlapEnd(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEEDE0>
	void OnOverlapBegin(struct UPrimitiveComponent OverlappedComponent, struct UActor OtherActor, struct UPrimitiveComponent OtherComp, int32_t OtherBodyIndex, char bFromSweep, struct FHitResult& SweepResult); // Function BravoHotelGame.BravoHotelCharacter.OnOverlapBegin(Final|Native|Protected|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEEBD0>
	void OnOutSmoke__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnOutSmoke__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnOriginRebasing(struct UWorld World, struct FIntVector PreviosWorldOriginLocation, struct FIntVector OriginLocation); // Function BravoHotelGame.BravoHotelCharacter.OnOriginRebasing(Native|Public|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEEAA0>
	void OnMovementUpdated(float DeltaSeconds, struct FVector OldLocation, struct FVector OldVelocity); // Function BravoHotelGame.BravoHotelCharacter.OnMovementUpdated(Final|Native|Protected|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE980>
	void OnMovementInputPressed__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnMovementInputPressed__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnInstigatorHitCharacter(struct UClass* DamageTypeClass); // Function BravoHotelGame.BravoHotelCharacter.OnInstigatorHitCharacter(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE900>
	void OnInSmoke__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnInSmoke__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnInputStopFreeLook(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStopFreeLook(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE8E0>
	void OnInputStopFire(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStopFire(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE8C0>
	void OnInputStopBoostItemMenu(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStopBoostItemMenu(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE8A0>
	void OnInputStartSprinting(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStartSprinting(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE880>
	void OnInputStartMovement(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStartMovement(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1531970>
	void OnInputStartFreeLook(); // Function BravoHotelGame.BravoHotelCharacter.OnInputStartFreeLook(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE860>
	void OnInputSmartPingMenuWorldMap(); // Function BravoHotelGame.BravoHotelCharacter.OnInputSmartPingMenuWorldMap(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE840>
	void OnInputSmartPingMenu2WorldMap(); // Function BravoHotelGame.BravoHotelCharacter.OnInputSmartPingMenu2WorldMap(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE800>
	void OnInputSmartPingMenu(); // Function BravoHotelGame.BravoHotelCharacter.OnInputSmartPingMenu(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE820>
	void OnInputReleaseCrouch(); // Function BravoHotelGame.BravoHotelCharacter.OnInputReleaseCrouch(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE7E0>
	void OnInputFPSOnly(); // Function BravoHotelGame.BravoHotelCharacter.OnInputFPSOnly(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE7C0>
	void OnInputEndSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.OnInputEndSteadyAim(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE7A0>
	void OnInitializedFSM(struct UStateMachineComponent Context); // Function BravoHotelGame.BravoHotelCharacter.OnInitializedFSM(Native|Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE710>
	void OnHitMeteorStrike(struct UPrimitiveComponent HitComponent, struct UActor OtherActor, struct UPrimitiveComponent OtherComp, struct FVector NormalImpulse, struct FHitResult& Hit); // Function BravoHotelGame.BravoHotelCharacter.OnHitMeteorStrike(Final|Native|Public|HasOutParms|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE540>
	void OnGrenadeCookMontageEnded(struct UAnimMontage Montage, char bInterrupted); // Function BravoHotelGame.BravoHotelCharacter.OnGrenadeCookMontageEnded(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE470>
	void OnFinishRocketJump(); // Function BravoHotelGame.BravoHotelCharacter.OnFinishRocketJump(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE450>
	void OnFinishMeteorJump(); // Function BravoHotelGame.BravoHotelCharacter.OnFinishMeteorJump(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE430>
	void OnFinishAirWalk(); // Function BravoHotelGame.BravoHotelCharacter.OnFinishAirWalk(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE410>
	void OnExitStartReady(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitStartReady(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE030>
	void OnExitPassenger(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitPassenger(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE350>
	void OnExitParachuting(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitParachuting(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE2D0>
	void OnExitLadder(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitLadder(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE250>
	void OnExitKnockout(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitKnockout(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE1D0>
	void OnExitInAircraftCinematic(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitInAircraftCinematic(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE150>
	void OnExitInAircraft(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitInAircraft(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE0D0>
	void OnExitHipShot(); // Function BravoHotelGame.BravoHotelCharacter.OnExitHipShot(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1531970>
	void OnExitHeartBeatSensor(); // Function BravoHotelGame.BravoHotelCharacter.OnExitHeartBeatSensor(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE0B0>
	void OnExitForceFieldDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnExitForceFieldDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnExitFallingState__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnExitFallingState__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnExitEndReady(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitEndReady(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE030>
	void OnExitedVehicle(); // Function BravoHotelGame.BravoHotelCharacter.OnExitedVehicle(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE3F0>
	void OnExitedElevator(); // Function BravoHotelGame.BravoHotelCharacter.OnExitedElevator(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEE3D0>
	void OnExitDriverPossessedPawn(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitDriverPossessedPawn(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEDFB0>
	void OnExitDriver(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitDriver(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEDF30>
	void OnExitDescent(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitDescent(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEDEB0>
	void OnExitDeath(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitDeath(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEDE30>
	void OnExitCriticalTime(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitCriticalTime(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEDDB0>
	void OnExitBattle(char NextStateID); // Function BravoHotelGame.BravoHotelCharacter.OnExitBattle(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEDD30>
	void OnExitAOS(); // Function BravoHotelGame.BravoHotelCharacter.OnExitAOS(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEDD10>
	void OnExitAMP(); // Function BravoHotelGame.BravoHotelCharacter.OnExitAMP(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEDCF0>
	void OnExitADS(char bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnExitADS(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEDC60>
	void OnEnterHipShot(char bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnEnterHipShot(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEDB30>
	void OnEnterHeartBeatSensor(char bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnEnterHeartBeatSensor(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEDAA0>
	void OnEnteredVehicle__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnEnteredVehicle__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnEnteredVehicle(); // Function BravoHotelGame.BravoHotelCharacter.OnEnteredVehicle(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEDC40>
	void OnEnteredElevator(struct ABravoHotelMoveElevator OutElevatorRef); // Function BravoHotelGame.BravoHotelCharacter.OnEnteredElevator(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEDBC0>
	void OnEnterAOS(char bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnEnterAOS(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEDA10>
	void OnEnterAMP(char bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnEnterAMP(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED980>
	void OnEnterADS(char bImmediately); // Function BravoHotelGame.BravoHotelCharacter.OnEnterADS(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED8F0>
	void OnEndSearchInstinct__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnEndSearchInstinct__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnEndCineAircraft(); // Function BravoHotelGame.BravoHotelCharacter.OnEndCineAircraft(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED8D0>
	void OnDeath(); // Function BravoHotelGame.BravoHotelCharacter.OnDeath(Native|Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED8B0>
	void OnDamaged(struct UClass* DamageTypeClass, float DamageAmount); // Function BravoHotelGame.BravoHotelCharacter.OnDamaged(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED7E0>
	void OnConditionStarted(enum class ECharacterConditionType NewCondition); // Function BravoHotelGame.BravoHotelCharacter.OnConditionStarted(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED760>
	void OnConditionEnded(enum class ECharacterConditionType NewCondition); // Function BravoHotelGame.BravoHotelCharacter.OnConditionEnded(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED6E0>
	void OnCompleteActiveSkillDelegate__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnCompleteActiveSkillDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnCheckSupplyCost__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnCheckSupplyCost__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnCharacterGroundStateChange__DelegateSignature(enum class ECharacterGroundState State); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnCharacterGroundStateChange__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnChangeWeaponAttachments(); // Function BravoHotelGame.BravoHotelCharacter.OnChangeWeaponAttachments(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED600>
	void OnChangeTeleportState(char IsStart); // Function BravoHotelGame.BravoHotelCharacter.OnChangeTeleportState(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED570>
	void OnChangeProjectilePredictPath__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangeProjectilePredictPath__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnChangeFireType__DelegateSignature(enum class EFireType PreFireType, enum class EFireType NewFireType); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangeFireType__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnChangeEquipWeaponStateIntheWater(char bState); // Function BravoHotelGame.BravoHotelCharacter.OnChangeEquipWeaponStateIntheWater(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED4E0>
	void OnChangeDetectedItems__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangeDetectedItems__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnChangedDediSettings(enum class ESettingType SettingType, float Value); // Function BravoHotelGame.BravoHotelCharacter.OnChangedDediSettings(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED620>
	void OnChangeCurrentWeapon(); // Function BravoHotelGame.BravoHotelCharacter.OnChangeCurrentWeapon(Final|Native|Private) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED4C0>
	void OnChangeCharacterState__DelegateSignature(enum class ECharacterState& StateType); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnChangeCharacterState__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnCameraViewModeChanged__DelegateSignature(char bIsThirdPerson); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnCameraViewModeChanged__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnBoxChanged(); // Function BravoHotelGame.BravoHotelCharacter.OnBoxChanged(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE0140>
	void OnBlueZoneFollowingChanged(struct UActor Checker, char bIsFollowing); // Function BravoHotelGame.BravoHotelCharacter.OnBlueZoneFollowingChanged(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED3F0>
	void OnBeginStartReady(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginStartReady(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED3D0>
	void OnBeginPassenger(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginPassenger(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED3B0>
	void OnBeginParachuting(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginParachuting(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED390>
	void OnBeginLadder(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginLadder(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED370>
	void OnBeginKnockout(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginKnockout(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED350>
	void OnBeginInAircraftCinematic(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginInAircraftCinematic(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED330>
	void OnBeginInAircraft(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginInAircraft(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED310>
	void OnBeginEndReady(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginEndReady(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED2F0>
	void OnBeginDriverPossessedPawn(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginDriverPossessedPawn(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED2D0>
	void OnBeginDriver(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginDriver(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED2B0>
	void OnBeginDescent(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginDescent(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED290>
	void OnBeginDeath(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginDeath(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED270>
	void OnBeginCriticalTime(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginCriticalTime(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED250>
	void OnBeginBattle(); // Function BravoHotelGame.BravoHotelCharacter.OnBeginBattle(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED230>
	void OnBattleRoyalStateChanged(enum class EBattleRoyaleState PrevState, enum class EBattleRoyaleState CurrentState); // Function BravoHotelGame.BravoHotelCharacter.OnBattleRoyalStateChanged(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED170>
	void OnAttackOtherCharacterWithRangedWeapon__DelegateSignature(); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnAttackOtherCharacterWithRangedWeapon__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void OnAnyUpdateState(struct UStateMachineComponent Context, struct FName WithStateName, char WithStateID, float WithStateTime); // Function BravoHotelGame.BravoHotelCharacter.OnAnyUpdateState(Native|Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EED030>
	void OnAnyExitState(struct UStateMachineComponent Context, struct FName WithStateName, char WithStateID); // Function BravoHotelGame.BravoHotelCharacter.OnAnyExitState(Native|Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EECF30>
	void OnAnyBeginState(struct UStateMachineComponent Context, struct FName WithStateName, char WithStateID, char WithPrevious); // Function BravoHotelGame.BravoHotelCharacter.OnAnyBeginState(Native|Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EECDF0>
	void OnAnimInitialized(); // Function BravoHotelGame.BravoHotelCharacter.OnAnimInitialized(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EECDD0>
	void OnAirCraftDelegate__DelegateSignature(char State); // DelegateFunction BravoHotelGame.BravoHotelCharacter.OnAirCraftDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void NextParkourTestComponent(); // Function BravoHotelGame.BravoHotelCharacter.NextParkourTestComponent(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1531970>
	void NeedCheckCurrentBuff(); // Function BravoHotelGame.BravoHotelCharacter.NeedCheckCurrentBuff(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EECDB0>
	void MultiEndAppearingVehicle(struct ABravoHotelVehicle TargetVehicle, struct UClass* TargetClass, struct FTransform TargetTransform); // Function BravoHotelGame.BravoHotelCharacter.MultiEndAppearingVehicle(Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEB820>
	void MultiDisappearingVehicle(struct ABravoHotelVehicle TargetVehicle); // Function BravoHotelGame.BravoHotelCharacter.MultiDisappearingVehicle(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEB790>
	void MulticastWindowBreaching(); // Function BravoHotelGame.BravoHotelCharacter.MulticastWindowBreaching(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EECD90>
	void MulticastUpdateRagdollVariables(struct FVector NewRagdollVelocity, struct FVector NewRagdollLocation, struct FVector NewActorLocation); // Function BravoHotelGame.BravoHotelCharacter.MulticastUpdateRagdollVariables(Net|Native|Event|NetMulticast|Protected|HasDefaults|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EECC00>
	void MulticastTakePointDamage(struct FRepPointDamageInfo DamageInfo); // Function BravoHotelGame.BravoHotelCharacter.MulticastTakePointDamage(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EECB30>
	void MulticastStopMontage(struct UAnimMontage AnimMontage, float BlendTime); // Function BravoHotelGame.BravoHotelCharacter.MulticastStopMontage(Net|NetReliableNative|Event|NetMulticast|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EECA60>
	void MulticastSimulatedTakeDamage(struct FRepSimulatedTakeDamageInfo RepSimulatedInfo); // Function BravoHotelGame.BravoHotelCharacter.MulticastSimulatedTakeDamage(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEC9B0>
	void MulticastSimulatedHittedDamage(struct FRepSimulatedHittedDamage RepSimulatedInfo); // Function BravoHotelGame.BravoHotelCharacter.MulticastSimulatedHittedDamage(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEC910>
	void MulticastSetInteractiveShpere(char bActive); // Function BravoHotelGame.BravoHotelCharacter.MulticastSetInteractiveShpere(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEC880>
	void MulticastRewindMontage(struct UAnimMontage AnimMontage); // Function BravoHotelGame.BravoHotelCharacter.MulticastRewindMontage(Net|NetReliableNative|Event|NetMulticast|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEC7F0>
	void MulticastRemoveAttachedUsableItem(); // Function BravoHotelGame.BravoHotelCharacter.MulticastRemoveAttachedUsableItem(Net|NetReliableNative|Event|NetMulticast|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEC7D0>
	void MulticastPlayMontage(char bPlayOnLocalClient, struct UAnimMontage AnimMontageTPP, struct UAnimMontage AnimMontageFPP); // Function BravoHotelGame.BravoHotelCharacter.MulticastPlayMontage(Net|NetReliableNative|Event|NetMulticast|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEC6C0>
	void MulticastPlayCharacterSound(enum class ECharacterAudioEventType AudioEventType, char TypeIndex); // Function BravoHotelGame.BravoHotelCharacter.MulticastPlayCharacterSound(Net|Native|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEC600>
	void MulticastObjectDestruction(struct ADestructibleActor DestructibleActor, struct UDestructibleComponent DestructibleComponent, struct FVector Location, float Damage, float EffectRange); // Function BravoHotelGame.BravoHotelCharacter.MulticastObjectDestruction(Net|Native|Event|NetMulticast|Public|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEC470>
	void MulticastInAircraft(struct UActor AircraftFlight, float AttachYaw); // Function BravoHotelGame.BravoHotelCharacter.MulticastInAircraft(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEC3A0>
	void MulticastHandleDamageToVehicleDestructibleComponent(struct UBravoHotelDestructibleComponent DestructibleComponent, struct FHitResult HitDetails, struct FVector ImpactVelocity); // Function BravoHotelGame.BravoHotelCharacter.MulticastHandleDamageToVehicleDestructibleComponent(Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEC1F0>
	void MulticastExceptOwnerStopAnimMontage(struct UAnimMontage MontageToStopTPP, struct UAnimMontage MontageToStopFPP); // Function BravoHotelGame.BravoHotelCharacter.MulticastExceptOwnerStopAnimMontage(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEC120>
	void MulticastEndCombine(char bSuccess, struct FName TargetRecipe); // Function BravoHotelGame.BravoHotelCharacter.MulticastEndCombine(Net|NetReliableNative|Event|NetMulticast|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEC050>
	void MulticastEndCastingBackpackItem(char bSuccess, struct FName ItemKey); // Function BravoHotelGame.BravoHotelCharacter.MulticastEndCastingBackpackItem(Net|NetReliableNative|Event|NetMulticast|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEBF80>
	void MulticastDoorObjectDestruction(struct UActor DoorActor, struct FRadialDamageEvent DamageEvent, struct AController EventInstigator, struct UActor DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.MulticastDoorObjectDestruction(Net|Native|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEBE00>
	void MulticastDoorBreaching(struct FVector_NetQuantize BreachingParticleLocation, struct FVector_NetQuantize BreachingParticleRotation); // Function BravoHotelGame.BravoHotelCharacter.MulticastDoorBreaching(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEBD20>
	void MulticastBravoHotelHIDestructionObejct(struct UBravoHotelHIDestructibleComponent BravoHotelDestructibleComponent, float Damage, struct FRadialDamageEvent DamageEvent, struct AController EventInstigator, struct UActor DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.MulticastBravoHotelHIDestructionObejct(Net|NetReliableNative|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEBB60>
	void MulticastBravoHotelDestructionObejct(struct UBravoHotelDestructibleComponent BravoHotelDestructibleComponent, float Damage, struct FRadialDamageEvent DamageEvent, struct AController EventInstigator, struct UActor DamageCauser); // Function BravoHotelGame.BravoHotelCharacter.MulticastBravoHotelDestructionObejct(Net|Native|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEB9A0>
	void MultiAppearingVehicle(struct ABravoHotelVehicle TargetVehicle, struct UClass* TargetClass, struct FTransform TargetTransform); // Function BravoHotelGame.BravoHotelCharacter.MultiAppearingVehicle(Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEB610>
	void MuiticastSetUpdateRenderSettings(char bValue); // Function BravoHotelGame.BravoHotelCharacter.MuiticastSetUpdateRenderSettings(Net|Native|Event|NetMulticast|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEB580>
	void MoveRightOnDescent(float DeltaTime, float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.MoveRightOnDescent(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEB4C0>
	void MoveRight(float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.MoveRight(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEB440>
	void MoveForwardOnDescent(float DeltaTime, float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.MoveForwardOnDescent(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEB380>
	void MoveForward(float AxisValue); // Function BravoHotelGame.BravoHotelCharacter.MoveForward(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEB300>
	void MarkBrokenEquipmentNeedToSpawn(int32_t Equipmentlevel, struct FVector& DamageImpulseDir, enum class EWearableItemType& EquipmentType); // Function BravoHotelGame.BravoHotelCharacter.MarkBrokenEquipmentNeedToSpawn(Final|Native|Public|HasOutParms|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEB1E0>
	void ManageRotation(); // Function BravoHotelGame.BravoHotelCharacter.ManageRotation(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEB1C0>
	void ManageMovementMode(); // Function BravoHotelGame.BravoHotelCharacter.ManageMovementMode(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEB1A0>
	void ManageDebuffState(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.ManageDebuffState(Final|Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEB120>
	void LockMovementInput(); // Function BravoHotelGame.BravoHotelCharacter.LockMovementInput(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEB100>
	void LoadMouseSensitivty(); // Function BravoHotelGame.BravoHotelCharacter.LoadMouseSensitivty(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEB0E0>
	void KillPerkLevelUpTimer(float DelayTime, int32_t UpCount, int32_t KillCount); // Function BravoHotelGame.BravoHotelCharacter.KillPerkLevelUpTimer(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEAFD0>
	void KillPerkLevelUpReady(int32_t KillCount); // Function BravoHotelGame.BravoHotelCharacter.KillPerkLevelUpReady(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEAF50>
	void KillPerkLevelUp(int32_t UpCount, int32_t KillCount); // Function BravoHotelGame.BravoHotelCharacter.KillPerkLevelUp(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEAE90>
	void KillGivePerkEvent(int32_t KillCount); // Function BravoHotelGame.BravoHotelCharacter.KillGivePerkEvent(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void K2_UpdateMutable_PreviewPawn(char bChangeGender); // Function BravoHotelGame.BravoHotelCharacter.K2_UpdateMutable_PreviewPawn(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void K2_OnStartProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function BravoHotelGame.BravoHotelCharacter.K2_OnStartProne(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void K2_OnGoParachute(); // Function BravoHotelGame.BravoHotelCharacter.K2_OnGoParachute(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void K2_OnEndProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function BravoHotelGame.BravoHotelCharacter.K2_OnEndProne(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void K2_OnCameraViewModeChanged(char bIsThirdPerson); // Function BravoHotelGame.BravoHotelCharacter.K2_OnCameraViewModeChanged(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void K2_OnAddControllerYawInput(float Val); // Function BravoHotelGame.BravoHotelCharacter.K2_OnAddControllerYawInput(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	struct FPerkLevelUpData K2_GetPerkLevelUpData(); // Function BravoHotelGame.BravoHotelCharacter.K2_GetPerkLevelUpData(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEAE20>
	struct FPerkDeckData K2_GetPerkDeckData(); // Function BravoHotelGame.BravoHotelCharacter.K2_GetPerkDeckData(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEADB0>
	struct FPerkLevelUpElement K2_GetPerkClassLevelUpElement(int32_t Level); // Function BravoHotelGame.BravoHotelCharacter.K2_GetPerkClassLevelUpElement(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEABE0>
	void K2_FPSK_OnStartADS(); // Function BravoHotelGame.BravoHotelCharacter.K2_FPSK_OnStartADS(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void K2_FPSK_OnEndADS(); // Function BravoHotelGame.BravoHotelCharacter.K2_FPSK_OnEndADS(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void K2_EnterSceneOfWin(); // Function BravoHotelGame.BravoHotelCharacter.K2_EnterSceneOfWin(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void K2_Cheat_ToggleCharacterDebugCamera(); // Function BravoHotelGame.BravoHotelCharacter.K2_Cheat_ToggleCharacterDebugCamera(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	char IsWantsToJetpackAim(); // Function BravoHotelGame.BravoHotelCharacter.IsWantsToJetpackAim(Final|Native|Public|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEABB0>
	char IsWantsToJetpack(); // Function BravoHotelGame.BravoHotelCharacter.IsWantsToJetpack(Final|Native|Public|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEAB80>
	char IsViewPointInWaterVolume(); // Function BravoHotelGame.BravoHotelCharacter.IsViewPointInWaterVolume(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEAB50>
	char IsVehicleState(enum class ECharacterState State); // Function BravoHotelGame.BravoHotelCharacter.IsVehicleState(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEAAC0>
	char IsVehiclePassenger(); // Function BravoHotelGame.BravoHotelCharacter.IsVehiclePassenger(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEAA90>
	char IsVehicleDriver(); // Function BravoHotelGame.BravoHotelCharacter.IsVehicleDriver(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEAA60>
	char IsThirdPerson(); // Function BravoHotelGame.BravoHotelCharacter.IsThirdPerson(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEAA30>
	char IsSwimming(); // Function BravoHotelGame.BravoHotelCharacter.IsSwimming(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEAA00>
	char IsSteadyAim(); // Function BravoHotelGame.BravoHotelCharacter.IsSteadyAim(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA9D0>
	char IsSprinting(); // Function BravoHotelGame.BravoHotelCharacter.IsSprinting(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA9A0>
	char IsShowingLandingPosition(); // Function BravoHotelGame.BravoHotelCharacter.IsShowingLandingPosition(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA970>
	char IsReviving(); // Function BravoHotelGame.BravoHotelCharacter.IsReviving(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA8F0>
	char IsResuscitating(); // Function BravoHotelGame.BravoHotelCharacter.IsResuscitating(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA870>
	char IsRecommendedPerkDeck(struct FName& PerkName); // Function BravoHotelGame.BravoHotelCharacter.IsRecommendedPerkDeck(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA7D0>
	char IsReadyToSnipe(); // Function BravoHotelGame.BravoHotelCharacter.IsReadyToSnipe(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA7B0>
	char IsProneStateTransitioning(); // Function BravoHotelGame.BravoHotelCharacter.IsProneStateTransitioning(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA780>
	char IsProne(); // Function BravoHotelGame.BravoHotelCharacter.IsProne(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA750>
	char IsPlayingPickupAnim(); // Function BravoHotelGame.BravoHotelCharacter.IsPlayingPickupAnim(Final|Native|Public|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA720>
	char IsPlayingEquipAnim(); // Function BravoHotelGame.BravoHotelCharacter.IsPlayingEquipAnim(Final|Native|Public|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA6F0>
	char IsPlayingCastingAnim(); // Function BravoHotelGame.BravoHotelCharacter.IsPlayingCastingAnim(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA6C0>
	char IsPlayerReplayViewMode(); // Function BravoHotelGame.BravoHotelCharacter.IsPlayerReplayViewMode(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA690>
	char IsPendingKickDoor(); // Function BravoHotelGame.BravoHotelCharacter.IsPendingKickDoor(Final|Native|Public|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA660>
	char IsOverlapWaterVolume(); // Function BravoHotelGame.BravoHotelCharacter.IsOverlapWaterVolume(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA630>
	char IsOnLadder(); // Function BravoHotelGame.BravoHotelCharacter.IsOnLadder(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA600>
	char IsOnIceLand(); // Function BravoHotelGame.BravoHotelCharacter.IsOnIceLand(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA5D0>
	char IsOnDescent(); // Function BravoHotelGame.BravoHotelCharacter.IsOnDescent(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA5A0>
	char IsMaxLevel(); // Function BravoHotelGame.BravoHotelCharacter.IsMaxLevel(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA570>
	char IsMale(); // Function BravoHotelGame.BravoHotelCharacter.IsMale(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA540>
	char IsLockedInventory(); // Function BravoHotelGame.BravoHotelCharacter.IsLockedInventory(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA510>
	char IsLocalPlayerControlledPawn(); // Function BravoHotelGame.BravoHotelCharacter.IsLocalPlayerControlledPawn(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA450>
	char IsLocallyPlaying(char bIncludeSpectedPawn); // Function BravoHotelGame.BravoHotelCharacter.IsLocallyPlaying(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA480>
	char IsLandStop(); // Function BravoHotelGame.BravoHotelCharacter.IsLandStop(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA420>
	char IsKicking(); // Function BravoHotelGame.BravoHotelCharacter.IsKicking(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA3F0>
	char IsJumping(); // Function BravoHotelGame.BravoHotelCharacter.IsJumping(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA3C0>
	char IsJumpAttacking(); // Function BravoHotelGame.BravoHotelCharacter.IsJumpAttacking(Final|Native|Public|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA390>
	char IsInVehicle(); // Function BravoHotelGame.BravoHotelCharacter.IsInVehicle(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA360>
	char IsInstancedFoliageActor(struct UActor TargetActor); // Function BravoHotelGame.BravoHotelCharacter.IsInstancedFoliageActor(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	char IsInSkydiving(); // Function BravoHotelGame.BravoHotelCharacter.IsInSkydiving(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA330>
	char IsInParachute(); // Function BravoHotelGame.BravoHotelCharacter.IsInParachute(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA300>
	char IsInForceField(); // Function BravoHotelGame.BravoHotelCharacter.IsInForceField(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA2D0>
	char IsInDoor(); // Function BravoHotelGame.BravoHotelCharacter.IsInDoor(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA2A0>
	char IsInAircraft(); // Function BravoHotelGame.BravoHotelCharacter.IsInAircraft(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA270>
	char IsHipShot(); // Function BravoHotelGame.BravoHotelCharacter.IsHipShot(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA240>
	char IsFoundVehicleSearch(); // Function BravoHotelGame.BravoHotelCharacter.IsFoundVehicleSearch(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA210>
	char IsFoundSearchInstinct(); // Function BravoHotelGame.BravoHotelCharacter.IsFoundSearchInstinct(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA1E0>
	char IsFollowReplayViewMode(); // Function BravoHotelGame.BravoHotelCharacter.IsFollowReplayViewMode(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA1B0>
	char IsFirstPerson(); // Function BravoHotelGame.BravoHotelCharacter.IsFirstPerson(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA180>
	char IsFiring(); // Function BravoHotelGame.BravoHotelCharacter.IsFiring(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA150>
	char IsEnoughtSupplyGold(); // Function BravoHotelGame.BravoHotelCharacter.IsEnoughtSupplyGold(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA120>
	char IsEnemyFor(struct ABravoHotelPlayerController OtherPlayerController); // Function BravoHotelGame.BravoHotelCharacter.IsEnemyFor(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA090>
	char IsEnemyCharacter(struct ABravoHotelCharacter OtherCharacter); // Function BravoHotelGame.BravoHotelCharacter.IsEnemyCharacter(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EEA000>
	char IsEnableSpawnSupplyBox(struct UActor TargetActor, struct FString& OutResult); // Function BravoHotelGame.BravoHotelCharacter.IsEnableSpawnSupplyBox(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	char IsDisconnected(); // Function BravoHotelGame.BravoHotelCharacter.IsDisconnected(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9FD0>
	char IsCustomBuoyancySwimMode(); // Function BravoHotelGame.BravoHotelCharacter.IsCustomBuoyancySwimMode(Final|Native|Public|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9FA0>
	char IsCurrentThrowingWeapon(); // Function BravoHotelGame.BravoHotelCharacter.IsCurrentThrowingWeapon(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9F70>
	char IsControllerTargetPawn(); // Function BravoHotelGame.BravoHotelCharacter.IsControllerTargetPawn(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9F40>
	char IsCondition(enum class ECharacterConditionType ConditionType); // Function BravoHotelGame.BravoHotelCharacter.IsCondition(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9EB0>
	char IsClimbing(); // Function BravoHotelGame.BravoHotelCharacter.IsClimbing(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9E80>
	char IsChargingGauge(); // Function BravoHotelGame.BravoHotelCharacter.IsChargingGauge(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9E50>
	char IsCharacterPositionUnderWaterSurface(); // Function BravoHotelGame.BravoHotelCharacter.IsCharacterPositionUnderWaterSurface(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9E20>
	char IsChangingWeapon(); // Function BravoHotelGame.BravoHotelCharacter.IsChangingWeapon(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9DF0>
	char IsCastingBackpackItem(); // Function BravoHotelGame.BravoHotelCharacter.IsCastingBackpackItem(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9DC0>
	char IsBuff(enum class ECharacterBuffType BuffType); // Function BravoHotelGame.BravoHotelCharacter.IsBuff(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9D30>
	char IsBeginner(); // Function BravoHotelGame.BravoHotelCharacter.IsBeginner(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9D00>
	char IsAppearanceReplicated(); // Function BravoHotelGame.BravoHotelCharacter.IsAppearanceReplicated(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9CD0>
	char IsAOS(); // Function BravoHotelGame.BravoHotelCharacter.IsAOS(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9A80>
	char IsAlive(); // Function BravoHotelGame.BravoHotelCharacter.IsAlive(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9CA0>
	char IsAirWalking(); // Function BravoHotelGame.BravoHotelCharacter.IsAirWalking(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9C70>
	char IsADS(); // Function BravoHotelGame.BravoHotelCharacter.IsADS(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9A50>
	char IsActiveLeanDamageBuff(); // Function BravoHotelGame.BravoHotelCharacter.IsActiveLeanDamageBuff(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9C40>
	char IsActiveHeartBeatSensor(); // Function BravoHotelGame.BravoHotelCharacter.IsActiveHeartBeatSensor(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9C10>
	char IsActiveCastingUIWithType(enum class ECastingUIType& InCastingUIType); // Function BravoHotelGame.BravoHotelCharacter.IsActiveCastingUIWithType(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9B70>
	char IsActiveCastingUI(); // Function BravoHotelGame.BravoHotelCharacter.IsActiveCastingUI(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9B40>
	char IsActiveAmplifier(); // Function BravoHotelGame.BravoHotelCharacter.IsActiveAmplifier(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9B10>
	char IsActionWithWeapon(); // Function BravoHotelGame.BravoHotelCharacter.IsActionWithWeapon(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9AE0>
	char IsABot(); // Function BravoHotelGame.BravoHotelCharacter.IsABot(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9A20>
	char IsAbleUltimate(); // Function BravoHotelGame.BravoHotelCharacter.IsAbleUltimate(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9AB0>
	void InternalSimulatedTakeDamage(struct FRepSimulatedTakeDamageInfo& RepSimulatedInfo); // Function BravoHotelGame.BravoHotelCharacter.InternalSimulatedTakeDamage(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9960>
	void InternalSimulatedHittedDamage(struct FRepHitDamageInfo& RepDamageInfo); // Function BravoHotelGame.BravoHotelCharacter.InternalSimulatedHittedDamage(Final|Native|Private|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE98A0>
	void InternalJetpackBooster(char bNewJackpack); // Function BravoHotelGame.BravoHotelCharacter.InternalJetpackBooster(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9810>
	void InternalJetpackAim(char bNewJetpackAim); // Function BravoHotelGame.BravoHotelCharacter.InternalJetpackAim(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9780>
	void InternalInAircraft(struct UActor AircraftFlight, float AttachYaw, char bCheckCinematic); // Function BravoHotelGame.BravoHotelCharacter.InternalInAircraft(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9670>
	void InitTimeline(); // Function BravoHotelGame.BravoHotelCharacter.InitTimeline(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9630>
	void InitRecordingCharacter(); // Function BravoHotelGame.BravoHotelCharacter.InitRecordingCharacter(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void InitializeStateAtCriticalTime(); // Function BravoHotelGame.BravoHotelCharacter.InitializeStateAtCriticalTime(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9650>
	void InitCustomizableObjectInstance(); // Function BravoHotelGame.BravoHotelCharacter.InitCustomizableObjectInstance(Native|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9610>
	void HideSkillMap(); // Function BravoHotelGame.BravoHotelCharacter.HideSkillMap(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE95F0>
	void HideInteractive(); // Function BravoHotelGame.BravoHotelCharacter.HideInteractive(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE95D0>
	void HideHUDbySequence(); // Function BravoHotelGame.BravoHotelCharacter.HideHUDbySequence(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE95B0>
	void HealthTick(float DeltaTime); // Function BravoHotelGame.BravoHotelCharacter.HealthTick(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE9530>
	char HasWeaponOfType(enum class EWeaponType WeaponType); // Function BravoHotelGame.BravoHotelCharacter.HasWeaponOfType(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE94A0>
	void HandleDamageToVehicleDestructibleComponent(struct UBravoHotelDestructibleComponent DestructibleComponent, struct FHitResult HitDetails, struct FVector ImpactVelocity); // Function BravoHotelGame.BravoHotelCharacter.HandleDamageToVehicleDestructibleComponent(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE92F0>
	void GoParachute(); // Function BravoHotelGame.BravoHotelCharacter.GoParachute(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE92D0>
	void GoIncapacitated(char bCriticalTime, struct FDamageInstigatorInfo& DamageInstigatorInfo); // Function BravoHotelGame.BravoHotelCharacter.GoIncapacitated(Final|Native|Public|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EE91B0>
