// BravoHotelReplayPlayerListInter BravoHotelGame.BravoHotelReplayPlayerListInter
 struct UBravoHotelReplayPlayerListInter : UInterface {
	Unknown UberGraphFrame; // 0x248(0x08)
	Unknown BlockMouse; // 0x250(0x08)
	Unknown Button_Accept; // 0x258(0x08)
	Unknown Button_Cancel; // 0x260(0x08)
	Unknown Button_Close; // 0x268(0x08)
	Unknown Button_Max; // 0x270(0x08)
	Unknown Button_Min; // 0x278(0x08)
	Unknown Image_9; // 0x280(0x08)
	Unknown Slider_137; // 0x288(0x08)
	Unknown TextBlock_Accept; // 0x290(0x08)
	Unknown TextBlock_MaxCount; // 0x298(0x08)
	Unknown TextBlock_MinCount; // 0x2a0(0x08)
	Unknown TextBlock_Title; // 0x2a8(0x08)
	Unknown TextBox_DropCount; // 0x2b0(0x08)
	int32_t CurrentCount; // 0x2b8(0x04)
	int32_t MaxCount; // 0x2bc(0x04)
	struct FText LastEnteredText; // 0x2c0(0x18)
	Unknown ItemInfo; // 0x2d8(0x98)
	Unknown ItemDetailInfo; // 0x370(0x490)
	Unknown PickupRef; // 0x800(0x08)
	Unknown DropBoxRef; // 0x808(0x08)
	Unknown InventoryWidget; // 0x810(0x08)
	Unknown bClosing; // 0x818(0x01)
	Unknown MaterialSlot; // 0x820(0x08)
	Unknown DefaultSceneRoot; // 0x638(0x08)
	Unknown MassMode; // 0x28(0x01)
	float UniformMass; // 0x2c(0x04)
	float TotalMass; // 0x30(0x04)
	float Density; // 0x34(0x04)
	float MinPerParticleMass; // 0x38(0x04)
	float EdgeStiffness; // 0x3c(0x04)
	float BendingStiffness; // 0x40(0x04)
	float AreaStiffness; // 0x44(0x04)
	float VolumeStiffness; // 0x48(0x04)
	float StrainLimitingStiffness; // 0x4c(0x04)
	float LimitScale; // 0x50(0x04)
	Unknown bUseGeodesicDistance; // 0x54(0x01)
	float ShapeTargetStiffness; // 0x58(0x04)
	float CollisionThickness; // 0x5c(0x04)
	float FrictionCoefficient; // 0x60(0x04)
	float DampingCoefficient; // 0x64(0x04)
	float DragCoefficient; // 0x68(0x04)
	float AnimDriveSpringStiffness; // 0x6c(0x04)
	Unknown bUseBendingElements; // 0x70(0x01)
	Unknown bUseTetrahedralConstraints; // 0x71(0x01)
	Unknown bUseThinShellVolumeConstraints; // 0x72(0x01)
	Unknown bUseSelfCollisions; // 0x73(0x01)
	Unknown bUseContinuousCollisionDetection; // 0x74(0x01)
	Unknown LinearVelocityScale; // 0x78(0x0c)
	float AngularVelocityScale; // 0x84(0x04)
	int32_t IterationCount; // 0x28(0x04)
	int32_t SubdivisionCount; // 0x2c(0x04)
	float SelfCollisionThickness; // 0x30(0x04)
	float CollisionThickness; // 0x34(0x04)
	Unknown bUseDampingOverride; // 0x38(0x01)
	float Damping; // 0x3c(0x04)
	Unknown bUseGravityOverride; // 0x40(0x01)
	float GravityScale; // 0x44(0x04)
	Unknown Gravity; // 0x48(0x0c)
	Unknown bUseLocalSpaceSimulation; // 0x54(0x01)
	Unknown bUseXPBDConstraints; // 0x55(0x01)
	Unknown Type; // 0x28(0x01)
	Unknown ByteValue; // 0x29(0x01)
	int32_t IntegerValue; // 0x2c(0x04)
	Unknown LongBytesValue; // 0x30(0x08)
	float FloatValue; // 0x38(0x04)
	Unknown DoubleBytesValue; // 0x40(0x08)
	Unknown BooleanValue; // 0x48(0x01)
	struct FString StringUtf8Value; // 0x50(0x10)
	Unknown ByteArrayValue; // 0x60(0x10)
	Unknown IntegerArrayValue; // 0x70(0x10)
	Unknown LongBytesArrayValue; // 0x80(0x10)
	Unknown FloatArrayValue; // 0x90(0x10)
	Unknown DoubleBytesArrayValue; // 0xa0(0x10)
	Unknown BooleanArrayValue; // 0xb0(0x10)
	Unknown StringUtf8ArrayValue; // 0xc0(0x10)
	Unknown Bytes; // 0x28(0x10)
	int32_t Position; // 0x38(0x04)
	Unknown CurrentByte; // 0x3c(0x01)
	int32_t CurrentBytePosition; // 0x40(0x04)
	Unknown Bytes; // 0x28(0x10)
	Unknown CurrentByte; // 0x38(0x01)
	int32_t CurrentBytePosition; // 0x3c(0x04)
	Unknown ByteArray; // 0x28(0x10)
	Unknown Type; // 0x28(0x01)
	Unknown ByteValue; // 0x29(0x01)
	int32_t IntegerValue; // 0x2c(0x04)
	Unknown LongBytesValue; // 0x30(0x08)
	float FloatValue; // 0x38(0x04)
	Unknown DoubleBytesValue; // 0x40(0x08)
	Unknown BooleanValue; // 0x48(0x01)
	struct FString StringUtf8Value; // 0x50(0x10)
	Unknown ByteArrayValue; // 0x60(0x10)
	Unknown IntegerArrayValue; // 0x70(0x10)
	Unknown LongBytesArrayValue; // 0x80(0x10)
	Unknown FloatArrayValue; // 0x90(0x10)
	Unknown DoubleBytesArrayValue; // 0xa0(0x10)
	Unknown BooleanArrayValue; // 0xb0(0x10)
	Unknown StringUtf8ArrayValue; // 0xc0(0x10)
	Unknown Bytes; // 0x28(0x10)
	int32_t Position; // 0x38(0x04)
	Unknown Bytes; // 0x28(0x10)
	Unknown Bytes; // 0x28(0x10)
	int32_t Count; // 0x28(0x04)
	Unknown Next; // 0x2c(0x01)
	Unknown Finished; // 0x28(0x01)
	Unknown Result; // 0x29(0x01)
	int32_t KeepAliveCount; // 0x2c(0x04)
	Unknown Finished; // 0x28(0x01)
	float Result; // 0x2c(0x04)
	int32_t KeepAliveCount; // 0x30(0x04)
	Unknown Finished; // 0x28(0x01)
	int32_t Result; // 0x2c(0x04)
	int32_t KeepAliveCount; // 0x30(0x04)
	Unknown Finished; // 0x28(0x01)
	int32_t KeepAliveCount; // 0x2c(0x04)
	Unknown Finished; // 0x28(0x01)
	Unknown Result; // 0x30(0x08)
	int32_t KeepAliveCount; // 0x38(0x04)
	Unknown Finished; // 0x28(0x01)
	struct FString Result; // 0x30(0x10)
	int32_t KeepAliveCount; // 0x40(0x04)
	Unknown Bytes; // 0x28(0x10)
	Unknown Valid; // 0x28(0x01)
	struct FString Resource; // 0x30(0x10)
	Unknown Date; // 0x40(0x08)
	int32_t Bits; // 0x48(0x04)
	Unknown GeometryCollection; // 0x28(0x08)
	Unknown OriginalGeometryCollection; // 0x30(0x08)
	int32_t GeometryCollectionLODIndex; // 0x38(0x04)
	Unknown Adapters; // 0x3b8(0x10)
	int32_t TextureCoordinateCount; // 0x3d0(0x04)
	int32_t PendingCompactCounter; // 0x51c(0x04)
	int32_t SubdivisionCount; // 0x520(0x04)
	Unknown StaticMesh; // 0x28(0x08)
	Unknown OriginalStaticMesh; // 0x30(0x08)
	int32_t StaticMeshLODIndex; // 0x38(0x04)
	Unknown UberGraphFrame; // 0x248(0x08)
	Unknown CanvasPanel_1; // 0x250(0x08)
	Unknown Image; // 0x258(0x08)
	Unknown Image_2; // 0x260(0x08)
	Unknown Image_3; // 0x268(0x08)
	Unknown Image_4; // 0x270(0x08)
	Unknown Image_5; // 0x278(0x08)
	Unknown Image_6; // 0x280(0x08)
	Unknown Image_7; // 0x288(0x08)
	Unknown Image_8; // 0x290(0x08)
	Unknown Image_9; // 0x298(0x08)
	Unknown Image_10; // 0x2a0(0x08)
	Unknown Image_11; // 0x2a8(0x08)
	Unknown Image_12; // 0x2b0(0x08)
	Unknown Image_13; // 0x2b8(0x08)
	Unknown Image_14; // 0x2c0(0x08)
	Unknown Image_15; // 0x2c8(0x08)
	Unknown Image_16; // 0x2d0(0x08)
	Unknown Image_17; // 0x2d8(0x08)
	Unknown Image_18; // 0x2e0(0x08)
	Unknown Image_47; // 0x2e8(0x08)
	Unknown ScaleBox4X_5mm; // 0x2f0(0x08)
	Unknown ScaleBox4X_7mm; // 0x2f8(0x08)
	Unknown ScaleBox4X_SR; // 0x300(0x08)
	Unknown WidgetSwitcher_167; // 0x308(0x08)
	Unknown NewVar_1; // 0x310(0x08)
	Unknown UberGraphFrame; // 0x128(0x08)
	struct FMulticastInlineDelegate RequestOnServer; // 0x130(0x10)
	Unknown SelectionMode; // 0x140(0x01)
	float TimeoutBetweenPings; // 0x144(0x04)
	Unknown PingTimeouts; // 0x148(0x10)
	Unknown ExecutingMenuIconIDs; // 0x158(0x10)
	Unknown ExecutingMenuIconSettings; // 0x168(0x10)
	Unknown OwningPawn; // 0x178(0x08)
	Unknown SelectionMenu; // 0x180(0x08)
	struct FMulticastInlineDelegate ExecuteOwningClient; // 0x188(0x10)
	Unknown TraceMethod; // 0x198(0x01)
	float TraceLength; // 0x19c(0x04)
	float TraceRadius; // 0x1a0(0x04)
	Unknown TraceChannel; // 0x1a4(0x01)
	Unknown TraceComplex; // 0x1a5(0x01)
	struct FMulticastInlineDelegate MenuActivated; // 0x1a8(0x10)
	struct FMulticastInlineDelegate MenuDeactivated; // 0x1b8(0x10)
	struct FMulticastInlineDelegate PingReceivedOnServer; // 0x1c8(0x10)
	Unknown ExecutingPingInfo2; // 0x1d8(0x38)
	Unknown NoneHitActor; // 0x210(0x01)
	Unknown IgnorInput; // 0x211(0x01)
	struct FName TempItemPingTableIndex; // 0x214(0x08)
	Unknown Enable; // 0x21c(0x01)
	struct FName NewVar_1; // 0x220(0x08)
	Unknown MainWidget; // 0x228(0x08)
	Unknown EnableEndPingType; // 0x230(0x01)
	Unknown IsSelectionMenuOnMap; // 0x231(0x01)
	Unknown TmpLocation; // 0x234(0x0c)
	Unknown TmpMousePosition; // 0x240(0x08)
	Unknown IsVisibleSelectionMenu; // 0x248(0x01)
	Unknown IsPressedCtrl; // 0x249(0x01)
	Unknown FindPickUpItem; // 0x24a(0x01)
	Unknown UberGraphFrame; // 0x310(0x08)
	Unknown DefaultSceneRoot; // 0x318(0x08)
	Unknown Muted; // 0x320(0x10)
	Unknown Two; // 0x330(0x01)
	struct FString Player; // 0x338(0x10)
	Unknown Players; // 0x348(0x10)
	Unknown Game; // 0x358(0x08)
	Unknown Joined; // 0x360(0x10)
	Unknown Banned; // 0x370(0x10)
	Unknown Owned; // 0x380(0x10)
	Unknown Chat; // 0x390(0x08)
	Unknown HU; // 0x398(0x08)
	Unknown PrimaryComponentTick; // 0x30(0x30)
	Unknown ComponentTags; // 0x60(0x10)
	Unknown AssetUserData; // 0x70(0x10)
	int32_t UCSSerializationIndex; // 0x84(0x04)
	Unknown bNetAddressable; // 0x88(0x01)
	Unknown bReplicates; // 0x88(0x01)
	Unknown bAutoActivate; // 0x89(0x01)
	Unknown bIsActive; // 0x8a(0x01)
	Unknown bEditableWhenInherited; // 0x8a(0x01)
	Unknown bCanEverAffectNavigation; // 0x8a(0x01)
	Unknown bIsEditorOnly; // 0x8a(0x01)
	Unknown CreationMethod; // 0x8c(0x01)
	struct FMulticastSparseDelegate OnComponentActivated; // 0x8d(0x01)
	struct FMulticastSparseDelegate OnComponentDeactivated; // 0x8e(0x01)
	Unknown UCSModifiedProperties; // 0x90(0x10)
	Unknown PhysicsVolume; // 0x144(0x08)
	Unknown AttachParent; // 0x1d0(0x08)
	struct FName AttachSocketName; // 0x1dc(0x08)
	Unknown AttachChildren; // 0xb8(0x10)
	Unknown ClientAttachedChildren; // 0x190(0x10)
	Unknown RelativeLocation; // 0x224(0x0c)
	Unknown RelativeRotation; // 0x1b4(0x0c)
	Unknown RelativeScale3D; // 0x1c4(0x0c)
	Unknown ComponentVelocity; // 0x164(0x0c)
	Unknown bComponentToWorldUpdated; // 0x140(0x01)
	Unknown bAbsoluteLocation; // 0x220(0x01)
	Unknown bAbsoluteRotation; // 0x1d8(0x01)
	Unknown bAbsoluteScale; // 0x188(0x01)
	Unknown bVisible; // 0xc8(0x01)
	Unknown bShouldBeAttached; // 0x220(0x01)
	Unknown bShouldSnapLocationWhenAttached; // 0x1b0(0x01)
	Unknown bShouldSnapRotationWhenAttached; // 0x188(0x01)
	Unknown bShouldUpdatePhysicsVolume; // 0x1a0(0x01)
	Unknown bHiddenInGame; // 0x220(0x01)
	Unknown bBoundsChangeTriggersStreamingDataRebuild; // 0xc8(0x01)
	Unknown bUseAttachParentBound; // 0x1d8(0x01)
	Unknown Mobility; // 0x221(0x01)
	Unknown DetailMode; // 0x160(0x01)
	struct FMulticastSparseDelegate PhysicsVolumeChangedDelegate; // 0xb0(0x01)
	Unknown ReplaySamplable; // 0x28(0x01)
	Unknown ReplaySampleClass; // 0x30(0x08)
	float ReplaySamplingFrequency; // 0x38(0x04)
	uint32_t ClientReplaySamplingGUID; // 0x3c(0x04)
	Unknown bReplayLevelAttached; // 0x44(0x01)
	Unknown ReplaySamplesForPlayback; // 0x68(0x10)
	Unknown SelfActor; // 0x88(0x08)
	Unknown PrimaryActorTick; // 0x1d8(0x30)
	Unknown bNetTemporary; // 0x284(0x01)
	Unknown bNetStartup; // 0x248(0x01)
	Unknown bOnlyRelevantToOwner; // 0x1c4(0x01)
	Unknown bAlwaysRelevant; // 0xa1(0x01)
	Unknown bReplicateMovement; // 0x260(0x01)
	Unknown bHidden; // 0x222(0x01)
	Unknown bTearOff; // 0x284(0x01)
	Unknown bExchangedRoles; // 0x120(0x01)
	Unknown bNetLoadOnClient; // 0x138(0x01)
	Unknown bNetUseOwnerRelevancy; // 0xe8(0x01)
	Unknown bRelevantForNetworkReplays; // 0x170(0x01)
	Unknown bRelevantForLevelBounds; // 0x138(0x01)
	Unknown bReplayRewindable; // 0x9f(0x01)
	Unknown bAllowTickBeforeBeginPlay; // 0x1c4(0x01)
	Unknown bAutoDestroyWhenFinished; // 0x1c4(0x01)
	Unknown bCanBeDamaged; // 0x1a0(0x01)
	Unknown bBlockInput; // 0x303(0x01)
	Unknown bCollideWhenPlacing; // 0x301(0x01)
	Unknown bFindCameraComponentWhenViewTar; // 0x251(0x01)
	Unknown bGenerateOverlapEventsDuringLevelStreaming; // 0x30e(0x01)
	Unknown bIgnoresOriginShifting; // 0x155(0x01)
	Unknown bEnableAutoLODGeneration; // 0x251(0x01)
	Unknown bIsEditorOnlyActor; // 0x120(0x01)
	Unknown bActorSeamlessTraveled; // 0xea(0x01)
	Unknown bReplicates; // 0x9d(0x01)
	Unknown bCanBeInCluster; // 0x90(0x01)
	Unknown bAllowReceiveTickEv; // 0x198(0x01)
	Unknown bActorEnableCollision; // 0x1b8(0x01)
	Unknown bActorIsBeingDestroyed; // 0x30e(0x01)
	Unknown UpdateOverlapsMethodDuringLevelStreaming; // 0x154(0x01)
	Unknown DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0xa3(0x01)
	Unknown RemoteRole; // 0x279(0x01)
	Unknown ReplicatedMovement; // 0xec(0x34)
	float InitialLifeSpan; // 0x2e0(0x04)
	float CustomTimeDilation; // 0x308(0x04)
	Unknown AttachmentReplication; // 0xa8(0x40)
	Unknown Owner; // 0x178(0x08)
	struct FName NetDriverName; // 0x94(0x08)
	Unknown Role; // 0x9e(0x01)
	Unknown NetDormancy; // 0x238(0x01)
	Unknown SpawnCollisionHandlingMethod; // 0x304(0x01)
	Unknown AutoReceiveInput; // 0x302(0x01)
	int32_t InputPriority; // 0x150(0x04)
	Unknown InputComponent; // 0x2f8(0x08)
	float NetCullDistanceSquared; // 0x280(0x04)
	int32_t NetTag; // 0x24c(0x04)
	float NetUpdateFrequency; // 0x27c(0x04)
	float MinNetUpdateFrequency; // 0x288(0x04)
	float NetPriority; // 0x21c(0x04)
	Unknown Instigator; // 0x258(0x08)
	Unknown Children; // 0x268(0x10)
	Unknown RootComponent; // 0x158(0x08)
	Unknown ControllingMatineeActors; // 0x208(0x10)
	Unknown Layers; // 0x188(0x10)
	Unknown ParentComponent; // 0x1bc(0x08)
	Unknown bEnableRerunConstructionScript; // 0x30c(0x01)
	Unknown Tags; // 0x140(0x10)
	struct FMulticastSparseDelegate OnTakeAnyDamage; // 0x218(0x01)
	struct FMulticastSparseDelegate OnTakePointDamage; // 0x27a(0x01)
	struct FMulticastSparseDelegate OnTakeRadialDamage; // 0x9c(0x01)
	struct FMulticastSparseDelegate OnActorBeginOverlap; // 0x27b(0x01)
	struct FMulticastSparseDelegate OnActorEndOverlap; // 0xa0(0x01)
	struct FMulticastSparseDelegate OnBeginCursorOver; // 0x221(0x01)
	struct FMulticastSparseDelegate OnEndCursorOver; // 0xe9(0x01)
	struct FMulticastSparseDelegate OnClicked; // 0x278(0x01)
	struct FMulticastSparseDelegate OnReleased; // 0x2e4(0x01)
	struct FMulticastSparseDelegate OnInputTouchBegin; // 0x300(0x01)
	struct FMulticastSparseDelegate OnInputTouchEnd; // 0x285(0x01)
	struct FMulticastSparseDelegate OnInputTouchEnter; // 0xa2(0x01)
	struct FMulticastSparseDelegate OnInputTouchLeave; // 0x250(0x01)
	struct FMulticastSparseDelegate OnActorHit; // 0x180(0x01)
	struct FMulticastSparseDelegate OnDestroyed; // 0x220(0x01)
	struct FMulticastSparseDelegate OnEndPlay; // 0x30d(0x01)
	Unknown InstanceComponents; // 0x128(0x10)
	Unknown BlueprintCreatedComponents; // 0x1a8(0x10)
	Unknown LoadedObjects; // 0x1c8(0x10)
	Unknown bShouldDoAnimNotifies; // 0x318(0x01)
	Unknown bWakeOnLevelStart; // 0x318(0x01)
	Unknown SkeletalMeshComponent; // 0x320(0x08)
	Unknown ReplicatedMesh; // 0x328(0x08)
	Unknown ReplicatedPhysAsset; // 0x330(0x08)
	Unknown ReplicatedMaterial0; // 0x338(0x08)
	Unknown ReplicatedMaterial1; // 0x340(0x08)
	float MinDrawDistance; // 0x240(0x04)
	float LDMaxDrawDistance; // 0x244(0x04)
	float CachedMaxDrawDistance; // 0x248(0x04)
	Unknown DepthPriorityGroup; // 0x24c(0x01)
	Unknown ViewOwnerDepthPriorityGroup; // 0x24d(0x01)
	Unknown IndirectLightingCacheQuality; // 0x24e(0x01)
	Unknown LightmapType; // 0x24f(0x01)
	Unknown bUseMaxLODAsImposter; // 0x250(0x01)
	Unknown bBatchImpostersAsInstances; // 0x250(0x01)
	Unknown bNeverDistanceCull; // 0x250(0x01)
	Unknown bAlwaysCreatePhysicsState; // 0x250(0x01)
	Unknown bGenerateOverlapEvents; // 0x251(0x01)
	Unknown bMultiBodyOverlap; // 0x251(0x01)
	Unknown bTraceComplexOnMove; // 0x251(0x01)
	Unknown bReturnMaterialOnMove; // 0x251(0x01)
	Unknown bUseViewOwnerDepthPriorityGroup; // 0x251(0x01)
	Unknown bAllowCullDistanceVolume; // 0x251(0x01)
	Unknown bHasMotionBlurVelocityMeshes; // 0x251(0x01)
	Unknown bVisibleInReflectionCaptures; // 0x251(0x01)
	Unknown bVisibleInRayTracing; // 0x252(0x01)
	Unknown bRenderInMainPass; // 0x252(0x01)
	Unknown bRenderInDepthPass; // 0x252(0x01)
	Unknown bReceivesDecals; // 0x252(0x01)
	Unknown bOwnerNoSee; // 0x252(0x01)
	Unknown bOnlyOwnerSee; // 0x252(0x01)
	Unknown bIgnoreNearClippingForOcclusion; // 0x252(0x01)
	Unknown bTreatAsBackgroundForOcclusion; // 0x252(0x01)
	Unknown bUseAsOccluder; // 0x253(0x01)
	Unknown bSelectable; // 0x253(0x01)
	Unknown bForceMipStreaming; // 0x253(0x01)
	Unknown bHasPerInstanceHitProxies; // 0x253(0x01)
	Unknown CastShadow; // 0x253(0x01)
	Unknown bAffectDynamicIndirectLighting; // 0x253(0x01)
	Unknown bAffectDistanceFieldLighting; // 0x253(0x01)
	Unknown bCastDynamicShadow; // 0x253(0x01)
	Unknown bCastStaticShadow; // 0x254(0x01)
	Unknown bCastDirectionalShadow; // 0x254(0x01)
	Unknown bCastVolumetricTranslucentShadow; // 0x254(0x01)
	Unknown bSelfShadowOnly; // 0x254(0x01)
	Unknown bCastFarShadow; // 0x254(0x01)
	Unknown bCastInsetShadow; // 0x254(0x01)
	Unknown bCastCinematicShadow; // 0x254(0x01)
	Unknown bCastHiddenShadow; // 0x254(0x01)
	Unknown bCastShadowAsTwoSided; // 0x255(0x01)
	Unknown bLightAsIfStatic; // 0x255(0x01)
	Unknown bLightAttachmentsAsGroup; // 0x255(0x01)
	Unknown bExcludeFromLightAttachmentGroup; // 0x255(0x01)
	Unknown bReceiveMobileCSMShadows; // 0x255(0x01)
	Unknown bSingleSampleShadowFromStationaryLights; // 0x255(0x01)
	Unknown bIgnoreRadialImpulse; // 0x255(0x01)
	Unknown bIgnoreRadialForce; // 0x255(0x01)
	Unknown bApplyImpulseOnDamage; // 0x256(0x01)
	Unknown bReplicatePhysicsToAutonomousPr; // 0x256(0x01)
	Unknown bFillCollisionUnderneathForNavmesh; // 0x256(0x01)
	Unknown AlwaysLoadOnClient; // 0x256(0x01)
	Unknown AlwaysLoadOnServer; // 0x256(0x01)
	Unknown bUseEditorCompositing; // 0x256(0x01)
	Unknown bRenderCustomDepth; // 0x256(0x01)
	Unknown bHasNoStreamableTextures; // 0x257(0x01)
	Unknown bHasCustomNavigableGeometry; // 0x258(0x01)
	Unknown CanCharacterStepUpOn; // 0x25a(0x01)
	Unknown LightingChannels; // 0x25b(0x01)
	Unknown CustomDepthStencilWriteMask; // 0x25c(0x01)
	int32_t CustomDepthStencilValue; // 0x260(0x04)
	Unknown CustomPrimitiveData; // 0x268(0x10)
	Unknown CustomPrimitiveDataInternal; // 0x278(0x10)
	int32_t TranslucencySortPriority; // 0x288(0x04)
	int32_t VisibilityId; // 0x28c(0x04)
	Unknown RuntimeVirtualTextures; // 0x290(0x10)
	int8_t VirtualTextureLodBias; // 0x2a0(0x01)
	int8_t VirtualTextureCullMips; // 0x2a1(0x01)
	int8_t VirtualTextureMinCoverage; // 0x2a2(0x01)
	Unknown VirtualTextureRenderPassType; // 0x2a3(0x01)
	float LpvBiasMultiplier; // 0x2a8(0x04)
	float BoundsScale; // 0x2b4(0x04)
	Unknown MoveIgnoreActors; // 0x2c8(0x10)
	Unknown MoveIgnoreComponents; // 0x2d8(0x10)
	Unknown BodyInstance; // 0x2f8(0x190)
	struct FMulticastSparseDelegate OnComponentHit; // 0x488(0x01)
	struct FMulticastSparseDelegate OnComponent; // 0x489(0x01)
	struct FMulticastSparseDelegate OnComponentEndOverlap; // 0x48a(0x01)
	struct FMulticastSparseDelegate OnComponentWake; // 0x48b(0x01)
	struct FMulticastSparseDelegate OnComponentSleep; // 0x48c(0x01)
	struct FMulticastSparseDelegate OnBeginCursorOver; // 0x48e(0x01)
	struct FMulticastSparseDelegate OnEndCursorOver; // 0x48f(0x01)
	struct FMulticastSparseDelegate OnClicked; // 0x490(0x01)
	struct FMulticastSparseDelegate OnReleased; // 0x491(0x01)
	struct FMulticastSparseDelegate OnInputTouchBegin; // 0x492(0x01)
	struct FMulticastSparseDelegate OnInputTouchEnd; // 0x493(0x01)
	struct FMulticastSparseDelegate OnInputTouchEnter; // 0x494(0x01)
	struct FMulticastSparseDelegate OnInputTouchLeave; // 0x495(0x01)
	Unknown LODParentPrimitive; // 0x4b0(0x08)
	float MipStreamingScale; // 0x4b8(0x04)
	Unknown OverrideMaterials; // 0x4c0(0x10)
	Unknown bEnableMaterialParameter; // 0x4e0(0x01)
	Unknown SkeletalMesh; // 0x4e8(0x08)
	Unknown MasterPoseComponent; // 0x4f0(0x08)
	Unknown SkinCacheUsage; // 0x4f8(0x10)
	Unknown PhysicsAssetOverride; // 0x600(0x08)
	int32_t ForcedLodModel; // 0x608(0x04)
	int32_t MinLodModel; // 0x60c(0x04)
	float StreamingDistanceMultiplier; // 0x618(0x04)
	Unknown LODInfo; // 0x628(0x10)
	Unknown VisibilityBasedAnimTickOption; // 0x65c(0x01)
	Unknown bOverrideMinLod; // 0x65e(0x01)
	Unknown bUseBoundsFromMasterPoseC; // 0x65e(0x01)
	Unknown bForceWireframe; // 0x65e(0x01)
	Unknown bDisplayBones; // 0x65e(0x01)
	Unknown bDisableMorphTarget; // 0x65e(0x01)
	Unknown bHideSkin; // 0x65e(0x01)
	Unknown bPerBoneMotionBlur; // 0x65f(0x01)
	Unknown bComponentUseFixedSkelBounds; // 0x65f(0x01)
	Unknown bConsiderAllBodiesForBounds; // 0x65f(0x01)
	Unknown bSyncAttachParentLOD; // 0x65f(0x01)
	Unknown bCanHighlightSelectedSections; // 0x65f(0x01)
	Unknown bRecentlyRendered; // 0x65f(0x01)
	Unknown bCastCapsuleDirectShadow; // 0x65f(0x01)
	Unknown bCastCapsuleIndirectShadow; // 0x65f(0x01)
	Unknown bCPUSkinning; // 0x660(0x01)
	Unknown bEnableUpdateRateOptimizations; // 0x660(0x01)
	Unknown bDisplayDebugUpdateRateOptimizations; // 0x660(0x01)
	Unknown bRenderStatic; // 0x660(0x01)
	Unknown bIgnoreMasterPoseComponentLOD; // 0x660(0x01)
	Unknown bCachedLocalBoundsUpToDate; // 0x660(0x01)
	Unknown bForceMeshObjectUpdate; // 0x661(0x01)
	float CapsuleIndirectShadowMinVisibility; // 0x664(0x04)
	Unknown CachedWorldSpaceBounds; // 0x678(0x1c)
	Unknown CachedWorldToLocalTransform; // 0x6a0(0x40)
	double ForceMipLevelsToBeResidentTimestamp; // 0x28(0x08)
	int32_t NumCinematicMipLevels; // 0x30(0x04)
	int32_t StreamingIndex; // 0x34(0x04)
	int32_t CachedCombinedLODBias; // 0x38(0x04)
	Unknown CachedNumResidentLODs; // 0x3c(0x01)
	Unknown bCachedReadyForStreaming; // 0x3d(0x01)
	Unknown NeverStream; // 0x3d(0x01)
	Unknown bGlobalForceMipLevelsToBeResident; // 0x3d(0x01)
	Unknown bIsStreamable; // 0x3d(0x01)
	Unknown bHasStreamingUpdatePending; // 0x3d(0x01)
	Unknown bForceMiplevelsToBeResident; // 0x3d(0x01)
	Unknown bIgnoreStreamingMipBias; // 0x3d(0x01)
	Unknown bUseCinematicMipLev; // 0x3d(0x01)
	Unknown Skeleton; // 0x60(0x08)
	Unknown ImportedBounds; // 0x68(0x1c)
	Unknown ExtendedBounds; // 0x84(0x1c)
	Unknown PositiveBoundsExtension; // 0xa0(0x0c)
	Unknown NegativeBoundsExtension; // 0xac(0x0c)
	Unknown Materials; // 0xb8(0x10)
	Unknown SkelMirrorTable; // 0xc8(0x10)
	Unknown LODInfo; // 0xd8(0x10)
	Unknown MinLOD; // 0x138(0x04)
	Unknown DisableBelowMinLodStripping; // 0x13c(0x01)
	Unknown SkelMirrorAxis; // 0x13d(0x01)
	Unknown SkelMirrorFlipAxis; // 0x13e(0x01)
	Unknown bUseFullPrecisionUVs; // 0x13f(0x01)
	Unknown bUseHighPrecisionTangentBasis; // 0x13f(0x01)
	Unknown bHasBeenSimplified; // 0x13f(0x01)
	Unknown bHasVertexColors; // 0x13f(0x01)
	Unknown bEnablePerPolyCollision; // 0x13f(0x01)
	Unknown BodySetup; // 0x140(0x08)
	Unknown PhysicsAsset; // 0x148(0x08)
	Unknown ShadowPhysicsAsset; // 0x150(0x08)
	Unknown NodeMappingData; // 0x158(0x10)
	Unknown MorphTargets; // 0x168(0x10)
	Unknown PostProcessAnimBlueprint; // 0x2f0(0x08)
	Unknown MeshClothingAssets; // 0x2f8(0x10)
	Unknown SamplingInfo; // 0x308(0x30)
	Unknown AssetUserData; // 0x338(0x10)
	Unknown Sockets; // 0x350(0x10)
	Unknown SkinWeightProfiles; // 0x370(0x10)
	Unknown StaticMeshComponent; // 0x310(0x08)
	Unknown bStaticMeshReplicateMovement; // 0x318(0x01)
	Unknown NavigationGeometryGatheringMode; // 0x319(0x01)
	Unknown LightingGuid; // 0x48(0x10)
	int32_t LODBias; // 0x58(0x04)
	Unknown CompressionSettings; // 0x5c(0x01)
	Unknown Filter; // 0x5d(0x01)
	Unknown MipLoadOptions; // 0x5e(0x01)
	Unknown LODGroup; // 0x5f(0x01)
	Unknown SRGB; // 0x60(0x01)
	Unknown bNoTiling; // 0x60(0x01)
	Unknown VirtualTextureStreaming; // 0x60(0x01)
	Unknown CompressionYCoCg; // 0x60(0x01)
	Unknown bAsyncResourceReleaseHasBeenStarted; // 0x60(0x01)
	Unknown AssetUserData; // 0x68(0x10)
	Unknown Format; // 0xc0(0x01)
	Unknown PlayerOwner; // 0x310(0x08)
	Unknown bLostFocusPaused; // 0x318(0x01)
	Unknown bShowHUD; // 0x318(0x01)
	Unknown bShowDebugInfo; // 0x318(0x01)
	int32_t CurrentTargetIndex; // 0x31c(0x04)
	Unknown bShowHitBoxDebugInfo; // 0x320(0x01)
	Unknown bShowOverlays; // 0x320(0x01)
	Unknown bEnableDebugTextShadow; // 0x320(0x01)
	Unknown PostRenderedActors; // 0x328(0x10)
	Unknown DebugDisplay; // 0x340(0x10)
	Unknown ToggledDebugCategories; // 0x350(0x10)
	Unknown Canvas; // 0x360(0x08)
	Unknown DebugCanvas; // 0x368(0x08)
	Unknown DebugTextList; // 0x370(0x10)
	Unknown ShowDebugTargetDesiredClass; // 0x380(0x08)
	Unknown ShowDebugTargetActor; // 0x388(0x08)
	Unknown PlayerController; // 0x30(0x08)
	int32_t CurrentNetSpeed; // 0x38(0x04)
	int32_t ConfiguredInternetSpeed; // 0x3c(0x04)
	int32_t ConfiguredLanSpeed; // 0x40(0x04)
	Unknown SelfNetConnection; // 0xb0(0x08)
	Unknown Children; // 0xb8(0x10)
	Unknown Driver; // 0xc8(0x08)
	Unknown PackageMapClass; // 0xd0(0x08)
	Unknown PackageMap; // 0xd8(0x08)
	Unknown OpenChannels; // 0xe0(0x10)
	Unknown SentTemporaries; // 0xf0(0x10)
	Unknown ViewTarget; // 0x100(0x08)
	Unknown OwningActor; // 0x108(0x08)
	int32_t MaxPacket; // 0x110(0x04)
	Unknown InternalAck; // 0x114(0x01)
	Unknown PlayerId; // 0x1d0(0x28)
	double LastReceiveTime; // 0x240(0x08)
	Unknown ChannelsToTick; // 0x1580(0x10)
	struct FString NetConnectionClassName; // 0x30(0x10)
	struct FString ReplicationDriverClassName; // 0x40(0x10)
	int32_t MaxDownloadSize; // 0x50(0x04)
	Unknown bClampListenServerTickRate; // 0x54(0x01)
	int32_t NetServerMaxTickRate; // 0x58(0x04)
	int32_t MaxNetTickRate; // 0x5c(0x04)
	int32_t MaxInternetClientRate; // 0x60(0x04)
	int32_t MaxClientRate; // 0x64(0x04)
	float ServerTravelPause; // 0x68(0x04)
	float SpawnPrioritySeconds; // 0x6c(0x04)
	float RelevantTimeout; // 0x70(0x04)
	float KeepAliveTime; // 0x74(0x04)
	float InitialConnectTimeout; // 0x78(0x04)
	float ConnectionTimeout; // 0x7c(0x04)
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x80(0x04)
	Unknown bNoTimeouts; // 0x84(0x01)
	Unknown bNeverApplyNetworkEmulationSettings; // 0x85(0x01)
	Unknown ServerConnection; // 0x88(0x08)
	Unknown ClientConnections; // 0x90(0x10)
	int32_t RecentlyDisconnectedTrackingTime; // 0x100(0x04)
	Unknown World; // 0x140(0x08)
	Unknown WorldPackage; // 0x148(0x08)
	Unknown NetConnectionClass; // 0x170(0x08)
	Unknown ReplicationDriverClass; // 0x178(0x08)
	struct FName NetDriverName; // 0x190(0x08)
	Unknown ChannelDefinitions; // 0x198(0x10)
	Unknown ChannelDefinitionMap; // 0x1a8(0x50)
	Unknown ActorChannelPool; // 0x1f8(0x10)
	float Time; // 0x210(0x04)
	Unknown ReplicationDriver; // 0x6e8(0x08)
	Unknown TinyFont; // 0x30(0x08)
	Unknown TinyFontName; // 0x38(0x18)
	Unknown SmallFont; // 0x50(0x08)
	Unknown SmallFontName; // 0x58(0x18)
	Unknown MediumFont; // 0x70(0x08)
	Unknown MediumFontName; // 0x78(0x18)
	Unknown LargeFont; // 0x90(0x08)
	Unknown LargeFontName; // 0x98(0x18)
	Unknown SubtitleFont; // 0xb0(0x08)
	Unknown SubtitleFontName; // 0xb8(0x18)
	Unknown AdditionalFonts; // 0xd0(0x10)
	Unknown AdditionalFontNames; // 0xe8(0x10)
	Unknown ConsoleClass; // 0xf8(0x08)
	Unknown ConsoleClassName; // 0x100(0x18)
	Unknown GameViewportClientClass; // 0x118(0x08)
	Unknown GameViewportClientClassName; // 0x120(0x18)
	Unknown LocalPlayerClass; // 0x138(0x08)
	Unknown LocalPlayerClassName; // 0x140(0x18)
	Unknown WorldSettingsClass; // 0x158(0x08)
	Unknown WorldSettingsClassName; // 0x160(0x18)
	Unknown NavigationSystemClassName; // 0x178(0x18)
	Unknown NavigationSystemClass; // 0x190(0x08)
	Unknown NavigationSystemConfigClassName; // 0x198(0x18)
	Unknown NavigationSystemConfigClass; // 0x1b0(0x08)
	Unknown AvoidanceManagerClassName; // 0x1b8(0x18)
	Unknown AvoidanceManagerClass; // 0x1d0(0x08)
	Unknown PhysicsCollisionHandlerClass; // 0x1d8(0x08)
	Unknown PhysicsCollisionHandlerClassName; // 0x1e0(0x18)
	Unknown GameUserSettingsClassName; // 0x1f8(0x18)
	Unknown GameUserSettingsClass; // 0x210(0x08)
	Unknown AIControllerClassName; // 0x218(0x18)
	Unknown GameUserSettings; // 0x230(0x08)
	Unknown LevelScriptActorClass; // 0x238(0x08)
	Unknown LevelScriptActorClassName; // 0x240(0x18)
	Unknown DefaultBlueprintBaseClassName; // 0x258(0x18)
	Unknown GameSingletonClassName; // 0x270(0x18)
	Unknown GameSingleton; // 0x288(0x08)
	Unknown AssetManagerClassName; // 0x290(0x18)
	Unknown AssetManager; // 0x2a8(0x08)
	Unknown DefaultTexture; // 0x2b0(0x08)
	Unknown DefaultTextureName; // 0x2b8(0x18)
	Unknown DefaultDiffuseTexture; // 0x2d0(0x08)
	Unknown DefaultDiffuseTextureName; // 0x2d8(0x18)
	Unknown DefaultBSPVertexTexture; // 0x2f0(0x08)
	Unknown DefaultBSPVertexTextureName; // 0x2f8(0x18)
	Unknown HighFrequencyNoiseTexture; // 0x310(0x08)
	Unknown HighFrequencyNoiseTextureName; // 0x318(0x18)
	Unknown DefaultBokehTexture; // 0x330(0x08)
	Unknown DefaultBokehTextureName; // 0x338(0x18)
	Unknown DefaultBloomKernelTexture; // 0x350(0x08)
	Unknown DefaultBloomKernelTextureName; // 0x358(0x18)
	Unknown WireframeMaterial; // 0x370(0x08)
	struct FString WireframeMaterialName; // 0x378(0x10)
	Unknown DebugMeshMaterial; // 0x388(0x08)
	Unknown DebugMeshMaterialName; // 0x390(0x18)
	Unknown EmissiveMeshMaterial; // 0x3a8(0x08)
	Unknown EmissiveMeshMaterialName; // 0x3b0(0x18)
	Unknown LevelColorationLitMaterial; // 0x3c8(0x08)
	struct FString LevelColorationLitMaterialName; // 0x3d0(0x10)
	Unknown LevelColorationUnlitMaterial; // 0x3e0(0x08)
	struct FString LevelColorationUnlitMaterialName; // 0x3e8(0x10)
	Unknown LightingTexelDensityMaterial; // 0x3f8(0x08)
	struct FString LightingTexelDensityName; // 0x400(0x10)
	Unknown ShadedLevelColorationLitMaterial; // 0x410(0x08)
	struct FString ShadedLevelColorationLitMaterialName; // 0x418(0x10)
	Unknown ShadedLevelColorationUnlitMater; // 0x428(0x08)
	struct FString ShadedLevelColorationUnlitMaterlNa; // 0x430(0x10)
	Unknown RemoveSurfaceMaterial; // 0x440(0x08)
	Unknown RemoveSurfaceMaterialName; // 0x448(0x18)
	Unknown VertexColorMaterial; // 0x460(0x08)
	struct FString VertexColorMaterialName; // 0x468(0x10)
	Unknown VertexColorViewModeMaterial_ColorOnly; // 0x478(0x08)
	struct FString VertexColorViewModeMaterialName_ColorOnly; // 0x480(0x10)
	Unknown VertexColorViewModeMaterial_AlphaAsColor; // 0x490(0x08)
	struct FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x498(0x10)
	Unknown VertexColorViewModeMaterial_RedOnly; // 0x4a8(0x08)
	struct FString VertexColorViewModeMaterialName_RedOnly; // 0x4b0(0x10)
	Unknown VertexColorViewModeMaterial_GreenOnly; // 0x4c0(0x08)
	struct FString VertexColorViewModeMaterialName_GreenOnly; // 0x4c8(0x10)
	Unknown VertexColorViewModeMaterial_BlueOnly; // 0x4d8(0x08)
	struct FString VertexColorViewModeMaterialName_BlueOnly; // 0x4e0(0x10)
	Unknown DebugEditorMaterialName; // 0x4f0(0x18)
	Unknown ConstraintLimitMaterial; // 0x508(0x08)
	Unknown ConstraintLimitMaterialX; // 0x510(0x08)
	Unknown ConstraintLimitMaterialXAxis; // 0x518(0x08)
	Unknown ConstraintLimitMaterialY; // 0x520(0x08)
	Unknown ConstraintLimitMaterialYAxis; // 0x528(0x08)
	Unknown ConstraintLimitMaterialZ; // 0x530(0x08)
	Unknown ConstraintLimitMaterialZAxis; // 0x538(0x08)
	Unknown ConstraintLimitMaterialPrismatic; // 0x540(0x08)
	Unknown InvalidLightmapSettingsMaterial; // 0x548(0x08)
	Unknown InvalidLightmapSettingsMaterialName; // 0x550(0x18)
	Unknown PreviewShadowsIndicatorMaterial; // 0x568(0x08)
	Unknown PreviewShadowsIndicatorMaterialName; // 0x570(0x18)
	Unknown ArrowMaterial; // 0x588(0x08)
	Unknown ArrowMaterialYellow; // 0x590(0x08)
	Unknown ArrowMaterialName; // 0x598(0x18)
	Unknown LightingOnlyBrightness; // 0x5b0(0x10)
	Unknown ShaderComplexityColors; // 0x5c0(0x10)
	Unknown QuadComplexityColors; // 0x5d0(0x10)
	Unknown LightComplexityColors; // 0x5e0(0x10)
	Unknown StationaryLightOverlapColors; // 0x5f0(0x10)
	Unknown LODColorationColors; // 0x600(0x10)
	Unknown HLODColorationColors; // 0x610(0x10)
	Unknown StreamingAccuracyColors; // 0x620(0x10)
	float MaxPixelShaderAdditiveComplexityCoun; // 0x630(0x04)
	float MaxES3PixelShaderAdditiveComplexityCount; // 0x634(0x04)
	float MinLightMapDensity; // 0x638(0x04)
	float IdealLightMapDensity; // 0x63c(0x04)
	float MaxLightMapDensity; // 0x640(0x04)
	Unknown bRenderLightMapDensityGrayscale; // 0x644(0x01)
	float RenderLightMapDensityGrayscaleScale; // 0x648(0x04)
	float RenderLightMapDensityColorScale; // 0x64c(0x04)
	Unknown LightMapDensityVertexMappedColor; // 0x650(0x10)
	Unknown LightMapDensitySelectedColor; // 0x660(0x10)
	Unknown StatColorMappings; // 0x670(0x10)
	Unknown DefaultPhysMaterial; // 0x680(0x08)
	Unknown DefaultPhysMaterialName; // 0x688(0x18)
	Unknown ActiveGameNameRedirects; // 0x6a0(0x10)
	Unknown ActiveClassRedirects; // 0x6b0(0x10)
	Unknown ActivePluginRedirects; // 0x6c0(0x10)
	Unknown ActiveStructRedirects; // 0x6d0(0x10)
	Unknown PreIntegratedSkinBRDFTexture; // 0x6e0(0x08)
	Unknown PreIntegratedSkinBRDFTextureName; // 0x6e8(0x18)
	Unknown BlueNoiseTexture; // 0x700(0x08)
	Unknown BlueNoiseTextureName; // 0x708(0x18)
	Unknown MiniFontTexture; // 0x720(0x08)
	Unknown MiniFontTextureName; // 0x728(0x18)
	Unknown WeightMapPlaceholderTexture; // 0x740(0x08)
	Unknown WeightMapPlaceholderTextureName; // 0x748(0x18)
	Unknown LightMapDensityTexture; // 0x760(0x08)
	Unknown LightMapDensityTextureName; // 0x768(0x18)
	Unknown GameViewport; // 0x788(0x08)
	Unknown DeferredCommands; // 0x790(0x10)
	int32_t TickCycles; // 0x7a0(0x04)
	int32_t GameCycles; // 0x7a4(0x04)
	int32_t ClientCycles; // 0x7a8(0x04)
	float NearClipPlane; // 0x7ac(0x04)
	float EditorNearClipPlane; // 0x7b0(0x04)
	Unknown bUseCustomAudioModule; // 0x7b4(0x01)
	Unknown bHardwareSurveyEnabled; // 0x7b8(0x01)
	Unknown bSubtitlesEnabled; // 0x7b8(0x01)
	Unknown bSubtitlesForcedOff; // 0x7b8(0x01)
	int32_t MaximumLoopIterationCount; // 0x7bc(0x04)
	Unknown bCanBlueprintsTickByDefault; // 0x7c0(0x01)
	Unknown bOptimizeAnimBlueprintMemberVar; // 0x7c0(0x01)
	Unknown bAllowMultiThreadedAnimationUpdate; // 0x7c0(0x01)
	Unknown bEnableEditorPSysRealtimeLOD; // 0x7c0(0x01)
	Unknown bSmoothFrameRate; // 0x7c0(0x01)
	Unknown bUseFixedFrameRate; // 0x7c0(0x01)
	float FixedFrameRate; // 0x7c4(0x04)
	Unknown SmoothedFrameRateRange; // 0x7c8(0x10)
	Unknown CustomTimeStep; // 0x7d8(0x08)
	Unknown CustomTimeStepClassName; // 0x800(0x18)
	Unknown TimecodeProvider; // 0x818(0x08)
	Unknown TimecodeProviderClassName; // 0x840(0x18)
	Unknown bGenerateDefaultTimecode; // 0x858(0x01)
	Unknown GenerateDefaultTimecodeFrameRate; // 0x85c(0x08)
	float GenerateDefaultTimecodeFrameDelay; // 0x864(0x04)
	Unknown bCheckForMultiplePawnsSpawnedInAFrame; // 0x868(0x01)
	int32_t NumPawnsAllowedToBeSpawnedInAFr; // 0x86c(0x04)
	Unknown bShouldGenerateLowQualityLightmaps; // 0x870(0x01)
	Unknown C_WorldBox; // 0x874(0x04)
	Unknown C_BrushWire; // 0x878(0x04)
	Unknown C_AddWire; // 0x87c(0x04)
	Unknown C_SubtractWire; // 0x880(0x04)
	Unknown C_SemiSolidWire; // 0x884(0x04)
	Unknown C_NonSolidWire; // 0x888(0x04)
	Unknown C_WireBackground; // 0x88c(0x04)
	Unknown C_ScaleBoxHi; // 0x890(0x04)
	Unknown C_VolumeCollision; // 0x894(0x04)
	Unknown C_BSPCollision; // 0x898(0x04)
	Unknown C_OrthoBackground; // 0x89c(0x04)
	Unknown C_Volume; // 0x8a0(0x04)
	Unknown C_BrushShape; // 0x8a4(0x04)
	float StreamingDistanceFactor; // 0x8a8(0x04)
	Unknown GameScreenshotSaveDirectory; // 0x8b0(0x10)
	Unknown TransitionType; // 0x8c0(0x01)
	struct FString TransitionDescription; // 0x8c8(0x10)
	struct FString TransitionGameMode; // 0x8d8(0x10)
	float MeshLODRange; // 0x8e8(0x04)
	Unknown bAllowMatureLanguage; // 0x8ec(0x01)
	float CameraRotationThreshold; // 0x8f0(0x04)
	float CameraTranslationThreshold; // 0x8f4(0x04)
	float PrimitiveProbablyVisibleTime; // 0x8f8(0x04)
	float MaxOcclusionPixelsFraction; // 0x8fc(0x04)
	Unknown bPauseOnLossOfFocus; // 0x900(0x01)
	int32_t MaxParticleResize; // 0x904(0x04)
	int32_t MaxParticleResizeWarn; // 0x908(0x04)
	Unknown PendingDroppedNotes; // 0x910(0x10)
	float NetClientTicksPerSecond; // 0x920(0x04)
	float DisplayGamma; // 0x924(0x04)
	float MinDesiredFrameRate; // 0x928(0x04)
	Unknown DefaultSelectedMaterialColor; // 0x92c(0x10)
	Unknown SelectedMaterialColor; // 0x93c(0x10)
	Unknown SelectionOutlineColor; // 0x94c(0x10)
	Unknown SubduedSelectionOutlineColor; // 0x95c(0x10)
	Unknown SelectedMaterialColorOverride; // 0x96c(0x10)
	Unknown bIsOverridingSelectedColor; // 0x97c(0x01)
	Unknown bEnableOnScreenDebugMessages; // 0x980(0x01)
	Unknown bEnableOnScreenDebugMessagesDisplay; // 0x980(0x01)
	Unknown bSuppressMapWarnings; // 0x980(0x01)
	Unknown bDisableAILogging; // 0x980(0x01)
	uint32_t bEnableVisualLogRecordingOnStar; // 0x984(0x04)
	int32_t ScreenSaverInhibitorSemaphore; // 0x98c(0x04)
	Unknown bLockReadOnlyLevels; // 0x990(0x01)
	struct FString ParticleEventManagerClassPath; // 0x998(0x10)
	float SelectionHighlightIntensity; // 0x9a8(0x04)
	float BSPSelectionHighlightIntensity; // 0x9ac(0x04)
	float SelectionHighlightIntensityBillboards; // 0x9b0(0x04)
	Unknown NetDriverDefinitions; // 0xc00(0x10)
	Unknown ServerActors; // 0xc10(0x10)
	Unknown RuntimeServerActors; // 0xc20(0x10)
	float NetErrorLogInterval; // 0xc30(0x04)
	Unknown bStartedLoadMapMovie; // 0xc34(0x01)
	int32_t NextWorldContextHandle; // 0xc50(0x04)
	Unknown ViewportClient; // 0x70(0x08)
	Unknown AspectRatioAxisConstraint; // 0x94(0x01)
	Unknown PendingLevelPlayerControllerClass; // 0x98(0x08)
	Unknown bSentSplitJoin; // 0xa0(0x01)
	int32_t ControllerId; // 0xb8(0x04)
	Unknown AnimBlueprintGeneratedClass; // 0x700(0x08)
	Unknown AnimClass; // 0x708(0x08)
	Unknown AnimScriptInstance; // 0x710(0x08)
	Unknown PostprocessAnimInstance; // 0x718(0x08)
	Unknown AnimationData; // 0x720(0x18)
	Unknown RootBoneTranslation; // 0x748(0x0c)
	Unknown LineCheckBoundsScale; // 0x754(0x0c)
	Unknown LinkedInstances; // 0x780(0x10)
	Unknown CachedBoneSpaceTransforms; // 0x790(0x10)
	Unknown CachedComponentSpaceTransforms; // 0x7a0(0x10)
	float GlobalAnimRateScale; // 0x7d0(0x04)
	Unknown KinematicBonesUpdateType; // 0x7d4(0x01)
	Unknown PhysicsTransformUpdateMode; // 0x7d5(0x01)
	Unknown AnimationMode; // 0x7dd(0x01)
	Unknown bDisablePostProcessBlueprint; // 0x7df(0x01)
	Unknown bUpdateOverlapsOnAnimationFinalize; // 0x7df(0x01)
	Unknown bHasValidBodies; // 0x7df(0x01)
	Unknown bBlendPhysics; // 0x7df(0x01)
	Unknown bEnablePhysicsOnDedicatedServer; // 0x7df(0x01)
	Unknown bUpdateJointsFromAnimation; // 0x7e0(0x01)
	Unknown bDisableClothSimulation; // 0x7e0(0x01)
	Unknown bDisableRigidBodyAnimNode; // 0x7e0(0x01)
	Unknown bAllowAnimCurveEvaluation; // 0x7e0(0x01)
	Unknown bDisableAnimCurves; // 0x7e0(0x01)
	Unknown bCollideWithEnvironment; // 0x7e1(0x01)
	Unknown bCollideWithAttachedChildren; // 0x7e1(0x01)
	Unknown bLocalSpaceSimulation; // 0x7e1(0x01)
	Unknown bResetAfterTeleport; // 0x7e1(0x01)
	Unknown bDeferKinematicBoneUpdate; // 0x7e1(0x01)
	Unknown bNoSkeletonUpdate; // 0x7e1(0x01)
	Unknown bPauseAnims; // 0x7e1(0x01)
	Unknown bUseRefPoseOnInitAnim; // 0x7e2(0x01)
	Unknown bEnablePerPolyCollision; // 0x7e2(0x01)
	Unknown bForceRefpose; // 0x7e2(0x01)
	Unknown bOnlyAllowAutonomousTickPose; // 0x7e2(0x01)
	Unknown bIsAutonomousTickPose; // 0x7e2(0x01)
	Unknown bOldForceRefPose; // 0x7e2(0x01)
	Unknown bShowPrePhysBones; // 0x7e2(0x01)
	Unknown bRequiredBonesUpToDate; // 0x7e2(0x01)
	Unknown bAnimTreeInitialised; // 0x7e3(0x01)
	Unknown bIncludeComponentLocationIntoBounds; // 0x7e3(0x01)
	Unknown bEnableLineCheckWithBounds; // 0x7e3(0x01)
	Unknown bUseBendingElements; // 0x7e3(0x01)
	Unknown bUseTetrahedralConstraints; // 0x7e3(0x01)
	Unknown bUseThinShellVolumeConstraints; // 0x7e3(0x01)
	Unknown bUseSelfCollisions; // 0x7e3(0x01)
	Unknown bUseContinuousCollisionDetection; // 0x7e3(0x01)
	Unknown bPropagateCurvesToSlaves; // 0x7e4(0x01)
	Unknown bSkipKinematicUpdateWhenInterpolatin; // 0x7e4(0x01)
	Unknown bSkipBoundsUpdateWhenInterpolating; // 0x7e4(0x01)
	Unknown bNeedsQueuedAnimEventsDispatched; // 0x7e4(0x01)
	uint16_t CachedAnimCurveUidVersion; // 0x7e6(0x02)
	Unknown MassMode; // 0x7e8(0x01)
	float UniformMass; // 0x7ec(0x04)
	float TotalMass; // 0x7f0(0x04)
	float Density; // 0x7f4(0x04)
	float MinPerParticleMass; // 0x7f8(0x04)
	float ClothBlendWeight; // 0x7fc(0x04)
	float EdgeStiffness; // 0x800(0x04)
	float BendingStiffness; // 0x804(0x04)
	float AreaStiffness; // 0x808(0x04)
	float VolumeStiffness; // 0x80c(0x04)
	float StrainLimitingStiffness; // 0x810(0x04)
	float ShapeTargetStiffness; // 0x814(0x04)
	Unknown DisallowedAnimCurves; // 0x818(0x10)
	Unknown BodySetup; // 0x828(0x08)
	struct FMulticastInlineDelegate OnConstraintBroken; // 0x838(0x10)
	Unknown ClothingSimulationFactory; // 0x848(0x08)
	float TeleportDistanceThreshold; // 0x918(0x04)
	float TeleportRotationThreshold; // 0x91c(0x04)
	uint32_t LastPoseTickFrame; // 0x928(0x04)
	Unknown ClothingInteractor; // 0x980(0x08)
	struct FMulticastInlineDelegate OnAnimInitialized; // 0xa50(0x10)
	Unknown CurrentSkeleton; // 0x28(0x08)
	Unknown RootMotionMode; // 0x30(0x01)
	Unknown bUseMultiThreadedAnimationUpdate; // 0x31(0x01)
	Unknown bUsingCopyPoseFromMesh; // 0x31(0x01)
	Unknown bReceiveNotifiesFromLinkedInstances; // 0x31(0x01)
	Unknown bPropagateNotifiesToLinkedInstances; // 0x31(0x01)
	Unknown bQueueMontageEvents; // 0x31(0x01)
	struct FMulticastInlineDelegate OnMontageBlendingOut; // 0x38(0x10)
	struct FMulticastInlineDelegate OnMontageStarted; // 0x48(0x10)
	struct FMulticastInlineDelegate OnMontageEnded; // 0x58(0x10)
	struct FMulticastInlineDelegate OnAllMontageInstancesEnded; // 0x68(0x10)
	Unknown NotifyQueue; // 0x100(0x70)
	Unknown ActiveAnimNotifyState; // 0x170(0x10)
	Unknown SupportedClass; // 0x28(0x08)
	Unknown ExportRootScope; // 0x30(0x08)
	Unknown FormatExtension; // 0x38(0x10)
	Unknown FormatDescription; // 0x48(0x10)
	int32_t PreferredFormatIndex; // 0x58(0x04)
	int32_t TextIndent; // 0x5c(0x04)
	Unknown bText; // 0x60(0x01)
	Unknown bSelectedOnly; // 0x60(0x01)
	Unknown bForceFileOperations; // 0x60(0x01)
	Unknown ExportTask; // 0x68(0x08)
	Unknown bInputEnabled; // 0x310(0x01)
	uint32_t MaxPoolSize; // 0x28(0x04)
	Unknown BrushType; // 0x310(0x01)
	Unknown BrushColor; // 0x314(0x04)
	int32_t PolyFlags; // 0x318(0x04)
	Unknown bColored; // 0x31c(0x01)
	Unknown bSolidWhenSelected; // 0x31c(0x01)
	Unknown bPlaceableFromClassBrowser; // 0x31c(0x01)
	Unknown bNotForClientOrServ; // 0x31c(0x01)
	Unknown Brush; // 0x320(0x08)
	Unknown BrushComponent; // 0x328(0x08)
	Unknown bInManipulation; // 0x330(0x01)
	Unknown SavedSelections; // 0x338(0x10)
	Unknown SelfWorld; // 0x38(0x08)
	Unknown PersistentLevel; // 0x48(0x08)
	Unknown NetDriver; // 0x50(0x08)
	Unknown LineBatcher; // 0x58(0x08)
	Unknown PersistentLineBatcher; // 0x60(0x08)
	Unknown ForegroundLineBatcher; // 0x68(0x08)
	Unknown NetworkManager; // 0x70(0x08)
	Unknown PhysicsCollisionHandler; // 0x78(0x08)
	Unknown ExtraReferencedObjects; // 0x80(0x10)
	Unknown PerModuleDataObjects; // 0x90(0x10)
	Unknown LevelSequenceActors; // 0xa0(0x10)
	Unknown StreamingLevels; // 0xb0(0x10)
	Unknown StreamingLevelsToConsider; // 0xc0(0x48)
	struct FString StreamingLevelsPrefix; // 0x120(0x10)
	Unknown CurrentLevelPendingVisibility; // 0x130(0x08)
	Unknown CurrentLevelPendingInvisibility; // 0x138(0x08)
	Unknown DemoNetDriver; // 0x140(0x08)
	Unknown MyParticleEventManager; // 0x148(0x08)
	Unknown DefaultPhysicsVolume; // 0x150(0x08)
	Unknown bAreConstraintsDirty; // 0x16e(0x01)
	Unknown NavigationSystem; // 0x170(0x08)
	Unknown AuthorityGameMode; // 0x178(0x08)
	Unknown GameState; // 0x180(0x08)
	Unknown AISystem; // 0x188(0x08)
	Unknown AvoidanceManager; // 0x190(0x08)
	Unknown Levels; // 0x198(0x10)
	Unknown LevelCollections; // 0x1a8(0x10)
	Unknown OwningGameInstance; // 0x1d8(0x08)
	Unknown ParameterCollectionInstances; // 0x1e0(0x10)
	Unknown CanvasForRenderingToTarget; // 0x1f0(0x08)
	Unknown CanvasForDrawMaterialToRenderTarget; // 0x1f8(0x08)
	Unknown ComponentsThatNeedEndOfFrameUpdate; // 0x250(0x10)
	Unknown ComponentsThatNeedEndOfFrameUpdate_OnGameThread; // 0x260(0x10)
	Unknown WorldComposition; // 0x5b0(0x08)
	Unknown PSCPool; // 0x650(0x58)
	Unknown SubTracks; // 0x38(0x10)
	Unknown TrackInstClass; // 0x48(0x08)
	Unknown ActiveCondition; // 0x50(0x01)
	struct FString TrackTitle; // 0x58(0x10)
	Unknown bOnePerGroup; // 0x68(0x01)
	Unknown bDirGroupOnly; // 0x68(0x01)
	Unknown bDisableTrack; // 0x68(0x01)
	Unknown bIsSelected; // 0x68(0x01)
	Unknown bIsAnimControlTrack; // 0x68(0x01)
	Unknown bSubTrackOnly; // 0x68(0x01)
	Unknown bVisible; // 0x68(0x01)
	Unknown bIsRecording; // 0x68(0x01)
	Unknown VectorTrack; // 0x70(0x18)
	float CurveTension; // 0x88(0x04)
	Unknown FloatTrack; // 0x70(0x18)
	float CurveTension; // 0x88(0x04)
	Unknown NativeClass; // 0x28(0x08)
	Unknown Material; // 0x28(0x08)
	Unknown Function; // 0x30(0x08)
	Unknown bIsParameterExpression; // 0x38(0x01)
	Unknown Texture; // 0x40(0x08)
	Unknown SamplerType; // 0x48(0x01)
	Unknown IsDefaultMeshpaintTexture; // 0x49(0x01)
	Unknown Coordinates; // 0x50(0x0c)
	Unknown TextureObject; // 0x64(0x0c)
	Unknown MipValue; // 0x78(0x0c)
	Unknown CoordinatesDX; // 0x8c(0x0c)
	Unknown CoordinatesDY; // 0xa0(0x0c)
	Unknown AutomaticViewMipBiasValue; // 0xb4(0x0c)
	Unknown MipValueMode; // 0xc8(0x01)
	Unknown SamplerSource; // 0xc9(0x01)
	Unknown AutomaticViewMipBias; // 0xca(0x01)
	Unknown ConstCoordinate; // 0xcb(0x01)
	int32_t ConstMipValue; // 0xcc(0x04)
	struct FName ParameterName; // 0xd0(0x08)
	Unknown ExpressionGUID; // 0xd8(0x10)
	struct FName Group; // 0xe8(0x08)
	Unknown SelfPawn; // 0x318(0x08)
	Unknown bUseControllerRotationPitch; // 0x328(0x01)
	Unknown bUseControllerRotationYaw; // 0x328(0x01)
	Unknown bUseControllerRotationRoll; // 0x328(0x01)
	Unknown bCanAffectNavigationGeneration; // 0x328(0x01)
	float BaseEyeHeight; // 0x32c(0x04)
	Unknown AutoPossessPlayer; // 0x330(0x01)
	Unknown AutoPossessAI; // 0x331(0x01)
	uint16_t RemoteViewPitch; // 0x332(0x02)
	uint16_t RemoteViewYaw; // 0x334(0x02)
	Unknown AIControllerClass; // 0x338(0x08)
	Unknown PlayerState; // 0x340(0x08)
	Unknown LastHitBy; // 0x350(0x08)
	Unknown Controller; // 0x358(0x08)
	Unknown ControlInputVector; // 0x364(0x0c)
	Unknown LastControlInputVector; // 0x370(0x0c)
	Unknown SelfCharacter; // 0x388(0x08)
	Unknown Mesh; // 0x398(0x08)
	Unknown CharacterMovement; // 0x3a0(0x08)
	Unknown CapsuleComponent; // 0x3a8(0x08)
	Unknown BasedMovement; // 0x3b8(0x30)
	Unknown ReplicatedBasedMovement; // 0x3e8(0x30)
	float AnimRootMotionTranslationScale; // 0x418(0x04)
	Unknown BaseTranslationOffset; // 0x41c(0x0c)
	Unknown BaseRotationOffset; // 0x430(0x10)
	float ReplicatedServerLastTransformUpdateTimeStamp; // 0x440(0x04)
	float ReplayLastTransformUpdateTimeStamp; // 0x444(0x04)
	Unknown ReplicatedMovementMode; // 0x448(0x01)
	Unknown bInBaseReplication; // 0x449(0x01)
	float CrouchedEyeHeight; // 0x44c(0x04)
	Unknown bIsCrouched; // 0x450(0x01)
	Unknown bProxyIsJumpForceApplied; // 0x450(0x01)
	Unknown bPressedJump; // 0x450(0x01)
	Unknown bClientUpdating; // 0x450(0x01)
	Unknown bClientWasFalling; // 0x450(0x01)
	Unknown bClientResimulateRootMotion; // 0x450(0x01)
	Unknown bClientResimulateRootMotionSour; // 0x450(0x01)
	Unknown bSimGravityDisabled; // 0x450(0x01)
	Unknown bClientCheckEncroachmentOnNetUpdate; // 0x451(0x01)
	Unknown bServerMoveIgnoreRootMotion; // 0x451(0x01)
	Unknown bWasJumping; // 0x451(0x01)
	float JumpKeyHoldTime; // 0x454(0x04)
	float JumpForceTimeRemaining; // 0x458(0x04)
	float ProxyJumpForceStartedTime; // 0x45c(0x04)
	float JumpMaxHoldTime; // 0x460(0x04)
	int32_t JumpMaxCount; // 0x464(0x04)
	int32_t JumpCurrentCount; // 0x468(0x04)
	struct FMulticastInlineDelegate OnReachedJumpApex; // 0x470(0x10)
	struct FMulticastInlineDelegate MovementModeChangedDelegate; // 0x490(0x10)
	struct FMulticastInlineDelegate OnCharacterMovementUpdated; // 0x4a0(0x10)
	Unknown SavedRootMotion; // 0x4b0(0x38)
	Unknown ClientRootMotionParams; // 0x4f0(0x40)
	Unknown RootMotionRepMoves; // 0x530(0x10)
	Unknown RepRootMotion; // 0x540(0x98)
	Unknown SplineCurves; // 0x4b8(0x68)
	Unknown SplineInfo; // 0x520(0x18)
	Unknown SplineRotInfo; // 0x538(0x18)
	Unknown SplineScaleInfo; // 0x550(0x18)
	Unknown SplineReparamTable; // 0x568(0x18)
	Unknown bAllowSplineEditingPerInstance; // 0x580(0x01)
	int32_t ReparamStepsPerSegment; // 0x584(0x04)
	float Duration; // 0x588(0x04)
	Unknown bStationaryEndpoints; // 0x58c(0x01)
	Unknown bSplineHasBeenEdited; // 0x58d(0x01)
	Unknown bModifiedByConstructionScript; // 0x58e(0x01)
	Unknown bInputSplinePointsToConstructionScript; // 0x58f(0x01)
	Unknown bDrawDebug; // 0x590(0x01)
	Unknown bClosedLoop; // 0x591(0x01)
	Unknown bLoopPositionOverride; // 0x592(0x01)
	float LoopPosition; // 0x594(0x04)
	Unknown DefaultUpVector; // 0x598(0x0c)
	struct FString HelpDescription; // 0x28(0x10)
	struct FString HelpUsage; // 0x38(0x10)
	struct FString HelpWebLink; // 0x48(0x10)
	Unknown HelpParamNames; // 0x58(0x10)
	Unknown HelpParamDescriptions; // 0x68(0x10)
	Unknown IsServer; // 0x78(0x01)
	Unknown IsClient; // 0x78(0x01)
	Unknown IsEditor; // 0x78(0x01)
	Unknown LogToConsole; // 0x78(0x01)
	Unknown ShowErrorCount; // 0x78(0x01)
	Unknown ShowProgress; // 0x78(0x01)
	Unknown Sound; // 0x238(0x08)
	Unknown InstanceParameters; // 0x240(0x10)
	Unknown SoundClassOverride; // 0x250(0x08)
	Unknown bAutoDestroy; // 0x258(0x01)
	Unknown bStopWhenOwnerDestroyed; // 0x258(0x01)
	Unknown bShouldRemainActiveIfDropped; // 0x258(0x01)
	Unknown bAllowSpatialization; // 0x258(0x01)
	Unknown bOverrideAttenuation; // 0x258(0x01)
	Unknown bOverrideSubtitlePriority; // 0x258(0x01)
	Unknown bIsUISound; // 0x258(0x01)
	Unknown bEnableLowPassFilter; // 0x258(0x01)
	Unknown bOverridePriority; // 0x259(0x01)
	Unknown bSuppressSubtitles; // 0x259(0x01)
	Unknown bAutoManageAttachment; // 0x25a(0x01)
	struct FName AudioComponentUserID; // 0x260(0x08)
	float PitchModulationMin; // 0x268(0x04)
	float PitchModulationMax; // 0x26c(0x04)
	float VolumeModulationMin; // 0x270(0x04)
	float VolumeModulationMax; // 0x274(0x04)
	float VolumeMultiplier; // 0x278(0x04)
	int32_t EnvelopeFollowerAttackTime; // 0x27c(0x04)
	int32_t EnvelopeFollowerReleaseTime; // 0x280(0x04)
	float Priority; // 0x284(0x04)
	float SubtitlePriority; // 0x288(0x04)
	Unknown SourceEffectChain; // 0x290(0x08)
	float PitchMultiplier; // 0x298(0x04)
	float LowPassFilterFrequency; // 0x29c(0x04)
	Unknown AttenuationSettings; // 0x2a8(0x08)
	Unknown AttenuationOverrides; // 0x2b0(0x3a0)
	Unknown ConcurrencySettings; // 0x650(0x08)
	Unknown ConcurrencySet; // 0x658(0x50)
	Unknown AutoAttachLocationRule; // 0x6b4(0x01)
	Unknown AutoAttachRotationRule; // 0x6b5(0x01)
	Unknown AutoAttachScaleRule; // 0x6b6(0x01)
	struct FMulticastInlineDelegate OnAudioFinished; // 0x6b8(0x10)
	struct FMulticastInlineDelegate OnAudioPlaybackPercent; // 0x6e0(0x10)
	struct FMulticastInlineDelegate OnAudioSingleEnvelopeValue; // 0x708(0x10)
	struct FMulticastInlineDelegate OnAudioMultiEnvelopeValue; // 0x730(0x10)
	Unknown Modulation; // 0x758(0x10)
	struct FDelegate OnQueueSubtitles; // 0x768(0x10)
	Unknown AutoAttachParent; // 0x778(0x08)
	struct FName AutoAttachSocketName; // 0x780(0x08)
	struct FString OptionsString; // 0x310(0x10)
	Unknown GameSessionClass; // 0x320(0x08)
	Unknown GameStateClass; // 0x328(0x08)
	Unknown PlayerControllerClass; // 0x330(0x08)
	Unknown PlayerStateClass; // 0x338(0x08)
	Unknown HUDClass; // 0x340(0x08)
	Unknown DefaultPawnClass; // 0x348(0x08)
	Unknown SpectatorClass; // 0x350(0x08)
	Unknown ReplaySpectatorPlayerController; // 0x358(0x08)
	Unknown ServerStatReplicatorClass; // 0x360(0x08)
	Unknown GameSession; // 0x368(0x08)
	Unknown GameState; // 0x370(0x08)
	Unknown ServerStatReplicator; // 0x378(0x08)
	struct FText DefaultPlayerName; // 0x380(0x18)
	Unknown bUseSeamlessTravel; // 0x398(0x01)
	Unknown bStartPlayersAsSpectators; // 0x398(0x01)
	Unknown bPauseable; // 0x398(0x01)
	struct FName MatchState; // 0x3b0(0x08)
	Unknown bDelayedStart; // 0x3b8(0x01)
	int32_t NumSpectators; // 0x3bc(0x04)
	int32_t NumPlayers; // 0x3c0(0x04)
	int32_t NumBots; // 0x3c4(0x04)
	float MinRespawnDelay; // 0x3c8(0x04)
	int32_t NumTravellingPlayers; // 0x3cc(0x04)
	Unknown EngineMessageClass; // 0x3d0(0x08)
	Unknown InactivePlayerArray; // 0x3d8(0x10)
	float InactivePlayerStateLifeSpan; // 0x3e8(0x04)
	int32_t MaxInactivePlayers; // 0x3ec(0x04)
	Unknown bHandleDedicatedServerReplays; // 0x3f0(0x01)
	Unknown GameModeClass; // 0x310(0x08)
	Unknown AuthorityGameMode; // 0x318(0x08)
	Unknown SpectatorClass; // 0x320(0x08)
	Unknown PlayerArray; // 0x328(0x10)
	Unknown bReplicatedHasBegunPlay; // 0x338(0x01)
	float ReplicatedWorldTimeSeconds; // 0x33c(0x04)
	float ServerWorldTimeSecondsDelta; // 0x340(0x04)
	float ServerWorldTimeSecondsUpdateFrequency; // 0x344(0x04)
	struct FName MatchState; // 0x360(0x08)
	struct FName PreviousMatchState; // 0x368(0x08)
	int32_t ElapsedTime; // 0x370(0x04)
	Unknown PlayerState; // 0x348(0x08)
	struct FMulticastInlineDelegate OnInstigatedAnyDamage; // 0x388(0x10)
	struct FName StateName; // 0x324(0x08)
	Unknown Pawn; // 0x378(0x08)
	Unknown Character; // 0x338(0x08)
	Unknown TransformComponent; // 0x330(0x08)
	Unknown ControlRotation; // 0x39c(0x0c)
	Unknown bAttachToPawn; // 0x32c(0x01)
	Unknown SelfPlayerController; // 0x3b0(0x08)
	Unknown Player; // 0x510(0x08)
	Unknown AcknowledgedPawn; // 0x428(0x08)
	Unknown ControllingDirTrackInst; // 0x4f8(0x08)
	Unknown MyHUD; // 0x5e8(0x08)
	Unknown PlayerCameraManager; // 0x438(0x08)
	Unknown PlayerCameraManagerClass; // 0x480(0x08)
	Unknown bAutoManageActiveCameraTarget; // 0x6e4(0x01)
	Unknown TargetViewRotation; // 0x664(0x0c)
	float SmoothTargetViewRotationSpeed; // 0x640(0x04)
	Unknown HiddenActors; // 0x5b8(0x10)
	Unknown HiddenPrimitiveComponents; // 0x4d0(0x10)
	float LastSpectatorStateSynchTime; // 0x674(0x04)
	Unknown LastSpectatorSyncLocation; // 0x558(0x0c)
	Unknown LastSpectatorSyncRotation; // 0x45c(0x0c)
	int32_t ClientCap; // 0x478(0x04)
	Unknown CheatManager; // 0x568(0x08)
	Unknown CheatClass; // 0x590(0x08)
	Unknown PlayerInput; // 0x518(0x08)
	Unknown ActiveForceFeedbackEffects; // 0x580(0x10)
	Unknown bPlayerIsWaiting; // 0x498(0x01)
	Unknown NetPlayerIndex; // 0x4bc(0x01)
	Unknown PendingSwapConnection; // 0x468(0x08)
	Unknown NetConnection; // 0x3e0(0x08)
	float InputYawScale; // 0x5e0(0x04)
	float InputPitchScale; // 0x5a8(0x04)
	float InputRollScale; // 0x578(0x04)
	Unknown bShowMouseCursor; // 0x670(0x01)
	Unknown bEnableClickEvents; // 0x5b4(0x01)
	Unknown bEnableTouchEvents; // 0x4e0(0x01)
	Unknown bEnableMouseOverEvents; // 0x670(0x01)
	Unknown bEnableTouchOverEvents; // 0x670(0x01)
	Unknown bForceFeedbackEnabled; // 0x57c(0x01)
	float ForceFeedbackScale; // 0x488(0x04)
	Unknown ClickEventKeys; // 0x4a0(0x10)
	Unknown DefaultMouseCursor; // 0x618(0x01)
	Unknown CurrentMouseCursor; // 0x5e4(0x01)
	Unknown DefaultClickTraceChannel; // 0x47c(0x01)
	Unknown CurrentClickTraceChannel; // 0x48c(0x01)
	float HitResultTraceDistance; // 0x3ec(0x04)
	uint16_t SeamlessTravelCount; // 0x5ac(0x02)
	uint16_t LastCompletedSeamlessTravelCount; // 0x540(0x02)
	Unknown InactiveStateInputComponent; // 0x490(0x08)
	Unknown bShouldPerformFullTickWhenPaused; // 0x570(0x01)
	Unknown CurrentTouchInterface; // 0x550(0x08)
	Unknown SpectatorPawn; // 0x470(0x08)
	Unknown bIsLocalPlayerController; // 0x5c8(0x01)
	Unknown SpawnLocation; // 0x61c(0x0c)
	struct FMulticastInlineDelegate ApplicationWillDeactivateDelegate; // 0xb0(0x10)
	struct FMulticastInlineDelegate ApplicationHasReactivatedDelegate; // 0xc0(0x10)
	struct FMulticastInlineDelegate ApplicationWillEnterBackgroundDelegate; // 0xd0(0x10)
	struct FMulticastInlineDelegate ApplicationHasEnteredForegroundDelegate; // 0xe0(0x10)
	struct FMulticastInlineDelegate ApplicationWillTerminateDelegate; // 0xf0(0x10)
	struct FMulticastInlineDelegate ApplicationShouldUnloadResourcesDelegate; // 0x100(0x10)
	struct FMulticastInlineDelegate ApplicationReceivedStartupArgumentsDelegate; // 0x110(0x10)
	struct FMulticastInlineDelegate OnTemperatureChangeDelegate; // 0x120(0x10)
	struct FMulticastInlineDelegate OnLowPowerModeDelegate; // 0x130(0x10)
	Unknown UpdatedComponent; // 0xb0(0x08)
	Unknown UpdatedPrimitive; // 0xb8(0x08)
	Unknown Velocity; // 0xc4(0x0c)
	Unknown PlaneConstraintNormal; // 0xd0(0x0c)
	Unknown PlaneConstraintOrigin; // 0xdc(0x0c)
	Unknown bUpdateOnlyIfRendered; // 0xe8(0x01)
	Unknown bAutoUpdateTickRegistration; // 0xe8(0x01)
	Unknown bTickBeforeOwner; // 0xe8(0x01)
	Unknown bAutoRegisterUpdatedComponent; // 0xe8(0x01)
	Unknown bConstrainToPlane; // 0xe8(0x01)
	Unknown bSnapToPlaneAtStart; // 0xe8(0x01)
	Unknown bAutoRegisterPhysicsVolumeUpdates; // 0xe8(0x01)
	Unknown bComponentShouldUpdatePhysicsVolume; // 0xe8(0x01)
	Unknown PlaneConstraintAxisSetting; // 0xeb(0x01)
	Unknown NavAgentProps; // 0xf0(0x30)
	float FixedPathBrakingDistance; // 0x120(0x04)
	Unknown bUpdateNavAgentWithOwnersCollision; // 0x124(0x01)
	Unknown bUseAccelerationForPaths; // 0x124(0x01)
	Unknown bUseFixedBrakingDistanceForPaths; // 0x124(0x01)
	Unknown MovementState; // 0x125(0x01)
	Unknown PathFollowingComp; // 0x128(0x08)
	Unknown PawnOwner; // 0x130(0x08)
	Unknown CharacterOwner; // 0x2b0(0x08)
	float GravityScale; // 0x2ec(0x04)
	float MaxStepHeight; // 0x468(0x04)
	float JumpZVelocity; // 0x474(0x04)
	float JumpOffJumpZFactor; // 0x6c8(0x04)
	float WalkableFloorAngle; // 0x4f8(0x04)
	float WalkableFloorZ; // 0x488(0x04)
	Unknown MovementMode; // 0x438(0x01)
	Unknown CustomMovementMode; // 0x56c(0x01)
	Unknown NetworkSmoothingMode; // 0x280(0x01)
	float GroundFriction; // 0x470(0x04)
	float MaxWalkSpeed; // 0x300(0x04)
	float MaxWalkSpeedCrouched; // 0x6e0(0x04)
	float MaxSwimSpeed; // 0x548(0x04)
	float MaxFlySpeed; // 0x4e8(0x04)
	float MaxCustomMovementSpeed; // 0x460(0x04)
	float MaxAcceleration; // 0x484(0x04)
	float MinAnalogWalkSpeed; // 0x4e0(0x04)
	float BrakingFrictionFactor; // 0x2a0(0x04)
	float BrakingFriction; // 0x54c(0x04)
	float BrakingSubStepTime; // 0x6bc(0x04)
	float BrakingDecelerationWalking; // 0x554(0x04)
	float BrakingDecelerationFalling; // 0x51c(0x04)
	float BrakingDecelerationSwimming; // 0x414(0x04)
	float BrakingDecelerationFlying; // 0x568(0x04)
	float AirControl; // 0x544(0x04)
	float AirControlBoostMultiplier; // 0x308(0x04)
	float AirControlBoostVelocityThreshold; // 0x3f4(0x04)
	float FallingLateralFriction; // 0x3f0(0x04)
	float CrouchedHalfHeight; // 0x264(0x04)
	float Buoyancy; // 0x40c(0x04)
	float PerchRadiusThreshold; // 0x244(0x04)
	float PerchAdditionalHeight; // 0x248(0x04)
	Unknown RotationRate; // 0x520(0x0c)
	Unknown bUseSeparateBrakingFriction; // 0x298(0x01)
	Unknown bApplyGravityWhileJumping; // 0x2d4(0x01)
	Unknown bUseControllerDesiredRotation; // 0x2e4(0x01)
	Unknown bOrientRotationToMovement; // 0x550(0x01)
	Unknown bSweepWhileNavWalking; // 0x620(0x01)
	Unknown bMovementInProgress; // 0x3c0(0x01)
	Unknown bEnableScopedMovementUpdates; // 0x5d0(0x01)
	Unknown bEnableServerDualMoveScopedMovementUpdates; // 0x4e4(0x01)
	Unknown bForceMaxAccel; // 0x4b8(0x01)
	Unknown bRunPhysicsWithNoController; // 0x2f3(0x01)
	Unknown bForceNextFloorCheck; // 0x490(0x01)
	Unknown bShrinkProxyCapsule; // 0x2fc(0x01)
	Unknown bCanWalkOffLedges; // 0x2e4(0x01)
	Unknown bCanWalkOffLedgesWhenCrouching; // 0x44c(0x01)
	Unknown bNetworkSkipProxyPredictionOnNetUpdate; // 0x490(0x01)
	Unknown bNetworkAlwaysReplicateTransfor; // 0x490(0x01)
	Unknown bDeferUpdateMoveComponent; // 0x510(0x01)
	Unknown bEnablePhysicsInteraction; // 0x4dc(0x01)
	Unknown bTouchForceScaledToMass; // 0x304(0x01)
	Unknown bPushForceScaledToMass; // 0x540(0x01)
	Unknown bPushForceUsingZOffset; // 0x5ac(0x01)
	Unknown bScalePushForceToVelocity; // 0x6dc(0x01)
	Unknown DeferredUpdatedMoveComponent; // 0x3e8(0x08)
	float MaxOutOfWaterStepHeight; // 0x240(0x04)
	float OutofWaterZ; // 0x22c(0x04)
	float Mass; // 0x23c(0x04)
	float StandingDownwardForceScale; // 0x4c8(0x04)
	float InitialPushForceFactor; // 0x294(0x04)
	float PushForceFactor; // 0x2c0(0x04)
	float PushForcePointZOffsetFactor; // 0x2d0(0x04)
	float TouchForceFactor; // 0x434(0x04)
	float MinTouchForce; // 0x3a8(0x04)
	float MaxTouchForce; // 0x5a8(0x04)
	float RepulsionForce; // 0x3ac(0x04)
	Unknown Acceleration; // 0x6d0(0x0c)
	Unknown LastUpdateRotation; // 0x270(0x10)
	Unknown LastUpdateLocation; // 0x288(0x0c)
	Unknown LastUpdateVelocity; // 0x2d8(0x0c)
	float ServerLastTransformUpdateTimeStamp; // 0x310(0x04)
	float ServerLastClientGoodMoveAckTime; // 0x50c(0x04)
	float ServerLastClientAdjustmentTime; // 0x4bc(0x04)
	Unknown PendingImpulseToApply; // 0x21c(0x0c)
	Unknown PendingForceToApply; // 0x5c4(0x0c)
	float AnalogInputModifier; // 0x4d4(0x04)
	float MaxSimulationTimeStep; // 0x2f4(0x04)
	int32_t MaxSimulationIterations; // 0x444(0x04)
	int32_t MaxJumpApexAttemptsPerSimulation; // 0x47c(0x04)
	float MaxDepenetrationWithGeometry; // 0x4ac(0x04)
	float MaxDepenetrationWithGeometryAsProxy; // 0x494(0x04)
	float MaxDepenetrationWithPawn; // 0x25c(0x04)
	float MaxDepenetrationWithPawnAsProxy; // 0x564(0x04)
	float NetworkSimulatedSmoothLocationTime; // 0x3f8(0x04)
	float NetworkSimulatedSmoothRotationTime; // 0x6cc(0x04)
	float ListenServerNetworkSimulatedSmoothLocationTime; // 0x62c(0x04)
	float ListenServerNetworkSimulatedSmoothRotationTime; // 0x3e4(0x04)
	float NetProxyShrinkRadius; // 0x6c4(0x04)
	float NetProxyShrinkHalfHeight; // 0x440(0x04)
	float NetworkMaxSmoothUpdateDistance; // 0x258(0x04)
	float NetworkNoSmoothUpdateDistance; // 0x4d8(0x04)
	float NetworkMinTimeBetweenClientAckGoodMoves; // 0x530(0x04)
	float NetworkMinTimeBetweenClientAdjustmen; // 0x284(0x04)
	float NetworkMinTimeBetweenClientAdjustmenve; // 0x2e8(0x04)
	float NetworkLargeClientCorrectionDistance; // 0x410(0x04)
	float LedgeCheckThreshold; // 0x514(0x04)
	float JumpOutOfWaterPitch; // 0x4cc(0x04)
	Unknown CurrentFloor; // 0x314(0x94)
	Unknown DefaultLandMovementMode; // 0x3fc(0x01)
	Unknown DefaultWaterMovementMode; // 0x2f2(0x01)
	Unknown GroundMovementMode; // 0x305(0x01)
	Unknown bMaintainHorizontalGroundVelocity; // 0x518(0x01)
	Unknown bImpartBaseVelocityX; // 0x5c0(0x01)
	Unknown bImpartBaseVelocityY; // 0x2fc(0x01)
	Unknown bImpartBaseVelocityZ; // 0x4c0(0x01)
	Unknown bImpartBaseAngularVelocity; // 0x518(0x01)
	Unknown bJustTeleported; // 0x44c(0x01)
	Unknown bNetworkUpdateReceived; // 0x2fc(0x01)
	Unknown bNetworkMovementModeChanged; // 0x230(0x01)
	Unknown bIgnoreClientMovementErrorChecksAndCorr; // 0x6c0(0x01)
	Unknown bServerAcceptClientAuthoritativePosition; // 0x480(0x01)
	Unknown bNotifyApex; // 0x464(0x01)
	Unknown bCheatFlying; // 0x24c(0x01)
	Unknown bWantsToCrouch; // 0x4b8(0x01)
	Unknown bCrouchMaintainsBaseLocation; // 0x2b8(0x01)
	Unknown bIgnoreBaseRotation; // 0x538(0x01)
	Unknown bFastAttachedMove; // 0x218(0x01)
	Unknown bAlwaysCheckFloor; // 0x430(0x01)
	Unknown bUseFlatBaseForFloorChecks; // 0x238(0x01)
	Unknown bPerformingJumpOff; // 0x2f1(0x01)
	Unknown bWantsToLeaveNavWalking; // 0x46c(0x01)
	Unknown bUseRVOAvoidance; // 0x6c0(0x01)
	Unknown bRequestedMoveUseAcceleration; // 0x498(0x01)
	Unknown bWasSimulatingRootMotion; // 0x478(0x01)
	Unknown bAllowPhysicsRotationDuringAnimRootMotion; // 0x44c(0x01)
	Unknown bHasRequestedVelocity; // 0x304(0x01)
	Unknown bRequestedMoveWithMaxSpeed; // 0x52c(0x01)
	Unknown bWasAvoidanceUpdated; // 0x2fc(0x01)
	Unknown bProjectNavMeshWalking; // 0x508(0x01)
	Unknown bProjectNavMeshOnBothWorldChannels; // 0x228(0x01)
	float AvoidanceConsiderationRadius; // 0x448(0x04)
	Unknown RequestedVelocity; // 0x4a0(0x0c)
	int32_t AvoidanceUID; // 0x250(0x04)
	Unknown AvoidanceGroup; // 0x48c(0x04)
	Unknown GroupsToAvoid; // 0x2bc(0x04)
	Unknown GroupsToIgnore; // 0x4c4(0x04)
	float AvoidanceWeight; // 0x2a8(0x04)
	Unknown PendingLaunchVelocity; // 0x558(0x0c)
	float NavMeshProjectionInterval; // 0x2a4(0x04)
	float NavMeshProjectionTimer; // 0x30c(0x04)
	float NavMeshProjectionInterpSpeed; // 0x254(0x04)
	float NavMeshProjectionHeightScaleUp; // 0x234(0x04)
	float NavMeshProjectionHeightScaleDown; // 0x408(0x04)
	float NavWalkingFloorDistTolerance; // 0x2f8(0x04)
	Unknown PostPhysicsTickFunction; // 0x148(0x30)
	float MinTimeBetweenTimeStampResets; // 0x5b0(0x04)
	Unknown ClientAutonomuousBase; // 0x4f0(0x08)
	Unknown CurrentRootMotion; // 0x570(0x38)
	Unknown RootMotionParams; // 0x5e0(0x40)
	Unknown AnimRootMotionVelocity; // 0x2c4(0x0c)
	float BlockingHit_SlideAccelerator; // 0x628(0x04)
	Unknown BlockingPhysMaterial; // 0x4b0(0x08)
	Unknown MeshComp; // 0x310(0x08)
	Unknown SceneComponent; // 0x318(0x08)
	Unknown CaptureComponent2D; // 0x320(0x08)
	Unknown ObjectReferenceList; // 0x2c0(0x10)
	Unknown bIsGlobalAsyncScanEnvironment; // 0x2d0(0x01)
	Unknown bShouldGuessTypeAndName; // 0x2d1(0x01)
	Unknown bShouldUseSynchronousLoad; // 0x2d2(0x01)
	Unknown bIsLoadingFromPakFiles; // 0x2d3(0x01)
	Unknown bShouldAcquireMissingChunksOnLoad; // 0x2d4(0x01)
	Unknown bOnlyCookProductionAssets; // 0x2d5(0x01)
	Unknown bIsBulkScanning; // 0x2d6(0x01)
	Unknown bIsPrimaryAssetDirectory; // 0x2d7(0x01)
	Unknown bIsManagementDatabaseCurrent; // 0x2d8(0x01)
	Unknown bUpdateManagementDatabaseAfterScan; // 0x2d9(0x01)
	Unknown bIncludeOnlyOnDiskAssets; // 0x2da(0x01)
	int32_t NumberOfSpawnedNotifications; // 0x2dc(0x04)
	Unknown ShapeBodySetup; // 0x4b8(0x08)
	Unknown AreaClass; // 0x4c0(0x08)
	Unknown ShapeColor; // 0x4c8(0x04)
	Unknown bDrawOnlyIfSelected; // 0x4cc(0x01)
	Unknown bShouldCollideWhenPlacing; // 0x4cc(0x01)
	Unknown bDynamicObstacle; // 0x4cc(0x01)
	Unknown BoxExtent; // 0x4d0(0x0c)
	float LineThickness; // 0x4dc(0x04)
	float FieldOfView; // 0x238(0x04)
	float OrthoWidth; // 0x23c(0x04)
	float OrthoNearClipPlane; // 0x240(0x04)
	float OrthoFarClipPlane; // 0x244(0x04)
	float AspectRatio; // 0x248(0x04)
	Unknown bConstrainAspectRatio; // 0x24c(0x01)
	Unknown bUseFieldOfViewForLOD; // 0x24c(0x01)
	Unknown bLockToHmd; // 0x254(0x01)
	Unknown bUsePawnControlRotation; // 0x254(0x01)
	Unknown ProjectionMode; // 0x255(0x01)
	float PostProcess; // 0x290(0x04)
	Unknown PostProcessSettings; // 0x2c0(0x5c0)
	Unknown DebugCameraControllerRef; // 0x28(0x08)
	Unknown DebugCameraControllerClass; // 0x30(0x08)
	Unknown bCausedByWorld; // 0x28(0x01)
	Unknown bScaleMomentumByMass; // 0x28(0x01)
	Unknown bRadialDamageVelChange; // 0x28(0x01)
	float DamageImpulse; // 0x2c(0x04)
	float DestructibleImpulse; // 0x30(0x04)
	float DestructibleDamageSpreadScale; // 0x34(0x04)
	float DamageFalloff; // 0x38(0x04)
	Unknown SpectatorControllerClass; // 0x928(0x08)
	Unknown SelfDemoNetDriver; // 0x930(0x08)
	Unknown RollbackNetStartupActors; // 0xa50(0x50)
	float CheckpointSaveMaxMSPerFrame; // 0xecc(0x04)
	Unknown MulticastRecordOptions; // 0xf00(0x10)
	Unknown bIsLocalReplay; // 0xf60(0x01)
	Unknown SpectatorControllers; // 0xf68(0x10)
	int32_t ForcedLodModel; // 0x4e8(0x04)
	int32_t PreviousLODLevel; // 0x4ec(0x04)
	int32_t MinLOD; // 0x4f0(0x04)
	int32_t SubDivisionStepSize; // 0x4f4(0x04)
	Unknown StaticMesh; // 0x4f8(0x08)
	Unknown WireframeColorOverride; // 0x500(0x04)
	Unknown bEvaluateWorldPositionOffset; // 0x504(0x01)
	Unknown bOverrideWireframeColor; // 0x504(0x01)
	Unknown bOverrideMinLod; // 0x504(0x01)
	Unknown bOverrideNavigationExport; // 0x504(0x01)
	Unknown bForceNavigationObstacle; // 0x504(0x01)
	Unknown bDisallowMeshPaintPerInstance; // 0x504(0x01)
	Unknown bIgnoreInstanceForTextureStreaming; // 0x504(0x01)
	Unknown bOverrideLightMapRes; // 0x504(0x01)
	Unknown bCastDistanceFieldIndirectShadow; // 0x505(0x01)
	Unknown bOverrideDistanceFieldSelfShadowBias; // 0x505(0x01)
	Unknown bUseSubDivisions; // 0x505(0x01)
	Unknown bUseDefaultCollision; // 0x505(0x01)
	Unknown bReverseCulling; // 0x505(0x01)
	int32_t OverriddenLightMapRes; // 0x508(0x04)
	float DistanceFieldIndirectShadowMinVisibility; // 0x50c(0x04)
	float DistanceFieldSelfShadowBias; // 0x510(0x04)
	float StreamingDistanceMultiplier; // 0x514(0x04)
	Unknown LODData; // 0x518(0x10)
	Unknown StreamingTextureData; // 0x528(0x10)
	Unknown LightmassSettings; // 0x538(0x18)
	float MaxDeltaTime; // 0xde8(0x04)
	float ServerFlushLogInterval; // 0xdec(0x04)
	Unknown GameInstance; // 0xdf0(0x08)
	Unknown ReplayListItemInfos; // 0x28(0x10)
	struct FMulticastInlineDelegate OnEnumerateReplayListCompleteEvent; // 0x38(0x10)
	struct FMulticastInlineDelegate OnDeleteReplayCompleteEvent; // 0x48(0x10)
	struct FMulticastInlineDelegate OnKeepAndDeleteOldetsReplaysCompleteEvent; // 0x58(0x10)
	struct FMulticastInlineDelegate OnKeepAndDeleteOldVersionReplaysCompleteEvent; // 0x68(0x10)
	Unknown SelfGameInstance; // 0x80(0x08)
	Unknown bLoadingWidgetVisible; // 0x88(0x01)
	Unknown LocalPlayers; // 0xb8(0x10)
	Unknown OnlineSession; // 0xc8(0x08)
	Unknown ReferencedObjects; // 0xd0(0x10)
	int32_t MaxSpectators; // 0x310(0x04)
	int32_t MaxPlayers; // 0x314(0x04)
	int32_t MaxPartySize; // 0x318(0x04)
	Unknown MaxSplitscreensPerConnection; // 0x31c(0x01)
	Unknown bRequiresPushToTalk; // 0x31d(0x01)
	struct FName SessionName; // 0x320(0x08)
	Unknown PerInstanceSMData; // 0x550(0x10)
	int32_t NumCustomDataFloats; // 0x560(0x04)
	Unknown PerInstanceSMCustomData; // 0x568(0x10)
	Unknown bMergeCollision; // 0x578(0x01)
	int32_t InstancingRandomSeed; // 0x57c(0x04)
	int32_t InstanceStartCullDistance; // 0x580(0x04)
	int32_t InstanceEndCullDistance; // 0x584(0x04)
	int8_t CulldistanceType; // 0x588(0x01)
	float MinScreenSizeScale; // 0x58c(0x04)
	Unknown InstanceBodiesSplitRatio; // 0x590(0x01)
	Unknown InstanceReorderTable; // 0x598(0x10)
	int32_t NumPendingLightmaps; // 0x604(0x04)
	Unknown CachedMappings; // 0x608(0x10)
	Unknown SortedInstances; // 0x628(0x10)
	int32_t NumBuiltInstances; // 0x638(0x04)
	Unknown BuiltInstanceBounds; // 0x640(0x1c)
	Unknown UnbuiltInstanceBounds; // 0x65c(0x1c)
	Unknown UnbuiltInstanceBoundsList; // 0x678(0x10)
	Unknown bEnableDensityScaling; // 0x688(0x01)
	int32_t OcclusionLayerNumNodes; // 0x690(0x04)
	Unknown CacheMeshExtendedBounds; // 0x694(0x1c)
	Unknown bDisableCollision; // 0x6b0(0x01)
	int32_t InstanceCountToRender; // 0x6b4(0x04)
	struct FMulticastInlineDelegate OnReplayPauseEvent; // 0x6f0(0x10)
	struct FMulticastInlineDelegate OnReplayJumpEvent; // 0x700(0x10)
	struct FMulticastInlineDelegate OnReplayJumpCompleteEvent; // 0x710(0x10)
	struct FString PlayerCameraManagerClassName; // 0x7a8(0x10)
	struct FString SpectatorPawnClassName; // 0x7b8(0x10)
	struct FMulticastInlineDelegate ChangeViewModeDelegate; // 0x7c8(0x10)
	struct FMulticastInlineDelegate ChangeCameraTypeDelegate; // 0x7d8(0x10)
	struct FMulticastInlineDelegate ChangeCameraTypeByNetGuidDelegate; // 0x7e8(0x10)
	Unknown WidgetInfoArray; // 0x800(0x10)
	Unknown ReplayWidgetMap; // 0x810(0x50)
	Unknown KillcamComponent; // 0x8c0(0x08)
	Unknown TargetcamComponent; // 0x8c8(0x08)
	Unknown pTargetPlayerInRecording; // 0x8e0(0x08)
	struct FString AfterKillcamHUDClassName; // 0x8e8(0x10)
	Unknown AfterKillcamHUDClass; // 0x8f8(0x08)
	struct FString ReplayHUDClassName; // 0x910(0x10)
	Unknown ReplayHUDClass; // 0x920(0x08)
	float BaseTurnRate; // 0x380(0x04)
	float BaseLookUpRate; // 0x384(0x04)
	Unknown MovementComponent; // 0x388(0x08)
	Unknown CollisionComponent; // 0x390(0x08)
	Unknown MeshComponent; // 0x398(0x08)
	Unknown bAddDefaultMovementBindings; // 0x3a0(0x01)
	float Friction; // 0x28(0x04)
	Unknown FrictionCombineMode; // 0x2c(0x01)
	Unknown bOverrideFrictionCombineMode; // 0x2d(0x01)
	float Restitution; // 0x30(0x04)
	Unknown RestitutionCombineMode; // 0x34(0x01)
	Unknown bOverrideRestitutionCombineMode; // 0x35(0x01)
	float Density; // 0x38(0x04)
	float RaiseMassToPower; // 0x3c(0x04)
	float DestructibleDamageThresholdScale; // 0x40(0x04)
	Unknown PhysicalMaterialProperty; // 0x48(0x08)
	Unknown SurfaceType; // 0x50(0x01)
	float TireFrictionScale; // 0x54(0x04)
	Unknown TireFrictionScales; // 0x58(0x10)
	Unknown PCOwner; // 0x310(0x08)
	Unknown TransformComponent; // 0x318(0x08)
	float DefaultFOV; // 0x328(0x04)
	float DefaultOrthoWidth; // 0x330(0x04)
	float DefaultAspectRatio; // 0x338(0x04)
	Unknown CameraCache; // 0x380(0x660)
	Unknown LastFrameCameraCache; // 0x9e0(0x660)
	Unknown ViewTarget; // 0x1040(0x670)
	Unknown PendingViewTarget; // 0x16b0(0x670)
	Unknown CameraCachePrivate; // 0x1d50(0x660)
	Unknown LastFrameCameraCachePrivate; // 0x23b0(0x660)
	Unknown ModifierList; // 0x2a10(0x10)
	Unknown DefaultModifiers; // 0x2a20(0x10)
	float FreeCamDistance; // 0x2a30(0x04)
	Unknown FreeCamOffset; // 0x2a34(0x0c)
	Unknown ViewTargetOffset; // 0x2a40(0x0c)
	Unknown CameraLensEffects; // 0x2a60(0x10)
	Unknown CachedCameraShakeMod; // 0x2a70(0x08)
	Unknown AnimInstPool; // 0x2a78(0x40)
	Unknown PostProcess; // 0x2ab8(0x10)
	Unknown ActiveAnims; // 0x2ad8(0x10)
	Unknown FreeAnims; // 0x2ae8(0x10)
	Unknown AnimCameraActor; // 0x2af8(0x08)
	Unknown bIsOrthographic; // 0x2b00(0x01)
	Unknown bDefaultConstrainAspectRatio; // 0x2b00(0x01)
	Unknown bClientSimulatingViewTarget; // 0x2b00(0x01)
	Unknown bUseClientSideCameraUpdates; // 0x2b00(0x01)
	Unknown bGameCameraCutThisFrame; // 0x2b01(0x01)
	float ViewPitchMin; // 0x2b04(0x04)
	float ViewPitchMax; // 0x2b08(0x04)
	float ViewYawMin; // 0x2b0c(0x04)
	float ViewYawMax; // 0x2b10(0x04)
	float ViewRollMin; // 0x2b14(0x04)
	float ViewRollMax; // 0x2b18(0x04)
	float ServerUpdateCameraTimeout; // 0x2b20(0x04)
	Unknown SelfPlayerState; // 0x310(0x08)
	float Score; // 0x318(0x04)
	int32_t PlayerId; // 0x31c(0x04)
	Unknown Ping; // 0x320(0x01)
	Unknown bShouldUpdateReplicatedPing; // 0x322(0x01)
	Unknown bIsSpectator; // 0x322(0x01)
	Unknown bOnlySpectator; // 0x322(0x01)
	Unknown bIsABot; // 0x322(0x01)
	Unknown bIsInactive; // 0x322(0x01)
	Unknown bFromPreviousLevel; // 0x322(0x01)
	int32_t StartTime; // 0x324(0x04)
	Unknown EngineMessageClass; // 0x328(0x08)
	struct FString SavedNetworkAddress; // 0x338(0x10)
	Unknown UniqueID; // 0x348(0x28)
	Unknown PawnPrivate; // 0x378(0x08)
	struct FString PlayerNamePrivate; // 0x3f8(0x10)
	Unknown PrimitiveRenderMode; // 0x238(0x01)
	Unknown bTonemapPropagateAlpha; // 0x239(0x01)
	Unknown bUsePostProcessMaterial; // 0x239(0x01)
	Unknown bUseDirectionalLights; // 0x239(0x01)
	Unknown CaptureSource; // 0x23a(0x01)
	Unknown bCaptureEveryFrame; // 0x23b(0x01)
	Unknown bCaptureOnMovement; // 0x23b(0x01)
	Unknown bAlwaysPersistRenderingState; // 0x23c(0x01)
	Unknown HiddenComponents; // 0x240(0x10)
	Unknown HiddenActors; // 0x250(0x10)
	Unknown ShowOnlyComponents; // 0x260(0x10)
	Unknown ShowOnlyActors; // 0x270(0x10)
	float LODDistanceFactor; // 0x280(0x04)
	float MaxViewDistanceOverride; // 0x284(0x04)
	int32_t CaptureSortPriority; // 0x288(0x04)
	Unknown bUseRayTracingIfEnabled; // 0x28c(0x01)
	Unknown ShowFlagSettings; // 0x290(0x10)
	struct FString ProfilingEventName; // 0x2b0(0x10)
	Unknown ProjectionType; // 0x2d0(0x01)
	float FOVAngle; // 0x2d4(0x04)
	float OrthoWidth; // 0x2d8(0x04)
	Unknown TextureTarget; // 0x2e0(0x08)
	Unknown CompositeMode; // 0x2e8(0x01)
	Unknown PostProcessSettings; // 0x2f0(0x5c0)
	float PostProcess; // 0x8b0(0x04)
	Unknown bOverride_CustomNearClippingPlane; // 0x8b4(0x01)
	float CustomNearClippingPlane; // 0x8b8(0x04)
	Unknown bUseCustomProjectionMatrix; // 0x8bc(0x01)
	Unknown CustomProjectionMatrix; // 0x8c0(0x40)
	Unknown bEnableClipPlane; // 0x900(0x01)
	Unknown ClipPlaneBase; // 0x904(0x0c)
	Unknown ClipPlaneNormal; // 0x910(0x0c)
	Unknown bCameraCutThisFrame; // 0x91c(0x01)
	Unknown bConsiderUnrenderedOpaquePixelAsFullyTr; // 0x91c(0x01)
	Unknown bDisableFlipCopyGLES; // 0x920(0x01)
	Unknown ArrowColor; // 0x4b8(0x04)
	float ArrowSize; // 0x4bc(0x04)
	float ScreenSize; // 0x4c0(0x04)
	Unknown bIsScreenSizeScaled; // 0x4c4(0x01)
	Unknown bTreatAsASprite; // 0x4c4(0x01)
	Unknown CapsuleComponent; // 0x318(0x08)
	Unknown GoodSprite; // 0x320(0x08)
	Unknown BadSprite; // 0x328(0x08)
	Unknown bIsPIEPlayerStart; // 0x330(0x01)
	struct FName PlayerStartTag; // 0x338(0x08)
	float InitialSpeed; // 0xf0(0x04)
	float MaxSpeed; // 0xf4(0x04)
	Unknown bRotationFollowsVelocity; // 0xf8(0x01)
	Unknown bRotationRemainsVertical; // 0xf8(0x01)
	Unknown bShouldBounce; // 0xf8(0x01)
	Unknown bInitialVelocityInLocalSpace; // 0xf8(0x01)
	Unknown bForceSubStepping; // 0xf8(0x01)
	Unknown bSimulationEnabled; // 0xf8(0x01)
	Unknown bSweepCollision; // 0xf8(0x01)
	Unknown bIsHomingProjectile; // 0xf8(0x01)
	Unknown bBounceAngleAffectsFriction; // 0xf9(0x01)
	Unknown bIsSliding; // 0xf9(0x01)
	Unknown bInterpMovement; // 0xf9(0x01)
	Unknown bInterpRotation; // 0xf9(0x01)
	float PreviousHitTime; // 0xfc(0x04)
	Unknown PreviousHitNormal; // 0x100(0x0c)
	float ProjectileGravityScale; // 0x10c(0x04)
	float Buoyancy; // 0x110(0x04)
	float Bounciness; // 0x114(0x04)
	float Friction; // 0x118(0x04)
	float BounceVelocityStopSimulatingThr; // 0x11c(0x04)
	float MinFrictionFraction; // 0x120(0x04)
	struct FMulticastInlineDelegate OnProjectileBounce; // 0x128(0x10)
	struct FMulticastInlineDelegate OnProjectileStop; // 0x138(0x10)
	float HomingAccelerationMagnitude; // 0x148(0x04)
	Unknown HomingTargetComponent; // 0x14c(0x08)
	float MaxSimulationTimeStep; // 0x154(0x04)
	int32_t MaxSimulationIterations; // 0x158(0x04)
	int32_t BounceAdditionalIterations; // 0x15c(0x04)
	float InterpLocationTime; // 0x160(0x04)
	float InterpRotationTime; // 0x164(0x04)
	float InterpLocationMaxLagDistance; // 0x168(0x04)
	float InterpLocationSnapToTargetDistance; // 0x16c(0x04)
	Unknown bUseVSync; // 0x28(0x01)
	Unknown bIsSmoothFrameRate; // 0x29(0x01)
	Unknown bUseDynamicResolution; // 0x2a(0x01)
	uint32_t ResolutionSizeX; // 0x80(0x04)
	uint32_t ResolutionSizeY; // 0x84(0x04)
	uint32_t LastUserConfirmedResolutionSizeX; // 0x88(0x04)
	uint32_t LastUserConfirmedResolutionSizeY; // 0x8c(0x04)
	int32_t WindowPosX; // 0x90(0x04)
	int32_t WindowPosY; // 0x94(0x04)
	int32_t FullscreenMode; // 0x98(0x04)
	int32_t LastConfirmedFullscreenMode; // 0x9c(0x04)
	int32_t PreferredFullscreenMode; // 0xa0(0x04)
	uint32_t Version; // 0xa4(0x04)
	int32_t AudioQualityLevel; // 0xa8(0x04)
	int32_t LastConfirmedAudioQualityLevel; // 0xac(0x04)
	float FrameRateLimit; // 0xb0(0x04)
	float LobbyFrameRateLimit; // 0xb4(0x04)
	int32_t DesiredScreenWidth; // 0xbc(0x04)
	Unknown bUseDesiredScreenHeight; // 0xc0(0x01)
	int32_t DesiredScreenHeight; // 0xc4(0x04)
	int32_t LastUserConfirmedDesiredScreenWidth; // 0xc8(0x04)
	int32_t LastUserConfirmedDesiredScreenHeight; // 0xcc(0x04)
	float LastRecommendedScreenWidth; // 0xd0(0x04)
	float LastRecommendedScreenHeight; // 0xd4(0x04)
	float LastCPUBenchmarkResult; // 0xd8(0x04)
	float LastGPUBenchmarkResult; // 0xdc(0x04)
	Unknown LastCPUBenchmarkSteps; // 0xe0(0x10)
	Unknown LastGPUBenchmarkSteps; // 0xf0(0x10)
	struct FString LastCPUBrand; // 0x100(0x10)
	struct FString LastGPUBrand; // 0x110(0x10)
	int32_t LastInstallStorageType; // 0x120(0x04)
	int64_t LastTotalGraphicsMemory; // 0x128(0x08)
	float LastGPUBenchmarkMultiplier; // 0x130(0x04)
	Unknown bUseHDRDisplayOutput; // 0x134(0x01)
	int32_t HDRDisplayOutputNits; // 0x138(0x04)
	Unknown ShowHUD; // 0x13c(0x01)
	struct FMulticastInlineDelegate OnGameUserSettingsUINeedsUpdate; // 0x140(0x10)
	float CapsuleHalfHeight; // 0x4d0(0x04)
	float CapsuleRadius; // 0x4d4(0x04)
	Unknown ViewportConsole; // 0x40(0x08)
	Unknown DebugProperties; // 0x48(0x10)
	int32_t MaxSplitscreenPlayers; // 0x68(0x04)
	Unknown World; // 0x78(0x08)
	Unknown GameInstance; // 0x80(0x08)
	float TerminalVelocity; // 0x348(0x04)
	int32_t Priority; // 0x34c(0x04)
	float FluidFriction; // 0x350(0x04)
	Unknown bWaterVolume; // 0x354(0x01)
	Unknown bPhysicsOnContact; // 0x354(0x01)
	int32_t VisibilityCellSize; // 0x318(0x04)
	Unknown VisibilityAggressivyu; // 0x31c(0x01)
	Unknown bPrecomputeVisibility; // 0x31d(0x01)
	Unknown bPlaceCellsOnlyAlongCameraTracks; // 0x31d(0x01)
	Unknown bEnableWorldBoundsChecks; // 0x31d(0x01)
	Unknown bEnableNavigationSystem; // 0x31d(0x01)
	Unknown bEnableAISystem; // 0x31d(0x01)
	Unknown bEnableWorldComposition; // 0x31d(0x01)
	Unknown bUseClientSideLevelStreamingVolumes; // 0x31d(0x01)
	Unknown bEnableWorldOriginRebasing; // 0x31d(0x01)
	Unknown bWorldGravitySet; // 0x31e(0x01)
	Unknown bGlobalGravitySet; // 0x31e(0x01)
	Unknown bMinimizeBSPSections; // 0x31e(0x01)
	Unknown bForceNoPrecomputedLighting; // 0x31e(0x01)
	Unknown bHighPriorityLoading; // 0x31e(0x01)
	Unknown bHighPriorityLoadingLocal; // 0x31e(0x01)
	Unknown bOverrideDefaultBroadphaseSettings; // 0x31e(0x01)
	Unknown NavigationSystemConfig; // 0x320(0x08)
	Unknown NavigationSystemConfigOverride; // 0x328(0x08)
	float WorldToMeters; // 0x330(0x04)
	float KillZ; // 0x334(0x04)
	Unknown KillZDamageType; // 0x338(0x08)
	float WorldGravityZ; // 0x340(0x04)
	float GlobalGravityZ; // 0x344(0x04)
	Unknown DefaultPhysicsVolumeClass; // 0x348(0x08)
	Unknown PhysicsCollisionHandlerClass; // 0x350(0x08)
	Unknown DefaultGameMode; // 0x358(0x08)
	Unknown GameNetworkManagerClass; // 0x360(0x08)
	int32_t PackedLightAndShadowMapTextureSize; // 0x368(0x04)
	Unknown DefaultColorScale; // 0x36c(0x0c)
	float DefaultMaxDistanceFieldOcclusionDistance; // 0x378(0x04)
	float GlobalDistanceFieldViewDistance; // 0x37c(0x04)
	float DynamicIndirectShadowsSelfShadowingIntensity; // 0x380(0x04)
	Unknown DefaultReverbSettings; // 0x388(0x20)
	Unknown DefaultAmbientZoneSettings; // 0x3a8(0x24)
	float MonoCullingDistance; // 0x3cc(0x04)
	Unknown DefaultBaseSoundMix; // 0x3d0(0x08)
	float TimeDilation; // 0x3d8(0x04)
	float MatineeTimeDilation; // 0x3dc(0x04)
	float DemoPlayTimeDilation; // 0x3e0(0x04)
	float MinGlobalTimeDilation; // 0x3e4(0x04)
	float MaxGlobalTimeDilation; // 0x3e8(0x04)
	float MinUndilatedFrameTime; // 0x3ec(0x04)
	float MaxUndilatedFrameTime; // 0x3f0(0x04)
	Unknown BroadphaseSettings; // 0x3f4(0x40)
	Unknown Pauser; // 0x438(0x08)
	Unknown ReplicationViewers; // 0x440(0x10)
	Unknown AssetUserData; // 0x450(0x10)
	Unknown PauserPlayerState; // 0x460(0x08)
	int32_t MaxNumberOf; // 0x468(0x04)
	Unknown DefaultBookmarkClass; // 0x470(0x08)
	Unknown BookmarkArray; // 0x478(0x10)
	Unknown LastBookmarkClass; // 0x488(0x08)
	Unknown bUseInstancedStaticCollision; // 0x490(0x01)
	Unknown bDebug; // 0x28(0x01)
	Unknown bExclusive; // 0x28(0x01)
	Unknown Priority; // 0x2c(0x01)
	Unknown CameraOwner; // 0x30(0x08)
	float AlphaInTime; // 0x38(0x04)
	float AlphaOutTime; // 0x3c(0x04)
	float ALPHA; // 0x40(0x04)
	Unknown LightComponent; // 0x310(0x08)
	Unknown bEnabled; // 0x318(0x01)
	Unknown SubsurfaceProfile; // 0x38(0x08)
	Unknown LightmassSettings; // 0x50(0x10)
	Unknown TextureStreamingData; // 0x60(0x10)
	Unknown AssetUserData; // 0x70(0x10)
	Unknown PhysMaterial; // 0x88(0x08)
	Unknown PhysicalMaterialMap; // 0x90(0x40)
	Unknown Parent; // 0xd0(0x08)
	Unknown bHasStaticPermutationResource; // 0xd8(0x01)
	Unknown bOverrideSubsurfaceProfile; // 0xd8(0x01)
	Unknown ScalarParameterValues; // 0xe0(0x10)
	Unknown VectorParameterValues; // 0xf0(0x10)
	Unknown TextureParameterValues; // 0x100(0x10)
	Unknown RuntimeVirtualTextureParameterValues; // 0x110(0x10)
	Unknown FontParameterValues; // 0x120(0x10)
	Unknown BasePropertyOverrides; // 0x130(0x08)
	Unknown StaticParameters; // 0x148(0x40)
	Unknown CachedLayerParameters; // 0x188(0x1a0)
	Unknown CachedReferencedTextures; // 0x328(0x10)
	Unknown PhysMaterialMask; // 0x408(0x08)
	int32_t NumReplicatedProperties; // 0x2d0(0x04)
	Unknown bHasNativizedParent; // 0x2d4(0x01)
	Unknown bHasCookedComponentInstancingData; // 0x2d4(0x01)
	Unknown DynamicBindingObjects; // 0x2d8(0x10)
	Unknown ComponentTemplates; // 0x2e8(0x10)
	Unknown Timelines; // 0x2f8(0x10)
	Unknown ComponentClassOverrides; // 0x308(0x10)
	Unknown SimpleConstructionScript; // 0x318(0x08)
	Unknown InheritableComponentHandler; // 0x320(0x08)
	Unknown UberGraphFramePointerProperty; // 0x328(0x08)
	Unknown UberGraphFunction; // 0x338(0x08)
	Unknown CookedComponentInstancingData; // 0x340(0x50)
	Unknown AutoActivateForPlayer; // 0x310(0x01)
	Unknown CameraComponent; // 0x318(0x08)
	Unknown SceneComponent; // 0x320(0x08)
	Unknown bConstrainAspectRatio; // 0x330(0x01)
	float AspectRatio; // 0x334(0x04)
	float FOVAngle; // 0x338(0x04)
	float PostProcess; // 0x33c(0x04)
	Unknown PostProcessSettings; // 0x340(0x5c0)
	Unknown SoundClassObject; // 0x28(0x08)
	Unknown bDebug; // 0x30(0x01)
	Unknown bOverrideConcurrency; // 0x30(0x01)
	Unknown bOutputToBusOnly; // 0x30(0x01)
	Unknown bHasDelayNode; // 0x30(0x01)
	Unknown bHasConcatenatorNode; // 0x30(0x01)
	Unknown bBypassVolumeScaleForPriority; // 0x30(0x01)
	Unknown VirtualizationMode; // 0x31(0x01)
	Unknown ConcurrencySet; // 0x88(0x50)
	Unknown ConcurrencyOverrides; // 0xd8(0x20)
	float Duration; // 0xf8(0x04)
	float MaxDistance; // 0xfc(0x04)
	float TotalSamples; // 0x100(0x04)
	float Priority; // 0x104(0x04)
	Unknown AttenuationSettings; // 0x108(0x08)
	Unknown Modulation; // 0x110(0x10)
	Unknown SoundSubmixObject; // 0x120(0x08)
	Unknown SoundSubmixSends; // 0x128(0x10)
	Unknown SourceEffectChain; // 0x138(0x08)
	Unknown BusSends; // 0x140(0x10)
	Unknown PreEffectBusSends; // 0x150(0x10)
	int32_t CompressionQuality; // 0x160(0x04)
	int32_t StreamingPriority; // 0x164(0x04)
	Unknown SampleRateQuality; // 0x168(0x01)
	Unknown SoundGroup; // 0x16a(0x01)
	Unknown bLooping; // 0x16b(0x01)
	Unknown bStreaming; // 0x16b(0x01)
	Unknown bSeekableStreaming; // 0x16b(0x01)
	Unknown LoadingBehavior; // 0x16c(0x01)
	Unknown bMature; // 0x16d(0x01)
	Unknown bManualWordWrap; // 0x16d(0x01)
	Unknown bSingleLine; // 0x16d(0x01)
	Unknown bIsAmbisonics; // 0x16e(0x01)
	Unknown FrequenciesToAnalyze; // 0x170(0x10)
	Unknown CookedSpectralTimeData; // 0x180(0x10)
	Unknown CookedEnvelopeTimeData; // 0x190(0x10)
	int32_t InitialChunkSize; // 0x1a0(0x04)
	struct FString SpokenText; // 0x1e8(0x10)
	float SubtitlePriority; // 0x1f8(0x04)
	float Volume; // 0x1fc(0x04)
	float Pitch; // 0x200(0x04)
	int32_t NumChannels; // 0x204(0x04)
	int32_t SampleRate; // 0x208(0x04)
	Unknown Subtitles; // 0x218(0x10)
	Unknown Curves; // 0x228(0x08)
	Unknown InternalCurves; // 0x230(0x08)
	Unknown SkeletonGeneratedClass; // 0x28(0x08)
	Unknown GeneratedClass; // 0x30(0x08)
	Unknown bLegacyNeedToPurgeSkelRefs; // 0x38(0x01)
	Unknown BlueprintGuid; // 0x3c(0x10)
	Unknown ParentClass; // 0x50(0x08)
	Unknown BlueprintType; // 0x58(0x01)
	Unknown bRecompileOnLoad; // 0x59(0x01)
	Unknown bHasBeenRegenerated; // 0x59(0x01)
	Unknown bIsRegeneratingOnLoad; // 0x59(0x01)
	int32_t BlueprintSystemVersion; // 0x5c(0x04)
	Unknown SimpleConstructionScript; // 0x60(0x08)
	Unknown ComponentTemplates; // 0x68(0x10)
	Unknown Timelines; // 0x78(0x10)
	Unknown ComponentClassOverrides; // 0x88(0x10)
	Unknown InheritableComponentHandler; // 0x98(0x08)
	Unknown SelfChannel; // 0x30(0x08)
	Unknown Connection; // 0x38(0x08)
	Unknown SelfActorChannel; // 0xa0(0x08)
	Unknown Actor; // 0xa8(0x08)
	Unknown CreateSubObjects; // 0x198(0x10)
	Unknown Skeleton; // 0x38(0x08)
	Unknown MetaData; // 0x60(0x10)
	Unknown AssetUserData; // 0x70(0x10)
	Unknown bRotationBlendInMeshSpace; // 0x88(0x01)
	float AnimLength; // 0x8c(0x04)
	Unknown InterpolationParam; // 0x90(0x18)
	float TargetWeightInterpolationSpeedPerSec; // 0xa8(0x04)
	Unknown NotifyTriggerMode; // 0xac(0x01)
	Unknown PerBoneBlend; // 0xb0(0x10)
	int32_t SampleIndexWithMarkers; // 0xc0(0x04)
	Unknown SampleData; // 0xc8(0x10)
	Unknown GridSamples; // 0xd8(0x10)
	Unknown BlendParameters; // 0xe8(0x60)
	Unknown AxisToScaleAnimation; // 0x148(0x01)
	Unknown bScaleAnimation; // 0x148(0x01)
	Unknown AISystemClassName; // 0x28(0x18)
	struct FName AISystemModuleName; // 0x40(0x08)
	Unknown bInstantiateAISystemOnClient; // 0x50(0x01)
	Unknown AudioComponent; // 0x310(0x08)
	int32_t CompressCommandletVersion; // 0x38(0x04)
	Unknown KeyEndEffectorsMatchNameArray; // 0x40(0x10)
	Unknown ForceRecompression; // 0x50(0x01)
	Unknown bOnlyCheckForMissingSkeletalMeshes; // 0x51(0x01)
	Unknown bForceBelowThreshold; // 0x52(0x01)
	Unknown bFirstRecompressUsingCurrentOrDefault; // 0x53(0x01)
	Unknown bRaiseMaxErrorToExisting; // 0x54(0x01)
	Unknown bEnablePerformanceLog; // 0x55(0x01)
	Unknown bStripAnimationDataOnDedicatedServer; // 0x56(0x01)
	Unknown bTickAnimationOnSkeletalMeshInit; // 0x57(0x01)
	Unknown TargetSkeleton; // 0xa8(0x08)
	Unknown Groups; // 0xb0(0x10)
	Unknown bUseMultiThreadedAnimationUpdate; // 0xc0(0x01)
	Unknown bWarnAboutBlueprintUsage; // 0xc1(0x01)
	Unknown BakedStateMachines; // 0x3d0(0x10)
	Unknown TargetSkeleton; // 0x3e0(0x08)
	Unknown AnimNotifies; // 0x3e8(0x10)
	Unknown OrderedSavedPoseIndicesMap; // 0x3f8(0x50)
	Unknown SyncGroupNames; // 0x4c8(0x10)
	Unknown EvaluateGraphExposedInputs; // 0x4d8(0x10)
	Unknown GraphAssetPlayerInformation; // 0x4e8(0x50)
	Unknown GraphBlendOptions; // 0x538(0x50)
	struct FString Description; // 0x28(0x10)
	Unknown Codecs; // 0x28(0x10)
	Unknown BakedStateMachines; // 0x30(0x10)
	Unknown TargetSkeleton; // 0x40(0x08)
	Unknown AnimNotifies; // 0x48(0x10)
	Unknown OrderedSavedPoseIndicesMap; // 0x58(0x50)
	Unknown AnimBlueprintFunctions; // 0xa8(0x10)
	Unknown AnimBlueprintFunctionData; // 0xb8(0x10)
	Unknown AnimNodeProperties; // 0xc8(0x10)
	Unknown LinkedAnimGraphNodeProperties; // 0xe8(0x10)
	Unknown LinkedAnimLayerNodeProperties; // 0x108(0x10)
	Unknown PreUpdateNodeProperties; // 0x128(0x10)
	Unknown DynamicResetNodeProperties; // 0x148(0x10)
	Unknown StateMachineNodeProperties; // 0x168(0x10)
	Unknown InitializationNodeProperties; // 0x188(0x10)
	Unknown GraphNameAssetPlayers; // 0x1a8(0x50)
	Unknown SyncGroupNames; // 0x1f8(0x10)
	Unknown EvaluateGraphExposedInputs; // 0x208(0x10)
	Unknown GraphBlendOptions; // 0x218(0x50)
	Unknown Notifies; // 0x80(0x10)
	float SequenceLength; // 0x90(0x04)
	float RateScale; // 0x94(0x04)
	Unknown RawCurveData; // 0x98(0x10)
	Unknown AnimationTrack; // 0xa8(0x10)
	Unknown bNeedsSkeleton; // 0x38(0x01)
	Unknown TranslationCompressionFormat; // 0x3c(0x01)
	Unknown RotationCompressionFormat; // 0x3d(0x01)
	Unknown ScaleCompressionFormat; // 0x3e(0x01)
	float MaxPosDiff; // 0x40(0x04)
	float MaxAngleDiff; // 0x44(0x04)
	float MaxScaleDiff; // 0x48(0x04)
	float MaxEffectorDiff; // 0x4c(0x04)
	float MinEffectorDiff; // 0x50(0x04)
	float EffectorDiffSocket; // 0x54(0x04)
	float ParentKeyScale; // 0x58(0x04)
	Unknown bRetarget; // 0x5c(0x01)
	Unknown bActuallyFilterLinearKeys; // 0x5c(0x01)
	float MaxZeroingThreshold; // 0x60(0x04)
	float MaxPosDiffBitwise; // 0x64(0x04)
	float MaxAngleDiffBitwise; // 0x68(0x04)
	float MaxScaleDiffBitwise; // 0x6c(0x04)
	Unknown AllowedRotationFormats; // 0x70(0x10)
	Unknown AllowedTranslationFormats; // 0x80(0x10)
	Unknown AllowedScaleFormats; // 0x90(0x10)
	Unknown bResampleAnimation; // 0xa0(0x01)
	float ResampledFramerate; // 0xa4(0x04)
	int32_t MinKeysForResampling; // 0xa8(0x04)
	Unknown bUseAdaptiveError; // 0xac(0x01)
	Unknown bUseOverrideForEndEffectors; // 0xac(0x01)
	int32_t TrackHeight; // 0xb0(0x04)
	float ParentingDivisor; // 0xb4(0x04)
	float ParentingDivisorExponent; // 0xb8(0x04)
	Unknown bUseAdaptiveError2; // 0xbc(0x01)
	float RotationErrorSourceRatio; // 0xc0(0x04)
	float TranslationErrorSourceRatio; // 0xc4(0x04)
	float ScaleErrorSourceRatio; // 0xc8(0x04)
	float MaxErrorPerTrackRatio; // 0xcc(0x04)
	float PerturbationProbeSize; // 0xd0(0x04)
	int32_t MinKeys; // 0x40(0x04)
	Unknown bStartAtSecondKey; // 0x44(0x01)
	float MaxPosDiff; // 0x40(0x04)
	float MaxAngleDiff; // 0x44(0x04)
	float MaxScaleDiff; // 0x48(0x04)
	Unknown Codec; // 0x28(0x08)
	Unknown BlendIn; // 0xa8(0x30)
	float BlendInTime; // 0xd8(0x04)
	Unknown BlendOut; // 0xe0(0x30)
	float BlendOutTime; // 0x110(0x04)
	float BlendOutTriggerTime; // 0x114(0x04)
	struct FName SyncGroup; // 0x118(0x08)
	int32_t SyncSlotIndex; // 0x120(0x04)
	Unknown MarkerData; // 0x128(0x20)
	Unknown CompositeSections; // 0x148(0x10)
	Unknown SlotAnimTracks; // 0x158(0x10)
	Unknown BranchingPoints; // 0x168(0x10)
	Unknown bEnableRootMotionTranslation; // 0x178(0x01)
	Unknown bEnableRootMotionRotation; // 0x179(0x01)
	Unknown bEnableAuto; // 0x17a(0x01)
	Unknown RootMotionRootLock; // 0x17b(0x01)
	Unknown BranchingPointMarkers; // 0x180(0x10)
	Unknown BranchingPointStateNotifyIndices; // 0x190(0x10)
	Unknown TimeStretchCurve; // 0x1a0(0x28)
	struct FName TimeStretchCurveName; // 0x1c8(0x08)
	Unknown PSTemplate; // 0x38(0x08)
	Unknown LocationOffset; // 0x40(0x0c)
	Unknown RotationOffset; // 0x4c(0x0c)
	Unknown Scale; // 0x58(0x0c)
	Unknown Attached; // 0x80(0x01)
	struct FName SocketName; // 0x84(0x08)
	Unknown Sound; // 0x38(0x08)
	float VolumeMultiplier; // 0x40(0x04)
	float PitchMultiplier; // 0x44(0x04)
	Unknown bFollow; // 0x48(0x01)
	struct FName AttachName; // 0x4c(0x08)
	Unknown PSTemplate; // 0x30(0x08)
	struct FName SocketName; // 0x38(0x08)
	Unknown LocationOffset; // 0x40(0x0c)
	Unknown RotationOffset; // 0x4c(0x0c)
	Unknown bDestroyAtEnd; // 0x58(0x01)
	Unknown PSTemplate; // 0x30(0x08)
	struct FName FirstSocketName; // 0x38(0x08)
	struct FName SecondSocketName; // 0x40(0x08)
	Unknown WidthScaleMode; // 0x48(0x01)
	struct FName WidthScaleCurve; // 0x4c(0x08)
	Unknown bRecycleSpawnedSystems; // 0x54(0x01)
	int32_t NumFrames; // 0xa8(0x04)
	Unknown TrackToSkeletonMapTable; // 0xb0(0x10)
	Unknown BoneCompressionSettings; // 0xd0(0x08)
	Unknown CurveCompressionSettings; // 0xd8(0x08)
	Unknown AdditiveAnimType; // 0x150(0x01)
	Unknown RefPoseType; // 0x151(0x01)
	Unknown RefPoseSeq; // 0x158(0x08)
	int32_t RefFrameIndex; // 0x160(0x04)
	struct FName RetargetSource; // 0x164(0x08)
	Unknown Interpolation; // 0x16c(0x01)
	Unknown bEnableRootMotion; // 0x16d(0x01)
	Unknown RootMotionRootLock; // 0x16e(0x01)
	Unknown bForceRootLock; // 0x16f(0x01)
	Unknown bUseNormalizedRootMotionScale; // 0x170(0x01)
	Unknown bRootMotionSettingsCopiedFromMontage; // 0x171(0x01)
	Unknown AuthoredSyncMarkers; // 0x178(0x10)
	Unknown bAnimRotationOnly; // 0x28(0x01)
	Unknown TrackBoneNames; // 0x30(0x10)
	Unknown LinkupCache; // 0x40(0x10)
	Unknown BoneUseAnimTranslation; // 0x50(0x10)
	Unknown ForceUseMeshTranslation; // 0x60(0x10)
	Unknown UseTranslationBoneNames; // 0x70(0x10)
	Unknown ForceMeshTranslationBoneNames; // 0x80(0x10)
	struct FName PreviewSkelMeshName; // 0x90(0x08)
	struct FName BestRatioSkelMeshName; // 0x98(0x08)
	Unknown CurrentAsset; // 0x268(0x08)
	struct FDelegate PostEvaluateAnimEvent; // 0x270(0x10)
	int32_t NumFrames; // 0xa8(0x04)
	Unknown Interpolation; // 0xac(0x01)
	struct FName RetargetSource; // 0xb0(0x08)
	Unknown BoneCompressionSettings; // 0xc8(0x08)
	Unknown CurveCompressionSettings; // 0xd0(0x08)
	Unknown bEnableRootMotion; // 0xd8(0x01)
	Unknown RootMotionRootLock; // 0xd9(0x01)
	Unknown bForceRootLock; // 0xda(0x01)
	Unknown bUseNormalizedRootMotionScale; // 0xdb(0x01)
	Unknown Object; // 0x28(0x08)
	Unknown Exporter; // 0x30(0x08)
	struct FString Filename; // 0x38(0x10)
	Unknown bSelected; // 0x48(0x01)
	Unknown bReplaceIdentical; // 0x49(0x01)
	Unknown bPrompt; // 0x4a(0x01)
	Unknown bAutomated; // 0x4b(0x01)
	Unknown bUseFileArchive; // 0x4c(0x01)
	Unknown bWriteEmptyFiles; // 0x4d(0x01)
	Unknown IgnoreObjectList; // 0x50(0x10)
	Unknown options; // 0x60(0x08)
	Unknown Errors; // 0x68(0x10)
	Unknown PrimaryAssetTypesToScan; // 0x38(0x10)
	Unknown DirectoriesToExclude; // 0x48(0x10)
	Unknown PrimaryAssetRules; // 0x58(0x10)
	Unknown CustomPrimaryAssetRules; // 0x68(0x10)
	Unknown bOnlyCookProductionAssets; // 0x78(0x01)
	Unknown bShouldManagerDetermineTypeAndName; // 0x79(0x01)
	Unknown bShouldGuessTypeAndNameInEditor; // 0x7a(0x01)
	Unknown bShouldAcquireMissingChunksOnLoad; // 0x7b(0x01)
	Unknown PrimaryAssetIdRedirects; // 0x80(0x10)
	Unknown PrimaryAssetTypeRedirects; // 0x90(0x10)
	Unknown AssetPathRedirects; // 0xa0(0x10)
	Unknown MetaDataTagsForAssetRegistry; // 0xb0(0x50)
	Unknown bUsePathExcludedFromScan; // 0x100(0x01)
	Unknown bRemoveRedundantDirectroyChunks; // 0x101(0x01)
	Unknown MappedAssets; // 0x28(0x10)
	struct FMulticastInlineDelegate Completed; // 0x30(0x10)
	Unknown SaveGameObject; // 0x60(0x08)
	struct FMulticastInlineDelegate Completed; // 0x78(0x10)
	struct FMulticastInlineDelegate Completed; // 0x78(0x10)
	struct FMulticastInlineDelegate Completed; // 0x78(0x10)
	struct FMulticastInlineDelegate Completed; // 0x78(0x10)
	struct FMulticastInlineDelegate Completed; // 0x78(0x10)
	Unknown AtmosphericFogComponent; // 0x310(0x08)
	float SunMultiplier; // 0x238(0x04)
	float FogMultiplier; // 0x23c(0x04)
	float DensityMultiplier; // 0x240(0x04)
	float DensityOffset; // 0x244(0x04)
	float DistanceScale; // 0x248(0x04)
	float AltitudeScale; // 0x24c(0x04)
	float DistanceOffset; // 0x250(0x04)
	float GroundOffset; // 0x254(0x04)
	float StartDistance; // 0x258(0x04)
	float SunDiscScale; // 0x25c(0x04)
	float DefaultBrightness; // 0x260(0x04)
	Unknown DefaultLightColor; // 0x264(0x04)
	Unknown bDisableSunDisk; // 0x268(0x01)
	Unknown bAtmosphereAffectsSunIlluminance; // 0x268(0x01)
	Unknown bDisableGroundScattering; // 0x268(0x01)
	Unknown PrecomputeParams; // 0x26c(0x2c)
	Unknown TransmittanceTexture; // 0x298(0x08)
	Unknown IrradianceTexture; // 0x2a0(0x08)
	Unknown DefaultSoundClassName; // 0x38(0x18)
	Unknown DefaultMediaSoundClassName; // 0x50(0x18)
	Unknown DefaultSoundConcurrencyName; // 0x68(0x18)
	Unknown DefaultBaseSoundMix; // 0x80(0x18)
	Unknown VoiPSoundClass; // 0x98(0x18)
	Unknown MasterSubmix; // 0xb0(0x18)
	Unknown ReverbSubmix; // 0xc8(0x18)
	Unknown EQSubmix; // 0xe0(0x18)
	Unknown VoiPSampleRate; // 0xf8(0x04)
	float DefaultReverbSendLevel; // 0xfc(0x04)
	int32_t MaximumConcurrentStreams; // 0x100(0x04)
	float GlobalMinPitchScale; // 0x104(0x04)
	float GlobalMaxPitchScale; // 0x108(0x04)
	Unknown QualityLevels; // 0x110(0x10)
	Unknown bAllowPlayWhenSilent; // 0x120(0x01)
	Unknown bDisableMasterEQ; // 0x120(0x01)
	Unknown bAllowCenterChannel3DPanning; // 0x120(0x01)
	uint32_t NumStoppingSources; // 0x124(0x04)
	Unknown PanningMethod; // 0x128(0x01)
	Unknown MonoChannelUpmixMethod; // 0x129(0x01)
	struct FString DialogueFilenameFormat; // 0x130(0x10)
	float Priority; // 0x348(0x04)
	Unknown bEnabled; // 0x34c(0x01)
	Unknown Settings; // 0x350(0x20)
	Unknown AmbientZoneSettings; // 0x370(0x24)
	Unknown ActorsToPoll; // 0x38(0x10)
	Unknown EngineTestModules; // 0x28(0x10)
	Unknown EditorTestModules; // 0x38(0x10)
	Unknown AutomationTestmap; // 0x48(0x18)
	Unknown EditorPerformanceTestMaps; // 0x60(0x10)
	Unknown AssetsToOpen; // 0x70(0x10)
	Unknown BuildPromotionTest; // 0x80(0x1f0)
	Unknown MaterialEditorPromotionTest; // 0x270(0x30)
	Unknown ParticleEditorPromotionTest; // 0x2a0(0x10)
	Unknown BlueprintEditorPromotionTest; // 0x2b0(0x30)
	Unknown TestLevelFolders; // 0x2e0(0x10)
	Unknown ExternalTools; // 0x2f0(0x10)
	Unknown ImportExportTestDefinitions; // 0x300(0x10)
	Unknown LaunchOnSettings; // 0x310(0x10)
	Unknown DefaultScreenshotResolution; // 0x320(0x08)
	float DefaultTimeToLive; // 0x30(0x04)
	float LockTimeAfterAvoid; // 0x34(0x04)
	float LockTimeAfterClean; // 0x38(0x04)
	float DeltaTimeToPredict; // 0x3c(0x04)
	float ArtificialRadiusExpansion; // 0x40(0x04)
	float TestHeightDifference; // 0x44(0x04)
	float HeightCheckMargin; // 0x48(0x04)
	Unknown BandwidthGenerator; // 0x310(0x20)
	Unknown Sprite; // 0x4b8(0x08)
	Unknown bIsScreenSizeScaled; // 0x4c0(0x01)
	float ScreenSize; // 0x4c4(0x04)
	float U; // 0x4c8(0x04)
	float UL; // 0x4cc(0x04)
	float V; // 0x4d0(0x04)
	float VL; // 0x4d4(0x04)
	Unknown BoneTree; // 0x38(0x10)
	Unknown RefLocalPoses; // 0x48(0x10)
	Unknown VirtualBoneGuid; // 0x170(0x10)
	Unknown VirtualBones; // 0x180(0x10)
	Unknown Sockets; // 0x190(0x10)
	Unknown SmartNames; // 0x1f0(0x50)
	Unknown BlendProfiles; // 0x270(0x10)
	Unknown SlotGroups; // 0x280(0x10)
	Unknown AssetUserData; // 0x358(0x10)
	Unknown OwningSkeleton; // 0x30(0x08)
	Unknown ProfileEntries; // 0x38(0x10)
	struct FMulticastInlineDelegate ApplicationWillDeactivateDelegate; // 0x218(0x10)
	struct FMulticastInlineDelegate ApplicationHasReactivatedDelegate; // 0x228(0x10)
	struct FMulticastInlineDelegate ApplicationWillEnterBackgroundDelegate; // 0x238(0x10)
	struct FMulticastInlineDelegate ApplicationHasEnteredForegroundDelegate; // 0x248(0x10)
	struct FMulticastInlineDelegate ApplicationWillTerminateDelegate; // 0x258(0x10)
	struct FMulticastInlineDelegate ApplicationShouldUnloadResourcesDelegate; // 0x268(0x10)
	struct FMulticastInlineDelegate ApplicationReceivedStartupArgumentsDelegate; // 0x278(0x10)
	struct FMulticastInlineDelegate ApplicationRegisteredForRemoteNotificationsDelegate; // 0x288(0x10)
	struct FMulticastInlineDelegate ApplicationRegisteredForUserNotificationsDelegate; // 0x298(0x10)
	struct FMulticastInlineDelegate ApplicationFailedToRegisterForRemoteNotificationsDelegate; // 0x2a8(0x10)
	struct FMulticastInlineDelegate ApplicationReceivedRemoteNotificationDelegate; // 0x2b8(0x10)
	struct FMulticastInlineDelegate ApplicationReceivedLocalNotification; // 0x2c8(0x10)
	struct FMulticastInlineDelegate ApplicationReceivedScreenOrientationnDelegat; // 0x2d8(0x10)
	Unknown AggGeom; // 0x28(0x58)
	struct FName BoneName; // 0x80(0x08)
	Unknown PhysicsType; // 0x88(0x01)
	Unknown bAlwaysFullAnimWeight; // 0x89(0x01)
	Unknown bConsiderForBounds; // 0x89(0x01)
	Unknown bMeshCollideAll; // 0x89(0x01)
	Unknown bDoubleSidedGeometry; // 0x89(0x01)
	Unknown bGenerateNonMirroredCollision; // 0x89(0x01)
	Unknown bSharedCookedData; // 0x89(0x01)
	Unknown bGenerateMirroredCollision; // 0x89(0x01)
	Unknown bSupportUVsAndFaceRemap; // 0x89(0x01)
	Unknown CollisionReponse; // 0x8b(0x01)
	Unknown CollisionTraceFlag; // 0x8c(0x01)
	Unknown PhysMaterial; // 0x90(0x08)
	Unknown WalkableSlopeOverride; // 0x98(0x10)
	Unknown DefaultInstance; // 0x120(0x190)
	Unknown BuildScale3D; // 0x2b8(0x0c)
	Unknown BlendPoses; // 0x28(0x10)
	Unknown Location; // 0x28(0x0c)
	Unknown Rotation; // 0x34(0x0c)
	Unknown HiddenLevels; // 0x40(0x10)
	float Zoom2D; // 0x28(0x04)
	Unknown Location; // 0x2c(0x08)
	Unknown CaptureComponent; // 0x310(0x08)
	Unknown VisualizationMesh; // 0x238(0x08)
	Unknown CaptureOffsetComponent; // 0x240(0x08)
	Unknown ReflectionSourceType; // 0x248(0x01)
	Unknown Cubemap; // 0x250(0x08)
	float SourceCubemapAngle; // 0x258(0x04)
	float Brightness; // 0x25c(0x04)
	float DiffuseRadiance; // 0x260(0x04)
	Unknown CaptureOffset; // 0x264(0x0c)
	Unknown MapBuildDataId; // 0x270(0x10)
	float BoxTransitionDistance; // 0x2c0(0x04)
	Unknown PreviewInfluenceBox; // 0x2c8(0x08)
	Unknown PreviewCaptureBox; // 0x2d0(0x08)
	Unknown bEnabled; // 0x28(0x01)
	Unknown Node; // 0x30(0x08)
	Unknown bStepOnce; // 0x38(0x01)
	Unknown bStepOnce_WasPreviouslyDisabled; // 0x38(0x01)
	Unknown bStepOnce_RemoveAfterHit; // 0x38(0x01)
	struct FString BitmapFilename; // 0x28(0x10)
	struct FString Tooltip; // 0x38(0x10)
	Unknown NotifyBadParams; // 0x48(0x01)
	Unknown Vertices; // 0x50(0x10)
	Unknown Polys; // 0x60(0x10)
	struct FName Layer; // 0x70(0x08)
	Unknown MergeCoplanars; // 0x78(0x01)
	Unknown Brush; // 0x4b8(0x08)
	Unknown BrushBodySetup; // 0x4c0(0x08)
	Unknown ButtonStyle; // 0x28(0x278)
	Unknown CameraInterpGroup; // 0x28(0x08)
	float AnimLength; // 0x30(0x04)
	Unknown BoundingBox; // 0x34(0x1c)
	Unknown bRelativeToInitialTransform; // 0x50(0x01)
	Unknown bRelativeToInitialFOV; // 0x50(0x01)
	float BaseFOV; // 0x54(0x04)
	Unknown BasePostProcessSettings; // 0x60(0x5c0)
	float BasePostProcessBlendWeight; // 0x620(0x04)
	Unknown CamAnim; // 0x28(0x08)
	Unknown InterpGroupInst; // 0x30(0x08)
	float PlayRate; // 0x50(0x04)
	Unknown MoveTrack; // 0x68(0x08)
	Unknown MoveInst; // 0x70(0x08)
	Unknown PlaySpace; // 0x78(0x01)
	Unknown ActiveShakes; // 0x48(0x10)
	Unknown ExpiredPooledShakesMap; // 0x58(0x50)
	float SplitScreenShakeScale; // 0xa8(0x04)
	Unknown bSingleInstance; // 0x28(0x01)
	float OscillationDuration; // 0x2c(0x04)
	float Oscillation; // 0x30(0x04)
	float OscillationBuration; // 0x34(0x04)
	Unknown RotOscillation; // 0x38(0x24)
	Unknown LocOscillation; // 0x5c(0x24)
	Unknown FOVOscillation; // 0x80(0x0c)
	float AnimPlayRate; // 0x8c(0x04)
	float AnimScale; // 0x90(0x04)
	float AnimBlendInTime; // 0x94(0x04)
	float AnimBlendOutTime; // 0x98(0x04)
	float RandomAnimSegmentDuration; // 0x9c(0x04)
	Unknown Anim; // 0xa0(0x08)
	Unknown bRandomAnimSegment; // 0xa8(0x01)
	Unknown CameraOwner; // 0xc0(0x08)
	float ShakeScale; // 0x148(0x04)
	float OscillatorTimeRemaining; // 0x14c(0x04)
	Unknown AnimInst; // 0x150(0x08)
	Unknown CameraShakeSourceComponent; // 0x310(0x08)
	Unknown Attenuation; // 0x238(0x01)
	float InnerAttenuationRadius; // 0x23c(0x04)
	float OuterAttenuationRadius; // 0x240(0x04)
	Unknown CameraShake; // 0x248(0x08)
	Unknown bAutoPlay; // 0x250(0x01)
	float OrgX; // 0x28(0x04)
	float OrgY; // 0x2c(0x04)
	float ClipX; // 0x30(0x04)
	float ClipY; // 0x34(0x04)
	Unknown DrawColor; // 0x38(0x04)
	Unknown bCenterX; // 0x3c(0x01)
	Unknown bCenterY; // 0x3c(0x01)
	Unknown bNoSmooth; // 0x3c(0x01)
	int32_t SizeX; // 0x40(0x04)
	int32_t SizeY; // 0x44(0x04)
	Unknown ColorModulate; // 0x50(0x10)
	Unknown DefaultTexture; // 0x60(0x08)
	Unknown GradientTexture0; // 0x68(0x08)
	Unknown ReporterGraph; // 0x70(0x08)
	float TargetGamma; // 0xb8(0x04)
	int32_t SizeX; // 0xc0(0x04)
	int32_t SizeY; // 0xc4(0x04)
	Unknown ClearColor; // 0xc8(0x10)
	Unknown AddressX; // 0xd8(0x01)
	Unknown AddressY; // 0xd9(0x01)
	Unknown bForceLinearGamma; // 0xda(0x01)
	Unknown bHDR; // 0xda(0x01)
	Unknown bGPUSharedFlag; // 0xda(0x01)
	Unknown RenderTargetFormat; // 0xdb(0x01)
	Unknown bAutoGenerateMips; // 0xdc(0x01)
	Unknown MipsSamplerFilter; // 0xdd(0x01)
	Unknown MipsAddressU; // 0xde(0x01)
	Unknown MipsAddressV; // 0xdf(0x01)
	Unknown OverrideFormat; // 0xe0(0x01)
	struct FMulticastInlineDelegate OnCanvasRenderTargetUpdate; // 0xe8(0x10)
	Unknown World; // 0xf8(0x08)
	Unknown bShouldClearRenderTargetOnReceiveUpdate; // 0x100(0x01)
	float Friction; // 0x28(0x04)
	float StaticFriction; // 0x2c(0x04)
	float Restitution; // 0x30(0x04)
	float LinearEtherDrag; // 0x34(0x04)
	float AngularEtherDrag; // 0x38(0x04)
	float SleepingLinearVelocityThreshold; // 0x3c(0x04)
	float SleepingAngularVelocityThreshold; // 0x40(0x04)
	Unknown CheckBoxStyle; // 0x28(0x580)
	Unknown ChildActorClass; // 0x238(0x08)
	Unknown ChildActor; // 0x240(0x08)
	Unknown ChildActorTemplate; // 0x248(0x08)
	Unknown Parent; // 0x1aa0(0x08)
	Unknown AllDelegates; // 0x28(0x10)
	Unknown LocalCloudFiles; // 0x38(0x10)
	Unknown bSuppressDelegateCalls; // 0x48(0x01)
	Unknown Profiles; // 0x38(0x10)
	Unknown DefaultChannelResponses; // 0x48(0x10)
	Unknown EditProfiles; // 0x58(0x10)
	Unknown ProfileRedirects; // 0x68(0x10)
	Unknown CollisionChannelRedirects; // 0x78(0x10)
	Unknown ComponentDelegateBindings; // 0x28(0x10)
	Unknown ParentTables; // 0xa0(0x10)
	Unknown OldParentTables; // 0xb0(0x10)
	Unknown RowStruct; // 0x28(0x08)
	Unknown bStripFromClientBuilds; // 0x80(0x01)
	Unknown bIgnoreExtraFields; // 0x80(0x01)
	Unknown bIgnoreMissingFields; // 0x80(0x01)
	struct FString ImportKeyField; // 0x88(0x10)
	Unknown ParentTables; // 0xc8(0x10)
	Unknown OldParentTables; // 0xd8(0x10)
	Unknown ConsoleTargetPlayer; // 0x38(0x08)
	Unknown DefaultTexture_Black; // 0x40(0x08)
	Unknown DefaultTexture_White; // 0x48(0x08)
	Unknown HistoryBuffer; // 0x68(0x10)
	Unknown AsyncLoadingThreadEnabled; // 0x38(0x01)
	Unknown AsyncPostLoadEnabled; // 0x38(0x01)
	Unknown WarnIfTimeLimitExceeded; // 0x38(0x01)
	float TimeLimitExceededMultiplier; // 0x3c(0x04)
	float TimeLimitExceededMinTime; // 0x40(0x04)
	int32_t MinBulkDataSizeForAsyncLoading; // 0x44(0x04)
	Unknown UseBackgroundLevelStreaming; // 0x48(0x01)
	Unknown AsyncLoadingUseFullTimeLimit; // 0x48(0x01)
	float AsyncLoadingTimeLimit; // 0x4c(0x04)
	float PriorityAsyncLoadingExtraTime; // 0x50(0x04)
	float LevelStreamingActorsUpdateTimeLimit; // 0x54(0x04)
	float PriorityLevelStreamingActorsUpdateExtraTime; // 0x58(0x04)
	int32_t LevelStreamingComponentsRegistr; // 0x5c(0x04)
	float LevelStreamingUnregisterC; // 0x60(0x04)
	int32_t LevelStreamingComponentsUnregistrationGranularity; // 0x64(0x04)
	Unknown FlushStreamingOnExit; // 0x68(0x01)
	Unknown EventDrivenLoaderEnabled; // 0x68(0x01)
	float TimeBetweenPurgingPendingKillObjects; // 0x38(0x04)
	Unknown FlushStreamingOnGC; // 0x3c(0x01)
	Unknown AllowParallelGC; // 0x3c(0x01)
	Unknown Incremental; // 0x3c(0x01)
	Unknown MultithreadedDestructionEnabled; // 0x3c(0x01)
	Unknown CreateGCClusters; // 0x3c(0x01)
	Unknown AssetClusteringEnabled; // 0x3c(0x01)
	Unknown ActorClusteringEnabled; // 0x3c(0x01)
	Unknown BlueprintClusteringEnabled; // 0x3c(0x01)
	Unknown UseDisregardForGCOnDedicatedSer; // 0x3d(0x01)
	int32_t MinGCClusterSize; // 0x40(0x04)
	int32_t NumRetriesBeforeForcingGC; // 0x44(0x04)
	int32_t MaxObjectsNotConsideredByGC; // 0x48(0x04)
	int32_t SizeOfPermanentObjectPool; // 0x4c(0x04)
	int32_t MaxObjectsInGame; // 0x50(0x04)
	int32_t MaxObjectsInEditor; // 0x54(0x04)
	Unknown CullDistances; // 0x348(0x10)
	Unknown bEnabled; // 0x358(0x01)
	Unknown FloatCurve; // 0x30(0x80)
	Unknown bIsEventCurve; // 0xb0(0x01)
	Unknown FloatCurves; // 0x30(0x200)
	float AdjustHue; // 0x230(0x04)
	float AdjustSaturation; // 0x234(0x04)
	float AdjustBrightness; // 0x238(0x04)
	float AdjustBrightnessCurve; // 0x23c(0x04)
	float AdjustVibrance; // 0x240(0x04)
	float AdjustMinAlpha; // 0x244(0x04)
	float AdjustMaxAlpha; // 0x248(0x04)
	int32_t LevelIndex; // 0xb8(0x04)
	int32_t FirstResourceMemMip; // 0xbc(0x04)
	Unknown bTemporarilyDisableStreaming; // 0xc0(0x01)
	Unknown AddressX; // 0xc1(0x01)
	Unknown AddressY; // 0xc2(0x01)
	Unknown ImportedSize; // 0xc4(0x08)
	uint32_t TextureSize; // 0xe8(0x04)
	Unknown GradientCurves; // 0xf0(0x10)
	Unknown FloatCurves; // 0x30(0x180)
	Unknown bShowSelectedInfo; // 0x6f0(0x01)
	Unknown bIsFrozenRendering; // 0x6f0(0x01)
	Unknown bOverrideInitialMaxSpeed; // 0x6f0(0x01)
	float OverrideInitialMaxSpeed; // 0x6f4(0x04)
	Unknown bIsOrbitingSelectedActor; // 0x6f8(0x01)
	Unknown bOrbitPivotUseCenter; // 0x6f8(0x01)
	Unknown bEnableBufferVisualization; // 0x6f8(0x01)
	Unknown bEnableBufferVisualizationFullMode; // 0x6f8(0x01)
	Unknown bIsBufferVisualizationInputSetup; // 0x6f8(0x01)
	Unknown bLastDisplayEnabled; // 0x6f8(0x01)
	Unknown DrawFrustum; // 0x700(0x08)
	Unknown SelectedActor; // 0x708(0x08)
	Unknown SelectedComponent; // 0x710(0x08)
	Unknown SelectedHitPoint; // 0x718(0x88)
	Unknown OriginalControllerRef; // 0x7a0(0x08)
	Unknown OriginalPlayer; // 0x7a8(0x08)
	float SpeedScale; // 0x7b0(0x04)
	float InitialMaxSpeed; // 0x7b4(0x04)
	float InitialAccel; // 0x7b8(0x04)
	float InitialDecel; // 0x7bc(0x04)
	Unknown CycleViewModes; // 0x38(0x10)
	Unknown Decal; // 0x310(0x08)
	Unknown DecalMaterial; // 0x238(0x08)
	int32_t SortOrder; // 0x240(0x04)
	float FadeScreenSize; // 0x244(0x04)
	float FadeStartDelay; // 0x248(0x04)
	float FadeDuration; // 0x24c(0x04)
	float FadeInDuration; // 0x250(0x04)
	float FadeInStartDelay; // 0x254(0x04)
	Unknown bDestroyOwnerAfterFade; // 0x258(0x01)
	Unknown DecalSize; // 0x25c(0x0c)
	Unknown SelfDemoNetConnection; // 0x1be8(0x08)
	Unknown NetDriver; // 0x30(0x08)
	Unknown DemoNetDriver; // 0x38(0x08)
	Unknown TextureLODGroups; // 0x28(0x10)
	struct FString DeviceType; // 0x38(0x10)
	struct FString BaseProfileName; // 0x48(0x10)
	Unknown Parent; // 0x58(0x08)
	Unknown CVars; // 0x78(0x10)
	Unknown Profiles; // 0x28(0x10)
	Unknown gender; // 0x28(0x01)
	Unknown Plurality; // 0x29(0x01)
	Unknown LocalizationGUID; // 0x2c(0x10)
	Unknown bMature; // 0x28(0x01)
	Unknown bOverride_SubtitleOverride; // 0x28(0x01)
	struct FString SpokenText; // 0x30(0x10)
	struct FString SubtitleOverride; // 0x40(0x10)
	Unknown ContextMappings; // 0x50(0x10)
	Unknown LocalizationGUID; // 0x60(0x10)
	Unknown LightComponent; // 0x310(0x08)
	Unknown bEnabled; // 0x318(0x01)
	Unknown LightGuid; // 0x238(0x10)
	float Brightness; // 0x248(0x04)
	float Intensity; // 0x24c(0x04)
	Unknown LightColor; // 0x250(0x04)
	Unknown bAffectsWorld; // 0x254(0x01)
	Unknown CastShadows; // 0x254(0x01)
	Unknown CastStaticShadows; // 0x254(0x01)
	Unknown CastDynamicShadows; // 0x254(0x01)
	Unknown bAffectTranslucentLighting; // 0x254(0x01)
	Unknown bTransmission; // 0x254(0x01)
	Unknown bCastVolumetricShadow; // 0x254(0x01)
	Unknown bCastDeepShadow; // 0x254(0x01)
	Unknown bCastRaytracedShadow; // 0x255(0x01)
	Unknown bAffectReflection; // 0x255(0x01)
	Unknown bAffectGlobalIllumination; // 0x255(0x01)
	float IndirectLightingIntensity; // 0x258(0x04)
	float VolumetricScatteringIntensity; // 0x25c(0x04)
	float VolumetricAttenuationScale; // 0x260(0x04)
	float VolumetricSourceRadiusScale; // 0x264(0x04)
	int32_t SamplesPerPixel; // 0x268(0x04)
	float Temperature; // 0x270(0x04)
	float MaxDrawDistance; // 0x274(0x04)
	float MaxDistanceFadeRange; // 0x278(0x04)
	Unknown bUseTemperature; // 0x27c(0x01)
	int32_t ShadowMapChannel; // 0x280(0x04)
	float MinRoughness; // 0x288(0x04)
	float SpecularScale; // 0x28c(0x04)
	float ShadowResolutionScale; // 0x290(0x04)
	float ShadowBias; // 0x294(0x04)
	float ShadowSlope; // 0x298(0x04)
	float ShadowSharpen; // 0x29c(0x04)
	float ContactShadowLength; // 0x2a0(0x04)
	Unknown ContactShadowLengthInWS; // 0x2a4(0x01)
	float ContactShadowStartDistance; // 0x2a8(0x04)
	float ContactShadowFadeDistance; // 0x2ac(0x04)
	float ShadowStrength; // 0x2b0(0x04)
	float TranslucentShadowDensity; // 0x2b4(0x04)
	Unknown InverseSquaredFalloff; // 0x2b8(0x01)
	Unknown CastTranslucentShadows; // 0x2b8(0x01)
	Unknown bCastShadowsFromCinematicObjectsOnly; // 0x2b8(0x01)
	Unknown bAffectDynamicIndirectLighting; // 0x2b8(0x01)
	Unknown bForceCachedShadowsFromMovablePrimitivesAsStatic; // 0x2b8(0x01)
	Unknown bForceCachedShadowsForMovablePr; // 0x2b8(0x01)
	Unknown LightingChannels; // 0x2bc(0x01)
	Unknown LightFunctionMaterial; // 0x2c0(0x08)
	Unknown LightFunctionScale; // 0x2c8(0x0c)
	Unknown IESTexture; // 0x2d8(0x08)
	Unknown bUseIESBrightness; // 0x2e0(0x01)
	float IESBrightnessScale; // 0x2e4(0x04)
	float LightFunctionFadeDistance; // 0x2e8(0x04)
	float DisabledBrightness; // 0x2ec(0x04)
	Unknown bEnableLightShaftBloom; // 0x2f0(0x01)
	float BloomScale; // 0x2f4(0x04)
	float BloomThreshold; // 0x2f8(0x04)
	float BloomMaxBrightness; // 0x2fc(0x04)
	Unknown BloomTint; // 0x300(0x04)
	Unknown bUseFoliageLighting; // 0x304(0x01)
	Unknown bUseRayTracedDistanceFieldShadows; // 0x305(0x01)
	float RayStartOffsetDepthScale; // 0x308(0x04)
	float ShadowCascadeBiasDistribution; // 0x380(0x04)
	Unknown bEnableLightShaftOcclusion; // 0x384(0x01)
	float OcclusionMaskDarkness; // 0x388(0x04)
	float OcclusionDepthRange; // 0x38c(0x04)
	Unknown LightShaftOverrideDirection; // 0x390(0x0c)
	float WholeSceneDynamicShadowRadius; // 0x39c(0x04)
	float DynamicShadowDistanceMovableLight; // 0x3a0(0x04)
	float DynamicShadowDistanceStationaryLight; // 0x3a4(0x04)
	int32_t DynamicShadowCascades; // 0x3a8(0x04)
	float CascadeDistributionExponent; // 0x3ac(0x04)
	float CascadeTransitionFraction; // 0x3b0(0x04)
	float ShadowDistanceFadeoutFraction; // 0x3b4(0x04)
	Unknown bUseInsetShadowsForMovableObj; // 0x3b8(0x01)
	int32_t FarShadowCascadeCount; // 0x3bc(0x04)
	float FarShadowDistance; // 0x3c0(0x04)
	Unknown bUseFarShadowAsStaticWorldShadow; // 0x3c4(0x01)
	float DistanceFieldShadowDistance; // 0x3c8(0x04)
	float LightSourceAngle; // 0x3cc(0x04)
	float LightSourceSoftAngle; // 0x3d0(0x04)
	float TraceDistance; // 0x3d4(0x04)
	Unknown LightmassSettings; // 0x3d8(0x10)
	Unknown bCastModulatedShadows; // 0x3e8(0x01)
	Unknown ModulatedShadowColor; // 0x3ec(0x04)
	float ShadowAmount; // 0x3f0(0x04)
	Unknown bUsedAsAtmosphereSunLight; // 0x3f4(0x01)
	int32_t AtmosphereSunLightIndex; // 0x3f8(0x04)
	Unknown bCanBeBaked; // 0x30(0x01)
	Unknown bBakedDataSuccesfully; // 0x30(0x01)
	float Constant; // 0x38(0x04)
	Unknown ConstantCurve; // 0x38(0x18)
	struct FName ParameterName; // 0x40(0x08)
	float MinInput; // 0x48(0x04)
	float MaxInput; // 0x4c(0x04)
	float MinOutput; // 0x50(0x04)
	float MaxOutput; // 0x54(0x04)
	Unknown ParamMode; // 0x58(0x01)
	float Min; // 0x38(0x04)
	float MAX; // 0x3c(0x04)
	Unknown ConstantCurve; // 0x38(0x18)
	Unknown bCanBeBaked; // 0x30(0x01)
	Unknown bIsDirty; // 0x30(0x01)
	Unknown bBakedDataSuccesfully; // 0x30(0x01)
	Unknown Constant; // 0x38(0x0c)
	Unknown bLockAxes; // 0x44(0x01)
	Unknown LockedAxes; // 0x48(0x01)
	Unknown ConstantCurve; // 0x38(0x18)
	Unknown bLockAxes; // 0x50(0x01)
	Unknown LockedAxes; // 0x54(0x01)
	struct FName ParameterName; // 0x50(0x08)
	Unknown MinInput; // 0x58(0x0c)
	Unknown MaxInput; // 0x64(0x0c)
	Unknown MinOutput; // 0x70(0x0c)
	Unknown MaxOutput; // 0x7c(0x0c)
	Unknown ParamModes; // 0x88(0x03)
	Unknown MAX; // 0x38(0x0c)
	Unknown Min; // 0x44(0x0c)
	Unknown bLockAxes; // 0x50(0x01)
	Unknown LockedAxes; // 0x54(0x01)
	Unknown MirrorFlags; // 0x55(0x03)
	Unknown bUseExtremes; // 0x58(0x01)
	Unknown ConstantCurve; // 0x38(0x18)
	Unknown bLockAxes1; // 0x50(0x01)
	Unknown bLockAxes2; // 0x50(0x01)
	Unknown LockedAxes; // 0x54(0x02)
	Unknown MirrorFlags; // 0x56(0x03)
	Unknown bUseExtremes; // 0x5c(0x01)
	Unknown FrustumColor; // 0x4b8(0x04)
	float FrustumAngle; // 0x4bc(0x04)
	float FrustumAspectRatio; // 0x4c0(0x04)
	float FrustumStartDist; // 0x4c4(0x04)
	float FrustumEndDist; // 0x4c8(0x04)
	Unknown Texture; // 0x4d0(0x08)
	float SphereRadius; // 0x4d0(0x04)
	Unknown Schema; // 0x28(0x08)
	Unknown Nodes; // 0x30(0x10)
	Unknown bEditable; // 0x40(0x01)
	Unknown bAllowDeletion; // 0x40(0x01)
	Unknown bAllowRenaming; // 0x40(0x01)
	Unknown Blueprint; // 0x28(0x08)
	Unknown Graph; // 0x30(0x08)
	Unknown Node; // 0x38(0x08)
	Unknown bIsDebugging; // 0x48(0x01)
	Unknown DeprecatedPins; // 0x38(0x10)
	int32_t NodePosX; // 0x48(0x04)
	int32_t NodePosY; // 0x4c(0x04)
	int32_t NodeWidth; // 0x50(0x04)
	int32_t NodeHeight; // 0x54(0x04)
	Unknown AdvancedPinDisplay; // 0x58(0x01)
	Unknown EnabledState; // 0x59(0x01)
	Unknown bDisplayAsDisabled; // 0x5b(0x01)
	Unknown bUserSetEnabledState; // 0x5b(0x01)
	Unknown bIsNodeEnabled; // 0x5b(0x01)
	Unknown bHasCompilerMessage; // 0x5b(0x01)
	struct FString NodeComment; // 0x60(0x10)
	int32_t ErrorType; // 0x70(0x04)
	struct FString ErrorMsg; // 0x78(0x10)
	Unknown NodeGuid; // 0x88(0x10)
	struct FString Link; // 0x98(0x10)
	struct FString Excerpt; // 0xa8(0x10)
	struct FString PinName; // 0x28(0x10)
	struct FString PinToolTip; // 0x38(0x10)
	Unknown Direction; // 0x48(0x01)
	Unknown PinType; // 0x50(0x58)
	struct FString DefaultValue; // 0xa8(0x10)
	struct FString AutogeneratedDefaultValue; // 0xb8(0x10)
	Unknown DefaultObject; // 0xc8(0x08)
	struct FText DefaultTextValue; // 0xd0(0x18)
	Unknown LinkedTo; // 0xe8(0x10)
	Unknown SubPins; // 0xf8(0x10)
	Unknown ParentPin; // 0x108(0x08)
	Unknown ReferencePassThroughConnection; // 0x110(0x08)
	Unknown ParticleSystemComponent; // 0x310(0x08)
	Unknown bDestroyOnSystemFinish; // 0x318(0x01)
	Unknown bPostUpdateTickGroup; // 0x318(0x01)
	Unknown bCurrentlyActive; // 0x318(0x01)
	struct FMulticastInlineDelegate OnParticleSpawn; // 0x320(0x10)
	struct FMulticastInlineDelegate OnParticleBurst; // 0x330(0x10)
	struct FMulticastInlineDelegate OnParticleDeath; // 0x340(0x10)
	struct FMulticastInlineDelegate OnParticleCollide; // 0x350(0x10)
	Unknown PS_CameraEffect; // 0x360(0x08)
	Unknown PS_CameraEffectNonExtremeContent; // 0x368(0x08)
	Unknown BaseCamera; // 0x370(0x08)
	Unknown RelativeTransform; // 0x380(0x30)
	float BaseFOV; // 0x3b0(0x04)
	Unknown bAllowMultipleInstances; // 0x3b4(0x01)
	Unknown bResetWhenRetriggered; // 0x3b4(0x01)
	Unknown EmittersToTreatAsSame; // 0x3b8(0x10)
	float DistFromCamera; // 0x3c8(0x04)
	struct FString FailedPlaceMessage; // 0x28(0x10)
	struct FString MaxedOutMessage; // 0x38(0x10)
	struct FString EnteredMessage; // 0x48(0x10)
	struct FString LeftMessage; // 0x58(0x10)
	struct FString GlobalNameChange; // 0x68(0x10)
	struct FString SpecEnteredMessage; // 0x78(0x10)
	struct FString NewPlayerMessage; // 0x88(0x10)
	struct FString NewSpecMessage; // 0x98(0x10)
	Unknown Component; // 0x310(0x08)
	Unknown bEnabled; // 0x318(0x01)
	float FogDensity; // 0x238(0x04)
	float FogHeightFalloff; // 0x23c(0x04)
	Unknown SecondFogData; // 0x240(0x0c)
	Unknown FogInscatteringColor; // 0x24c(0x10)
	Unknown InscatteringColorCubemap; // 0x260(0x08)
	float InscatteringColorCubemapAngle; // 0x268(0x04)
	Unknown InscatteringTextureTint; // 0x26c(0x10)
	float FullyDirectionalInscatteringColorDistance; // 0x27c(0x04)
	float NonDirectionalInscatteringColor; // 0x280(0x04)
	float DirectionalInscatteringExponent; // 0x284(0x04)
	float DirectionalInscatteringStartDistance; // 0x288(0x04)
	Unknown DirectionalInscatteringColor; // 0x28c(0x10)
	float FogMaxOpacity; // 0x29c(0x04)
	float StartDistance; // 0x2a0(0x04)
	float FogCutoffDistance; // 0x2a4(0x04)
	Unknown bEnableVolumetricFog; // 0x2a8(0x01)
	float VolumetricFogScatteringDistribution; // 0x2ac(0x04)
	Unknown VolumetricFogAlbedo; // 0x2b0(0x04)
	Unknown VolumetricFogEmissive; // 0x2b4(0x10)
	float VolumetricFogExtinctionScale; // 0x2c4(0x04)
	float VolumetricFogDistance; // 0x2c8(0x04)
	float VolumetricFogStaticLightingScatterinjan; // 0x2cc(0x04)
	Unknown bOverrideLightColorsWithFogInscatteringColors; // 0x2d0(0x01)
	float MaxSpeed; // 0x138(0x04)
	float Acceleration; // 0x13c(0x04)
	float Deceleration; // 0x140(0x04)
	float TurningBoost; // 0x144(0x04)
	Unknown bPositionCorrected; // 0x148(0x01)
	Unknown FontCacheType; // 0x30(0x01)
	Unknown Characters; // 0x38(0x10)
	Unknown Textures; // 0x48(0x10)
	int32_t IsRemapped; // 0x58(0x04)
	float EmScale; // 0x5c(0x04)
	float Ascent; // 0x60(0x04)
	float Descent; // 0x64(0x04)
	float Leading; // 0x68(0x04)
	int32_t Kerning; // 0x6c(0x04)
	Unknown ImportOptions; // 0x70(0xb0)
	int32_t NumCharacters; // 0x120(0x04)
	Unknown MaxCharHeight; // 0x128(0x10)
	float ScalingFactor; // 0x138(0x04)
	int32_t LegacyFontSize; // 0x13c(0x04)
	struct FName LegacyFontName; // 0x140(0x08)
	Unknown CompositeFont; // 0x148(0x38)
	struct FString SourceFilename; // 0x30(0x10)
	Unknown Hinting; // 0x40(0x01)
	Unknown LoadingPolicy; // 0x41(0x01)
	Unknown LayoutMethod; // 0x42(0x01)
	Unknown Data; // 0x28(0xb0)
	Unknown Attenuation; // 0x28(0xb0)
	Unknown ForceFeedbackEffect; // 0x238(0x08)
	Unknown bAutoDestroy; // 0x240(0x01)
	Unknown bStopWhenOwnerDestroyed; // 0x240(0x01)
	Unknown bLooping; // 0x240(0x01)
	Unknown bIgnoreTimeDilation; // 0x240(0x01)
	Unknown bOverrideAttenuation; // 0x240(0x01)
	float IntensityMultiplier; // 0x244(0x04)
	Unknown AttenuationSettings; // 0x248(0x08)
	Unknown AttenuationOverrides; // 0x250(0xb0)
	struct FMulticastInlineDelegate OnForceFeedbackFinished; // 0x300(0x10)
	Unknown ChannelDetails; // 0x28(0x10)
	float Duration; // 0x38(0x04)
	float BadPacketLossThreshold; // 0x310(0x04)
	float SeverePacketLossThreshold; // 0x314(0x04)
	int32_t BadPingThreshold; // 0x318(0x04)
	int32_t SeverePingThreshold; // 0x31c(0x04)
	int32_t AdjustedNetSpeed; // 0x320(0x04)
	float LastNetSpeedUpdateTime; // 0x324(0x04)
	int32_t TotalNetBandwidth; // 0x328(0x04)
	int32_t MinDynamicBandwidth; // 0x32c(0x04)
	int32_t MaxDynamicBandwidth; // 0x330(0x04)
	Unknown bIsStandbyCheckingEnabled; // 0x334(0x01)
	Unknown bHasStandbyCheatTriggered; // 0x334(0x01)
	float StandbyRxCheatTime; // 0x338(0x04)
	float StandbyTxCheatTime; // 0x33c(0x04)
	float PercentMissingForRxStandby; // 0x340(0x04)
	float PercentMissingForTxStandby; // 0x344(0x04)
	float PercentForBadPing; // 0x348(0x04)
	float JoinInProgressStandbyWaitTime; // 0x34c(0x04)
	float MoveRepSize; // 0x350(0x04)
	float MAXPOSITIONERRORSQUARED; // 0x354(0x04)
	float MAXNEARZEROVELOCITYSQUARED; // 0x358(0x04)
	float CLIENTADJUSTUPDATECOST; // 0x35c(0x04)
	float MAXCLIENTUPDATEINTERVAL; // 0x360(0x04)
	float MaxClientForcedUpdateDuration; // 0x364(0x04)
	float ServerForcedUpdateHitchThreshold; // 0x368(0x04)
	float ServerForcedUpdateHitchCooldown; // 0x36c(0x04)
	float MaxMoveDeltaTime; // 0x370(0x04)
	float MaxClientSmoothingDeltaTime; // 0x374(0x04)
	float ClientNetSendMoveDeltaTime; // 0x378(0x04)
	float ClientNetSendMoveDeltaTimeThrottled; // 0x37c(0x04)
	float ClientNetSendMoveDeltaTimeStationary; // 0x380(0x04)
	int32_t ClientNetSendMoveThrottleAtNetSpeed; // 0x384(0x04)
	int32_t ClientNetSendMoveThrottleOverPlayerCount; // 0x388(0x04)
	Unknown ClientAuthorativePosition; // 0x38c(0x01)
	float ClientErrorUpdateRateLimit; // 0x390(0x04)
	float ClientNetCamUpdateDeltaTime; // 0x394(0x04)
	float ClientNetCamUpdatePositionLimit; // 0x398(0x04)
	Unknown bMovementTimeDiscrepancyDetection; // 0x39c(0x01)
	Unknown bMovementTimeDiscrepancyResolution; // 0x39d(0x01)
	float MovementTimeDiscrepancyMaxTimeMargin; // 0x3a0(0x04)
	float MovementTimeDiscrepancyMinTimeMargin; // 0x3a4(0x04)
	float MovementTimeDiscrepancyResolutionRate; // 0x3a8(0x04)
	float MovementTimeDiscrepancyDriftAllowance; // 0x3ac(0x04)
	Unknown bMovementTimeDiscrepancyForceCorrectionsDuringResolution; // 0x3b0(0x01)
	Unknown bUseDistanceBasedRelevancy; // 0x3b1(0x01)
	Unknown SpotLightComponent; // 0x320(0x08)
	Unknown Amplitudes; // 0x28(0x10)
	int32_t SampleRate; // 0x38(0x04)
	Unknown HapticDetails; // 0x28(0x110)
	Unknown SoundWave; // 0x28(0x08)
	Unknown ProxyMeshes; // 0x28(0x10)
	Unknown bShouldPauseWhileAdOpen; // 0x38(0x01)
	Unknown ClickedBannerDelegates; // 0x40(0x10)
	Unknown ClosedAdDelegates; // 0x50(0x10)
	Unknown Records; // 0x28(0x10)
	Unknown UnnecessaryComponents; // 0x38(0x10)
	Unknown InputActionDelegateBindings; // 0x28(0x10)
	Unknown InputAxisDelegateBindings; // 0x28(0x10)
	Unknown InputAxisKeyDelegateBindings; // 0x28(0x10)
	Unknown CachedKeyToActionInfo; // 0x120(0x10)
	Unknown InputKeyDelegateBindings; // 0x28(0x10)
	Unknown AxisConfig; // 0x28(0x10)
	Unknown bAltEnterTogglesFullscreen; // 0x38(0x01)
	Unknown bF11TogglesFullscreen; // 0x38(0x01)
	Unknown bUseMouseForTouch; // 0x38(0x01)
	Unknown bEnableMouseSmoothing; // 0x38(0x01)
	Unknown bEnableFOVScaling; // 0x38(0x01)
	Unknown bCaptureMouseOnLaunch; // 0x38(0x01)
	Unknown bDefaultViewportMouseLock; // 0x38(0x01)
	Unknown bAlwaysShowTouchInterface; // 0x38(0x01)
	Unknown bShowConsoleOnFourFingerTap; // 0x39(0x01)
	Unknown bEnableGestureRecognizer; // 0x39(0x01)
	Unknown bUseAutocorrect; // 0x3a(0x01)
	Unknown ExcludedAutocorrectOS; // 0x40(0x10)
	Unknown ExcludedAutocorrectCultures; // 0x50(0x10)
	Unknown ExcludedAutocorrectDeviceModels; // 0x60(0x10)
	Unknown DefaultViewportMouseCaptureMode; // 0x70(0x01)
	Unknown DefaultViewportMouseLockMode; // 0x71(0x01)
	float FOVScale; // 0x74(0x04)
	float DoubleClickTime; // 0x78(0x04)
	Unknown ActionMappings; // 0x80(0x10)
	Unknown AxisMappings; // 0x90(0x10)
	Unknown SpeechMappings; // 0xa0(0x10)
	Unknown DefaultTouchInterface; // 0xb0(0x18)
	Unknown ConsoleKey; // 0xc8(0x18)
	Unknown ConsoleKeys; // 0xe0(0x10)
	Unknown InputTouchDelegateBindings; // 0x28(0x10)
	Unknown StaticMeshComponents; // 0xb0(0x10)
	Unknown StaticMeshComponent; // 0xd0(0x08)
	Unknown InstancedCollisionComponentMap; // 0x310(0x50)
	Unknown Tabs; // 0x28(0x10)
	int32_t ActiveTab; // 0x38(0x04)
	float InterpLength; // 0x28(0x04)
	float PathBuildTime; // 0x2c(0x04)
	Unknown InterpGroups; // 0x30(0x10)
	Unknown CurveEdSetup; // 0x40(0x08)
	float EdSectionStart; // 0x48(0x04)
	float EdSectionEnd; // 0x4c(0x04)
	Unknown bShouldBakeAndPrune; // 0x50(0x01)
	Unknown CachedDirectorGroup; // 0x58(0x08)
	Unknown AllEventNames; // 0x60(0x10)
	struct FString Caption; // 0x28(0x10)
	Unknown InterpTracks; // 0x30(0x10)
	struct FName GroupName; // 0x40(0x08)
	Unknown GroupColor; // 0x48(0x04)
	Unknown bCollapsed; // 0x4c(0x01)
	Unknown bVisible; // 0x4c(0x01)
	Unknown bIsFolder; // 0x4c(0x01)
	Unknown bIsParented; // 0x4c(0x01)
	Unknown bIsSelected; // 0x4c(0x01)
	Unknown CameraAnimInst; // 0x50(0x08)
	float CompressTolerance; // 0x58(0x04)
	Unknown Group; // 0x28(0x08)
	Unknown GroupActor; // 0x30(0x08)
	Unknown TrackInst; // 0x38(0x10)
	float Duration; // 0xf0(0x04)
	Unknown bPauseOnImpact; // 0xf4(0x01)
	Unknown bSweep; // 0xf8(0x01)
	Unknown TeleportType; // 0xf9(0x01)
	Unknown BehaviourType; // 0xfa(0x01)
	Unknown bCheckIfStillInWorld; // 0xfb(0x01)
	Unknown bForceSubStepping; // 0xfc(0x01)
	struct FMulticastInlineDelegate OnInterpToReverse; // 0x100(0x10)
	struct FMulticastInlineDelegate OnInterpToStop; // 0x110(0x10)
	struct FMulticastInlineDelegate OnWaitBeginDelegate; // 0x120(0x10)
	struct FMulticastInlineDelegate OnWaitEndDelegate; // 0x130(0x10)
	struct FMulticastInlineDelegate OnResetDelegate; // 0x140(0x10)
	float MaxSimulationTimeStep; // 0x150(0x04)
	int32_t MaxSimulationIterations; // 0x154(0x04)
	Unknown ControlPoints; // 0x158(0x10)
	struct FName SlotName; // 0x90(0x08)
	Unknown AnimSeqs; // 0x98(0x10)
	Unknown bSkipAnimNotifiers; // 0xa8(0x01)
	Unknown BoolTrack; // 0x70(0x10)
	struct FName PropertyName; // 0x80(0x08)
	struct FName PropertyName; // 0x90(0x08)
	Unknown CutTrack; // 0x70(0x10)
	Unknown bSimulateCameraCutsOnClients; // 0x80(0x01)
	Unknown EventTrack; // 0x70(0x10)
	Unknown bFireEventsWhenForwards; // 0x80(0x01)
	Unknown bFireEventsWhenBackwards; // 0x80(0x01)
	Unknown bFireEventsWhenJumpingForwards; // 0x80(0x01)
	Unknown bUseCustomEventName; // 0x80(0x01)
	Unknown bPersistFade; // 0x90(0x01)
	Unknown bFadeAudio; // 0x90(0x01)
	Unknown FadeColor; // 0x94(0x10)
	Unknown AnimBlueprintClass; // 0x90(0x08)
	Unknown AnimClass; // 0x98(0x08)
	struct FName ParamName; // 0xa0(0x08)
	Unknown TargetMaterials; // 0x90(0x10)
	struct FName ParamName; // 0xa0(0x08)
	struct FName ParamName; // 0x90(0x08)
	struct FName PropertyName; // 0x90(0x08)
	float LastUpdatePosition; // 0x28(0x04)
	Unknown InterpProperty; // 0x28(0x20)
	Unknown PropertyOuterObjectInst; // 0x48(0x08)
	Unknown ResetBool; // 0x60(0x01)
	Unknown ResetColor; // 0x58(0x04)
	Unknown OldViewTarget; // 0x28(0x08)
	float LastUpdatePosition; // 0x28(0x04)
	Unknown AnimScriptInstance; // 0x28(0x08)
	float ResetFloat; // 0x30(0x04)
	Unknown MaterialInstances; // 0x28(0x10)
	Unknown ResetFloats; // 0x38(0x10)
	Unknown PrimitiveMaterialRefs; // 0x48(0x10)
	Unknown InstancedTrack; // 0x58(0x08)
	float ResetFloat; // 0x28(0x04)
	float ResetFloat; // 0x58(0x04)
	Unknown ResetColor; // 0x58(0x10)
	Unknown ResetLocation; // 0x28(0x0c)
	Unknown ResetRotation; // 0x34(0x0c)
	float LastUpdatePosition; // 0x28(0x04)
	float OldTimeDilation; // 0x28(0x04)
	float LastUpdatePosition; // 0x28(0x04)
	Unknown PlayAudioComp; // 0x30(0x08)
	Unknown Action; // 0x28(0x01)
	float LastUpdatePosition; // 0x2c(0x04)
	Unknown bSavedActiveState; // 0x30(0x01)
	Unknown MaterialInstances; // 0x28(0x10)
	Unknown ResetVectors; // 0x38(0x10)
	Unknown PrimitiveMaterialRefs; // 0x48(0x10)
	Unknown InstancedTrack; // 0x58(0x08)
	Unknown ResetVector; // 0x58(0x0c)
	Unknown Action; // 0x28(0x01)
	float LastUpdatePosition; // 0x2c(0x04)
	Unknown LinearColorTrack; // 0x70(0x18)
	float CurveTension; // 0x88(0x04)
	struct FName PropertyName; // 0x90(0x08)
	Unknown PosTrack; // 0x70(0x18)
	Unknown EulerTrack; // 0x88(0x18)
	Unknown LookupTrack; // 0xa0(0x10)
	struct FName LookAtGroupName; // 0xb0(0x08)
	float LinCurveTension; // 0xb8(0x04)
	float AngCurveTension; // 0xbc(0x04)
	Unknown bUseQuatInterpolation; // 0xc0(0x01)
	Unknown bShowArrowAtKeys; // 0xc0(0x01)
	Unknown bDisableMovement; // 0xc0(0x01)
	Unknown bShowTranslationOnCurveEd; // 0xc0(0x01)
	Unknown bShowRotationOnCurv; // 0xc0(0x01)
	Unknown bHide3DTrack; // 0xc0(0x01)
	Unknown RotMode; // 0xc4(0x01)
	Unknown MoveAxis; // 0x90(0x01)
	Unknown LookupTrack; // 0x98(0x10)
	Unknown TrackKeys; // 0x70(0x10)
	Unknown Sounds; // 0x90(0x10)
	Unknown bPlayOnReverse; // 0xa0(0x01)
	Unknown bContinueSoundOnMatineeEnd; // 0xa0(0x01)
	Unknown bSuppressSubtitles; // 0xa0(0x01)
	Unknown bTreatAsDialogue; // 0xa0(0x01)
	Unknown bAttach; // 0xa0(0x01)
	Unknown ToggleTrack; // 0x70(0x10)
	Unknown bActivateSystemEachUpdate; // 0x80(0x01)
	Unknown bActivateWithJustAttachedFlag; // 0x80(0x01)
	Unknown bFireEventsWhenForwards; // 0x80(0x01)
	Unknown bFireEventsWhenBackwards; // 0x80(0x01)
	Unknown bFireEventsWhenJumpingForwards; // 0x80(0x01)
	Unknown TargetMaterials; // 0x90(0x10)
	struct FName ParamName; // 0xa0(0x08)
	struct FName PropertyName; // 0x90(0x08)
	Unknown VisibilityTrack; // 0x70(0x10)
	Unknown bFireEventsWhenForwards; // 0x80(0x01)
	Unknown bFireEventsWhenBackwards; // 0x80(0x01)
	Unknown bFireEventsWhenJumpingForwards; // 0x80(0x01)
	uint16_t UnsignedInt16Variable; // 0x28(0x02)
	uint32_t UnsignedInt32Variable; // 0x2c(0x04)
	uint64_t UnsignedInt64Variable; // 0x30(0x08)
	int8_t SignedInt8Variable; // 0x38(0x01)
	int16_t SignedInt16Variable; // 0x3a(0x02)
	int64_t SignedInt64Variable; // 0x40(0x08)
	Unknown UnsignedInt8Variable; // 0x48(0x01)
	int32_t SignedInt32Variable; // 0x4c(0x04)
	struct FName LayerName; // 0x28(0x08)
	Unknown bIsVisible; // 0x30(0x01)
	Unknown ActorStats; // 0x38(0x10)
	Unknown OwningWorld; // 0xb8(0x08)
	Unknown Model; // 0xc0(0x08)
	Unknown ModelComponents; // 0xc8(0x10)
	Unknown ActorCluster; // 0xd8(0x08)
	int32_t NumTextureStreamingUnbuiltComponents; // 0xe0(0x04)
	int32_t NumTextureStreamingDirtyResources; // 0xe4(0x04)
	Unknown LevelScriptActor; // 0xe8(0x08)
	Unknown NavListStart; // 0xf0(0x08)
	Unknown NavListEnd; // 0xf8(0x08)
	Unknown NavDataChunks; // 0x100(0x10)
	float LightmapTotalSize; // 0x110(0x04)
	float ShadowmapTotalSize; // 0x114(0x04)
	Unknown StaticNavigableGeometry; // 0x118(0x10)
	Unknown StreamingTextureGuids; // 0x128(0x10)
	Unknown LevelBuildDataId; // 0x1d0(0x10)
	Unknown MapBuildData; // 0x1e0(0x08)
	Unknown LightBuildLevelOffset; // 0x1e8(0x0c)
	Unknown bIsLightingScenario; // 0x1f4(0x01)
	Unknown bTextureStreamingRotationChanged; // 0x1f4(0x01)
	Unknown bStaticComponentsRegisteredInStreamingManager; // 0x1f4(0x01)
	Unknown bIsVisible; // 0x1f4(0x01)
	Unknown WorldSettings; // 0x240(0x08)
	Unknown AssetUserData; // 0x250(0x10)
	Unknown DestroyedReplicatedStaticActors; // 0x270(0x10)
	Unknown Actors; // 0x28(0x10)
	Unknown BoxComponent; // 0x310(0x08)
	Unknown bAutoUpdate; // 0x318(0x01)
	Unknown WorldAsset; // 0x28(0x28)
	struct FName PackageNameToLoad; // 0x50(0x08)
	Unknown LODPackageNames; // 0x58(0x10)
	Unknown LevelTransform; // 0x80(0x30)
	int32_t LevelLODIndex; // 0xb0(0x04)
	int32_t StreamingPriority; // 0xb4(0x04)
	Unknown bShouldBeVisible; // 0xc0(0x01)
	Unknown bShouldBeLoaded; // 0xc0(0x01)
	Unknown bLocked; // 0xc0(0x01)
	Unknown bIsStatic; // 0xc0(0x01)
	Unknown bShouldBlockOnLoad; // 0xc0(0x01)
	Unknown bShouldBlockOnUnload; // 0xc0(0x01)
	Unknown bDisableDistanceStreaming; // 0xc0(0x01)
	Unknown bDrawOnLevelStatusMap; // 0xc0(0x01)
	Unknown LevelColor; // 0xc4(0x10)
	Unknown EditorStreamingVolumes; // 0xd8(0x10)
	float MinTimeBetweenVolumeUnloadRequests; // 0xe8(0x04)
	struct FMulticastInlineDelegate OnLevelLoaded; // 0xf0(0x10)
	struct FMulticastInlineDelegate OnLevelUnloaded; // 0x100(0x10)
	struct FMulticastInlineDelegate OnLevelShown; // 0x110(0x10)
	struct FMulticastInlineDelegate OnLevelHidden; // 0x120(0x10)
	Unknown LoadedLevel; // 0x130(0x08)
	Unknown PendingUnloadLevel; // 0x138(0x08)
	Unknown bInitiallyLoaded; // 0x158(0x01)
	Unknown bInitiallyVisible; // 0x158(0x01)
	Unknown StreamingLevelNames; // 0x348(0x10)
	Unknown bEditorPreVisOnly; // 0x358(0x01)
	Unknown bDisabled; // 0x358(0x01)
	Unknown StreamingUsage; // 0x35c(0x01)
	Unknown SourceModel; // 0x28(0x08)
	Unknown Surfaces; // 0x30(0x10)
	Unknown PortalComponent; // 0x310(0x08)
	Unknown PreviewBox; // 0x238(0x08)
	Unknown LightmassSettings; // 0x28(0x18)
	Unknown IntensityUnits; // 0x380(0x01)
	float Radius; // 0x384(0x04)
	float AttenuationRadius; // 0x388(0x04)
	Unknown LightmassSettings; // 0x38c(0x0c)
	Unknown StaticMeshComponent; // 0x310(0x08)
	Unknown ImpostersStaticMeshComponents; // 0x318(0x50)
	Unknown Proxy; // 0x368(0x08)
	struct FName Key; // 0x370(0x08)
	float LODDrawDistance; // 0x378(0x04)
	int32_t LODLevel; // 0x37c(0x04)
	Unknown SubActors; // 0x380(0x10)
	Unknown CachedNumHLODLevels; // 0x390(0x01)
	Unknown LevelLightingQuality; // 0x28(0x01)
	Unknown PhysMaterial; // 0x88(0x08)
	Unknown PhysMaterialMask; // 0x90(0x08)
	Unknown PhysicalMaterialMap; // 0x98(0x40)
	Unknown Metallic; // 0xd8(0x0c)
	Unknown Specular; // 0xec(0x0c)
	Unknown Anisotropy; // 0x100(0x0c)
	Unknown Normal; // 0x114(0x0c)
	Unknown Tangent; // 0x128(0x0c)
	Unknown EmissiveColor; // 0x13c(0x0c)
	Unknown MaterialDomain; // 0x150(0x01)
	Unknown BlendMode; // 0x151(0x01)
	Unknown DecalBlendMode; // 0x152(0x01)
	Unknown MaterialDecalResponse; // 0x153(0x01)
	Unknown ShadingModel; // 0x154(0x01)
	Unknown bCastDynamicShadowAsMasked; // 0x155(0x01)
	Unknown ShadingModels; // 0x156(0x02)
	float OpacityMaskClipValue; // 0x158(0x04)
	Unknown WorldPositionOffset; // 0x15c(0x0c)
	Unknown Refraction; // 0x170(0x0c)
	Unknown MaterialAttributes; // 0x184(0x10)
	Unknown PixelDepthOffset; // 0x19c(0x0c)
	Unknown ShadingModelFromMaterialExpression; // 0x1b0(0x0c)
	Unknown bEnableSeparateTranslucency; // 0x1c4(0x01)
	Unknown bEnableResponsiveAA; // 0x1c4(0x01)
	Unknown bEnableTranslucentVelocity; // 0x1c8(0x01)
	Unknown bScreenSpaceReflections; // 0x1cc(0x01)
	Unknown bContactShadows; // 0x1cc(0x01)
	Unknown TwoSided; // 0x1cc(0x01)
	Unknown DitheredLODTransition; // 0x1cc(0x01)
	Unknown DitherOpacityMask; // 0x1cc(0x01)
	Unknown bAllowNegativeEmissiveColor; // 0x1cc(0x01)
	Unknown TranslucencyLightingMode; // 0x1cd(0x01)
	Unknown bEnableMobileSeparateTranslucency; // 0x1ce(0x01)
	int32_t NumCustomizedUVs; // 0x1d0(0x04)
	float TranslucencyDirectionalLightingIntenj; // 0x1d4(0x04)
	float TranslucentShadowDensityScale; // 0x1d8(0x04)
	float TranslucentSelfShadowDensityScale; // 0x1dc(0x04)
	float TranslucentSelfShadowSecondDensityScale; // 0x1e0(0x04)
	float TranslucentSelfShadowSecondOpacity; // 0x1e4(0x04)
	float Translucent; // 0x1e8(0x04)
	Unknown TranslucentMultipleScatteringExtinction; // 0x1ec(0x10)
	float TranslucentShadowStartOffset; // 0x1fc(0x04)
	Unknown bDisableDepthTest; // 0x200(0x01)
	Unknown bWriteOnlyAlpha; // 0x200(0x01)
	Unknown bGenerateSphericalParticleNormals; // 0x200(0x01)
	Unknown bTangentSpaceNormal; // 0x200(0x01)
	Unknown bUseEmissiveForDynamicAreaLighting; // 0x200(0x01)
	Unknown bBlockGI; // 0x200(0x01)
	Unknown bUsedAsSpecialEngineMaterial; // 0x200(0x01)
	Unknown bUsedWithSkeletalMesh; // 0x200(0x01)
	Unknown bUsedWithEditorCompositing; // 0x201(0x01)
	Unknown bUsedWithParticleSprites; // 0x201(0x01)
	Unknown bUsedWithBeamTrails; // 0x201(0x01)
	Unknown bUsedWithMeshParticles; // 0x201(0x01)
	Unknown bUsedWithNiagaraSprites; // 0x201(0x01)
	Unknown bUsedWithNiagaraRibbons; // 0x201(0x01)
	Unknown bUsedWithNiagaraMeshParticles; // 0x201(0x01)
	Unknown bUsedWithGeometryCache; // 0x201(0x01)
	Unknown bUsedWithStaticLighting; // 0x202(0x01)
	Unknown bUsedWithMorphTargets; // 0x202(0x01)
	Unknown bUsedWithSplineMeshes; // 0x202(0x01)
	Unknown bUsedWithInstancedStaticMeshes; // 0x202(0x01)
	Unknown bUsedWithGeometryCollections; // 0x202(0x01)
	Unknown bUsesDistortion; // 0x202(0x01)
	Unknown bUsedWithClothing; // 0x202(0x01)
	Unknown bUsedWithWater; // 0x204(0x01)
	Unknown bUsedWithHairStrands; // 0x204(0x01)
	Unknown bUsedWithLidarPointCloud; // 0x204(0x01)
	Unknown bUsedWithUI; // 0x208(0x01)
	Unknown bAutomaticallySetUsageInEditor; // 0x208(0x01)
	Unknown bFullyRough; // 0x208(0x01)
	Unknown bUseFullPrecision; // 0x208(0x01)
	Unknown bUseLightmapDirectionality; // 0x208(0x01)
	Unknown bForwardRenderUsePreintegratedGFForSimpleIBL; // 0x20c(0x01)
	Unknown bUseHQForwardReflections; // 0x210(0x01)
	Unknown bUsePlanarForwardReflections; // 0x210(0x01)
	Unknown bNormalCurvatureToRoughness; // 0x210(0x01)
	Unknown D3D11TessellationMode; // 0x211(0x01)
	Unknown bEnableCrackFreeDisplacement; // 0x212(0x01)
	Unknown bEnableAdaptiveTessellation; // 0x212(0x01)
	Unknown AllowTranslucentCustomDepthWrites; // 0x212(0x01)
	Unknown Wireframe; // 0x212(0x01)
	Unknown bCanMaskedBeAssumedOpaque; // 0x212(0x01)
	Unknown bIsMasked; // 0x212(0x01)
	Unknown bIsPreviewMaterial; // 0x212(0x01)
	Unknown bIsFunctionPreviewMaterial; // 0x212(0x01)
	Unknown bUseMaterialAttributes; // 0x213(0x01)
	Unknown bCastRayTracedShadows; // 0x213(0x01)
	Unknown bUseTranslucencyVertexFog; // 0x213(0x01)
	Unknown bIsSky; // 0x213(0x01)
	Unknown bComputeFogPerPixel; // 0x213(0x01)
	Unknown bOutputTranslucentVelocity; // 0x213(0x01)
	Unknown bAllowDevelopmentShaderCompile; // 0x213(0x01)
	Unknown bIsMaterialEditorStatsMaterial; // 0x213(0x01)
	Unknown BlendableLocation; // 0x214(0x01)
	Unknown BlendableOutputAlpha; // 0x215(0x01)
	Unknown bEnableStencilTest; // 0x215(0x01)
	Unknown StencilCompare; // 0x216(0x01)
	Unknown StencilRefValue; // 0x217(0x01)
	Unknown RefractionMode; // 0x218(0x01)
	int32_t BlendablePriority; // 0x21c(0x04)
	Unknown bIsBlendable; // 0x220(0x01)
	uint32_t UsageFlagWarnings; // 0x224(0x04)
	float RefractionDepthBias; // 0x228(0x04)
	Unknown StateID; // 0x22c(0x10)
	float MaxDisplacement; // 0x23c(0x04)
	Unknown CachedExpressionData; // 0x2c8(0x228)
	Unknown Elements; // 0x4b8(0x10)
	Unknown Input; // 0x40(0x0c)
	Unknown A; // 0x40(0x0c)
	Unknown B; // 0x54(0x0c)
	float ConstA; // 0x68(0x04)
	float ConstB; // 0x6c(0x04)
	float threshold; // 0xf0(0x04)
	Unknown Channel; // 0xf4(0x01)
	Unknown A; // 0x40(0x0c)
	Unknown B; // 0x54(0x0c)
	Unknown Input; // 0x40(0x0c)
	Unknown Input; // 0x40(0x0c)
	Unknown Input; // 0x40(0x0c)
	Unknown Input; // 0x40(0x0c)
	Unknown Input; // 0x40(0x0c)
	Unknown Y; // 0x40(0x0c)
	Unknown X; // 0x54(0x0c)
	Unknown Y; // 0x40(0x0c)
	Unknown X; // 0x54(0x0c)
	Unknown Input; // 0x40(0x0c)
	Unknown WorldPosition; // 0x40(0x0c)
	Unknown Input; // 0x40(0x0c)
	Unknown Temp; // 0x40(0x0c)
	Unknown A; // 0x40(0x10)
	Unknown B; // 0x58(0x10)
	Unknown ALPHA; // 0x70(0x0c)
	Unknown PixelAttributeBlendType; // 0x84(0x01)
	Unknown VertexAttributeBlendType; // 0x85(0x01)
	Unknown MaterialAttributes; // 0x40(0x10)
	Unknown Coordinate; // 0x40(0x0c)
	Unknown Height; // 0x54(0x0c)
	Unknown HeightRatioInput; // 0x68(0x0c)
	float HeightRatio; // 0x7c(0x04)
	float ReferencePlane; // 0x80(0x04)
	uint32_t ConstCoordinate; // 0x84(0x04)
	Unknown Input; // 0x40(0x0c)
	struct FName ParameterName; // 0x40(0x08)
	Unknown ExpressionGUID; // 0x48(0x10)
	Unknown DefaultValue; // 0x58(0x10)
	Unknown bUseCustomPrimitiveData; // 0x68(0x01)
	Unknown PrimitiveDataIndex; // 0x69(0x01)
	Unknown MaskChannel; // 0x70(0x01)
	Unknown Input; // 0x74(0x0c)
	Unknown Input; // 0x40(0x0c)
	Unknown Min; // 0x54(0x0c)
	Unknown MAX; // 0x68(0x0c)
	Unknown ClampMode; // 0x7c(0x01)
	float MinDefault; // 0x80(0x04)
	float MaxDefault; // 0x84(0x04)
	Unknown Input; // 0x40(0x0c)
	Unknown Collection; // 0x40(0x08)
	struct FName ParameterName; // 0x48(0x08)
	Unknown ParameterId; // 0x50(0x10)
	int32_t SizeX; // 0x40(0x04)
	int32_t SizeY; // 0x44(0x04)
	struct FString Text; // 0x48(0x10)
	Unknown CommentColor; // 0x58(0x10)
	int32_t FontSize; // 0x68(0x04)
	Unknown Input; // 0x40(0x0c)
	Unknown R; // 0x54(0x01)
	Unknown G; // 0x54(0x01)
	Unknown B; // 0x54(0x01)
	Unknown A; // 0x54(0x01)
	float R; // 0x40(0x04)
	float R; // 0x40(0x04)
	float G; // 0x44(0x04)
	Unknown Constant; // 0x40(0x10)
	Unknown Constant; // 0x40(0x10)
	Unknown Input; // 0x40(0x0c)
	float Bias; // 0x54(0x04)
	float Scale; // 0x58(0x04)
	Unknown Input; // 0x40(0x0c)
	float Period; // 0x54(0x04)
	Unknown A; // 0x40(0x0c)
	Unknown B; // 0x54(0x0c)
	float DefaultValue; // 0x58(0x04)
	Unknown bUseCustomPrimitiveData; // 0x5c(0x01)
	Unknown PrimitiveDataIndex; // 0x5d(0x01)
	Unknown Curve; // 0x60(0x08)
	Unknown Atlas; // 0x68(0x08)
	Unknown InputTime; // 0x70(0x0c)
	struct FString Code; // 0x40(0x10)
	Unknown OutputType; // 0x50(0x01)
	struct FString Description; // 0x58(0x10)
	Unknown Inputs; // 0x68(0x10)
	Unknown AdditionalDefines; // 0x78(0x10)
	Unknown IncludeFilePaths; // 0x88(0x10)
	Unknown Value; // 0x40(0x0c)
	Unknown Value; // 0x40(0x0c)
	Unknown TextureSize; // 0x40(0x0c)
	float ConstWidth; // 0x54(0x04)
	float ConstHeight; // 0x58(0x04)
	Unknown InOpacity; // 0x40(0x0c)
	Unknown FadeDistance; // 0x54(0x0c)
	float OpacityDefault; // 0x68(0x04)
	float FadeDistanceDefault; // 0x6c(0x04)
	Unknown FunctionValue; // 0x40(0x01)
	Unknown Depth; // 0x44(0x0c)
	Unknown InXY; // 0x40(0x0c)
	Unknown Input; // 0x40(0x0c)
	Unknown Fraction; // 0x54(0x0c)
	Unknown LuminanceFactors; // 0x68(0x10)
	Unknown A; // 0x40(0x0c)
	Unknown B; // 0x54(0x0c)
	Unknown Position; // 0x40(0x0c)
	Unknown Position; // 0x40(0x0c)
	Unknown A; // 0x40(0x0c)
	Unknown B; // 0x54(0x0c)
	float ConstA; // 0x68(0x04)
	float ConstB; // 0x6c(0x04)
	Unknown A; // 0x40(0x0c)
	Unknown B; // 0x54(0x0c)
	Unknown ParamNames; // 0x40(0x10)
	Unknown DefaultValue; // 0x50(0x10)
	uint32_t ParameterIndex; // 0x60(0x04)
	Unknown Default; // 0x40(0x0c)
	Unknown Inputs; // 0x54(0x30)
	Unknown Input; // 0x40(0x0c)
	Unknown A; // 0x40(0x0c)
	Unknown B; // 0x54(0x0c)
	Unknown Font; // 0x40(0x08)
	int32_t FontTexturePage; // 0x48(0x04)
	struct FName ParameterName; // 0x50(0x08)
	Unknown ExpressionGUID; // 0x58(0x10)
	struct FName Group; // 0x68(0x08)
	Unknown Input; // 0x40(0x0c)
	Unknown ExponentIn; // 0x40(0x0c)
	float Exponent; // 0x54(0x04)
	Unknown BaseReflectFractionIn; // 0x58(0x0c)
	float BaseReflectFraction; // 0x6c(0x04)
	Unknown Normal; // 0x70(0x0c)
	Unknown Preview; // 0x40(0x0c)
	struct FName InputName; // 0x54(0x08)
	struct FString Description; // 0x60(0x10)
	Unknown ID; // 0x70(0x10)
	Unknown InputType; // 0x80(0x01)
	Unknown PreviewValue; // 0x90(0x10)
	Unknown bUsePreviewValueAsDefault; // 0xa0(0x01)
	int32_t SortPriority; // 0xa4(0x04)
	Unknown bCompilingFunctionPreview; // 0xa8(0x01)
	struct FName OutputName; // 0x40(0x08)
	struct FString Description; // 0x48(0x10)
	int32_t SortPriority; // 0x58(0x04)
	Unknown A; // 0x5c(0x0c)
	Unknown bLastPreviewed; // 0x70(0x01)
	Unknown ID; // 0x74(0x10)
	Unknown MaterialAttributes; // 0x40(0x10)
	Unknown AttributeGetTypes; // 0x58(0x10)
	Unknown Default; // 0x40(0x0c)
	Unknown StaticIndirect; // 0x54(0x0c)
	Unknown DynamicIndirect; // 0x68(0x0c)
	Unknown A; // 0x40(0x0c)
	Unknown B; // 0x54(0x0c)
	Unknown AGreaterThanB; // 0x68(0x0c)
	Unknown AEqualsB; // 0x7c(0x0c)
	Unknown ALessThanB; // 0x90(0x0c)
	float EqualsThreshold; // 0xa4(0x04)
	float ConstB; // 0xa8(0x04)
	float ConstAEqualsB; // 0xac(0x04)
	Unknown Realtime; // 0x40(0x0c)
	Unknown Lightmass; // 0x54(0x0c)
	Unknown A; // 0x40(0x0c)
	Unknown B; // 0x54(0x0c)
	Unknown ALPHA; // 0x68(0x0c)
	float ConstA; // 0x7c(0x04)
	float ConstB; // 0x80(0x04)
	float ConstAlpha; // 0x84(0x04)
	Unknown X; // 0x40(0x0c)
	Unknown X; // 0x40(0x0c)
	Unknown BaseColor; // 0x40(0x0c)
	Unknown Metallic; // 0x54(0x0c)
	Unknown Specular; // 0x68(0x0c)
	Unknown Roughness; // 0x7c(0x0c)
	Unknown Anisotropy; // 0x90(0x0c)
	Unknown EmissiveColor; // 0xa4(0x0c)
	Unknown Opacity; // 0xb8(0x0c)
	Unknown OpacityMask; // 0xcc(0x0c)
	Unknown Normal; // 0xe0(0x0c)
	Unknown Tangent; // 0xf4(0x0c)
	Unknown WorldPositionOffset; // 0x108(0x0c)
	Unknown WorldDisplacement; // 0x11c(0x0c)
	Unknown TessellationMultiplier; // 0x130(0x0c)
	Unknown SubsurfaceColor; // 0x144(0x0c)
	Unknown ClearCoat; // 0x158(0x0c)
	Unknown ClearCoatRoughness; // 0x16c(0x0c)
	Unknown AmbientOcclusion; // 0x180(0x0c)
	Unknown Refraction; // 0x194(0x0c)
	Unknown CustomizedUVs; // 0x1a8(0x60)
	Unknown PixelDepthOffset; // 0x248(0x0c)
	Unknown ShadingModel; // 0x25c(0x0c)
	Unknown Coordinates; // 0x40(0x0c)
	struct FName ParameterName; // 0x40(0x08)
	Unknown ExpressionGUID; // 0x48(0x10)
	Unknown Input; // 0x58(0x10)
	Unknown DefaultLayers; // 0x70(0x40)
	Unknown LayerCallers; // 0xb0(0x10)
	int32_t NumActiveLayerCallers; // 0xc0(0x04)
	Unknown BlendCallers; // 0xc8(0x10)
	int32_t NumActiveBlendCallers; // 0xd8(0x04)
	Unknown bIsLayerGraphBuilt; // 0xdc(0x01)
	Unknown MaterialFunction; // 0x40(0x08)
	Unknown FunctionParameterInfo; // 0x48(0x10)
	Unknown Realtime; // 0x40(0x0c)
	Unknown MaterialProxy; // 0x54(0x0c)
	Unknown A; // 0x40(0x0c)
	Unknown B; // 0x54(0x0c)
	float ConstA; // 0x68(0x04)
	float ConstB; // 0x6c(0x04)
	Unknown A; // 0x40(0x0c)
	Unknown B; // 0x54(0x0c)
	float ConstA; // 0x68(0x04)
	float ConstB; // 0x6c(0x04)
	Unknown A; // 0x40(0x0c)
	Unknown B; // 0x54(0x0c)
	float ConstA; // 0x68(0x04)
	float ConstB; // 0x6c(0x04)
	Unknown Position; // 0x40(0x0c)
	Unknown FilterWidth; // 0x54(0x0c)
	float Scale; // 0x68(0x04)
	int32_t Quality; // 0x6c(0x04)
	Unknown NoiseFunction; // 0x70(0x01)
	Unknown bTurbulence; // 0x74(0x01)
	int32_t Levels; // 0x78(0x04)
	float OutputMin; // 0x7c(0x04)
	float OutputMax; // 0x80(0x04)
	float LevelScale; // 0x84(0x04)
	Unknown bTiling; // 0x88(0x01)
	uint32_t RepeatSize; // 0x8c(0x04)
	Unknown VectorInput; // 0x40(0x0c)
	Unknown Input; // 0x40(0x0c)
	Unknown Coordinate; // 0x40(0x0c)
	Unknown Time; // 0x54(0x0c)
	Unknown Speed; // 0x68(0x0c)
	float SpeedX; // 0x7c(0x04)
	float SpeedY; // 0x80(0x04)
	uint32_t ConstCoordinate; // 0x84(0x04)
	Unknown bFractionalPart; // 0x88(0x01)
	Unknown bBlend; // 0xd0(0x01)
	Unknown DefaultValue; // 0x40(0x0c)
	float ConstDefaultValue; // 0x54(0x04)
	uint32_t DataIndex; // 0x58(0x04)
	Unknown Base; // 0x40(0x0c)
	Unknown Exponent; // 0x54(0x0c)
	float ConstExponent; // 0x68(0x04)
	Unknown CurrentFrame; // 0x40(0x0c)
	Unknown PreviousFrame; // 0x54(0x0c)
	Unknown Default; // 0x40(0x0c)
	Unknown Inputs; // 0x54(0x24)
	Unknown Normal; // 0x40(0x0c)
	Unknown RayTraced; // 0x54(0x0c)
	Unknown InputVector; // 0x40(0x0c)
	Unknown CustomWorldNormal; // 0x40(0x0c)
	Unknown bNormalizeCustomWorldNormal; // 0x54(0x01)
	Unknown Input; // 0x40(0x0c)
	Unknown NormalizedRotationAxis; // 0x40(0x0c)
	Unknown RotationAngle; // 0x54(0x0c)
	Unknown PivotPoint; // 0x68(0x0c)
	Unknown Position; // 0x7c(0x0c)
	float Period; // 0x90(0x04)
	Unknown Coordinate; // 0x40(0x0c)
	Unknown Time; // 0x54(0x0c)
	float CenterX; // 0x68(0x04)
	float CenterY; // 0x6c(0x04)
	float Speed; // 0x70(0x04)
	uint32_t ConstCoordinate; // 0x74(0x04)
	Unknown Input; // 0x40(0x0c)
	Unknown BaseColor; // 0x40(0x0c)
	Unknown Specular; // 0x54(0x0c)
	Unknown Roughness; // 0x68(0x0c)
	Unknown Normal; // 0x7c(0x0c)
	Unknown WorldHeight; // 0x90(0x0c)
	Unknown Opacity; // 0xa4(0x0c)
	Unknown Mask; // 0xb8(0x0c)
	Unknown Default; // 0x40(0x0c)
	Unknown VirtualTextureOutput; // 0x54(0x0c)
	Unknown Coordinates; // 0x40(0x0c)
	Unknown WorldPosition; // 0x54(0x0c)
	Unknown MipValue; // 0x68(0x0c)
	Unknown VirtualTexture; // 0x80(0x08)
	Unknown MaterialType; // 0x88(0x01)
	Unknown bSinglePhysicalSpace; // 0x89(0x01)
	Unknown MipValueMode; // 0x8a(0x01)
	struct FName ParameterName; // 0x90(0x08)
	Unknown ExpressionGUID; // 0x98(0x10)
	struct FName Group; // 0xa8(0x08)
	Unknown Input; // 0x40(0x0c)
	Unknown InputMode; // 0x40(0x01)
	Unknown Input; // 0x44(0x0c)
	Unknown OffsetFraction; // 0x58(0x0c)
	Unknown ConstInput; // 0x6c(0x08)
	Unknown InputMode; // 0x40(0x01)
	Unknown Input; // 0x44(0x0c)
	Unknown Coordinates; // 0x58(0x0c)
	Unknown ConstInput; // 0x6c(0x08)
	Unknown Coordinates; // 0x40(0x0c)
	Unknown SceneTextureId; // 0x54(0x01)
	Unknown bFiltered; // 0x55(0x01)
	Unknown Inputs; // 0x40(0x10)
	Unknown AttributeSetTypes; // 0x50(0x10)
	Unknown PixelShader; // 0x40(0x0c)
	Unknown VertexShader; // 0x54(0x0c)
	Unknown ShadingModel; // 0x40(0x01)
	Unknown Default; // 0x40(0x0c)
	Unknown Inputs; // 0x54(0x24)
	Unknown Default; // 0x40(0x0c)
	Unknown Shadow; // 0x54(0x0c)
	Unknown Input; // 0x40(0x0c)
	Unknown Input; // 0x40(0x0c)
	float Period; // 0x54(0x04)
	Unknown ScatteringCoefficients; // 0x40(0x0c)
	Unknown AbsorptionCoefficients; // 0x54(0x0c)
	Unknown PhaseG; // 0x68(0x0c)
	int32_t LightIndex; // 0x40(0x04)
	int32_t LightIndex; // 0x40(0x04)
	Unknown WorldPosition; // 0x44(0x0c)
	int32_t LightIndex; // 0x40(0x04)
	Unknown WorldPosition; // 0x40(0x0c)
	Unknown cell; // 0x40(0x0c)
	Unknown Index; // 0x54(0x0c)
	Unknown Seed; // 0x68(0x0c)
	uint32_t ConstIndex; // 0x7c(0x04)
	Unknown ConstSeed; // 0x80(0x08)
	Unknown GeometryInput; // 0x40(0x0c)
	Unknown WindInput; // 0x54(0x0c)
	Unknown LODInput; // 0x68(0x0c)
	Unknown ExtraBendWS; // 0x7c(0x0c)
	Unknown GeometryType; // 0x90(0x01)
	Unknown WindType; // 0x91(0x01)
	Unknown LODType; // 0x92(0x01)
	float BillboardThreshold; // 0x94(0x04)
	Unknown bAccurateWindVelocities; // 0x98(0x01)
	Unknown A; // 0x40(0x0c)
	Unknown B; // 0x54(0x0c)
	Unknown Radius; // 0x68(0x0c)
	Unknown Hardness; // 0x7c(0x0c)
	float AttenuationRadius; // 0x90(0x04)
	float HardnessPercent; // 0x94(0x04)
	Unknown Density; // 0x40(0x0c)
	float ConstantDensity; // 0x54(0x04)
	Unknown Input; // 0x40(0x0c)
	Unknown Value; // 0x40(0x01)
	Unknown DefaultValue; // 0x58(0x01)
	Unknown Input; // 0x58(0x0c)
	Unknown DefaultR; // 0x6c(0x01)
	Unknown DefaultG; // 0x6c(0x01)
	Unknown DefaultB; // 0x6c(0x01)
	Unknown DefaultA; // 0x6c(0x01)
	Unknown DefaultValue; // 0x40(0x01)
	Unknown A; // 0x44(0x0c)
	Unknown B; // 0x58(0x0c)
	Unknown Value; // 0x6c(0x0c)
	Unknown A; // 0x60(0x0c)
	Unknown B; // 0x74(0x0c)
	Unknown A; // 0x40(0x0c)
	Unknown B; // 0x54(0x0c)
	float ConstA; // 0x68(0x04)
	float ConstB; // 0x6c(0x04)
	Unknown Input; // 0x40(0x0c)
	float Period; // 0x54(0x04)
	Unknown Input; // 0x40(0x0c)
	Unknown Index; // 0x40(0x0c)
	Unknown Seed; // 0x54(0x0c)
	uint32_t ConstIndex; // 0x68(0x04)
	Unknown ConstSeed; // 0x6c(0x08)
	int32_t CoordinateIndex; // 0x40(0x04)
	float UTiling; // 0x44(0x04)
	float VTiling; // 0x48(0x04)
	Unknown UnMirrorU; // 0x4c(0x01)
	Unknown UnMirrorV; // 0x4c(0x01)
	Unknown TextureObject; // 0x40(0x0c)
	Unknown Property; // 0x54(0x01)
	Unknown bBlend; // 0xf0(0x01)
	Unknown TransmittanceColor; // 0x40(0x0c)
	Unknown bIgnorePause; // 0x40(0x01)
	Unknown bOverride_Period; // 0x40(0x01)
	float Period; // 0x44(0x04)
	Unknown Input; // 0x40(0x0c)
	Unknown TransformSourceType; // 0x54(0x01)
	Unknown TransformType; // 0x55(0x01)
	Unknown Input; // 0x40(0x0c)
	Unknown TransformSourceType; // 0x54(0x01)
	Unknown TransformType; // 0x55(0x01)
	Unknown Input; // 0x40(0x0c)
	Unknown Position; // 0x40(0x0c)
	Unknown NoiseFunction; // 0x54(0x01)
	int32_t Quality; // 0x58(0x04)
	Unknown bTiling; // 0x5c(0x01)
	uint32_t TileSize; // 0x60(0x04)
	Unknown Input; // 0x40(0x0c)
	Unknown Property; // 0x40(0x01)
	Unknown No; // 0x40(0x0c)
	Unknown Yes; // 0x54(0x0c)
	Unknown WorldPositionShaderOffset; // 0x40(0x01)
	Unknown StateID; // 0x28(0x10)
	Unknown MaterialFunctionUsage; // 0x38(0x01)
	struct FString Description; // 0x40(0x10)
	Unknown bExposeToLibrary; // 0x50(0x01)
	Unknown bPrefixParameterNames; // 0x50(0x01)
	Unknown bReentrantFlag; // 0x50(0x01)
	Unknown Parent; // 0x40(0x08)
	Unknown Base; // 0x48(0x08)
	Unknown ScalarParameterValues; // 0x50(0x10)
	Unknown VectorParameterValues; // 0x60(0x10)
	Unknown TextureParameterValues; // 0x70(0x10)
	Unknown FontParameterValues; // 0x80(0x10)
	Unknown StaticSwitchParameterValues; // 0x90(0x10)
	Unknown StaticComponentMaskParameterValues; // 0xa0(0x10)
	Unknown RuntimeVirtualTextureParameterValues; // 0xb0(0x10)
	Unknown TargetActors; // 0x310(0x10)
	Unknown StateID; // 0x28(0x10)
	Unknown ScalarParameters; // 0x38(0x10)
	Unknown VectorParameters; // 0x48(0x10)
	Unknown Collection; // 0x30(0x08)
	Unknown MatineeData; // 0x310(0x08)
	struct FName MatineeControllerName; // 0x318(0x08)
	float PlayRate; // 0x320(0x04)
	Unknown bPlayOnLevelLoad; // 0x324(0x01)
	Unknown bForceStartPos; // 0x324(0x01)
	float ForceStartPosition; // 0x328(0x04)
	Unknown bLooping; // 0x32c(0x01)
	Unknown bRewindOnPlay; // 0x32c(0x01)
	Unknown bNoResetOnRewind; // 0x32c(0x01)
	Unknown bRewindIfAlreadyPlaying; // 0x32c(0x01)
	Unknown bDisableRadioFilter; // 0x32c(0x01)
	Unknown bClientSideOnly; // 0x32c(0x01)
	Unknown bSkipUpdateIfNotVisible; // 0x32c(0x01)
	Unknown bIsSkippable; // 0x32c(0x01)
	int32_t PreferredSplitScreenNum; // 0x330(0x04)
	Unknown bDisableMovementInput; // 0x334(0x01)
	Unknown bDisableLookAtInput; // 0x334(0x01)
	Unknown bHidePlayer; // 0x334(0x01)
	Unknown bHideHud; // 0x334(0x01)
	Unknown GroupActorInfos; // 0x338(0x10)
	Unknown bShouldShowGore; // 0x348(0x01)
	Unknown GroupInst; // 0x350(0x10)
	Unknown CameraCuts; // 0x360(0x10)
	Unknown bIsPlaying; // 0x370(0x01)
	Unknown bReversePlayback; // 0x370(0x01)
	Unknown bPaused; // 0x370(0x01)
	Unknown bPendingStop; // 0x370(0x01)
	float InterpPosition; // 0x374(0x04)
	Unknown ReplicationForceIsPlaying; // 0x37c(0x01)
	struct FMulticastInlineDelegate OnPlay; // 0x380(0x10)
	struct FMulticastInlineDelegate OnStop; // 0x390(0x10)
	struct FMulticastInlineDelegate OnPause; // 0x3a0(0x10)
	Unknown CameraAnim; // 0x3b8(0x08)
	struct FName MeshReductionModuleName; // 0x38(0x08)
	Unknown AvailableProducts; // 0x38(0x10)
	struct FString LastError; // 0x48(0x10)
	struct FString LastErrorSolution; // 0x58(0x10)
	struct FMulticastInlineDelegate OnMK3DKillcamCompleteEvent; // 0xb0(0x10)
	Unknown MK3DKillEvents; // 0xd8(0x10)
	float KillcamBeforeSec; // 0xe8(0x04)
	float KillcamAfterSec; // 0xec(0x04)
	struct FMulticastInlineDelegate OnMK3DTargetcamCompleteEvent; // 0xb0(0x10)
	Unknown MK3DTargetEvents; // 0xd8(0x10)
	Unknown PendingNetObjectsHolder; // 0x2f0(0x10)
	Unknown DataVersion; // 0x30(0x01)
	float Time; // 0x34(0x04)
	Unknown ModelBodySetup; // 0x4d0(0x08)
	Unknown BaseSkelMesh; // 0x28(0x08)
	Unknown bIsDynamicObstacle; // 0x28(0x01)
	struct FName NavigationDataName; // 0x28(0x08)
	Unknown NavigationSystemClass; // 0x28(0x18)
	Unknown SupportedAgentsMask; // 0x40(0x04)
	struct FName DefaultAgentName; // 0x44(0x08)
	Unknown bIsOverriden; // 0x4c(0x01)
	Unknown LINKS; // 0x28(0x10)
	Unknown SegmentLinks; // 0x38(0x10)
	Unknown bVerifyPeer; // 0x38(0x01)
	Unknown bEnableMultiplayerWorldOriginRebasin; // 0x38(0x01)
	int32_t MaxRepArraySize; // 0x3c(0x04)
	int32_t MaxRepArrayMemory; // 0x40(0x04)
	Unknown NetworkEmulationProfiles; // 0x48(0x10)
	Unknown SourceItems; // 0x28(0x50)
	Unknown TargetItems; // 0x78(0x50)
	Unknown SourceToTarget; // 0xc8(0x50)
	Unknown SourceAsset; // 0x118(0x28)
	Unknown TargetAsset; // 0x140(0x28)
	Unknown ObjectBaseClass; // 0x28(0x08)
	Unknown bHasBlueprintClasses; // 0x30(0x01)
	Unknown Objects; // 0x38(0x10)
	Unknown WeakObjects; // 0x48(0x10)
	Unknown bUseWeakReferences; // 0x58(0x01)
	Unknown bIsFullyLoaded; // 0x59(0x01)
	Unknown ReferencedObjects; // 0x28(0x10)
	Unknown bPainCausing; // 0x358(0x01)
	float DamagePerSec; // 0x35c(0x04)
	Unknown DamageType; // 0x360(0x08)
	float PainInterval; // 0x368(0x04)
	Unknown bEntryPain; // 0x36c(0x01)
	Unknown BACKUP_bPainCausing; // 0x36c(0x01)
	Unknown DamageInstigator; // 0x370(0x08)
	struct FName EmitterName; // 0x28(0x08)
	int32_t SubUVDataOffset; // 0x30(0x04)
	Unknown EmitterRenderMode; // 0x34(0x01)
	Unknown SignificanceLevel; // 0x35(0x01)
	Unknown bUseLegacySpawningBehavior; // 0x37(0x01)
	Unknown ConvertedModules; // 0x37(0x01)
	Unknown bIsSoloing; // 0x37(0x01)
	Unknown bCookedOut; // 0x37(0x01)
	Unknown bDisabledLODsKeepEmitterAlive; // 0x37(0x01)
	Unknown bDisableWhenInsignficant; // 0x38(0x01)
	Unknown LODLevels; // 0x40(0x10)
	int32_t PeakActiveParticles; // 0x50(0x04)
	int32_t InitialAllocationCount; // 0x54(0x04)
	float QualityLevelSpawnRateScale; // 0x58(0x04)
	uint32_t DetailModeBitmask; // 0x5c(0x04)
	int32_t Level; // 0x28(0x04)
	Unknown bEnabled; // 0x2c(0x01)
	Unknown RequiredModule; // 0x30(0x08)
	Unknown Modules; // 0x38(0x10)
	Unknown TypeDataModule; // 0x48(0x08)
	Unknown SpawnModule; // 0x50(0x08)
	Unknown EventGenerator; // 0x58(0x08)
	Unknown SpawningModules; // 0x60(0x10)
	Unknown SpawnModules; // 0x70(0x10)
	Unknown UpdateModules; // 0x80(0x10)
	Unknown OrbitModules; // 0x90(0x10)
	Unknown EventReceiverModules; // 0xa0(0x10)
	Unknown ConvertedModules; // 0xb0(0x01)
	int32_t PeakActiveParticles; // 0xb4(0x04)
	Unknown bSpawnModule; // 0x28(0x01)
	Unknown bUpdateModule; // 0x28(0x01)
	Unknown bFinalUpdateModule; // 0x28(0x01)
	Unknown bUpdateForGPUEmitter; // 0x28(0x01)
	Unknown bCurvesAsColor; // 0x28(0x01)
	Unknown b3DDrawMode; // 0x28(0x01)
	Unknown bSupported3DDrawMode; // 0x28(0x01)
	Unknown bEnabled; // 0x28(0x01)
	Unknown bEditable; // 0x29(0x01)
	Unknown LODDuplicate; // 0x29(0x01)
	Unknown bSupportsRandomSeed; // 0x29(0x01)
	Unknown bRequiresLoopingNotification; // 0x29(0x01)
	Unknown LODValidity; // 0x2a(0x01)
	Unknown bAlwaysInWorldSpace; // 0x30(0x01)
	Unknown Acceleration; // 0x38(0x48)
	Unknown bApplyOwnerScale; // 0x80(0x01)
	Unknown Acceleration; // 0x38(0x0c)
	Unknown DragCoefficient; // 0x38(0x08)
	Unknown DragCoefficientRaw; // 0x40(0x30)
	Unknown DragScale; // 0x38(0x08)
	Unknown DragScaleRaw; // 0x40(0x30)
	Unknown AccelOverLife; // 0x38(0x48)
	Unknown EndPoint0; // 0x30(0x0c)
	Unknown EndPoint1; // 0x3c(0x0c)
	Unknown Range; // 0x48(0x30)
	Unknown Strength; // 0x78(0x30)
	struct FName EmitterName; // 0x30(0x08)
	Unknown Range; // 0x38(0x30)
	Unknown bStrengthByDistance; // 0x68(0x01)
	Unknown Strength; // 0x70(0x30)
	Unknown bAffectBaseVelocity; // 0xa0(0x01)
	Unknown SelectionMethod; // 0xa4(0x01)
	Unknown bRenewSource; // 0xa8(0x01)
	Unknown bInheritSourceVel; // 0xa8(0x01)
	int32_t LastSelIndex; // 0xac(0x04)
	Unknown Position; // 0x30(0x48)
	Unknown Range; // 0x78(0x30)
	Unknown Strength; // 0xa8(0x30)
	Unknown StrengthByDistance; // 0xd8(0x01)
	Unknown bAffectBaseVelocity; // 0xd8(0x01)
	Unknown bOverrideVelocity; // 0xd8(0x01)
	Unknown bUseWorldSpacePosition; // 0xd8(0x01)
	Unknown Positive_X; // 0xd8(0x01)
	Unknown Positive_Y; // 0xd8(0x01)
	Unknown Positive_Z; // 0xd8(0x01)
	Unknown Negative_X; // 0xd8(0x01)
	Unknown Negative_Y; // 0xd9(0x01)
	Unknown Negative_Z; // 0xd9(0x01)
	Unknown Position; // 0x30(0x0c)
	float Radius; // 0x3c(0x04)
	Unknown Strength; // 0x40(0x08)
	Unknown StrengthRaw; // 0x48(0x30)
	Unknown ModifierType; // 0x30(0x01)
	Unknown PositionOptions; // 0x34(0x04)
	Unknown Position; // 0x38(0x48)
	Unknown TangentOptions; // 0x80(0x04)
	Unknown Tangent; // 0x88(0x48)
	Unknown bAbsoluteTangent; // 0xd0(0x01)
	Unknown StrengthOptions; // 0xd4(0x04)
	Unknown Strength; // 0xd8(0x30)
	Unknown bLowFreq_Enabled; // 0x30(0x01)
	int32_t Frequency; // 0x34(0x04)
	int32_t Frequency_LowRange; // 0x38(0x04)
	Unknown NoiseRange; // 0x40(0x48)
	Unknown NoiseRangeScale; // 0x88(0x30)
	Unknown bNRScaleEmitterTime; // 0xb8(0x01)
	Unknown NoiseSpeed; // 0xc0(0x48)
	Unknown bSmooth; // 0x108(0x01)
	float NoiseLockRadius; // 0x10c(0x04)
	Unknown bNoiseLock; // 0x110(0x01)
	Unknown bOscillate; // 0x110(0x01)
	float NoiseLockTime; // 0x114(0x04)
	float NoiseTension; // 0x118(0x04)
	Unknown bUseNoiseTangents; // 0x11c(0x01)
	Unknown NoiseTangentStrength; // 0x120(0x30)
	int32_t NoiseTessellation; // 0x150(0x04)
	Unknown bTargetNoise; // 0x154(0x01)
	float FrequencyDistance; // 0x158(0x04)
	Unknown bApplyNoiseScale; // 0x15c(0x01)
	Unknown NoiseScale; // 0x160(0x30)
	Unknown SourceMethod; // 0x30(0x01)
	struct FName SourceName; // 0x34(0x08)
	Unknown bSourceAbsolute; // 0x3c(0x01)
	Unknown Source; // 0x40(0x48)
	Unknown bLockSource; // 0x88(0x01)
	Unknown SourceTangentMethod; // 0x8c(0x01)
	Unknown SourceTangent; // 0x90(0x48)
	Unknown bLockSourceTangent; // 0xd8(0x01)
	Unknown SourceStrength; // 0xe0(0x30)
	Unknown bLockSourceStength; // 0x110(0x01)
	Unknown TargetMethod; // 0x30(0x01)
	struct FName TargetName; // 0x34(0x08)
	Unknown Target; // 0x40(0x48)
	Unknown bTargetAbsolute; // 0x88(0x01)
	Unknown bLockTarget; // 0x88(0x01)
	Unknown TargetTangentMethod; // 0x8c(0x01)
	Unknown TargetTangent; // 0x90(0x48)
	Unknown bLockTargetTangent; // 0xd8(0x01)
	Unknown TargetStrength; // 0xe0(0x30)
	Unknown bLockTargetStength; // 0x110(0x01)
	float LockRadius; // 0x114(0x04)
	Unknown CameraOffset; // 0x30(0x30)
	Unknown bSpawnTimeOnly; // 0x60(0x01)
	Unknown UpdateMethod; // 0x64(0x01)
	Unknown DampingFactor; // 0x30(0x48)
	Unknown DampingFactorRotation; // 0x78(0x48)
	Unknown MaxCollisions; // 0xc0(0x30)
	Unknown CollisionCompletionOption; // 0xf0(0x01)
	Unknown CollisionTypes; // 0xf8(0x10)
	Unknown bApplyPhysics; // 0x110(0x01)
	Unknown bIgnoreTriggerVolumes; // 0x110(0x01)
	Unknown ParticleMass; // 0x118(0x30)
	float DirScalar; // 0x148(0x04)
	Unknown bPawnsDoNotDecrementCount; // 0x14c(0x01)
	Unknown bOnlyVerticalNormalsDecrementCount; // 0x14c(0x01)
	float VerticalFudgeFactor; // 0x150(0x04)
	Unknown DelayAmount; // 0x158(0x30)
	Unknown bDropDetail; // 0x188(0x01)
	Unknown bCollideOnlyIfVisible; // 0x188(0x01)
	Unknown bIgnoreSourceActor; // 0x188(0x01)
	float MaxCollisionDistance; // 0x18c(0x04)
	Unknown Resilience; // 0x30(0x30)
	Unknown ResilienceScaleOverLife; // 0x60(0x30)
	float Friction; // 0x90(0x04)
	float RandomSpread; // 0x94(0x04)
	float RandomDistribution; // 0x98(0x04)
	float RadiusScale; // 0x9c(0x04)
	float RadiusBias; // 0xa0(0x04)
	Unknown Response; // 0xa4(0x01)
	Unknown CollisionMode; // 0xa5(0x01)
	Unknown StartColor; // 0x30(0x48)
	Unknown StartAlpha; // 0x78(0x30)
	Unknown bClampAlpha; // 0xa8(0x01)
	Unknown RandomSeedInfo; // 0xb0(0x20)
	Unknown ColorOverLife; // 0x30(0x48)
	Unknown AlphaOverLife; // 0x78(0x30)
	Unknown bClampAlpha; // 0xa8(0x01)
	Unknown ColorScaleOverLife; // 0x30(0x48)
	Unknown AlphaScaleOverLife; // 0x78(0x30)
	Unknown bEmitterTime; // 0xa8(0x01)
	Unknown Events; // 0x30(0x10)
	Unknown EventGeneratorType; // 0x30(0x01)
	struct FName EventName; // 0x34(0x08)
	Unknown bStopSpawning; // 0x40(0x01)
	Unknown SpawnCount; // 0x40(0x30)
	Unknown bUseParticleTime; // 0x70(0x01)
	Unknown bUsePSysLocation; // 0x70(0x01)
	Unknown bInheritVelocity; // 0x70(0x01)
	Unknown InheritVelocityScale; // 0x78(0x48)
	Unknown PhysicalMaterials; // 0xc0(0x10)
	Unknown bBanPhysicalMaterials; // 0xd0(0x01)
	Unknown LowerLeftCorner; // 0x30(0x48)
	Unknown UpperRightCorner; // 0x78(0x48)
	Unknown bAbsolute; // 0xc0(0x01)
	Unknown bKillInside; // 0xc0(0x01)
	Unknown bAxisAlignedAndFixedSize; // 0xc0(0x01)
	Unknown Height; // 0x30(0x30)
	Unknown bAbsolute; // 0x60(0x01)
	Unknown bFloor; // 0x60(0x01)
	Unknown bApplyPSysScale; // 0x60(0x01)
	Unknown LifeTime; // 0x30(0x30)
	Unknown RandomSeedInfo; // 0x60(0x20)
	Unknown bUseInverseSquaredFalloff; // 0x30(0x01)
	Unknown bAffectsTranslucency; // 0x31(0x01)
	Unknown bPreviewLightRadius; // 0x32(0x01)
	float SpawnFraction; // 0x34(0x04)
	Unknown ColorScaleOverLife; // 0x38(0x48)
	Unknown BrightnessOverLife; // 0x80(0x30)
	Unknown RadiusScale; // 0xb0(0x30)
	Unknown LightExponent; // 0xe0(0x30)
	Unknown LightingChannels; // 0x110(0x01)
	float VolumetricScatteringIntensity; // 0x114(0x04)
	Unknown bHighQualityLights; // 0x118(0x01)
	Unknown bShadowCastingLights; // 0x119(0x01)
	Unknown RandomSeedInfo; // 0x120(0x20)
	Unknown StartLocation; // 0x30(0x48)
	float DistributeOverNPoints; // 0x78(0x04)
	float DistributeThreshold; // 0x7c(0x04)
	Unknown RandomSeedInfo; // 0x80(0x20)
	Unknown SourceType; // 0x30(0x01)
	Unknown UniversalOffset; // 0x34(0x0c)
	Unknown SourceLocations; // 0x40(0x10)
	Unknown SelectionMethod; // 0x50(0x01)
	Unknown bUpdatePositionEachFrame; // 0x54(0x01)
	Unknown bOrientMeshEmitters; // 0x54(0x01)
	Unknown bInheritBoneVelocity; // 0x54(0x01)
	float InheritVelocityScale; // 0x58(0x04)
	struct FName SkelMeshActorParamName; // 0x5c(0x08)
	int32_t NumPreSelectedIndices; // 0x64(0x04)
	Unknown Location; // 0x30(0x48)
	Unknown LocationOffset; // 0x78(0x48)
	Unknown ScaleFactor; // 0xc0(0x48)
	Unknown Direction; // 0x108(0x48)
	struct FName EmitterName; // 0x30(0x08)
	Unknown SelectionMethod; // 0x38(0x01)
	Unknown InheritSourceVelocity; // 0x3c(0x01)
	float InheritSourceVelocityScale; // 0x40(0x04)
	Unknown bInheritSourceRotation; // 0x44(0x01)
	float InheritSourceRotationScale; // 0x48(0x04)
	struct FName EmitterName; // 0x30(0x08)
	Unknown Positive_X; // 0x30(0x01)
	Unknown Positive_Y; // 0x30(0x01)
	Unknown Positive_Z; // 0x30(0x01)
	Unknown Negative_X; // 0x30(0x01)
	Unknown Negative_Y; // 0x30(0x01)
	Unknown Negative_Z; // 0x30(0x01)
	Unknown SurfaceOnly; // 0x30(0x01)
	Unknown Velocity; // 0x30(0x01)
	Unknown VelocityScale; // 0x38(0x30)
	Unknown StartLocation; // 0x68(0x48)
	Unknown RadialVelocity; // 0xb0(0x01)
	Unknown StartRadius; // 0xb8(0x30)
	Unknown StartHeight; // 0xe8(0x30)
	Unknown HeightAxis; // 0x118(0x01)
	Unknown RandomSeedInfo; // 0x120(0x20)
	Unknown StartRadius; // 0xb0(0x30)
	Unknown RandomSeedInfo; // 0xe0(0x20)
	Unknown StartOffset; // 0x30(0x48)
	Unknown Height; // 0x78(0x30)
	Unknown Angle; // 0xa8(0x30)
	Unknown Thickness; // 0xd8(0x30)
	Unknown SourceType; // 0x30(0x01)
	Unknown UniversalOffset; // 0x34(0x0c)
	Unknown bUpdatePositionEachFrame; // 0x40(0x01)
	Unknown bOrientMeshEmitters; // 0x40(0x01)
	Unknown bInheritBoneVelocity; // 0x40(0x01)
	float InheritVelocityScale; // 0x44(0x04)
	struct FName SkelMeshActorParamName; // 0x48(0x08)
	Unknown ValidAssociatedBones; // 0x50(0x10)
	Unknown bEnforceNormalCheck; // 0x60(0x01)
	Unknown NormalToCompare; // 0x64(0x0c)
	float NormalCheckToleranceDegrees; // 0x70(0x04)
	float NormalCheckTolerance; // 0x74(0x04)
	Unknown ValidMaterialIndices; // 0x78(0x10)
	Unknown bInheritVertexColor; // 0x88(0x01)
	Unknown bInheritUV; // 0x88(0x01)
	uint32_t InheritUVChannel; // 0x8c(0x04)
	Unknown RandomSeedInfo; // 0x80(0x20)
	Unknown MeshMaterials; // 0x30(0x10)
	Unknown StartRotation; // 0x30(0x48)
	Unknown bInheritParent; // 0x78(0x01)
	Unknown RandomSeedInfo; // 0x80(0x20)
	Unknown StartRotationRate; // 0x30(0x48)
	Unknown RandomSeedInfo; // 0x78(0x20)
	Unknown LifeMultiplier; // 0x30(0x48)
	Unknown RotRate; // 0x30(0x48)
	Unknown bScaleRotRate; // 0x78(0x01)
	Unknown bUseEmitterTime; // 0x30(0x01)
	Unknown ChainMode; // 0x38(0x01)
	Unknown OffsetAmount; // 0x40(0x48)
	Unknown OffsetOptions; // 0x88(0x04)
	Unknown RotationAmount; // 0x90(0x48)
	Unknown RotationOptions; // 0xd8(0x04)
	Unknown RotationRateAmount; // 0xe0(0x48)
	Unknown RotationRateOptions; // 0x128(0x04)
	Unknown LockAxisFlags; // 0x30(0x01)
	Unknown DynamicParams; // 0x30(0x10)
	int32_t UpdateFlags; // 0x40(0x04)
	Unknown bUsesVelocity; // 0x44(0x01)
	Unknown RandomSeedInfo; // 0x48(0x20)
	Unknown PivotOffset; // 0x30(0x08)
	Unknown Material; // 0x30(0x08)
	float MinFacingCameraBlendDistance; // 0x38(0x04)
	float MaxFacingCameraBlendDistance; // 0x3c(0x04)
	Unknown EmitterOrigin; // 0x40(0x0c)
	Unknown EmitterRotation; // 0x4c(0x0c)
	Unknown ScreenAlignment; // 0x58(0x01)
	Unknown bUseLocalSpace; // 0x59(0x01)
	Unknown bKillOnDeactivate; // 0x59(0x01)
	Unknown bKillOnCompleted; // 0x59(0x01)
	Unknown SortMode; // 0x5a(0x01)
	Unknown bUseLegacyEmitterTime; // 0x5b(0x01)
	Unknown bRemoveHMDRoll; // 0x5b(0x01)
	Unknown bEmitterDurationUseRange; // 0x5b(0x01)
	float EmitterDuration; // 0x5c(0x04)
	Unknown SpawnRate; // 0x60(0x30)
	Unknown BurstList; // 0x90(0x10)
	float EmitterDelay; // 0xa0(0x04)
	float EmitterDelayLow; // 0xa4(0x04)
	Unknown bDelayFirstLoopOnly; // 0xa8(0x01)
	Unknown InterpolationMethod; // 0xa9(0x01)
	Unknown bScaleUV; // 0xaa(0x01)
	Unknown bEmitterDelayUseRange; // 0xaa(0x01)
	Unknown ParticleBurstMethod; // 0xab(0x01)
	Unknown bOverrideSystemMacroUV; // 0xac(0x01)
	Unknown bUseMaxDrawCount; // 0xac(0x01)
	Unknown OpacitySourceMode; // 0xad(0x01)
	Unknown EmitterNormalsMode; // 0xae(0x01)
	Unknown bOrbitModuleAffectsVelocityAlignment; // 0xaf(0x01)
	int32_t SubImages_Horizontal; // 0xb0(0x04)
	int32_t SubImages_Vertical; // 0xb4(0x04)
	float RandomImageTime; // 0xb8(0x04)
	int32_t RandomImageChanges; // 0xbc(0x04)
	Unknown MacroUVPosition; // 0xc0(0x0c)
	float MacroUVRadius; // 0xcc(0x04)
	Unknown UVFlippingMode; // 0xd0(0x01)
	Unknown BoundingMode; // 0xd1(0x01)
	Unknown bDurationRecalcEachLoop; // 0xd2(0x01)
	Unknown NormalsSphereCenter; // 0xd4(0x0c)
	float AlphaThreshold; // 0xe0(0x04)
	int32_t EmitterLoops; // 0xe4(0x04)
	Unknown CutoutTexture; // 0xe8(0x08)
	int32_t MaxDrawCount; // 0xf0(0x04)
	float EmitterDurationLow; // 0xf4(0x04)
	Unknown NormalsCylinderDirection; // 0xf8(0x0c)
	Unknown NamedMaterialOverrides; // 0x108(0x10)
	Unknown StartRotation; // 0x30(0x30)
	Unknown RandomSeedInfo; // 0x60(0x20)
	Unknown RotationOverLife; // 0x30(0x30)
	Unknown Scale; // 0x60(0x01)
	Unknown StartRotationRate; // 0x30(0x30)
	Unknown RandomSeedInfo; // 0x60(0x20)
	Unknown LifeMultiplier; // 0x30(0x30)
	Unknown StartSize; // 0x30(0x48)
	Unknown RandomSeedInfo; // 0x78(0x20)
	Unknown LifeMultiplier; // 0x30(0x48)
	Unknown MultiplyX; // 0x78(0x01)
	Unknown MultiplyY; // 0x78(0x01)
	Unknown MultiplyZ; // 0x78(0x01)
	Unknown SizeScale; // 0x30(0x48)
	Unknown EnableX; // 0x78(0x01)
	Unknown EnableY; // 0x78(0x01)
	Unknown EnableZ; // 0x78(0x01)
	Unknown SpeedScale; // 0x30(0x08)
	Unknown MaxScale; // 0x38(0x08)
	Unknown SourceMovementScale; // 0x30(0x48)
	Unknown bProcessSpawnRate; // 0x30(0x01)
	Unknown bProcessBurstList; // 0x30(0x01)
	Unknown Rate; // 0x38(0x30)
	Unknown RateScale; // 0x68(0x30)
	Unknown ParticleBurstMethod; // 0x98(0x01)
	Unknown BurstList; // 0xa0(0x10)
	Unknown BurstScale; // 0xb0(0x30)
	Unknown bApplyGlobalSpawnRateScale; // 0xe0(0x01)
	float UnitScalar; // 0x38(0x04)
	float MovementTolerance; // 0x3c(0x04)
	Unknown SpawnPerUnit; // 0x40(0x30)
	float MaxFrameDistance; // 0x70(0x04)
	Unknown bIgnoreSpawnRateWhenMoving; // 0x74(0x01)
	Unknown bIgnoreMovementAlongX; // 0x74(0x01)
	Unknown bIgnoreMovementAlongY; // 0x74(0x01)
	Unknown bIgnoreMovementAlongZ; // 0x74(0x01)
	Unknown Animation; // 0x30(0x08)
	Unknown SubImageIndex; // 0x38(0x30)
	Unknown bUseRealTime; // 0x68(0x01)
	Unknown bUseEmitterTime; // 0x70(0x01)
	Unknown FrameRate; // 0x78(0x30)
	int32_t StartingFrame; // 0xa8(0x04)
	Unknown SourceMethod; // 0x30(0x01)
	struct FName SourceName; // 0x34(0x08)
	Unknown SourceStrength; // 0x40(0x30)
	Unknown bLockSourceStength; // 0x70(0x01)
	int32_t SourceOffsetCount; // 0x74(0x04)
	Unknown SourceOffsetDefaults; // 0x78(0x10)
	Unknown SelectionMethod; // 0x88(0x01)
	Unknown bInheritRotation; // 0x8c(0x01)
	Unknown bDeadTrailsOnDeactivate; // 0x30(0x01)
	Unknown bEnablePreviousTangentRecalculation; // 0x30(0x01)
	Unknown bTangentRecalculationEveryFrame; // 0x30(0x01)
	float TilingDistance; // 0x34(0x04)
	float DistanceTessellationStepSize; // 0x38(0x04)
	float TangentTessellationStepSize; // 0x3c(0x04)
	float WidthTessellationStepSize; // 0x40(0x04)
	Unknown BeamMethod; // 0x30(0x01)
	int32_t TextureTile; // 0x34(0x04)
	float TextureTileDistance; // 0x38(0x04)
	int32_t Sheets; // 0x3c(0x04)
	int32_t MaxBeamCount; // 0x40(0x04)
	float Speed; // 0x44(0x04)
	int32_t InterpolationPoints; // 0x48(0x04)
	Unknown bAlwaysOn; // 0x4c(0x01)
	int32_t UpVectorStepSize; // 0x50(0x04)
	struct FName BranchParentName; // 0x54(0x08)
	Unknown Distance; // 0x60(0x30)
	Unknown TaperMethod; // 0x90(0x01)
	Unknown TaperFactor; // 0x98(0x30)
	Unknown TaperScale; // 0xc8(0x30)
	Unknown RenderGeometry; // 0xf8(0x01)
	Unknown RenderDirectLine; // 0xf8(0x01)
	Unknown RenderLines; // 0xf8(0x01)
	Unknown RenderTessellation; // 0xf8(0x01)
	Unknown EmitterInfo; // 0x30(0x280)
	Unknown ResourceData; // 0x2b0(0x160)
	float CameraMotionBlurAmount; // 0x410(0x04)
	Unknown bClearExistingParticlesOnInit; // 0x414(0x01)
	Unknown Mesh; // 0x30(0x08)
	float LODSizeScale; // 0x40(0x04)
	Unknown bUseStaticMeshLODs; // 0x44(0x01)
	Unknown CastShadows; // 0x44(0x01)
	Unknown DoCollisions; // 0x44(0x01)
	Unknown MeshAlignment; // 0x45(0x01)
	Unknown bOverrideMaterial; // 0x46(0x01)
	Unknown bOverrideDefaultMotionBlurSettings; // 0x46(0x01)
	Unknown bEnableMotionBlur; // 0x46(0x01)
	Unknown RollPitchYawRange; // 0x48(0x48)
	Unknown AxisLockOption; // 0x90(0x01)
	Unknown bCameraFacing; // 0x91(0x01)
	Unknown CameraFacingUpAxisOption; // 0x92(0x01)
	Unknown CameraFacingOption; // 0x93(0x01)
	Unknown bApplyParticleRotationAsSpin; // 0x94(0x01)
	Unknown bFaceCameraDirectionRatherThanPosition; // 0x94(0x01)
	Unknown bCollisionsConsiderPartilceSize; // 0x94(0x01)
	int32_t MaxTessellationBetweenParticles; // 0x30(0x04)
	int32_t SheetsPerTrail; // 0x34(0x04)
	int32_t MaxTrailCount; // 0x38(0x04)
	int32_t MaxParticleInTrailCount; // 0x3c(0x04)
	Unknown bDeadTrailsOnDeactivate; // 0x40(0x01)
	Unknown bDeadTrailsOnSourceLoss; // 0x40(0x01)
	Unknown bClipSourceSegement; // 0x40(0x01)
	Unknown bEnablePreviousTangentRecalculation; // 0x40(0x01)
	Unknown bTangentRecalculationEveryFrame; // 0x40(0x01)
	Unknown bSpawnInitialParticle; // 0x40(0x01)
	Unknown RenderAxis; // 0x44(0x01)
	float TangentSpawningScalar; // 0x48(0x04)
	Unknown bRenderGeometry; // 0x4c(0x01)
	Unknown bRenderSpawnPoints; // 0x4c(0x01)
	Unknown bRenderTangents; // 0x4c(0x01)
	Unknown bRenderTessellation; // 0x4c(0x01)
	float TilingDistance; // 0x50(0x04)
	float DistanceTessellationStepSize; // 0x54(0x04)
	Unknown bEnableTangentDiffInterpScale; // 0x58(0x01)
	float TangentTessellationScalar; // 0x5c(0x04)
	Unknown bOverrideGlobalVectorFieldTightness; // 0x30(0x01)
	float GlobalVectorFieldScale; // 0x34(0x04)
	float GlobalVectorFieldTightness; // 0x38(0x04)
	Unknown VectorField; // 0x30(0x08)
	Unknown RelativeTranslation; // 0x38(0x0c)
	Unknown RelativeRotation; // 0x44(0x0c)
	Unknown RelativeScale3D; // 0x50(0x0c)
	float Intensity; // 0x5c(0x04)
	float Tightness; // 0x60(0x04)
	Unknown bIgnoreComponentTransform; // 0x64(0x01)
	Unknown bTileX; // 0x64(0x01)
	Unknown bTileY; // 0x64(0x01)
	Unknown bTileZ; // 0x64(0x01)
	Unknown bUseFixDT; // 0x64(0x01)
	Unknown MinInitialRotation; // 0x30(0x0c)
	Unknown MaxInitialRotation; // 0x3c(0x0c)
	Unknown RotationRate; // 0x30(0x0c)
	Unknown VectorFieldScale; // 0x30(0x08)
	Unknown VectorFieldScaleRaw; // 0x38(0x30)
	Unknown VectorFieldScaleOverLife; // 0x30(0x08)
	Unknown VectorFieldScaleOverLifeRaw; // 0x38(0x30)
	Unknown bInWorldSpace; // 0x30(0x01)
	Unknown bApplyOwnerScale; // 0x30(0x01)
	Unknown StartVelocity; // 0x38(0x48)
	Unknown StartVelocityRadial; // 0x80(0x30)
	Unknown RandomSeedInfo; // 0xb0(0x20)
	Unknown Angle; // 0x38(0x30)
	Unknown Velocity; // 0x68(0x30)
	Unknown Direction; // 0x98(0x0c)
	Unknown Scale; // 0x38(0x48)
	Unknown VelOverLife; // 0x38(0x48)
	Unknown Absolute; // 0x80(0x01)
	float UpdateTime_FPS; // 0x30(0x04)
	float UpdateTime_Delta; // 0x34(0x04)
	float WarmupTime; // 0x38(0x04)
	float WarmupTickRate; // 0x3c(0x04)
	Unknown Emitters; // 0x40(0x10)
	Unknown PreviewComponent; // 0x50(0x08)
	Unknown CurveEdSetup; // 0x58(0x08)
	float LODDistanceCheckTime; // 0x60(0x04)
	float MacroUVRadius; // 0x64(0x04)
	Unknown LODDistances; // 0x68(0x10)
	Unknown LODSettings; // 0x78(0x10)
	Unknown FixedRelativeBoundingBox; // 0x88(0x1c)
	float SecondsBeforeInactive; // 0xa4(0x04)
	float Delay; // 0xa8(0x04)
	float DelayLow; // 0xac(0x04)
	Unknown bOrientZAxisTowardCamera; // 0xb0(0x01)
	Unknown bUseFixedRelativeBoundingBox; // 0xb0(0x01)
	Unknown bShouldResetPeakCounts; // 0xb0(0x01)
	Unknown bHasPhysics; // 0xb0(0x01)
	Unknown bUseRealtimeThumbnail; // 0xb0(0x01)
	Unknown ThumbnailImageOutOfDate; // 0xb0(0x01)
	Unknown bUseDelayRange; // 0xb1(0x01)
	Unknown bAllowManagedTicking; // 0xb1(0x01)
	Unknown bAutoDeactivate; // 0xb1(0x01)
	Unknown bRegenerateLODDuplicate; // 0xb1(0x01)
	Unknown SystemUpdateMode; // 0xb2(0x01)
	Unknown LODMethod; // 0xb3(0x01)
	Unknown InsignificantReaction; // 0xb4(0x01)
	Unknown OcclusionBoundsMethod; // 0xb5(0x01)
	Unknown MaxSignificanceLevel; // 0xb7(0x01)
	uint32_t MinTimeBetweenTicks; // 0xb8(0x04)
	float InsignificanceDelay; // 0xbc(0x04)
	Unknown MacroUVPosition; // 0xc0(0x0c)
	Unknown CustomOcclusionBounds; // 0xcc(0x1c)
	Unknown SoloTracking; // 0xe8(0x10)
	Unknown NamedMaterialSlots; // 0xf8(0x10)
	Unknown Template; // 0x4b8(0x08)
	Unknown EmitterMaterials; // 0x4c0(0x10)
	Unknown SkelMeshComponents; // 0x4d0(0x10)
	Unknown bResetOnDetach; // 0x4e1(0x01)
	Unknown bUpdateOnDedicatedServer; // 0x4e1(0x01)
	Unknown bAllowRecycling; // 0x4e1(0x01)
	Unknown bAutoManageAttachment; // 0x4e1(0x01)
	Unknown bAutoAttachWeldSimulatedBodies; // 0x4e1(0x01)
	Unknown bWarmingUp; // 0x4e2(0x01)
	Unknown bOverrideLODMethod; // 0x4e2(0x01)
	Unknown bSkipUpdateDynamicDataDuringTick; // 0x4e2(0x01)
	Unknown LODMethod; // 0x4ed(0x01)
	Unknown RequiredSignificance; // 0x4ee(0x01)
	Unknown InstanceParameters; // 0x4f0(0x10)
	struct FMulticastInlineDelegate OnParticleSpawn; // 0x500(0x10)
	struct FMulticastInlineDelegate OnParticleBurst; // 0x510(0x10)
	struct FMulticastInlineDelegate OnParticleDeath; // 0x520(0x10)
	struct FMulticastInlineDelegate OnParticleCollide; // 0x530(0x10)
	Unknown bOldPositionValid; // 0x540(0x01)
	Unknown OldPosition; // 0x544(0x0c)
	Unknown PartSysVelocity; // 0x550(0x0c)
	float WarmupTime; // 0x55c(0x04)
	float WarmupTickRate; // 0x560(0x04)
	float SecondsBeforeInactive; // 0x578(0x04)
	float MaxTimeBeforeForceUpdateTransform; // 0x580(0x04)
	Unknown ReplayClips; // 0x5a0(0x10)
	float CustomTimeDilation; // 0x5b8(0x04)
	Unknown AutoAttachParent; // 0x610(0x08)
	struct FName AutoAttachSocketName; // 0x618(0x08)
	Unknown AutoAttachLocationRule; // 0x620(0x01)
	Unknown AutoAttachRotationRule; // 0x621(0x01)
	Unknown AutoAttachScaleRule; // 0x622(0x01)
	struct FMulticastInlineDelegate OnSystemFinished; // 0x650(0x10)
	int32_t ClipIDNumber; // 0x28(0x04)
	Unknown bAIPerceptionSystemCompatibilityMode; // 0xb0(0x01)
	Unknown LastRemoteNoisePosition; // 0xb4(0x0c)
	float NoiseLifetime; // 0xc0(0x04)
	float LastRemoteNoiseVolume; // 0xc4(0x04)
	float LastRemoteNoiseTime; // 0xc8(0x04)
	float LastLocalNoiseVolume; // 0xcc(0x04)
	float LastLocalNoiseTime; // 0xd0(0x04)
	float StrengthMultiplyer; // 0xb0(0x04)
	Unknown SkeletalMeshComponent; // 0xb8(0x08)
	int32_t UVChannelIndex; // 0x28(0x04)
	Unknown AddressX; // 0x2c(0x01)
	Unknown AddressY; // 0x2d(0x01)
	Unknown BoundsBodies; // 0x30(0x10)
	Unknown SkeletalBodySetups; // 0x40(0x10)
	Unknown ConstraintSetup; // 0x50(0x10)
	Unknown SolverIterations; // 0x60(0x18)
	Unknown bNotForDedicatedServer; // 0x78(0x01)
	Unknown ThumbnailInfo; // 0x120(0x08)
	Unknown BodySetup; // 0x128(0x10)
	Unknown bSkipScaleFromAnimation; // 0x2d0(0x01)
	Unknown PhysicalAnimationData; // 0x2d8(0x10)
	float ImpactThreshold; // 0x28(0x04)
	float ImpactReFireDelay; // 0x2c(0x04)
	Unknown DefaultImpactSound; // 0x30(0x08)
	float LastImpactSoundTime; // 0x38(0x04)
	Unknown ConstraintComp; // 0x310(0x08)
	Unknown ConstraintActor1; // 0x318(0x08)
	Unknown ConstraintActor2; // 0x320(0x08)
	Unknown bDisableCollision; // 0x328(0x01)
	Unknown ConstraintActor1; // 0x238(0x08)
	Unknown ComponentName1; // 0x240(0x08)
	Unknown ConstraintActor2; // 0x248(0x08)
	Unknown ComponentName2; // 0x250(0x08)
	Unknown ConstraintSetup; // 0x268(0x08)
	struct FMulticastInlineDelegate OnConstraintBroken; // 0x270(0x10)
	Unknown ConstraintInstance; // 0x280(0x1b8)
	Unknown DefaultInstance; // 0x28(0x1b8)
	Unknown ProfileHandles; // 0x1e0(0x10)
	Unknown DefaultProfile; // 0x1f0(0x104)
	Unknown GrabbedComponent; // 0xb0(0x08)
	Unknown bSoftAngularConstraint; // 0xc0(0x01)
	Unknown bSoftLinearConstraint; // 0xc0(0x01)
	Unknown bInterpolateTarget; // 0xc0(0x01)
	float LinearDamping; // 0xc4(0x04)
	float LinearStiffness; // 0xc8(0x04)
	float AngularDamping; // 0xcc(0x04)
	float AngularStiffness; // 0xd0(0x04)
	float InterpolationSpeed; // 0x140(0x04)
	float DefaultGravityZ; // 0x38(0x04)
	float DefaultTerminalVelocity; // 0x3c(0x04)
	float DefaultFluidFriction; // 0x40(0x04)
	int32_t SimulateScratchMemorySize; // 0x44(0x04)
	int32_t RagdollAggregateThreshold; // 0x48(0x04)
	float TriangleMeshTriangleMinAreaThreshold; // 0x4c(0x04)
	Unknown bEnableShapeSharing; // 0x50(0x01)
	Unknown bEnablePCM; // 0x51(0x01)
	Unknown bEnableStabilization; // 0x52(0x01)
	Unknown bWarnMissingLocks; // 0x53(0x01)
	Unknown bEnable2DPhysics; // 0x54(0x01)
	Unknown PhysicErrorCorrection; // 0x58(0x34)
	Unknown LockedAxis; // 0x8c(0x01)
	Unknown DefaultDegreesOfFreedom; // 0x8d(0x01)
	float BounceThresholdVelocity; // 0x90(0x04)
	Unknown FrictionCombineMode; // 0x94(0x01)
	Unknown RestitutionCombineMode; // 0x95(0x01)
	float MaxAngularVelocity; // 0x98(0x04)
	float MaxDepenetrationVelocity; // 0x9c(0x04)
	float ContactOffsetMultiplier; // 0xa0(0x04)
	float MinContactOffset; // 0xa4(0x04)
	float MaxContactOffset; // 0xa8(0x04)
	Unknown bSimulateSkeletalMeshOnDedicatedServer; // 0xac(0x01)
	Unknown DefaultShapeComplexity; // 0xad(0x01)
	Unknown bDefaultHasComplexCollision; // 0xae(0x01)
	Unknown bSuppressFaceRemapTable; // 0xaf(0x01)
	Unknown bSupportUVFromHitResults; // 0xb0(0x01)
	Unknown bDisableActiveActors; // 0xb1(0x01)
	Unknown bDisableKinematicStaticPairs; // 0xb2(0x01)
	Unknown bDisableKinematicKinematicPairs; // 0xb3(0x01)
	Unknown bDisableCCD; // 0xb4(0x01)
	Unknown bEnableEnhancedDeterminism; // 0xb5(0x01)
	float AnimPhysicsMinDeltaTime; // 0xb8(0x04)
	Unknown bSimulateAnimPhysicsAfterReset; // 0xbc(0x01)
	float MaxPhysicsDeltaTime; // 0xc0(0x04)
	Unknown bSubstepping; // 0xc4(0x01)
	Unknown bSubsteppingAsync; // 0xc5(0x01)
	float MaxSubstepDeltaTime; // 0xc8(0x04)
	int32_t MaxSubsteps; // 0xcc(0x04)
	float SyncSceneSmoothingFactor; // 0xd0(0x04)
	float InitialAverageFrameRate; // 0xd4(0x04)
	int32_t PhysXTreeRebuildRate; // 0xd8(0x04)
	Unknown PhysicalSurfaces; // 0xe0(0x10)
	Unknown DefaultBroadphaseSettings; // 0xf0(0x40)
	Unknown ChaosSettings; // 0x130(0x03)
	float SpringStiffness; // 0x238(0x04)
	float SpringDamping; // 0x23c(0x04)
	float SpringLengthAtRest; // 0x240(0x04)
	float SpringRadius; // 0x244(0x04)
	Unknown SpringChannel; // 0x248(0x01)
	Unknown bIgnoreSelf; // 0x249(0x01)
	float SpringCompression; // 0x24c(0x04)
	Unknown ThrusterComponent; // 0x310(0x08)
	float ThrustStrength; // 0x238(0x04)
	Unknown PlanarReflectionComponent; // 0x320(0x08)
	Unknown bShowPreviewPlane; // 0x328(0x01)
	Unknown PreviewBox; // 0x2d0(0x08)
	float NormalDistortionStrength; // 0x2d8(0x04)
	float PrefilterRoughness; // 0x2dc(0x04)
	float PrefilterRoughnessDistance; // 0x2e0(0x04)
	int32_t ScreenPercentage; // 0x2e4(0x04)
	float ExtraFOV; // 0x2e8(0x04)
	float DistanceFromPlaneFadeStart; // 0x2ec(0x04)
	float DistanceFromPlaneFadeEnd; // 0x2f0(0x04)
	float DistanceFromPlaneFadeoutStart; // 0x2f4(0x04)
	float DistanceFromPlaneFadeoutEnd; // 0x2f8(0x04)
	float AngleFromPlaneFadeStart; // 0x2fc(0x04)
	float AngleFromPlaneFadeEnd; // 0x300(0x04)
	Unknown bShowPreviewPlane; // 0x304(0x01)
	Unknown bRenderSceneTwoSided; // 0x305(0x01)
	float InfluenceRadiusScale; // 0x2c0(0x04)
	Unknown PreviewInfluenceRadius; // 0x2c8(0x08)
	Unknown PreviewCaptureBox; // 0x2d0(0x08)
	struct FMulticastInlineDelegate PlatformChangedToLaptopModeDelegate; // 0xb0(0x10)
	struct FMulticastInlineDelegate PlatformChangedToTabletModeDelegate; // 0xc0(0x10)
	struct FString OriginalURL; // 0x28(0x10)
	int32_t responsecode; // 0x38(0x04)
	int32_t Tag; // 0x3c(0x04)
	struct FString StringResponse; // 0x40(0x10)
	Unknown BinaryResponse; // 0x50(0x10)
	Unknown DebugExecBindings; // 0x120(0x10)
	Unknown InvertedAxis; // 0x160(0x10)
	Unknown PointLightComponent; // 0x320(0x08)
	Unknown bUseInverseSquaredFalloff; // 0x398(0x01)
	float LightFalloffExponent; // 0x39c(0x04)
	float SourceRadius; // 0x3a0(0x04)
	float SoftSourceRadius; // 0x3a4(0x04)
	float SourceLength; // 0x3a8(0x04)
	Unknown PoseContainer; // 0x80(0x90)
	Unknown bAdditivePose; // 0x110(0x01)
	int32_t BasePoseIndex; // 0x114(0x04)
	struct FName RetargetSource; // 0x118(0x08)
	Unknown Node; // 0x28(0x08)
	Unknown PoseWatchColour; // 0x30(0x04)
	Unknown Settings; // 0x240(0x5c0)
	float Priority; // 0x800(0x04)
	float BlendRadius; // 0x804(0x04)
	float BlendWeight; // 0x808(0x04)
	Unknown bEnabled; // 0x80c(0x01)
	Unknown bUnbound; // 0x80c(0x01)
	Unknown Settings; // 0x350(0x5c0)
	float Priority; // 0x910(0x04)
	float BlendRadius; // 0x914(0x04)
	float BlendWeight; // 0x918(0x04)
	Unknown bEnabled; // 0x91c(0x01)
	Unknown bUnbound; // 0x91c(0x01)
	Unknown OverrideVisibleActors; // 0x348(0x10)
	Unknown OverrideInvisibleActors; // 0x358(0x10)
	Unknown OverrideInvisibleLevels; // 0x368(0x10)
	Unknown Skeleton; // 0x38(0x08)
	Unknown SkeletalMeshes; // 0x40(0x10)
	Unknown Rules; // 0x30(0x0c)
	Unknown bLabelAssetsInMyDirectory; // 0x3c(0x01)
	Unknown bIsRuntimeLabel; // 0x3c(0x01)
	Unknown ExplicitAssets; // 0x40(0x10)
	Unknown ExplicitBlueprints; // 0x50(0x10)
	Unknown AssetCollection; // 0x60(0x08)
	struct FName ProxyLODMeshReductionModuleName; // 0x38(0x08)
	Unknown ForceComponent; // 0x310(0x08)
	float Radius; // 0x238(0x04)
	Unknown Falloff; // 0x23c(0x01)
	float ImpulseStrength; // 0x240(0x04)
	Unknown bImpulseVelChange; // 0x244(0x01)
	Unknown bIgnoreOwningActor; // 0x244(0x01)
	float ForceStrength; // 0x248(0x04)
	float DestructibleDamage; // 0x24c(0x04)
	Unknown ObjectTypesToAffect; // 0x250(0x10)
	Unknown RectLightComponent; // 0x320(0x08)
	float SourceWidth; // 0x398(0x04)
	float SourceHeight; // 0x39c(0x04)
	float BarnDoorAngle; // 0x3a0(0x04)
	float BarnDoorLength; // 0x3a4(0x04)
	Unknown SourceTexture; // 0x3a8(0x08)
	Unknown bMobileDisableVertexFog; // 0x38(0x01)
	int32_t MaxMobileCascades; // 0x3c(0x04)
	Unknown MobileMSAASampleCount; // 0x40(0x01)
	Unknown bMobileUseLegacyShadingModel; // 0x44(0x01)
	Unknown bMobileAllowDitheredLODTransition; // 0x44(0x01)
	Unknown bMobileAllowSoftwareOcclusionCulling; // 0x44(0x01)
	Unknown bMobileVirtualTextures; // 0x44(0x01)
	Unknown bDiscardUnusedQualityLevels; // 0x44(0x01)
	Unknown bOcclusionCulling; // 0x44(0x01)
	float MinScreenRadiusForLights; // 0x48(0x04)
	float MinScreenRadiusForEarlyZPass; // 0x4c(0x04)
	float MinScreenRadiusForCSMdepth; // 0x50(0x04)
	Unknown bPrecomputedVisibilityWarning; // 0x54(0x01)
	Unknown bUseCullDistanceVolumes; // 0x54(0x01)
	Unknown bTextureStreaming; // 0x54(0x01)
	Unknown bUseDXT5NormalMaps; // 0x54(0x01)
	Unknown bVirtualTextures; // 0x54(0x01)
	Unknown bVirtualTexturedLightmaps; // 0x54(0x01)
	uint32_t VirtualTextureTileSize; // 0x58(0x04)
	uint32_t VirtualTextureTileBorderSize; // 0x5c(0x04)
	uint32_t VirtualTextureFeedbackFactor; // 0x60(0x04)
	Unknown bVirtualTextureEnableCompressZlib; // 0x64(0x01)
	Unknown bVirtualTextureEnableCompressCr; // 0x64(0x01)
	Unknown bClearCoatEnableSecondNormal; // 0x64(0x01)
	Unknown bPreIntegratedSkinBRDF; // 0x64(0x01)
	Unknown bAnisotropicBRDF; // 0x64(0x01)
	int32_t ReflectionCaptureResolution; // 0x68(0x04)
	Unknown ReflectionEnvironmentLightmapMixBasedOnRoughness; // 0x6c(0x01)
	Unknown bForwardShading; // 0x6c(0x01)
	Unknown bVertexFoggingForOpaque; // 0x6c(0x01)
	Unknown bAllowStaticLighting; // 0x6c(0x01)
	Unknown bUseNormalMapsForStaticLighting; // 0x6c(0x01)
	Unknown bGenerateMeshDistanceFields; // 0x6c(0x01)
	Unknown bEightBitMeshDistanceFields; // 0x6c(0x01)
	Unknown bGenerateLandscapeGIData; // 0x6c(0x01)
	Unknown bCompressMeshDistanceFields; // 0x6d(0x01)
	float TessellationAdaptiv; // 0x70(0x04)
	Unknown bSeparateTranslucency; // 0x74(0x01)
	Unknown TranslucentSortPolicy; // 0x78(0x01)
	Unknown TranslucentSortAxis; // 0x7c(0x0c)
	Unknown CustomDepthStencil; // 0x88(0x01)
	Unknown bCustomDepthTaaJitter; // 0x8c(0x01)
	Unknown bEnableAlphaChannelInPostProcessing; // 0x90(0x01)
	Unknown bDefaultFeatureBloom; // 0x94(0x01)
	Unknown bDefaultFeatureAmbientOcclusion; // 0x94(0x01)
	Unknown bDefaultFeatureAmbientOcclusionStaticFr; // 0x94(0x01)
	Unknown bDefaultFeatureAutoExposure; // 0x94(0x01)
	Unknown DefaultFeatureAutoExposure; // 0x98(0x01)
	float DefaultFeatureAutoExposureBias; // 0x9c(0x04)
	Unknown bExtendDefaultLuminanceRangeInAutoExposureSettings; // 0xa0(0x01)
	Unknown bUsePreExposure; // 0xa0(0x01)
	Unknown bEnablePreExposureOnlyInTheEditor; // 0xa0(0x01)
	Unknown bDefaultFeatureMotionBlur; // 0xa0(0x01)
	Unknown bDefaultFeatureLensFlare; // 0xa0(0x01)
	Unknown bTemporalUpsampling; // 0xa0(0x01)
	Unknown bSSGI; // 0xa0(0x01)
	Unknown DefaultFeatureAntiAliasing; // 0xa4(0x01)
	Unknown DefaultLightUnits; // 0xa5(0x01)
	Unknown DefaultBack; // 0xa6(0x01)
	Unknown bRenderUnbuiltPreviewShadowsInGame; // 0xa8(0x01)
	Unknown bStencilForLODDither; // 0xa8(0x01)
	Unknown EarlyZPass; // 0xac(0x01)
	Unknown bEarlyZPassOnlyMaterialMasking; // 0xb0(0x01)
	Unknown bDBuffer; // 0xb0(0x01)
	Unknown ClearSceneMethod; // 0xb4(0x01)
	Unknown bBasePassOutputsVelocity; // 0xb8(0x01)
	Unknown bVertexDeformationOutputsVelocity; // 0xb8(0x01)
	Unknown bSelectiveBasePassOutputs; // 0xb8(0x01)
	Unknown bDefaultParticleCutouts; // 0xb8(0x01)
	int32_t GPUSimulationTextureSizeX; // 0xbc(0x04)
	int32_t GPUSimulationTextureSizeY; // 0xc0(0x04)
	Unknown bGlobalClipPlane; // 0xc4(0x01)
	Unknown GBufferFormat; // 0xc8(0x01)
	Unknown bUseGPUMorphTargets; // 0xcc(0x01)
	Unknown bNvidiaAftermathEnabled; // 0xcc(0x01)
	Unknown bMultiView; // 0xcc(0x01)
	Unknown bMobilePostProcessing; // 0xcc(0x01)
	Unknown bMobileMultiView; // 0xcc(0x01)
	Unknown bMobileUseHWsRGBEncoding; // 0xcc(0x01)
	Unknown bRoundRobinOcclusion; // 0xcc(0x01)
	Unknown bODSCapture; // 0xcc(0x01)
	Unknown bMeshStreaming; // 0xcd(0x01)
	float WireframeCullThreshold; // 0xd0(0x04)
	Unknown bEnableRayTracing; // 0xd4(0x01)
	Unknown bEnableRayTracingTextureLOD; // 0xd4(0x01)
	Unknown bSupportStationarySkylight; // 0xd4(0x01)
	Unknown bSupportLowQualityLightmaps; // 0xd4(0x01)
	Unknown bSupportPointLightWholeSceneShadows; // 0xd4(0x01)
	Unknown bSupportAtmosphericFog; // 0xd4(0x01)
	Unknown bSupportSkyAtmosphere; // 0xd4(0x01)
	Unknown bSupportSkyAtmosphereAffectsHeightFog; // 0xd4(0x01)
	Unknown bSupportSkinCacheShaders; // 0xd5(0x01)
	Unknown DefaultSkinCacheBehavior; // 0xd8(0x01)
	float SkinCacheSceneMemoryLimitInMB; // 0xdc(0x04)
	Unknown bMobileEnableStaticAndCSMShadowReceiver; // 0xe0(0x01)
	Unknown bMobileEnableMovableLightCSMShaderCulling; // 0xe0(0x01)
	Unknown bMobileAllowDistanceFieldShadows; // 0xe0(0x01)
	Unknown bMobileAllowMovableDirectionalLights; // 0xe0(0x01)
	uint32_t MobileNumDynamicPointLights; // 0xe4(0x04)
	Unknown bMobileDynamicPointLightsUseStaticBranch; // 0xe8(0x01)
	Unknown bMobileAllowMovableSpotlights; // 0xe8(0x01)
	Unknown bSupport16BitBoneIndex; // 0xe8(0x01)
	Unknown bGPUSkinLimit2BoneInfluences; // 0xe8(0x01)
	Unknown bSupportDepthOnlyIndexBuffers; // 0xe8(0x01)
	Unknown bSupportReversedIndexBuffers; // 0xe8(0x01)
	Unknown bSupportMaterialLayers; // 0xe8(0x01)
	Unknown bLPV; // 0xe8(0x01)
	Unknown bSupportAllShaderPermutations; // 0x38(0x01)
	Unknown bForceRecomputeTangents; // 0x38(0x01)
	float Density; // 0x28(0x04)
	float Diffusion; // 0x2c(0x04)
	float Gain; // 0x30(0x04)
	float GainHF; // 0x34(0x04)
	float DecayTime; // 0x38(0x04)
	float DecayHFRatio; // 0x3c(0x04)
	float ReflectionsGain; // 0x40(0x04)
	float ReflectionsDelay; // 0x44(0x04)
	float LateGain; // 0x48(0x04)
	float LateDelay; // 0x4c(0x04)
	float AirAbsorptionGainHF; // 0x50(0x04)
	float RoomRolloffFactor; // 0x54(0x04)
	Unknown TransformBases; // 0x30(0x10)
	Unknown Nodes; // 0x40(0x10)
	Unknown RotationRate; // 0xf0(0x0c)
	Unknown PivotTranslation; // 0xfc(0x0c)
	Unknown bRotationInLocalSpace; // 0x108(0x01)
	Unknown MaterialType; // 0x28(0x01)
	Unknown bCompressTextures; // 0x29(0x01)
	Unknown bEnable; // 0x2a(0x01)
	Unknown bClearTextures; // 0x2b(0x01)
	Unknown bSinglePhysicalSpace; // 0x2c(0x01)
	Unknown bPrivateSpace; // 0x2d(0x01)
	Unknown bEnableScalability; // 0x2e(0x01)
	int32_t Size; // 0x30(0x04)
	int32_t TileCount; // 0x34(0x04)
	int32_t TileSize; // 0x38(0x04)
	int32_t TileBorderSize; // 0x3c(0x04)
	int32_t StreamLowMips; // 0x40(0x04)
	Unknown StreamingTexture; // 0x48(0x08)
	Unknown bEnableCompressCrunch; // 0x50(0x01)
	int32_t RemoveLowMips; // 0x54(0x04)
	Unknown VirtualTexture; // 0x238(0x08)
	Unknown bUseStreamingLowMipsInEditor; // 0x240(0x01)
	Unknown BoundsSourceActor; // 0x248(0x08)
	Unknown Settings; // 0xe8(0x0c)
	Unknown bSinglePhysicalSpace; // 0xf4(0x01)
	uint32_t BuildHash; // 0xf8(0x04)
	Unknown VirtualTextureComponent; // 0x310(0x08)
	Unknown TextureTarget; // 0x2d0(0x08)
	Unknown bCaptureRotation; // 0x2d8(0x01)
	Unknown TextureTargetLeft; // 0x2e0(0x08)
	Unknown TextureTargetRight; // 0x2e8(0x08)
	Unknown TextureTargetODS; // 0x2f0(0x08)
	float IPD; // 0x2f8(0x04)
	Unknown CaptureComponentCube; // 0x320(0x08)
	Unknown ComponentClass; // 0x28(0x08)
	Unknown ComponentTemplate; // 0x30(0x08)
	Unknown CookedComponentInstancingData; // 0x38(0x48)
	struct FName AttachToName; // 0x80(0x08)
	struct FName ParentComponentOrVariableName; // 0x88(0x08)
	struct FName ParentComponentOwnerClassName; // 0x90(0x08)
	Unknown bIsParentComponentNative; // 0x98(0x01)
	Unknown ChildNodes; // 0xa0(0x10)
	Unknown MetaDataArray; // 0xb0(0x10)
	Unknown VariableGuid; // 0xc0(0x10)
	struct FName InternalVariableName; // 0xd0(0x08)
	Unknown bUpdateStatNet; // 0x310(0x01)
	Unknown bOverwriteClientStats; // 0x311(0x01)
	uint32_t Channels; // 0x314(0x04)
	uint32_t InRate; // 0x318(0x04)
	uint32_t OutRate; // 0x31c(0x04)
	uint32_t MaxPacketOverhead; // 0x324(0x04)
	uint32_t InRateClientMax; // 0x328(0x04)
	uint32_t InRateClientMin; // 0x32c(0x04)
	uint32_t InRateClientAvg; // 0x330(0x04)
	uint32_t InPacketsClientMax; // 0x334(0x04)
	uint32_t InPacketsClientMin; // 0x338(0x04)
	uint32_t InPacketsClientAvg; // 0x33c(0x04)
	uint32_t OutRateClientMax; // 0x340(0x04)
	uint32_t OutRateClientMin; // 0x344(0x04)
	uint32_t OutRateClientAvg; // 0x348(0x04)
	uint32_t OutPacketsClientMax; // 0x34c(0x04)
	uint32_t OutPacketsClientMin; // 0x350(0x04)
	uint32_t OutPacketsClientAvg; // 0x354(0x04)
	uint32_t NetNumClients; // 0x358(0x04)
	uint32_t InPackets; // 0x35c(0x04)
	uint32_t OutPackets; // 0x360(0x04)
	uint32_t InBunches; // 0x364(0x04)
	uint32_t OutBunches; // 0x368(0x04)
	uint32_t OutLoss; // 0x36c(0x04)
	uint32_t InLoss; // 0x370(0x04)
	uint32_t VoiceBytesSent; // 0x374(0x04)
	uint32_t VoiceBytesRecv; // 0x378(0x04)
	uint32_t VoicePacketsSent; // 0x37c(0x04)
	uint32_t VoicePacketsRecv; // 0x380(0x04)
	uint32_t PercentInVoice; // 0x384(0x04)
	uint32_t PercentOutVoice; // 0x388(0x04)
	uint32_t NumActorChannels; // 0x38c(0x04)
	uint32_t NumConsideredActors; // 0x390(0x04)
	uint32_t PrioritizedActors; // 0x394(0x04)
	uint32_t NumRelevantActors; // 0x398(0x04)
	uint32_t NumRelevantDeletedActors; // 0x39c(0x04)
	uint32_t NumReplicatedActorAttempts; // 0x3a0(0x04)
	uint32_t NumReplicatedActors; // 0x3a4(0x04)
	uint32_t NumActors; // 0x3a8(0x04)
	uint32_t NumNetActors; // 0x3ac(0x04)
	uint32_t NumDormantActors; // 0x3b0(0x04)
	uint32_t NumInitiallyDormantActors; // 0x3b4(0x04)
	uint32_t NumNetGUIDsAckd; // 0x3b8(0x04)
	uint32_t NumNetGUIDsPending; // 0x3bc(0x04)
	uint32_t NumNetGUIDsUnAckd; // 0x3c0(0x04)
	uint32_t ObjPathBytes; // 0x3c4(0x04)
	uint32_t NetGUIDOutRate; // 0x3c8(0x04)
	uint32_t NetGUIDInRate; // 0x3cc(0x04)
	uint32_t NetSaturated; // 0x3d0(0x04)
	Unknown ShadowmapFlags; // 0xe8(0x01)
	Unknown RootNodes; // 0x28(0x10)
	Unknown AllNodes; // 0x38(0x10)
	Unknown DefaultSceneRootNode; // 0x48(0x08)
	Unknown MinLOD; // 0x30(0x04)
	Unknown DisableBelowMinLodStripping; // 0x34(0x01)
	Unknown bSupportLODStreaming; // 0x35(0x01)
	Unknown MaxNumStreamedLODs; // 0x38(0x04)
	Unknown MaxNumOptionalLODs; // 0x3c(0x04)
	Unknown LODGroups; // 0x40(0x10)
	struct FName SkeletalMeshReductionModuleName; // 0x38(0x08)
	struct FName SocketName; // 0x28(0x08)
	struct FName BoneName; // 0x30(0x08)
	Unknown RelativeLocation; // 0x38(0x0c)
	Unknown RelativeRotation; // 0x44(0x0c)
	Unknown RelativeScale; // 0x50(0x0c)
	Unknown bForceAlwaysAnimated; // 0x5c(0x01)
	Unknown TransformMode; // 0x238(0x01)
	float BottomRadius; // 0x23c(0x04)
	Unknown GroundAlbedo; // 0x240(0x04)
	float AtmosphereHeight; // 0x244(0x04)
	float MultiScatteringFactor; // 0x248(0x04)
	float RayleighScatteringScale; // 0x24c(0x04)
	Unknown RayleighScattering; // 0x250(0x10)
	float RayleighExponentialDistribution; // 0x260(0x04)
	float MieScatteringScale; // 0x264(0x04)
	Unknown MieScattering; // 0x268(0x10)
	float MieAbsorptionScale; // 0x278(0x04)
	Unknown MieAbsorption; // 0x27c(0x10)
	float MieAnisotropy; // 0x28c(0x04)
	float MieExponentialDistribution; // 0x290(0x04)
	float OtherAbsorptionScale; // 0x294(0x04)
	Unknown OtherAbsorption; // 0x298(0x10)
	Unknown OtherTentDistribution; // 0x2a8(0x0c)
	Unknown SkyLuminanceFactor; // 0x2b4(0x10)
	float AerialPespectiveViewDistanceScale; // 0x2c4(0x04)
	float HeightFogContribution; // 0x2c8(0x04)
	float TransmittanceMinLightElevationAngle; // 0x2cc(0x04)
	Unknown bStaticLightingBuiltGUID; // 0x2f4(0x10)
	Unknown SkyAtmosphereComponent; // 0x310(0x08)
	Unknown SourceType; // 0x270(0x01)
	Unknown Cubemap; // 0x278(0x08)
	float SourceCubemapAngle; // 0x280(0x04)
	int32_t CubemapResolution; // 0x284(0x04)
	float SkyDistanceThreshold; // 0x288(0x04)
	Unknown bCaptureEmissiveOnly; // 0x28c(0x01)
	Unknown bLowerHemisphereIsBlack; // 0x28d(0x01)
	Unknown LowerHemisphereColor; // 0x290(0x10)
	Unknown bAffectDynamicIndirectLighting; // 0x2a0(0x01)
	float OcclusionMaxDistance; // 0x2a4(0x04)
	float Contrast; // 0x2a8(0x04)
	float OcclusionExponent; // 0x2ac(0x04)
	Unknown OcclusionFoliageTint; // 0x2b0(0x04)
	float MinOcclusion; // 0x2b4(0x04)
	Unknown OcclusionBarkTint; // 0x2b8(0x04)
	Unknown OcclusionTint; // 0x2bc(0x04)
	Unknown OcclusionCombineMode; // 0x2c0(0x01)
	Unknown SpecularOcclusionMode; // 0x2c1(0x01)
	float SpecularOcclusionStrength; // 0x2c4(0x04)
	float SelfShadowBiasForObjectAO; // 0x2c8(0x04)
	float OcclusionTranslucencyForTwoSidedFoliages; // 0x2cc(0x04)
	Unknown BlendDestinationCubemap; // 0x388(0x08)
	Unknown Brush; // 0x28(0x88)
	Unknown Attenuation; // 0x28(0x3a0)
	Unknown Properties; // 0x28(0x58)
	Unknown ChildClasses; // 0x80(0x10)
	Unknown PassiveSoundMixModifiers; // 0x90(0x10)
	Unknown Modulation; // 0xa0(0x10)
	Unknown ParentClass; // 0xb0(0x08)
	Unknown Concurrency; // 0x28(0x20)
	Unknown bPrimeOnLoad; // 0x160(0x01)
	Unknown FirstNode; // 0x168(0x08)
	float VolumeMultiplier; // 0x170(0x04)
	float PitchMultiplier; // 0x174(0x04)
	Unknown AttenuationOverrides; // 0x178(0x3a0)
	float SubtitlePriority; // 0x518(0x04)
	Unknown bOverrideAttenuation; // 0x520(0x01)
	Unknown bExcludeFromRandomNodeBranchCulling; // 0x520(0x01)
	int32_t CookedQualityIndex; // 0x524(0x04)
	Unknown bHasPlayWhenSilent; // 0x528(0x01)
	Unknown Chain; // 0x28(0x10)
	Unknown bPlayEffectChainTails; // 0x38(0x01)
	Unknown SoundGroupProfiles; // 0x28(0x10)
	Unknown bApplyEQ; // 0x28(0x01)
	float EQPriority; // 0x2c(0x04)
	Unknown EQSettings; // 0x30(0x40)
	Unknown SoundClassEffects; // 0x70(0x10)
	float InitialDelay; // 0x80(0x04)
	float FadeInTime; // 0x84(0x04)
	float Duration; // 0x88(0x04)
	float FadeOutTime; // 0x8c(0x04)
	Unknown ChildNodes; // 0x28(0x10)
	Unknown AttenuationSettings; // 0x48(0x08)
	Unknown AttenuationOverrides; // 0x50(0x3a0)
	Unknown bOverrideAttenuation; // 0x3f0(0x01)
	struct FName BoolParameterName; // 0x48(0x08)
	Unknown InputVolume; // 0x48(0x10)
	float DelayMin; // 0x48(0x04)
	float DelayMax; // 0x4c(0x04)
	Unknown DialogueWaveParameter; // 0x48(0x20)
	Unknown bLooping; // 0x68(0x01)
	Unknown CrossFadeInput; // 0x48(0x10)
	float DopplerIntensity; // 0x48(0x04)
	Unknown bUseSmoothing; // 0x4c(0x01)
	float SmoothingInterpSpeed; // 0x50(0x04)
	float LoopStart; // 0x48(0x04)
	float LoopEnd; // 0x4c(0x04)
	float DurationAfterLoop; // 0x50(0x04)
	int32_t LoopCount; // 0x54(0x04)
	Unknown bLoopIndefinitely; // 0x58(0x01)
	Unknown bLoop; // 0x58(0x01)
	Unknown VolumeInterpCurve; // 0x60(0x08)
	Unknown PitchInterpCurve; // 0x68(0x08)
	Unknown VolumeCurve; // 0x70(0x88)
	Unknown PitchCurve; // 0xf8(0x88)
	float PitchMin; // 0x180(0x04)
	float PitchMax; // 0x184(0x04)
	float VolumeMin; // 0x188(0x04)
	float VolumeMax; // 0x18c(0x04)
	Unknown GroupSizes; // 0x48(0x10)
	int32_t LoopCount; // 0x48(0x04)
	Unknown bLoopIndefinitely; // 0x4c(0x01)
	Unknown InputVolume; // 0x48(0x10)
	float PitchMin; // 0x48(0x04)
	float PitchMax; // 0x4c(0x04)
	float VolumeMin; // 0x50(0x04)
	float VolumeMax; // 0x54(0x04)
	Unknown PitchModulationParams; // 0x48(0x20)
	Unknown VolumeModulationParams; // 0x68(0x20)
	Unknown bModulateVolume; // 0x48(0x01)
	Unknown bModulatePitch; // 0x48(0x01)
	float AmplitudeMin; // 0x4c(0x04)
	float AmplitudeMax; // 0x50(0x04)
	float FrequencyMin; // 0x54(0x04)
	float FrequencyMax; // 0x58(0x04)
	float OffsetMin; // 0x5c(0x04)
	float OffsetMax; // 0x60(0x04)
	float CenterMin; // 0x64(0x04)
	float CenterMax; // 0x68(0x04)
	struct FName ParamName; // 0x58(0x08)
	Unknown Weights; // 0x48(0x10)
	Unknown HasBeenUsed; // 0x58(0x10)
	int32_t NumRandomUsed; // 0x68(0x04)
	int32_t PreselectAtLevelLoad; // 0x6c(0x04)
	Unknown bShouldExcludeFromBranch; // 0x70(0x01)
	Unknown bSoundCueExcludedFromBranchCulling; // 0x70(0x01)
	Unknown bRandomizeWithoutReplacement; // 0x70(0x01)
	Unknown SoundClassOverride; // 0x48(0x08)
	struct FName IntParameterName; // 0x48(0x08)
	struct FName WaveParameterName; // 0x48(0x08)
	Unknown SoundWaveAssetPtr; // 0x48(0x28)
	Unknown SoundWave; // 0x70(0x08)
	Unknown bLooping; // 0x78(0x01)
	Unknown SourceBusChannels; // 0x308(0x01)
	float SourceBusDuration; // 0x30c(0x04)
	Unknown bAutoDeactivateWhenSilent; // 0x310(0x01)
	Unknown ChildSubmixes; // 0x28(0x10)
	Unknown ParentSubmix; // 0x38(0x08)
	Unknown bMuteWhenBackgrounded; // 0x40(0x01)
	Unknown SubmixEffectChain; // 0x48(0x10)
	Unknown AmbisonicsPluginSettings; // 0x58(0x08)
	int32_t EnvelopeFollowerAttackTime; // 0x60(0x04)
	int32_t EnvelopeFollowerReleaseTime; // 0x64(0x04)
	float OutputVolume; // 0x68(0x04)
	struct FMulticastInlineDelegate OnSubmixRecordedFileDone; // 0x70(0x10)
	struct FName SoundfieldEncodingFormat; // 0x40(0x08)
	Unknown EncodingSettings; // 0x48(0x08)
	Unknown SoundfieldEffectChain; // 0x50(0x10)
	Unknown EncodingSettingsClass; // 0x60(0x08)
	struct FName EndpointType; // 0x38(0x08)
	Unknown EndpointSettingsClass; // 0x40(0x08)
	Unknown EndpointSettings; // 0x48(0x08)
	struct FName SoundfieldEndpointType; // 0x38(0x08)
	Unknown EndpointSettingsClass; // 0x40(0x08)
	Unknown EndpointSettings; // 0x48(0x08)
	Unknown EncodingSettingsClass; // 0x50(0x08)
	Unknown EncodingSettings; // 0x58(0x08)
	Unknown SoundfieldEffectChain; // 0x60(0x10)
	Unknown bIgnoreTimeDilation; // 0x150(0x01)
	Unknown DrawCaptureRadius; // 0x318(0x08)
	float InfluenceRadius; // 0x2c0(0x04)
	float CaptureDistanceScale; // 0x2c4(0x04)
	Unknown PreviewInfluenceRadius; // 0x2c8(0x08)
	Unknown SplineMeshComponent; // 0x310(0x08)
	Unknown SplineParams; // 0x558(0x58)
	Unknown SplineUpDir; // 0x5b0(0x0c)
	float SplineBoundaryMin; // 0x5bc(0x04)
	Unknown CachedMeshBodySetupGuid; // 0x5c0(0x10)
	Unknown BodySetup; // 0x5d0(0x08)
	float SplineBoundaryMax; // 0x5d8(0x04)
	Unknown bAllowSplineEditingPerInstance; // 0x5dc(0x01)
	Unknown bSmoothInterpRollScale; // 0x5dc(0x01)
	Unknown bMeshDirty; // 0x5dc(0x01)
	Unknown ForwardAxis; // 0x5dd(0x01)
	float VirtualTextureMainPassMaxDrawDistance; // 0x5e0(0x04)
	float InnerConeAngle; // 0x3b0(0x04)
	float OuterConeAngle; // 0x3b4(0x04)
	float LightShaftConeAngle; // 0x3b8(0x04)
	Unknown bUsePCSS; // 0x3bc(0x01)
	float PCSSSharpness; // 0x3c0(0x04)
	float PCSSContrast; // 0x3c4(0x04)
	float TargetArmLength; // 0x238(0x04)
	Unknown SocketOffset; // 0x23c(0x0c)
	Unknown TargetOffset; // 0x248(0x0c)
	float ProbeSize; // 0x254(0x04)
	Unknown ProbeChannel; // 0x258(0x01)
	Unknown bDoCollisionTest; // 0x25c(0x01)
	Unknown bUsePawnControlRotation; // 0x25c(0x01)
	Unknown bInheritPitch; // 0x25c(0x01)
	Unknown bInheritYaw; // 0x25c(0x01)
	Unknown bInheritRoll; // 0x25c(0x01)
	Unknown bEnableCameraLag; // 0x25c(0x01)
	Unknown bEnableCameraRotationLag; // 0x25c(0x01)
	Unknown bUseCameraLagSubstepping; // 0x25c(0x01)
	Unknown bDrawDebugLagMarkers; // 0x25d(0x01)
	float CameraLagSpeed; // 0x260(0x04)
	float CameraRotationLagSpeed; // 0x264(0x04)
	float CameraLagMaxTimeStep; // 0x268(0x04)
	float CameraLagMaxDistance; // 0x26c(0x04)
	Unknown bUseAsOccluderForSoftwareOcclusion; // 0x60(0x01)
	struct FName LODGroup; // 0x64(0x08)
	struct FName MeshStreamingGroup; // 0x6c(0x08)
	Unknown MinLOD; // 0x80(0x04)
	float LpvBiasMultiplier; // 0x84(0x04)
	Unknown StaticMaterials; // 0x88(0x10)
	float LightmapUVDensity; // 0x98(0x04)
	int32_t LightMapResolution; // 0x9c(0x04)
	int32_t LightMapCoordinateIndex; // 0xa0(0x04)
	float DistanceFieldSelfShadowBias; // 0xa4(0x04)
	Unknown BodySetup; // 0xa8(0x08)
	int32_t LODForCollision; // 0xb0(0x04)
	Unknown bGenerateMeshDistanceField; // 0xb4(0x01)
	Unknown bStripComplexCollisionForConsole; // 0xb4(0x01)
	Unknown bHasNavigationData; // 0xb4(0x01)
	Unknown bSupportUniformlyDistributedSampling; // 0xb4(0x01)
	Unknown bSupportPhysicalMaterialMasks; // 0xb4(0x01)
	Unknown bIsBuiltAtRuntime; // 0xb4(0x01)
	Unknown bAllowCPUAccess; // 0xb4(0x01)
	Unknown bSupportGpuUniformlyDistributedSampling; // 0xb5(0x01)
	Unknown Sockets; // 0xd8(0x10)
	Unknown PositiveBoundsExtension; // 0xf8(0x0c)
	Unknown NegativeBoundsExtension; // 0x104(0x0c)
	Unknown ExtendedBounds; // 0x110(0x1c)
	int32_t ElementToIgnoreForTexFactor; // 0x12c(0x04)
	Unknown AssetUserData; // 0x130(0x10)
	Unknown EditableMesh; // 0x148(0x08)
	Unknown NavCollision; // 0x150(0x08)
	struct FName SocketName; // 0x28(0x08)
	Unknown RelativeLocation; // 0x30(0x0c)
	Unknown RelativeRotation; // 0x3c(0x0c)
	Unknown RelativeScale; // 0x48(0x0c)
	struct FString Tag; // 0x58(0x10)
	Unknown bLiveTexture; // 0x238(0x01)
	Unknown bSupportsDepth; // 0x238(0x01)
	Unknown bNoAlphaChannel; // 0x238(0x01)
	Unknown Texture; // 0x240(0x08)
	Unknown LeftTexture; // 0x248(0x08)
	Unknown bQuadPreserveTextureRatio; // 0x250(0x01)
	Unknown QuadSize; // 0x254(0x08)
	Unknown UVRect; // 0x25c(0x14)
	float CylinderRadius; // 0x270(0x04)
	float CylinderOverlayArc; // 0x274(0x04)
	int32_t CylinderHeight; // 0x278(0x04)
	Unknown EquirectProps; // 0x27c(0x48)
	Unknown StereoLayerType; // 0x2c4(0x01)
	Unknown StereoLayerShape; // 0x2c5(0x01)
	Unknown Shape; // 0x2c8(0x08)
	int32_t Priority; // 0x2d0(0x04)
	float Radius; // 0x28(0x04)
	float OverlayArc; // 0x2c(0x04)
	int32_t Height; // 0x30(0x04)
	Unknown LeftUVRect; // 0x28(0x14)
	Unknown RightUVRect; // 0x3c(0x14)
	Unknown LeftScale; // 0x50(0x08)
	Unknown RightScale; // 0x58(0x08)
	Unknown LeftBias; // 0x60(0x08)
	Unknown RightBias; // 0x68(0x08)
	Unknown Settings; // 0x28(0x8c)
	Unknown SubUVTexture; // 0x28(0x08)
	int32_t SubImages_Horizontal; // 0x30(0x04)
	int32_t SubImages_Vertical; // 0x34(0x04)
	Unknown BoundingMode; // 0x38(0x01)
	Unknown OpacitySourceMode; // 0x39(0x01)
	float AlphaThreshold; // 0x3c(0x04)
	float FrameDelay; // 0x28(0x04)
	Unknown FrameRate; // 0x30(0x08)
	Unknown bGenerateFullFrame; // 0x38(0x01)
	Unknown bUseHighPerformanceClock; // 0x39(0x01)
	struct FText DefaultedText; // 0x28(0x18)
	struct FText UndefaultedText; // 0x40(0x18)
	struct FText TransientText; // 0x58(0x18)
	Unknown TextRender; // 0x310(0x08)
	struct FText Text; // 0x4b8(0x18)
	Unknown TextMaterial; // 0x4d0(0x08)
	Unknown Font; // 0x4d8(0x08)
	Unknown HorizontalAlignment; // 0x4e0(0x01)
	Unknown VerticalAlignment; // 0x4e1(0x01)
	Unknown TextRenderColor; // 0x4e4(0x04)
	float XScale; // 0x4e8(0x04)
	float YScale; // 0x4ec(0x04)
	float WorldSize; // 0x4f0(0x04)
	float InvDefaultSize; // 0x4f4(0x04)
	float HorizSpacingAdjust; // 0x4f8(0x04)
	float VertSpacingAdjust; // 0x4fc(0x04)
	Unknown bAlwaysRenderAsText; // 0x500(0x01)
	float Brightness; // 0xe8(0x04)
	float TextureMultiplier; // 0xec(0x04)
	int32_t SizeX; // 0xc0(0x04)
	Unknown ClearColor; // 0xc4(0x10)
	Unknown OverrideFormat; // 0xd4(0x01)
	Unknown bHDR; // 0xd5(0x01)
	Unknown bForceLinearGamma; // 0xd5(0x01)
	Unknown TheTimeline; // 0xb0(0x98)
	Unknown bIgnoreTimeDilation; // 0x148(0x01)
	float TimelineLength; // 0x28(0x04)
	Unknown LengthMode; // 0x2c(0x01)
	Unknown bAutoPlay; // 0x2d(0x01)
	Unknown bLoop; // 0x2d(0x01)
	Unknown bReplicated; // 0x2d(0x01)
	Unknown bIgnoreTimeDilation; // 0x2d(0x01)
	Unknown EventTracks; // 0x30(0x10)
	Unknown FloatTracks; // 0x40(0x10)
	Unknown VectorTracks; // 0x50(0x10)
	Unknown LinearColorTracks; // 0x60(0x10)
	Unknown MetaDataArray; // 0x70(0x10)
	Unknown TimelineGuid; // 0x80(0x10)
	struct FName VariableName; // 0x90(0x08)
	struct FName DirectionPropertyName; // 0x98(0x08)
	struct FName UpdateFunctionName; // 0xa0(0x08)
	struct FName FinishedFunctionName; // 0xa8(0x08)
	float FrictionScale; // 0x30(0x04)
	Unknown Controls; // 0x28(0x10)
	float ActiveOpacity; // 0x38(0x04)
	float InactiveOpacity; // 0x3c(0x04)
	float TimeUntilDeactive; // 0x40(0x04)
	float TimeUntilReset; // 0x44(0x04)
	float ActivationDelay; // 0x48(0x04)
	Unknown bPreventRecenter; // 0x4c(0x01)
	float StartupDelay; // 0x50(0x04)
	Unknown CollisionComponent; // 0x310(0x08)
	Unknown DisplayNameMap; // 0x60(0x50)
	Unknown status; // 0xc0(0x01)
	Unknown Guid; // 0xc4(0x10)
	Unknown RenderFocusRule; // 0x38(0x01)
	Unknown HardwareCursors; // 0x40(0x50)
	Unknown SoftwareCursors; // 0x90(0x50)
	Unknown DefaultCursor; // 0xe0(0x18)
	Unknown TextEditBeamCursor; // 0xf8(0x18)
	Unknown CrosshairsCursor; // 0x110(0x18)
	Unknown HandCursor; // 0x128(0x18)
	Unknown GrabHandCursor; // 0x140(0x18)
	Unknown GrabHandClosedCursor; // 0x158(0x18)
	Unknown SlashedCircleCursor; // 0x170(0x18)
	float ApplicationScale; // 0x188(0x04)
	Unknown UIScaleRule; // 0x18c(0x01)
	Unknown CustomScalingRuleClass; // 0x190(0x18)
	Unknown UIScaleCurve; // 0x1a8(0x88)
	Unknown bAllowHighDPIInGameMode; // 0x230(0x01)
	Unknown bLoadWidgetsOnDedicatedServer; // 0x231(0x01)
	Unknown CursorClasses; // 0x238(0x10)
	Unknown CustomScalingRuleClassInstance; // 0x248(0x08)
	Unknown CustomScalingRule; // 0x250(0x08)
	Unknown Bounds; // 0x28(0x1c)
	float Intensity; // 0x44(0x04)
	Unknown Texture; // 0x48(0x08)
	Unknown ConstructionOp; // 0x50(0x01)
	int32_t VolumeSizeX; // 0x54(0x04)
	int32_t VolumeSizeY; // 0x58(0x04)
	int32_t VolumeSizeZ; // 0x5c(0x04)
	int32_t SubImagesX; // 0x60(0x04)
	int32_t SubImagesY; // 0x64(0x04)
	int32_t FrameCount; // 0x68(0x04)
	float FramesPerSecond; // 0x6c(0x04)
	Unknown bLoop; // 0x70(0x01)
	Unknown NoiseField; // 0x78(0x08)
	float NoiseScale; // 0x80(0x04)
	float NoiseMax; // 0x84(0x04)
	Unknown VectorField; // 0x4b8(0x08)
	float Intensity; // 0x4c0(0x04)
	float Tightness; // 0x4c4(0x04)
	Unknown bPreviewVectorField; // 0x4c8(0x01)
	int32_t SizeX; // 0x48(0x04)
	int32_t SizeY; // 0x4c(0x04)
	int32_t SizeZ; // 0x50(0x04)
	Unknown bAllowCPUAccess; // 0x54(0x01)
	Unknown CPUData; // 0x80(0x10)
	Unknown VectorFieldComponent; // 0x310(0x08)
	Unknown TypeToLayer; // 0xe8(0x10)
	int32_t DefaultSizeInMegabyte; // 0x28(0x04)
	Unknown Pools; // 0x30(0x10)
	Unknown Settings; // 0xb0(0x18)
	Unknown AllowedMipLevelRange; // 0x348(0x08)
	Unknown Component; // 0x310(0x08)
	float Strength; // 0x238(0x04)
	float Speed; // 0x23c(0x04)
	float MinGustAmount; // 0x240(0x04)
	float MaxGustAmount; // 0x244(0x04)
	float Radius; // 0x248(0x04)
	Unknown bPointWind; // 0x24c(0x01)
	Unknown TilesStreaming; // 0x130(0x10)
	double TilesStreamingTimeThreshold; // 0x140(0x08)
	Unknown bLoadAllTilesDuringCinematic; // 0x148(0x01)
	Unknown bRebaseOriginIn3DSpace; // 0x149(0x01)
	float RebaseOriginDistance; // 0x14c(0x04)
	Unknown bApplyMinStreamingPriorityToLOD; // 0x150(0x01)
	Unknown bApplyStreamingDistanceScaleToLOD; // 0x151(0x01)
	Unknown DevFilterRule; // 0x158(0x10)
	Unknown HierarchicalLODSetup; // 0x28(0x10)
	Unknown OverrideBaseMaterial; // 0x38(0x28)
	int32_t NumLOD; // 0x28(0x04)
	Unknown LOD1; // 0x2c(0x13c)
	Unknown LOD2; // 0x168(0x13c)
	Unknown LOD3; // 0x2a4(0x13c)
	Unknown LOD4; // 0x3e0(0x13c)
	Unknown UberGraphFrame; // 0x310(0x08)
	Unknown Widget1; // 0x318(0x08)
	Unknown DefaultSceneRoot; // 0x320(0x08)
	Unknown Settings; // 0x30(0x70)
	float BlendWeight; // 0xa0(0x04)
	Unknown RenderingLogSeverity; // 0x28(0x01)
	Unknown ShowWarningsOnScreen; // 0x29(0x01)
	struct FString DeveloperOptions; // 0x30(0x10)
	Unknown Texture; // 0x70(0x08)
	Unknown SharedWorldData; // 0x3f8(0x10)
	struct FMulticastInlineDelegate OnNewLocalDataFromClients; // 0x408(0x10)
	float PinSelectionConfidenceThreshold; // 0x418(0x04)
	Unknown ChosenOne; // 0x4c0(0x08)
	Unknown SharedWorldData; // 0x380(0x10)
	Unknown AlignmentTransforms; // 0x390(0x10)
	struct FMulticastInlineDelegate OnSharedWorldDataUpdated; // 0x3a0(0x10)
	struct FMulticastInlineDelegate OnAlignmentTransformsUpdated; // 0x3b0(0x10)
	Unknown GeneratedMaterials; // 0x30(0x10)
	Unknown GeneratedMeshes; // 0x40(0x10)
	Unknown GeneratedTextures; // 0x50(0x10)
	Unknown ParameterDecorations; // 0xe8(0x10)
	Unknown TextureReuseCache; // 0x108(0x50)
	Unknown ReferencedMaterials; // 0x320(0x10)
	Unknown PhysicsAssetsToMerge; // 0x3d0(0x10)
	Unknown Materials; // 0x28(0x50)
	Unknown Textures; // 0x78(0x50)
	Unknown ReferenceSkeletalMesh; // 0x28(0x08)
	Unknown ReferenceStaticMesh; // 0x30(0x08)
	Unknown Relevancy; // 0x38(0x01)
	Unknown bDisableTextureLayoutManagement; // 0x39(0x01)
	Unknown ReferencedMaterials; // 0x40(0x10)
	Unknown ImageProperties; // 0x50(0x10)
	Unknown GroupNodeMap; // 0x60(0x50)
	Unknown ContributingMorphTargets; // 0xb0(0x10)
	Unknown MorphTargetReconstructionInfo; // 0xc0(0x10)
	Unknown VersionId; // 0xd0(0x10)
	Unknown ParameterProperties; // 0xe0(0x10)
	Unknown ParameterUIDataMap; // 0x140(0x50)
	Unknown StateUIDataMap; // 0x190(0x50)
	Unknown PhysicsAssetsMap; // 0x1e0(0x50)
	Unknown MaskOutCache; // 0x230(0x28)
	Unknown bIsChildObject; // 0x258(0x01)
	Unknown MaskOutCache_HardRef; // 0x260(0x08)
	Unknown CustomizableObject; // 0x28(0x08)
	Unknown SkeletalMesh; // 0x30(0x08)
	Unknown BoolParameters; // 0x38(0x10)
	Unknown IntParameters; // 0x48(0x10)
	Unknown FloatParameters; // 0x58(0x10)
	Unknown TextureParameters; // 0x68(0x10)
	Unknown VectorParameters; // 0x78(0x10)
	Unknown ProjectorParameters; // 0x88(0x10)
	Unknown bBuildParameterDecorations; // 0x98(0x01)
	struct FMulticastInlineDelegate UpdatedDelegate; // 0xa0(0x10)
	struct FString SkeletalMeshStatus; // 0x110(0x10)
	Unknown MaterialTags; // 0x140(0x10)
	Unknown PrivateData; // 0x1d0(0x08)
	Unknown Textures; // 0x28(0x10)
	Unknown PendingReleaseSkeletalMesh; // 0x28(0x10)
	Unknown PreviewExternalImageProvider; // 0x48(0x08)
	Unknown ProtectedCachedTextures; // 0x150(0x10)
	Unknown DefaultInstanceLODManagement; // 0x170(0x08)
	Unknown CurrentInstanceLODManagement; // 0x178(0x08)
	float SkippedLastRenderTime; // 0x23c(0x04)
	Unknown CustomizableObjectInstance; // 0x240(0x08)
	Unknown CustomizableSkeletalComponent; // 0x398(0x08)
	Unknown UberGraphFrame; // 0x330(0x08)
	Unknown AnimGraphNode_BlendListByEnum; // 0x338(0xb0)
	Unknown AnimGraphNode_SequencePlayer_3; // 0x3e8(0x78)
	Unknown AnimGraphNode_SequencePlayer_2; // 0x460(0x78)
	Unknown AnimGraphNode_SequencePlayer; // 0x4d8(0x78)
	Unknown AnimGraphNode_Slot_4; // 0x550(0x48)
	Unknown AnimGraphNode_TwoWayBlend; // 0x598(0xc8)
	Unknown AnimGraphNode_LayeredBoneBlend; // 0x660(0xc0)
	Unknown AnimGraphNode_LocalRefPose_3; // 0x720(0x18)
	Unknown AnimGraphNode_Root; // 0x738(0x30)
	Unknown AnimGraphNode_Slot_3; // 0x768(0x48)
	Unknown AnimGraphNode_Slot_2; // 0x7b0(0x48)
	Unknown AnimGraphNode_LocalRefPose_2; // 0x7f8(0x18)
	Unknown AnimGraphNode_LocalRefPose; // 0x810(0x18)
	Unknown AnimGraphNode_Slot; // 0x828(0x48)
	Unknown AnimGraphNode_BlendListByBool; // 0x870(0xa0)
	Unknown UberGraphFrame; // 0x248(0x08)
	Unknown FadeIn; // 0x250(0x08)
	Unknown FadeOut; // 0x258(0x08)
	Unknown Image; // 0x260(0x08)
	Unknown Image_2; // 0x268(0x08)
	Unknown Image_69; // 0x270(0x08)
	Unknown ListenerCode; // 0x38(0x08)
	struct FString Host; // 0x40(0x10)
	int32_t Port; // 0x50(0x04)
	int32_t PortUdp; // 0x54(0x04)
	Unknown SendingBytes; // 0x58(0x10)
	Unknown ReceivedBytes; // 0x68(0x10)
	Unknown ReceivingBuffer; // 0x78(0x10)
	Unknown CanCallOnDisconnect; // 0x98(0x01)
	struct FDelegate OnConnectEvent; // 0x9c(0x10)
	struct FDelegate OnDisconnectEvent; // 0xac(0x10)
	struct FDelegate OnReceiveMessageEvent; // 0xbc(0x10)
	struct FDelegate OnReceiveUnreliableMessageEvent; // 0xcc(0x10)
	Unknown Stopped; // 0x28(0x01)
	Unknown RunExec; // 0x29(0x01)
	Unknown ConnectionSuccess; // 0x2a(0x01)
	Unknown JustConnected; // 0x38(0x01)
	float WaitingForConnectionTime; // 0x3c(0x04)
	Unknown SocketConnection; // 0x40(0x08)
	int32_t LatentUUID; // 0x48(0x04)
	Unknown ListenerCode; // 0x38(0x08)
	struct FString Host; // 0x40(0x10)
	int32_t Port; // 0x50(0x04)
	int32_t PortUdp; // 0x54(0x04)
	int32_t NextConnectionValidationFunctionCallId; // 0x58(0x04)
	int32_t NextFunctionCallId; // 0x5c(0x04)
	int32_t NextLatentFunctionCallId; // 0xb0(0x04)
	Unknown SendingBytes; // 0x108(0x10)
	Unknown ReceivedBytes; // 0x118(0x10)
	Unknown ReceivingBuffer; // 0x128(0x10)
	Unknown ReceivingType; // 0x139(0x01)
	int32_t ReceivingFunctionCallId; // 0x13c(0x04)
	int32_t ReceivingPacketSize; // 0x140(0x04)
	Unknown ReceivingPacket; // 0x148(0x10)
	Unknown WaitingForConnectionValidationRespon; // 0x168(0x01)
	float ConnectionValidationResponseTime; // 0x16c(0x04)
	float ConnectionValidationDelayTime; // 0x170(0x04)
	float LatentFunctionConnectionValidationDelayTime; // 0x174(0x04)
	int32_t ConnectionValidationFunctionCallId; // 0x178(0x04)
	Unknown PeriodicConnectionValidationEnabled; // 0x17c(0x01)
	Unknown CanCallOnDisconnect; // 0x17d(0x01)
	struct FDelegate OnConnectEvent; // 0x180(0x10)
	struct FDelegate OnDisconnectEvent; // 0x190(0x10)
	struct FDelegate OnReceiveMessageEvent; // 0x1a0(0x10)
	struct FDelegate OnReceiveUnreliableMessageEvent; // 0x1b0(0x10)
	Unknown Stopped; // 0x28(0x01)
	Unknown RunExec; // 0x29(0x01)
	Unknown ConnectionSuccess; // 0x2a(0x01)
	Unknown JustConnected; // 0x38(0x01)
	float WaitingForConnectionTime; // 0x3c(0x04)
	Unknown SocketConnection; // 0x40(0x08)
	int32_t LatentUUID; // 0x48(0x04)
	Unknown TargetImageTexture; // 0x238(0x08)
	struct FString Name; // 0x240(0x10)
	float LongerDimension; // 0x250(0x04)
	Unknown bIsStationary; // 0x254(0x01)
	Unknown bUseUnreliablePose; // 0x255(0x01)
	struct FMulticastInlineDelegate OnSetImageTargetSucceeded; // 0x258(0x10)
	struct FMulticastInlineDelegate OnSetImageTargetFailed; // 0x268(0x10)
	struct FMulticastInlineDelegate OnImageTargetFound; // 0x278(0x10)
	struct FMulticastInlineDelegate OnImageTargetLost; // 0x288(0x10)
	struct FMulticastInlineDelegate OnImageTargetUnreliableTracking; // 0x298(0x10)
	struct FName playerName; // 0x80(0x08)
	struct FString FilePath; // 0x88(0x10)
	Unknown PrecacheFile; // 0x98(0x01)
	Unknown MediaTexture; // 0xb0(0x08)
	Unknown MediaPlayer; // 0xb8(0x08)
	struct FMulticastInlineDelegate OnEndReached; // 0x28(0x10)
	struct FMulticastInlineDelegate OnMediaClosed; // 0x38(0x10)
	struct FMulticastInlineDelegate OnMediaOpened; // 0x48(0x10)
	struct FMulticastInlineDelegate OnMediaOpenFailed; // 0x58(0x10)
	struct FMulticastInlineDelegate OnPlaybackResumed; // 0x68(0x10)
	struct FMulticastInlineDelegate OnPlaybackSuspended; // 0x78(0x10)
	struct FMulticastInlineDelegate OnSeekCompleted; // 0x88(0x10)
	struct FMulticastInlineDelegate OnTracksChanged; // 0x98(0x10)
	Unknown CacheAhead; // 0xa8(0x08)
	Unknown CacheBehind; // 0xb0(0x08)
	Unknown CacheBehindGame; // 0xb8(0x08)
	Unknown NativeAudioOut; // 0xc0(0x01)
	Unknown PlayOnOpen; // 0xc1(0x01)
	Unknown Shuffle; // 0xc4(0x01)
	Unknown Loop; // 0xc4(0x01)
	Unknown Playlist; // 0xc8(0x08)
	int32_t PlaylistIndex; // 0xd0(0x04)
	Unknown TimeDelay; // 0xd8(0x08)
	float HorizontalFieldOfView; // 0xe0(0x04)
	float VerticalFieldOfView; // 0xe4(0x04)
	Unknown ViewRotation; // 0xe8(0x0c)
	Unknown playerGUID; // 0x120(0x10)
	Unknown OwnerWidget; // 0x138(0x08)
	Unknown Items; // 0x28(0x10)
	Unknown Channels; // 0x710(0x04)
	Unknown DynamicRateAdjustment; // 0x714(0x01)
	float RateAdjustmentFactor; // 0x718(0x04)
	Unknown RateAdjustmentRange; // 0x71c(0x10)
	Unknown MediaPlayer; // 0x730(0x08)
	Unknown AddressX; // 0xb8(0x01)
	Unknown AddressY; // 0xb9(0x01)
	Unknown AutoClear; // 0xba(0x01)
	Unknown ClearColor; // 0xbc(0x10)
	Unknown EnableGenMips; // 0xcc(0x01)
	Unknown NumMips; // 0xcd(0x01)
	Unknown MediaPlayer; // 0xd0(0x08)
	Unknown MediaSource; // 0x80(0x08)
	struct FString StreamUrl; // 0x88(0x10)
	Unknown bUseTimeSynchronization; // 0x88(0x01)
	int32_t FrameDelay; // 0x8c(0x04)
	double TimeDelay; // 0x90(0x08)
	Unknown DestructibleComponent; // 0x310(0x08)
	struct FMulticastInlineDelegate OnActorFracture; // 0x318(0x10)
	Unknown bFractureEffectOverride; // 0x700(0x01)
	Unknown FractureEffects; // 0x708(0x10)
	Unknown bEnableHardSleeping; // 0x718(0x01)
	float LargeChunkThreshold; // 0x71c(0x04)
	struct FMulticastInlineDelegate OnComponentFracture; // 0x730(0x10)
	struct FMulticastInlineDelegate OnFractureEffectSpawned; // 0x740(0x10)
	int32_t CellSiteCount; // 0x28(0x04)
	Unknown FractureMaterialDesc; // 0x2c(0x24)
	int32_t RandomSeed; // 0x50(0x04)
	Unknown VoronoiSites; // 0x58(0x10)
	int32_t OriginalSubmeshCount; // 0x68(0x04)
	Unknown Materials; // 0x70(0x10)
	Unknown ChunkParameters; // 0x80(0x10)
	Unknown DefaultDestructibleParameters; // 0x380(0x88)
	Unknown FractureEffects; // 0x408(0x10)
	Unknown UberGraphFrame; // 0x248(0x08)
	Unknown Event2; // 0x250(0x08)
	Unknown Event; // 0x258(0x08)
	Unknown Anim_Second; // 0x260(0x08)
	Unknown Hide; // 0x268(0x08)
	Unknown Infos_ani; // 0x270(0x08)
	Unknown Anim_Defeat; // 0x278(0x08)
	Unknown Anim_Victory; // 0x280(0x08)
	Unknown Arrow; // 0x288(0x08)
	Unknown Arrow_2; // 0x290(0x08)
	Unknown ArrowLine; // 0x298(0x08)
	Unknown ArrowLine_2; // 0x2a0(0x08)
	Unknown BackgroundBlur; // 0x2a8(0x08)
	Unknown BackgroundBlur_447; // 0x2b0(0x08)
	Unknown BlackBG01; // 0x2b8(0x08)
	Unknown BlackBG02; // 0x2c0(0x08)
	Unknown BottomLine; // 0x2c8(0x08)
	Unknown BottomLine_2; // 0x2d0(0x08)
	Unknown Button; // 0x2d8(0x08)
	Unknown Button_2; // 0x2e0(0x08)
	Unknown Button_104; // 0x2e8(0x08)
	Unknown CanvasPanel_7; // 0x2f0(0x08)
	Unknown CanvasPanel_49; // 0x2f8(0x08)
	Unknown CanvasPanel_488; // 0x300(0x08)
	Unknown CanvasPanel_832; // 0x308(0x08)
	Unknown Glow1; // 0x310(0x08)
	Unknown Glow1_2; // 0x318(0x08)
	Unknown Glow2; // 0x320(0x08)
	Unknown Glow3; // 0x328(0x08)
	Unknown Glow3_2; // 0x330(0x08)
	Unknown GlowLine; // 0x338(0x08)
	Unknown HeadShot; // 0x340(0x08)
	Unknown HorizontalBox_KillerWeaponInfo; // 0x348(0x08)
	Unknown HorizontalBox_Rarity; // 0x350(0x08)
	Unknown Image_4; // 0x358(0x08)
	Unknown Image_5; // 0x360(0x08)
	Unknown Image_6; // 0x368(0x08)
	Unknown Image_7; // 0x370(0x08)
	Unknown Image_8; // 0x378(0x08)
	Unknown Image_16; // 0x380(0x08)
	Unknown Image_17; // 0x388(0x08)
	Unknown Image_18; // 0x390(0x08)
	Unknown Image_19; // 0x398(0x08)
	Unknown Image_20; // 0x3a0(0x08)
	Unknown Image_21; // 0x3a8(0x08)
	Unknown Image_22; // 0x3b0(0x08)
	Unknown Image_23; // 0x3b8(0x08)
	Unknown Image_252; // 0x3c0(0x08)
	Unknown Image_505; // 0x3c8(0x08)
	Unknown Image_1091; // 0x3d0(0x08)
	Unknown Image_1443; // 0x3d8(0x08)
	Unknown Image_1558; // 0x3e0(0x08)
	Unknown L_Wing01; // 0x3e8(0x08)
	Unknown L_Wing01_2; // 0x3f0(0x08)
	Unknown L_Wing01_3; // 0x3f8(0x08)
	Unknown L_Wing01_4; // 0x400(0x08)
	Unknown L_Wing02; // 0x408(0x08)
	Unknown L_Wing02_2; // 0x410(0x08)
	Unknown L_Wing02_3; // 0x418(0x08)
	Unknown L_Wing02_4; // 0x420(0x08)
	Unknown L_Wing03; // 0x428(0x08)
	Unknown L_Wing03_2; // 0x430(0x08)
	Unknown L_Wing03_3; // 0x438(0x08)
	Unknown L_Wing03_4; // 0x440(0x08)
	Unknown L_WingLine; // 0x448(0x08)
	Unknown L_WingLine_2; // 0x450(0x08)
	Unknown Logo; // 0x458(0x08)
	Unknown Logo_2; // 0x460(0x08)
	Unknown Overlay_1; // 0x468(0x08)
	Unknown Overlay_WeaponLevel; // 0x470(0x08)
	Unknown PosX; // 0x478(0x08)
	Unknown PosY; // 0x480(0x08)
	Unknown PosZ; // 0x488(0x08)
	Unknown R_Wing01; // 0x490(0x08)
	Unknown R_Wing01_2; // 0x498(0x08)
	Unknown R_Wing01_3; // 0x4a0(0x08)
	Unknown R_Wing01_4; // 0x4a8(0x08)
	Unknown R_Wing02; // 0x4b0(0x08)
	Unknown R_Wing02_2; // 0x4b8(0x08)
	Unknown R_Wing02_3; // 0x4c0(0x08)
	Unknown R_Wing02_4; // 0x4c8(0x08)
	Unknown R_Wing03; // 0x4d0(0x08)
	Unknown R_Wing03_2; // 0x4d8(0x08)
	Unknown R_Wing03_3; // 0x4e0(0x08)
	Unknown R_Wing03_4; // 0x4e8(0x08)
	Unknown R_WingLine; // 0x4f0(0x08)
	Unknown R_WingLine_2; // 0x4f8(0x08)
	Unknown Ribbon; // 0x500(0x08)
	Unknown Ribbon_2; // 0x508(0x08)
	Unknown Ring; // 0x510(0x08)
	Unknown ScrollBox_1; // 0x518(0x08)
	Unknown T_DamageType; // 0x520(0x08)
	Unknown T_WeaponLevel; // 0x528(0x08)
	Unknown TextBlock_3; // 0x530(0x08)
	Unknown TextBlock_4; // 0x538(0x08)
	Unknown TextBlock_5; // 0x540(0x08)
	Unknown TextBlock_6; // 0x548(0x08)
	Unknown TextBlock_8; // 0x550(0x08)
	Unknown TextBlock_9; // 0x558(0x08)
	Unknown TextBlock_10; // 0x560(0x08)
	Unknown TextBlock_11; // 0x568(0x08)
	Unknown TextBlock_900; // 0x570(0x08)
	Unknown TopLine; // 0x578(0x08)
	Unknown TopLine_2; // 0x580(0x08)
	Unknown U; // 0x588(0x08)
	Unknown U; // 0x590(0x08)
	Unknown WeaponName; // 0x598(0x08)
	Unknown WidgetSwitcher_DamageCauser; // 0x5a0(0x08)
	Unknown WinText1; // 0x5a8(0x08)
	Unknown WinText1_2; // 0x5b0(0x08)
	Unknown WinText1_3; // 0x5b8(0x08)
	Unknown WinText1_4; // 0x5c0(0x08)
	Unknown WinText2; // 0x5c8(0x08)
	Unknown WinText3; // 0x5d0(0x08)
	Unknown MatchEnd; // 0x5d8(0x01)
	Unknown AnimationData; // 0x5d9(0x02)
	Unknown MatchEndWidgetRef; // 0x5e0(0x08)
	Unknown SimpleResult; // 0x5e8(0xa8)
	Unknown SimpleTimer; // 0x690(0x10)
	struct FMulticastInlineDelegate EventDispatcher_HideComplete; // 0x6a0(0x10)
	Unknown bSuccessWinEventCall; // 0x6b0(0x01)
	Unknown PlayingAudio; // 0x6b8(0x10)
	Unknown bTestMode; // 0x6c8(0x01)
	Unknown bTestIsWin; // 0x6c9(0x01)
	float MatchFinalResultShowTime; // 0x6cc(0x04)
	struct FString UniqueKey; // 0x320(0x10)
	Unknown SideActors; // 0x330(0x10)
	Unknown SideMeshes; // 0x340(0x10)
	Unknown SplineMeshAxis; // 0x310(0x01)
	Unknown LocalOffset; // 0x314(0x0c)
	Unknown Father; // 0x320(0x08)
	struct FString UniqueKey; // 0x328(0x10)
	Unknown Spline; // 0x338(0x08)
	int32_t Index; // 0x340(0x04)
	int32_t Segmentation; // 0x344(0x04)
	int32_t StepGeneration; // 0x348(0x04)
	float Size; // 0x34c(0x04)
	Unknown RoadMesh; // 0x350(0x08)
	Unknown RoadMeshesComp; // 0x358(0x10)
	Unknown SideActors; // 0x368(0x10)
	Unknown SideMeshes; // 0x378(0x10)
	Unknown SideCurbs; // 0x388(0x10)
	struct FMulticastInlineDelegate InAppPurchaseLogMessage; // 0xb0(0x10)
	struct FMulticastInlineDelegate GetItemsDetailsSuccess; // 0xc0(0x10)
	struct FMulticastInlineDelegate GetItemsDetailsFailure; // 0xd0(0x10)
	struct FMulticastInlineDelegate PurchaseConfirmationSuccess; // 0xe0(0x10)
	struct FMulticastInlineDelegate PurchaseConfirmationFailure; // 0xf0(0x10)
	struct FMulticastInlineDelegate GetPurchaseHistorySuccess; // 0x100(0x10)
	struct FMulticastInlineDelegate GetPurchaseHistoryFailure; // 0x110(0x10)
	struct FMulticastInlineDelegate DeviceHasReactivatedDelegate; // 0x140(0x10)
	struct FMulticastInlineDelegate DeviceWillEnterRealityModeDelegate; // 0x150(0x10)
	struct FMulticastInlineDelegate DeviceWillGoInStandbyDelegate; // 0x160(0x10)
	struct FMulticastInlineDelegate FocusLostDelegate; // 0x170(0x10)
	struct FMulticastInlineDelegate FocusGainedDelegate; // 0x180(0x10)
	struct FMulticastInlineDelegate OnHeadTrackingLost; // 0x140(0x10)
	struct FMulticastInlineDelegate OnHeadTrackingRecov; // 0x150(0x10)
	struct FMulticastInlineDelegate OnHeadTrackingRecovngNo; // 0x160(0x10)
	struct FMulticastInlineDelegate OnHeadTrackingNewSessionStarted; // 0x170(0x10)
	struct FMulticastInlineDelegate OnMeshTrackerUpdated; // 0x240(0x10)
	Unknown ScanWorld; // 0x250(0x01)
	Unknown MeshType; // 0x251(0x01)
	Unknown BoundingVolume; // 0x258(0x08)
	Unknown LevelOfDetail; // 0x260(0x01)
	float PerimeterOfGapsToFill; // 0x264(0x04)
	Unknown Planarize; // 0x268(0x01)
	float DisconnectedSectionArea; // 0x26c(0x04)
	Unknown RequestNormals; // 0x270(0x01)
	Unknown RequestVertexConfidence; // 0x271(0x01)
	Unknown VertexColorMode; // 0x272(0x01)
	Unknown BlockVertexColors; // 0x278(0x10)
	Unknown VertexColorFromConfidenceZero; // 0x288(0x10)
	Unknown VertexColorFromConfidenceOne; // 0x298(0x10)
	Unknown RemoveOverlappingTriangles; // 0x2a8(0x01)
	Unknown MRMesh; // 0x2b0(0x08)
	int32_t BricksPerFrame; // 0x2b8(0x04)
	Unknown bEnableZI; // 0x28(0x01)
	Unknown bUseVulkanForZI; // 0x29(0x01)
	Unknown bUseMLAudioForZI; // 0x2a(0x01)
	Unknown FrameRateOverride; // 0x88(0x08)
	struct FString ProxyOverride; // 0x90(0x10)
	Unknown SequencePath; // 0xa0(0x10)
	Unknown DefaultFrameRate; // 0x28(0x08)
	float CacheBehindPercentage; // 0x30(0x04)
	float CacheSizeGB; // 0x34(0x04)
	int32_t CacheThreads; // 0x38(0x04)
	int32_t CacheThreadStackSizeKB; // 0x3c(0x04)
	float GlobalCacheSizeGB; // 0x40(0x04)
	Unknown UseGlobalCache; // 0x44(0x01)
	uint32_t ExrDecoderThreads; // 0x48(0x04)
	struct FString DefaultProxy; // 0x50(0x10)
	Unknown UseDefaultProxy; // 0x60(0x01)
	Unknown UberGraphFrame; // 0x258(0x08)
	Unknown btn_Cancel; // 0x260(0x08)
	Unknown btn_confirm; // 0x268(0x08)
	Unknown popup; // 0x270(0x08)
	Unknown txt_description; // 0x278(0x08)
	Unknown uw; // 0x280(0x08)
	Unknown UberGraphFrame; // 0x248(0x08)
	Unknown Button_Request; // 0x250(0x08)
	Unknown Image_955; // 0x258(0x08)
	Unknown Image_1208; // 0x260(0x08)
	Unknown SizeBox_77; // 0x268(0x08)
	Unknown SizeBox_78; // 0x270(0x08)
	Unknown Text_Price; // 0x278(0x08)
	Unknown TextBlock_767; // 0x280(0x08)
	Unknown WidgetSwitcher_Price; // 0x288(0x08)
	Unknown PlayerControllerRef; // 0x290(0x08)
	Unknown bCanRequest; // 0x298(0x01)
	Unknown bRequest; // 0x299(0x01)
	struct FText RequstingResuscitationText; // 0x2a0(0x18)
	float RequestingSizeBoxWidth; // 0x2b8(0x04)
	Unknown RequestTextColor; // 0x2c0(0x28)
	Unknown RequestingTextColor; // 0x2e8(0x28)
	float RequestingSizeBoxInitWidth; // 0x310(0x04)
	struct FText RequstingResuscitationInitText; // 0x318(0x18)
	Unknown InitButtonStyle; // 0x330(0x278)
	Unknown RequestingButtonStyle; // 0x5a8(0x278)
	Unknown CanRequestButtonStyle; // 0x820(0x278)
	Unknown bHideWorkInProgress; // 0x28(0x01)
	Unknown MainTab; // 0x29(0x01)
	Unknown WeaponSubTab; // 0x2a(0x01)
	Unknown AttachmentSubTab; // 0x2b(0x01)
	Unknown WearableSubTab; // 0x2c(0x01)
	Unknown CustomSubTab; // 0x2d(0x01)
	Unknown GearSubTab; // 0x2e(0x01)
	Unknown BravoHotelShellCasingArrow_Clip; // 0x22f0(0x08)
	struct FString PackageURL; // 0x38(0x10)
	Unknown ParentFactory; // 0x48(0x08)
	Unknown ImageSources; // 0x50(0x50)
	Unknown CreatedMaterial; // 0xa0(0x08)
	Unknown ConstantCreatedMaterial; // 0xa8(0x08)
	Unknown DynamicCreatedMaterial; // 0xb0(0x08)
	Unknown OutputTextureLinkData; // 0xb8(0x50)
	Unknown OutputInstances; // 0x108(0x50)
	Unknown bIsFrozen; // 0x158(0x01)
	Unknown mGraphInstances; // 0x28(0x10)
	struct FString RelativeSourceFilePath; // 0x50(0x10)
	struct FString AbsoluteSourceFilePath; // 0x60(0x10)
	struct FString SourceFileTimestamp; // 0x70(0x10)
	Unknown GenerationMode; // 0x80(0x01)
	Unknown ConnectedObject; // 0x28(0x08)
	Unknown ParamInfo; // 0x30(0x10)
	Unknown ParentInstance; // 0x40(0x08)
	Unknown CacheGuid; // 0x48(0x10)
	int32_t MemoryBudgetMb; // 0x28(0x04)
	int32_t CPUCores; // 0x2c(0x04)
	int32_t AsyncLoadMipClip; // 0x30(0x04)
	int32_t MaxAsyncSubstancesRenderedPerFr; // 0x34(0x04)
	Unknown SubstanceEngine; // 0x38(0x01)
	Unknown DefaultSubstanceOutputSizeX; // 0x39(0x01)
	Unknown DefaultSubstanceOutputSizeY; // 0x3a(0x01)
	Unknown DefaultTemplateMaterial; // 0x40(0x28)
	Unknown ParentInstance; // 0x100(0x08)
	Unknown AddressX; // 0x108(0x01)
	Unknown AddressY; // 0x109(0x01)
	Unknown bCooked; // 0x10a(0x01)
	Unknown Slot; // 0x28(0x08)
	struct FDelegate bIsEnabledDelegate; // 0x30(0x10)
	struct FText ToolTipText; // 0x40(0x18)
	struct FDelegate ToolTipTextDelegate; // 0x58(0x10)
	Unknown ToolTipWidget; // 0x68(0x08)
	struct FDelegate ToolTipWidgetDelegate; // 0x70(0x10)
	struct FDelegate VisibilityDelegate; // 0x80(0x10)
	Unknown RenderTransform; // 0x90(0x1c)
	Unknown RenderTransformPivot; // 0xac(0x08)
	Unknown bIsVariable; // 0xb4(0x01)
	Unknown bCreatedByConstructionScript; // 0xb4(0x01)
	Unknown bIsEnabled; // 0xb4(0x01)
	Unknown bOverride_Cursor; // 0xb4(0x01)
	Unknown AccessibleWidgetData; // 0xb8(0x08)
	Unknown bIsVolatile; // 0xc0(0x01)
	Unknown Cursor; // 0xc1(0x01)
	Unknown Clipping; // 0xc2(0x01)
	Unknown Visibility; // 0xc3(0x01)
	float RenderOpacity; // 0xc4(0x04)
	Unknown Navigation; // 0xc8(0x08)
	Unknown FlowDirectionPreference; // 0xd0(0x01)
	Unknown NativeBindings; // 0xf8(0x10)
	Unknown ColorAndOpacity; // 0x110(0x10)
	struct FDelegate ColorAndOpacityDelegate; // 0x120(0x10)
	Unknown ForegroundColor; // 0x130(0x28)
	struct FDelegate ForegroundColorDelegate; // 0x158(0x10)
	Unknown Padding; // 0x168(0x10)
	Unknown ActiveSequencePlayers; // 0x178(0x10)
	Unknown StoppedSequencePlayers; // 0x188(0x10)
	Unknown NoPixelSnapping; // 0x198(0x01)
	struct FDelegate NoPixelSnappingDelegate; // 0x19c(0x10)
	Unknown NamedSlotBindings; // 0x1b0(0x10)
	Unknown WidgetTree; // 0x1c0(0x08)
	int32_t Priority; // 0x1c8(0x04)
	Unknown bSupportsKeyboardFocus; // 0x1cc(0x01)
	Unknown bIsFocusable; // 0x1cc(0x01)
	Unknown bStopAction; // 0x1cc(0x01)
	Unknown bHasScriptImplementedTick; // 0x1cc(0x01)
	Unknown bHasScriptImplementedPaint; // 0x1cc(0x01)
	Unknown bCookedWidgetTree; // 0x1cc(0x01)
	Unknown TickFrequency; // 0x1d8(0x01)
	Unknown InputComponent; // 0x1e0(0x08)
	Unknown AnimationCallbacks; // 0x1e8(0x10)
	Unknown Slots; // 0x108(0x10)
	Unknown HorizontalAlignment; // 0x120(0x01)
	Unknown VerticalAlignment; // 0x121(0x01)
	Unknown bShowEffectWhenDisabled; // 0x122(0x01)
	Unknown ContentColorAndOpacity; // 0x124(0x10)
	struct FDelegate ContentColorAndOpacityDelegate; // 0x134(0x10)
	Unknown Padding; // 0x144(0x10)
	Unknown Background; // 0x158(0x88)
	struct FDelegate BackgroundDelegate; // 0x1e0(0x10)
	Unknown BrushColor; // 0x1f0(0x10)
	struct FDelegate BrushColorDelegate; // 0x200(0x10)
	Unknown DesiredSizeScale; // 0x210(0x08)
	Unknown bFlipForRightToLeftFlowDirection; // 0x218(0x01)
	struct FDelegate OnMouseButtonDownEv; // 0x21c(0x10)
	struct FDelegate OnMouseButtonUpEvent; // 0x22c(0x10)
	struct FDelegate OnMouseMoveEvent; // 0x23c(0x10)
	struct FDelegate OnMouseDoubleClickEvent; // 0x24c(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x40(0x10)
	Unknown Padding; // 0x120(0x10)
	Unknown HorizontalAlignment; // 0x130(0x01)
	Unknown VerticalAlignment; // 0x131(0x01)
	Unknown bApplyAlphaToBlur; // 0x132(0x01)
	float BlurStrength; // 0x134(0x04)
	Unknown bOverrideAutoRadiusCalculation; // 0x138(0x01)
	int32_t BlurRadius; // 0x13c(0x04)
	Unknown LowQualityFallbackBrush; // 0x140(0x88)
	Unknown Parent; // 0x28(0x08)
	Unknown Content; // 0x30(0x08)
	Unknown Padding; // 0x38(0x10)
	Unknown HorizontalAlignment; // 0x48(0x01)
	Unknown VerticalAlignment; // 0x49(0x01)
	Unknown SourceObject; // 0x28(0x08)
	Unknown SourcePath; // 0x30(0x28)
	struct FName DestinationProperty; // 0x58(0x08)
	Unknown Padding; // 0x38(0x10)
	Unknown HorizontalAlignment; // 0x48(0x01)
	Unknown VerticalAlignment; // 0x49(0x01)
	Unknown Style; // 0x160(0x08)
	Unknown WidgetStyle; // 0x168(0x278)
	Unknown ColorAndOpacity; // 0x3e0(0x10)
	Unknown BackgroundColor; // 0x3f0(0x10)
	Unknown ClickMethod; // 0x400(0x01)
	Unknown TouchMethod; // 0x401(0x01)
	Unknown PressMethod; // 0x402(0x01)
	Unknown IsFocusable; // 0x403(0x01)
	struct FMulticastInlineDelegate OnClicked; // 0x408(0x10)
	struct FMulticastInlineDelegate OnPressed; // 0x418(0x10)
	struct FMulticastInlineDelegate OnReleased; // 0x428(0x10)
	struct FMulticastInlineDelegate OnHovered; // 0x438(0x10)
	struct FMulticastInlineDelegate OnUnhovered; // 0x448(0x10)
	Unknown Padding; // 0x38(0x10)
	Unknown HorizontalAlignment; // 0x48(0x01)
	Unknown VerticalAlignment; // 0x49(0x01)
	Unknown LayoutData; // 0x38(0x28)
	Unknown bAutoSize; // 0x60(0x01)
	int32_t ZOrder; // 0x64(0x04)
	Unknown CheckedState; // 0x120(0x01)
	struct FDelegate CheckedStateDelegate; // 0x124(0x10)
	Unknown WidgetStyle; // 0x138(0x580)
	Unknown Style; // 0x6b8(0x08)
	Unknown UncheckedImage; // 0x6c0(0x08)
	Unknown UncheckedHoveredImage; // 0x6c8(0x08)
	Unknown UncheckedPressedImage; // 0x6d0(0x08)
	Unknown CheckedImage; // 0x6d8(0x08)
	Unknown CheckedHoveredImage; // 0x6e0(0x08)
	Unknown CheckedPressedImage; // 0x6e8(0x08)
	Unknown UndeterminedImage; // 0x6f0(0x08)
	Unknown UndeterminedHoveredImage; // 0x6f8(0x08)
	Unknown UndeterminedPressedImage; // 0x700(0x08)
	Unknown HorizontalAlignment; // 0x708(0x01)
	Unknown Padding; // 0x70c(0x10)
	Unknown BorderBackgroundColor; // 0x720(0x28)
	Unknown IsFocusable; // 0x748(0x01)
	struct FMulticastInlineDelegate OnCheckStateChanged; // 0x750(0x10)
	int32_t NumberOfPieces; // 0x108(0x04)
	float Period; // 0x10c(0x04)
	float Radius; // 0x110(0x04)
	Unknown PieceImage; // 0x118(0x08)
	Unknown Image; // 0x120(0x88)
	Unknown bEnableRadius; // 0x1a8(0x01)
	Unknown Items; // 0x108(0x10)
	struct FDelegate OnGenerateWidgetEvent; // 0x118(0x10)
	Unknown bIsFocusable; // 0x128(0x01)
	Unknown DefaultOptions; // 0x108(0x10)
	struct FString SelectedOption; // 0x118(0x10)
	Unknown WidgetStyle; // 0x128(0x3f0)
	Unknown ItemStyle; // 0x518(0x7c8)
	Unknown ContentPadding; // 0xce0(0x10)
	float MaxListHeight; // 0xcf0(0x04)
	Unknown HasDownArrow; // 0xcf4(0x01)
	Unknown EnableGamepadNavigationMode; // 0xcf5(0x01)
	Unknown Font; // 0xcf8(0x50)
	Unknown ForegroundColor; // 0xd48(0x28)
	Unknown bIsFocusable; // 0xd70(0x01)
	struct FDelegate OnGenerateWidgetEvent; // 0xd74(0x10)
	struct FMulticastInlineDelegate OnSelectionChanged; // 0xd88(0x10)
	struct FMulticastInlineDelegate OnOpening; // 0xd98(0x10)
	struct FString Tag; // 0x28(0x10)
	Unknown payload; // 0x38(0x08)
	Unknown DefaultDragVisual; // 0x40(0x08)
	Unknown Pivot; // 0x48(0x01)
	Unknown Offset; // 0x4c(0x08)
	Unknown bUseMoveAnimation; // 0x54(0x01)
	struct FMulticastInlineDelegate OnDrop; // 0x58(0x10)
	struct FMulticastInlineDelegate OnDragCancelled; // 0x68(0x10)
	struct FMulticastInlineDelegate OnDragged; // 0x78(0x10)
	Unknown EntryBoxType; // 0x108(0x01)
	Unknown EntrySpacing; // 0x10c(0x08)
	Unknown SpacingPattern; // 0x118(0x10)
	Unknown EntrySizeRule; // 0x128(0x08)
	Unknown EntryHorizontalAlignment; // 0x130(0x01)
	Unknown EntryVerticalAlignment; // 0x131(0x01)
	int32_t MaxElementSize; // 0x134(0x04)
	Unknown EntryWidgetPool; // 0x148(0x80)
	Unknown EntryWidgetClass; // 0x1c8(0x08)
	struct FText Text; // 0x108(0x18)
	struct FDelegate TextDelegate; // 0x120(0x10)
	struct FText HintText; // 0x130(0x18)
	struct FDelegate HintTextDelegate; // 0x148(0x10)
	Unknown WidgetStyle; // 0x158(0x218)
	Unknown Style; // 0x370(0x08)
	Unknown BackgroundImageSelected; // 0x378(0x08)
	Unknown BackgroundImageComposing; // 0x380(0x08)
	Unknown CaretImage; // 0x388(0x08)
	Unknown Font; // 0x390(0x50)
	Unknown ColorAndOpacity; // 0x3e0(0x28)
	Unknown IsReadOnly; // 0x408(0x01)
	Unknown IsPassword; // 0x409(0x01)
	float MinimumDesiredWidth; // 0x40c(0x04)
	Unknown IsCaretMovedWhenGainFocus; // 0x410(0x01)
	Unknown SelectAllTextWhenFocused; // 0x411(0x01)
	Unknown RevertTextOnEscape; // 0x412(0x01)
	Unknown ClearKeyboardFocusOnCommit; // 0x413(0x01)
	Unknown SelectAllTextOnCommit; // 0x414(0x01)
	Unknown AllowContextMenu; // 0x415(0x01)
	Unknown KeyboardType; // 0x416(0x01)
	Unknown VirtualKeyboardOptions; // 0x417(0x01)
	Unknown VirtualKeyboardTrigger; // 0x418(0x01)
	Unknown VirtualKeyboardDismissAction; // 0x419(0x01)
	Unknown Justification; // 0x41a(0x01)
	Unknown ShapedTextOptions; // 0x41b(0x03)
	struct FMulticastInlineDelegate OnTextChanged; // 0x420(0x10)
	struct FMulticastInlineDelegate OnTextCommitted; // 0x430(0x10)
	struct FText Text; // 0x108(0x18)
	struct FDelegate TextDelegate; // 0x120(0x10)
	Unknown WidgetStyle; // 0x130(0x7f0)
	Unknown Style; // 0x920(0x08)
	struct FText HintText; // 0x928(0x18)
	struct FDelegate HintTextDelegate; // 0x940(0x10)
	Unknown Font; // 0x950(0x50)
	Unknown ForegroundColor; // 0x9a0(0x10)
	Unknown BackgroundColor; // 0x9b0(0x10)
	Unknown ReadOnlyForegroundColor; // 0x9c0(0x10)
	Unknown IsReadOnly; // 0x9d0(0x01)
	Unknown IsPassword; // 0x9d1(0x01)
	float MinimumDesiredWidth; // 0x9d4(0x04)
	Unknown Padding; // 0x9d8(0x10)
	Unknown IsCaretMovedWhenGainFocus; // 0x9e8(0x01)
	Unknown SelectAllTextWhenFocused; // 0x9e9(0x01)
	Unknown RevertTextOnEscape; // 0x9ea(0x01)
	Unknown ClearKeyboardFocusOnCommit; // 0x9eb(0x01)
	Unknown SelectAllTextOnCommit; // 0x9ec(0x01)
	Unknown AllowContextMenu; // 0x9ed(0x01)
	Unknown KeyboardType; // 0x9ee(0x01)
	Unknown VirtualKeyboardOptions; // 0x9ef(0x01)
	Unknown VirtualKeyboardTrigger; // 0x9f0(0x01)
	Unknown VirtualKeyboardDismissAction; // 0x9f1(0x01)
	Unknown Justification; // 0x9f2(0x01)
	Unknown ShapedTextOptions; // 0x9f3(0x03)
	struct FMulticastInlineDelegate OnTextChanged; // 0x9f8(0x10)
	struct FMulticastInlineDelegate OnTextCommitted; // 0xa08(0x10)
	Unknown Style; // 0x110(0x120)
	Unknown BorderBrush; // 0x230(0x88)
	Unknown BorderColor; // 0x2b8(0x28)
	Unknown bIsExpanded; // 0x2e0(0x01)
	float MaxHeight; // 0x2e4(0x04)
	Unknown HeaderPadding; // 0x2e8(0x10)
	Unknown AreaPadding; // 0x2f8(0x10)
	struct FMulticastInlineDelegate OnExpansionChanged; // 0x308(0x10)
	Unknown HeaderContent; // 0x318(0x08)
	Unknown BodyContent; // 0x320(0x08)
	Unknown ColumnFill; // 0x120(0x10)
	Unknown RowFill; // 0x130(0x10)
	Unknown Padding; // 0x38(0x10)
	Unknown HorizontalAlignment; // 0x48(0x01)
	Unknown VerticalAlignment; // 0x49(0x01)
	int32_t Row; // 0x4c(0x04)
	int32_t RowSpan; // 0x50(0x04)
	int32_t Column; // 0x54(0x04)
	int32_t ColumnSpan; // 0x58(0x04)
	int32_t Layer; // 0x5c(0x04)
	Unknown Nudge; // 0x60(0x08)
	Unknown Padding; // 0x40(0x10)
	Unknown Size; // 0x50(0x08)
	Unknown HorizontalAlignment; // 0x58(0x01)
	Unknown VerticalAlignment; // 0x59(0x01)
	Unknown Brush; // 0x108(0x88)
	struct FDelegate BrushDelegate; // 0x190(0x10)
	Unknown ColorAndOpacity; // 0x1a0(0x10)
	struct FDelegate ColorAndOpacityDelegate; // 0x1b0(0x10)
	Unknown bFlipForRightToLeftFlowDirection; // 0x1c0(0x01)
	struct FDelegate OnMouseButtonDownEv; // 0x1c4(0x10)
	Unknown WidgetStyle; // 0x108(0x278)
	Unknown TextStyle; // 0x380(0x268)
	Unknown SelectedKey; // 0x5e8(0x20)
	Unknown Font; // 0x608(0x50)
	Unknown Margin; // 0x658(0x10)
	Unknown ColorAndOpacity; // 0x668(0x10)
	struct FText KeySelectionText; // 0x678(0x18)
	struct FText NoKeySpecifiedText; // 0x690(0x18)
	Unknown bAllowModifierKeys; // 0x6a8(0x01)
	Unknown bAllowGamepadKeys; // 0x6a9(0x01)
	Unknown EscapeKeys; // 0x6b0(0x10)
	struct FMulticastInlineDelegate OnKeySelected; // 0x6c0(0x10)
	struct FMulticastInlineDelegate OnIsSelectingKeyChanged; // 0x6d0(0x10)
	Unknown bCanCache; // 0x120(0x01)
	Unknown CacheRelativeTransforms; // 0x121(0x01)
	Unknown EntryWidgetClass; // 0x108(0x08)
	float WheelScrollMultiplier; // 0x110(0x04)
	Unknown bEnableScrollAnimation; // 0x114(0x01)
	Unknown bEnableFixedLineOffset; // 0x115(0x01)
	float FixedLineScrollOffset; // 0x118(0x04)
	struct FMulticastInlineDelegate BP_OnEntryGenerated; // 0x120(0x10)
	struct FMulticastInlineDelegate BP_OnEntryReleased; // 0x130(0x10)
	Unknown EntryWidgetPool; // 0x140(0x80)
	Unknown Orientation; // 0x2d8(0x01)
	Unknown SelectionMode; // 0x2d9(0x01)
	Unknown ConsumeMouseWheel; // 0x2da(0x01)
	Unknown bClearSelectionOnClick; // 0x2db(0x01)
	Unknown bIsFocusable; // 0x2dc(0x01)
	float EntrySpacing; // 0x2e0(0x04)
	Unknown bReturnFocusToSelection; // 0x2e4(0x01)
	Unknown ListItems; // 0x2e8(0x10)
	struct FMulticastInlineDelegate BP_OnEntryInitialized; // 0x308(0x10)
	struct FMulticastInlineDelegate BP_OnItemClicked; // 0x318(0x10)
	struct FMulticastInlineDelegate BP_OnItemDoubleClicked; // 0x328(0x10)
	struct FMulticastInlineDelegate BP_OnItemIsHoveredChanged; // 0x338(0x10)
	struct FMulticastInlineDelegate BP_OnItemSelectionChanged; // 0x348(0x10)
	struct FMulticastInlineDelegate BP_OnItemScrolledIntoView; // 0x358(0x10)
	Unknown MenuClass; // 0x120(0x08)
	struct FDelegate OnGetMenuContentEvent; // 0x128(0x10)
	Unknown Placement; // 0x138(0x01)
	Unknown bFitInWindow; // 0x139(0x01)
	Unknown ShouldDeferPaintingAfterWindowContenj; // 0x13a(0x01)
	Unknown UseApplicationMenuStack; // 0x13b(0x01)
	struct FMulticastInlineDelegate OnMenuOpenChanged; // 0x140(0x10)
	Unknown TransformMask; // 0xe0(0x04)
	Unknown Translation; // 0xe8(0x140)
	Unknown Rotation; // 0x228(0xa0)
	Unknown Scale; // 0x2c8(0x140)
	Unknown Shear; // 0x408(0x140)
	Unknown TopCurve; // 0xe0(0xa0)
	Unknown LeftCurve; // 0x180(0xa0)
	Unknown RightCurve; // 0x220(0xa0)
	Unknown BottomCurve; // 0x2c0(0xa0)
	Unknown BrushPropertyNamePath; // 0x68(0x10)
	struct FName TrackName; // 0x78(0x08)
	Unknown ShapedTextOptions; // 0x108(0x03)
	Unknown Justification; // 0x10b(0x01)
	Unknown WrappingPolicy; // 0x10c(0x01)
	Unknown AutoWrapText; // 0x10d(0x01)
	float WrapTextAt; // 0x110(0x04)
	Unknown Margin; // 0x114(0x10)
	float LineHeightPercentage; // 0x124(0x04)
	struct FText Text; // 0x128(0x18)
	struct FText HintText; // 0x140(0x18)
	struct FDelegate HintTextDelegate; // 0x158(0x10)
	Unknown WidgetStyle; // 0x168(0x268)
	Unknown bIsReadOnly; // 0x3d0(0x01)
	Unknown Font; // 0x3d8(0x50)
	Unknown SelectAllTextWhenFocused; // 0x428(0x01)
	Unknown ClearTextSelectionOnFocusLoss; // 0x429(0x01)
	Unknown RevertTextOnEscape; // 0x42a(0x01)
	Unknown ClearKeyboardFocusOnCommit; // 0x42b(0x01)
	Unknown AllowContextMenu; // 0x42c(0x01)
	Unknown VirtualKeyboardOptions; // 0x42d(0x01)
	Unknown VirtualKeyboardDismissAction; // 0x42e(0x01)
	struct FMulticastInlineDelegate OnTextChanged; // 0x430(0x10)
	struct FMulticastInlineDelegate OnTextCommitted; // 0x440(0x10)
	struct FText Text; // 0x128(0x18)
	struct FText HintText; // 0x140(0x18)
	struct FDelegate HintTextDelegate; // 0x158(0x10)
	Unknown WidgetStyle; // 0x168(0x7f0)
	Unknown TextStyle; // 0x958(0x268)
	Unknown bIsReadOnly; // 0xbc0(0x01)
	Unknown AllowContextMenu; // 0xbc1(0x01)
	Unknown VirtualKeyboardOptions; // 0xbc2(0x01)
	Unknown VirtualKeyboardDismissAction; // 0xbc3(0x01)
	Unknown Style; // 0xbc8(0x08)
	Unknown Font; // 0xbd0(0x50)
	Unknown ForegroundColor; // 0xc20(0x10)
	Unknown BackgroundColor; // 0xc30(0x10)
	Unknown ReadOnlyForegroundColor; // 0xc40(0x10)
	struct FMulticastInlineDelegate OnTextChanged; // 0xc50(0x10)
	struct FMulticastInlineDelegate OnTextCommitted; // 0xc60(0x10)
	Unknown Padding; // 0x40(0x10)
	Unknown HorizontalAlignment; // 0x50(0x01)
	Unknown VerticalAlignment; // 0x51(0x01)
	Unknown WidgetStyle; // 0x108(0x1a0)
	Unknown Style; // 0x2a8(0x08)
	Unknown BackgroundImage; // 0x2b0(0x08)
	Unknown FillImage; // 0x2b8(0x08)
	Unknown MarqueeImage; // 0x2c0(0x08)
	float Percent; // 0x2c8(0x04)
	Unknown BarFillType; // 0x2cc(0x01)
	Unknown bIsMarquee; // 0x2cd(0x01)
	Unknown BorderPadding; // 0x2d0(0x08)
	struct FDelegate PercentDelegate; // 0x2d8(0x10)
	Unknown FillColorAndOpacity; // 0x2e8(0x10)
	struct FDelegate FillColorAndOpacityDelegate; // 0x2f8(0x10)
	Unknown RenderOnInvalidation; // 0x120(0x01)
	Unknown RenderOnPhase; // 0x121(0x01)
	int32_t Phase; // 0x124(0x04)
	int32_t PhaseCount; // 0x128(0x04)
	Unknown EffectMaterial; // 0x130(0x08)
	struct FName TextureParameter; // 0x138(0x08)
	struct FText Text; // 0x128(0x18)
	Unknown TextStyleSet; // 0x140(0x08)
	Unknown DecoratorClasses; // 0x148(0x10)
	Unknown bOverrideDefaultStyle; // 0x158(0x01)
	Unknown DefaultTextStyleOverride; // 0x160(0x268)
	float MinDesiredWidth; // 0x3c8(0x04)
	Unknown InstanceDecorators; // 0x638(0x10)
	Unknown ImageSet; // 0x28(0x08)
	Unknown PadLeft; // 0x120(0x01)
	Unknown PadRight; // 0x121(0x01)
	Unknown PadTop; // 0x122(0x01)
	Unknown PadBottom; // 0x123(0x01)
	Unknown bIsTitleSafe; // 0x38(0x01)
	Unknown SafeAreaScale; // 0x3c(0x10)
	Unknown HAlign; // 0x4c(0x01)
	Unknown VAlign; // 0x4d(0x01)
	Unknown Padding; // 0x50(0x10)
	Unknown Stretch; // 0x120(0x01)
	Unknown StretchDirection; // 0x121(0x01)
	float UserSpecifiedScale; // 0x124(0x04)
	Unknown IgnoreInheritedScale; // 0x128(0x01)
	Unknown Padding; // 0x38(0x10)
	Unknown HorizontalAlignment; // 0x48(0x01)
	Unknown VerticalAlignment; // 0x49(0x01)
	Unknown WidgetStyle; // 0x108(0x4d0)
	Unknown Style; // 0x5d8(0x08)
	Unknown bAlwaysShowScrollbar; // 0x5e0(0x01)
	Unknown bAlwaysShowScrollbarTrack; // 0x5e1(0x01)
	Unknown Orientation; // 0x5e2(0x01)
	Unknown Thickness; // 0x5e4(0x08)
	Unknown Padding; // 0x5ec(0x10)
	Unknown WidgetStyle; // 0x120(0x228)
	Unknown WidgetBarStyle; // 0x348(0x4d0)
	Unknown Style; // 0x818(0x08)
	Unknown BarStyle; // 0x820(0x08)
	Unknown Orientation; // 0x828(0x01)
	Unknown ScrollBarVisibility; // 0x829(0x01)
	Unknown ConsumeMouseWheel; // 0x82a(0x01)
	Unknown ScrollbarThickness; // 0x82c(0x08)
	Unknown ScrollbarPadding; // 0x834(0x10)
	Unknown AlwaysShowScrollbar; // 0x844(0x01)
	Unknown AlwaysShowScrollbarTrack; // 0x845(0x01)
	Unknown AllowOverscroll; // 0x846(0x01)
	Unknown bAnimateWheelScrolling; // 0x847(0x01)
	Unknown NavigationDestination; // 0x848(0x01)
	float NavigationScrollPadding; // 0x84c(0x04)
	Unknown ScrollWhenFocusChanges; // 0x850(0x01)
	Unknown bAllowRightClickDragScrolling; // 0x851(0x01)
	float WheelScrollMultiplier; // 0x854(0x04)
	struct FMulticastInlineDelegate OnUserScrolled; // 0x858(0x10)
	Unknown Padding; // 0x38(0x10)
	Unknown HorizontalAlignment; // 0x48(0x01)
	Unknown VerticalAlignment; // 0x49(0x01)
	float WidthOverride; // 0x130(0x04)
	float HeightOverride; // 0x134(0x04)
	float MinDesiredWidth; // 0x138(0x04)
	float MinDesiredHeight; // 0x13c(0x04)
	float MaxDesiredWidth; // 0x140(0x04)
	float MaxDesiredHeight; // 0x144(0x04)
	float MinAspectRatio; // 0x148(0x04)
	float MaxAspectRatio; // 0x14c(0x04)
	Unknown bOverride_WidthOverride; // 0x150(0x01)
	Unknown bOverride_HeightOverride; // 0x150(0x01)
	Unknown bOverride_MinDesiredWidth; // 0x150(0x01)
	Unknown bOverride_MinDesiredHeight; // 0x150(0x01)
	Unknown bOverride_MaxDesiredWidth; // 0x150(0x01)
	Unknown bOverride_MaxDesiredHeight; // 0x150(0x01)
	Unknown bOverride_MinAspectRatio; // 0x150(0x01)
	Unknown bOverride_MaxAspectRatio; // 0x150(0x01)
	Unknown Padding; // 0x38(0x10)
	Unknown HorizontalAlignment; // 0x58(0x01)
	Unknown VerticalAlignment; // 0x59(0x01)
	Unknown VertexData; // 0x28(0x10)
	Unknown IndexData; // 0x38(0x10)
	Unknown Material; // 0x48(0x08)
	Unknown ExtentMin; // 0x50(0x08)
	Unknown ExtentMax; // 0x58(0x08)
	Unknown bCanChildrenBeAccessible; // 0x28(0x01)
	Unknown AccessibleBehavior; // 0x29(0x01)
	Unknown AccessibleSummaryBehavior; // 0x2a(0x01)
	struct FText AccessibleText; // 0x30(0x18)
	struct FDelegate AccessibleTextDelegate; // 0x48(0x10)
	struct FText AccessibleSummaryText; // 0x58(0x18)
	struct FDelegate AccessibleSummaryTextDelegate; // 0x70(0x10)
	float Value; // 0x108(0x04)
	struct FDelegate ValueDelegate; // 0x10c(0x10)
	float MinValue; // 0x11c(0x04)
	float MaxValue; // 0x120(0x04)
	Unknown WidgetStyle; // 0x128(0x340)
	Unknown Orientation; // 0x468(0x01)
	Unknown SliderBarColor; // 0x46c(0x10)
	Unknown SliderHandleColor; // 0x47c(0x10)
	Unknown IndentHandle; // 0x48c(0x01)
	Unknown Locked; // 0x48d(0x01)
	Unknown MouseUsesStep; // 0x48e(0x01)
	Unknown RequiresControllerLock; // 0x48f(0x01)
	float StepSize; // 0x490(0x04)
	Unknown IsFocusable; // 0x494(0x01)
	struct FMulticastInlineDelegate OnMouseCaptureBegin; // 0x498(0x10)
	struct FMulticastInlineDelegate OnMouseCaptureEnd; // 0x4a8(0x10)
	struct FMulticastInlineDelegate OnControllerCaptureBegin; // 0x4b8(0x10)
	struct FMulticastInlineDelegate OnControllerCaptureEnd; // 0x4c8(0x10)
	struct FMulticastInlineDelegate OnValueChanged; // 0x4d8(0x10)
	Unknown Size; // 0x108(0x08)
	float Value; // 0x108(0x04)
	struct FDelegate ValueDelegate; // 0x10c(0x10)
	Unknown WidgetStyle; // 0x120(0x2e8)
	Unknown Style; // 0x408(0x08)
	int32_t MinFractionalDigits; // 0x410(0x04)
	int32_t MaxFractionalDigits; // 0x414(0x04)
	Unknown bAlwaysUsesDeltaSnap; // 0x418(0x01)
	float Delta; // 0x41c(0x04)
	float SliderExponent; // 0x420(0x04)
	Unknown Font; // 0x428(0x50)
	Unknown Justification; // 0x478(0x01)
	float MinDesiredWidth; // 0x47c(0x04)
	Unknown ClearKeyboardFocusOnCommit; // 0x480(0x01)
	Unknown SelectAllTextOnCommit; // 0x481(0x01)
	Unknown ForegroundColor; // 0x488(0x28)
	struct FMulticastInlineDelegate OnValueChanged; // 0x4b0(0x10)
	struct FMulticastInlineDelegate OnValueCommitted; // 0x4c0(0x10)
	struct FMulticastInlineDelegate OnBeginSliderMovement; // 0x4d0(0x10)
	struct FMulticastInlineDelegate OnEndSliderMovement; // 0x4e0(0x10)
	Unknown bOverride_MinValue; // 0x4f0(0x01)
	Unknown bOverride_MaxValue; // 0x4f0(0x01)
	Unknown bOverride_MinSliderValue; // 0x4f0(0x01)
	Unknown bOverride_MaxSliderValue; // 0x4f0(0x01)
	float MinValue; // 0x4f4(0x04)
	float MaxValue; // 0x4f8(0x04)
	float MinSliderValue; // 0x4fc(0x04)
	float MaxSliderValue; // 0x500(0x04)
	struct FText Text; // 0x128(0x18)
	struct FDelegate TextDelegate; // 0x140(0x10)
	Unknown ColorAndOpacity; // 0x150(0x28)
	struct FDelegate ColorAndOpacityDelegate; // 0x178(0x10)
	Unknown Font; // 0x188(0x50)
	Unknown StrikeBrush; // 0x1d8(0x88)
	Unknown ShadowOffset; // 0x260(0x08)
	Unknown ShadowColorAndOpacity; // 0x268(0x10)
	struct FDelegate ShadowColorAndOpacityDelegate; // 0x278(0x10)
	float MinDesiredWidth; // 0x288(0x04)
	Unknown bWrapWithInvalidationPanel; // 0x28c(0x01)
	Unknown bAutoWrapText; // 0x28d(0x01)
	Unknown bSimpleTextMode; // 0x28e(0x01)
	int32_t NumberOfPieces; // 0x108(0x04)
	Unknown bAnimateHorizontally; // 0x10c(0x01)
	Unknown bAnimateVertically; // 0x10d(0x01)
	Unknown bAnimateOpacity; // 0x10e(0x01)
	Unknown PieceImage; // 0x110(0x08)
	Unknown Image; // 0x118(0x88)
	float EntryHeight; // 0x368(0x04)
	float EntryWidth; // 0x36c(0x04)
	Unknown TileAlignment; // 0x370(0x01)
	Unknown bWrapHorizontalNavigation; // 0x371(0x01)
	struct FDelegate BP_OnGetItemChildren; // 0x378(0x10)
	struct FMulticastInlineDelegate BP_OnItemExpansionChanged; // 0x388(0x10)
	Unknown Animation; // 0x408(0x08)
	Unknown SlotPadding; // 0x120(0x10)
	float MinDesiredSlotWidth; // 0x130(0x04)
	float MinDesiredSlotHeight; // 0x134(0x04)
	Unknown HorizontalAlignment; // 0x38(0x01)
	Unknown VerticalAlignment; // 0x39(0x01)
	int32_t Row; // 0x3c(0x04)
	int32_t Column; // 0x40(0x04)
	Unknown Size; // 0x38(0x08)
	Unknown Padding; // 0x40(0x10)
	Unknown HorizontalAlignment; // 0x58(0x01)
	Unknown VerticalAlignment; // 0x59(0x01)
	Unknown BackgroundColor; // 0x120(0x10)
	Unknown MovieScene; // 0x348(0x08)
	Unknown AnimationBindings; // 0x350(0x10)
	Unknown bLegacyFinishOnStop; // 0x360(0x01)
	struct FString DisplayLabel; // 0x368(0x10)
	Unknown WidgetAnimationDelegateBindings; // 0x28(0x10)
	struct FMulticastInlineDelegate Finished; // 0x28(0x10)
	Unknown WidgetTree; // 0x3c8(0x08)
	Unknown bAllowTemplate; // 0x3d0(0x01)
	Unknown bAllowDynamicCreation; // 0x3d0(0x01)
	Unknown bValidTemplate; // 0x3d0(0x01)
	Unknown bTemplateInitialized; // 0x3d0(0x01)
	Unknown bCookedTemplate; // 0x3d0(0x01)
	Unknown bClassRequiresNativ; // 0x3d0(0x01)
	Unknown Bindings; // 0x3d8(0x10)
	Unknown Animations; // 0x3e8(0x10)
	Unknown NamedSlots; // 0x3f8(0x10)
	Unknown TemplateAsset; // 0x408(0x28)
	Unknown Template; // 0x430(0x08)
	Unknown Space; // 0x4e8(0x01)
	Unknown TimingPolicy; // 0x4e9(0x01)
	Unknown WidgetClass; // 0x4f0(0x08)
	Unknown DrawSize; // 0x4f8(0x08)
	Unknown bManuallyRedraw; // 0x500(0x01)
	Unknown bRedrawRequested; // 0x501(0x01)
	float RedrawTime; // 0x504(0x04)
	Unknown CurrentDrawSize; // 0x510(0x08)
	Unknown bDrawAtDesiredSize; // 0x518(0x01)
	Unknown Pivot; // 0x51c(0x08)
	Unknown bReceiveHardwareInput; // 0x524(0x01)
	Unknown bWindowFocusable; // 0x525(0x01)
	Unknown WindowVisibility; // 0x526(0x01)
	Unknown bApplyGammaCorrection; // 0x527(0x01)
	Unknown OwnerPlayer; // 0x528(0x08)
	Unknown BackgroundColor; // 0x530(0x10)
	Unknown TintColorAndOpacity; // 0x540(0x10)
	float OpacityFromTexture; // 0x550(0x04)
	Unknown BlendMode; // 0x554(0x01)
	Unknown bIsTwoSided; // 0x555(0x01)
	Unknown TickWhenOffscreen; // 0x556(0x01)
	Unknown Widget; // 0x558(0x08)
	Unknown BodySetup; // 0x580(0x08)
	Unknown TranslucentMaterial; // 0x588(0x08)
	Unknown TranslucentMaterial_OneSided; // 0x590(0x08)
	Unknown OpaqueMaterial; // 0x598(0x08)
	Unknown OpaqueMaterial_OneSided; // 0x5a0(0x08)
	Unknown MaskedMaterial; // 0x5a8(0x08)
	Unknown MaskedMaterial_OneSided; // 0x5b0(0x08)
	Unknown RenderTarget; // 0x5b8(0x08)
	Unknown MaterialInstance; // 0x5c0(0x08)
	Unknown bAddedToScreen; // 0x5c8(0x01)
	Unknown bEditTimeUsable; // 0x5c9(0x01)
	struct FName SharedLayerName; // 0x5cc(0x08)
	int32_t LayerZOrder; // 0x5d4(0x04)
	Unknown GeometryMode; // 0x5d8(0x01)
	float CylinderArcAngle; // 0x5dc(0x04)
	struct FMulticastInlineDelegate OnHoveredWidgetChanged; // 0x238(0x10)
	int32_t VirtualUserIndex; // 0x258(0x04)
	float PointerIndex; // 0x25c(0x04)
	Unknown TraceChannel; // 0x260(0x01)
	float InteractionDistance; // 0x264(0x04)
	Unknown InteractionSource; // 0x268(0x01)
	Unknown bEnableHitTesting; // 0x269(0x01)
	Unknown bShowDebug; // 0x26a(0x01)
	Unknown DebugColor; // 0x26c(0x10)
	Unknown CustomHitResult; // 0x2f8(0x88)
	Unknown LocalHitLocation; // 0x380(0x08)
	Unknown LastLocalHitLocation; // 0x388(0x08)
	Unknown HoveredWidgetComponent; // 0x390(0x08)
	Unknown LastHitResult; // 0x398(0x88)
	Unknown bIsHoveredWidgetInteractable; // 0x420(0x01)
	Unknown bIsHoveredWidgetFocusable; // 0x421(0x01)
	Unknown bIsHoveredWidgetHitTestVisible; // 0x422(0x01)
	Unknown Up; // 0x28(0x24)
	Unknown Down; // 0x4c(0x24)
	Unknown Left; // 0x70(0x24)
	Unknown Right; // 0x94(0x24)
	Unknown Next; // 0xb8(0x24)
	Unknown Previous; // 0xdc(0x24)
	int32_t ActiveWidgetIndex; // 0x120(0x04)
	Unknown Padding; // 0x40(0x10)
	Unknown HorizontalAlignment; // 0x50(0x01)
	Unknown VerticalAlignment; // 0x51(0x01)
	Unknown RootWidget; // 0x28(0x08)
	Unknown bWindowButtonsEnabled; // 0x120(0x01)
	Unknown bDoubleClickTogglesFullscreen; // 0x121(0x01)
	Unknown Padding; // 0x38(0x10)
	Unknown HorizontalAlignment; // 0x48(0x01)
	Unknown VerticalAlignment; // 0x49(0x01)
	Unknown InnerSlotPadding; // 0x120(0x08)
	float WrapWidth; // 0x128(0x04)
	Unknown bExplicitWrapWidth; // 0x12c(0x01)
	Unknown HorizontalAlignment; // 0x12d(0x01)
	Unknown Padding; // 0x38(0x10)
	Unknown bFillEmptySpace; // 0x48(0x01)
	float FillSpanWhenLessThan; // 0x4c(0x04)
	Unknown HorizontalAlignment; // 0x50(0x01)
	Unknown VerticalAlignment; // 0x51(0x01)
	Unknown Owner; // 0x28(0x08)
	Unknown Sounds; // 0x30(0x50)
	struct FMulticastInlineDelegate ReadyForBindings; // 0xb0(0x10)
	struct FMulticastInlineDelegate BindingsReleased; // 0xc0(0x10)
	struct FMulticastInlineDelegate FinishLoad; // 0xd0(0x10)
	struct FMulticastInlineDelegate FailLoad; // 0xe0(0x10)
	struct FMulticastInlineDelegate StartLoading; // 0xf0(0x10)
	struct FMulticastInlineDelegate NavigateTo; // 0x100(0x10)
	struct FMulticastInlineDelegate JavaScriptEvent; // 0x110(0x10)
	struct FMulticastInlineDelegate UIGTScriptingReady; // 0x120(0x10)
	struct FDelegate LiveViewSizeRequested; // 0x130(0x10)
	Unknown Texture; // 0x158(0x08)
	Unknown Filter; // 0x160(0x01)
	Unknown bReceiveInput; // 0x161(0x01)
	Unknown bReceiveInputWhenTransparent; // 0x162(0x01)
	Unknown AllowPerformanceWarnings; // 0x163(0x01)
	float ExecuteJSTimersThresholdMs; // 0x164(0x04)
	float UpdateStylesAndLayoutThresholdMs; // 0x168(0x04)
	float RecordRenderingCommandsThresholdMs; // 0x16c(0x04)
	float PaintWarningThresholdMs; // 0x170(0x04)
	int32_t LayersCountThreshold; // 0x174(0x04)
	int32_t LayerWidthThreshold; // 0x178(0x04)
	int32_t LayerHeightThreshold; // 0x17c(0x04)
	Unknown bEnableAdditionalDefaultStyles; // 0x180(0x01)
	Unknown bDelayedUpdate; // 0x181(0x01)
	Unknown AudioWrapper; // 0x1f8(0x08)
	struct FString URL; // 0x230(0x10)
	int32_t Width; // 0x240(0x04)
	int32_t Height; // 0x244(0x04)
	Unknown ManualTexture; // 0x248(0x01)
	float ClickThroughAlphaThreshold; // 0x24c(0x04)
	Unknown Transparent; // 0x250(0x01)
	Unknown CoherentUIGTHUD; // 0x400(0x08)
	Unknown HUDMaterialName; // 0x230(0x18)
	Unknown HUDMaterial; // 0x248(0x08)
	Unknown HUDMaterialInstance; // 0x250(0x08)
	struct FMulticastInlineDelegate OnCoherentUIGTInputActorMouseButtonDown; // 0x310(0x10)
	struct FMulticastInlineDelegate OnCoherentUIGTInputActorMouseButtonUp; // 0x320(0x10)
	struct FMulticastInlineDelegate OnCoherentUIGTInputActorKeyDown; // 0x330(0x10)
	struct FMulticastInlineDelegate OnCoherentUIGTInputActorKeyUp; // 0x340(0x10)
	Unknown StructTypes; // 0xa8(0x10)
	struct FString EventName; // 0x28(0x10)
	struct FString LinkName; // 0xb0(0x10)
	Unknown Texture; // 0xc0(0x08)
	Unknown EnableLiveReload; // 0x28(0x01)
	int32_t InspectorPort; // 0x2c(0x04)
	int32_t WebdriverPort; // 0x30(0x04)
	Unknown EnableWebSecurity; // 0x34(0x01)
	Unknown EnableLocalization; // 0x35(0x01)
	Unknown RunAsynchronous; // 0x36(0x01)
	Unknown AllowPerformanceWarningsInEditor; // 0x37(0x01)
	Unknown ShowWarningsOnScreen; // 0x38(0x01)
	Unknown LogSeverity; // 0x39(0x01)
	Unknown bPaintToBackBuffer; // 0x3a(0x01)
	Unknown bRespectTitleSafeZone; // 0x3b(0x01)
	Unknown bRespectLetterboxing; // 0x3c(0x01)
	struct FString HUDMaterialName; // 0x40(0x10)
	struct FString CoUIResourcesRoot; // 0x50(0x10)
	Unknown TickWhileGameIsPaused; // 0x60(0x01)
	Unknown bUseLowerCaseNamesForAutoExposedProperties; // 0x61(0x01)
	Unknown MSAA; // 0x62(0x01)
	struct FString CookiesResource; // 0x68(0x10)
	struct FString LocalStorageFolder; // 0x78(0x10)
	Unknown UseCacheFile; // 0x88(0x01)
	Unknown UseReceivedFromServ; // 0x89(0x01)
	Unknown Owner; // 0x120(0x08)
	struct FMulticastInlineDelegate ReadyForBindings; // 0x128(0x10)
	struct FMulticastInlineDelegate BindingsReleased; // 0x138(0x10)
	struct FMulticastInlineDelegate FinishLoad; // 0x148(0x10)
	struct FMulticastInlineDelegate FailLoad; // 0x158(0x10)
	struct FMulticastInlineDelegate StartLoading; // 0x168(0x10)
	struct FMulticastInlineDelegate NavigateTo; // 0x178(0x10)
	struct FMulticastInlineDelegate JavaScriptEvent; // 0x188(0x10)
	struct FMulticastInlineDelegate UIGTScriptingReady; // 0x198(0x10)
	struct FMulticastInlineDelegate AkAudioEvent; // 0x1c0(0x10)
	struct FMulticastInlineDelegate KeyUpDelegate; // 0x1d0(0x10)
	struct FMulticastInlineDelegate KeyDownDelegate; // 0x1e0(0x10)
	struct FMulticastInlineDelegate MouseEventDelegate; // 0x1f0(0x10)
	Unknown Filter; // 0x200(0x01)
	Unknown bReceiveInput; // 0x201(0x01)
	Unknown InputPropagationBehaviour; // 0x202(0x01)
	Unknown bReceiveInputWhenTransparent; // 0x203(0x01)
	Unknown bGammaCorrectedMaterial; // 0x204(0x01)
	float TickPeriodInMinimizedGame; // 0x208(0x04)
	Unknown AllowPerformanceWarnings; // 0x20c(0x01)
	float ExecuteJSTimersThresholdMs; // 0x210(0x04)
	float UpdateStylesAndLayoutThresholdMs; // 0x214(0x04)
	float RecordRenderingCommandsThresholdMs; // 0x218(0x04)
	float PaintWarningThresholdMs; // 0x21c(0x04)
	int32_t LayersCountThreshold; // 0x220(0x04)
	int32_t LayerWidthThreshold; // 0x224(0x04)
	int32_t LayerHeightThreshold; // 0x228(0x04)
	Unknown bEnableAdditionalDefaultStyles; // 0x22c(0x01)
	Unknown AudioWrapper; // 0x2a0(0x08)
	struct FString URL; // 0x328(0x10)
	float ClickThroughAlphaThreshold; // 0x338(0x04)
	Unknown OffscreenCanvasRendering; // 0x33c(0x01)
	Unknown Transparent; // 0x33d(0x01)
	Unknown Components; // 0x28(0x10)
	Unknown UberGraphFrame; // 0x248(0x08)
	Unknown BGImage; // 0x250(0x08)
	Unknown BorderImage; // 0x258(0x08)
	Unknown DisableImage; // 0x260(0x08)
	Unknown Image_177; // 0x268(0x08)
	Unknown ItemCount; // 0x270(0x08)
	Unknown ItemImage; // 0x278(0x08)
	Unknown WidgetReference; // 0x280(0x08)
	Unknown Lock; // 0x288(0x01)
	Unknown InventoryDragType; // 0x289(0x01)
	Unknown ChangeTarget; // 0x290(0x08)
	Unknown PlayerHUDRef; // 0x298(0x08)
	Unknown ChaosSolverActorSet; // 0x30(0x50)
	Unknown DataSourceType; // 0x80(0x01)
	int32_t DataProcessFrequency; // 0x84(0x04)
	int32_t MaxNumberOfDataEntriesToSpawn; // 0x88(0x04)
	Unknown DoSpawn; // 0x8c(0x01)
	Unknown SpawnMultiplierMinMax; // 0x90(0x08)
	float SpawnChance; // 0x98(0x04)
	Unknown ImpulseToSpawnMinMax; // 0x9c(0x08)
	Unknown SpeedToSpawnMinMax; // 0xa4(0x08)
	Unknown MassToSpawnMinMax; // 0xac(0x08)
	Unknown ExtentMinToSpawnMinMax; // 0xb4(0x08)
	Unknown ExtentMaxToSpawnMinMax; // 0xbc(0x08)
	Unknown VolumeToSpawnMinMax; // 0xc4(0x08)
	Unknown SolverTimeToSpawnMinMax; // 0xcc(0x08)
	int32_t SurfaceTypeToSpawn; // 0xd4(0x04)
	Unknown LocationFilteringMode; // 0xd8(0x01)
	Unknown LocationXToSpawn; // 0xd9(0x01)
	Unknown LocationXToSpawnMinMax; // 0xdc(0x08)
	Unknown LocationYToSpawn; // 0xe4(0x01)
	Unknown LocationYToSpawnMinMax; // 0xe8(0x08)
	Unknown LocationZToSpawn; // 0xf0(0x01)
	Unknown LocationZToSpawnMinMax; // 0xf4(0x08)
	Unknown DataSortingType; // 0xfc(0x01)
	Unknown bGetExternalCollisionData; // 0xfd(0x01)
	Unknown DoSpatialHash; // 0xfe(0x01)
	Unknown SpatialHashVolumeMin; // 0x100(0x0c)
	Unknown SpatialHashVolumeMax; // 0x10c(0x0c)
	Unknown SpatialHashVolumeCellSize; // 0x118(0x0c)
	int32_t MaxDataPerCell; // 0x124(0x04)
	Unknown bApplyMaterialsFilter; // 0x128(0x01)
	Unknown ChaosBreakingMaterialSet; // 0x130(0x50)
	Unknown bGetExternalBreakingData; // 0x180(0x01)
	Unknown bGetExternalTrailingData; // 0x181(0x01)
	Unknown RandomPositionMagnitudeMinMax; // 0x184(0x08)
	float InheritedVelocityMultiplier; // 0x18c(0x04)
	Unknown RandomVelocityGenerationType; // 0x190(0x01)
	Unknown RandomVelocityMagnitudeMinMax; // 0x194(0x08)
	float SpreadAngleMax; // 0x19c(0x04)
	Unknown VelocityOffsetMin; // 0x1a0(0x0c)
	Unknown VelocityOffsetMax; // 0x1ac(0x0c)
	Unknown FinalVelocityMagnitudeMinMax; // 0x1b8(0x08)
	float MaxLatency; // 0x1c0(0x04)
	Unknown DebugType; // 0x1c4(0x01)
	int32_t LastSpawnedPointID; // 0x1c8(0x04)
	float LastSpawnTime; // 0x1cc(0x04)
	float SolverTime; // 0x1e0(0x04)
	float TimeStampOfLastProcessedData; // 0x1e4(0x04)
	float CharacterRotationVelocity; // 0x30(0x04)
	float CameraMoveVelocity; // 0x34(0x04)
	float CameraTop; // 0x38(0x04)
	float CameraBottom; // 0x3c(0x04)
	float CameraZoomVelocity; // 0x40(0x04)
	float CameraInterpSpeed; // 0x44(0x04)
	float CharacterRotationInterpSpeed; // 0x48(0x04)
	Unknown CameraMove; // 0x50(0x08)
	Unknown bIsPassthrough; // 0x1b40(0x01)
	Unknown UberGraphFrame; // 0x360(0x08)
	Unknown U; // 0x368(0x08)
	Unknown U; // 0x370(0x08)
	Unknown UW_SimpleResult; // 0x378(0x08)
	Unknown MainWidgetRef; // 0x380(0x08)
	Unknown PlayerHUDRef; // 0x388(0x08)
	Unknown UW_FinalResult; // 0x390(0x08)
	Unknown UW_Animation; // 0x398(0x08)
	Unknown PlayerControllerRef; // 0x3a0(0x08)
	Unknown NewResult; // 0x3a8(0x01)
	Unknown ResultData; // 0x3a9(0x04)
	Unknown IsGiveUp; // 0x3ad(0x01)
	float WinMatchEndResultShowTime; // 0x3b0(0x04)
	Unknown ResultMatchEndAnimation; // 0x3b4(0x02)
	float SocketErrorDisconnectDelay; // 0x1af0(0x04)
	Unknown LogPortUnreach; // 0x748(0x01)
	Unknown AllowPlayerPortUnreach; // 0x748(0x01)
	uint32_t MaxPortCountToTry; // 0x74c(0x04)
	uint32_t ServerDesiredSocketReceiveBufferBytes; // 0x75c(0x04)
	uint32_t ServerDesiredSocketSendBufferBytes; // 0x760(0x04)
	uint32_t ClientDesiredSocketReceiveBufferBytes; // 0x764(0x04)
	uint32_t ClientDesiredSocketSendBufferBytes; // 0x768(0x04)
	double MaxSecondsInReceive; // 0x770(0x08)
	int32_t NbPacketsBetweenReceiveTimeTest; // 0x778(0x04)
	float ResolutionConnectionTimeout; // 0x77c(0x04)
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x40(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x40(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x40(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x40(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x40(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x40(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x40(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x40(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x40(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x28(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x38(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x28(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x38(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x28(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x38(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x28(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x38(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x28(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x38(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x28(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x38(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x40(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x28(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x38(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x28(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x38(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x40(0x10)
	float BeaconConnectionInitialTimeout; // 0x318(0x04)
	float BeaconConnectionTimeout; // 0x31c(0x04)
	Unknown NetDriver; // 0x320(0x08)
	Unknown BeaconOwner; // 0x340(0x08)
	Unknown BeaconConnection; // 0x348(0x08)
	Unknown ConnectionState; // 0x350(0x01)
	int32_t ListenPort; // 0x340(0x04)
	Unknown ClientActors; // 0x348(0x10)
	struct FString BeaconTypeName; // 0x310(0x10)
	Unknown ClientBeaconActorClass; // 0x320(0x08)
	Unknown ClientActors; // 0x328(0x10)
	struct FName VoiceSubsystemNameOverride; // 0x28(0x08)
	Unknown bOnlinePIEEnabled; // 0x38(0x01)
	Unknown Logins; // 0x40(0x10)
	Unknown bIsFromInvite; // 0x188(0x01)
	Unknown bHandlingDisconnect; // 0x189(0x01)
	struct FString DestSessionId; // 0x3d0(0x10)
	Unknown PendingReservation; // 0x3e0(0x50)
	Unknown RequestType; // 0x430(0x01)
	Unknown bPendingReservationSent; // 0x431(0x01)
	Unknown bCancelReservation; // 0x432(0x01)
	Unknown State; // 0x338(0x08)
	Unknown bLogoutOnSessionTimeout; // 0x3a0(0x01)
	float SessionTimeoutSecs; // 0x3a4(0x04)
	float TravelSessionTimeoutSecs; // 0x3a8(0x04)
	struct FName SessionName; // 0x28(0x08)
	int32_t NumConsumedReservations; // 0x30(0x04)
	int32_t MaxReservations; // 0x34(0x04)
	int32_t NumTeams; // 0x38(0x04)
	int32_t NumPlayersPerTeam; // 0x3c(0x04)
	struct FName TeamAssignmentMethod; // 0x40(0x08)
	int32_t ReservedHostTeamNum; // 0x48(0x04)
	int32_t ForceTeamNum; // 0x4c(0x04)
	Unknown bRestrictCrossConsole; // 0x50(0x01)
	Unknown bEnableRemovalRequests; // 0x51(0x01)
	Unknown Reservations; // 0x58(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x40(0x10)
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x40(0x10)
	struct FString DestSessionId; // 0x3d0(0x10)
	Unknown PendingReservation; // 0x3e0(0x78)
	Unknown RequestType; // 0x458(0x01)
	Unknown bPendingReservationSent; // 0x459(0x01)
	Unknown bCancelReservation; // 0x45a(0x01)
	Unknown State; // 0x338(0x08)
	Unknown bLogoutOnSessionTimeout; // 0x3a0(0x01)
	float SessionTimeoutSecs; // 0x3a4(0x04)
	float TravelSessionTimeoutSecs; // 0x3a8(0x04)
	struct FName SessionName; // 0x28(0x08)
	int32_t NumConsumedReservations; // 0x30(0x04)
	int32_t MaxReservations; // 0x34(0x04)
	Unknown bRestrictCrossConsole; // 0x38(0x01)
	Unknown Reservations; // 0x40(0x10)
	Unknown NamedInterfaces; // 0x28(0x10)
	Unknown NamedInterfaceDefs; // 0x38(0x10)
	Unknown DirectorClass; // 0x28(0x08)
	Unknown VariantSets; // 0x30(0x10)
	Unknown LevelVariantSets; // 0x310(0x18)
	Unknown Properties; // 0x88(0x10)
	Unknown PropertyIndices; // 0x98(0x10)
	Unknown CapturedPropSegments; // 0xa8(0x10)
	struct FString FullDisplayString; // 0xb8(0x10)
	struct FName PropertySetterName; // 0xc8(0x08)
	Unknown PropertySetterParameterDefaults; // 0xd0(0x50)
	Unknown bHasRecordedData; // 0x120(0x01)
	Unknown LeafPropertyClass; // 0x128(0x08)
	Unknown ValueBytes; // 0x138(0x10)
	Unknown PropCategory; // 0x148(0x01)
	Unknown SceneComponent; // 0x328(0x08)
	int32_t LastSelectedOption; // 0x330(0x04)
	struct FText DisplayText; // 0x28(0x18)
	Unknown ObjectBindings; // 0x58(0x10)
	Unknown Thumbnail; // 0x68(0x08)
	struct FString CachedActorLabel; // 0x28(0x10)
	Unknown ObjectPtr; // 0x38(0x18)
	Unknown LazyObjectPtr; // 0x50(0x1c)
	Unknown CapturedProperties; // 0x70(0x10)
	Unknown FunctionCallers; // 0x80(0x10)
	struct FText DisplayText; // 0x28(0x18)
	Unknown bExpanded; // 0x58(0x01)
	Unknown Variants; // 0x60(0x10)
	Unknown bAutoDestroy; // 0x238(0x01)
	Unknown bStopWhenOwnerDestroyed; // 0x238(0x01)
	Unknown bAllowSpatialization; // 0x238(0x01)
	Unknown bOverrideAttenuation; // 0x238(0x01)
	Unknown bOutputToBusOnly; // 0x23c(0x01)
	Unknown AttenuationSettings; // 0x240(0x08)
	Unknown AttenuationOverrides; // 0x248(0x3a0)
	Unknown ConcurrencySettings; // 0x5e8(0x08)
	Unknown ConcurrencySet; // 0x5f0(0x50)
	Unknown SoundClass; // 0x640(0x08)
	Unknown SourceEffectChain; // 0x648(0x08)
	Unknown SoundSubmix; // 0x650(0x08)
	Unknown SoundSubmixSends; // 0x658(0x10)
	Unknown BusSends; // 0x668(0x10)
	Unknown Modulation; // 0x678(0x10)
	Unknown PreEffectBusSends; // 0x688(0x10)
	Unknown bIsUISound; // 0x698(0x01)
	Unknown bIsPreviewSound; // 0x698(0x01)
	int32_t EnvelopeFollowerAttackTime; // 0x69c(0x04)
	int32_t EnvelopeFollowerReleaseTime; // 0x6a0(0x04)
	struct FMulticastInlineDelegate OnAudioEnvelopeValue; // 0x6a8(0x10)
	Unknown Synth; // 0x6d8(0x08)
	Unknown AudioComponent; // 0x6e0(0x08)
	Unknown Settings; // 0xb8(0x50)
	Unknown Settings; // 0x78(0x10)
	Unknown Settings; // 0x9c(0x34)
	Unknown Settings; // 0xa0(0x38)
	Unknown OwningSynthComponent; // 0x360(0x08)
	Unknown Materials; // 0x30(0x10)
	Unknown Tracks; // 0x40(0x10)
	int32_t StartFrame; // 0x60(0x04)
	int32_t EndFrame; // 0x64(0x04)
	Unknown GeometryCacheComponent; // 0x310(0x08)
	Unknown TopologyRanges; // 0x28(0x10)
	int32_t DummyProperty; // 0x38(0x04)
	Unknown GeometryCache; // 0x4e8(0x08)
	Unknown bRunning; // 0x4f0(0x01)
	Unknown bLooping; // 0x4f1(0x01)
	float StartTimeOffset; // 0x4f4(0x04)
	float PlaybackSpeed; // 0x4f8(0x04)
	int32_t NumTracks; // 0x4fc(0x04)
	float ElapsedTime; // 0x500(0x04)
	float Duration; // 0x534(0x04)
	Unknown bManualTick; // 0x538(0x01)
	float Duration; // 0x28(0x04)
	uint32_t NumMeshSamples; // 0x58(0x04)
	Unknown Codec; // 0x58(0x08)
	float StartSampleTime; // 0xc8(0x04)
	Unknown Target; // 0x30(0x08)
	struct FName StateName; // 0x38(0x08)
	float Timer; // 0x40(0x04)
	Unknown Repeat; // 0x44(0x01)
	Unknown TimerHandle; // 0x48(0x08)
	struct FMulticastInlineDelegate OnSuccess; // 0x50(0x10)
	struct FMulticastInlineDelegate OnAborted; // 0x60(0x10)
	Unknown Target; // 0x30(0x08)
	Unknown StateID; // 0x38(0x01)
	float Timer; // 0x3c(0x04)
	Unknown Repeat; // 0x40(0x01)
	Unknown TimerHandle; // 0x48(0x08)
	struct FMulticastInlineDelegate OnSuccess; // 0x50(0x10)
	struct FMulticastInlineDelegate OnAborted; // 0x60(0x10)
	Unknown Target; // 0x30(0x08)
	Unknown Conditional; // 0x38(0x01)
	struct FName StateName; // 0x3c(0x08)
	float Timer; // 0x44(0x04)
	Unknown Repeat; // 0x48(0x01)
	Unknown TimerHandle; // 0x50(0x08)
	struct FMulticastInlineDelegate OnSuccess; // 0x58(0x10)
	struct FMulticastInlineDelegate OnAborted; // 0x68(0x10)
	Unknown Target; // 0x30(0x08)
	Unknown Conditional; // 0x38(0x01)
	Unknown StateID; // 0x39(0x01)
	float Timer; // 0x3c(0x04)
	Unknown Repeat; // 0x40(0x01)
	Unknown TimerHandle; // 0x48(0x08)
	struct FMulticastInlineDelegate OnSuccess; // 0x50(0x10)
	struct FMulticastInlineDelegate OnAborted; // 0x60(0x10)
	Unknown Target; // 0x30(0x08)
	struct FDelegate InBegin; // 0x38(0x10)
	struct FDelegate InExit; // 0x48(0x10)
	struct FName StateName; // 0x58(0x08)
	float Timer; // 0x60(0x04)
	Unknown Repeat; // 0x64(0x01)
	Unknown TimerHandle; // 0x68(0x08)
	struct FMulticastInlineDelegate OnSuccess; // 0x70(0x10)
	struct FMulticastInlineDelegate OnAborted; // 0x80(0x10)
	Unknown Target; // 0x30(0x08)
	struct FDelegate InBegin; // 0x38(0x10)
	struct FDelegate InExit; // 0x48(0x10)
	Unknown StateID; // 0x58(0x01)
	float Timer; // 0x5c(0x04)
	Unknown Repeat; // 0x60(0x01)
	Unknown TimerHandle; // 0x68(0x08)
	struct FMulticastInlineDelegate OnSuccess; // 0x70(0x10)
	struct FMulticastInlineDelegate OnAborted; // 0x80(0x10)
	Unknown Target; // 0x30(0x08)
	Unknown Conditional; // 0x38(0x01)
	struct FDelegate InBegin; // 0x3c(0x10)
	struct FDelegate InExit; // 0x4c(0x10)
	struct FName StateName; // 0x5c(0x08)
	float Timer; // 0x64(0x04)
	Unknown Repeat; // 0x68(0x01)
	Unknown TimerHandle; // 0x70(0x08)
	struct FMulticastInlineDelegate OnSuccess; // 0x78(0x10)
	struct FMulticastInlineDelegate OnAborted; // 0x88(0x10)
	Unknown Target; // 0x30(0x08)
	Unknown Conditional; // 0x38(0x01)
	struct FDelegate InBegin; // 0x3c(0x10)
	struct FDelegate InExit; // 0x4c(0x10)
	Unknown StateID; // 0x5c(0x01)
	float Timer; // 0x60(0x04)
	Unknown Repeat; // 0x64(0x01)
	Unknown TimerHandle; // 0x68(0x08)
	struct FMulticastInlineDelegate OnSuccess; // 0x70(0x10)
	struct FMulticastInlineDelegate OnAborted; // 0x80(0x10)
	Unknown Target; // 0x30(0x08)
	float Timer; // 0x38(0x04)
	Unknown TimerHandle; // 0x40(0x08)
	struct FMulticastInlineDelegate OnSuccess; // 0x48(0x10)
	struct FMulticastInlineDelegate OnAborted; // 0x58(0x10)
	Unknown Target; // 0x30(0x08)
	Unknown Conditional; // 0x38(0x01)
	struct FName FallbackState; // 0x3c(0x08)
	float Timer; // 0x44(0x04)
	Unknown TimerHandle; // 0x48(0x08)
	struct FMulticastInlineDelegate OnSuccess; // 0x50(0x10)
	struct FMulticastInlineDelegate OnAborted; // 0x60(0x10)
	Unknown Target; // 0x30(0x08)
	struct FDelegate InBegin; // 0x38(0x10)
	struct FDelegate InExit; // 0x48(0x10)
	float Timer; // 0x58(0x04)
	Unknown TimerHandle; // 0x60(0x08)
	struct FMulticastInlineDelegate OnSuccess; // 0x68(0x10)
	struct FMulticastInlineDelegate OnAborted; // 0x78(0x10)
	Unknown Target; // 0x30(0x08)
	Unknown Conditional; // 0x38(0x01)
	struct FDelegate InBegin; // 0x3c(0x10)
	struct FDelegate InExit; // 0x4c(0x10)
	struct FDelegate InFallback; // 0x5c(0x10)
	struct FName FallbackState; // 0x6c(0x08)
	float Timer; // 0x74(0x04)
	Unknown TimerHandle; // 0x78(0x08)
	struct FMulticastInlineDelegate OnSuccess; // 0x80(0x10)
	struct FMulticastInlineDelegate OnAborted; // 0x90(0x10)
	Unknown FSM; // 0x98(0x08)
	struct FName TargetFSM; // 0xa0(0x08)
	struct FName NewStateName; // 0xa8(0x08)
	Unknown Debug; // 0xb0(0x01)
	Unknown ForceSuccess; // 0xb1(0x01)
	Unknown FSM; // 0x98(0x08)
	struct FName TargetFSM; // 0xa0(0x08)
	struct FName StateName; // 0xa8(0x08)
	Unknown Debug; // 0xb0(0x01)
	Unknown ForceSuccess; // 0xb1(0x01)
	Unknown FSM; // 0x98(0x08)
	struct FName TargetFSM; // 0xa0(0x08)
	struct FName StateName; // 0xa8(0x08)
	Unknown Debug; // 0xb0(0x01)
	Unknown ForceSuccess; // 0xb1(0x01)
	Unknown FSM; // 0x98(0x08)
	struct FName TargetFSM; // 0xa0(0x08)
	struct FName StateName; // 0xa8(0x08)
	Unknown Debug; // 0xb0(0x01)
	Unknown ForceSuccess; // 0xb1(0x01)
	Unknown SGUID; // 0x28(0x10)
	int32_t PlayerId; // 0x38(0x04)
	Unknown Owner; // 0x3c(0x08)
	Unknown StateGraph; // 0x58(0x10)
	float MachineTime; // 0x68(0x04)
	struct FMulticastInlineDelegate _OnEntry; // 0x70(0x10)
	struct FMulticastInlineDelegate _OnExit; // 0x80(0x10)
	Unknown MachineData; // 0x90(0x50)
	Unknown EnableInterfaceStatePropagation; // 0x28(0x01)
	Unknown SuppressRPCWarnings; // 0x29(0x01)
	float DefaultTickInterval; // 0x2c(0x04)
	Unknown DefaultStates; // 0x30(0x10)
	Unknown MachineStack; // 0x30(0x10)
	Unknown FSM; // 0x268(0x08)
	Unknown OverrideFSM; // 0x270(0x01)
	struct FName TargetFSM; // 0x274(0x08)
	struct FName TargetASM; // 0x27c(0x08)
	Unknown FSM_ExitArguments; // 0xb8(0x0c)
	Unknown FSM_BeginArguments; // 0xc4(0x0c)
	Unknown FSM_UpdateArguments; // 0xd0(0x08)
	Unknown IsOverriden; // 0xe0(0x01)
	Unknown IsFullyInitialized; // 0xe1(0x01)
	Unknown StateID; // 0xe2(0x01)
	Unknown PreviousStateID; // 0xe3(0x01)
	float StateTime; // 0xe4(0x04)
	Unknown STATE_Null; // 0xe8(0x40)
	Unknown State; // 0x128(0x50)
	struct FDelegate InBegin; // 0x178(0x10)
	struct FDelegate InUpdate; // 0x188(0x10)
	struct FDelegate InExit; // 0x198(0x10)
	struct FName StartupState; // 0x1a8(0x08)
	Unknown States; // 0x1b0(0x10)
	Unknown LINKS; // 0x1c0(0x50)
	Unknown UseEnumFromCPP; // 0x210(0x01)
	struct FString CPP_EnumName; // 0x218(0x10)
	Unknown K2_Enumerator; // 0x228(0x08)
	Unknown ReplicationMode; // 0x230(0x01)
	Unknown BlueprintAutoFlowFSM; // 0x231(0x01)
	Unknown BlueprintAutoFlowTransitions; // 0x232(0x01)
	Unknown AlwaysTickFSM; // 0x233(0x01)
	Unknown ReplicateStateID; // 0x234(0x01)
	Unknown ReplicatePreviousStateID; // 0x235(0x01)
	Unknown ReplicateStateTime; // 0x236(0x01)
	Unknown Debug; // 0x237(0x01)
	struct FMulticastInlineDelegate OnInitialized; // 0x238(0x10)
	struct FMulticastInlineDelegate OnBegin; // 0x248(0x10)
	struct FMulticastInlineDelegate OnUpdate; // 0x258(0x10)
	struct FMulticastInlineDelegate OnExit; // 0x268(0x10)
	Unknown Image_SupplyBoxMarker; // 0x248(0x08)
	Unknown PersonalSupplyBox; // 0x250(0x08)
	Unknown WidgetSwitcher_2; // 0x258(0x08)
	struct FMulticastInlineDelegate OnMarkerClicked; // 0x260(0x10)
	Unknown CurrentMarker; // 0x270(0x08)
	Unknown MapCompRef; // 0x278(0x08)
	Unknown TmpPingTypeTexture; // 0x280(0x08)
	Unknown bUseComplexAsSimpleCollision; // 0x4f0(0x01)
	Unknown bUseAsyncCooking; // 0x4f1(0x01)
	Unknown ProcMeshBodySetup; // 0x4f8(0x08)
	Unknown ProcMeshSections; // 0x500(0x10)
	Unknown CollisionConvexElems; // 0x510(0x10)
	Unknown LocalBounds; // 0x520(0x1c)
	Unknown AsyncBodySetupQueue; // 0x540(0x10)
	Unknown UberGraphFrame; // 0x248(0x08)
	Unknown Armory_Repair_M; // 0x250(0x08)
	Unknown Armory_Strengthen_M; // 0x258(0x08)
	Unknown Armory_Failed_M; // 0x260(0x08)
	Unknown Armory_Break_M; // 0x268(0x08)
	Unknown Armory_Failed_Break_M; // 0x270(0x08)
	Unknown Armory_Failed_Down_M; // 0x278(0x08)
	Unknown Armory_Awesome_M; // 0x280(0x08)
	Unknown Armory_Success_M; // 0x288(0x08)
	Unknown Armory_Awesome; // 0x290(0x08)
	Unknown Armory_Break; // 0x298(0x08)
	Unknown Armory_Failed; // 0x2a0(0x08)
	Unknown Armory_Failed_Break; // 0x2a8(0x08)
	Unknown Armory_Failed_Down; // 0x2b0(0x08)
	Unknown Armory_Repair; // 0x2b8(0x08)
	Unknown Armory_Strengthen; // 0x2c0(0x08)
	Unknown Armory_Success; // 0x2c8(0x08)
	Unknown Awesome_Damage1; // 0x2d0(0x08)
	Unknown Awesome_Damage2; // 0x2d8(0x08)
	Unknown Awesome_ItemName; // 0x2e0(0x08)
	Unknown Awesome_Level1; // 0x2e8(0x08)
	Unknown Awesome_Level2; // 0x2f0(0x08)
	Unknown Awesome_MagSize1; // 0x2f8(0x08)
	Unknown Awesome_MagSize2; // 0x300(0x08)
	Unknown Awesome_Spread1; // 0x308(0x08)
	Unknown Awesome_Spread2; // 0x310(0x08)
	Unknown Awesome_UpLevel; // 0x318(0x08)
	Unknown Break_Count; // 0x320(0x08)
	Unknown Break_ItemName; // 0x328(0x08)
	Unknown BreakTitle; // 0x330(0x08)
	Unknown Button_1; // 0x338(0x08)
	Unknown Button_2; // 0x340(0x08)
	Unknown Button_228; // 0x348(0x08)
	Unknown Button_230; // 0x350(0x08)
	Unknown Button_232; // 0x358(0x08)
	Unknown Button_233; // 0x360(0x08)
	Unknown Button_EnchanceCancle; // 0x368(0x08)
	Unknown Button_Enhance; // 0x370(0x08)
	Unknown Button_Fatigue; // 0x378(0x08)
	Unknown Empty; // 0x380(0x08)
	Unknown FB_Damage1; // 0x388(0x08)
	Unknown FB_Damage2; // 0x390(0x08)
	Unknown FB_Level1; // 0x398(0x08)
	Unknown FB_Level2; // 0x3a0(0x08)
	Unknown FB_MagSize1; // 0x3a8(0x08)
	Unknown FB_MagSize2; // 0x3b0(0x08)
	Unknown FB_Spread1; // 0x3b8(0x08)
	Unknown FB_Spread2; // 0x3c0(0x08)
	Unknown FD_Damage1; // 0x3c8(0x08)
	Unknown FD_Damage2; // 0x3d0(0x08)
	Unknown FD_DownLevel; // 0x3d8(0x08)
	Unknown FD_Level1; // 0x3e0(0x08)
	Unknown FD_Level2; // 0x3e8(0x08)
	Unknown FD_MagSize1; // 0x3f0(0x08)
	Unknown FD_MagSize2; // 0x3f8(0x08)
	Unknown FD_Spread1; // 0x400(0x08)
	Unknown FD_Spread2; // 0x408(0x08)
	Unknown HorizontalBox_Awesome_Damage; // 0x410(0x08)
	Unknown HorizontalBox_Awesome_MagSize; // 0x418(0x08)
	Unknown HorizontalBox_Awesome_Spread; // 0x420(0x08)
	Unknown HorizontalBox_FB_Damage; // 0x428(0x08)
	Unknown HorizontalBox_FB_MagSize; // 0x430(0x08)
	Unknown HorizontalBox_FB_Spread; // 0x438(0x08)
	Unknown HorizontalBox_FD_Damage; // 0x440(0x08)
	Unknown HorizontalBox_FD_MasSize; // 0x448(0x08)
	Unknown HorizontalBox_FD_Spread; // 0x450(0x08)
	Unknown HorizontalBox_Strengthen_Damage; // 0x458(0x08)
	Unknown HorizontalBox_Strengthen_MagSize; // 0x460(0x08)
	Unknown HorizontalBox_Strengthen_Spread; // 0x468(0x08)
	Unknown HorizontalBox_Success_Damage; // 0x470(0x08)
	Unknown HorizontalBox_Success_Durable; // 0x478(0x08)
	Unknown HorizontalBox_Success_Fatigue; // 0x480(0x08)
	Unknown HorizontalBox_Success_MagSize; // 0x488(0x08)
	Unknown HorizontalBox_Success_Spread; // 0x490(0x08)
	Unknown Image; // 0x498(0x08)
	Unknown Image_2; // 0x4a0(0x08)
	Unknown Image_3; // 0x4a8(0x08)
	Unknown Image_4; // 0x4b0(0x08)
	Unknown Image_8; // 0x4b8(0x08)
	Unknown Image_14; // 0x4c0(0x08)
	Unknown Image_15; // 0x4c8(0x08)
	Unknown Image_16; // 0x4d0(0x08)
	Unknown Image_17; // 0x4d8(0x08)
	Unknown Image_18; // 0x4e0(0x08)
	Unknown Image_20; // 0x4e8(0x08)
	Unknown Image_27; // 0x4f0(0x08)
	Unknown Image_167; // 0x4f8(0x08)
	Unknown Image_501; // 0x500(0x08)
	Unknown Image_503; // 0x508(0x08)
	Unknown Image_817; // 0x510(0x08)
	Unknown Image_820; // 0x518(0x08)
	Unknown Image_821; // 0x520(0x08)
	Unknown Image_822; // 0x528(0x08)
	Unknown Image_823; // 0x530(0x08)
	Unknown Image_824; // 0x538(0x08)
	Unknown Image_825; // 0x540(0x08)
	Unknown Image_826; // 0x548(0x08)
	Unknown Image_827; // 0x550(0x08)
	Unknown Image_828; // 0x558(0x08)
	Unknown Image_829; // 0x560(0x08)
	Unknown Image_830; // 0x568(0x08)
	Unknown Image_831; // 0x570(0x08)
	Unknown Image_832; // 0x578(0x08)
	Unknown Image_833; // 0x580(0x08)
	Unknown Image_834; // 0x588(0x08)
	Unknown Image_835; // 0x590(0x08)
	Unknown Image_836; // 0x598(0x08)
	Unknown Image_837; // 0x5a0(0x08)
	Unknown Image_838; // 0x5a8(0x08)
	Unknown Image_839; // 0x5b0(0x08)
	Unknown Image_840; // 0x5b8(0x08)
	Unknown Image_841; // 0x5c0(0x08)
	Unknown Image_842; // 0x5c8(0x08)
	Unknown Image_843; // 0x5d0(0x08)
	Unknown Image_845; // 0x5d8(0x08)
	Unknown Image_846; // 0x5e0(0x08)
	Unknown Image_847; // 0x5e8(0x08)
	Unknown Image_848; // 0x5f0(0x08)
	Unknown Image_849; // 0x5f8(0x08)
	Unknown Image_850; // 0x600(0x08)
	Unknown Image_851; // 0x608(0x08)
	Unknown Image_852; // 0x610(0x08)
	Unknown Image_853; // 0x618(0x08)
	Unknown Image_854; // 0x620(0x08)
	Unknown Image_855; // 0x628(0x08)
	Unknown Image_856; // 0x630(0x08)
	Unknown Image_857; // 0x638(0x08)
	Unknown Image_858; // 0x640(0x08)
	Unknown Image_859; // 0x648(0x08)
	Unknown Image_860; // 0x650(0x08)
	Unknown Image_861; // 0x658(0x08)
	Unknown Image_862; // 0x660(0x08)
	Unknown Image_863; // 0x668(0x08)
	Unknown Image_864; // 0x670(0x08)
	Unknown Image_865; // 0x678(0x08)
	Unknown Image_866; // 0x680(0x08)
	Unknown Image_867; // 0x688(0x08)
	Unknown Image_868; // 0x690(0x08)
	Unknown Image_921; // 0x698(0x08)
	Unknown Image_1264; // 0x6a0(0x08)
	Unknown Image_1266; // 0x6a8(0x08)
	Unknown Image_1269; // 0x6b0(0x08)
	Unknown Image_1270; // 0x6b8(0x08)
	Unknown Image_1271; // 0x6c0(0x08)
	Unknown Image_1272; // 0x6c8(0x08)
	Unknown Image_1273; // 0x6d0(0x08)
	Unknown Image_1277; // 0x6d8(0x08)
	Unknown Image_1278; // 0x6e0(0x08)
	Unknown Image_1279; // 0x6e8(0x08)
	Unknown Image_1280; // 0x6f0(0x08)
	Unknown Image_1284; // 0x6f8(0x08)
	Unknown Image_1285; // 0x700(0x08)
	Unknown Image_1318; // 0x708(0x08)
	Unknown Image_1319; // 0x710(0x08)
	Unknown Image_1320; // 0x718(0x08)
	Unknown Image_1321; // 0x720(0x08)
	Unknown Image_1322; // 0x728(0x08)
	Unknown Image_1323; // 0x730(0x08)
	Unknown Image_1324; // 0x738(0x08)
	Unknown Image_1329; // 0x740(0x08)
	Unknown Image_1330; // 0x748(0x08)
	Unknown Image_1335; // 0x750(0x08)
	Unknown Image_1336; // 0x758(0x08)
	Unknown Image_1341; // 0x760(0x08)
	Unknown Image_1342; // 0x768(0x08)
	Unknown Image_1343; // 0x770(0x08)
	Unknown Image_1344; // 0x778(0x08)
	Unknown Image_1345; // 0x780(0x08)
	Unknown Image_1346; // 0x788(0x08)
	Unknown Image_1347; // 0x790(0x08)
	Unknown Image_1348; // 0x798(0x08)
	Unknown Image_1349; // 0x7a0(0x08)
	Unknown Image_1350; // 0x7a8(0x08)
	Unknown Image_1351; // 0x7b0(0x08)
	Unknown Image_1352; // 0x7b8(0x08)
	Unknown Image_1353; // 0x7c0(0x08)
	Unknown Image_1354; // 0x7c8(0x08)
	Unknown Image_1355; // 0x7d0(0x08)
	Unknown Image_1356; // 0x7d8(0x08)
	Unknown Image_1358; // 0x7e0(0x08)
	Unknown Image_1359; // 0x7e8(0x08)
	Unknown Image_1361; // 0x7f0(0x08)
	Unknown Image_1362; // 0x7f8(0x08)
	Unknown Image_1363; // 0x800(0x08)
	Unknown Image_1364; // 0x808(0x08)
	Unknown Image_1366; // 0x810(0x08)
	Unknown Image_1368; // 0x818(0x08)
	Unknown Image_1369; // 0x820(0x08)
	Unknown Image_1370; // 0x828(0x08)
	Unknown Image_1372; // 0x830(0x08)
	Unknown Image_1374; // 0x838(0x08)
	Unknown Image_1375; // 0x840(0x08)
	Unknown Image_1376; // 0x848(0x08)
	Unknown Image_1378; // 0x850(0x08)
	Unknown Image_1380; // 0x858(0x08)
	Unknown Image_1381; // 0x860(0x08)
	Unknown Image_1382; // 0x868(0x08)
	Unknown Image_1384; // 0x870(0x08)
	Unknown Image_1972; // 0x878(0x08)
	Unknown ImageTX_Complete_Fail; // 0x880(0x08)
	Unknown ItemList; // 0x888(0x08)
	Unknown Overlay_FB_ItemList; // 0x890(0x08)
	Unknown Strengthen_Cost; // 0x898(0x08)
	Unknown Strengthen_Count; // 0x8a0(0x08)
	Unknown Strengthen_CurrentDamageText1; // 0x8a8(0x08)
	Unknown Strengthen_CurrentDamageText2; // 0x8b0(0x08)
	Unknown Strengthen_CurrentMagSizeText1; // 0x8b8(0x08)
	Unknown Strengthen_CurrentMagSizeText2; // 0x8c0(0x08)
	Unknown Strengthen_CurrentSpreadText1; // 0x8c8(0x08)
	Unknown Strengthen_CurrentSpreadText2; // 0x8d0(0x08)
	Unknown Strengthen_Icon; // 0x8d8(0x08)
	Unknown Strengthen_IconType1; // 0x8e0(0x08)
	Unknown Strengthen_IconType2; // 0x8e8(0x08)
	Unknown Strengthen_IconType3; // 0x8f0(0x08)
	Unknown Strengthen_Level1; // 0x8f8(0x08)
	Unknown Strengthen_Level2; // 0x900(0x08)
	Unknown Strengthen_Name; // 0x908(0x08)
	Unknown Strengthen_TextType1; // 0x910(0x08)
	Unknown Strengthen_TextType2; // 0x918(0x08)
	Unknown Strengthen_TextType3; // 0x920(0x08)
	Unknown Success_Damage1; // 0x928(0x08)
	Unknown Success_Damage2; // 0x930(0x08)
	Unknown Success_ItemName; // 0x938(0x08)
	Unknown Success_ItemName_2; // 0x940(0x08)
	Unknown Success_Level1; // 0x948(0x08)
	Unknown Success_Level2; // 0x950(0x08)
	Unknown Success_MagSize1; // 0x958(0x08)
	Unknown Success_MagSize2; // 0x960(0x08)
	Unknown Success_Spread1; // 0x968(0x08)
	Unknown Success_Spread2; // 0x970(0x08)
	Unknown Success_UpLevel; // 0x978(0x08)
	Unknown T_Durability; // 0x980(0x08)
	Unknown T_Fatigue; // 0x988(0x08)
	Unknown T_PreFatigue; // 0x990(0x08)
	Unknown TerrainHeight; // 0x998(0x08)
	Unknown TextBlock_2089; // 0x9a0(0x08)
	Unknown TextBlock_F; // 0x9a8(0x08)
	Unknown TextBlock_FBt; // 0x9b0(0x08)
	Unknown TextBlock_F; // 0x9b8(0x08)
	Unknown WidgetSwitcher_1; // 0x9c0(0x08)
	Unknown ResultInfo; // 0x9c8(0x38)
	float CurrentDurability; // 0xa00(0x04)
	Unknown UberGraphFrame; // 0x248(0x08)
	Unknown WrapBox_Main; // 0x250(0x08)
	Unknown DefaultTextStyle; // 0x258(0x268)
	struct FText TextString; // 0x4c0(0x18)
	Unknown Game; // 0x4d8(0x08)
	Unknown HorizontalAlignment; // 0x4e0(0x01)
	float KeyImageScale; // 0x4e4(0x04)
	struct FString NodeName; // 0x30(0x10)
	Unknown TreeAsset; // 0x40(0x08)
	Unknown ParentNode; // 0x48(0x08)
	Unknown Services; // 0x58(0x10)
	Unknown bIgnoreRestartSelf; // 0x68(0x01)
	Unknown BlackboardKey; // 0x70(0x28)
	Unknown bStartAILogicOnPossess; // 0x3e8(0x01)
	Unknown bStopAILogicOnUnposses; // 0x3e8(0x01)
	Unknown bLOSflag; // 0x3e8(0x01)
	Unknown bSkipExtraLOSChecks; // 0x3e8(0x01)
	Unknown bAllowStrafe; // 0x3e8(0x01)
	Unknown bWantsPlayerState; // 0x3e8(0x01)
	Unknown bSetControlRotationFromPawnOrientation; // 0x3e8(0x01)
	Unknown PathFollowingComponent; // 0x3f0(0x08)
	Unknown BrainComponent; // 0x3f8(0x08)
	Unknown PerceptionComponent; // 0x400(0x08)
	Unknown ActionsComp; // 0x408(0x08)
	Unknown Blackboard; // 0x410(0x08)
	Unknown CachedGameplayTasksComponent; // 0x418(0x08)
	Unknown DefaultNavigationFilterClass; // 0x420(0x08)
	struct FMulticastInlineDelegate ReceiveMoveCompleted; // 0x428(0x10)
	float Interval; // 0x60(0x04)
	float RandomDeviation; // 0x64(0x04)
	Unknown bCallTickOnSearchStart; // 0x68(0x01)
	Unknown bRestartTimerOnEachActivation; // 0x68(0x01)
	struct FMulticastInlineDelegate OnSuccess; // 0x28(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x38(0x10)
	struct FName ParamName; // 0x28(0x08)
	float FloatValue; // 0x30(0x04)
	int32_t IntValue; // 0x34(0x04)
	Unknown BoolValue; // 0x38(0x01)
	float Min; // 0x40(0x04)
	float MAX; // 0x44(0x04)
	Unknown bInteger; // 0x48(0x01)
	Unknown SensesConfig; // 0xb0(0x10)
	Unknown DominantSense; // 0xc0(0x08)
	Unknown AIOwner; // 0xd8(0x08)
	struct FMulticastInlineDelegate OnPerceptionUpdated; // 0x160(0x10)
	struct FMulticastInlineDelegate OnTargetPerceptionUpdated; // 0x170(0x10)
	Unknown bAutoRegisterAsSource; // 0xb0(0x01)
	Unknown RegisterAsSourceForSenses; // 0xb8(0x10)
	Unknown AISystem; // 0x30(0x08)
	Unknown Senses; // 0x88(0x10)
	float PerceptionAgingRate; // 0x98(0x04)
	float DefaultExpirationAge; // 0x28(0x04)
	Unknown NotifyType; // 0x2c(0x01)
	Unknown bWantsNewPawnNotification; // 0x30(0x01)
	Unknown bAutoRegisterAllPawnsAsSources; // 0x30(0x01)
	Unknown PerceptionSystemInstance; // 0x38(0x08)
	Unknown ListenerDataType; // 0x80(0x08)
	Unknown ListenerContainer; // 0x88(0x10)
	Unknown UnprocessedEvents; // 0x98(0x10)
	Unknown RegisteredEvents; // 0x80(0x10)
	Unknown NoiseEvents; // 0x80(0x10)
	float SpeedOfSoundSq; // 0x90(0x04)
	Unknown RegisteredEvents; // 0x80(0x10)
	int32_t MaxTracesPerTick; // 0x148(0x04)
	int32_t MinQueriesPerTimeSliceCheck; // 0x14c(0x04)
	double MaxTimeSlicePerTick; // 0x150(0x08)
	float HighImportanceQueryDistanceThreshold; // 0x158(0x04)
	float MaxQueryImportance; // 0x160(0x04)
	float SightLimitQueryImportance; // 0x164(0x04)
	Unknown RegisteredEvents; // 0x80(0x10)
	Unknown RegisteredEvents; // 0x80(0x10)
	Unknown DebugColor; // 0x28(0x04)
	float MaxAge; // 0x2c(0x04)
	Unknown bStartsEnabled; // 0x30(0x01)
	Unknown Implementation; // 0x48(0x08)
	Unknown Implementation; // 0x48(0x08)
	Unknown Implementation; // 0x48(0x08)
	float HearingRange; // 0x50(0x04)
	float LoSHearingRange; // 0x54(0x04)
	Unknown bUseLoSHearing; // 0x58(0x01)
	Unknown DetectionByAffiliation; // 0x5c(0x04)
	Unknown Implementation; // 0x48(0x08)
	float SightRadius; // 0x50(0x04)
	float LoseSightRadius; // 0x54(0x04)
	float PeripheralVisionAngleDegrees; // 0x58(0x04)
	Unknown DetectionByAffiliation; // 0x5c(0x04)
	float AutoSuccessRangeFromLastSeenLocation; // 0x60(0x04)
	Unknown Event; // 0x28(0x30)
	Unknown Event; // 0x28(0x30)
	Unknown PerceptionSystemClassName; // 0x58(0x18)
	Unknown HotSpotManagerClassName; // 0x70(0x18)
	float AcceptanceRadius; // 0x88(0x04)
	float PathfollowingRegularPathPointAcceptanceRadius; // 0x8c(0x04)
	float PathfollowingNavLinkAcceptanceRadius; // 0x90(0x04)
	Unknown bFinishMoveOnGoalOv; // 0x94(0x01)
	Unknown bAcceptPartialPaths; // 0x95(0x01)
	Unknown bAllowStrafing; // 0x96(0x01)
	Unknown bEnableBTAITasks; // 0x97(0x01)
	Unknown bAllowControllersAsEQSQuerier; // 0x98(0x01)
	Unknown bEnableDebuggerPlugin; // 0x99(0x01)
	Unknown bForgetStaleActors; // 0x9a(0x01)
	Unknown DefaultSightCollisionChannel; // 0x9b(0x01)
	Unknown BehaviorTreeManager; // 0xa0(0x08)
	Unknown EnvironmentQueryManager; // 0xa8(0x08)
	Unknown PerceptionSystem; // 0xb0(0x08)
	Unknown AllProxyObjects; // 0xb8(0x10)
	Unknown HotSpotManager; // 0xc8(0x08)
	Unknown NavLocalGrids; // 0xd0(0x08)
	Unknown OwnerController; // 0x68(0x08)
	struct FMulticastInlineDelegate OnRequestFailed; // 0x70(0x10)
	struct FMulticastInlineDelegate OnMoveFinished; // 0x80(0x10)
	Unknown MoveRequest; // 0x90(0x40)
	Unknown RootNode; // 0x30(0x08)
	Unknown BlackboardAsset; // 0x38(0x08)
	Unknown RootDecorators; // 0x40(0x10)
	Unknown RootDecoratorOps; // 0x50(0x10)
	Unknown BlackboardComp; // 0xb8(0x08)
	Unknown AIOwner; // 0xc0(0x08)
	Unknown NodeInstances; // 0x130(0x10)
	Unknown DefaultBehaviorTreeAsset; // 0x268(0x08)
	int32_t MaxDebuggerSteps; // 0x28(0x04)
	Unknown LoadedTemplates; // 0x30(0x10)
	Unknown ActiveComponents; // 0x40(0x10)
	Unknown BrainComp; // 0xb0(0x08)
	Unknown DefaultBlackboardAsset; // 0xb8(0x08)
	Unknown BlackboardAsset; // 0xc0(0x08)
	Unknown KeyInstances; // 0xe8(0x10)
	Unknown Parent; // 0x30(0x08)
	Unknown Keys; // 0x38(0x10)
	Unknown bHasSynchronizedKeys; // 0x48(0x01)
	Unknown BaseClass; // 0x30(0x08)
	Unknown EnumType; // 0x30(0x08)
	struct FString EnumName; // 0x38(0x10)
	Unknown bIsEnumNameValid; // 0x48(0x01)
	struct FString EnumName; // 0x30(0x10)
	Unknown EnumType; // 0x40(0x08)
	Unknown BaseClass; // 0x30(0x08)
	struct FString StringValue; // 0x30(0x10)
	Unknown Children; // 0x58(0x10)
	Unknown Services; // 0x68(0x10)
	Unknown bApplyDecoratorScope; // 0x88(0x01)
	Unknown FinishMode; // 0x90(0x01)
	Unknown bInverseCondition; // 0x60(0x01)
	Unknown FlowAbortMode; // 0x64(0x01)
	Unknown BlackboardKey; // 0x68(0x28)
	int32_t IntValue; // 0x90(0x04)
	float FloatValue; // 0x94(0x04)
	struct FString StringValue; // 0x98(0x10)
	struct FString CachedDescription; // 0xa8(0x10)
	Unknown OperationType; // 0xb8(0x01)
	Unknown NotifyObserver; // 0xb9(0x01)
	Unknown AIOwner; // 0x68(0x08)
	Unknown ActorOwner; // 0x70(0x08)
	Unknown ObservedKeyNames; // 0x78(0x10)
	Unknown bShowPropertyDetails; // 0x98(0x01)
	Unknown bCheckConditionOnlyBlackBoardChanges; // 0x98(0x01)
