// WidgetBlueprintGeneratedClass ButtomButtonWidget.ButtomButtonWidget_C
struct UButtomButtonWidget_C : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown ApplyBtn; //  0x250 Size(8)
	struct Unknown ApplyDisable; //  0x258 Size(8)
	struct Unknown ApplyNormalBg; //  0x260 Size(8)
	struct Unknown ApplyOverBg; //  0x268 Size(8)
	struct Unknown ApplyPressBg; //  0x270 Size(8)
	struct Unknown Button_31; //  0x278 Size(8)
	struct Unknown Lock; //  0x280 Size(8)
	struct Unknown NormalBg; //  0x288 Size(8)
	struct Unknown NormalBtn; //  0x290 Size(8)
	struct Unknown OverBG; //  0x298 Size(8)
	struct Unknown PressBg; //  0x2a0 Size(8)
	struct Unknown Title_Text; //  0x2a8 Size(8)
	struct FText Title; //  0x2b0 Size(18)
	struct FMulticastInlineDelegate OnClickEvent; //  0x2c8 Size(10)
	char IsDisableBnt; //  0x2d8 Size(1)
	int32_t CurType; //  0x2dc Size(4)
	char ColorType; //  0x2e0 Size(1)
	char Applytype; //  0x2e1 Size(1)
	char NewVar_1; //  0x2e2 Size(1)

	void Set(char IsDisable); // Function ButtomButtonWidget.ButtomButtonWidget_C.Set(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

