// BlueprintGeneratedClass Chameleon.Chameleon_C
struct AChameleon_C : UActor {
	struct Unknown UberGraphFrame; //  0x310 Size(8)
	struct Unknown MaterialBillboard; //  0x318 Size(8)
	struct Unknown InternalPP; //  0x320 Size(8)
	struct Unknown Bounding; //  0x328 Size(8)
	char Bleach; //  0x330 Size(1)
	char Distance; //  0x331 Size(1)
	char Channel; //  0x332 Size(1)
	struct Unknown mChannelClamper; //  0x338 Size(8)
	struct Unknown iChannelClamper; //  0x340 Size(8)
	char Channel; //  0x348 Size(1)
	char Screen; //  0x349 Size(1)
	char Alcohol; //  0x34a Size(1)
	char Drug; //  0x34b Size(1)
	char Mosaic; //  0x34c Size(1)
	char Pixel; //  0x34d Size(1)
	char Blur; //  0x34e Size(1)
	struct Unknown mBleachBypass; //  0x350 Size(8)
	struct Unknown mDistanceFog; //  0x358 Size(8)
	struct Unknown mChannelSwapper; //  0x360 Size(8)
	struct Unknown mScreenDrops; //  0x368 Size(8)
	struct Unknown mAlcohol; //  0x370 Size(8)
	struct Unknown mDrug; //  0x378 Size(8)
	struct Unknown mMosaic; //  0x380 Size(8)
	struct Unknown mPixelDissolve; //  0x388 Size(8)
	struct Unknown mBlur; //  0x390 Size(8)
	float Channel; //  0x398 Size(4)
	float Channel; //  0x39c Size(4)
	float Channel; //  0x3a0 Size(4)
	struct Unknown iBleachBypass; //  0x3a8 Size(8)
	struct Unknown iDistanceFog; //  0x3b0 Size(8)
	struct Unknown iChannelSwapper; //  0x3b8 Size(8)
	char Channel; //  0x3c0 Size(1)
	char Channel; //  0x3c1 Size(1)
	char Channel; //  0x3c2 Size(1)
	struct Unknown iScreenDrops; //  0x3c8 Size(8)
	struct Unknown iAlcohol; //  0x3d0 Size(8)
	struct Unknown iDrug; //  0x3d8 Size(8)
	struct Unknown iMosaic; //  0x3e0 Size(8)
	struct Unknown iPixelDissolve; //  0x3e8 Size(8)
	struct Unknown iBlur; //  0x3f0 Size(8)
	struct Unknown Screen; //  0x3f8 Size(8)
	float Screen; //  0x400 Size(4)
	float Mosaic; //  0x404 Size(4)
	float Alcohol; //  0x408 Size(4)
	float Drug; //  0x40c Size(4)
	float Pixel; //  0x410 Size(4)
	float Blur; //  0x414 Size(4)
	char ASCII; //  0x418 Size(1)
	struct Unknown mAscii; //  0x420 Size(8)
	struct Unknown iAscii; //  0x428 Size(8)
	char Colorize; //  0x430 Size(1)
	struct Unknown mColorize; //  0x438 Size(8)
	struct Unknown iColorize; //  0x440 Size(8)
	float Colorize; //  0x448 Size(4)
	char Comic; //  0x44c Size(1)
	struct Unknown mComic; //  0x450 Size(8)
	struct Unknown iComic; //  0x458 Size(8)
	struct Unknown Comic; //  0x460 Size(10)
	float Comic; //  0x470 Size(4)
	char Edge; //  0x474 Size(1)
	struct Unknown mEdgeDetect; //  0x478 Size(8)
	struct Unknown iEdgeDetect; //  0x480 Size(8)
	char Emboss; //  0x488 Size(1)
	struct Unknown mEmboss; //  0x490 Size(8)
	struct Unknown iEmboss; //  0x498 Size(8)
	char Glitch; //  0x4a0 Size(1)
	struct Unknown mGlitch; //  0x4a8 Size(8)
	struct Unknown iGlitch; //  0x4b0 Size(8)
	float Glitch; //  0x4b8 Size(4)
	float Glitch; //  0x4bc Size(4)
	float Glitch; //  0x4c0 Size(4)
	char Monitor; //  0x4c4 Size(1)
	struct Unknown mGrainNLines; //  0x4c8 Size(8)
	struct Unknown iGrainNLines; //  0x4d0 Size(8)
	float Monitor; //  0x4d8 Size(4)
	float Monitor; //  0x4dc Size(4)
	float Monitor; //  0x4e0 Size(4)
	char Hard; //  0x4e4 Size(1)
	struct Unknown mHardEmboss; //  0x4e8 Size(8)
	struct Unknown iHardEmboss; //  0x4f0 Size(8)
	char Hue; //  0x4f8 Size(1)
	struct Unknown mHuePanner; //  0x500 Size(8)
	struct Unknown iHuePanner; //  0x508 Size(8)
	float Hue; //  0x510 Size(4)
	char Monochrome; //  0x514 Size(1)
	struct Unknown mMonochrome; //  0x518 Size(8)
	struct Unknown iMonochrome; //  0x520 Size(8)
	struct Unknown Monochrome; //  0x528 Size(10)
	char Radial; //  0x538 Size(1)
	struct Unknown mRadialBlur; //  0x540 Size(8)
	struct Unknown iRadialBlur; //  0x548 Size(8)
	float Radial; //  0x550 Size(4)
	int32_t Radial; //  0x554 Size(4)
	char Scratches; //  0x558 Size(1)
	struct Unknown mScratches; //  0x560 Size(8)
	struct Unknown iScratches; //  0x568 Size(8)
	char Screen; //  0x570 Size(1)
	struct Unknown mScreenWaves; //  0x578 Size(8)
	struct Unknown iScreenWaves; //  0x580 Size(8)
	float Screen; //  0x588 Size(4)
	float Screen; //  0x58c Size(4)
	float Monitor; //  0x590 Size(4)
	float Monitor; //  0x594 Size(4)
	float Monitor; //  0x598 Size(4)
	struct Unknown Distance; //  0x59c Size(10)
	struct Unknown Distance; //  0x5ac Size(10)
	float Distance; //  0x5bc Size(4)
	struct Unknown Scratches; //  0x5c0 Size(8)
	float Scratches; //  0x5c8 Size(4)
	struct Unknown Scratches; //  0x5cc Size(10)
	float Screen; //  0x5dc Size(4)
	float Screen; //  0x5e0 Size(4)
	struct Unknown Screen; //  0x5e8 Size(8)
	float Screen; //  0x5f0 Size(4)
	float Screen; //  0x5f4 Size(4)
	float Screen; //  0x5f8 Size(4)
	struct Unknown Screen; //  0x600 Size(8)
	float Screen; //  0x608 Size(4)
	float Screen; //  0x60c Size(4)
	char Invert; //  0x610 Size(1)
	struct Unknown mInvert; //  0x618 Size(8)
	struct Unknown iInvert; //  0x620 Size(8)
	char Iridescent; //  0x628 Size(1)
	struct Unknown mIridescent; //  0x630 Size(8)
	struct Unknown iIridescent; //  0x638 Size(8)
	float Iridescent; //  0x640 Size(4)
	char Kuwahara; //  0x644 Size(1)
	struct Unknown mKuwahara; //  0x648 Size(8)
	struct Unknown iKuwahara; //  0x650 Size(8)
	int32_t Kuwahara; //  0x658 Size(4)
	char Pulse; //  0x65c Size(1)
	struct Unknown mPulse; //  0x660 Size(8)
	struct Unknown iPulse; //  0x668 Size(8)
	float Pulse; //  0x670 Size(4)
	float Pulse; //  0x674 Size(4)
	float Pulse; //  0x678 Size(4)
	float Pulse; //  0x67c Size(4)
	char Squares; //  0x680 Size(1)
	struct Unknown mSquares; //  0x688 Size(8)
	struct Unknown iSquares; //  0x690 Size(8)
	float Squares; //  0x698 Size(4)
	float Squares; //  0x69c Size(4)
	float Squares; //  0x6a0 Size(4)
	float Squares; //  0x6a4 Size(4)
	char Tiles; //  0x6a8 Size(1)
	struct Unknown mTiles; //  0x6b0 Size(8)
	struct Unknown iTiles; //  0x6b8 Size(8)
	char Tiles; //  0x6c0 Size(1)
	float Tiles; //  0x6c4 Size(4)
	char T; //  0x6c8 Size(1)
	struct Unknown mTVNoise; //  0x6d0 Size(8)
	struct Unknown iTVNoise; //  0x6d8 Size(8)
	float T; //  0x6e0 Size(4)
	float T; //  0x6e4 Size(4)
	struct Unknown Native; //  0x6f0 Size(5c0)
	char LOO; //  0xcb0 Size(1)
	char LOO; //  0xcb1 Size(1)
	char Circles; //  0xcb2 Size(1)
	struct Unknown mCircles; //  0xcb8 Size(8)
	struct Unknown iCircles; //  0xcc0 Size(8)
	float Circles; //  0xcc8 Size(4)
	float Circles; //  0xccc Size(4)
	char Sonar; //  0xcd0 Size(1)
	struct Unknown mSonar; //  0xcd8 Size(8)
	struct Unknown iSonar; //  0xce0 Size(8)
	struct Unknown Sonar; //  0xce8 Size(10)
	float Sonar; //  0xcf8 Size(4)
	float Sonar; //  0xcfc Size(4)
	float Sonar; //  0xd00 Size(4)
	float Sonar; //  0xd04 Size(4)
	float Sonar; //  0xd08 Size(4)
	float Alcohol; //  0xd0c Size(4)
	char Distance; //  0xd10 Size(1)
	struct Unknown mDistanceDistortion; //  0xd18 Size(8)
	struct Unknown iDistanceDistortion; //  0xd20 Size(8)
	struct Unknown Distance; //  0xd28 Size(8)
	float Distance; //  0xd30 Size(4)
	float Distance; //  0xd34 Size(4)
	float Distance; //  0xd38 Size(4)
	float Distance; //  0xd3c Size(4)
	float Distance; //  0xd40 Size(4)
	float Distance; //  0xd44 Size(4)
	float Distance; //  0xd48 Size(4)
	char Drawing; //  0xd4c Size(1)
	struct Unknown mDrawing; //  0xd50 Size(8)
	struct Unknown iDrawing; //  0xd58 Size(8)
	struct Unknown Drawing; //  0xd60 Size(8)
	char Drawing; //  0xd68 Size(1)
	float Drawing; //  0xd6c Size(4)
	float Drawing; //  0xd70 Size(4)
	struct Unknown Drawing; //  0xd74 Size(10)
	char Magic; //  0xd84 Size(1)
	struct Unknown mMagicTransitions; //  0xd88 Size(8)
	struct Unknown iMagicTransitions; //  0xd90 Size(8)
	struct Unknown Magic; //  0xd98 Size(8)
	struct Unknown Magic; //  0xda0 Size(8)
	float Magic; //  0xda8 Size(4)
	float Magic; //  0xdac Size(4)
	float Magic; //  0xdb0 Size(4)
	struct Unknown Magic; //  0xdb4 Size(10)
	char Screen; //  0xdc4 Size(1)
	struct Unknown mScreenDamage; //  0xdc8 Size(8)
	struct Unknown iScreenDamage; //  0xdd0 Size(8)
	struct Unknown Screen; //  0xdd8 Size(8)
	float Screen; //  0xde0 Size(4)
	float Screen; //  0xde4 Size(4)
	struct Unknown Screen; //  0xde8 Size(10)
	float Screen; //  0xdf8 Size(4)
	float Screen; //  0xdfc Size(4)
	char Screen; //  0xe00 Size(1)
	struct Unknown mScreenDecals; //  0xe08 Size(8)
	struct Unknown iScreenDecals; //  0xe10 Size(8)
	struct Unknown Screen; //  0xe18 Size(8)
	float Screen; //  0xe20 Size(4)
	float Screen; //  0xe24 Size(4)
	float Screen; //  0xe28 Size(4)
	float Screen; //  0xe2c Size(4)
	float Screen; //  0xe30 Size(4)
	float Screen; //  0xe34 Size(4)
	struct Unknown Screen; //  0xe38 Size(8)
	float Screen; //  0xe40 Size(4)
	float Screen; //  0xe44 Size(4)
	float Screen; //  0xe48 Size(4)
	float Screen; //  0xe4c Size(4)
	float Screen; //  0xe50 Size(4)
	float Screen; //  0xe54 Size(4)
	struct Unknown Screen; //  0xe58 Size(8)
	float Screen; //  0xe60 Size(4)
	float Screen; //  0xe64 Size(4)
	float Screen; //  0xe68 Size(4)
	float Screen; //  0xe6c Size(4)
	float Screen; //  0xe70 Size(4)
	float Screen; //  0xe74 Size(4)
	struct Unknown Screen; //  0xe78 Size(8)
	float Screen; //  0xe80 Size(4)
	float Screen; //  0xe84 Size(4)
	float Screen; //  0xe88 Size(4)
	float Screen; //  0xe8c Size(4)
	float Screen; //  0xe90 Size(4)
	float Screen; //  0xe94 Size(4)
	char Sharpen; //  0xe98 Size(1)
	struct Unknown mSharpen; //  0xea0 Size(8)
	struct Unknown iSharpen; //  0xea8 Size(8)
	float Sharpen; //  0xeb0 Size(4)
	char Toon; //  0xeb4 Size(1)
	struct Unknown mToonShading; //  0xeb8 Size(8)
	struct Unknown iToonShading; //  0xec0 Size(8)
	char Toon; //  0xec8 Size(1)
	float Toon; //  0xecc Size(4)
	float Toon; //  0xed0 Size(4)
	float Toon; //  0xed4 Size(4)
	float Toon; //  0xed8 Size(4)
	char Anamorphic; //  0xedc Size(1)
	struct Unknown mAnamorphicLensFlares; //  0xee0 Size(8)
	struct Unknown iAnamorphicLensFlares; //  0xee8 Size(8)
	float Anamorphic; //  0xef0 Size(4)
	float Anamorphic; //  0xef4 Size(4)
	float Anamorphic; //  0xef8 Size(4)
	float Anamorphic; //  0xefc Size(4)
	float Anamorphic; //  0xf00 Size(4)
	float Anamorphic; //  0xf04 Size(4)
	struct Unknown Anamorphic; //  0xf08 Size(10)
	char Frost; //  0xf18 Size(1)
	struct Unknown mFrost; //  0xf20 Size(8)
	struct Unknown iFrost; //  0xf28 Size(8)
	struct Unknown Frost; //  0xf30 Size(8)
	float Frost; //  0xf38 Size(4)
	float Frost; //  0xf3c Size(4)
	float Frost; //  0xf40 Size(4)
	struct Unknown ASCI; //  0xf44 Size(10)
	char Neon; //  0xf54 Size(1)
	struct Unknown mNeon; //  0xf58 Size(8)
	struct Unknown iNeon; //  0xf60 Size(8)
	struct Unknown Neon; //  0xf68 Size(10)
	float Neon; //  0xf78 Size(4)
	float Neon; //  0xf7c Size(4)
	char Custom; //  0xf80 Size(1)
	struct Unknown mCustomDepthHighlighter; //  0xf88 Size(8)
	struct Unknown iCustomDepthHighlighter; //  0xf90 Size(8)
	struct Unknown Custom; //  0xf98 Size(10)
	float Custom; //  0xfa8 Size(4)
	char Custom; //  0xfac Size(1)
	struct Unknown mCustomDepthHighlighterClip; //  0xfb0 Size(8)
	struct Unknown iCustomDepthHighlighterClip; //  0xfb8 Size(8)
	struct Unknown Custom; //  0xfc0 Size(10)
	float Custom; //  0xfd0 Size(4)
	float Edge; //  0xfd4 Size(4)
	float Scratches; //  0xfd8 Size(4)
	char Enabled; //  0xfdc Size(1)
	char Unbound; //  0xfdd Size(1)
	struct TArray<Unknown> AllMaterials; //  0xfe0 Size(10)
	float Screen; //  0xff0 Size(4)
	struct Unknown Screen; //  0xff4 Size(10)
	float Screen; //  0x1004 Size(4)
	float Screen; //  0x1008 Size(4)
	float Screen; //  0x100c Size(4)
	float Screen; //  0x1010 Size(4)
	char 2; //  0x1014 Size(1)
	struct Unknown m2DTransform; //  0x1018 Size(8)
	struct Unknown i2DTransform; //  0x1020 Size(8)
	char Kaleidescope; //  0x1028 Size(1)
	struct Unknown mKaleidescope; //  0x1030 Size(8)
	struct Unknown iKaleidescope; //  0x1038 Size(8)
	char Letterboxing; //  0x1040 Size(1)
	struct Unknown mLetterboxing; //  0x1048 Size(8)
	struct Unknown iLetterboxing; //  0x1050 Size(8)
	char Snow; //  0x1058 Size(1)
	struct Unknown mSnow; //  0x1060 Size(8)
	struct Unknown iSnow; //  0x1068 Size(8)
	float 2; //  0x1070 Size(4)
	float 2; //  0x1074 Size(4)
	float 2; //  0x1078 Size(4)
	float 2; //  0x107c Size(4)
	float 2; //  0x1080 Size(4)
	float 2; //  0x1084 Size(4)
	float 2; //  0x1088 Size(4)
	char 2; //  0x108c Size(1)
	float Kaleidescope; //  0x1090 Size(4)
	float Kaleidescope; //  0x1094 Size(4)
	float Kaleidescope; //  0x1098 Size(4)
	struct Unknown Letterboxing; //  0x10a0 Size(8)
	float Letterboxing; //  0x10a8 Size(4)
	char Letterboxing; //  0x10ac Size(1)
	char Letterboxing; //  0x10ad Size(1)
	float Snow; //  0x10b0 Size(4)
	float Snow; //  0x10b4 Size(4)
	float Snow; //  0x10b8 Size(4)
	float Snow; //  0x10bc Size(4)
	float Snow; //  0x10c0 Size(4)
	float Drawing; //  0x10c4 Size(4)
	float Distance; //  0x10c8 Size(4)
	float Screen; //  0x10cc Size(4)
	char World; //  0x10d0 Size(1)
	struct Unknown mWorldSplash; //  0x10d8 Size(8)
	struct Unknown iWorldSplash; //  0x10e0 Size(8)
	float World; //  0x10e8 Size(4)
	float World; //  0x10ec Size(4)
	float World; //  0x10f0 Size(4)
	struct Unknown World; //  0x10f4 Size(10)
	int32_t Blur; //  0x1104 Size(4)
	struct Unknown Frost; //  0x1108 Size(10)
	float Comic; //  0x1118 Size(4)
	float Comic; //  0x111c Size(4)
	char World; //  0x1120 Size(1)
	struct Unknown mWorldGlitch; //  0x1128 Size(8)
	struct Unknown iWorldGlitch; //  0x1130 Size(8)
	char World; //  0x1138 Size(1)
	float World; //  0x113c Size(4)
	float World; //  0x1140 Size(4)
	float World; //  0x1144 Size(4)
	float World; //  0x1148 Size(4)
	float World; //  0x114c Size(4)
	struct Unknown World; //  0x1150 Size(c)
	struct Unknown World; //  0x115c Size(c)
	char Digitize; //  0x1168 Size(1)
	struct Unknown mDigitize; //  0x1170 Size(8)
	struct Unknown iDigitize; //  0x1178 Size(8)
	struct Unknown Digitize; //  0x1180 Size(10)
	struct Unknown Digitize; //  0x1190 Size(c)
	struct Unknown Digitize; //  0x119c Size(c)
	float Digitize; //  0x11a8 Size(4)
	float Digitize; //  0x11ac Size(4)
	float Digitize; //  0x11b0 Size(4)
	float Digitize; //  0x11b4 Size(4)
	float Digitize; //  0x11b8 Size(4)
	float Digitize; //  0x11bc Size(4)
	char Alarm; //  0x11c0 Size(1)
	struct Unknown mAlarm; //  0x11c8 Size(8)
	struct Unknown iAlarm; //  0x11d0 Size(8)
	struct Unknown Alarm; //  0x11d8 Size(10)
	float Alarm; //  0x11e8 Size(4)
	char Sketch; //  0x11ec Size(1)
	struct Unknown mSketch; //  0x11f0 Size(8)
	struct Unknown iSketch; //  0x11f8 Size(8)
	struct Unknown Sketch; //  0x1200 Size(10)
	struct Unknown Sketch; //  0x1210 Size(10)
	float Sketch; //  0x1220 Size(4)
	float Sketch; //  0x1224 Size(4)
	float Sketch; //  0x1228 Size(4)
	struct Unknown Custom; //  0x122c Size(10)
	float Custom; //  0x123c Size(4)
	struct Unknown Custom; //  0x1240 Size(10)
	float Custom; //  0x1250 Size(4)
	char Wired; //  0x1254 Size(1)
	struct Unknown iWired; //  0x1258 Size(8)
	struct Unknown mWired; //  0x1260 Size(8)
	struct Unknown Wired; //  0x1268 Size(10)
	float Wired; //  0x1278 Size(4)
	struct Unknown Mosaic; //  0x1280 Size(38)
	struct Unknown Drug; //  0x12b8 Size(38)
	struct Unknown Alcohol; //  0x12f0 Size(38)
	struct Unknown Pixel; //  0x1328 Size(38)
	struct Unknown Channel; //  0x1360 Size(38)
	struct Unknown Channel; //  0x1398 Size(38)
	struct Unknown Bleach; //  0x13d0 Size(38)
	struct Unknown Blur; //  0x1408 Size(38)
	float ASCI; //  0x1440 Size(4)
	struct Unknown ASCI; //  0x1448 Size(38)
	struct Unknown Colorize; //  0x1480 Size(38)
	struct Unknown Edge; //  0x14b8 Size(38)
	struct Unknown Emboss; //  0x14f0 Size(38)
	struct Unknown Hard; //  0x1528 Size(38)
	float Glitch; //  0x1560 Size(4)
	float Glitch; //  0x1564 Size(4)
	float Glitch; //  0x1568 Size(4)
	struct Unknown Glitch; //  0x1570 Size(38)
	char Monitor; //  0x15a8 Size(1)
	struct Unknown Monitor; //  0x15b0 Size(38)
	struct Unknown Hue; //  0x15e8 Size(38)
	struct Unknown Monochrome; //  0x1620 Size(38)
	struct Unknown Radial; //  0x1658 Size(8)
	struct Unknown Radial; //  0x1660 Size(8)
	struct Unknown Radial; //  0x1668 Size(38)
	struct Unknown Scratches; //  0x16a0 Size(38)
	struct Unknown Screen; //  0x16d8 Size(38)
	struct Unknown Distance; //  0x1710 Size(38)
	struct Unknown Screen; //  0x1748 Size(38)
	struct Unknown Invert; //  0x1780 Size(38)
	struct Unknown Iridescent; //  0x17b8 Size(38)
	struct Unknown Kuwahara; //  0x17f0 Size(38)
	struct Unknown Pulse; //  0x1828 Size(38)
	struct Unknown Squares; //  0x1860 Size(38)
	struct Unknown Tiles; //  0x1898 Size(38)
	struct Unknown T; //  0x18d0 Size(38)
	struct Unknown Circles; //  0x1908 Size(38)
	struct Unknown Sonar; //  0x1940 Size(38)
	struct Unknown Distance; //  0x1978 Size(38)
	struct Unknown Drawing; //  0x19b0 Size(38)
	struct Unknown Magic; //  0x19e8 Size(38)
	struct Unknown Screen; //  0x1a20 Size(38)
	struct Unknown Screen; //  0x1a58 Size(38)
	struct Unknown Sharpen; //  0x1a90 Size(38)
	struct Unknown Toon; //  0x1ac8 Size(38)
	struct Unknown Anamorphic; //  0x1b00 Size(38)
	struct Unknown Frost; //  0x1b38 Size(38)
	struct Unknown Neon; //  0x1b70 Size(38)
	struct Unknown Custom; //  0x1ba8 Size(30)
	struct Unknown Custom; //  0x1bd8 Size(30)
	struct Unknown 2; //  0x1c08 Size(10)
	struct Unknown 2; //  0x1c18 Size(38)
	struct Unknown Kaleidescope; //  0x1c50 Size(38)
	struct Unknown Letterboxing; //  0x1c88 Size(38)
	struct Unknown Snow; //  0x1cc0 Size(38)
	struct Unknown World; //  0x1cf8 Size(38)
	struct Unknown World; //  0x1d30 Size(38)
	struct Unknown Digitize; //  0x1d68 Size(38)
	struct Unknown Alarm; //  0x1da0 Size(38)
	struct Unknown Sketch; //  0x1dd8 Size(38)
	struct Unknown Wired; //  0x1e10 Size(38)
	float Comic; //  0x1e48 Size(4)
	int32_t Comic; //  0x1e4c Size(4)
	float Comic; //  0x1e50 Size(4)
	struct Unknown Comic; //  0x1e58 Size(38)
	char Actor; //  0x1e90 Size(1)
	struct Unknown mActorFeaturette; //  0x1e98 Size(8)
	struct Unknown iActorFeaturette; //  0x1ea0 Size(8)
	struct Unknown Actor; //  0x1ea8 Size(10)
	float Actor; //  0x1eb8 Size(4)
	struct Unknown Actor; //  0x1ebc Size(10)
	float Actor; //  0x1ecc Size(4)
	float Actor; //  0x1ed0 Size(4)
	int32_t Actor; //  0x1ed4 Size(4)
	int32_t Actor; //  0x1ed8 Size(4)
	struct Unknown Actor; //  0x1ee0 Size(30)
	char Infected; //  0x1f10 Size(1)
	struct Unknown mInfected; //  0x1f18 Size(8)
	struct Unknown iInfected; //  0x1f20 Size(8)
	float Infected; //  0x1f28 Size(4)
	float Infected; //  0x1f2c Size(4)
	float Infected; //  0x1f30 Size(4)
	float Infected; //  0x1f34 Size(4)
	struct Unknown Infected; //  0x1f38 Size(38)
	char Colored; //  0x1f70 Size(1)
	struct Unknown mColoredAO; //  0x1f78 Size(8)
	struct Unknown iColoredAO; //  0x1f80 Size(8)
	struct Unknown Colored; //  0x1f88 Size(10)
	float Colored; //  0x1f98 Size(4)
	struct Unknown Colored; //  0x1fa0 Size(38)
	char Camera; //  0x1fd8 Size(1)
	struct Unknown mCameraShake; //  0x1fe0 Size(8)
	struct Unknown iCameraShake; //  0x1fe8 Size(8)
	float Camera; //  0x1ff0 Size(4)
	float Camera; //  0x1ff4 Size(4)
	float Camera; //  0x1ff8 Size(4)
	struct Unknown Camera; //  0x2000 Size(38)
	char Disco; //  0x2038 Size(1)
	struct Unknown mDiscoBall; //  0x2040 Size(8)
	struct Unknown iDiscoBall; //  0x2048 Size(8)
	struct Unknown Disco; //  0x2050 Size(c)
	struct Unknown Disco; //  0x205c Size(10)
	struct Unknown Disco; //  0x206c Size(10)
	struct Unknown Disco; //  0x207c Size(c)
	float Disco; //  0x2088 Size(4)
	float Disco; //  0x208c Size(4)
	float Disco; //  0x2090 Size(4)
	struct Unknown Disco; //  0x2098 Size(38)
	char Hazy; //  0x20d0 Size(1)
	struct Unknown mHazyLights; //  0x20d8 Size(8)
	struct Unknown iHazyLights; //  0x20e0 Size(8)
	struct Unknown Hazy; //  0x20e8 Size(8)
	struct Unknown Hazy; //  0x20f0 Size(8)
	struct Unknown Hazy; //  0x20f8 Size(38)
	char Melted; //  0x2130 Size(1)
	struct Unknown mMeltedWorld; //  0x2138 Size(8)
	struct Unknown iMeltedWorld; //  0x2140 Size(8)
	struct Unknown Melted; //  0x2148 Size(c)
	float Melted; //  0x2154 Size(4)
	float Melted; //  0x2158 Size(4)
	float Melted; //  0x215c Size(4)
	struct Unknown Melted; //  0x2160 Size(38)
	char Selective; //  0x2198 Size(1)
	struct Unknown mSelectiveColor; //  0x21a0 Size(8)
	struct Unknown iSelectiveColor; //  0x21a8 Size(8)
	struct Unknown Selective; //  0x21b0 Size(10)
	float Selective; //  0x21c0 Size(4)
	float Selective; //  0x21c4 Size(4)
	float Selective; //  0x21c8 Size(4)
	struct Unknown Selective; //  0x21d0 Size(38)
	char Screen; //  0x2208 Size(1)
	struct Unknown mScreenFire; //  0x2210 Size(8)
	struct Unknown iScreenFire; //  0x2218 Size(8)
	struct Unknown Screen; //  0x2220 Size(10)
	float Screen; //  0x2230 Size(4)
	float Screen; //  0x2234 Size(4)
	float Screen; //  0x2238 Size(4)
	float Screen; //  0x223c Size(4)
	float Screen; //  0x2240 Size(4)
	struct Unknown Screen; //  0x2248 Size(38)
	char Haunted; //  0x2280 Size(1)
	struct Unknown mHaunted; //  0x2288 Size(8)
	struct Unknown iHaunted; //  0x2290 Size(8)
	float Haunted; //  0x2298 Size(4)
	float Haunted; //  0x229c Size(4)
	struct Unknown Haunted; //  0x22a0 Size(8)
	float Haunted; //  0x22a8 Size(4)
	struct Unknown Haunted; //  0x22b0 Size(38)
	char Grid; //  0x22e8 Size(1)
	struct Unknown mGridCell; //  0x22f0 Size(8)
	struct Unknown iGridCell; //  0x22f8 Size(8)
	char Grid; //  0x2300 Size(1)
	float Grid; //  0x2304 Size(4)
	struct Unknown Grid; //  0x2308 Size(10)
	struct Unknown Grid; //  0x2318 Size(10)
	float Grid; //  0x2328 Size(4)
	float Grid; //  0x232c Size(4)
	char Lens; //  0x2330 Size(1)
	struct Unknown mLensDistortion; //  0x2338 Size(8)
	struct Unknown iLensDistortion; //  0x2340 Size(8)
	float Lens; //  0x2348 Size(4)
	float Lens; //  0x234c Size(4)
	float Lens; //  0x2350 Size(4)
	float Lens; //  0x2354 Size(4)
	struct Unknown Lens; //  0x2358 Size(8)
	float Lens; //  0x2360 Size(4)
	float Lens; //  0x2364 Size(4)
	struct Unknown Lens; //  0x2368 Size(38)
	struct Unknown Grid; //  0x23a0 Size(38)
	char Zone; //  0x23d8 Size(1)
	struct Unknown mZone; //  0x23e0 Size(8)
	struct Unknown iZone; //  0x23e8 Size(8)
	struct Unknown Zone; //  0x23f0 Size(10)
	float Zone; //  0x2400 Size(4)
	float Zone; //  0x2404 Size(4)
	struct Unknown Zone; //  0x2408 Size(10)
	struct Unknown Zone; //  0x2418 Size(10)
	struct Unknown Zone; //  0x2428 Size(38)
	char Pyramid; //  0x2460 Size(1)
	struct Unknown mPyramid; //  0x2468 Size(8)
	struct Unknown iPyramid; //  0x2470 Size(8)
	char Pyramid; //  0x2478 Size(1)
	struct Unknown Pyramid; //  0x247c Size(10)
	float Pyramid; //  0x248c Size(4)
	float Pyramid; //  0x2490 Size(4)
	float Pyramid; //  0x2494 Size(4)
	struct Unknown Pyramid; //  0x2498 Size(38)
	char Mojo; //  0x24d0 Size(1)
	struct Unknown mMojo; //  0x24d8 Size(8)
	struct Unknown iMojo; //  0x24e0 Size(8)
	char Mojo; //  0x24e8 Size(1)
	float Mojo; //  0x24ec Size(4)
	struct Unknown Mojo; //  0x24f0 Size(8)
	struct Unknown Mojo; //  0x24f8 Size(8)
	float Mojo; //  0x2500 Size(4)
	struct Unknown Mojo; //  0x2504 Size(10)
	float Mojo; //  0x2514 Size(4)
	float Mojo; //  0x2518 Size(4)
	float Mojo; //  0x251c Size(4)
	struct Unknown Mojo; //  0x2520 Size(38)

	void Create(struct Unknown Material, struct Unknown& Instance); // Function Chameleon.Chameleon_C.Create(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

