// BlueprintGeneratedClass Chameleon.Chameleon_C
class AChameleon_C : public UActor {

public:

	struct Unknown UberGraphFrame; // 0x310 (8)
	struct Unknown MaterialBillboard; // 0x318 (8)
	struct Unknown InternalPP; // 0x320 (8)
	struct Unknown Bounding; // 0x328 (8)
	char Bleach : 0; // 0x330 (1)
	char Distance : 0; // 0x331 (1)
	char Channel : 0; // 0x332 (1)
	struct Unknown mChannelClamper; // 0x338 (8)
	struct Unknown iChannelClamper; // 0x340 (8)
	char Channel : 0; // 0x348 (1)
	char Screen : 0; // 0x349 (1)
	char Alcohol : 0; // 0x34A (1)
	char Drug : 0; // 0x34B (1)
	char Mosaic : 0; // 0x34C (1)
	char Pixel : 0; // 0x34D (1)
	char Blur : 0; // 0x34E (1)
	struct Unknown mBleachBypass; // 0x350 (8)
	struct Unknown mDistanceFog; // 0x358 (8)
	struct Unknown mChannelSwapper; // 0x360 (8)
	struct Unknown mScreenDrops; // 0x368 (8)
	struct Unknown mAlcohol; // 0x370 (8)
	struct Unknown mDrug; // 0x378 (8)
	struct Unknown mMosaic; // 0x380 (8)
	struct Unknown mPixelDissolve; // 0x388 (8)
	struct Unknown mBlur; // 0x390 (8)
	float Channel; // 0x398 (4)
	float Channel; // 0x39C (4)
	float Channel; // 0x3A0 (4)
	struct Unknown iBleachBypass; // 0x3A8 (8)
	struct Unknown iDistanceFog; // 0x3B0 (8)
	struct Unknown iChannelSwapper; // 0x3B8 (8)
	char Channel; // 0x3C0 (1)
	char Channel; // 0x3C1 (1)
	char Channel; // 0x3C2 (1)
	struct Unknown iScreenDrops; // 0x3C8 (8)
	struct Unknown iAlcohol; // 0x3D0 (8)
	struct Unknown iDrug; // 0x3D8 (8)
	struct Unknown iMosaic; // 0x3E0 (8)
	struct Unknown iPixelDissolve; // 0x3E8 (8)
	struct Unknown iBlur; // 0x3F0 (8)
	struct Unknown Screen; // 0x3F8 (8)
	float Screen; // 0x400 (4)
	float Mosaic; // 0x404 (4)
	float Alcohol; // 0x408 (4)
	float Drug; // 0x40C (4)
	float Pixel; // 0x410 (4)
	float Blur; // 0x414 (4)
	char ASCII : 0; // 0x418 (1)
	struct Unknown mAscii; // 0x420 (8)
	struct Unknown iAscii; // 0x428 (8)
	char Colorize : 0; // 0x430 (1)
	struct Unknown mColorize; // 0x438 (8)
	struct Unknown iColorize; // 0x440 (8)
	float Colorize; // 0x448 (4)
	char Comic : 0; // 0x44C (1)
	struct Unknown mComic; // 0x450 (8)
	struct Unknown iComic; // 0x458 (8)
	struct Unknown Comic; // 0x460 (16)
	float Comic; // 0x470 (4)
	char Edge : 0; // 0x474 (1)
	struct Unknown mEdgeDetect; // 0x478 (8)
	struct Unknown iEdgeDetect; // 0x480 (8)
	char Emboss : 0; // 0x488 (1)
	struct Unknown mEmboss; // 0x490 (8)
	struct Unknown iEmboss; // 0x498 (8)
	char Glitch : 0; // 0x4A0 (1)
	struct Unknown mGlitch; // 0x4A8 (8)
	struct Unknown iGlitch; // 0x4B0 (8)
	float Glitch; // 0x4B8 (4)
	float Glitch; // 0x4BC (4)
	float Glitch; // 0x4C0 (4)
	char Monitor : 0; // 0x4C4 (1)
	struct Unknown mGrainNLines; // 0x4C8 (8)
	struct Unknown iGrainNLines; // 0x4D0 (8)
	float Monitor; // 0x4D8 (4)
	float Monitor; // 0x4DC (4)
	float Monitor; // 0x4E0 (4)
	char Hard : 0; // 0x4E4 (1)
	struct Unknown mHardEmboss; // 0x4E8 (8)
	struct Unknown iHardEmboss; // 0x4F0 (8)
	char Hue : 0; // 0x4F8 (1)
	struct Unknown mHuePanner; // 0x500 (8)
	struct Unknown iHuePanner; // 0x508 (8)
	float Hue; // 0x510 (4)
	char Monochrome : 0; // 0x514 (1)
	struct Unknown mMonochrome; // 0x518 (8)
	struct Unknown iMonochrome; // 0x520 (8)
	struct Unknown Monochrome; // 0x528 (16)
	char Radial : 0; // 0x538 (1)
	struct Unknown mRadialBlur; // 0x540 (8)
	struct Unknown iRadialBlur; // 0x548 (8)
	float Radial; // 0x550 (4)
	int32_t Radial; // 0x554 (4)
	char Scratches : 0; // 0x558 (1)
	struct Unknown mScratches; // 0x560 (8)
	struct Unknown iScratches; // 0x568 (8)
	char Screen : 0; // 0x570 (1)
	struct Unknown mScreenWaves; // 0x578 (8)
	struct Unknown iScreenWaves; // 0x580 (8)
	float Screen; // 0x588 (4)
	float Screen; // 0x58C (4)
	float Monitor; // 0x590 (4)
	float Monitor; // 0x594 (4)
	float Monitor; // 0x598 (4)
	struct Unknown Distance; // 0x59C (16)
	struct Unknown Distance; // 0x5AC (16)
	float Distance; // 0x5BC (4)
	struct Unknown Scratches; // 0x5C0 (8)
	float Scratches; // 0x5C8 (4)
	struct Unknown Scratches; // 0x5CC (16)
	float Screen; // 0x5DC (4)
	float Screen; // 0x5E0 (4)
	struct Unknown Screen; // 0x5E8 (8)
	float Screen; // 0x5F0 (4)
	float Screen; // 0x5F4 (4)
	float Screen; // 0x5F8 (4)
	struct Unknown Screen; // 0x600 (8)
	float Screen; // 0x608 (4)
	float Screen; // 0x60C (4)
	char Invert : 0; // 0x610 (1)
	struct Unknown mInvert; // 0x618 (8)
	struct Unknown iInvert; // 0x620 (8)
	char Iridescent : 0; // 0x628 (1)
	struct Unknown mIridescent; // 0x630 (8)
	struct Unknown iIridescent; // 0x638 (8)
	float Iridescent; // 0x640 (4)
	char Kuwahara : 0; // 0x644 (1)
	struct Unknown mKuwahara; // 0x648 (8)
	struct Unknown iKuwahara; // 0x650 (8)
	int32_t Kuwahara; // 0x658 (4)
	char Pulse : 0; // 0x65C (1)
	struct Unknown mPulse; // 0x660 (8)
	struct Unknown iPulse; // 0x668 (8)
	float Pulse; // 0x670 (4)
	float Pulse; // 0x674 (4)
	float Pulse; // 0x678 (4)
	float Pulse; // 0x67C (4)
	char Squares : 0; // 0x680 (1)
	struct Unknown mSquares; // 0x688 (8)
	struct Unknown iSquares; // 0x690 (8)
	float Squares; // 0x698 (4)
	float Squares; // 0x69C (4)
	float Squares; // 0x6A0 (4)
	float Squares; // 0x6A4 (4)
	char Tiles : 0; // 0x6A8 (1)
	struct Unknown mTiles; // 0x6B0 (8)
	struct Unknown iTiles; // 0x6B8 (8)
	char Tiles : 0; // 0x6C0 (1)
	float Tiles; // 0x6C4 (4)
	char T : 0; // 0x6C8 (1)
	struct Unknown mTVNoise; // 0x6D0 (8)
	struct Unknown iTVNoise; // 0x6D8 (8)
	float T; // 0x6E0 (4)
	float T; // 0x6E4 (4)
	struct Unknown Native; // 0x6F0 (1472)
	char LOO : 0; // 0xCB0 (1)
	char LOO; // 0xCB1 (1)
	char Circles : 0; // 0xCB2 (1)
	struct Unknown mCircles; // 0xCB8 (8)
	struct Unknown iCircles; // 0xCC0 (8)
	float Circles; // 0xCC8 (4)
	float Circles; // 0xCCC (4)
	char Sonar : 0; // 0xCD0 (1)
	struct Unknown mSonar; // 0xCD8 (8)
	struct Unknown iSonar; // 0xCE0 (8)
	struct Unknown Sonar; // 0xCE8 (16)
	float Sonar; // 0xCF8 (4)
	float Sonar; // 0xCFC (4)
	float Sonar; // 0xD00 (4)
	float Sonar; // 0xD04 (4)
	float Sonar; // 0xD08 (4)
	float Alcohol; // 0xD0C (4)
	char Distance : 0; // 0xD10 (1)
	struct Unknown mDistanceDistortion; // 0xD18 (8)
	struct Unknown iDistanceDistortion; // 0xD20 (8)
	struct Unknown Distance; // 0xD28 (8)
	float Distance; // 0xD30 (4)
	float Distance; // 0xD34 (4)
	float Distance; // 0xD38 (4)
	float Distance; // 0xD3C (4)
	float Distance; // 0xD40 (4)
	float Distance; // 0xD44 (4)
	float Distance; // 0xD48 (4)
	char Drawing : 0; // 0xD4C (1)
	struct Unknown mDrawing; // 0xD50 (8)
	struct Unknown iDrawing; // 0xD58 (8)
	struct Unknown Drawing; // 0xD60 (8)
	char Drawing; // 0xD68 (1)
	float Drawing; // 0xD6C (4)
	float Drawing; // 0xD70 (4)
	struct Unknown Drawing; // 0xD74 (16)
	char Magic : 0; // 0xD84 (1)
	struct Unknown mMagicTransitions; // 0xD88 (8)
	struct Unknown iMagicTransitions; // 0xD90 (8)
	struct Unknown Magic; // 0xD98 (8)
	struct Unknown Magic; // 0xDA0 (8)
	float Magic; // 0xDA8 (4)
	float Magic; // 0xDAC (4)
	float Magic; // 0xDB0 (4)
	struct Unknown Magic; // 0xDB4 (16)
	char Screen : 0; // 0xDC4 (1)
	struct Unknown mScreenDamage; // 0xDC8 (8)
	struct Unknown iScreenDamage; // 0xDD0 (8)
	struct Unknown Screen; // 0xDD8 (8)
	float Screen; // 0xDE0 (4)
	float Screen; // 0xDE4 (4)
	struct Unknown Screen; // 0xDE8 (16)
	float Screen; // 0xDF8 (4)
	float Screen; // 0xDFC (4)
	char Screen : 0; // 0xE00 (1)
	struct Unknown mScreenDecals; // 0xE08 (8)
	struct Unknown iScreenDecals; // 0xE10 (8)
	struct Unknown Screen; // 0xE18 (8)
	float Screen; // 0xE20 (4)
	float Screen; // 0xE24 (4)
	float Screen; // 0xE28 (4)
	float Screen; // 0xE2C (4)
	float Screen; // 0xE30 (4)
	float Screen; // 0xE34 (4)
	struct Unknown Screen; // 0xE38 (8)
	float Screen; // 0xE40 (4)
	float Screen; // 0xE44 (4)
	float Screen; // 0xE48 (4)
	float Screen; // 0xE4C (4)
	float Screen; // 0xE50 (4)
	float Screen; // 0xE54 (4)
	struct Unknown Screen; // 0xE58 (8)
	float Screen; // 0xE60 (4)
	float Screen; // 0xE64 (4)
	float Screen; // 0xE68 (4)
	float Screen; // 0xE6C (4)
	float Screen; // 0xE70 (4)
	float Screen; // 0xE74 (4)
	struct Unknown Screen; // 0xE78 (8)
	float Screen; // 0xE80 (4)
	float Screen; // 0xE84 (4)
	float Screen; // 0xE88 (4)
	float Screen; // 0xE8C (4)
	float Screen; // 0xE90 (4)
	float Screen; // 0xE94 (4)
	char Sharpen : 0; // 0xE98 (1)
	struct Unknown mSharpen; // 0xEA0 (8)
	struct Unknown iSharpen; // 0xEA8 (8)
	float Sharpen; // 0xEB0 (4)
	char Toon : 0; // 0xEB4 (1)
	struct Unknown mToonShading; // 0xEB8 (8)
	struct Unknown iToonShading; // 0xEC0 (8)
	char Toon : 0; // 0xEC8 (1)
	float Toon; // 0xECC (4)
	float Toon; // 0xED0 (4)
	float Toon; // 0xED4 (4)
	float Toon; // 0xED8 (4)
	char Anamorphic : 0; // 0xEDC (1)
	struct Unknown mAnamorphicLensFlares; // 0xEE0 (8)
	struct Unknown iAnamorphicLensFlares; // 0xEE8 (8)
	float Anamorphic; // 0xEF0 (4)
	float Anamorphic; // 0xEF4 (4)
	float Anamorphic; // 0xEF8 (4)
	float Anamorphic; // 0xEFC (4)
	float Anamorphic; // 0xF00 (4)
	float Anamorphic; // 0xF04 (4)
	struct Unknown Anamorphic; // 0xF08 (16)
	char Frost : 0; // 0xF18 (1)
	struct Unknown mFrost; // 0xF20 (8)
	struct Unknown iFrost; // 0xF28 (8)
	struct Unknown Frost; // 0xF30 (8)
	float Frost; // 0xF38 (4)
	float Frost; // 0xF3C (4)
	float Frost; // 0xF40 (4)
	struct Unknown ASCI; // 0xF44 (16)
	char Neon : 0; // 0xF54 (1)
	struct Unknown mNeon; // 0xF58 (8)
	struct Unknown iNeon; // 0xF60 (8)
	struct Unknown Neon; // 0xF68 (16)
	float Neon; // 0xF78 (4)
	float Neon; // 0xF7C (4)
	char Custom : 0; // 0xF80 (1)
	struct Unknown mCustomDepthHighlighter; // 0xF88 (8)
	struct Unknown iCustomDepthHighlighter; // 0xF90 (8)
	struct Unknown Custom; // 0xF98 (16)
	float Custom; // 0xFA8 (4)
	char Custom : 0; // 0xFAC (1)
	struct Unknown mCustomDepthHighlighterClip; // 0xFB0 (8)
	struct Unknown iCustomDepthHighlighterClip; // 0xFB8 (8)
	struct Unknown Custom; // 0xFC0 (16)
	float Custom; // 0xFD0 (4)
	float Edge; // 0xFD4 (4)
	float Scratches; // 0xFD8 (4)
	char Enabled : 0; // 0xFDC (1)
	char Unbound : 0; // 0xFDD (1)
	struct TArray<Unknown> AllMaterials; // 0xFE0 (16)
	float Screen; // 0xFF0 (4)
	struct Unknown Screen; // 0xFF4 (16)
	float Screen; // 0x1004 (4)
	float Screen; // 0x1008 (4)
	float Screen; // 0x100C (4)
	float Screen; // 0x1010 (4)
	char 2 : 0; // 0x1014 (1)
	struct Unknown m2DTransform; // 0x1018 (8)
	struct Unknown i2DTransform; // 0x1020 (8)
	char Kaleidescope : 0; // 0x1028 (1)
	struct Unknown mKaleidescope; // 0x1030 (8)
	struct Unknown iKaleidescope; // 0x1038 (8)
	char Letterboxing : 0; // 0x1040 (1)
	struct Unknown mLetterboxing; // 0x1048 (8)
	struct Unknown iLetterboxing; // 0x1050 (8)
	char Snow : 0; // 0x1058 (1)
	struct Unknown mSnow; // 0x1060 (8)
	struct Unknown iSnow; // 0x1068 (8)
	float 2; // 0x1070 (4)
	float 2; // 0x1074 (4)
	float 2; // 0x1078 (4)
	float 2; // 0x107C (4)
	float 2; // 0x1080 (4)
	float 2; // 0x1084 (4)
	float 2; // 0x1088 (4)
	char 2 : 0; // 0x108C (1)
	float Kaleidescope; // 0x1090 (4)
	float Kaleidescope; // 0x1094 (4)
	float Kaleidescope; // 0x1098 (4)
	struct Unknown Letterboxing; // 0x10A0 (8)
	float Letterboxing; // 0x10A8 (4)
	char Letterboxing : 0; // 0x10AC (1)
	char Letterboxing : 0; // 0x10AD (1)
	float Snow; // 0x10B0 (4)
	float Snow; // 0x10B4 (4)
	float Snow; // 0x10B8 (4)
	float Snow; // 0x10BC (4)
	float Snow; // 0x10C0 (4)
	float Drawing; // 0x10C4 (4)
	float Distance; // 0x10C8 (4)
	float Screen; // 0x10CC (4)
	char World : 0; // 0x10D0 (1)
	struct Unknown mWorldSplash; // 0x10D8 (8)
	struct Unknown iWorldSplash; // 0x10E0 (8)
	float World; // 0x10E8 (4)
	float World; // 0x10EC (4)
	float World; // 0x10F0 (4)
	struct Unknown World; // 0x10F4 (16)
	int32_t Blur; // 0x1104 (4)
	struct Unknown Frost; // 0x1108 (16)
	float Comic; // 0x1118 (4)
	float Comic; // 0x111C (4)
	char World : 0; // 0x1120 (1)
	struct Unknown mWorldGlitch; // 0x1128 (8)
	struct Unknown iWorldGlitch; // 0x1130 (8)
	char World : 0; // 0x1138 (1)
	float World; // 0x113C (4)
	float World; // 0x1140 (4)
	float World; // 0x1144 (4)
	float World; // 0x1148 (4)
	float World; // 0x114C (4)
	struct Unknown World; // 0x1150 (12)
	struct Unknown World; // 0x115C (12)
	char Digitize : 0; // 0x1168 (1)
	struct Unknown mDigitize; // 0x1170 (8)
	struct Unknown iDigitize; // 0x1178 (8)
	struct Unknown Digitize; // 0x1180 (16)
	struct Unknown Digitize; // 0x1190 (12)
	struct Unknown Digitize; // 0x119C (12)
	float Digitize; // 0x11A8 (4)
	float Digitize; // 0x11AC (4)
	float Digitize; // 0x11B0 (4)
	float Digitize; // 0x11B4 (4)
	float Digitize; // 0x11B8 (4)
	float Digitize; // 0x11BC (4)
	char Alarm : 0; // 0x11C0 (1)
	struct Unknown mAlarm; // 0x11C8 (8)
	struct Unknown iAlarm; // 0x11D0 (8)
	struct Unknown Alarm; // 0x11D8 (16)
	float Alarm; // 0x11E8 (4)
	char Sketch : 0; // 0x11EC (1)
	struct Unknown mSketch; // 0x11F0 (8)
	struct Unknown iSketch; // 0x11F8 (8)
	struct Unknown Sketch; // 0x1200 (16)
	struct Unknown Sketch; // 0x1210 (16)
	float Sketch; // 0x1220 (4)
	float Sketch; // 0x1224 (4)
	float Sketch; // 0x1228 (4)
	struct Unknown Custom; // 0x122C (16)
	float Custom; // 0x123C (4)
	struct Unknown Custom; // 0x1240 (16)
	float Custom; // 0x1250 (4)
	char Wired : 0; // 0x1254 (1)
	struct Unknown iWired; // 0x1258 (8)
	struct Unknown mWired; // 0x1260 (8)
	struct Unknown Wired; // 0x1268 (16)
	float Wired; // 0x1278 (4)
	struct Unknown Mosaic; // 0x1280 (56)
	struct Unknown Drug; // 0x12B8 (56)
	struct Unknown Alcohol; // 0x12F0 (56)
	struct Unknown Pixel; // 0x1328 (56)
	struct Unknown Channel; // 0x1360 (56)
	struct Unknown Channel; // 0x1398 (56)
	struct Unknown Bleach; // 0x13D0 (56)
	struct Unknown Blur; // 0x1408 (56)
	float ASCI; // 0x1440 (4)
	struct Unknown ASCI; // 0x1448 (56)
	struct Unknown Colorize; // 0x1480 (56)
	struct Unknown Edge; // 0x14B8 (56)
	struct Unknown Emboss; // 0x14F0 (56)
	struct Unknown Hard; // 0x1528 (56)
	float Glitch; // 0x1560 (4)
	float Glitch; // 0x1564 (4)
	float Glitch; // 0x1568 (4)
	struct Unknown Glitch; // 0x1570 (56)
	char Monitor : 0; // 0x15A8 (1)
	struct Unknown Monitor; // 0x15B0 (56)
	struct Unknown Hue; // 0x15E8 (56)
	struct Unknown Monochrome; // 0x1620 (56)
	struct Unknown Radial; // 0x1658 (8)
	struct Unknown Radial; // 0x1660 (8)
	struct Unknown Radial; // 0x1668 (56)
	struct Unknown Scratches; // 0x16A0 (56)
	struct Unknown Screen; // 0x16D8 (56)
	struct Unknown Distance; // 0x1710 (56)
	struct Unknown Screen; // 0x1748 (56)
	struct Unknown Invert; // 0x1780 (56)
	struct Unknown Iridescent; // 0x17B8 (56)
	struct Unknown Kuwahara; // 0x17F0 (56)
	struct Unknown Pulse; // 0x1828 (56)
	struct Unknown Squares; // 0x1860 (56)
	struct Unknown Tiles; // 0x1898 (56)
	struct Unknown T; // 0x18D0 (56)
	struct Unknown Circles; // 0x1908 (56)
	struct Unknown Sonar; // 0x1940 (56)
	struct Unknown Distance; // 0x1978 (56)
	struct Unknown Drawing; // 0x19B0 (56)
	struct Unknown Magic; // 0x19E8 (56)
	struct Unknown Screen; // 0x1A20 (56)
	struct Unknown Screen; // 0x1A58 (56)
	struct Unknown Sharpen; // 0x1A90 (56)
	struct Unknown Toon; // 0x1AC8 (56)
	struct Unknown Anamorphic; // 0x1B00 (56)
	struct Unknown Frost; // 0x1B38 (56)
	struct Unknown Neon; // 0x1B70 (56)
	struct Unknown Custom; // 0x1BA8 (48)
	struct Unknown Custom; // 0x1BD8 (48)
	struct Unknown 2; // 0x1C08 (16)
	struct Unknown 2; // 0x1C18 (56)
	struct Unknown Kaleidescope; // 0x1C50 (56)
	struct Unknown Letterboxing; // 0x1C88 (56)
	struct Unknown Snow; // 0x1CC0 (56)
	struct Unknown World; // 0x1CF8 (56)
	struct Unknown World; // 0x1D30 (56)
	struct Unknown Digitize; // 0x1D68 (56)
	struct Unknown Alarm; // 0x1DA0 (56)
	struct Unknown Sketch; // 0x1DD8 (56)
	struct Unknown Wired; // 0x1E10 (56)
	float Comic; // 0x1E48 (4)
	int32_t Comic; // 0x1E4C (4)
	float Comic; // 0x1E50 (4)
	struct Unknown Comic; // 0x1E58 (56)
	char Actor : 0; // 0x1E90 (1)
	struct Unknown mActorFeaturette; // 0x1E98 (8)
	struct Unknown iActorFeaturette; // 0x1EA0 (8)
	struct Unknown Actor; // 0x1EA8 (16)
	float Actor; // 0x1EB8 (4)
	struct Unknown Actor; // 0x1EBC (16)
	float Actor; // 0x1ECC (4)
	float Actor; // 0x1ED0 (4)
	int32_t Actor; // 0x1ED4 (4)
	int32_t Actor; // 0x1ED8 (4)
	struct Unknown Actor; // 0x1EE0 (48)
	char Infected : 0; // 0x1F10 (1)
	struct Unknown mInfected; // 0x1F18 (8)
	struct Unknown iInfected; // 0x1F20 (8)
	float Infected; // 0x1F28 (4)
	float Infected; // 0x1F2C (4)
	float Infected; // 0x1F30 (4)
	float Infected; // 0x1F34 (4)
	struct Unknown Infected; // 0x1F38 (56)
	char Colored : 0; // 0x1F70 (1)
	struct Unknown mColoredAO; // 0x1F78 (8)
	struct Unknown iColoredAO; // 0x1F80 (8)
	struct Unknown Colored; // 0x1F88 (16)
	float Colored; // 0x1F98 (4)
	struct Unknown Colored; // 0x1FA0 (56)
	char Camera : 0; // 0x1FD8 (1)
	struct Unknown mCameraShake; // 0x1FE0 (8)
	struct Unknown iCameraShake; // 0x1FE8 (8)
	float Camera; // 0x1FF0 (4)
	float Camera; // 0x1FF4 (4)
	float Camera; // 0x1FF8 (4)
	struct Unknown Camera; // 0x2000 (56)
	char Disco : 0; // 0x2038 (1)
	struct Unknown mDiscoBall; // 0x2040 (8)
	struct Unknown iDiscoBall; // 0x2048 (8)
	struct Unknown Disco; // 0x2050 (12)
	struct Unknown Disco; // 0x205C (16)
	struct Unknown Disco; // 0x206C (16)
	struct Unknown Disco; // 0x207C (12)
	float Disco; // 0x2088 (4)
	float Disco; // 0x208C (4)
	float Disco; // 0x2090 (4)
	struct Unknown Disco; // 0x2098 (56)
	char Hazy : 0; // 0x20D0 (1)
	struct Unknown mHazyLights; // 0x20D8 (8)
	struct Unknown iHazyLights; // 0x20E0 (8)
	struct Unknown Hazy; // 0x20E8 (8)
	struct Unknown Hazy; // 0x20F0 (8)
	struct Unknown Hazy; // 0x20F8 (56)
	char Melted : 0; // 0x2130 (1)
	struct Unknown mMeltedWorld; // 0x2138 (8)
	struct Unknown iMeltedWorld; // 0x2140 (8)
	struct Unknown Melted; // 0x2148 (12)
	float Melted; // 0x2154 (4)
	float Melted; // 0x2158 (4)
	float Melted; // 0x215C (4)
	struct Unknown Melted; // 0x2160 (56)
	char Selective : 0; // 0x2198 (1)
	struct Unknown mSelectiveColor; // 0x21A0 (8)
	struct Unknown iSelectiveColor; // 0x21A8 (8)
	struct Unknown Selective; // 0x21B0 (16)
	float Selective; // 0x21C0 (4)
	float Selective; // 0x21C4 (4)
	float Selective; // 0x21C8 (4)
	struct Unknown Selective; // 0x21D0 (56)
	char Screen : 0; // 0x2208 (1)
	struct Unknown mScreenFire; // 0x2210 (8)
	struct Unknown iScreenFire; // 0x2218 (8)
	struct Unknown Screen; // 0x2220 (16)
	float Screen; // 0x2230 (4)
	float Screen; // 0x2234 (4)
	float Screen; // 0x2238 (4)
	float Screen; // 0x223C (4)
	float Screen; // 0x2240 (4)
	struct Unknown Screen; // 0x2248 (56)
	char Haunted : 0; // 0x2280 (1)
	struct Unknown mHaunted; // 0x2288 (8)
	struct Unknown iHaunted; // 0x2290 (8)
	float Haunted; // 0x2298 (4)
	float Haunted; // 0x229C (4)
	struct Unknown Haunted; // 0x22A0 (8)
	float Haunted; // 0x22A8 (4)
	struct Unknown Haunted; // 0x22B0 (56)
	char Grid : 0; // 0x22E8 (1)
	struct Unknown mGridCell; // 0x22F0 (8)
	struct Unknown iGridCell; // 0x22F8 (8)
	char Grid : 0; // 0x2300 (1)
	float Grid; // 0x2304 (4)
	struct Unknown Grid; // 0x2308 (16)
	struct Unknown Grid; // 0x2318 (16)
	float Grid; // 0x2328 (4)
	float Grid; // 0x232C (4)
	char Lens : 0; // 0x2330 (1)
	struct Unknown mLensDistortion; // 0x2338 (8)
	struct Unknown iLensDistortion; // 0x2340 (8)
	float Lens; // 0x2348 (4)
	float Lens; // 0x234C (4)
	float Lens; // 0x2350 (4)
	float Lens; // 0x2354 (4)
	struct Unknown Lens; // 0x2358 (8)
	float Lens; // 0x2360 (4)
	float Lens; // 0x2364 (4)
	struct Unknown Lens; // 0x2368 (56)
	struct Unknown Grid; // 0x23A0 (56)
	char Zone : 0; // 0x23D8 (1)
	struct Unknown mZone; // 0x23E0 (8)
	struct Unknown iZone; // 0x23E8 (8)
	struct Unknown Zone; // 0x23F0 (16)
	float Zone; // 0x2400 (4)
	float Zone; // 0x2404 (4)
	struct Unknown Zone; // 0x2408 (16)
	struct Unknown Zone; // 0x2418 (16)
	struct Unknown Zone; // 0x2428 (56)
	char Pyramid : 0; // 0x2460 (1)
	struct Unknown mPyramid; // 0x2468 (8)
	struct Unknown iPyramid; // 0x2470 (8)
	char Pyramid : 0; // 0x2478 (1)
	struct Unknown Pyramid; // 0x247C (16)
	float Pyramid; // 0x248C (4)
	float Pyramid; // 0x2490 (4)
	float Pyramid; // 0x2494 (4)
	struct Unknown Pyramid; // 0x2498 (56)
	char Mojo : 0; // 0x24D0 (1)
	struct Unknown mMojo; // 0x24D8 (8)
	struct Unknown iMojo; // 0x24E0 (8)
	char Mojo : 0; // 0x24E8 (1)
	float Mojo; // 0x24EC (4)
	struct Unknown Mojo; // 0x24F0 (8)
	struct Unknown Mojo; // 0x24F8 (8)
	float Mojo; // 0x2500 (4)
	struct Unknown Mojo; // 0x2504 (16)
	float Mojo; // 0x2514 (4)
	float Mojo; // 0x2518 (4)
	float Mojo; // 0x251C (4)
	struct Unknown Mojo; // 0x2520 (56)

	void Create(struct Unknown Material, struct Unknown& Instance); // Function Chameleon.Chameleon_C.Create(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Mojo(char IsEnabled); // Function Chameleon.Chameleon_C.Mojo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Pyramid(char IsEnabled); // Function Chameleon.Chameleon_C.Pyramid(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Zone(char IsEnabled); // Function Chameleon.Chameleon_C.Zone(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Lens(char IsEnabled); // Function Chameleon.Chameleon_C.Lens(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
