// WidgetBlueprintGeneratedClass Chat_Tab.Chat_Tab_C
struct UChat_Tab_C : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Button; //  0x250 Size(8)
	struct Unknown Button; //  0x258 Size(8)
	struct FText Button; //  0x260 Size(18)
	struct Unknown Active; //  0x278 Size(10)
	struct Unknown Inactive; //  0x288 Size(10)
	char Tab; //  0x298 Size(1)
	struct Unknown Current; //  0x29c Size(10)
	struct Unknown Parent; //  0x2b0 Size(8)
	struct Unknown Chat; //  0x2b8 Size(8)
	struct Unknown Notification; //  0x2c0 Size(10)
	float Interp; //  0x2d0 Size(4)
	float Notification; //  0x2d4 Size(4)
	float Notification; //  0x2d8 Size(4)
	char Fading; //  0x2dc Size(1)

	struct Unknown OnFocusReceived(struct Unknown MyGeometry, struct Unknown InFocusEvent); // Function Chat_Tab.Chat_Tab_C.OnFocusReceived(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

