// BlueprintGeneratedClass Chat_System.Chat_System_C
struct AChat_System_C : UActor {
	Unknown UberGraphFrame; //  0x310 Size(8)
	Unknown DefaultSceneRoot; //  0x318 Size(8)
	Unknown Muted; //  0x320 Size(10)
	char Two; //  0x330 Size(1)
	struct FString Player; //  0x338 Size(10)
	Unknown Players; //  0x348 Size(10)
	Unknown Game; //  0x358 Size(8)
	Unknown Joined; //  0x360 Size(10)
	Unknown Banned; //  0x370 Size(10)
	Unknown Owned; //  0x380 Size(10)
	Unknown Chat; //  0x390 Size(8)
	Unknown HU; //  0x398 Size(8)

	void Get(struct FString& Group); // Function Chat_System.Chat_System_C.Get(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

