// WidgetBlueprintGeneratedClass Chat.Chat_MainWidget_C
struct UChat_MainWidget_C : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Chat; //  0x250 Size(8)
	struct Unknown Chat; //  0x258 Size(8)
	struct Unknown Tab; //  0x260 Size(8)
	struct Unknown Whole; //  0x268 Size(8)
	struct Unknown Chat; //  0x270 Size(8)
	struct Unknown CurrentDialogBox; //  0x278 Size(8)
	float Chat; //  0x280 Size(4)
	char Faded; //  0x284 Size(1)
	char Was; //  0x285 Size(1)
	char Use; //  0x286 Size(1)
	int32_t Message; //  0x288 Size(4)
	struct FString Text; //  0x290 Size(10)
	struct FString Text; //  0x2a0 Size(10)
	int32_t ; //  0x2b0 Size(4)
	int32_t Clear; //  0x2b4 Size(4)
	char Show; //  0x2b8 Size(1)

	struct FText Get(); // Function Chat_MainWidget.Chat_MainWidget_C.Get(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

