// Enum CoherentUIGTPlugin.ECoherentUIGTKeys
enum class ECoherentUIGTKeys : uint8_t {
	LeftMouseButton = 0,
	RightMouseButton = 1,
	MiddleMouseButton = 2,
	ThumbMouseButton = 3,
	ThumbMouseButton2 = 4,
	BackSpace = 5,
	Tab = 6,
	Enter = 7,
	Pause = 8,
	CapsLock = 9,
	Escape = 10,
	SpaceBar = 11,
	PageUp = 12,
	PageDown = 13,
	End = 14,
	Home = 15,
	Left = 16,
	Up = 17,
	Right = 18,
	Down = 19,
	Insert = 20,
	Delete = 21,
	Zero = 22,
	One = 23,
	Two = 24,
	Three = 25,
	Four = 26,
	Five = 27,
	Six = 28,
	Seven = 29,
	Eight = 30,
	Nine = 31,
	A = 32,
	B = 33,
	C = 34,
	D = 35,
	E = 36,
	F = 37,
	G = 38,
	H = 39,
	I = 40,
	J = 41,
	K = 42,
	L = 43,
	M = 44,
	N = 45,
	O = 46,
	P = 47,
	Q = 48,
	R = 49,
	S = 50,
	T = 51,
	U = 52,
	V = 53,
	W = 54,
	X = 55,
	Y = 56,
	Z = 57,
	NumPadZero = 58,
	NumPadOne = 59,
	NumPadTwo = 60,
	NumPadThree = 61,
	NumPadFour = 62,
	NumPadFive = 63,
	NumPadSix = 64,
	NumPadSeven = 65,
	NumPadEight = 66,
	NumPadNine = 67,
	Multiply = 68,
	Add = 69,
	Subtract = 70,
	Decimal = 71,
	Divide = 72,
	F1 = 73,
	F2 = 74,
	F3 = 75,
	F4 = 76,
	F5 = 77,
	F6 = 78,
	F7 = 79,
	F8 = 80,
	F9 = 81,
	F10 = 82,
	F11 = 83,
	F12 = 84,
	NumLock = 85,
	ScrollLock = 86,
	LeftShift = 87,
	RightShift = 88,
	LeftControl = 89,
	RightControl = 90,
	LeftAlt = 91,
	RightAlt = 92,
	LeftCommand = 93,
	RightCommand = 94,
	Semicolon = 95,
	Equals = 96,
	Comma = 97,
	Underscore = 98,
	Period = 99,
	Slash = 100,
	Tilde = 101,
	LeftBracket = 102,
	Backslash = 103,
	RightBracket = 104,
	Quote = 105,
	Unknown = 106,
	ECoherentUIGTKeys_MAX = 107,
};

// Enum CoherentUIGTPlugin.ECoherentUIGTInputPropagationBehaviour
enum class ECoherentUIGTInputPropagationBehaviour : uint8_t {
	None = 0,
	Keyboard = 1,
	Joystick = 2,
	KeyboardAndJoystick = 3,
	ECoherentUIGTInputPropagationBehaviour_MAX = 4,
};

// Enum CoherentUIGTPlugin.ECoh_MouseButton
enum class ECoh_MouseButton : uint8_t {
	ButtonNone = 0,
	ButtonLeft = 1,
	ButtonMiddle = 2,
	ButtonRight = 3,
	ECoh_MAX = 4,
};

// Enum CoherentUIGTPlugin.ECoh_EventType
enum class ECoh_EventType : uint8_t {
	MouseMove = 0,
	MouseDown = 1,
	MouseUp = 2,
	MouseWheel = 3,
	ECoh_MAX = 4,
};

// Enum CoherentUIGTPlugin.ECoherentUIGTMSAA
enum class ECoherentUIGTMSAA : uint8_t {
	MSAA_1x = 0,
	MSAA_2x = 1,
	MSAA_4x = 2,
	MSAA_MAX = 3,
};

// Enum CoherentUIGTPlugin.ECoherentUIGTSettingsSeverity
enum class ECoherentUIGTSettingsSeverity : uint8_t {
	Trace = 0,
	Debug = 1,
	Info = 2,
	Warning = 3,
	AssertFailure = 4,
	Error = 5,
	ECoherentUIGTSettingsSeverity_MAX = 6,
};

// Enum CoherentUIGTPlugin.EGamepadBehaviourOnFocusLost
enum class EGamepadBehaviourOnFocusLost : uint8_t {
	ResetState = 0,
	UseCurrentState = 1,
	UseStateBeforeReset = 2,
	EGamepadBehaviourOnFocusLost_MAX = 3,
};

// Enum CoherentUIGTPlugin.EGTInputWidgetLineTraceMode
enum class EGTInputWidgetLineTraceMode : uint8_t {
	GTInputLineTrace_Single = 0,
	GTInputLineTrace_Multi = 1,
	GTInputLineTrace_MAX = 2,
};

// Enum CoherentUIGTPlugin.EGTInputWidgetRaycastQuality
enum class EGTInputWidgetRaycastQuality : uint8_t {
	RaycastQuality_Fast = 0,
	RaycastQuality_Balanced = 1,
	RaycastQuality_Accurate = 2,
	RaycastQuality_MAX = 3,
};

// Class CoherentUIGTPlugin.CoherentUIGTAudioWrapper
class UCoherentUIGTAudioWrapper : public Object {

public:

	struct Unknown Owner; // 0x28 (8)
	struct TMap<Unknown, Unknown> Sounds; // 0x30 (80)
};

// Class CoherentUIGTPlugin.CoherentUIGTBaseComponent
class UCoherentUIGTBaseComponent : public UActorComponent {

public:

	struct FMulticastInlineDelegate ReadyForBindings; // 0xB0 (16)
	struct FMulticastInlineDelegate BindingsReleased; // 0xC0 (16)
	struct FMulticastInlineDelegate FinishLoad; // 0xD0 (16)
	struct FMulticastInlineDelegate FailLoad; // 0xE0 (16)
	struct FMulticastInlineDelegate StartLoading; // 0xF0 (16)
	struct FMulticastInlineDelegate NavigateTo; // 0x100 (16)
	struct FMulticastInlineDelegate JavaScriptEvent; // 0x110 (16)
	struct FMulticastInlineDelegate UIGTScriptingReady; // 0x120 (16)
	struct FDelegate LiveViewSizeRequested; // 0x130 (16)
	struct Unknown Texture; // 0x158 (8)
	char Filter; // 0x160 (1)
	char bReceiveInput : 0; // 0x161 (1)
	char bReceiveInputWhenTransparent : 0; // 0x162 (1)
	char AllowPerformanceWarnings : 0; // 0x163 (1)
	float ExecuteJSTimersThresholdMs; // 0x164 (4)
	float UpdateStylesAndLayoutThresholdMs; // 0x168 (4)
	float RecordRenderingCommandsThresholdMs; // 0x16C (4)
	float PaintWarningThresholdMs; // 0x170 (4)
	int32_t LayersCountThreshold; // 0x174 (4)
	int32_t LayerWidthThreshold; // 0x178 (4)
	int32_t LayerHeightThreshold; // 0x17C (4)
	char bEnableAdditionalDefaultStyles : 0; // 0x180 (1)
	char bDelayedUpdate : 0; // 0x181 (1)
	struct Unknown AudioWrapper; // 0x1F8 (8)

	void UpdateWholeDataModelFromStruct(struct TFieldPath<FUnknown> Arg); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.UpdateWholeDataModelFromStruct(Final|Native|Public|BlueprintCallable|Const) // <Game_BE.exe+0x1116250>
	void UpdateWholeDataModelFromObject(struct Unknown Model); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.UpdateWholeDataModelFromObject(Final|Native|Public|BlueprintCallable|Const) // <Game_BE.exe+0x11195C0>
	void TriggerJSEvent(struct FString Name, struct Unknown eventData); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.TriggerJSEvent(Final|Native|Public|BlueprintCallable|Const) // <Game_BE.exe+0x11192C0>
	void SynchronizeModels(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.SynchronizeModels(Final|Native|Public|BlueprintCallable|Const) // <Game_BE.exe+0x1119280>
	void ShowPaintRects(char Show); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.ShowPaintRects(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x11191F0>
	void SetOffscreenCanvasRendering(char State); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.SetOffscreenCanvasRendering(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x1118ED0>
	void SetClickThroughAlphaThreshold(float threshold); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.SetClickThroughAlphaThreshold(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x1118C40>
	void Resize(int32_t Width, int32_t Height); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.Resize(Native|Public|BlueprintCallable) // <Game_BE.exe+0x1118B80>
	void Reload(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.Reload(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x1118B60>
	void Redraw(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.Redraw(Final|Native|Public|BlueprintCallable|Const) // <Game_BE.exe+0x1118B40>
	void Load(struct FString Path); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.Load(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x1118AA0>
	char IsTransparent(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.IsTransparent(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x1118A70>
	char IsReadyToCreateView(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.IsReadyToCreateView(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x1118A40>
	char IsReadyForBindings(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.IsReadyForBindings(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x1118A10>
	char IsDocumentReady(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.IsDocumentReady(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x11189B0>
	char HasRequestedView(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.HasRequestedView(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x11187D0>
	float GetClickThroughAlphaThreshold(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.GetClickThroughAlphaThreshold(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x1118770>
	void EndDebugFrameSave(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.EndDebugFrameSave(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x1118750>
	void EnableDelayedUpdate(char bEnabled); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.EnableDelayedUpdate(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x11186C0>
	void DebugSaveNextFrame(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.DebugSaveNextFrame(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x11186A0>
	struct Unknown CreateJSEvent(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.CreateJSEvent(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x11185F0>
	void CreateDataModelFromStruct(struct FString Name, struct TFieldPath<FUnknown> Arg); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.CreateDataModelFromStruct(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x1115FE0>
	void CreateDataModelFromObject(struct FString Name, struct Unknown Model); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.CreateDataModelFromObject(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x1118510>
	void BeginDebugFrameSave(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.BeginDebugFrameSave(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x11184F0>
};

// Class CoherentUIGTPlugin.CoherentUIGTComponent
class UCoherentUIGTComponent : public UCoherentUIGTBaseComponent {

public:

	struct FString URL; // 0x230 (16)
	int32_t Width; // 0x240 (4)
	int32_t Height; // 0x244 (4)
	char ManualTexture : 0; // 0x248 (1)
	float ClickThroughAlphaThreshold; // 0x24C (4)
	char Transparent : 0; // 0x250 (1)
};

// Class CoherentUIGTPlugin.CoherentUIGTGameHUD
class ACoherentUIGTGameHUD : public AHUD {

public:

	struct Unknown CoherentUIGTHUD; // 0x408 (8)

	void SetupUIGTView(struct FString PageUrl, char bIsTransparent, float ClickThroughAlphaThreshold, float AnimationFrameDefer, char bDelayedUpdate); // Function CoherentUIGTPlugin.CoherentUIGTGameHUD.SetupUIGTView(Final|RequiredAPI|Native|Public|BlueprintCallable) // <Game_BE.exe+0x1119040>
	char HasSetupUIGTView(); // Function CoherentUIGTPlugin.CoherentUIGTGameHUD.HasSetupUIGTView(Final|RequiredAPI|Native|Public|BlueprintCallable) // <Game_BE.exe+0x1118800>
};

// Class CoherentUIGTPlugin.CoherentUIGTHUD
class UCoherentUIGTHUD : public UCoherentUIGTBaseComponent {

public:

	struct Unknown HUDMaterialName; // 0x230 (24)
	struct Unknown HUDMaterial; // 0x248 (8)
	struct Unknown HUDMaterialInstance; // 0x250 (8)
};

// Class CoherentUIGTPlugin.CoherentUIGTInputActor
class ACoherentUIGTInputActor : public UActor {

public:

	struct FMulticastInlineDelegate OnCoherentUIGTInputActorMouseButtonDown; // 0x318 (16)
	struct FMulticastInlineDelegate OnCoherentUIGTInputActorMouseButtonUp; // 0x328 (16)
	struct FMulticastInlineDelegate OnCoherentUIGTInputActorKeyDown; // 0x338 (16)
	struct FMulticastInlineDelegate OnCoherentUIGTInputActorKeyUp; // 0x348 (16)

	void ToggleCoherentUIGTInputFocus(); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.ToggleCoherentUIGTInputFocus(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x11192A0>
	void SetLineTraceMode(char Mode); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.SetLineTraceMode(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x1118E50>
	void SetInputPropagationBehaviour(char Propagation); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.SetInputPropagationBehaviour(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x1118DD0>
	void SetCoherentUIGTViewFocus(struct Unknown NewFocusedView); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.SetCoherentUIGTViewFocus(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x1118D50>
	void SetCoherentUIGTInputFocus(char FocusUI); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.SetCoherentUIGTInputFocus(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x1118CC0>
	char IsJoystickInputWhileUIGTIsFocusedAllowed_DEPRECATED(); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.IsJoystickInputWhileUIGTIsFocusedAllowed_DEPRECATED(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x11189E0>
	char IsCoherentUIGTFocused(); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.IsCoherentUIGTFocused(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x1118980>
	void Initialize(char CollisionChannel, char AddressMode, char RaycastQuality, int32_t UVChannel); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.Initialize(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x1118830>
	char GetInputPropagationBehaviour(); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.GetInputPropagationBehaviour(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x11187A0>
	void AlwaysAcceptMouseInput(char bAccept); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.AlwaysAcceptMouseInput(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x1118460>
	void AllowJoystickInputWhileUIGTIsFocused_DEPRECATED(char bAllow); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.AllowJoystickInputWhileUIGTIsFocused_DEPRECATED(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x11183D0>
};

// Class CoherentUIGTPlugin.CoherentUIGTJSEvent
class UCoherentUIGTJSEvent : public Object {

public:

	struct TArray<Unknown> StructTypes; // 0xA8 (16)

	void AddText(struct FText& Text); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddText(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x111C070>
	void AddStructArg(struct TFieldPath<FUnknown> Arg); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddStructArg(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x1115F30>
	void AddString(struct FString Str); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddString(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111BFD0>
	void AddObject(struct Unknown Object); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddObject(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111BF50>
	void AddName(struct FName& Name); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddName(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x111BEC0>
	void AddInt32(int32_t integer); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddInt32(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111BE40>
	void AddFloat(float fl); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddFloat(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111BDC0>
	void AddByte(enum class None Byte); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddByte(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111BD40>
	void AddBool(char B); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddBool(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111BCB0>
	void AddArray(struct TArray<Unknown>& Array); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddArray(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x1115B80>
};

// Class CoherentUIGTPlugin.CoherentUIGTJSPayload
class UCoherentUIGTJSPayload : public Object {

public:

	struct FString EventName; // 0x28 (16)

	void ReadObject(int32_t Index, struct Unknown Object); // Function CoherentUIGTPlugin.CoherentUIGTJSPayload.ReadObject(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111C9C0>
	struct FString GetString(int32_t Index); // Function CoherentUIGTPlugin.CoherentUIGTJSPayload.GetString(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111C5C0>
	float GetNumber(int32_t Index); // Function CoherentUIGTPlugin.CoherentUIGTJSPayload.GetNumber(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111C500>
	int32_t GetInt32(int32_t Index); // Function CoherentUIGTPlugin.CoherentUIGTJSPayload.GetInt32(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111C470>
	char GetBool(int32_t Index); // Function CoherentUIGTPlugin.CoherentUIGTJSPayload.GetBool(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111C310>
};

// Class CoherentUIGTPlugin.CoherentUIGTLiveView
class UCoherentUIGTLiveView : public UActorComponent {

public:

	struct FString LinkName; // 0xB0 (16)
	struct Unknown Texture; // 0xC0 (8)

	void OnLiveViewSizeRequest(struct Unknown baseComponent, struct FString Name, int32_t& Width, int32_t& Height); // Function CoherentUIGTPlugin.CoherentUIGTLiveView.OnLiveViewSizeRequest(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x111C830>
};

// Class CoherentUIGTPlugin.CoherentUIGTSettings
class UCoherentUIGTSettings : public Object {

public:

	char EnableLiveReload : 0; // 0x28 (1)
	int32_t InspectorPort; // 0x2C (4)
	int32_t WebdriverPort; // 0x30 (4)
	char EnableWebSecurity : 0; // 0x34 (1)
	char EnableLocalization : 0; // 0x35 (1)
	char RunAsynchronous : 0; // 0x36 (1)
	char AllowPerformanceWarningsInEditor : 0; // 0x37 (1)
	char ShowWarningsOnScreen : 0; // 0x38 (1)
	enum class Unknow LogSeverity; // 0x39 (1)
	char bPaintToBackBuffer : 0; // 0x3A (1)
	char bRespectTitleSafeZone : 0; // 0x3B (1)
	char bRespectLetterboxing : 0; // 0x3C (1)
	struct FString HUDMaterialName; // 0x40 (16)
	struct FString CoUIResourcesRoot; // 0x50 (16)
	char TickWhileGameIsPaused : 0; // 0x60 (1)
	char bUseLowerCaseNamesForAutoExposedProperties : 0; // 0x61 (1)
	enum class Unknow MSAA; // 0x62 (1)
	struct FString CookiesResource; // 0x68 (16)
	struct FString LocalStorageFolder; // 0x78 (16)
	char UseCacheFile : 0; // 0x88 (1)
	char UseReceivedFromServerUrl : 0; // 0x89 (1)
};

// Class CoherentUIGTPlugin.CoherentUIGTWidget
class UCoherentUIGTWidget : public UWidget {

public:

	struct Unknown Owner; // 0x120 (8)
	struct FMulticastInlineDelegate ReadyForBindings; // 0x128 (16)
	struct FMulticastInlineDelegate BindingsReleased; // 0x138 (16)
	struct FMulticastInlineDelegate FinishLoad; // 0x148 (16)
	struct FMulticastInlineDelegate FailLoad; // 0x158 (16)
	struct FMulticastInlineDelegate StartLoading; // 0x168 (16)
	struct FMulticastInlineDelegate NavigateTo; // 0x178 (16)
	struct FMulticastInlineDelegate JavaScriptEvent; // 0x188 (16)
	struct FMulticastInlineDelegate UIGTScriptingReady; // 0x198 (16)
	struct FMulticastInlineDelegate AkAudioEvent; // 0x1C0 (16)
	struct FMulticastInlineDelegate KeyUpDelegate; // 0x1D0 (16)
	struct FMulticastInlineDelegate KeyDownDelegate; // 0x1E0 (16)
	struct FMulticastInlineDelegate MouseEventDelegate; // 0x1F0 (16)
	char Filter; // 0x200 (1)
	char bReceiveInput : 0; // 0x201 (1)
	char InputPropagationBehaviour; // 0x202 (1)
	char bReceiveInputWhenTransparent : 0; // 0x203 (1)
	char bGammaCorrectedMaterial : 0; // 0x204 (1)
	float TickPeriodInMinimizedGame; // 0x208 (4)
	char AllowPerformanceWarnings : 0; // 0x20C (1)
	float ExecuteJSTimersThresholdMs; // 0x210 (4)
	float UpdateStylesAndLayoutThresholdMs; // 0x214 (4)
	float RecordRenderingCommandsThresholdMs; // 0x218 (4)
	float PaintWarningThresholdMs; // 0x21C (4)
	int32_t LayersCountThreshold; // 0x220 (4)
	int32_t LayerWidthThreshold; // 0x224 (4)
	int32_t LayerHeightThreshold; // 0x228 (4)
	char bEnableAdditionalDefaultStyles : 0; // 0x22C (1)
	struct Unknown AudioWrapper; // 0x2C0 (8)
	struct FString URL; // 0x348 (16)
	float ClickThroughAlphaThreshold; // 0x358 (4)
	char OffscreenCanvasRendering : 0; // 0x35C (1)
	char Transparent : 0; // 0x35D (1)

	void UpdateWholeDataModelFromStruct(struct TFieldPath<FUnknown> Arg); // Function CoherentUIGTPlugin.CoherentUIGTWidget.UpdateWholeDataModelFromStruct(Final|Native|Public|BlueprintCallable|Const) // <Game_BE.exe+0x1116320>
	void UpdateWholeDataModelFromObject(struct Unknown Model); // Function CoherentUIGTPlugin.CoherentUIGTWidget.UpdateWholeDataModelFromObject(Final|Native|Public|BlueprintCallable|Const) // <Game_BE.exe+0x111D130>
	void TriggerJSEvent(struct FString Name, struct Unknown eventData); // Function CoherentUIGTPlugin.CoherentUIGTWidget.TriggerJSEvent(Final|Native|Public|BlueprintCallable|Const) // <Game_BE.exe+0x111D050>
	void SynchronizeModels(); // Function CoherentUIGTPlugin.CoherentUIGTWidget.SynchronizeModels(Final|Native|Public|BlueprintCallable|Const) // <Game_BE.exe+0x111D030>
	void ShowPaintRects(char Show); // Function CoherentUIGTPlugin.CoherentUIGTWidget.ShowPaintRects(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111CFA0>
	void SetSkipHittestInputGroupEmpty(char bState); // Function CoherentUIGTPlugin.CoherentUIGTWidget.SetSkipHittestInputGroupEmpty(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111CF10>
	void SetRender(char bState); // Function CoherentUIGTPlugin.CoherentUIGTWidget.SetRender(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111CE80>
	void SetRefreshTime(float Time); // Function CoherentUIGTPlugin.CoherentUIGTWidget.SetRefreshTime(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111CE00>
	void SetReceiveInput(char Input); // Function CoherentUIGTPlugin.CoherentUIGTWidget.SetReceiveInput(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111CD70>
	void SetPreviewKeyEventInherit(char bState); // Function CoherentUIGTPlugin.CoherentUIGTWidget.SetPreviewKeyEventInherit(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111CCE0>
	void SetOffscreenCanvasRendering(char State); // Function CoherentUIGTPlugin.CoherentUIGTWidget.SetOffscreenCanvasRendering(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111CC50>
	void SetInputPropagationBehaviour(char Propagation); // Function CoherentUIGTPlugin.CoherentUIGTWidget.SetInputPropagationBehaviour(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111CBD0>
	void SetHideCursorDuringCapture(char bState); // Function CoherentUIGTPlugin.CoherentUIGTWidget.SetHideCursorDuringCapture(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111CB40>
	void SetClickThroughAlphaThreshold(float threshold); // Function CoherentUIGTPlugin.CoherentUIGTWidget.SetClickThroughAlphaThreshold(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111CAC0>
	void Reload(); // Function CoherentUIGTPlugin.CoherentUIGTWidget.Reload(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111CAA0>
	void Redraw(); // Function CoherentUIGTPlugin.CoherentUIGTWidget.Redraw(Final|Native|Public|BlueprintCallable|Const) // <Game_BE.exe+0x111CA80>
	void MouseEventDelegate__DelegateSignature(struct Unknown& MouseEvent); // DelegateFunction CoherentUIGTPlugin.CoherentUIGTWidget.MouseEventDelegate__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <Game_BE.exe+0x2B80160>
	void Load(struct FString Path); // Function CoherentUIGTPlugin.CoherentUIGTWidget.Load(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111C790>
	void KeyUpDelegate__DelegateSignature(struct Unknown& Key); // DelegateFunction CoherentUIGTPlugin.CoherentUIGTWidget.KeyUpDelegate__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <Game_BE.exe+0x2B80160>
	void KeyDownDelegate__DelegateSignature(struct Unknown& Key); // DelegateFunction CoherentUIGTPlugin.CoherentUIGTWidget.KeyDownDelegate__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <Game_BE.exe+0x2B80160>
	char IsTransparent(); // Function CoherentUIGTPlugin.CoherentUIGTWidget.IsTransparent(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x111C760>
	char IsReadyToCreateView(); // Function CoherentUIGTPlugin.CoherentUIGTWidget.IsReadyToCreateView(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x1118A40>
	char IsReadyForBindings(); // Function CoherentUIGTPlugin.CoherentUIGTWidget.IsReadyForBindings(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x111C730>
	char IsErrorPage(); // Function CoherentUIGTPlugin.CoherentUIGTWidget.IsErrorPage(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111C700>
	char IsDocumentReady(); // Function CoherentUIGTPlugin.CoherentUIGTWidget.IsDocumentReady(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x111C6D0>
	char HasRequestedView(); // Function CoherentUIGTPlugin.CoherentUIGTWidget.HasRequestedView(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x111C6A0>
	struct Unknown GetRenderTexture(); // Function CoherentUIGTPlugin.CoherentUIGTWidget.GetRenderTexture(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x111C590>
	char GetInputPropagationBehaviour(); // Function CoherentUIGTPlugin.CoherentUIGTWidget.GetInputPropagationBehaviour(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x111C440>
	struct Unknown GetDPIScaleSize(); // Function CoherentUIGTPlugin.CoherentUIGTWidget.GetDPIScaleSize(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x111C400>
	float GetDPIScaleBasedOnSize(); // Function CoherentUIGTPlugin.CoherentUIGTWidget.GetDPIScaleBasedOnSize(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x111C3D0>
	float GetClickThroughAlphaThreshold(); // Function CoherentUIGTPlugin.CoherentUIGTWidget.GetClickThroughAlphaThreshold(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x111C3A0>
	void FinishLoadSkip(char bState); // Function CoherentUIGTPlugin.CoherentUIGTWidget.FinishLoadSkip(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111C280>
	void EndDebugFrameSave(); // Function CoherentUIGTPlugin.CoherentUIGTWidget.EndDebugFrameSave(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111C260>
	void DebugSaveNextFrame(); // Function CoherentUIGTPlugin.CoherentUIGTWidget.DebugSaveNextFrame(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111C240>
	struct Unknown CreateJSEvent(); // Function CoherentUIGTPlugin.CoherentUIGTWidget.CreateJSEvent(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x11185F0>
	void CreateDataModelFromStruct(struct FString Name, struct TFieldPath<FUnknown> Arg); // Function CoherentUIGTPlugin.CoherentUIGTWidget.CreateDataModelFromStruct(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x1116100>
	void CreateDataModelFromObject(struct FString Name, struct Unknown Model); // Function CoherentUIGTPlugin.CoherentUIGTWidget.CreateDataModelFromObject(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111C160>
	void BeginDebugFrameSave(); // Function CoherentUIGTPlugin.CoherentUIGTWidget.BeginDebugFrameSave(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x111C140>
	void AKAudioEventDelegate__DelegateSignature(struct FString EventName); // DelegateFunction CoherentUIGTPlugin.CoherentUIGTWidget.AKAudioEventDelegate__DelegateSignature(MulticastDelegate|Public|Delegate) // <Game_BE.exe+0x2B80160>
};

// ScriptStruct CoherentUIGTPlugin.Coh_MouseEventData
struct FCoh_MouseEventData {
	enum class Unknow Type; // 0x0 (1)
	enum class Unknow Button; // 0x1 (1)
	int32_t X; // 0x4 (4)
	int32_t Y; // 0x8 (4)
	float WheelX; // 0xC (4)
	float WheelY; // 0x10 (4)
	struct FString InputGroupName; // 0x18 (16)
	char bDoubleClick : 0; // 0x28 (1)
};

// ScriptStruct CoherentUIGTPlugin.CoherentSound
struct FCoherentSound {
	struct Unknown Component; // 0x0 (8)
	struct Unknown Stream; // 0x8 (8)
};

// ScriptStruct CoherentUIGTPlugin.CoherentUIGTLoadingScreenSettings
struct FCoherentUIGTLoadingScreenSettings {
	float MinimumLoadingScreenDisplayTime; // 0x0 (4)
	char bAutoCompleteWhenLoadingCompletes : 0; // 0x4 (1)
	char bWaitForManualStop : 0; // 0x5 (1)
	struct FString URL; // 0x8 (16)
};

// ScriptStruct CoherentUIGTPlugin.CoherentUIGTViewInfo
struct FCoherentUIGTViewInfo {
	int32_t Width; // 0x0 (4)
	int32_t Height; // 0x4 (4)
	char IsTransparent : 0; // 0x8 (1)
	float ClickThroughAlphaThreshold; // 0xC (4)
	float AnimationFrameDefer; // 0x10 (4)
};

// ScriptStruct CoherentUIGTPlugin.Coh_PrivateInfo
struct FCoh_PrivateInfo {
	struct FString SessionID; // 0x0 (16)
	struct FString AuthToken; // 0x10 (16)
	struct FString ApiGameUrl; // 0x20 (16)
	struct FString CoherentUrl; // 0x30 (16)
	struct FString ApiPhase; // 0x40 (16)
};

// Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.UpdateWholeDataModelFromStruct
inline void UCoherentUIGTBaseComponent::UpdateWholeDataModelFromStruct(struct TFieldPath<FUnknown> Arg) {
	static auto fn = UObject::FindObject<UFunction>("Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.UpdateWholeDataModelFromStruct");

	struct UpdateWholeDataModelFromStruct_Params {
		struct TFieldPath<FUnknown> Arg;
	}; UpdateWholeDataModelFromStruct_Params Params;

	Params.Arg = Arg;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.UpdateWholeDataModelFromObject
inline void UCoherentUIGTBaseComponent::UpdateWholeDataModelFromObject(struct Unknown Model) {
	static auto fn = UObject::FindObject<UFunction>("Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.UpdateWholeDataModelFromObject");

