// Enum CoherentUIGTPlugin.ECoherentUIGTKeys
enum class ECoherentUIGTKeys : uint8 {
	ECoherentUIGTKeys = 0
	ECoherentUIGTKeys = 1
	ECoherentUIGTKeys = 2
	ECoherentUIGTKeys = 3
	ECoherentUIGTKeys = 4
	ECoherentUIGTKeys = 5
	ECoherentUIGTKeys = 6
	ECoherentUIGTKeys = 7
	ECoherentUIGTKeys = 8
	ECoherentUIGTKeys = 9
	ECoherentUIGTKeys = 10
	ECoherentUIGTKeys = 11
	ECoherentUIGTKeys = 12
	ECoherentUIGTKeys = 13
	ECoherentUIGTKeys = 14
	ECoherentUIGTKeys = 15
	ECoherentUIGTKeys = 16
	ECoherentUIGTKeys = 17
	ECoherentUIGTKeys = 18
	ECoherentUIGTKeys = 19
	ECoherentUIGTKeys = 20
	ECoherentUIGTKeys = 21
	ECoherentUIGTKeys = 22
	ECoherentUIGTKeys = 23
	ECoherentUIGTKeys = 24
	ECoherentUIGTKeys = 25
	ECoherentUIGTKeys = 26
	ECoherentUIGTKeys = 27
	ECoherentUIGTKeys = 28
	ECoherentUIGTKeys = 29
	ECoherentUIGTKeys = 30
	ECoherentUIGTKeys = 31
	ECoherentUIGTKeys = 32
	ECoherentUIGTKeys = 33
	ECoherentUIGTKeys = 34
	ECoherentUIGTKeys = 35
	ECoherentUIGTKeys = 36
	ECoherentUIGTKeys = 37
	ECoherentUIGTKeys = 38
	ECoherentUIGTKeys = 39
	ECoherentUIGTKeys = 40
	ECoherentUIGTKeys = 41
	ECoherentUIGTKeys = 42
	ECoherentUIGTKeys = 43
	ECoherentUIGTKeys = 44
	ECoherentUIGTKeys = 45
	ECoherentUIGTKeys = 46
	ECoherentUIGTKeys = 47
	ECoherentUIGTKeys = 48
	ECoherentUIGTKeys = 49
	ECoherentUIGTKeys = 50
	ECoherentUIGTKeys = 51
	ECoherentUIGTKeys = 52
	ECoherentUIGTKeys = 53
	ECoherentUIGTKeys = 54
	ECoherentUIGTKeys = 55
	ECoherentUIGTKeys = 56
	ECoherentUIGTKeys = 57
	ECoherentUIGTKeys = 58
	ECoherentUIGTKeys = 59
	ECoherentUIGTKeys = 60
	ECoherentUIGTKeys = 61
	ECoherentUIGTKeys = 62
	ECoherentUIGTKeys = 63
	ECoherentUIGTKeys = 64
	ECoherentUIGTKeys = 65
	ECoherentUIGTKeys = 66
	ECoherentUIGTKeys = 67
	ECoherentUIGTKeys = 68
	ECoherentUIGTKeys = 69
	ECoherentUIGTKeys = 70
	ECoherentUIGTKeys = 71
	ECoherentUIGTKeys = 72
	ECoherentUIGTKeys = 73
	ECoherentUIGTKeys = 74
	ECoherentUIGTKeys = 75
	ECoherentUIGTKeys = 76
	ECoherentUIGTKeys = 77
	ECoherentUIGTKeys = 78
	ECoherentUIGTKeys = 79
	ECoherentUIGTKeys = 80
	ECoherentUIGTKeys = 81
	ECoherentUIGTKeys = 82
	ECoherentUIGTKeys = 83
	ECoherentUIGTKeys = 84
	ECoherentUIGTKeys = 85
	ECoherentUIGTKeys = 86
	ECoherentUIGTKeys = 87
	ECoherentUIGTKeys = 88
	ECoherentUIGTKeys = 89
	ECoherentUIGTKeys = 90
	ECoherentUIGTKeys = 91
	ECoherentUIGTKeys = 92
	ECoherentUIGTKeys = 93
	ECoherentUIGTKeys = 94
	ECoherentUIGTKeys = 95
	ECoherentUIGTKeys = 96
	ECoherentUIGTKeys = 97
	ECoherentUIGTKeys = 98
	ECoherentUIGTKeys = 99
	ECoherentUIGTKeys = 100
	ECoherentUIGTKeys = 101
	ECoherentUIGTKeys = 102
	ECoherentUIGTKeys = 103
	ECoherentUIGTKeys = 104
	ECoherentUIGTKeys = 105
	ECoherentUIGTKeys = 106
	ECoherentUIGTKeys = 107
};

// Enum CoherentUIGTPlugin.ECoherentUIGTInputPropagationBehaviour
enum class ECoherentUIGTInputPropagationBehaviour : uint8 {
	ECoherentUIGTInputPropagationBehaviour = 0
	ECoherentUIGTInputPropagationBehaviour = 1
	ECoherentUIGTInputPropagationBehaviour = 2
	ECoherentUIGTInputPropagationBehaviour = 3
	ECoherentUIGTInputPropagationBehaviour = 4
};

// Enum CoherentUIGTPlugin.ECoh_MouseButton
enum class ECoh_MouseButton : uint8 {
	ECoh_MouseButton = 0
	ECoh_MouseButton = 1
	ECoh_MouseButton = 2
	ECoh_MouseButton = 3
	ECoh_MouseButton = 4
};

// Enum CoherentUIGTPlugin.ECoh_EventType
enum class ECoh_EventType : uint8 {
	ECoh_EventType = 0
	ECoh_EventType = 1
	ECoh_EventType = 2
	ECoh_EventType = 3
	ECoh_EventType = 4
};

// Enum CoherentUIGTPlugin.ECoherentUIGTMSAA
enum class ECoherentUIGTMSAA : uint8 {
	ECoherentUIGTMSA = 0
	ECoherentUIGTMSA = 1
	ECoherentUIGTMSA = 2
	ECoherentUIGTMSA = 3
};

// Enum CoherentUIGTPlugin.ECoherentUIGTSettingsSeverity
enum class ECoherentUIGTSettingsSeverity : uint8 {
	ECoherentUIGTSettingsSeverity = 0
	ECoherentUIGTSettingsSeverity = 1
	ECoherentUIGTSettingsSeverity = 2
	ECoherentUIGTSettingsSeverity = 3
	ECoherentUIGTSettingsSeverity = 4
	ECoherentUIGTSettingsSeverity = 5
	ECoherentUIGTSettingsSeverity = 6
};

// Enum CoherentUIGTPlugin.EGamepadBehaviourOnFocusLost
enum class EGamepadBehaviourOnFocusLost : uint8 {
	ResetState = 0
	UseCurrentState = 1
	UseStateBeforeReset = 2
	EGamepadBehaviourOnFocusLost_MAX = 3
};

// Enum CoherentUIGTPlugin.EGTInputWidgetLineTraceMode
enum class EGTInputWidgetLineTraceMode : uint8 {
	GTInputLineTrace_Single = 0
	GTInputLineTrace_Multi = 1
	GTInputLineTrace_MAX = 2
};

// Enum CoherentUIGTPlugin.EGTInputWidgetRaycastQuality
enum class EGTInputWidgetRaycastQuality : uint8 {
	RaycastQuality_Fast = 0
	RaycastQuality_Balanced = 1
	RaycastQuality_Accurate = 2
	RaycastQuality_MAX = 3
};

// Class CoherentUIGTPlugin.CoherentUIGTAudioWrapper
struct UCoherentUIGTAudioWrapper : Object {
	struct Unknown Owner; // 0x28 (8)
	struct TMap<Unknown, Unknown>Unknown Sounds; // 0x30 (80)
};

// Class CoherentUIGTPlugin.CoherentUIGTBaseComponent
struct UCoherentUIGTBaseComponent : UActorComponent {
	struct FMulticastInlineDelegate ReadyForBindings; // 0xB0 (16)
	struct FMulticastInlineDelegate BindingsReleased; // 0xC0 (16)
	struct FMulticastInlineDelegate FinishLoad; // 0xD0 (16)
	struct FMulticastInlineDelegate FailLoad; // 0xE0 (16)
	struct FMulticastInlineDelegate StartLoading; // 0xF0 (16)
	struct FMulticastInlineDelegate NavigateTo; // 0x100 (16)
	struct FMulticastInlineDelegate JavaScriptEvent; // 0x110 (16)
	struct FMulticastInlineDelegate UIGTScriptingReady; // 0x120 (16)
	struct FDelegate LiveViewSizeRequested; // 0x130 (16)
	struct Unknown Texture; // 0x158 (8)
	char Filter; // 0x160 (1)
	char b : 0; // 0x161 (1)
	char b : 0; // 0x162 (1)
	char AllowPerformanceWarnings : 0; // 0x163 (1)
	float ExecuteJSTimersThresholdMs; // 0x164 (4)
	float UpdateStylesAndLayoutThresholdMs; // 0x168 (4)
	float RecordRenderingCommandsThresholdMs; // 0x16C (4)
	float PaintWarningThresholdMs; // 0x170 (4)
	int32_t LayersCountThreshold; // 0x174 (4)
	int32_t LayerWidthThreshold; // 0x178 (4)
	int32_t LayerHeightThreshold; // 0x17C (4)
	char bEnableAdditionalDefaultStyles : 0; // 0x180 (1)
	char bDelayedUpdate : 0; // 0x181 (1)
	struct Unknown AudioWrapper; // 0x1F8 (8)

	void UpdateWholeDataModelFromStruct(struct TFieldPath<FUnknown> Arg); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.UpdateWholeDataModelFromStruct(Final|Native|Public|BlueprintCallable|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1100D70>
	void UpdateWholeDataModelFromObject(struct Unknown Model); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.UpdateWholeDataModelFromObject(Final|Native|Public|BlueprintCallable|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x11040F0>
	void TriggerJSEvent(struct FString Name, struct Unknown eventData); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.TriggerJSEvent(Final|Native|Public|BlueprintCallable|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103DF0>
	void SynchronizeModels(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.SynchronizeModels(Final|Native|Public|BlueprintCallable|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103DB0>
	void ShowPaintRects(char Show); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.ShowPaintRects(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103D20>
	void SetOffscreenCanvasRendering(char State); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.SetOffscreenCanvasRendering(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103A00>
	void SetClickThroughAlphaThreshold(float threshold); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.SetClickThroughAlphaThreshold(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103770>
	void Resize(int32_t Width, int32_t Height); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.Resize(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x11036B0>
	void Reload(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.Reload(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103690>
	void Redraw(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.Redraw(Final|Native|Public|BlueprintCallable|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103670>
	void Load(struct FString Path); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.Load(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x11035D0>
	char IsTransparent(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.IsTransparent(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x11035A0>
	char IsReadyToCreateView(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.IsReadyToCreateView(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103570>
	char IsReadyForBindings(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.IsReadyForBindings(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103540>
	char IsDocumentReady(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.IsDocumentReady(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x11034E0>
	char HasRequestedView(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.HasRequestedView(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103300>
	float GetClickThroughAlphaThreshold(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.GetClickThroughAlphaThreshold(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x11032A0>
	void EndDebugFrameSave(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.EndDebugFrameSave(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103280>
	void EnableDelayedUpdate(char bEnabled); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.EnableDelayedUpdate(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x11031F0>
	void DebugSaveNextFrame(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.DebugSaveNextFrame(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x11031D0>
	struct Unknown CreateJSEvent(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.CreateJSEvent(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103120>
	void CreateDataModelFromStruct(struct FString Name, struct TFieldPath<FUnknown> Arg); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.CreateDataModelFromStruct(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1100B00>
	void CreateDataModelFromObject(struct FString Name, struct Unknown Model); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.CreateDataModelFromObject(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103040>
	void BeginDebugFrameSave(); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.BeginDebugFrameSave(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103020>
};

// Class CoherentUIGTPlugin.CoherentUIGTComponent
struct UCoherentUIGTComponent : UCoherentUIGTBaseComponent {
	struct FString U; // 0x230 (16)
	int32_t Width; // 0x240 (4)
	int32_t Height; // 0x244 (4)
	char ManualTexture : 0; // 0x248 (1)
	float ClickThroughAlphaThreshold; // 0x24C (4)
	char Transparent : 0; // 0x250 (1)
};

// Class CoherentUIGTPlugin.CoherentUIGTGameHUD
struct ACoherentUIGTGameHUD : AHUD {
	struct Unknown CoherentUIGTHUD; // 0x400 (8)

	void SetupUIGTView(struct FString PageUrl, char bIsTransparent, float ClickThroughAlphaThreshold, float AnimationFrameDefer, char bDelayedUpdate); // Function CoherentUIGTPlugin.CoherentUIGTGameHUD.SetupUIGTView(Final|RequiredAPI|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103B70>
	char HasSetupUIGTView(); // Function CoherentUIGTPlugin.CoherentUIGTGameHUD.HasSetupUIGTView(Final|RequiredAPI|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103330>
};

// Class CoherentUIGTPlugin.CoherentUIGTHUD
struct UCoherentUIGTHUD : UCoherentUIGTBaseComponent {
	struct Unknown HUDMaterialName; // 0x230 (24)
	struct Unknown HUDMaterial; // 0x248 (8)
	struct Unknown HUDMaterialInstance; // 0x250 (8)
};

// Class CoherentUIGTPlugin.CoherentUIGTInputActor
struct ACoherentUIGTInputActor : UActor {
	struct FMulticastInlineDelegate OnCoherentUIGTInputActorMouseButtonDown; // 0x310 (16)
	struct FMulticastInlineDelegate OnCoherentUIGTInputActorMouseButtonUp; // 0x320 (16)
	struct FMulticastInlineDelegate OnCoherentUIGTInputActorKeyDown; // 0x330 (16)
	struct FMulticastInlineDelegate OnCoherentUIGTInputActorKeyUp; // 0x340 (16)

	void ToggleCoherentUIGTInputFocus(); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.ToggleCoherentUIGTInputFocus(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103DD0>
	void SetLineTraceMode(char Mode); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.SetLineTraceMode(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103980>
	void SetInputPropagationBehaviour(char Propagation); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.SetInputPropagationBehaviour(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103900>
	void SetCoherentUIGTViewFocus(struct Unknown NewFocusedView); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.SetCoherentUIGTViewFocus(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103880>
	void SetCoherentUIGTInputFocus(char FocusUI); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.SetCoherentUIGTInputFocus(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x11037F0>
	char IsJoystickInputWhileUIGTIsFocusedAllowed_DEPRECATED(); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.IsJoystickInputWhileUIGTIsFocusedAllowed_DEPRECATED(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103510>
	char IsCoherentUIGTFocused(); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.IsCoherentUIGTFocused(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x11034B0>
	void Initialize(char CollisionChannel, char AddressMode, char RaycastQuality, int32_t UVChannel); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.Initialize(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1103360>
	char GetInputPropagationBehaviour(); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.GetInputPropagationBehaviour(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x11032D0>
	void AlwaysAcceptMouseInput(char bAccept); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.AlwaysAcceptMouseInput(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1102F90>
	void AllowJoystickInputWhileUIGTIsFocused_DEPRECATED(char bAllow); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.AllowJoystickInputWhileUIGTIsFocused_DEPRECATED(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1102F00>
};

// Class CoherentUIGTPlugin.CoherentUIGTJSEvent
struct UCoherentUIGTJSEvent : Object {
	struct TArray<Unknown> StructTypes; // 0xA8 (16)

	void AddText(struct FText& Text); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddText(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1106A70>
	void AddStructArg(struct TFieldPath<FUnknown> Arg); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddStructArg(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1100A50>
	void AddString(struct FString Str); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddString(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x11069D0>
	void AddObject(struct Unknown Object); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddObject(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1106950>
	void AddName(struct FName& Name); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddName(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x11068C0>
	void AddInt32(int32_t integer); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddInt32(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1106840>
	void AddFloat(float fl); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddFloat(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x11067C0>
	void AddByte(enum class Unknown Byte); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddByte(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1106740>
	void AddBool(char B); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddBool(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x11066B0>
	void AddArray(struct TArray<Unknown>& Array); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddArray(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x11006A0>
};

// Class CoherentUIGTPlugin.CoherentUIGTJSPayload
struct UCoherentUIGTJSPayload : Object {
	struct FString EventName; // 0x28 (16)

	void ReadObject(int32_t Index, struct Unknown Object); // Function CoherentUIGTPlugin.CoherentUIGTJSPayload.ReadObject(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x11073C0>
	struct FString GetString(int32_t Index); // Function CoherentUIGTPlugin.CoherentUIGTJSPayload.GetString(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1106FC0>
	float GetNumber(int32_t Index); // Function CoherentUIGTPlugin.CoherentUIGTJSPayload.GetNumber(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1106F00>
	int32_t GetInt32(int32_t Index); // Function CoherentUIGTPlugin.CoherentUIGTJSPayload.GetInt32(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1106E70>
	char GetBool(int32_t Index); // Function CoherentUIGTPlugin.CoherentUIGTJSPayload.GetBool(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1106D10>
};

// Class CoherentUIGTPlugin.CoherentUIGTLiveView
struct UCoherentUIGTLiveView : UActorComponent {
	struct FString LinkName; // 0xB0 (16)
	struct Unknown Texture; // 0xC0 (8)

	void OnLiveViewSizeRequest(struct Unknown baseComponent, struct FString Name, int32_t& Width, int32_t& Height); // Function CoherentUIGTPlugin.CoherentUIGTLiveView.OnLiveViewSizeRequest(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1107230>
};

// Class CoherentUIGTPlugin.CoherentUIGTSettings
struct UCoherentUIGTSettings : Object {
	char EnableLiveReload : 0; // 0x28 (1)
	int32_t InspectorPort; // 0x2C (4)
	int32_t WebdriverPort; // 0x30 (4)
	char EnableWebSecurity : 0; // 0x34 (1)
	char EnableLocalization : 0; // 0x35 (1)
	char RunAsynchronous : 0; // 0x36 (1)
	char AllowPerformanceWarningsInEditor : 0; // 0x37 (1)
	char ShowWarningsOnScreen : 0; // 0x38 (1)
	enum class Unknow LogSeverity; // 0x39 (1)
	char bPaintToBackBuffer : 0; // 0x3A (1)
	char b : 0; // 0x3B (1)
	char b : 0; // 0x3C (1)
	struct FString HUDMaterialName; // 0x40 (16)
	struct FString CoUIResourcesRoot; // 0x50 (16)
	char TickWhileGameIsPaused : 0; // 0x60 (1)
	char bUseLowerCaseNamesForAutoExposedProperties : 0; // 0x61 (1)
	enum class Unknow MSAA; // 0x62 (1)
	struct FString CookiesResource; // 0x68 (16)
	struct FString LocalStorageFolder; // 0x78 (16)
	char UseCacheFile : 0; // 0x88 (1)
	char UseReceivedFromServ : 0; // 0x89 (1)
};

// Class CoherentUIGTPlugin.CoherentUIGTWidget
struct UCoherentUIGTWidget : UWidget {
	struct Unknown Owner; // 0x120 (8)
	struct FMulticastInlineDelegate ReadyForBindings; // 0x128 (16)
	struct FMulticastInlineDelegate BindingsReleased; // 0x138 (16)
	struct FMulticastInlineDelegate FinishLoad; // 0x148 (16)
	struct FMulticastInlineDelegate FailLoad; // 0x158 (16)
	struct FMulticastInlineDelegate StartLoading; // 0x168 (16)
	struct FMulticastInlineDelegate NavigateTo; // 0x178 (16)
	struct FMulticastInlineDelegate JavaScriptEvent; // 0x188 (16)
	struct FMulticastInlineDelegate UIGTScriptingReady; // 0x198 (16)
	struct FMulticastInlineDelegate AkAudioEvent; // 0x1C0 (16)
	struct FMulticastInlineDelegate KeyUpDelegate; // 0x1D0 (16)
	struct FMulticastInlineDelegate KeyDownDelegate; // 0x1E0 (16)
	struct FMulticastInlineDelegate MouseEventDelegate; // 0x1F0 (16)
	char Filter; // 0x200 (1)
	char b : 0; // 0x201 (1)
	char InputPropagationBehaviour; // 0x202 (1)
	char b : 0; // 0x203 (1)
	char bGammaCorrectedMaterial : 0; // 0x204 (1)
	float TickPeriodInMinimizedGame; // 0x208 (4)
	char AllowPerformanceWarnings : 0; // 0x20C (1)
	float ExecuteJSTimersThresholdMs; // 0x210 (4)
	float UpdateStylesAndLayoutThresholdMs; // 0x214 (4)
	float RecordRenderingCommandsThresholdMs; // 0x218 (4)
	float PaintWarningThresholdMs; // 0x21C (4)
	int32_t LayersCountThreshold; // 0x220 (4)
	int32_t LayerWidthThreshold; // 0x224 (4)
	int32_t LayerHeightThreshold; // 0x228 (4)
	char bEnableAdditionalDefaultStyles : 0; // 0x22C (1)
	struct Unknown AudioWrapper; // 0x2A0 (8)
	struct FString U; // 0x328 (16)
	float ClickThroughAlphaThreshold; // 0x338 (4)
	char OffscreenCanvasRendering : 0; // 0x33C (1)
	char Transparent : 0; // 0x33D (1)

	void UpdateWholeDataModelFromStruct(struct TFieldPath<FUnknown> Arg); // Function CoherentUIGTPlugin.CoherentUIGTWidget.UpdateWholeDataModelFromStruct(Final|Native|Public|BlueprintCallable|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1100E40>
	void UpdateWholeDataModelFromObject(struct Unknown Model); // Function CoherentUIGTPlugin.CoherentUIGTWidget.UpdateWholeDataModelFromObject(Final|Native|Public|BlueprintCallable|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1107B30>
	void TriggerJSEvent(struct FString Name, struct Unknown eventData); // Function CoherentUIGTPlugin.CoherentUIGTWidget.TriggerJSEvent(Final|Native|Public|BlueprintCallable|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1107A50>
	void SynchronizeModels(); // Function CoherentUIGTPlugin.CoherentUIGTWidget.SynchronizeModels(Final|Native|Public|BlueprintCallable|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1107A30>
