// Enum CoherentUIGTPlugin.ECoherentUIGTKeys
enum class ECoherentUIGTKeys : uint8 {
	ECoherentUIGTKeys = 0,
	ECoherentUIGTKeys = 1,
	ECoherentUIGTKeys = 2,
	ECoherentUIGTKeys = 3,
	ECoherentUIGTKeys = 4,
	ECoherentUIGTKeys = 5,
	ECoherentUIGTKeys = 6,
	ECoherentUIGTKeys = 7,
	ECoherentUIGTKeys = 8,
	ECoherentUIGTKeys = 9,
	ECoherentUIGTKeys = 10,
	ECoherentUIGTKeys = 11,
	ECoherentUIGTKeys = 12,
	ECoherentUIGTKeys = 13,
	ECoherentUIGTKeys = 14,
	ECoherentUIGTKeys = 15,
	ECoherentUIGTKeys = 16,
	ECoherentUIGTKeys = 17,
	ECoherentUIGTKeys = 18,
	ECoherentUIGTKeys = 19,
	ECoherentUIGTKeys = 20,
	ECoherentUIGTKeys = 21,
	ECoherentUIGTKeys = 22,
	ECoherentUIGTKeys = 23,
	ECoherentUIGTKeys = 24,
	ECoherentUIGTKeys = 25,
	ECoherentUIGTKeys = 26,
	ECoherentUIGTKeys = 27,
	ECoherentUIGTKeys = 28,
	ECoherentUIGTKeys = 29,
	ECoherentUIGTKeys = 30,
	ECoherentUIGTKeys = 31,
	ECoherentUIGTKeys = 32,
	ECoherentUIGTKeys = 33,
	ECoherentUIGTKeys = 34,
	ECoherentUIGTKeys = 35,
	ECoherentUIGTKeys = 36,
	ECoherentUIGTKeys = 37,
	ECoherentUIGTKeys = 38,
	ECoherentUIGTKeys = 39,
	ECoherentUIGTKeys = 40,
	ECoherentUIGTKeys = 41,
	ECoherentUIGTKeys = 42,
	ECoherentUIGTKeys = 43,
	ECoherentUIGTKeys = 44,
	ECoherentUIGTKeys = 45,
	ECoherentUIGTKeys = 46,
	ECoherentUIGTKeys = 47,
	ECoherentUIGTKeys = 48,
	ECoherentUIGTKeys = 49,
	ECoherentUIGTKeys = 50,
	ECoherentUIGTKeys = 51,
	ECoherentUIGTKeys = 52,
	ECoherentUIGTKeys = 53,
	ECoherentUIGTKeys = 54,
	ECoherentUIGTKeys = 55,
	ECoherentUIGTKeys = 56,
	ECoherentUIGTKeys = 57,
	ECoherentUIGTKeys = 58,
	ECoherentUIGTKeys = 59,
	ECoherentUIGTKeys = 60,
	ECoherentUIGTKeys = 61,
	ECoherentUIGTKeys = 62,
	ECoherentUIGTKeys = 63,
	ECoherentUIGTKeys = 64,
	ECoherentUIGTKeys = 65,
	ECoherentUIGTKeys = 66,
	ECoherentUIGTKeys = 67,
	ECoherentUIGTKeys = 68,
	ECoherentUIGTKeys = 69,
	ECoherentUIGTKeys = 70,
	ECoherentUIGTKeys = 71,
	ECoherentUIGTKeys = 72,
	ECoherentUIGTKeys = 73,
	ECoherentUIGTKeys = 74,
	ECoherentUIGTKeys = 75,
	ECoherentUIGTKeys = 76,
	ECoherentUIGTKeys = 77,
	ECoherentUIGTKeys = 78,
	ECoherentUIGTKeys = 79,
	ECoherentUIGTKeys = 80,
	ECoherentUIGTKeys = 81,
	ECoherentUIGTKeys = 82,
	ECoherentUIGTKeys = 83,
	ECoherentUIGTKeys = 84,
	ECoherentUIGTKeys = 85,
	ECoherentUIGTKeys = 86,
	ECoherentUIGTKeys = 87,
	ECoherentUIGTKeys = 88,
	ECoherentUIGTKeys = 89,
	ECoherentUIGTKeys = 90,
	ECoherentUIGTKeys = 91,
	ECoherentUIGTKeys = 92,
	ECoherentUIGTKeys = 93,
	ECoherentUIGTKeys = 94,
	ECoherentUIGTKeys = 95,
	ECoherentUIGTKeys = 96,
	ECoherentUIGTKeys = 97,
	ECoherentUIGTKeys = 98,
	ECoherentUIGTKeys = 99,
	ECoherentUIGTKeys = 100,
	ECoherentUIGTKeys = 101,
	ECoherentUIGTKeys = 102,
	ECoherentUIGTKeys = 103,
	ECoherentUIGTKeys = 104,
	ECoherentUIGTKeys = 105,
	ECoherentUIGTKeys = 106,
	ECoherentUIGTKeys = 107
};

// Enum CoherentUIGTPlugin.ECoherentUIGTInputPropagationBehaviour
enum class ECoherentUIGTInputPropagationBehaviour : uint8 {
	ECoherentUIGTInputPropagationBehaviour = 0,
	ECoherentUIGTInputPropagationBehaviour = 1,
	ECoherentUIGTInputPropagationBehaviour = 2,
	ECoherentUIGTInputPropagationBehaviour = 3,
	ECoherentUIGTInputPropagationBehaviour = 4
};

// Enum CoherentUIGTPlugin.ECoh_MouseButton
enum class ECoh_MouseButton : uint8 {
	ECoh_MouseButton = 0,
	ECoh_MouseButton = 1,
	ECoh_MouseButton = 2,
	ECoh_MouseButton = 3,
	ECoh_MouseButton = 4
};

// Enum CoherentUIGTPlugin.ECoh_EventType
enum class ECoh_EventType : uint8 {
	ECoh_EventType = 0,
	ECoh_EventType = 1,
	ECoh_EventType = 2,
	ECoh_EventType = 3,
	ECoh_EventType = 4
};

// Enum CoherentUIGTPlugin.ECoherentUIGTMSAA
enum class ECoherentUIGTMSAA : uint8 {
	ECoherentUIGTMSA = 0,
	ECoherentUIGTMSA = 1,
	ECoherentUIGTMSA = 2,
	ECoherentUIGTMSA = 3
};

// Enum CoherentUIGTPlugin.ECoherentUIGTSettingsSeverity
enum class ECoherentUIGTSettingsSeverity : uint8 {
	ECoherentUIGTSettingsSeverity = 0,
	ECoherentUIGTSettingsSeverity = 1,
	ECoherentUIGTSettingsSeverity = 2,
	ECoherentUIGTSettingsSeverity = 3,
	ECoherentUIGTSettingsSeverity = 4,
	ECoherentUIGTSettingsSeverity = 5,
	ECoherentUIGTSettingsSeverity = 6
};

// Enum CoherentUIGTPlugin.EGamepadBehaviourOnFocusLost
enum class EGamepadBehaviourOnFocusLost : uint8 {
	ResetState = 0,
	UseCurrentState = 1,
	UseStateBeforeReset = 2,
	EGamepadBehaviourOnFocusLost_MAX = 3
};

// Enum CoherentUIGTPlugin.EGTInputWidgetLineTraceMode
enum class EGTInputWidgetLineTraceMode : uint8 {
	GTInputLineTrace_Single = 0,
	GTInputLineTrace_Multi = 1,
	GTInputLineTrace_MAX = 2
};

// Enum CoherentUIGTPlugin.EGTInputWidgetRaycastQuality
enum class EGTInputWidgetRaycastQuality : uint8 {
	RaycastQuality_Fast = 0,
	RaycastQuality_Balanced = 1,
	RaycastQuality_Accurate = 2,
	RaycastQuality_MAX = 3
};

// Class CoherentUIGTPlugin.CoherentUIGTAudioWrapper
struct UCoherentUIGTAudioWrapper : Object {
	Unknown Owner; //  0x28 Size(8)
	Unknown Sounds; //  0x30 Size(50)
};

// Class CoherentUIGTPlugin.CoherentUIGTBaseComponent
struct UCoherentUIGTBaseComponent : UActorComponent {
	struct FMulticastInlineDelegate ReadyForBindings; //  0xb0 Size(10)
	struct FMulticastInlineDelegate BindingsReleased; //  0xc0 Size(10)
	struct FMulticastInlineDelegate FinishLoad; //  0xd0 Size(10)
	struct FMulticastInlineDelegate FailLoad; //  0xe0 Size(10)
	struct FMulticastInlineDelegate StartLoading; //  0xf0 Size(10)
	struct FMulticastInlineDelegate NavigateTo; //  0x100 Size(10)
	struct FMulticastInlineDelegate JavaScriptEvent; //  0x110 Size(10)
	struct FMulticastInlineDelegate UIGTScriptingReady; //  0x120 Size(10)
	struct FDelegate LiveViewSizeRequested; //  0x130 Size(10)
	Unknown Texture; //  0x158 Size(8)
	Unknown Filter; //  0x160 Size(1)
	char bReceiveInput; //  0x161 Size(1)
	char bReceiveInputWhenTransparent; //  0x162 Size(1)
	char AllowPerformanceWarnings; //  0x163 Size(1)
	float ExecuteJSTimersThresholdMs; //  0x164 Size(4)
	float UpdateStylesAndLayoutThresholdMs; //  0x168 Size(4)
	float RecordRenderingCommandsThresholdMs; //  0x16c Size(4)
	float PaintWarningThresholdMs; //  0x170 Size(4)
	int32_t LayersCountThreshold; //  0x174 Size(4)
	int32_t LayerWidthThreshold; //  0x178 Size(4)
	int32_t LayerHeightThreshold; //  0x17c Size(4)
	char bEnableAdditionalDefaultStyles; //  0x180 Size(1)
	char bDelayedUpdate; //  0x181 Size(1)
	Unknown AudioWrapper; //  0x1f8 Size(8)

	void UpdateWholeDataModelFromStruct(Unknown Arg); // Function CoherentUIGTPlugin.CoherentUIGTBaseComponent.UpdateWholeDataModelFromStruct(Final|Native|Public|BlueprintCallable|Const) // <Game+0x1100940>
};

// Class CoherentUIGTPlugin.CoherentUIGTComponent
struct UCoherentUIGTComponent : UCoherentUIGTBaseComponent {
	struct FString URL; //  0x230 Size(10)
	int32_t Width; //  0x240 Size(4)
	int32_t Height; //  0x244 Size(4)
	char ManualTexture; //  0x248 Size(1)
	float ClickThroughAlphaThreshold; //  0x24c Size(4)
	char Transparent; //  0x250 Size(1)
};

// Class CoherentUIGTPlugin.CoherentUIGTGameHUD
struct ACoherentUIGTGameHUD : AHUD {
	Unknown CoherentUIGTHUD; //  0x400 Size(8)

	void SetupUIGTView(struct FString PageUrl, char bIsTransparent, float ClickThroughAlphaThreshold, float AnimationFrameDefer, char bDelayedUpdate); // Function CoherentUIGTPlugin.CoherentUIGTGameHUD.SetupUIGTView(Final|RequiredAPI|Native|Public|BlueprintCallable) // <Game+0x1103730>
};

// Class CoherentUIGTPlugin.CoherentUIGTHUD
struct UCoherentUIGTHUD : UCoherentUIGTBaseComponent {
	Unknown HUDMaterialName; //  0x230 Size(18)
	Unknown HUDMaterial; //  0x248 Size(8)
	Unknown HUDMaterialInstance; //  0x250 Size(8)
};

// Class CoherentUIGTPlugin.CoherentUIGTInputActor
struct ACoherentUIGTInputActor : UActor {
	struct FMulticastInlineDelegate OnCoherentUIGTInputActorMouseButtonDown; //  0x310 Size(10)
	struct FMulticastInlineDelegate OnCoherentUIGTInputActorMouseButtonUp; //  0x320 Size(10)
	struct FMulticastInlineDelegate OnCoherentUIGTInputActorKeyDown; //  0x330 Size(10)
	struct FMulticastInlineDelegate OnCoherentUIGTInputActorKeyUp; //  0x340 Size(10)

	void ToggleCoherentUIGTInputFocus(); // Function CoherentUIGTPlugin.CoherentUIGTInputActor.ToggleCoherentUIGTInputFocus(Final|Native|Public|BlueprintCallable) // <Game+0x1103990>
};

// Class CoherentUIGTPlugin.CoherentUIGTJSEvent
struct UCoherentUIGTJSEvent : Object {
	Unknown StructTypes; //  0xa8 Size(10)

	void AddText(struct FText& Text); // Function CoherentUIGTPlugin.CoherentUIGTJSEvent.AddText(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x1106630>
};

// Class CoherentUIGTPlugin.CoherentUIGTJSPayload
struct UCoherentUIGTJSPayload : Object {
	struct FString EventName; //  0x28 Size(10)

	void ReadObject(int32_t Index, Unknown Object); // Function CoherentUIGTPlugin.CoherentUIGTJSPayload.ReadObject(Final|Native|Public|BlueprintCallable) // <Game+0x1106f80>
};

// Class CoherentUIGTPlugin.CoherentUIGTLiveView
struct UCoherentUIGTLiveView : UActorComponent {
	struct FString LinkName; //  0xb0 Size(10)
	Unknown Texture; //  0xc0 Size(8)

	void OnLiveViewSizeRequest(Unknown baseComponent, struct FString Name, int32_t& Width, int32_t& Height); // Function CoherentUIGTPlugin.CoherentUIGTLiveView.OnLiveViewSizeRequest(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x1106df0>
};

// Class CoherentUIGTPlugin.CoherentUIGTSettings
struct UCoherentUIGTSettings : Object {
	char Enab; //  0x28 Size(1)
	int32_t InspectorPort; //  0x2c Size(4)
	int32_t WebdriverPort; //  0x30 Size(4)
	char Enab; //  0x34 Size(1)
	char EnabriverPort; //  0x35 Size(1)
	char RunAsynchronous; //  0x36 Size(1)
	char AllowPerformanceWarningsInEditor; //  0x37 Size(1)
	char ShowWarningsOnScreen; //  0x38 Size(1)
	Unknown LogSeverity; //  0x39 Size(1)
	char bPaintToBackBuffer; //  0x3a Size(1)
	char bRespectTitleSafeZone; //  0x3b Size(1)
	char bRespectLetterboxing; //  0x3c Size(1)
	struct FString HUDMaterialName; //  0x40 Size(10)
	struct FString CoUIResourcesRoot; //  0x50 Size(10)
	char TickWhileGameIsPaused; //  0x60 Size(1)
	char bUseLowerCaseNamesForAutoExposedProperties; //  0x61 Size(1)
	Unknown MSAA; //  0x62 Size(1)
	struct FString CookiesResource; //  0x68 Size(10)
	struct FString LocalStorageFolder; //  0x78 Size(10)
	char UseCacheFile; //  0x88 Size(1)
	char UseReceivedFromServ; //  0x89 Size(1)
};

// Class CoherentUIGTPlugin.CoherentUIGTWidget
struct UCoherentUIGTWidget : UWidget {
	Unknown Owner; //  0x120 Size(8)
	struct FMulticastInlineDelegate ReadyForBindings; //  0x128 Size(10)
	struct FMulticastInlineDelegate BindingsReleased; //  0x138 Size(10)
	struct FMulticastInlineDelegate FinishLoad; //  0x148 Size(10)
	struct FMulticastInlineDelegate FailLoad; //  0x158 Size(10)
	struct FMulticastInlineDelegate StartLoading; //  0x168 Size(10)
	struct FMulticastInlineDelegate NavigateTo; //  0x178 Size(10)
	struct FMulticastInlineDelegate JavaScriptEvent; //  0x188 Size(10)
	struct FMulticastInlineDelegate UIGTScriptingReady; //  0x198 Size(10)
	struct FMulticastInlineDelegate AkAudioEvent; //  0x1c0 Size(10)
	struct FMulticastInlineDelegate KeyUpDelegate; //  0x1d0 Size(10)
	struct FMulticastInlineDelegate KeyDownDelegate; //  0x1e0 Size(10)
	struct FMulticastInlineDelegate MouseEventDelegate; //  0x1f0 Size(10)
	Unknown Filter; //  0x200 Size(1)
	char bReceiveInput; //  0x201 Size(1)
	Unknown InputPropagationBehaviour; //  0x202 Size(1)
	char bReceiveInputWhenTransparent; //  0x203 Size(1)
	char bGammaCorrectedMaterial; //  0x204 Size(1)
	float TickPeriodInMinimizedGame; //  0x208 Size(4)
	char AllowPerformanceWarnings; //  0x20c Size(1)
	float ExecuteJSTimersThresholdMs; //  0x210 Size(4)
	float UpdateStylesAndLayoutThresholdMs; //  0x214 Size(4)
	float RecordRenderingCommandsThresholdMs; //  0x218 Size(4)
	float PaintWarningThresholdMs; //  0x21c Size(4)
	int32_t LayersCountThreshold; //  0x220 Size(4)
	int32_t LayerWidthThreshold; //  0x224 Size(4)
	int32_t LayerHeightThreshold; //  0x228 Size(4)
	char bEnableAdditionalDefaultStyles; //  0x22c Size(1)
	Unknown AudioWrapper; //  0x2a0 Size(8)
	struct FString URL; //  0x328 Size(10)
	float ClickThroughAlphaThreshold; //  0x338 Size(4)
	char OffscreenCanvasRendering; //  0x33c Size(1)
	char Transparent; //  0x33d Size(1)

	void UpdateWholeDataModelFromStruct(Unknown Arg); // Function CoherentUIGTPlugin.CoherentUIGTWidget.UpdateWholeDataModelFromStruct(Final|Native|Public|BlueprintCallable|Const) // <Game+0x1100a10>
};

