// WidgetBlueprintGeneratedClass ConfirmPopupWidget.ConfirmPopupWidget_C
struct UConfirmPopupWidget_C : UBravoHotelConfirmPopupWidget {
	struct Unknown UberGraphFrame; //  0x250 Size(8)
	struct Unknown Bg; //  0x258 Size(8)
	struct Unknown btn_Cancel; //  0x260 Size(8)
	struct Unknown btn_OK; //  0x268 Size(8)
	struct Unknown Image_2; //  0x270 Size(8)
	struct Unknown Overlay_2; //  0x278 Size(8)
	struct Unknown TextBlock_1; //  0x280 Size(8)
	struct Unknown TextBlock_17; //  0x288 Size(8)
	struct Unknown TextBlock_18; //  0x290 Size(8)
	struct Unknown TextBlock_19; //  0x298 Size(8)
	char PopupType; //  0x2a0 Size(1)
	struct Unknown SettingWidget; //  0x2a8 Size(8)
	int32_t CurrentSelectIndex; //  0x2b0 Size(4)
	enum class Unknow CurrentSelectType; //  0x2b4 Size(1)
	struct TArray<Unknown> BackupSlots; //  0x2b8 Size(10)
	struct Unknown Timer; //  0x2c8 Size(8)
	int32_t TimerCount; //  0x2d0 Size(4)

	void SetTimerCount(); // Function ConfirmPopupWidget.ConfirmPopupWidget_C.SetTimerCount(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

