// WidgetBlueprintGeneratedClass ControlWidget.ControlWidget_C
class UControlWidget_C : public UBravoHotelSettingSubWidget {

public:

	struct Unknown UberGraphFrame; // 0x298 (8)
	struct Unknown 15XSensitivity; // 0x2A0 (8)
	struct Unknown 2XSensitivity; // 0x2A8 (8)
	struct Unknown 4XSensitivity; // 0x2B0 (8)
	struct Unknown 6XSensitivity; // 0x2B8 (8)
	struct Unknown 8XSensitivity; // 0x2C0 (8)
	struct Unknown ADSSensitivity; // 0x2C8 (8)
	struct Unknown GeneralSensitivity; // 0x2D0 (8)
	struct Unknown ReverseLeftAndRight; // 0x2D8 (8)
	struct Unknown ReverseUpAndDown; // 0x2E0 (8)
	struct Unknown ScrollBox_55; // 0x2E8 (8)
	struct Unknown TargetingSensitivity; // 0x2F0 (8)
	struct Unknown ToggleADS; // 0x2F8 (8)
	struct Unknown ToggleAOS; // 0x300 (8)
	struct Unknown ToggleCrouch; // 0x308 (8)
	struct Unknown ToggleExLean; // 0x310 (8)
	struct Unknown ToggleFreeLook; // 0x318 (8)
	struct Unknown ToggleSprint; // 0x320 (8)
	struct Unknown ToggleSteadyAim; // 0x328 (8)
	struct Unknown ToggleWalk; // 0x330 (8)
	struct Unknown TotalSensitivity; // 0x338 (8)
	struct Unknown UsingDetailSensitiv; // 0x340 (8)
	struct Unknown VehicleDriverSensitivity; // 0x348 (8)
	struct Unknown VerticalBox_1; // 0x350 (8)
	struct Unknown VerticlaModifier; // 0x358 (8)
	struct Unknown ; // 0x360 (8)
	struct Unknown ; // 0x368 (8)
	struct Unknown ; // 0x370 (8)
	struct Unknown ScrollBarTimer; // 0x378 (8)

	void Construct(); // Function ControlWidget.ControlWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DelegateChangeValue_Event_1(struct Unknown Value); // Function ControlWidget.ControlWidget_C.DelegateChangeValue_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ScrollBox_54_K2Node_Com(float CurrentOffset); // Function ControlWidget.ControlWidget_C.BndEvt__ScrollBox_54_K2Node_Com(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function ControlWidget.ControlWidget_C.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_ControlWidget(int32_t EntryPoint); // Function ControlWidget.ControlWidget_C.ExecuteUbergraph_ControlWidget(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

