// WidgetBlueprintGeneratedClass ControlWidget.ControlWidget_C
struct UControlWidget_C : UBravoHotelSettingSubWidget {
	struct Unknown UberGraphFrame; //  0x298 Size(8)
	struct Unknown 15XSensitivity; //  0x2a0 Size(8)
	struct Unknown 2XSensitivity; //  0x2a8 Size(8)
	struct Unknown 4XSensitivity; //  0x2b0 Size(8)
	struct Unknown 6XSensitivity; //  0x2b8 Size(8)
	struct Unknown 8XSensitivity; //  0x2c0 Size(8)
	struct Unknown ADSSensitivity; //  0x2c8 Size(8)
	struct Unknown GeneralSensitivity; //  0x2d0 Size(8)
	struct Unknown ReverseLeftAndRight; //  0x2d8 Size(8)
	struct Unknown ReverseUpAnd; //  0x2e0 Size(8)
	struct Unknown ScrollBox_55; //  0x2e8 Size(8)
	struct Unknown TargetingSensitivity; //  0x2f0 Size(8)
	struct Unknown ToggleADS; //  0x2f8 Size(8)
	struct Unknown ToggleAOS; //  0x300 Size(8)
	struct Unknown ToggleCrouch; //  0x308 Size(8)
	struct Unknown ToggleExLean; //  0x310 Size(8)
	struct Unknown ToggleFreeLook; //  0x318 Size(8)
	struct Unknown ToggleSprint; //  0x320 Size(8)
	struct Unknown ToggleSteadyAim; //  0x328 Size(8)
	struct Unknown ToggleWalk; //  0x330 Size(8)
	struct Unknown TotalSensitivity; //  0x338 Size(8)
	struct Unknown UsingDetailSensitiv; //  0x340 Size(8)
	struct Unknown VehicleDriverSensitivity; //  0x348 Size(8)
	struct Unknown VerticalBox_1; //  0x350 Size(8)
	struct Unknown VerticlaModifier; //  0x358 Size(8)
	struct Unknown ; //  0x360 Size(8)
	struct Unknown ; //  0x368 Size(8)
	struct Unknown ; //  0x370 Size(8)
	struct Unknown ScrollBarTimer; //  0x378 Size(8)

	void Construct(); // Function ControlWidget.ControlWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

