// BlueprintGeneratedClass CustomizedChara_DataAsset.CustomizedChara_DataAsset_C
struct UCustomizedChara_DataAsset_C : UPrimaryDataAsset {
	float CharacterRotationVelocity; // 0x30 (4)
	float CameraMoveVelocity; // 0x34 (4)
	float CameraTop; // 0x38 (4)
	float CameraBottom; // 0x3C (4)
	float CameraZoomVelocity; // 0x40 (4)
	float CameraInterpSpeed; // 0x44 (4)
	float CharacterRotationInterpSpeed; // 0x48 (4)
	struct Unknown CameraMove; // 0x50 (8)
};

