// BlueprintGeneratedClass CustomizedChara_DataAsset.CustomizedChara_DataAsset_C
struct UCustomizedChara_DataAsset_C : UPrimaryDataAsset {
	float CharacterRotationVelocity; //  0x30 Size(4)
	float CameraMoveVelocity; //  0x34 Size(4)
	float CameraTop; //  0x38 Size(4)
	float CameraBottom; //  0x3c Size(4)
	float CameraZoomVelocity; //  0x40 Size(4)
	float CameraInterpSpeed; //  0x44 Size(4)
	float CharacterRotationInterpSpeed; //  0x48 Size(4)
	Unknown CameraMove; //  0x50 Size(8)
};

