// WidgetBlueprintGeneratedClass DevWidget.DevWidget_C
class UDevWidget_C : public UBravoHotelSettingSubWidget {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x298 (8)
	struct UButton ButtonClearStats; // 0x2A0 (8)
	struct UButton ButtonDebugVehicle; // 0x2A8 (8)
	struct UButton ButtonEngine; // 0x2B0 (8)
	struct UButton ButtonFPS; // 0x2B8 (8)
	struct UButton ButtonGameplayTick; // 0x2C0 (8)
	struct UButton ButtonMemory; // 0x2C8 (8)
	struct UButton ButtonNetwork; // 0x2D0 (8)
	struct UButton ButtonParticles; // 0x2D8 (8)
	struct UButton ButtonSceneRendering; // 0x2E0 (8)
	struct UButton ButtonStatSlow; // 0x2E8 (8)
	struct UButton ButtonUnitGraph; // 0x2F0 (8)
	struct UComboBoxString ComboBoxViewModes; // 0x2F8 (8)
	struct UComboBoxString ComboBoxViewModes1; // 0x300 (8)
	struct UButton DeleteSettingsSaveFile; // 0x308 (8)
	struct USlider GameSpeed; // 0x310 (8)
	struct UEditableText GameSpeedEdit; // 0x318 (8)
	struct UHorizontalBox HorizontalBox_8; // 0x320 (8)
	struct UHorizontalBox HorizontalBox_9; // 0x328 (8)
	struct UHorizontalBox HorizontalBox_10; // 0x330 (8)
	struct UHorizontalBox HorizontalBox_11; // 0x338 (8)
	struct UHorizontalBox HorizontalBox_12; // 0x340 (8)
	struct UHorizontalBox HorizontalBox_13; // 0x348 (8)
	struct UCheckBox PauseGame; // 0x350 (8)
	struct UCheckBox TemporalAACatmullRomCheck; // 0x358 (8)
	struct UEditableText TemporalAACurrentFrameWeightEdit; // 0x360 (8)
	struct UEditableText TemporalAAFilterSizeEdit; // 0x368 (8)
	struct UCheckBox TemporalAAPauseCorrectChek; // 0x370 (8)
	struct UEditableText TemporalAASamplesEdit; // 0x378 (8)
	struct UEditableText TonemapperSharpenEdit; // 0x380 (8)
	struct UHorizontalBox ToolTip_DeleteSettings; // 0x388 (8)
	struct UHorizontalBox ToolTip_GameSpeed; // 0x390 (8)
	struct UHorizontalBox ToolTip_PauseGame; // 0x398 (8)
	struct UVerticalBox ToolTip_StatCommands; // 0x3A0 (8)
	struct UVerticalBox ToolTip_ViewModes; // 0x3A8 (8)
	struct UVerticalBox ToolTip_ViewModes_2; // 0x3B0 (8)
	struct UBP_GameSettings_C Game Settings; // 0x3B8 (8)
	float Time Dilation Value Binding; // 0x3C0 (4)
	struct FText Time Dilation Text Binding; // 0x3C8 (24)
	struct FMulticastInlineDelegate Settings File Deleted; // 0x3E0 (16)
	struct FMulticastInlineDelegate Pause Game When Menu Open; // 0x3F0 (16)
	struct FText TemporalAAFilterSizeTextBinding; // 0x400 (24)
	struct FText TemporalAACurrentFrameWeightTextBinding; // 0x418 (24)
	struct FText TemporalAASamplesTextBinding; // 0x430 (24)
	struct FText TonemapperSharpenTextBinding; // 0x448 (24)
	float TemporalAAFilterSizeValue; // 0x460 (4)
	float TemporalAACurrentFrameWeightValue; // 0x464 (4)
	int32_t TemporalAASamplesValue; // 0x468 (4)
	float TonemapperSharpenValue; // 0x46C (4)
	struct FName TempKey; // 0x470 (8)
	struct TMap<struct FName, struct FString> Temp; // 0x478 (80)
	enum class ESettingType Type; // 0x4C8 (1)
	float TempValue2; // 0x4CC (4)
	char IsOnDebugVehicle : 0; // 0x4D0 (1)

	struct UWidget Generate Combobox Widget Item(struct FString Item); // Function DevWidget.DevWidget_C.Generate Combobox Widget Item(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void Refresh Slider Time Dilation(float Value); // Function DevWidget.DevWidget_C.Refresh Slider Time Dilation(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void Refresh Pause Game(char InIsChecked); // Function DevWidget.DevWidget_C.Refresh Pause Game(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void Construct(); // Function DevWidget.DevWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
