// WidgetBlueprintGeneratedClass DevWidget.DevWidget_C
struct UDevWidget_C : UBravoHotelSettingSubWidget {
	struct Unknown UberGraphFrame; //  0x298 Size(8)
	struct Unknown ButtonClearStats; //  0x2a0 Size(8)
	struct Unknown ButtonDebugVehicle; //  0x2a8 Size(8)
	struct Unknown ButtonEngine; //  0x2b0 Size(8)
	struct Unknown ButtonFPS; //  0x2b8 Size(8)
	struct Unknown ButtonGameplayTick; //  0x2c0 Size(8)
	struct Unknown ButtonMemory; //  0x2c8 Size(8)
	struct Unknown ButtonNetwork; //  0x2d0 Size(8)
	struct Unknown ButtonParticles; //  0x2d8 Size(8)
	struct Unknown ButtonSceneRendering; //  0x2e0 Size(8)
	struct Unknown ButtonStatSlow; //  0x2e8 Size(8)
	struct Unknown ButtonUnitGraph; //  0x2f0 Size(8)
	struct Unknown ComboBoxViewModes; //  0x2f8 Size(8)
	struct Unknown ComboBoxViewModes1; //  0x300 Size(8)
	struct Unknown DeleteSettingsSaveFile; //  0x308 Size(8)
	struct Unknown GameSpeed; //  0x310 Size(8)
	struct Unknown GameSpeedEdit; //  0x318 Size(8)
	struct Unknown HorizontalBox_8; //  0x320 Size(8)
	struct Unknown HorizontalBox_9; //  0x328 Size(8)
	struct Unknown HorizontalBox_10; //  0x330 Size(8)
	struct Unknown HorizontalBox_11; //  0x338 Size(8)
	struct Unknown HorizontalBox_12; //  0x340 Size(8)
	struct Unknown HorizontalBox_13; //  0x348 Size(8)
	struct Unknown PauseGame; //  0x350 Size(8)
	struct Unknown TemporalAACatmullRomCheck; //  0x358 Size(8)
	struct Unknown TemporalAACurrentFrameWeightEdi; //  0x360 Size(8)
	struct Unknown TemporalAAFilterSizeEdit; //  0x368 Size(8)
	struct Unknown TemporalAAPauseCorrectChek; //  0x370 Size(8)
	struct Unknown TemporalAASamplesEdit; //  0x378 Size(8)
	struct Unknown TonemapperSharpenEdit; //  0x380 Size(8)
	struct Unknown ToolTip_DeleteSettings; //  0x388 Size(8)
	struct Unknown ToolTip_GameSpeed; //  0x390 Size(8)
	struct Unknown ToolTip_PauseGame; //  0x398 Size(8)
	struct Unknown ToolTip_StatCommands; //  0x3a0 Size(8)
	struct Unknown ToolTip_ViewModes; //  0x3a8 Size(8)
	struct Unknown ToolTip_ViewModes_2; //  0x3b0 Size(8)
	struct Unknown Game; //  0x3b8 Size(8)
	float Time; //  0x3c0 Size(4)
	struct FText Time; //  0x3c8 Size(18)
	struct FMulticastInlineDelegate Settings; //  0x3e0 Size(10)
	struct FMulticastInlineDelegate Pause; //  0x3f0 Size(10)
	struct FText TemporalAAFilterSizeTextBinding; //  0x400 Size(18)
	struct FText TemporalAACurrentFrameWeightTextBinding; //  0x418 Size(18)
	struct FText TemporalAASamplesTextBinding; //  0x430 Size(18)
	struct FText TonemapperSharpenTextBinding; //  0x448 Size(18)
	float TemporalAAFilterSizeValue; //  0x460 Size(4)
	float TemporalAACurrentFrameWeightValue; //  0x464 Size(4)
	int32_t TemporalAASamplesValue; //  0x468 Size(4)
	float TonemapperSharpenValue; //  0x46c Size(4)
	struct FName TempKey; //  0x470 Size(8)
	struct TMap<{}, {}>Unknown Temp; //  0x478 Size(50)
	enum class Unknow Type; //  0x4c8 Size(1)
	float TempValue2; //  0x4cc Size(4)
	char IsOn; //  0x4d0 Size(1)

	struct Unknown Generate(struct FString Item); // Function DevWidget.DevWidget_C.Generate(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

