// Enum Engine.ETextGender
enum class ETextGender : uint8 {
	ETextGender = 0
	ETextGender = 1
	ETextGender = 2
	ETextGender = 3
};

// Enum Engine.EFormatArgumentType
enum class EFormatArgumentType : uint8 {
	EFormatArgumentType = 0
	EFormatArgumentType = 1
	EFormatArgumentType = 2
	EFormatArgumentType = 3
	EFormatArgumentType = 4
	EFormatArgumentType = 5
	EFormatArgumentType = 6
};

// Enum Engine.EEndPlayReason
enum class EEndPlayReason : uint8 {
	EEndPlayReason = 0
	EEndPlayReason = 1
	EEndPlayReason = 2
	EEndPlayReason = 3
	EEndPlayReason = 4
	EEndPlayReason = 5
};

// Enum Engine.ETickingGroup
enum class ETickingGroup : uint8 {
	TG_PrePhysics = 0
	TG_StartPhysics = 1
	TG_DuringPhysics = 2
	TG_EndPhysics = 3
	TG_PostPhysics = 4
	TG_PostUpdateWork = 5
	TG_LastDemotable = 6
	TG_NewlySpawned = 7
	TG_MAX = 8
};

// Enum Engine.EComponentCreationMethod
enum class EComponentCreationMethod : uint8 {
	EComponentCreationMethod = 0
	EComponentCreationMethod = 1
	EComponentCreationMethod = 2
	EComponentCreationMethod = 3
	EComponentCreationMethod = 4
};

// Enum Engine.ETemperatureSeverityType
enum class ETemperatureSeverityType : uint8 {
	ETemperatureSeverityType = 0
	ETemperatureSeverityType = 1
	ETemperatureSeverityType = 2
	ETemperatureSeverityType = 3
	ETemperatureSeverityType = 4
	ETemperatureSeverityType = 5
	ETemperatureSeverityType = 6
};

// Enum Engine.EPlaneConstraintAxisSetting
enum class EPlaneConstraintAxisSetting : uint8 {
	EPlaneConstraintAxisSetting = 0
	EPlaneConstraintAxisSetting = 1
	EPlaneConstraintAxisSetting = 2
	EPlaneConstraintAxisSetting = 3
	EPlaneConstraintAxisSetting = 4
	EPlaneConstraintAxisSetting = 5
};

// Enum Engine.EInterpToBehaviourType
enum class EInterpToBehaviourType : uint8 {
	EInterpToBehaviourType = 0
	EInterpToBehaviourType = 1
	EInterpToBehaviourType = 2
	EInterpToBehaviourType = 3
	EInterpToBehaviourType = 4
};

// Enum Engine.ETeleportType
enum class ETeleportType : uint8 {
	ETeleportType = 0
	ETeleportType = 1
	ETeleportType = 2
	ETeleportType = 3
};

// Enum Engine.EPlatformInterfaceDataType
enum class EPlatformInterfaceDataType : uint8 {
	PIDT_None = 0
	PIDT_Int = 1
	PIDT_Float = 2
	PIDT_String = 3
	PIDT_Object = 4
	PIDT_Custom = 5
	PIDT_MAX = 6
};

// Enum Engine.EMovementMode
enum class EMovementMode : uint8 {
	MOVE_None = 0
	MOVE_Walking = 1
	MOVE_NavWalking = 2
	MOVE_Falling = 3
	MOVE_Swimming = 4
	MOVE_Flying = 5
	MOVE_Custom = 6
	MOVE_MAX = 7
};

// Enum Engine.ENetworkFailure
enum class ENetworkFailure : uint8 {
	ENetworkFailure = 0
	ENetworkFailure = 1
	ENetworkFailure = 2
	ENetworkFailure = 3
	ENetworkFailure = 4
	ENetworkFailure = 5
	ENetworkFailure = 6
	ENetworkFailure = 7
	ENetworkFailure = 8
	ENetworkFailure = 9
	ENetworkFailure = 10
	ENetworkFailure = 11
	ENetworkFailure = 12
	ENetworkFailure = 13
};

// Enum Engine.ETravelFailure
enum class ETravelFailure : uint8 {
	ETravelFailure = 0
	ETravelFailure = 1
	ETravelFailure = 2
	ETravelFailure = 3
	ETravelFailure = 4
	ETravelFailure = 5
	ETravelFailure = 6
	ETravelFailure = 7
	ETravelFailure = 8
	ETravelFailure = 9
	ETravelFailure = 10
	ETravelFailure = 11
	ETravelFailure = 12
};

// Enum Engine.EScreenOrientation
enum class EScreenOrientation : uint8 {
	EScreenOrientation = 0
	EScreenOrientation = 1
	EScreenOrientation = 2
	EScreenOrientation = 3
	EScreenOrientation = 4
	EScreenOrientation = 5
	EScreenOrientation = 6
	EScreenOrientation = 7
};

// Enum Engine.EApplicationState
enum class EApplicationState : uint8 {
	EApplicationState = 0
	EApplicationState = 1
	EApplicationState = 2
	EApplicationState = 3
	EApplicationState = 4
};

// Enum Engine.EObjectTypeQuery
enum class EObjectTypeQuery : uint8 {
	ObjectTypeQuery1 = 0
	ObjectTypeQuery2 = 1
	ObjectTypeQuery3 = 2
	ObjectTypeQuery4 = 3
	ObjectTypeQuery5 = 4
	ObjectTypeQuery6 = 5
	ObjectTypeQuery7 = 6
	ObjectTypeQuery8 = 7
	ObjectTypeQuery9 = 8
	ObjectTypeQuery10 = 9
	ObjectTypeQuery11 = 10
	ObjectTypeQuery12 = 11
	ObjectTypeQuery13 = 12
	ObjectTypeQuery14 = 13
	ObjectTypeQuery15 = 14
	ObjectTypeQuery16 = 15
	ObjectTypeQuery17 = 16
	ObjectTypeQuery18 = 17
	ObjectTypeQuery19 = 18
	ObjectTypeQuery20 = 19
	ObjectTypeQuery21 = 20
	ObjectTypeQuery22 = 21
	ObjectTypeQuery23 = 22
	ObjectTypeQuery24 = 23
	ObjectTypeQuery25 = 24
	ObjectTypeQuery26 = 25
	ObjectTypeQuery27 = 26
	ObjectTypeQuery28 = 27
	ObjectTypeQuery29 = 28
	ObjectTypeQuery30 = 29
	ObjectTypeQuery31 = 30
	ObjectTypeQuery32 = 31
	ObjectTypeQuery_MAX = 32
	EObjectTypeQuery_MAX = 33
};

// Enum Engine.EDrawDebugTrace
enum class EDrawDebugTrace : uint8 {
	EDrawDebugTrace = 0
	EDrawDebugTrace = 1
	EDrawDebugTrace = 2
	EDrawDebugTrace = 3
	EDrawDebugTrace = 4
};

// Enum Engine.ETraceTypeQuery
enum class ETraceTypeQuery : uint8 {
	TraceTypeQuery1 = 0
	TraceTypeQuery2 = 1
	TraceTypeQuery3 = 2
	TraceTypeQuery4 = 3
	TraceTypeQuery5 = 4
	TraceTypeQuery6 = 5
	TraceTypeQuery7 = 6
	TraceTypeQuery8 = 7
	TraceTypeQuery9 = 8
	TraceTypeQuery10 = 9
	TraceTypeQuery11 = 10
	TraceTypeQuery12 = 11
	TraceTypeQuery13 = 12
	TraceTypeQuery14 = 13
	TraceTypeQuery15 = 14
	TraceTypeQuery16 = 15
	TraceTypeQuery17 = 16
	TraceTypeQuery18 = 17
	TraceTypeQuery19 = 18
	TraceTypeQuery20 = 19
	TraceTypeQuery21 = 20
	TraceTypeQuery22 = 21
	TraceTypeQuery23 = 22
	TraceTypeQuery24 = 23
	TraceTypeQuery25 = 24
	TraceTypeQuery26 = 25
	TraceTypeQuery27 = 26
	TraceTypeQuery28 = 27
	TraceTypeQuery29 = 28
	TraceTypeQuery30 = 29
	TraceTypeQuery31 = 30
	TraceTypeQuery32 = 31
	TraceTypeQuery_MAX = 32
	ETraceTypeQuery_MAX = 33
};

// Enum Engine.EMoveComponentAction
enum class EMoveComponentAction : uint8 {
	EMoveComponentAction = 0
	EMoveComponentAction = 1
	EMoveComponentAction = 2
	EMoveComponentAction = 3
};

// Enum Engine.EQuitPreference
enum class EQuitPreference : uint8 {
	EQuitPreference = 0
	EQuitPreference = 1
	EQuitPreference = 2
};

// Enum Engine.EMKReplaySampling
enum class EMKReplaySampling : uint8 {
	EMKReplaySampling = 0
	EMKReplaySampling = 1
	EMKReplaySampling = 2
	EMKReplaySampling = 3
	EMKReplaySampling = 4
	EMKReplaySampling = 5
};

// Enum Engine.ENetRole
enum class ENetRole : uint8 {
	ROLE_None = 0
	ROLE_SimulatedProxy = 1
	ROLE_AutonomousProxy = 2
	ROLE_Authority = 3
	ROLE_MAX = 4
};

// Enum Engine.EAttachLocation
enum class EAttachLocation : uint8 {
	EAttachLocation = 0
	EAttachLocation = 1
	EAttachLocation = 2
	EAttachLocation = 3
	EAttachLocation = 4
};

// Enum Engine.EAttachmentRule
enum class EAttachmentRule : uint8 {
	EAttachmentRule = 0
	EAttachmentRule = 1
	EAttachmentRule = 2
	EAttachmentRule = 3
};

// Enum Engine.EDetachmentRule
enum class EDetachmentRule : uint8 {
	EDetachmentRule = 0
	EDetachmentRule = 1
	EDetachmentRule = 2
};

// Enum Engine.ENetDormancy
enum class ENetDormancy : uint8 {
	DORM_Never = 0
	DORM_Awake = 1
	DORM_DormantAll = 2
	DORM_DormantPartial = 3
	DORM_Initial = 4
	DORM_MAX = 5
};

// Enum Engine.EAutoReceiveInput
enum class EAutoReceiveInput : uint8 {
	EAutoReceiveInput = 0
	EAutoReceiveInput = 1
	EAutoReceiveInput = 2
	EAutoReceiveInput = 3
	EAutoReceiveInput = 4
	EAutoReceiveInput = 5
	EAutoReceiveInput = 6
	EAutoReceiveInput = 7
	EAutoReceiveInput = 8
	EAutoReceiveInput = 9
};

// Enum Engine.ESpawnActorCollisionHandlingMethod
enum class ESpawnActorCollisionHandlingMethod : uint8 {
	ESpawnActorCollisionHandlingMethod = 0
	ESpawnActorCollisionHandlingMethod = 1
	ESpawnActorCollisionHandlingMethod = 2
	ESpawnActorCollisionHandlingMethod = 3
	ESpawnActorCollisionHandlingMethod = 4
	ESpawnActorCollisionHandlingMethod = 5
};

// Enum Engine.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
};

// Enum Engine.EVectorQuantization
enum class EVectorQuantization : uint8 {
	EVectorQuantization = 0
	EVectorQuantization = 1
	EVectorQuantization = 2
	EVectorQuantization = 3
	EVectorQuantization = 4
};

// Enum Engine.EActorUpdateOverlapsMethod
enum class EActorUpdateOverlapsMethod : uint8 {
	EActorUpdateOverlapsMethod = 0
	EActorUpdateOverlapsMethod = 1
	EActorUpdateOverlapsMethod = 2
	EActorUpdateOverlapsMethod = 3
	EActorUpdateOverlapsMethod = 4
};

// Enum Engine.ECameraAnimPlaySpace
enum class ECameraAnimPlaySpace : uint8 {
	ECameraAnimPlaySpace = 0
	ECameraAnimPlaySpace = 1
	ECameraAnimPlaySpace = 2
	ECameraAnimPlaySpace = 3
};

// Enum Engine.EViewTargetBlendFunction
enum class EViewTargetBlendFunction : uint8 {
	VTBlend_Linear = 0
	VTBlend_Cubic = 1
	VTBlend_EaseIn = 2
	VTBlend_EaseOut = 3
	VTBlend_EaseInOut = 4
	VTBlend_MAX = 5
};

// Enum Engine.ETravelType
enum class ETravelType : uint8 {
	T = 0
	T = 1
	T = 2
	T = 3
};

// Enum Engine.ECollisionChannel
enum class ECollisionChannel : uint8 {
	ECC_WorldStatic = 0
	ECC_WorldDynamic = 1
	ECC_Pawn = 2
	ECC_Visibility = 3
	ECC_Camera = 4
	ECC_PhysicsBody = 5
	ECC_Vehicle = 6
	ECC_Destructible = 7
	ECC_EngineTraceChannel1 = 8
	ECC_EngineTraceChannel2 = 9
	ECC_EngineTraceChannel3 = 10
	ECC_EngineTraceChannel4 = 11
	ECC_EngineTraceChannel5 = 12
	ECC_EngineTraceChannel6 = 13
	ECC_GameTraceChannel1 = 14
	ECC_GameTraceChannel2 = 15
	ECC_GameTraceChannel3 = 16
	ECC_GameTraceChannel4 = 17
	ECC_GameTraceChannel5 = 18
	ECC_GameTraceChannel6 = 19
	ECC_GameTraceChannel7 = 20
	ECC_GameTraceChannel8 = 21
	ECC_GameTraceChannel9 = 22
	ECC_GameTraceChannel10 = 23
	ECC_GameTraceChannel11 = 24
	ECC_GameTraceChannel12 = 25
	ECC_GameTraceChannel13 = 26
	ECC_GameTraceChannel14 = 27
	ECC_GameTraceChannel15 = 28
	ECC_GameTraceChannel16 = 29
	ECC_GameTraceChannel17 = 30
	ECC_GameTraceChannel18 = 31
	ECC_OverlapAll_Deprecated = 32
	ECC_MAX = 33
};

// Enum Engine.EControllerAnalogStick
enum class EControllerAnalogStick : uint8 {
	EControllerAnalogStick = 0
	EControllerAnalogStick = 1
	EControllerAnalogStick = 2
};

// Enum Engine.EDynamicForceFeedbackAction
enum class EDynamicForceFeedbackAction : uint8 {
	EDynamicForceFeedbackAction = 0
	EDynamicForceFeedbackAction = 1
	EDynamicForceFeedbackAction = 2
	EDynamicForceFeedbackAction = 3
};

// Enum Engine.ECameraType
enum class ECameraType : uint8 {
	ECameraType = 0
	ECameraType = 1
	ECameraType = 2
};

// Enum Engine.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
};

// Enum Engine.EFractureSoundType
enum class EFractureSoundType : uint8 {
	EFractureSoundType = 0
	EFractureSoundType = 1
	EFractureSoundType = 2
	EFractureSoundType = 3
	EFractureSoundType = 4
	EFractureSoundType = 5
	EFractureSoundType = 6
};

// Enum Engine.EMouseLockMode
enum class EMouseLockMode : uint8 {
	EMouseLockMode = 0
	EMouseLockMode = 1
	EMouseLockMode = 2
	EMouseLockMode = 3
	EMouseLockMode = 4
};

// Enum Engine.EWindowTitleBarMode
enum class EWindowTitleBarMode : uint8 {
	EWindowTitleBarMode = 0
	EWindowTitleBarMode = 1
	EWindowTitleBarMode = 2
};

// Enum Engine.TextureFilter
enum class TextureFilter : uint8 {
	TF_Nearest = 0
	TF_Bilinear = 1
	TF_Trilinear = 2
	TF_Default = 3
	TF_MAX = 4
};

// Enum Engine.EInputEvent
enum class EInputEvent : uint8 {
	IE_Pressed = 0
	IE_Released = 1
	IE_Repeat = 2
	IE_DoubleClick = 3
	IE_Axis = 4
	IE_MAX = 5
};

// Enum Engine.E
enum class E : uint8 {
	RTS_World = 0
	RTS_Actor = 1
	RTS_Component = 2
	RTS_ParentBoneSpace = 3
	RTS_MAX = 4
};

// Enum Engine.EComponentMobility
enum class EComponentMobility : uint8 {
	EComponentMobility = 0
	EComponentMobility = 1
	EComponentMobility = 2
	EComponentMobility = 3
};

// Enum Engine.EDetailMode
enum class EDetailMode : uint8 {
	DM_Low = 0
	DM_Medium = 1
	DM_High = 2
	DM_MAX = 3
};

// Enum Engine.EAutoPossessAI
enum class EAutoPossessAI : uint8 {
	EAutoPossessA = 0
	EAutoPossessA = 1
	EAutoPossessA = 2
	EAutoPossessA = 3
	EAutoPossessA = 4
};

// Enum Engine.ETimelineLengthMode
enum class ETimelineLengthMode : uint8 {
	TL_TimelineLength = 0
	TL_LastKeyFrame = 1
	TL_MAX = 2
};

// Enum Engine.ENetworkSmoothingMode
enum class ENetworkSmoothingMode : uint8 {
	ENetworkSmoothingMode = 0
	ENetworkSmoothingMode = 1
	ENetworkSmoothingMode = 2
	ENetworkSmoothingMode = 3
	ENetworkSmoothingMode = 4
};

// Enum Engine.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
};

// Enum Engine.ETranslucencyType
enum class ETranslucencyType : uint8 {
	ETranslucencyType = 0
	ETranslucencyType = 1
	ETranslucencyType = 2
};

// Enum Engine.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
};

// Enum Engine.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
};

// Enum Engine.EFilmicTonemapperType
enum class EFilmicTonemapperType : uint8 {
	EFilmicTonemapperType = 0
	EFilmicTonemapperType = 1
	EFilmicTonemapperType = 2
	EFilmicTonemapperType = 3
};

// Enum Engine.EAutoExposureMethod
enum class EAutoExposureMethod : uint8 {
	AEM_Histogram = 0
	AEM_Basic = 1
	AEM_Manual = 2
	AEM_MAX = 3
};

// Enum Engine.EBloomMethod
enum class EBloomMethod : uint8 {
	BM_SOG = 0
	BM_FFT = 1
	BM_MAX = 2
};

// Enum Engine.EPhysicalSurface
enum class EPhysicalSurface : uint8 {
	SurfaceType_Default = 0
	SurfaceType1 = 1
	SurfaceType2 = 2
	SurfaceType3 = 3
	SurfaceType4 = 4
	SurfaceType5 = 5
	SurfaceType6 = 6
	SurfaceType7 = 7
	SurfaceType8 = 8
	SurfaceType9 = 9
	SurfaceType10 = 10
	SurfaceType11 = 11
	SurfaceType12 = 12
	SurfaceType13 = 13
	SurfaceType14 = 14
	SurfaceType15 = 15
	SurfaceType16 = 16
	SurfaceType17 = 17
	SurfaceType18 = 18
	SurfaceType19 = 19
	SurfaceType20 = 20
	SurfaceType21 = 21
	SurfaceType22 = 22
	SurfaceType23 = 23
	SurfaceType24 = 24
	SurfaceType25 = 25
	SurfaceType26 = 26
	SurfaceType27 = 27
	SurfaceType28 = 28
	SurfaceType29 = 29
	SurfaceType30 = 30
	SurfaceType31 = 31
	SurfaceType32 = 32
	SurfaceType33 = 33
	SurfaceType34 = 34
	SurfaceType35 = 35
	SurfaceType36 = 36
	SurfaceType37 = 37
	SurfaceType38 = 38
	SurfaceType39 = 39
	SurfaceType40 = 40
	SurfaceType41 = 41
	SurfaceType42 = 42
	SurfaceType43 = 43
	SurfaceType44 = 44
	SurfaceType45 = 45
	SurfaceType46 = 46
	SurfaceType47 = 47
	SurfaceType48 = 48
	SurfaceType49 = 49
	SurfaceType50 = 50
	SurfaceType51 = 51
	SurfaceType52 = 52
	SurfaceType53 = 53
	SurfaceType54 = 54
	SurfaceType55 = 55
	SurfaceType56 = 56
	SurfaceType57 = 57
	SurfaceType58 = 58
	SurfaceType59 = 59
	SurfaceType60 = 60
	SurfaceType61 = 61
	SurfaceType62 = 62
	SurfaceType_Max = 63
	EPhysicalSurface_MAX = 64
};

// Enum Engine.EFastArraySerializerDeltaFlags
enum class EFastArraySerializerDeltaFlags : uint8 {
	EFastArraySerializerDeltaFlags = 0
	EFastArraySerializerDeltaFlags = 1
	EFastArraySerializerDeltaFlags = 2
	EFastArraySerializerDeltaFlags = 4
	EFastArraySerializerDeltaFlags = 5
};

// Enum Engine.E
enum class E : uint8 {
	RIF_Constant = 0
	RIF_Linear = 1
	RIF_MAX = 2
};

// Enum Engine.EBlendMode
enum class EBlendMode : uint8 {
	BLEND_Opaque = 0
	BLEND_Masked = 1
	BLEND_Translucent = 2
	BLEND_Additive = 3
	BLEND_Modulate = 4
	BLEND_AlphaComposite = 5
	BLEND_AlphaHoldout = 6
	BLEND_MAX = 7
};

// Enum Engine.E
enum class E : uint8 {
	RCCE_Cycle = 0
	RCCE_CycleWithOffset = 1
	RCCE_Oscillate = 2
	RCCE_Linear = 3
	RCCE_Constant = 4
	RCCE_None = 5
	RCCE_MAX = 6
};

// Enum Engine.E
enum class E : uint8 {
	RCTWM_WeightedNone = 0
	RCTWM_WeightedArrivt = 1
	RCTWM_WeightedLeave = 2
	RCTWM_WeightedBoth = 3
	RCTWM_MAX = 4
};

// Enum Engine.E
enum class E : uint8 {
	RCTM_Auto = 0
	RCTM_User = 1
	RCTM_Break = 2
	RCTM_None = 3
	RCTM_MAX = 4
};

// Enum Engine.E
enum class E : uint8 {
	RCIM_Linear = 0
	RCIM_Constant = 1
	RCIM_Cubic = 2
	RCIM_None = 3
	RCIM_MAX = 4
};

// Enum Engine.ECollisionEnabled
enum class ECollisionEnabled : uint8 {
	ECollisionEnabled = 0
	ECollisionEnabled = 1
	ECollisionEnabled = 2
	ECollisionEnabled = 3
	ECollisionEnabled = 4
};

// Enum Engine.ECollisionResponse
enum class ECollisionResponse : uint8 {
	ECR_Ignore = 0
	ECR_Overlap = 1
	ECR_Block = 2
	ECR_MAX = 3
};

// Enum Engine.EWalkableSlopeBehav
enum class EWalkableSlopeBehav : uint8 {
	WalkableSlope_Default = 0
	WalkableSlope_Increase = 1
	WalkableSlope_Decrease = 2
	WalkableSlope_Unwalkable = 3
	WalkableSlope_Max = 4
};

// Enum Engine.EDOFMode
enum class EDOFMode : uint8 {
	EDOFMode = 0
	EDOFMode = 1
	EDOFMode = 2
	EDOFMode = 3
	EDOFMode = 4
	EDOFMode = 5
	EDOFMode = 6
	EDOFMode = 7
};

// Enum Engine.E
enum class E : uint8 {
	E = 0
	E_256 = 1
	E_2 = 2
	E_3 = 3
	E_5 = 4
	E_9 = 5
	E_17 = 6
	E_33 = 7
	E_65 = 8
	E_129 = 9
	E = 10
};

// Enum Engine.ESleepFamily
enum class ESleepFamily : uint8 {
	ESleepFamily = 0
	ESleepFamily = 1
	ESleepFamily = 2
	ESleepFamily = 3
};

// Enum Engine.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
};

// Enum Engine.ECanBeCharacterBase
enum class ECanBeCharacterBase : uint8 {
	ECB_No = 0
	ECB_Yes = 1
	ECB_Owner = 2
	ECB_MAX = 3
};

// Enum Engine.EHasCustomNavigableGeometry
enum class EHasCustomNavigableGeometry : uint8 {
	EHasCustomNavigableGeometry = 0
	EHasCustomNavigableGeometry = 1
	EHasCustomNavigableGeometry = 2
	EHasCustomNavigableGeometry = 3
	EHasCustomNavigableGeometry = 4
};

// Enum Engine.ELightmapType
enum class ELightmapType : uint8 {
	ELightmapType = 0
	ELightmapType = 1
	ELightmapType = 2
	ELightmapType = 3
};

// Enum Engine.EIndirectLightingCacheQuality
enum class EIndirectLightingCacheQuality : uint8 {
	ILCQ_Off = 0
	ILCQ_Point = 1
	ILCQ_Volume = 2
	ILCQ_MAX = 3
};

// Enum Engine.ESceneDepthPriorityGroup
enum class ESceneDepthPriorityGroup : uint8 {
	SDPG_World = 0
	SDPG_Foreground = 1
	SDPG_MAX = 2
};

// Enum Engine.EAlphaBlendOption
enum class EAlphaBlendOption : uint8 {
	EAlphaBlendOption = 0
	EAlphaBlendOption = 1
	EAlphaBlendOption = 2
	EAlphaBlendOption = 3
	EAlphaBlendOption = 4
	EAlphaBlendOption = 5
	EAlphaBlendOption = 6
	EAlphaBlendOption = 7
	EAlphaBlendOption = 8
	EAlphaBlendOption = 9
	EAlphaBlendOption = 10
	EAlphaBlendOption = 11
	EAlphaBlendOption = 12
	EAlphaBlendOption = 13
	EAlphaBlendOption = 14
	EAlphaBlendOption = 15
};

// Enum Engine.EAnimGroupRole
enum class EAnimGroupRole : uint8 {
	EAnimGroupRole = 0
	EAnimGroupRole = 1
	EAnimGroupRole = 2
	EAnimGroupRole = 3
	EAnimGroupRole = 4
	EAnimGroupRole = 5
};

// Enum Engine.EPreviewAnimationBlueprintApplicationMethod
enum class EPreviewAnimationBlueprintApplicationMethod : uint8 {
	EPreviewAnimationBlueprintApplicationMethod = 0
	EPreviewAnimationBlueprintApplicationMethod = 1
	EPreviewAnimationBlueprintApplicationMethod = 2
};

// Enum Engine.AnimationKeyFormat
enum class AnimationKeyFormat : uint8 {
	AKF_ConstantKeyLerp = 0
	AKF_VariableKeyLerp = 1
	AKF_PerTrackCompression = 2
	AKF_MAX = 3
};

// Enum Engine.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
};

// Enum Engine.EAnimAssetCurveFlags
enum class EAnimAssetCurveFlags : uint8 {
	AACF_NONE = 0
	AACF_DriveMorphTarget_DEPRECATED = 1
	AACF_DriveAttribute_DEPRECATED = 2
	AACF_Editable = 4
	AACF_DriveMaterial_DEPRECATED = 8
	AACF_Metadata = 16
	AACF_DriveTrack = 32
	AACF_Disabled = 64
	AACF_MAX = 65
};

// Enum Engine.AnimationCompressionFormat
enum class AnimationCompressionFormat : uint8 {
	ACF_None = 0
	ACF_Float96NoW = 1
	ACF_Fixed48NoW = 2
	ACF_IntervalFixed32NoW = 3
	ACF_Fixed32NoW = 4
	ACF_Float32NoW = 5
	ACF_Identity = 6
	ACF_MAX = 7
};

// Enum Engine.EAdditiveBasePoseType
enum class EAdditiveBasePoseType : uint8 {
	ABPT_None = 0
	ABPT_RefPose = 1
	ABPT_AnimScaled = 2
	ABPT_AnimFrame = 3
	ABPT_MAX = 4
};

// Enum Engine.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
	E = 4
};

// Enum Engine.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
};

// Enum Engine.EMontagePlayReturnType
enum class EMontagePlayReturnType : uint8 {
	EMontagePlayReturnType = 0
	EMontagePlayReturnType = 1
	EMontagePlayReturnType = 2
};

// Enum Engine.EDrawDebugItemType
enum class EDrawDebugItemType : uint8 {
	EDrawDebugItemType = 0
	EDrawDebugItemType = 1
	EDrawDebugItemType = 2
	EDrawDebugItemType = 3
	EDrawDebugItemType = 4
	EDrawDebugItemType = 5
};

// Enum Engine.EAnimLinkMethod
enum class EAnimLinkMethod : uint8 {
	EAnimLinkMethod = 0
	EAnimLinkMethod = 1
	EAnimLinkMethod = 2
	EAnimLinkMethod = 3
};

// Enum Engine.EMontageSubStepResult
enum class EMontageSubStepResult : uint8 {
	EMontageSubStepResult = 0
	EMontageSubStepResult = 1
	EMontageSubStepResult = 2
	EMontageSubStepResult = 3
	EMontageSubStepResult = 4
};

// Enum Engine.EAnimNotifyEventType
enum class EAnimNotifyEventType : uint8 {
	EAnimNotifyEventType = 0
	EAnimNotifyEventType = 1
	EAnimNotifyEventType = 2
};

// Enum Engine.EInertializationSpace
enum class EInertializationSpace : uint8 {
	EInertializationSpace = 0
	EInertializationSpace = 1
	EInertializationSpace = 2
	EInertializationSpace = 3
};

// Enum Engine.EInertializationBoneState
enum class EInertializationBoneState : uint8 {
	EInertializationBoneState = 0
	EInertializationBoneState = 1
	EInertializationBoneState = 2
	EInertializationBoneState = 3
};

// Enum Engine.EInertializationState
enum class EInertializationState : uint8 {
	EInertializationState = 0
	EInertializationState = 1
	EInertializationState = 2
	EInertializationState = 3
};

// Enum Engine.EEvaluatorMode
enum class EEvaluatorMode : uint8 {
	EEvaluatorMode = 0
	EEvaluatorMode = 1
	EEvaluatorMode = 2
	EEvaluatorMode = 3
};

// Enum Engine.EEvaluatorDataSource
enum class EEvaluatorDataSource : uint8 {
	EEvaluatorDataSource = 0
	EEvaluatorDataSource = 1
	EEvaluatorDataSource = 2
};

// Enum Engine.ECopyType
enum class ECopyType : uint8 {
	ECopyType = 0
	ECopyType = 1
	ECopyType = 2
	ECopyType = 3
	ECopyType = 4
	ECopyType = 5
};

// Enum Engine.EPostCopyOperation
enum class EPostCopyOperation : uint8 {
	EPostCopyOperation = 0
	EPostCopyOperation = 1
	EPostCopyOperation = 2
};

// Enum Engine.EPinHidingMode
enum class EPinHidingMode : uint8 {
	EPinHidingMode = 0
	EPinHidingMode = 1
	EPinHidingMode = 2
	EPinHidingMode = 3
	EPinHidingMode = 4
};

// Enum Engine.AnimPhysCollisionType
enum class AnimPhysCollisionType : uint8 {
	AnimPhysCollisionType = 0
	AnimPhysCollisionType = 1
	AnimPhysCollisionType = 2
	AnimPhysCollisionType = 3
	AnimPhysCollisionType = 4
};

// Enum Engine.AnimPhysTwistAxis
enum class AnimPhysTwistAxis : uint8 {
	AnimPhysTwistAxis = 0
	AnimPhysTwistAxis = 1
	AnimPhysTwistAxis = 2
	AnimPhysTwistAxis = 3
};

// Enum Engine.ETypeAdvanceAnim
enum class ETypeAdvanceAnim : uint8 {
	ETAA_Default = 0
	ETAA_Finished = 1
	ETAA_Looped = 2
	ETAA_MAX = 3
};

// Enum Engine.ETransitionLogicType
enum class ETransitionLogicType : uint8 {
	ETransitionLogicType = 0
	ETransitionLogicType = 1
	ETransitionLogicType = 2
	ETransitionLogicType = 3
};

// Enum Engine.ETransitionBlendMode
enum class ETransitionBlendMode : uint8 {
	ETransitionBlendMode = 0
	ETransitionBlendMode = 1
	ETransitionBlendMode = 2
};

// Enum Engine.EComponentType
enum class EComponentType : uint8 {
	EComponentType = 0
	EComponentType = 1
	EComponentType = 2
	EComponentType = 3
	EComponentType = 4
	EComponentType = 5
	EComponentType = 6
	EComponentType = 7
	EComponentType = 8
	EComponentType = 9
	EComponentType = 10
	EComponentType = 11
};

// Enum Engine.EAxisOption
enum class EAxisOption : uint8 {
	EAxisOption = 0
	EAxisOption = 1
	EAxisOption = 2
	EAxisOption = 3
	EAxisOption = 4
	EAxisOption = 5
	EAxisOption = 6
	EAxisOption = 7
};

// Enum Engine.EAnimInterpolationType
enum class EAnimInterpolationType : uint8 {
	EAnimInterpolationType = 0
	EAnimInterpolationType = 1
	EAnimInterpolationType = 2
};

// Enum Engine.ECurveBlendOption
enum class ECurveBlendOption : uint8 {
	ECurveBlendOption = 0
	ECurveBlendOption = 1
	ECurveBlendOption = 2
	ECurveBlendOption = 3
	ECurveBlendOption = 4
	ECurveBlendOption = 5
	ECurveBlendOption = 6
	ECurveBlendOption = 7
};

// Enum Engine.EAdditiveAnimationType
enum class EAdditiveAnimationType : uint8 {
	AAT_None = 0
	AAT_LocalSpaceBase = 1
	AAT_RotationOffsetMeshSpace = 2
	AAT_MAX = 3
};

// Enum Engine.ENotifyFilterType
enum class ENotifyFilterType : uint8 {
	ENotifyFilterType = 0
	ENotifyFilterType = 1
	ENotifyFilterType = 2
};

// Enum Engine.EMontageNotifyTickType
enum class EMontageNotifyTickType : uint8 {
	EMontageNotifyTickType = 0
	EMontageNotifyTickType = 1
	EMontageNotifyTickType = 2
};

// Enum Engine.EBoneRotationSource
enum class EBoneRotationSource : uint8 {
	B = 0
	B = 1
	B = 2
	B = 3
};

// Enum Engine.EBoneControlSpace
enum class EBoneControlSpace : uint8 {
	BCS_WorldSpace = 0
	BCS_ComponentSpace = 1
	BCS_ParentBoneSpace = 2
	BCS_BoneSpace = 3
	BCS_MAX = 4
};

// Enum Engine.EBoneAxis
enum class EBoneAxis : uint8 {
	BA_X = 0
	BA_Y = 1
	BA_Z = 2
	BA_MAX = 3
};

// Enum Engine.EPrimaryAssetCookRule
enum class EPrimaryAssetCookRule : uint8 {
	EPrimaryAssetCookRule = 0
	EPrimaryAssetCookRule = 1
	EPrimaryAssetCookRule = 2
	EPrimaryAssetCookRule = 3
	EPrimaryAssetCookRule = 4
	EPrimaryAssetCookRule = 5
};

// Enum Engine.ENaturalSoundFalloffMode
enum class ENaturalSoundFalloffMode : uint8 {
	ENaturalSoundFalloffMode = 0
	ENaturalSoundFalloffMode = 1
	ENaturalSoundFalloffMode = 2
	ENaturalSoundFalloffMode = 3
};

// Enum Engine.EAttenuationShape
enum class EAttenuationShape : uint8 {
	EAttenuationShape = 0
	EAttenuationShape = 1
	EAttenuationShape = 2
	EAttenuationShape = 3
	EAttenuationShape = 4
};

// Enum Engine.EAttenuationDistanceModel
enum class EAttenuationDistanceModel : uint8 {
	EAttenuationDistanceModel = 0
	EAttenuationDistanceModel = 1
	EAttenuationDistanceModel = 2
	EAttenuationDistanceModel = 3
	EAttenuationDistanceModel = 4
	EAttenuationDistanceModel = 5
	EAttenuationDistanceModel = 6
};

// Enum Engine.EAudioFaderCurve
enum class EAudioFaderCurve : uint8 {
	EAudioFaderCurve = 0
	EAudioFaderCurve = 1
	EAudioFaderCurve = 2
	EAudioFaderCurve = 3
	EAudioFaderCurve = 4
	EAudioFaderCurve = 5
};

// Enum Engine.EAudioComponentPlayState
enum class EAudioComponentPlayState : uint8 {
	EAudioComponentPlayState = 0
	EAudioComponentPlayState = 1
	EAudioComponentPlayState = 2
	EAudioComponentPlayState = 3
	EAudioComponentPlayState = 4
	EAudioComponentPlayState = 5
	EAudioComponentPlayState = 6
};

// Enum Engine.EAudioOutputTarget
enum class EAudioOutputTarget : uint8 {
	EAudioOutputTarget = 0
	EAudioOutputTarget = 1
	EAudioOutputTarget = 2
	EAudioOutputTarget = 3
};

// Enum Engine.EMonoChannelUpmixMethod
enum class EMonoChannelUpmixMethod : uint8 {
	EMonoChannelUpmixMethod = 0
	EMonoChannelUpmixMethod = 1
	EMonoChannelUpmixMethod = 2
	EMonoChannelUpmixMethod = 3
};

// Enum Engine.EPanningMethod
enum class EPanningMethod : uint8 {
	EPanningMethod = 0
	EPanningMethod = 1
	EPanningMethod = 2
};

// Enum Engine.EVoiceSampleRate
enum class EVoiceSampleRate : int32 {
	EVoiceSampleRate = 16000
	EVoiceSampleRate = 24000
	EVoiceSampleRate = 24001
};

// Enum Engine.EBlendableLocation
enum class EBlendableLocation : uint8 {
	BL_AfterTonemapping = 0
	BL_BeforeTonemapping = 1
	BL_BeforeTranslucency = 2
	BL_ReplacingTonemapper = 3
	BL_SSRInput = 4
	BL_MAX = 5
};

// Enum Engine.ENotifyTriggerMode
enum class ENotifyTriggerMode : uint8 {
	ENotifyTriggerMode = 0
	ENotifyTriggerMode = 1
	ENotifyTriggerMode = 2
	ENotifyTriggerMode = 3
};

// Enum Engine.EBlendSpaceAxis
enum class EBlendSpaceAxis : uint8 {
	BSA_None = 0
	BSA_X = 1
	BSA_Y = 2
	BSA_Max = 3
};

// Enum Engine.EBlueprintNativizationFlag
enum class EBlueprintNativizationFlag : uint8 {
	EBlueprintNativizationFlag = 0
	EBlueprintNativizationFlag = 1
	EBlueprintNativizationFlag = 2
	EBlueprintNativizationFlag = 3
};

// Enum Engine.EBlueprintCompileMode
enum class EBlueprintCompileMode : uint8 {
	EBlueprintCompileMode = 0
	EBlueprintCompileMode = 1
	EBlueprintCompileMode = 2
	EBlueprintCompileMode = 3
};

// Enum Engine.EBlueprintType
enum class EBlueprintType : uint8 {
	BPTYPE_Normal = 0
	BPTYPE_Const = 1
	BPTYPE_MacroLibrary = 2
	BPTYPE_Interface = 3
	BPTYPE_LevelScript = 4
	BPTYPE_FunctionLibrary = 5
	BPTYPE_MAX = 6
};

// Enum Engine.EBlueprintStatus
enum class EBlueprintStatus : uint8 {
	BS_Unknown = 0
	BS_Dirty = 1
	BS_Error = 2
	BS_UpToDate = 3
	BS_BeingCreated = 4
	BS_UpToDateWithWarnings = 5
	BS_MAX = 6
};

// Enum Engine.EBodyCollisionResponse
enum class EBodyCollisionResponse : uint8 {
	EBodyCollisionResponse = 0
	EBodyCollisionResponse = 1
	EBodyCollisionResponse = 2
};

// Enum Engine.EPhysicsType
enum class EPhysicsType : uint8 {
	PhysType_Default = 0
	PhysType_Kinematic = 1
	PhysType_Simulated = 2
	PhysType_MAX = 3
};

// Enum Engine.ECollisionTraceFlag
enum class ECollisionTraceFlag : uint8 {
	CTF_UseDefault = 0
	CTF_UseSimpleAndComplex = 1
	CTF_UseSimpleAsComplex = 2
	CTF_UseComplexAsSimple = 3
	CTF_MAX = 4
};

// Enum Engine.EBrushType
enum class EBrushType : uint8 {
	Brush_Default = 0
	Brush_Add = 1
	Brush_Subtract = 2
	Brush_MAX = 3
};

// Enum Engine.ECsgOper
enum class ECsgOper : uint8 {
	CSG_Active = 0
	CSG_Add = 1
	CSG_Subtract = 2
	CSG_Intersect = 3
	CSG_Deintersect = 4
	CSG_None = 5
	CSG_MAX = 6
};

// Enum Engine.EInitialOscillatorOffset
enum class EInitialOscillatorOffset : uint8 {
	EOO_OffsetRandom = 0
	EOO_OffsetZero = 1
	EOO_MAX = 2
};

// Enum Engine.EOscillatorWaveform
enum class EOscillatorWaveform : uint8 {
	EOscillatorWaveform = 0
	EOscillatorWaveform = 1
	EOscillatorWaveform = 2
};

// Enum Engine.ECameraShakeAttenuation
enum class ECameraShakeAttenuation : uint8 {
	ECameraShakeAttenuation = 0
	ECameraShakeAttenuation = 1
	ECameraShakeAttenuation = 2
};

// Enum Engine.ECameraAlphaBlendMode
enum class ECameraAlphaBlendMode : uint8 {
	ECameraAlphaBlendMode = 0
	ECameraAlphaBlendMode = 1
	ECameraAlphaBlendMode = 2
};

// Enum Engine.ECameraProjectionMode
enum class ECameraProjectionMode : uint8 {
	ECameraProjectionMode = 0
	ECameraProjectionMode = 1
	ECameraProjectionMode = 2
};

// Enum Engine.ECloudStorageDelegate
enum class ECloudStorageDelegate : uint8 {
	CSD_KeyValueReadComplete = 0
	CSD_KeyValueWriteComplete = 1
	CSD_ValueChanged = 2
	CSD_DocumentQueryComplete = 3
	CSD_DocumentReadComplete = 4
	CSD_DocumentWriteComplete = 5
	CSD_DocumentConflictDetected = 6
	CSD_MAX = 7
};

// Enum Engine.EAngularDriveMode
enum class EAngularDriveMode : uint8 {
	EAngularDriveMode = 0
	EAngularDriveMode = 1
	EAngularDriveMode = 2
};

// Enum Engine.ELinearConstraintMotion
enum class ELinearConstraintMotion : uint8 {
	LCM_Free = 0
	LCM_Limited = 1
	LCM_Locked = 2
	LCM_MAX = 3
};

// Enum Engine.ECurveTableMode
enum class ECurveTableMode : uint8 {
	ECurveTableMode = 0
	ECurveTableMode = 1
	ECurveTableMode = 2
	ECurveTableMode = 3
};

// Enum Engine.EEvaluateCurveTableResult
enum class EEvaluateCurveTableResult : uint8 {
	EEvaluateCurveTableResult = 0
	EEvaluateCurveTableResult = 1
	EEvaluateCurveTableResult = 2
};

// Enum Engine.EGrammaticalNumber
enum class EGrammaticalNumber : uint8 {
	EGrammaticalNumber = 0
	EGrammaticalNumber = 1
	EGrammaticalNumber = 2
};

// Enum Engine.EGrammaticalGender
enum class EGrammaticalGender : uint8 {
	EGrammaticalGender = 0
	EGrammaticalGender = 1
	EGrammaticalGender = 2
	EGrammaticalGender = 3
	EGrammaticalGender = 4
};

// Enum Engine.DistributionParamMode
enum class DistributionParamMode : uint8 {
	DPM_Normal = 0
	DPM_Abs = 1
	DPM_Direct = 2
	DPM_MAX = 3
};

// Enum Engine.EDistributionVectorMirrorFlags
enum class EDistributionVectorMirrorFlags : uint8 {
	EDVMF_Same = 0
	EDVMF_Different = 1
	EDVMF_Mirror = 2
	EDVMF_MAX = 3
};

// Enum Engine.EDistributionVectorLockFlags
enum class EDistributionVectorLockFlags : uint8 {
	EDVLF_None = 0
	EDVLF_XY = 1
	EDVLF_XZ = 2
	EDVLF_YZ = 3
	EDVLF_XYZ = 4
	EDVLF_MAX = 5
};

// Enum Engine.ENodeEnabledState
enum class ENodeEnabledState : uint8 {
	ENodeEnabledState = 0
	ENodeEnabledState = 1
	ENodeEnabledState = 2
	ENodeEnabledState = 3
};

// Enum Engine.ENodeAdvancedPins
enum class ENodeAdvancedPins : uint8 {
	ENodeAdvancedPins = 0
	ENodeAdvancedPins = 1
	ENodeAdvancedPins = 2
	ENodeAdvancedPins = 3
};

// Enum Engine.ENodeTitleType
enum class ENodeTitleType : uint8 {
	ENodeTitleType = 0
	ENodeTitleType = 1
	ENodeTitleType = 2
	ENodeTitleType = 3
	ENodeTitleType = 4
	ENodeTitleType = 5
};

// Enum Engine.EPinContainerType
enum class EPinContainerType : uint8 {
	EPinContainerType = 0
	EPinContainerType = 1
	EPinContainerType = 2
	EPinContainerType = 3
	EPinContainerType = 4
};

// Enum Engine.EEdGraphPinDirection
enum class EEdGraphPinDirection : uint8 {
	EGPD_Input = 0
	EGPD_Output = 1
	EGPD_MAX = 2
};

// Enum Engine.EBlueprintPinStyleType
enum class EBlueprintPinStyleType : uint8 {
	BPST_Original = 0
	BPST_VariantA = 1
	BPST_MAX = 2
};

// Enum Engine.ECanCreateConnectionResponse
enum class ECanCreateConnectionResponse : uint8 {
	CONNECT_RESPONSE_MAKE = 0
	CONNECT_RESPONSE_DISALLOW = 1
	CONNECT_RESPONSE_BREAK_OTHERS_A = 2
	CONNECT_RESPONSE_BREAK_OTHERS_B = 3
	CONNECT_RESPONSE_BREAK_OTHERS_AB = 4
	CONNECT_RESPONSE_MAKE_WITH_CONVERSION_NODE = 5
	CONNECT_RESPONSE_MAX = 6
};

// Enum Engine.EGraphType
enum class EGraphType : uint8 {
	GT_Function = 0
	GT_Ubergraph = 1
	GT_Macro = 2
	GT_Animation = 3
	GT_StateMachine = 4
	GT_MAX = 5
};

// Enum Engine.ETransitionType
enum class ETransitionType : uint8 {
	ETransitionType = 0
	ETransitionType = 1
	ETransitionType = 2
	ETransitionType = 3
	ETransitionType = 4
	ETransitionType = 5
	ETransitionType = 6
	ETransitionType = 7
};

// Enum Engine.EFullyLoadPackageType
enum class EFullyLoadPackageType : uint8 {
	FULLYLOAD_Map = 0
	FULLYLOAD_Game_PreLoadClass = 1
	FULLYLOAD_Game_PostLoadClass = 2
	FULLYLOAD_Always = 3
	FULLYLOAD_Mutator = 4
	FULLYLOAD_MAX = 5
};

// Enum Engine.EViewModeIndex
enum class EViewModeIndex : uint8 {
	VMI_BrushWireframe = 0
	VMI_Wireframe = 1
	VMI_Unlit = 2
	VMI_Lit = 3
	VMI_Lit_DetailLighting = 4
	VMI_LightingOnly = 5
	VMI_LightComplexity = 6
	VMI_ShaderComplexity = 8
	VMI_LightmapDensity = 9
	VMI_LitLightmapDensity = 10
	VMI_ReflectionOverride = 11
	VMI_VisualizeBuffer = 12
	VMI_StationaryLightOverlap = 14
	VMI_CollisionPawn = 15
	VMI_CollisionVisibility = 16
	VMI_LODColoration = 18
	VMI_QuadOverdraw = 19
	VMI_PrimitiveDistanceAccuracy = 20
	VMI_MeshUVDensityAccuracy = 21
	VMI_ShaderComplexityWithQuadOverdraw = 22
	VMI_HLODColoration = 23
	VMI_GroupLODColoration = 24
	VMI_MaterialTextureScaleAccuracy = 25
	VMI_RequiredTextureResolution = 26
	VMI_PathTracing = 27
	VMI_RayTracingDebug = 28
	VMI_Max = 29
	VMI_Unknown = 255
};

// Enum Engine.EDemoPlayFailure
enum class EDemoPlayFailure : uint8 {
	EDemoPlayFailure = 0
	EDemoPlayFailure = 1
	EDemoPlayFailure = 2
	EDemoPlayFailure = 3
	EDemoPlayFailure = 4
	EDemoPlayFailure = 5
	EDemoPlayFailure = 6
	EDemoPlayFailure = 7
	EDemoPlayFailure = 8
	EDemoPlayFailure = 9
};

// Enum Engine.ENetworkLagState
enum class ENetworkLagState : uint8 {
	ENetworkLagState = 0
	ENetworkLagState = 1
	ENetworkLagState = 2
};

// Enum Engine.EMouseCaptureMode
enum class EMouseCaptureMode : uint8 {
	EMouseCaptureMode = 0
	EMouseCaptureMode = 1
	EMouseCaptureMode = 2
	EMouseCaptureMode = 3
	EMouseCaptureMode = 4
	EMouseCaptureMode = 5
};

// Enum Engine.ECustomTimeStepSynchronizationState
enum class ECustomTimeStepSynchronizationState : uint8 {
	ECustomTimeStepSynchronizationState = 0
	ECustomTimeStepSynchronizationState = 1
	ECustomTimeStepSynchronizationState = 2
	ECustomTimeStepSynchronizationState = 3
	ECustomTimeStepSynchronizationState = 4
};

// Enum Engine.EMeshBufferAccess
enum class EMeshBufferAccess : uint8 {
	EMeshBufferAccess = 0
	EMeshBufferAccess = 1
	EMeshBufferAccess = 2
};

// Enum Engine.EConstraintFrame
enum class EConstraintFrame : uint8 {
	EConstraintFrame = 0
	EConstraintFrame = 1
	EConstraintFrame = 2
};

// Enum Engine.EAngularConstraintMotion
enum class EAngularConstraintMotion : uint8 {
	ACM_Free = 0
	ACM_Limited = 1
	ACM_Locked = 2
	ACM_MAX = 3
};

// Enum Engine.EComponentSocketType
enum class EComponentSocketType : uint8 {
	EComponentSocketType = 0
	EComponentSocketType = 1
	EComponentSocketType = 2
	EComponentSocketType = 3
};

// Enum Engine.EPhysicalMaterialMaskColor
enum class EPhysicalMaterialMaskColor : uint8 {
	EPhysicalMaterialMaskColor = 0
	EPhysicalMaterialMaskColor = 1
	EPhysicalMaterialMaskColor = 2
	EPhysicalMaterialMaskColor = 3
	EPhysicalMaterialMaskColor = 4
	EPhysicalMaterialMaskColor = 5
	EPhysicalMaterialMaskColor = 6
	EPhysicalMaterialMaskColor = 7
	EPhysicalMaterialMaskColor = 8
};

// Enum Engine.EUpdateRateShiftBucket
enum class EUpdateRateShiftBucket : uint8 {
	EUpdateRateShiftBucket = 0
	EUpdateRateShiftBucket = 1
	EUpdateRateShiftBucket = 2
	EUpdateRateShiftBucket = 3
	EUpdateRateShiftBucket = 4
	EUpdateRateShiftBucket = 5
	EUpdateRateShiftBucket = 6
	EUpdateRateShiftBucket = 7
};

// Enum Engine.EShadowMapFlags
enum class EShadowMapFlags : uint8 {
	SMF_None = 0
	SMF_Streamed = 1
	SMF_MAX = 2
};

// Enum Engine.ELightMapPaddingType
enum class ELightMapPaddingType : uint8 {
	LMPT_NormalPadding = 0
	LMPT_PrePadding = 1
	LMPT_NoPadding = 2
	LMPT_MAX = 3
};

// Enum Engine.ETimelineSigType
enum class ETimelineSigType : uint8 {
	ETS_EventSignature = 0
	ETS_FloatSignature = 1
	ETS_VectorSignature = 2
	ETS_LinearColorSignature = 3
	ETS_InvalidSignature = 4
	ETS_MAX = 5
};

// Enum Engine.EFilterInterpolationType
enum class EFilterInterpolationType : uint8 {
	BSIT_Average = 0
	BSIT_Linear = 1
	BSIT_Cubic = 2
	BSIT_MAX = 3
};

// Enum Engine.EOverlapFilterOption
enum class EOverlapFilterOption : uint8 {
	OverlapFilter_All = 0
	OverlapFilter_DynamicOnly = 1
	OverlapFilter_StaticOnly = 2
	OverlapFilter_MAX = 3
};

// Enum Engine.ELightingBuildQuality
enum class ELightingBuildQuality : uint8 {
	Quality_Preview = 0
	Quality_Medium = 1
	Quality_High = 2
	Quality_Production = 3
	Quality_MAX = 4
};

// Enum Engine.EMaterialStencilCompare
enum class EMaterialStencilCompare : uint8 {
	MSC_Less = 0
	MSC_LessEqual = 1
	MSC_Greater = 2
	MSC_GreaterEqual = 3
	MSC_Equal = 4
	MSC_NotEqual = 5
	MSC_Never = 6
	MSC_Always = 7
	MSC_Count = 8
	MSC_MAX = 9
};

// Enum Engine.EMaterialSamplerType
enum class EMaterialSamplerType : uint8 {
	SAMPLERTYPE_Color = 0
	SAMPLERTYPE_Grayscale = 1
	SAMPLERTYPE_Alpha = 2
	SAMPLERTYPE_Normal = 3
	SAMPLERTYPE_Masks = 4
	SAMPLERTYPE_DistanceFieldFont = 5
	SAMPLERTYPE_LinearColor = 6
	SAMPLERTYPE_LinearGrayscale = 7
	SAMPLERTYPE_Data = 8
	SAMPLERTYPE_External = 9
	SAMPLERTYPE_VirtualColor = 10
	SAMPLERTYPE_VirtualGrayscale = 11
	SAMPLERTYPE_VirtualAlpha = 12
	SAMPLERTYPE_VirtualNormal = 13
	SAMPLERTYPE_VirtualMasks = 14
	SAMPLERTYPE_VirtualLinearColor = 15
	SAMPLERTYPE_VirtualLinearGrayscale = 16
	SAMPLERTYPE_MAX = 17
};

// Enum Engine.EMaterialTessellationMode
enum class EMaterialTessellationMode : uint8 {
	MTM_NoTessellation = 0
	MTM_FlatTessellation = 1
	MTM_PNTriangles = 2
	MTM_MAX = 3
};

// Enum Engine.EMaterialShadingModel
enum class EMaterialShadingModel : uint8 {
	MSM_Unlit = 0
	MSM_DefaultLit = 1
	MSM_Subsurface = 2
	MSM_PreintegratedSkin = 3
	MSM_ClearCoat = 4
	MSM_SubsurfaceProfile = 5
	MSM_TwoSidedFoliage = 6
	MSM_Hair = 7
	MSM_Cloth = 8
	MSM_Eye = 9
	MSM_SingleLayerWater = 10
	MSM_ThinTranslucent = 11
	MSM_Bark = 12
	MSM_NUM = 13
	MSM_FromMaterialExpression = 14
	MSM_MAX = 15
};

// Enum Engine.EParticleCollisionMode
enum class EParticleCollisionMode : uint8 {
	EParticleCollisionMode = 0
	EParticleCollisionMode = 1
	EParticleCollisionMode = 2
};

// Enum Engine.ETrailWidthMode
enum class ETrailWidthMode : uint8 {
	ETrailWidthMode_FromCentre = 0
	ETrailWidthMode_FromFirst = 1
	ETrailWidthMode_FromSecond = 2
	ETrailWidthMode_MAX = 3
};

// Enum Engine.EGBufferFormat
enum class EGBufferFormat : uint8 {
	EGBufferFormat = 0
	EGBufferFormat = 1
	EGBufferFormat = 3
	EGBufferFormat = 5
	EGBufferFormat = 6
};

// Enum Engine.ESceneCaptureCompositeMode
enum class ESceneCaptureCompositeMode : uint8 {
	SCCM_Overwrite = 0
	SCCM_Additive = 1
	SCCM_Composite = 2
	SCCM_MAX = 3
};

// Enum Engine.ESceneCaptureSource
enum class ESceneCaptureSource : uint8 {
	SCS_SceneColorHDR = 0
	SCS_SceneColorHDRNoAlpha = 1
	SCS_FinalColorLDR = 2
	SCS_SceneColorSceneDepth = 3
	SCS_SceneDepth = 4
	SCS_DeviceDepth = 5
	SCS_Normal = 6
	SCS_BaseColor = 7
	SCS_FinalColorHDR = 8
	SCS_FinalToneCurveHDR = 9
	SCS_MAX = 10
};

// Enum Engine.ETranslucentSortPolicy
enum class ETranslucentSortPolicy : uint8 {
	ETranslucentSortPolicy = 0
	ETranslucentSortPolicy = 1
	ETranslucentSortPolicy = 2
	ETranslucentSortPolicy = 3
};

// Enum Engine.E
enum class E : uint8 {
	RM_IndexOfRefraction = 0
	RM_PixelNormalOffset = 1
	RM_MAX = 2
};

// Enum Engine.ETranslucencyLightingMode
enum class ETranslucencyLightingMode : uint8 {
	TLM_VolumetricNonDirectional = 0
	TLM_VolumetricDirectional = 1
	TLM_VolumetricPerVertexNonDirectional = 2
	TLM_VolumetricPerVertexDirectional = 3
	TLM_Surface = 4
	TLM_SurfacePerPixelLighting = 5
	TLM_MAX = 6
};

// Enum Engine.ESamplerSourceMode
enum class ESamplerSourceMode : uint8 {
	SSM_FromTextureAsset = 0
	SSM_Wrap_WorldGroupSettings = 1
	SSM_Clamp_WorldGroupSettings = 2
	SSM_MAX = 3
};

// Enum Engine.EOcclusionCombineMode
enum class EOcclusionCombineMode : uint8 {
	OCM_Minimum = 0
	OCM_Multiply = 1
	OCM_MAX = 2
};

// Enum Engine.EAspectRatioAxisConstraint
enum class EAspectRatioAxisConstraint : uint8 {
	AspectRatio_MaintainYFOV = 0
	AspectRatio_MaintainXFOV = 1
	AspectRatio_MajorAxisFOV = 2
	AspectRatio_MAX = 3
};

// Enum Engine.EFontCacheType
enum class EFontCacheType : uint8 {
	EFontCacheType = 0
	EFontCacheType = 1
	EFontCacheType = 2
};

// Enum Engine.EFontImportCharacterSet
enum class EFontImportCharacterSet : uint8 {
	FontICS_Default = 0
	FontICS_Ansi = 1
	FontICS_Symbol = 2
	FontICS_MAX = 3
};

// Enum Engine.EStandbyType
enum class EStandbyType : uint8 {
	STDBY_Rx = 0
	STDBY_Tx = 1
	STDBY_BadPing = 2
	STDBY_MAX = 3
};

// Enum Engine.ESuggestProjVelocityTraceOption
enum class ESuggestProjVelocityTraceOption : uint8 {
	ESuggestProjVelocityTraceOption = 0
	ESuggestProjVelocityTraceOption = 1
	ESuggestProjVelocityTraceOption = 2
	ESuggestProjVelocityTraceOption = 3
};

// Enum Engine.EWindowMode
enum class EWindowMode : uint8 {
	EWindowMode = 0
	EWindowMode = 1
	EWindowMode = 2
	EWindowMode = 3
};

// Enum Engine.EHitProxyPriority
enum class EHitProxyPriority : uint8 {
	HPP_World = 0
	HPP_Wireframe = 1
	HPP_Foreground = 2
	HPP_UI = 3
	HPP_MAX = 4
};

// Enum Engine.EImportanceWeight
enum class EImportanceWeight : uint8 {
	EImportanceWeight = 0
	EImportanceWeight = 1
	EImportanceWeight = 2
	EImportanceWeight = 3
	EImportanceWeight = 4
	EImportanceWeight = 5
};

// Enum Engine.EAdManagerDelegate
enum class EAdManagerDelegate : uint8 {
	AMD_ClickedBanner = 0
	AMD_UserClosedAd = 1
	AMD_MAX = 2
};

// Enum Engine.EAnimAlphaInputType
enum class EAnimAlphaInputType : uint8 {
	EAnimAlphaInputType = 0
	EAnimAlphaInputType = 1
	EAnimAlphaInputType = 2
	EAnimAlphaInputType = 3
};

// Enum Engine.ETrackActiveCondition
enum class ETrackActiveCondition : uint8 {
	ETAC_Always = 0
	ETAC_GoreEnabled = 1
	ETAC_GoreDisabled = 2
	ETAC_MAX = 3
};

// Enum Engine.EInterpTrackMoveRotMode
enum class EInterpTrackMoveRotMode : uint8 {
	IMR_Keyframed = 0
	IMR_LookAtGroup = 1
	IMR_Ignore = 2
	IMR_MAX = 3
};

// Enum Engine.EInterpMoveAxis
enum class EInterpMoveAxis : uint8 {
	AXIS_TranslationX = 0
	AXIS_TranslationY = 1
	AXIS_TranslationZ = 2
	AXIS_RotationX = 3
	AXIS_RotationY = 4
	AXIS_RotationZ = 5
	AXIS_MAX = 6
};

// Enum Engine.ETrackToggleAction
enum class ETrackToggleAction : uint8 {
	ETTA_Off = 0
	ETTA_On = 1
	ETTA_Toggle = 2
	ETTA_Trigger = 3
	ETTA_MAX = 4
};

// Enum Engine.EVisibilityTrackCondition
enum class EVisibilityTrackCondition : uint8 {
	EVTC_Always = 0
	EVTC_GoreEnabled = 1
	EVTC_GoreDisabled = 2
	EVTC_MAX = 3
};

// Enum Engine.EVisibilityTrackAction
enum class EVisibilityTrackAction : uint8 {
	EVTA_Hide = 0
	EVTA_Show = 1
	EVTA_Toggle = 2
	EVTA_MAX = 3
};

// Enum Engine.ESlateGesture
enum class ESlateGesture : uint8 {
	ESlateGesture = 0
	ESlateGesture = 1
	ESlateGesture = 2
	ESlateGesture = 3
	ESlateGesture = 4
	ESlateGesture = 5
	ESlateGesture = 6
};

// Enum Engine.EMatrixColumns
enum class EMatrixColumns : uint8 {
	EMatrixColumns = 0
	EMatrixColumns = 1
	EMatrixColumns = 2
	EMatrixColumns = 3
	EMatrixColumns = 4
};

// Enum Engine.ELerpInterpolationMode
enum class ELerpInterpolationMode : uint8 {
	ELerpInterpolationMode = 0
	ELerpInterpolationMode = 1
	ELerpInterpolationMode = 2
	ELerpInterpolationMode = 3
};

// Enum Engine.EEasingFunc
enum class EEasingFunc : uint8 {
	EEasingFunc = 0
	EEasingFunc = 1
	EEasingFunc = 2
	EEasingFunc = 3
	EEasingFunc = 4
	EEasingFunc = 5
	EEasingFunc = 6
	EEasingFunc = 7
	EEasingFunc = 8
	EEasingFunc = 9
	EEasingFunc = 10
	EEasingFunc = 11
	EEasingFunc = 12
	EEasingFunc = 13
	EEasingFunc = 14
};

// Enum Engine.E
enum class E : uint8 {
	HalfToEven = 0
	HalfFromZero = 1
	HalfToZero = 2
	FromZero = 3
	ToZero = 4
	ToNegativeInfinity = 5
	ToPositiveInfinity = 6
	E = 7
};

// Enum Engine.EStreamingVolumeUsage
enum class EStreamingVolumeUsage : uint8 {
	SVB_Loading = 0
	SVB_LoadingAndVisibility = 1
	SVB_VisibilityBlockingOnLoad = 2
	SVB_BlockingOnLoad = 3
	SVB_LoadingNotVisible = 4
	SVB_MAX = 5
};

// Enum Engine.EMaterialDecalResponse
enum class EMaterialDecalResponse : uint8 {
	MDR_None = 0
	MDR_ColorNormalRoughness = 1
	MDR_Color = 2
	MDR_ColorNormal = 3
	MDR_ColorRoughness = 4
	MDR_Normal = 5
	MDR_NormalRoughness = 6
	MDR_Roughness = 7
	MDR_MAX = 8
};

// Enum Engine.EDecalBlendMode
enum class EDecalBlendMode : uint8 {
	DBM_Translucent = 0
	DBM_Stain = 1
	DBM_Normal = 2
	DBM_Emissive = 3
	DBM_DBuffer_ColorNormalRoughness = 4
	DBM_DBuffer_Color = 5
	DBM_DBuffer_ColorNormal = 6
	DBM_DBuffer_ColorRoughness = 7
	DBM_DBuffer_Normal = 8
	DBM_DBuffer_NormalRoughness = 9
	DBM_DBuffer_Roughness = 10
	DBM_DBuffer_Emissivs = 11
	DBM_DBuffer_AlphaComposite = 12
	DBM_DBuffer_Emissiv = 13
	DBM_Volumetric_DistanceFunction = 14
	DBM_AlphaComposite = 15
	DBM_AmbientOcclusion = 16
	DBM_MAX = 17
};

// Enum Engine.ETextureColorChannel
enum class ETextureColorChannel : uint8 {
	TCC_Red = 0
	TCC_Green = 1
	TCC_Blue = 2
	TCC_Alpha = 3
	TCC_MAX = 4
};

// Enum Engine.EMaterialAttributeBlend
enum class EMaterialAttributeBlend : uint8 {
	EMaterialAttributeBlend = 0
	EMaterialAttributeBlend = 1
	EMaterialAttributeBlend = 2
	EMaterialAttributeBlend = 3
};

// Enum Engine.EChannelMaskParameterColor
enum class EChannelMaskParameterColor : uint8 {
	EChannelMaskParameterColor = 0
	EChannelMaskParameterColor = 1
	EChannelMaskParameterColor = 2
	EChannelMaskParameterColor = 3
	EChannelMaskParameterColor = 4
};

// Enum Engine.EClampMode
enum class EClampMode : uint8 {
	CMODE_Clamp = 0
	CMODE_ClampMin = 1
	CMODE_ClampMax = 2
	CMODE_MAX = 3
};

// Enum Engine.ECustomMaterialOutputType
enum class ECustomMaterialOutputType : uint8 {
	CMOT_Float1 = 0
	CMOT_Float2 = 1
	CMOT_Float3 = 2
	CMOT_Float4 = 3
	CMOT_MAX = 4
};

// Enum Engine.EDepthOfFieldFunctionValue
enum class EDepthOfFieldFunctionValue : uint8 {
	TDOF_NearAndFarMask = 0
	TDOF_NearMask = 1
	TDOF_FarMask = 2
	TDOF_CircleOfConfusionRadius = 3
	TDOF_MAX = 4
};

// Enum Engine.EFunctionInputType
enum class EFunctionInputType : uint8 {
	FunctionInput_Scalar = 0
	FunctionInput_Vector2 = 1
	FunctionInput_Vector3 = 2
	FunctionInput_Vector4 = 3
	FunctionInput_Texture2D = 4
	FunctionInput_TextureCube = 5
	FunctionInput_Texture2DArray = 6
	FunctionInput_VolumeTexture = 7
	FunctionInput_StaticBool = 8
	FunctionInput_MaterialAttributes = 9
	FunctionInput_TextureExternal = 10
	FunctionInput_MAX = 11
};

// Enum Engine.ENoiseFunction
enum class ENoiseFunction : uint8 {
	NOISEFUNCTION_SimplexTex = 0
	NOISEFUNCTION_GradientTex = 1
	NOISEFUNCTION_GradientTex3D = 2
	NOISEFUNCTION_GradientALU = 3
	NOISEFUNCTION_ValueALU = 4
	NOISEFUNCTION_VoronoiALU = 5
	NOISEFUNCTION_MAX = 6
};

// Enum Engine.E
enum class E : uint8 {
	RVTMVM_None = 0
	RVTMVM_MipLevel = 1
	RVTMVM_MipBias = 2
	RVTMVM_MAX = 3
};

// Enum Engine.EMaterialSceneAttributeInputMode
enum class EMaterialSceneAttributeInputMode : uint8 {
	EMaterialSceneAttributeInputMode = 0
	EMaterialSceneAttributeInputMode = 1
	EMaterialSceneAttributeInputMode = 2
};

// Enum Engine.ESpeedTreeLODType
enum class ESpeedTreeLODType : uint8 {
	STLOD_Pop = 0
	STLOD_Smooth = 1
	STLOD_MAX = 2
};

// Enum Engine.ESpeedTreeWindType
enum class ESpeedTreeWindType : uint8 {
	STW_None = 0
	STW_Fastest = 1
	STW_Fast = 2
	STW_Better = 3
	STW_Best = 4
	STW_Palm = 5
	STW_BestPlus = 6
	STW_MAX = 7
};

// Enum Engine.ESpeedTreeGeometryType
enum class ESpeedTreeGeometryType : uint8 {
	STG_Branch = 0
	STG_Frond = 1
	STG_Leaf = 2
	STG_FacingLeaf = 3
	STG_Billboard = 4
	STG_MAX = 5
};

// Enum Engine.EMaterialExposedTextureProperty
enum class EMaterialExposedTextureProperty : uint8 {
	TMTM_TextureSize = 0
	TMTM_TexelSize = 1
	TMTM_MAX = 2
};

// Enum Engine.ETextureMipValueMode
enum class ETextureMipValueMode : uint8 {
	TMVM_None = 0
	TMVM_MipLevel = 1
	TMVM_MipBias = 2
	TMVM_Derivative = 3
	TMVM_MAX = 4
};

// Enum Engine.EMaterialVectorCoordTransform
enum class EMaterialVectorCoordTransform : uint8 {
	T = 0
	T = 1
	T = 2
	T = 3
	T = 4
	T = 5
	T = 6
};

// Enum Engine.EMaterialVectorCoordTransformSource
enum class EMaterialVectorCoordTransformSource : uint8 {
	T = 0
	T = 1
	T = 2
	T = 3
	T = 4
	T = 5
	T = 6
};

// Enum Engine.EMaterialPositionTransformSource
enum class EMaterialPositionTransformSource : uint8 {
	T = 0
	T = 1
	T = 2
	T = 3
	T = 4
	T = 5
	T = 6
};

// Enum Engine.EVectorNoiseFunction
enum class EVectorNoiseFunction : uint8 {
	VNF_CellnoiseALU = 0
	VNF_VectorALU = 1
	VNF_GradientALU = 2
	VNF_CurlALU = 3
	VNF_VoronoiALU = 4
	VNF_MAX = 5
};

// Enum Engine.EMaterialExposedViewProperty
enum class EMaterialExposedViewProperty : uint8 {
	MEVP_BufferSize = 0
	MEVP_FieldOfView = 1
	MEVP_TanHalfFieldOfView = 2
	MEVP_ViewSize = 3
	MEVP_WorldSpaceViewPosition = 4
	MEVP_WorldSpaceCameraPosition = 5
	MEVP_ViewportOffset = 6
	MEVP_TemporalSampleCount = 7
	MEVP_TemporalSampleIndex = 8
	MEVP_TemporalSampleOffset = 9
	MEVP_RuntimeVirtualTextureOutputLevel = 10
	MEVP_RuntimeVirtualTextureOutputDerivative = 11
	MEVP_PreExposure = 12
	MEVP_MAX = 13
};

// Enum Engine.EWorldPositionIncludedOffsets
enum class EWorldPositionIncludedOffsets : uint8 {
	WPT_Default = 0
	WPT_ExcludeAllShaderOffsets = 1
	WPT_CameraRelative = 2
	WPT_CameraRelativeNoOffsets = 3
	WPT_MAX = 4
};

// Enum Engine.EMaterialFunctionUsage
enum class EMaterialFunctionUsage : uint8 {
	EMaterialFunctionUsage = 0
	EMaterialFunctionUsage = 1
	EMaterialFunctionUsage = 2
	EMaterialFunctionUsage = 3
};

// Enum Engine.EMaterialUsage
enum class EMaterialUsage : uint8 {
	MATUSAGE_SkeletalMesh = 0
	MATUSAGE_ParticleSprites = 1
	MATUSAGE_BeamTrails = 2
	MATUSAGE_MeshParticles = 3
	MATUSAGE_StaticLighting = 4
	MATUSAGE_MorphTargets = 5
	MATUSAGE_SplineMesh = 6
	MATUSAGE_InstancedStaticMeshes = 7
	MATUSAGE_GeometryCollections = 8
	MATUSAGE_Clothing = 9
	MATUSAGE_NiagaraSprites = 10
	MATUSAGE_NiagaraRibbons = 11
	MATUSAGE_NiagaraMeshParticles = 12
	MATUSAGE_GeometryCache = 13
	MATUSAGE_Water = 14
	MATUSAGE_HairStrands = 15
	MATUSAGE_LidarPointCloud = 16
	MATUSAGE_MAX = 17
};

// Enum Engine.EMaterialParameterAssociation
enum class EMaterialParameterAssociation : uint8 {
	LayerParameter = 0
	BlendParameter = 1
	GlobalParameter = 2
	EMaterialParameterAssociation_MAX = 3
};

// Enum Engine.EMaterialMergeType
enum class EMaterialMergeType : uint8 {
	MaterialMergeType_Default = 0
	MaterialMergeType_Simplygon = 1
	MaterialMergeType_MAX = 2
};

// Enum Engine.ETextureSizingType
enum class ETextureSizingType : uint8 {
	TextureSizingType_UseSingleTextureSize = 0
	TextureSizingType_UseAutomaticBiasedSizes = 1
	TextureSizingType_UseManualOverrideTextureSize = 2
	TextureSizingType_UseSimplygonAutomaticSizing = 3
	TextureSizingType_MAX = 4
};

// Enum Engine.ESceneTextureId
enum class ESceneTextureId : uint8 {
	PPI_SceneColor = 0
	PPI_SceneDepth = 1
	PPI_DiffuseColor = 2
	PPI_SpecularColor = 3
	PPI_SubsurfaceColor = 4
	PPI_BaseColor = 5
	PPI_Specular = 6
	PPI_Metallic = 7
	PPI_WorldNormal = 8
	PPI_SeparateTranslucency = 9
	PPI_Opacity = 10
	PPI_Roughness = 11
	PPI_MaterialAO = 12
	PPI_CustomDepth = 13
	PPI_PostProcessInput0 = 14
	PPI_PostProcessInput1 = 15
	PPI_PostProcessInput2 = 16
	PPI_PostProcessInput3 = 17
	PPI_PostProcessInput4 = 18
	PPI_PostProcessInput5 = 19
	PPI_PostProcessInput6 = 20
	PPI_DecalMask = 21
	PPI_ShadingModelColor = 22
	PPI_ShadingModelID = 23
	PPI_AmbientOcclusion = 24
	PPI_CustomStencil = 25
	PPI_StoredBaseColor = 26
	PPI_StoredSpecular = 27
	PPI_Velocity = 28
	PPI_WorldTangent = 29
	PPI_Anisotropy = 30
	PPI_MAX = 31
};

// Enum Engine.EMaterialDomain
enum class EMaterialDomain : uint8 {
	MD_Surface = 0
	MD_DeferredDecal = 1
	MD_LightFunction = 2
	MD_Volume = 3
	MD_PostProcess = 4
	MD_UI = 5
	MD_RuntimeVirtualTexture = 6
	MD_MAX = 7
};

// Enum Engine.EMeshInstancingReplacementMethod
enum class EMeshInstancingReplacementMethod : uint8 {
	EMeshInstancingReplacementMethod = 0
	EMeshInstancingReplacementMethod = 1
	EMeshInstancingReplacementMethod = 2
};

// Enum Engine.EUVOutput
enum class EUVOutput : uint8 {
	EUVOutput = 0
	EUVOutput = 1
	EUVOutput = 2
};

// Enum Engine.EMeshMergeType
enum class EMeshMergeType : uint8 {
	EMeshMergeType = 0
	EMeshMergeType = 1
	EMeshMergeType = 2
};

// Enum Engine.EMeshLODSelectionType
enum class EMeshLODSelectionType : uint8 {
	EMeshLODSelectionType = 0
	EMeshLODSelectionType = 1
	EMeshLODSelectionType = 2
	EMeshLODSelectionType = 3
	EMeshLODSelectionType = 4
};

// Enum Engine.EProxyNormalComputationMethod
enum class EProxyNormalComputationMethod : uint8 {
	EProxyNormalComputationMethod = 0
	EProxyNormalComputationMethod = 1
	EProxyNormalComputationMethod = 2
	EProxyNormalComputationMethod = 3
};

// Enum Engine.ELandscapeCullingPrecision
enum class ELandscapeCullingPrecision : uint8 {
	ELandscapeCullingPrecision = 0
	ELandscapeCullingPrecision = 1
	ELandscapeCullingPrecision = 2
	ELandscapeCullingPrecision = 3
};

// Enum Engine.EStaticMeshReductionTerimationCriterion
enum class EStaticMeshReductionTerimationCriterion : uint8 {
	EStaticMeshReductionTerimationCriterion = 0
	EStaticMeshReductionTerimationCriterion = 1
	EStaticMeshReductionTerimationCriterion = 2
	EStaticMeshReductionTerimationCriterion = 3
};

// Enum Engine.EMeshFeatureImportance
enum class EMeshFeatureImportance : uint8 {
	EMeshFeatureImportance = 0
	EMeshFeatureImportance = 1
	EMeshFeatureImportance = 2
	EMeshFeatureImportance = 3
	EMeshFeatureImportance = 4
	EMeshFeatureImportance = 5
	EMeshFeatureImportance = 6
};

// Enum Engine.EVertexPaintAxis
enum class EVertexPaintAxis : uint8 {
	EVertexPaintAxis = 0
	EVertexPaintAxis = 1
	EVertexPaintAxis = 2
	EVertexPaintAxis = 3
};

// Enum Engine.EMicroTransactionResult
enum class EMicroTransactionResult : uint8 {
	MTR_Succeeded = 0
	MTR_Failed = 1
	MTR_Canceled = 2
	MTR_RestoredFromServer = 3
	MTR_MAX = 4
};

// Enum Engine.EMicroTransactionDelegate
enum class EMicroTransactionDelegate : uint8 {
	MTD_PurchaseQueryComplete = 0
	MTD_PurchaseComplete = 1
	MTD_MAX = 2
};

// Enum Engine.EKillType
enum class EKillType : uint8 {
	EKillType = 0
	EKillType = 1
	EKillType = 2
	EKillType = 3
	EKillType = 4
};

// Enum Engine.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
	E = 4
	E = 5
	E = 6
	E = 7
	E = 8
	E = 9
	E = 10
	E = 11
	E = 12
	E = 13
	E = 14
	E = 15
	E = 16
	E = 17
	E = 18
	E = 19
	E = 20
	E = 21
	E = 22
	E = 23
	E = 24
	E = 25
	E = 26
	E = 27
	E = 28
	E = 29
	E = 30
	E = 31
	E = 32
	E = 33
	E = 34
	E = 35
	E = 36
	E = 37
	E = 38
	E = 39
	E = 40
	E = 41
	E = 42
	E = 43
	E = 44
	E = 45
	E = 46
	E = 47
	E = 48
	E = 49
	E = 50
	E = 51
	E = 52
	E = 53
	E = 54
	E = 55
	E = 56
	E = 57
	E = 58
	E = 59
	E = 60
	E = 61
	E = 62
	E = 63
	E = 64
	E = 65
	E = 66
	E = 67
};

// Enum Engine.FNavigationSystemRunMode
enum class FNavigationSystemRunMode : uint8 {
	FNavigationSystemRunMode = 0
	FNavigationSystemRunMode = 1
	FNavigationSystemRunMode = 2
	FNavigationSystemRunMode = 3
	FNavigationSystemRunMode = 4
	FNavigationSystemRunMode = 5
};

// Enum Engine.ENavigationQueryResult
enum class ENavigationQueryResult : uint8 {
	ENavigationQueryResult = 0
	ENavigationQueryResult = 1
	ENavigationQueryResult = 2
	ENavigationQueryResult = 3
	ENavigationQueryResult = 4
};

// Enum Engine.ENavPathEvent
enum class ENavPathEvent : uint8 {
	ENavPathEvent = 0
	ENavPathEvent = 1
	ENavPathEvent = 2
	ENavPathEvent = 3
	ENavPathEvent = 4
	ENavPathEvent = 5
	ENavPathEvent = 6
	ENavPathEvent = 7
	ENavPathEvent = 8
};

// Enum Engine.ENavDataGatheringModeConfig
enum class ENavDataGatheringModeConfig : uint8 {
	ENavDataGatheringModeConfig = 0
	ENavDataGatheringModeConfig = 1
	ENavDataGatheringModeConfig = 2
	ENavDataGatheringModeConfig = 3
};

// Enum Engine.ENavDataGatheringMode
enum class ENavDataGatheringMode : uint8 {
	ENavDataGatheringMode = 0
	ENavDataGatheringMode = 1
	ENavDataGatheringMode = 2
	ENavDataGatheringMode = 3
};

// Enum Engine.ENavigationOptionFlag
enum class ENavigationOptionFlag : uint8 {
	ENavigationOptionFlag = 0
	ENavigationOptionFlag = 1
	ENavigationOptionFlag = 2
	ENavigationOptionFlag = 3
};

// Enum Engine.ENavLinkDirection
enum class ENavLinkDirection : uint8 {
	ENavLinkDirection = 0
	ENavLinkDirection = 1
	ENavLinkDirection = 2
	ENavLinkDirection = 3
};

// Enum Engine.EEmitterRenderMode
enum class EEmitterRenderMode : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
	E = 4
	E = 5
};

// Enum Engine.EParticleSubUVInterpMethod
enum class EParticleSubUVInterpMethod : uint8 {
	PSUVIM_None = 0
	PSUVIM_Linear = 1
	PSUVIM_Linear_Blend = 2
	PSUVIM_Random = 3
	PSUVIM_Random_Blend = 4
	PSUVIM_MAX = 5
};

// Enum Engine.EParticleBurstMethod
enum class EParticleBurstMethod : uint8 {
	EPBM_Instant = 0
	EPBM_Interpolated = 1
	EPBM_MAX = 2
};

// Enum Engine.EParticleSystemInsignificanceReaction
enum class EParticleSystemInsignificanceReaction : uint8 {
	EParticleSystemInsignificanceReaction = 0
	EParticleSystemInsignificanceReaction = 1
	EParticleSystemInsignificanceReaction = 2
	EParticleSystemInsignificanceReaction = 3
	EParticleSystemInsignificanceReaction = 4
	EParticleSystemInsignificanceReaction = 5
};

// Enum Engine.EParticleSignificanceLevel
enum class EParticleSignificanceLevel : uint8 {
	EParticleSignificanceLevel = 0
	EParticleSignificanceLevel = 1
	EParticleSignificanceLevel = 2
	EParticleSignificanceLevel = 3
	EParticleSignificanceLevel = 4
	EParticleSignificanceLevel = 5
};

// Enum Engine.EParticleDetailMode
enum class EParticleDetailMode : uint8 {
	PDM_Low = 0
	PDM_Medium = 1
	PDM_High = 2
	PDM_MAX = 3
};

// Enum Engine.EParticleSourceSelectionMethod
enum class EParticleSourceSelectionMethod : uint8 {
	EPSSM_Random = 0
	EPSSM_Sequential = 1
	EPSSM_MAX = 2
};

// Enum Engine.EModuleType
enum class EModuleType : uint8 {
	EPMT_General = 0
	EPMT_TypeData = 1
	EPMT_Beam = 2
	EPMT_Trail = 3
	EPMT_Spawn = 4
	EPMT_Required = 5
	EPMT_Event = 6
	EPMT_Light = 7
	EPMT_SubUV = 8
	EPMT_MAX = 9
};

// Enum Engine.EAttractorParticleSelectionMethod
enum class EAttractorParticleSelectionMethod : uint8 {
	EAPSM_Random = 0
	EAPSM_Sequential = 1
	EAPSM_MAX = 2
};

// Enum Engine.Beam2SourceTargetTangentMethod
enum class Beam2SourceTargetTangentMethod : uint8 {
	PEB2STTM_Direct = 0
	PEB2STTM_UserSet = 1
	PEB2STTM_Distribution = 2
	PEB2STTM_Emitter = 3
	PEB2STTM_MAX = 4
};

// Enum Engine.Beam2SourceTargetMethod
enum class Beam2SourceTargetMethod : uint8 {
	PEB2STM_Default = 0
	PEB2STM_UserSet = 1
	PEB2STM_Emitter = 2
	PEB2STM_Particle = 3
	PEB2STM_Actor = 4
	PEB2STM_MAX = 5
};

// Enum Engine.BeamModifierType
enum class BeamModifierType : uint8 {
	PEB2MT_Source = 0
	PEB2MT_Target = 1
	PEB2MT_MAX = 2
};

// Enum Engine.EParticleCameraOffsetUpdateMethod
enum class EParticleCameraOffsetUpdateMethod : uint8 {
	EPCOUM_DirectSet = 0
	EPCOUM_Additive = 1
	EPCOUM_Scalar = 2
	EPCOUM_MAX = 3
};

// Enum Engine.EParticleCollisionComplete
enum class EParticleCollisionComplete : uint8 {
	EPCC_Kill = 0
	EPCC_Freeze = 1
	EPCC_HaltCollisions = 2
	EPCC_FreezeTranslation = 3
	EPCC_FreezeRotation = 4
	EPCC_FreezeMovement = 5
	EPCC_MAX = 6
};

// Enum Engine.EParticleCollisionResponse
enum class EParticleCollisionResponse : uint8 {
	EParticleCollisionResponse = 0
	EParticleCollisionResponse = 1
	EParticleCollisionResponse = 2
	EParticleCollisionResponse = 3
};

// Enum Engine.ELocationBoneSocketSelectionMethod
enum class ELocationBoneSocketSelectionMethod : uint8 {
	BONESOCKETSEL_Sequential = 0
	BONESOCKETSEL_Random = 1
	BONESOCKETSEL_MAX = 2
};

// Enum Engine.ELocationBoneSocketSource
enum class ELocationBoneSocketSource : uint8 {
	BONESOCKETSOURCE_Bones = 0
	BONESOCKETSOURCE_Sockets = 1
	BONESOCKETSOURCE_MAX = 2
};

// Enum Engine.ELocationEmitterSelectionMethod
enum class ELocationEmitterSelectionMethod : uint8 {
	ELESM_Random = 0
	ELESM_Sequential = 1
	ELESM_MAX = 2
};

// Enum Engine.CylinderHeightAxis
enum class CylinderHeightAxis : uint8 {
	PMLPC_HEIGHTAXIS_X = 0
	PMLPC_HEIGHTAXIS_Y = 1
	PMLPC_HEIGHTAXIS_Z = 2
	PMLPC_HEIGHTAXIS_MAX = 3
};

// Enum Engine.ELocationSkelVertSurfaceSource
enum class ELocationSkelVertSurfaceSource : uint8 {
	VERTSURFACESOURCE_Vert = 0
	VERTSURFACESOURCE_Surface = 1
	VERTSURFACESOURCE_MAX = 2
};

// Enum Engine.EOrbitChainMode
enum class EOrbitChainMode : uint8 {
	EOChainMode_Add = 0
	EOChainMode_Scale = 1
	EOChainMode_Link = 2
	EOChainMode_MAX = 3
};

// Enum Engine.EParticleAxisLock
enum class EParticleAxisLock : uint8 {
	EPAL_NONE = 0
	EPAL_X = 1
	EPAL_Y = 2
	EPAL_Z = 3
	EPAL_NEGATIVE_X = 4
	EPAL_NEGATIVE_Y = 5
	EPAL_NEGATIVE_Z = 6
	EPAL_ROTATE_X = 7
	EPAL_ROTATE_Y = 8
	EPAL_ROTATE_Z = 9
	EPAL_MAX = 10
};

// Enum Engine.EEmitterDynamicParameterValue
enum class EEmitterDynamicParameterValue : uint8 {
	EDPV_UserSet = 0
	EDPV_AutoSet = 1
	EDPV_VelocityX = 2
	EDPV_VelocityY = 3
	EDPV_VelocityZ = 4
	EDPV_VelocityMag = 5
	EDPV_MAX = 6
};

// Enum Engine.EEmitterNormalsMode
enum class EEmitterNormalsMode : uint8 {
	ENM_CameraFacing = 0
	ENM_Spherical = 1
	ENM_Cylindrical = 2
	ENM_MAX = 3
};

// Enum Engine.EParticleSortMode
enum class EParticleSortMode : uint8 {
	PSORTMODE_None = 0
	PSORTMODE_ViewProjDepth = 1
	PSORTMODE_DistanceToView = 2
	PSORTMODE_Age_OldestFirst = 3
	PSORTMODE_Age_NewestFirst = 4
	PSORTMODE_MAX = 5
};

// Enum Engine.EParticleUVFlipMode
enum class EParticleUVFlipMode : uint8 {
	EParticleUVFlipMode = 0
	EParticleUVFlipMode = 1
	EParticleUVFlipMode = 2
	EParticleUVFlipMode = 3
	EParticleUVFlipMode = 4
	EParticleUVFlipMode = 5
	EParticleUVFlipMode = 6
	EParticleUVFlipMode = 7
	EParticleUVFlipMode = 8
};

// Enum Engine.ETrail2SourceMethod
enum class ETrail2SourceMethod : uint8 {
	PET2SRCM_Default = 0
	PET2SRCM_Particle = 1
	PET2SRCM_Actor = 2
	PET2SRCM_MAX = 3
};

// Enum Engine.EBeamTaperMethod
enum class EBeamTaperMethod : uint8 {
	PEBTM_None = 0
	PEBTM_Full = 1
	PEBTM_Partial = 2
	PEBTM_MAX = 3
};

// Enum Engine.EBeam2Method
enum class EBeam2Method : uint8 {
	PEB2M_Distance = 0
	PEB2M_Target = 1
	PEB2M_Branch = 2
	PEB2M_MAX = 3
};

// Enum Engine.EMeshCameraFacingOptions
enum class EMeshCameraFacingOptions : uint8 {
	XAxisFacing_NoUp = 0
	XAxisFacing_ZUp = 1
	XAxisFacing_Negativ = 2
	XAxisFacing_YUp = 3
	XAxisFacing_Negativ = 4
	LockedAxis_ZAxisFacing = 5
	LockedAxis_NegativeZAxisFacing = 6
	LockedAxis_YAxisFacing = 7
	LockedAxis_NegativeYAxisFacing = 8
	VelocityAligned_ZAxisFacing = 9
	VelocityAligned_NegativeZAxisFacing = 10
	VelocityAligned_YAxisFacing = 11
	VelocityAligned_NegativeYAxisFacing = 12
	EMeshCameraFacingOptions_MAX = 13
};

// Enum Engine.EMeshCameraFacingUpAxis
enum class EMeshCameraFacingUpAxis : uint8 {
	CameraFacing_NoneUP = 0
	CameraFacing_ZUp = 1
	CameraFacing_NegativeZUp = 2
	CameraFacing_YUp = 3
	CameraFacing_NegativeYUp = 4
	CameraFacing_MAX = 5
};

// Enum Engine.EMeshScreenAlignment
enum class EMeshScreenAlignment : uint8 {
	PSMA_MeshFaceCameraWithRoll = 0
	PSMA_MeshFaceCameraWithSpin = 1
	PSMA_MeshFaceCameraWithLockedAxis = 2
	PSMA_MAX = 3
};

// Enum Engine.ETrailsRenderAxisOption
enum class ETrailsRenderAxisOption : uint8 {
	Trails_CameraUp = 0
	Trails_SourceUp = 1
	Trails_WorldUp = 2
	Trails_MAX = 3
};

// Enum Engine.EParticleScreenAlignment
enum class EParticleScreenAlignment : uint8 {
	PSA_FacingCameraPosition = 0
	PSA_Square = 1
	PSA_Rectangle = 2
	PSA_Velocity = 3
	PSA_AwayFromCenter = 4
	PSA_TypeSpecific = 5
	PSA_FacingCameraDistanceBlend = 6
	PSA_MAX = 7
};

// Enum Engine.EParticleSystemOcclusionBoundsMethod
enum class EParticleSystemOcclusionBoundsMethod : uint8 {
	EPSOBM_None = 0
	EPSOBM_ParticleBounds = 1
	EPSOBM_CustomBounds = 2
	EPSOBM_MAX = 3
};

// Enum Engine.ParticleSystemLODMethod
enum class ParticleSystemLODMethod : uint8 {
	PARTICLESYSTEMLODMETHOD_Automatic = 0
	PARTICLESYSTEMLODMETHOD_DirectSet = 1
	PARTICLESYSTEMLODMETHOD_ActivateAutomatic = 2
	PARTICLESYSTEMLODMETHOD_MAX = 3
};

// Enum Engine.EParticleSystemUpdateMode
enum class EParticleSystemUpdateMode : uint8 {
	EPSUM_RealTime = 0
	EPSUM_FixedTime = 1
	EPSUM_MAX = 2
};

// Enum Engine.EParticleEventType
enum class EParticleEventType : uint8 {
	EPET_Any = 0
	EPET_Spawn = 1
	EPET_Death = 2
	EPET_Collision = 3
	EPET_Burst = 4
	EPET_Blueprint = 5
	EPET_MAX = 6
};

// Enum Engine.ParticleReplayState
enum class ParticleReplayState : uint8 {
	P = 0
	P = 1
	P = 2
	P = 3
};

// Enum Engine.EParticleSysParamType
enum class EParticleSysParamType : uint8 {
	PSPT_None = 0
	PSPT_Scalar = 1
	PSPT_ScalarRand = 2
	PSPT_Vector = 3
	PSPT_VectorRand = 4
	PSPT_Color = 5
	PSPT_Actor = 6
	PSPT_Material = 7
	PSPT_VectorUnitRand = 8
	PSPT_MAX = 9
};

// Enum Engine.ESettingsLockedAxis
enum class ESettingsLockedAxis : uint8 {
	ESettingsLockedAxis = 0
	ESettingsLockedAxis = 1
	ESettingsLockedAxis = 2
	ESettingsLockedAxis = 3
	ESettingsLockedAxis = 4
	ESettingsLockedAxis = 5
};

// Enum Engine.ESettingsDOF
enum class ESettingsDOF : uint8 {
	ESettingsDO = 0
	ESettingsDO = 1
	ESettingsDO = 2
	ESettingsDO = 3
	ESettingsDO = 4
};

// Enum Engine.EFrictionCombineMode
enum class EFrictionCombineMode : uint8 {
	EFrictionCombineMode = 0
	EFrictionCombineMode = 1
	EFrictionCombineMode = 2
	EFrictionCombineMode = 3
};

// Enum Engine.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
};

// Enum Engine.EDefaultBackBufferPixelFormat
enum class EDefaultBackBufferPixelFormat : uint8 {
	EDefaultBackBufferPixelFormat = 0
	EDefaultBackBufferPixelFormat = 1
	EDefaultBackBufferPixelFormat = 2
	EDefaultBackBufferPixelFormat = 3
	EDefaultBackBufferPixelFormat = 4
	EDefaultBackBufferPixelFormat = 5
};

// Enum Engine.EAutoExposureMethodUI
enum class EAutoExposureMethodUI : uint8 {
	EAutoExposureMethodU = 0
	EAutoExposureMethodU = 1
	EAutoExposureMethodU = 2
	EAutoExposureMethodU = 3
};

// Enum Engine.EAlphaChannelMode
enum class EAlphaChannelMode : uint8 {
	EAlphaChannelMode = 0
	EAlphaChannelMode = 1
	EAlphaChannelMode = 2
	EAlphaChannelMode = 3
};

// Enum Engine.EEarlyZPass
enum class EEarlyZPass : uint8 {
	EEarlyZPass = 0
	EEarlyZPass = 1
	EEarlyZPass = 2
	EEarlyZPass = 3
	EEarlyZPass = 4
};

// Enum Engine.ECustomDepthStencil
enum class ECustomDepthStencil : uint8 {
	ECustomDepthStencil = 0
	ECustomDepthStencil = 1
	ECustomDepthStencil = 2
	ECustomDepthStencil = 3
	ECustomDepthStencil = 4
};

// Enum Engine.EMobileMSAASampleCount
enum class EMobileMSAASampleCount : uint8 {
	EMobileMSAASampleCount = 1
	EMobileMSAASampleCount = 2
	EMobileMSAASampleCount = 4
	EMobileMSAASampleCount = 8
	EMobileMSAASampleCount = 9
};

// Enum Engine.ECompositingSampleCount
enum class ECompositingSampleCount : uint8 {
	ECompositingSampleCount = 1
	ECompositingSampleCount = 2
	ECompositingSampleCount = 4
	ECompositingSampleCount = 8
	ECompositingSampleCount = 9
};

// Enum Engine.EClearSceneOptions
enum class EClearSceneOptions : uint8 {
	EClearSceneOptions = 0
	EClearSceneOptions = 1
	EClearSceneOptions = 2
	EClearSceneOptions = 3
};

// Enum Engine.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
};

// Enum Engine.ELegendPosition
enum class ELegendPosition : uint8 {
	ELegendPosition = 0
	ELegendPosition = 1
	ELegendPosition = 2
};

// Enum Engine.EGraphDataStyle
enum class EGraphDataStyle : uint8 {
	EGraphDataStyle = 0
	EGraphDataStyle = 1
	EGraphDataStyle = 2
};

// Enum Engine.EGraphAxisStyle
enum class EGraphAxisStyle : uint8 {
	EGraphAxisStyle = 0
	EGraphAxisStyle = 1
	EGraphAxisStyle = 2
	EGraphAxisStyle = 3
};

// Enum Engine.ReverbPreset
enum class ReverbPreset : uint8 {
	REVERB_Default = 0
	REVERB_Bathroom = 1
	REVERB_StoneRoom = 2
	REVERB_Auditorium = 3
	REVERB_ConcertHall = 4
	REVERB_Cave = 5
	REVERB_Hallway = 6
	REVERB_StoneCorridor = 7
	REVERB_Alley = 8
	REVERB_Forest = 9
	REVERB_City = 10
	REVERB_Mountains = 11
	REVERB_Quarry = 12
	REVERB_Plain = 13
	REVERB_ParkingLot = 14
	REVERB_SewerPipe = 15
	REVERB_Underwater = 16
	REVERB_SmallRoom = 17
	REVERB_MediumRoom = 18
	REVERB_LargeRoom = 19
	REVERB_MediumHall = 20
	REVERB_LargeHall = 21
	REVERB_Plate = 22
	REVERB_MAX = 23
};

// Enum Engine.E
enum class E : uint8 {
	RCKTCF_uint16 = 0
	RCKTCF_float32 = 1
	RCKTCF_MAX = 2
};

// Enum Engine.E
enum class E : uint8 {
	RCCF_Empty = 0
	RCCF_Constant = 1
	RCCF_Linear = 2
	RCCF_Cubic = 3
	RCCF_Mixed = 4
	RCCF_MAX = 5
};

// Enum Engine.EConstraintTransform
enum class EConstraintTransform : uint8 {
	EConstraintTransform = 0
	EConstraintTransform = 1
	EConstraintTransform = 2
};

// Enum Engine.EControlConstraint
enum class EControlConstraint : uint8 {
	EControlConstraint = 0
	EControlConstraint = 1
	EControlConstraint = 2
};

// Enum Engine.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
};

// Enum Engine.E
enum class E : uint8 {
	E = 1
	E = 2
	E = 4
	E = 5
};

// Enum Engine.E
enum class E : uint8 {
	E = 1
	E = 2
	E = 4
	E = 5
};

// Enum Engine.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
};

// Enum Engine.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
	E = 4
	E = 5
	E = 6
	E = 7
};

// Enum Engine.ELightUnits
enum class ELightUnits : uint8 {
	ELightUnits = 0
	ELightUnits = 1
	ELightUnits = 2
	ELightUnits = 3
};

// Enum Engine.EAntiAliasingMethod
enum class EAntiAliasingMethod : uint8 {
	AAM_None = 0
	AAM_FXAA = 1
	AAM_TemporalAA = 2
	AAM_MSAA = 3
	AAM_MAX = 4
};

// Enum Engine.EDepthOfFieldMethod
enum class EDepthOfFieldMethod : uint8 {
	DOFM_BokehDOF = 0
	DOFM_Gaussian = 1
	DOFM_CircleDOF = 2
	DOFM_MAX = 3
};

// Enum Engine.ESceneCapturePrimitiveRenderMode
enum class ESceneCapturePrimitiveRenderMode : uint8 {
	ESceneCapturePrimitiveRenderMode = 0
	ESceneCapturePrimitiveRenderMode = 1
	ESceneCapturePrimitiveRenderMode = 2
	ESceneCapturePrimitiveRenderMode = 3
};

// Enum Engine.EMaterialProperty
enum class EMaterialProperty : uint8 {
	MP_EmissiveColor = 0
	MP_Opacity = 1
	MP_OpacityMask = 2
	MP_DiffuseColor = 3
	MP_SpecularColor = 4
	MP_BaseColor = 5
	MP_Metallic = 6
	MP_Specular = 7
	MP_Roughness = 8
	MP_Anisotropy = 9
	MP_Normal = 10
	MP_Tangent = 11
	MP_WorldPositionOffset = 12
	MP_WorldDisplacement = 13
	MP_TessellationMultiplier = 14
	MP_SubsurfaceColor = 15
	MP_CustomData0 = 16
	MP_CustomData1 = 17
	MP_AmbientOcclusion = 18
	MP_Refraction = 19
	MP_CustomizedUVs0 = 20
	MP_CustomizedUVs1 = 21
	MP_CustomizedUVs2 = 22
	MP_CustomizedUVs3 = 23
	MP_CustomizedUVs4 = 24
	MP_CustomizedUVs5 = 25
	MP_CustomizedUVs6 = 26
	MP_CustomizedUVs7 = 27
	MP_PixelDepthOffset = 28
	MP_ShadingModel = 29
	MP_MaterialAttributes = 30
	MP_CustomOutput = 31
	MP_MAX = 32
};

// Enum Engine.ESkinCacheDefaultBehavior
enum class ESkinCacheDefaultBehavior : uint8 {
	ESkinCacheDefaultBehavior = 0
	ESkinCacheDefaultBehavior = 1
	ESkinCacheDefaultBehavior = 2
};

// Enum Engine.ESkinCacheUsage
enum class ESkinCacheUsage : uint8 {
	ESkinCacheUsage = 0
	ESkinCacheUsage = 255
	ESkinCacheUsage = 1
	ESkinCacheUsage = 256
};

// Enum Engine.EPhysicsTransformUpdateMode
enum class EPhysicsTransformUpdateMode : uint8 {
	EPhysicsTransformUpdateMode = 0
	EPhysicsTransformUpdateMode = 1
	EPhysicsTransformUpdateMode = 2
};

// Enum Engine.EAnimationMode
enum class EAnimationMode : uint8 {
	EAnimationMode = 0
	EAnimationMode = 1
	EAnimationMode = 2
	EAnimationMode = 3
};

// Enum Engine.EKinematicBonesUpdateToPhysics
enum class EKinematicBonesUpdateToPhysics : uint8 {
	EKinematicBonesUpdateToPhysics = 0
	EKinematicBonesUpdateToPhysics = 1
	EKinematicBonesUpdateToPhysics = 2
};

// Enum Engine.EClothMassMode
enum class EClothMassMode : uint8 {
	EClothMassMode = 0
	EClothMassMode = 1
	EClothMassMode = 2
	EClothMassMode = 3
	EClothMassMode = 4
};

// Enum Engine.EAnimCurveType
enum class EAnimCurveType : uint8 {
	EAnimCurveType = 0
	EAnimCurveType = 1
	EAnimCurveType = 2
	EAnimCurveType = 3
	EAnimCurveType = 4
};

// Enum Engine.ESkeletalMeshSkinningImportVersions
enum class ESkeletalMeshSkinningImportVersions : uint8 {
	ESkeletalMeshSkinningImportVersions = 0
	ESkeletalMeshSkinningImportVersions = 1
	ESkeletalMeshSkinningImportVersions = 2
	ESkeletalMeshSkinningImportVersions = 1
	ESkeletalMeshSkinningImportVersions = 3
};

// Enum Engine.ESkeletalMeshGeoImportVersions
enum class ESkeletalMeshGeoImportVersions : uint8 {
	ESkeletalMeshGeoImportVersions = 0
	ESkeletalMeshGeoImportVersions = 1
	ESkeletalMeshGeoImportVersions = 2
	ESkeletalMeshGeoImportVersions = 1
	ESkeletalMeshGeoImportVersions = 3
};

// Enum Engine.EBoneFilterActionOption
enum class EBoneFilterActionOption : uint8 {
	EBoneFilterActionOption = 0
	EBoneFilterActionOption = 1
	EBoneFilterActionOption = 2
	EBoneFilterActionOption = 3
};

// Enum Engine.SkeletalMeshOptimizationImportance
enum class SkeletalMeshOptimizationImportance : uint8 {
	SMOI_Off = 0
	SMOI_Lowest = 1
	SMOI_Low = 2
	SMOI_Normal = 3
	SMOI_High = 4
	SMOI_Highest = 5
	SMOI_MAX = 6
};

// Enum Engine.SkeletalMeshOptimizationType
enum class SkeletalMeshOptimizationType : uint8 {
	SMOT_NumOfTriangles = 0
	SMOT_MaxDeviation = 1
	SMOT_TriangleOrDeviation = 2
	SMOT_MAX = 3
};

// Enum Engine.SkeletalMeshTerminationCriterion
enum class SkeletalMeshTerminationCriterion : uint8 {
	SMTC_NumOfTriangles = 0
	SMTC_NumOfVerts = 1
	SMTC_TriangleOrVert = 2
	SMTC_AbsNumOfTriangles = 3
	SMTC_AbsNumOfVerts = 4
	SMTC_AbsTriangleOrVert = 5
	SMTC_MAX = 6
};

// Enum Engine.EBoneTranslationRetargetingMode
enum class EBoneTranslationRetargetingMode : uint8 {
	EBoneTranslationRetargetingMode = 0
	EBoneTranslationRetargetingMode = 1
	EBoneTranslationRetargetingMode = 2
	EBoneTranslationRetargetingMode = 3
	EBoneTranslationRetargetingMode = 4
	EBoneTranslationRetargetingMode = 5
};

// Enum Engine.EBoneSpaces
enum class EBoneSpaces : uint8 {
	EBoneSpaces = 0
	EBoneSpaces = 1
	EBoneSpaces = 2
};

// Enum Engine.EVisibilityBasedAnimTickOption
enum class EVisibilityBasedAnimTickOption : uint8 {
	EVisibilityBasedAnimTickOption = 0
	EVisibilityBasedAnimTickOption = 1
	EVisibilityBasedAnimTickOption = 2
	EVisibilityBasedAnimTickOption = 3
	EVisibilityBasedAnimTickOption = 4
};

// Enum Engine.EPhysBodyOp
enum class EPhysBodyOp : uint8 {
	PBO_None = 0
	PBO_Term = 1
	PBO_MAX = 2
};

// Enum Engine.EBoneVisibilityStatus
enum class EBoneVisibilityStatus : uint8 {
	BVS_HiddenByParent = 0
	BVS_Visible = 1
	BVS_ExplicitlyHidden = 2
	BVS_MAX = 3
};

// Enum Engine.ESkyAtmosphereTransformMode
enum class ESkyAtmosphereTransformMode : uint8 {
	ESkyAtmosphereTransformMode = 0
	ESkyAtmosphereTransformMode = 1
	ESkyAtmosphereTransformMode = 2
	ESkyAtmosphereTransformMode = 3
};

// Enum Engine.ESpecularOcclusionMode
enum class ESpecularOcclusionMode : uint8 {
	SOM_NonDirectional = 0
	SOM_DirectionalCones = 1
	SOM_Combine = 2
	SOM_Maximum = 3
	SOM_MAX = 4
};

// Enum Engine.ESkyLightSourceType
enum class ESkyLightSourceType : uint8 {
	SLS_CapturedScene = 0
	SLS_SpecifiedCubemap = 1
	SLS_MAX = 2
};

// Enum Engine.EPriorityAttenuationMethod
enum class EPriorityAttenuationMethod : uint8 {
	EPriorityAttenuationMethod = 0
	EPriorityAttenuationMethod = 1
	EPriorityAttenuationMethod = 2
	EPriorityAttenuationMethod = 3
};

// Enum Engine.ESubmixSendMethod
enum class ESubmixSendMethod : uint8 {
	ESubmixSendMethod = 0
	ESubmixSendMethod = 1
	ESubmixSendMethod = 2
	ESubmixSendMethod = 3
};

// Enum Engine.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
};

// Enum Engine.EAirAbsorptionMethod
enum class EAirAbsorptionMethod : uint8 {
	EAirAbsorptionMethod = 0
	EAirAbsorptionMethod = 1
	EAirAbsorptionMethod = 2
};

// Enum Engine.ESoundSpatializationAlgorithm
enum class ESoundSpatializationAlgorithm : uint8 {
	SPATIALIZATION_Default = 0
	SPATIALIZATION_HRTF = 1
	SPATIALIZATION_MAX = 2
};

// Enum Engine.ESoundDistanceCalc
enum class ESoundDistanceCalc : uint8 {
	SOUNDDISTANCE_Normal = 0
	SOUNDDISTANCE_InfiniteXYPlane = 1
	SOUNDDISTANCE_InfiniteXZPlane = 2
	SOUNDDISTANCE_InfiniteYZPlane = 3
	SOUNDDISTANCE_MAX = 4
};

// Enum Engine.EVirtualizationMode
enum class EVirtualizationMode : uint8 {
	EVirtualizationMode = 0
	EVirtualizationMode = 1
	EVirtualizationMode = 2
	EVirtualizationMode = 3
};

// Enum Engine.EMaxConcurrentResolutionRule
enum class EMaxConcurrentResolutionRule : uint8 {
	EMaxConcurrentResolutionRule = 0
	EMaxConcurrentResolutionRule = 1
	EMaxConcurrentResolutionRule = 2
	EMaxConcurrentResolutionRule = 3
	EMaxConcurrentResolutionRule = 4
	EMaxConcurrentResolutionRule = 5
	EMaxConcurrentResolutionRule = 6
	EMaxConcurrentResolutionRule = 7
	EMaxConcurrentResolutionRule = 8
};

// Enum Engine.ESoundGroup
enum class ESoundGroup : uint8 {
	SOUNDGROUP_Default = 0
	SOUNDGROUP_Effects = 1
	SOUNDGROUP_UI = 2
	SOUNDGROUP_Music = 3
	SOUNDGROUP_Voice = 4
	SOUNDGROUP_GameSoundGroup1 = 5
	SOUNDGROUP_GameSoundGroup2 = 6
	SOUNDGROUP_GameSoundGroup3 = 7
	SOUNDGROUP_GameSoundGroup4 = 8
	SOUNDGROUP_GameSoundGroup5 = 9
	SOUNDGROUP_GameSoundGroup6 = 10
	SOUNDGROUP_GameSoundGroup7 = 11
	SOUNDGROUP_GameSoundGroup8 = 12
	SOUNDGROUP_GameSoundGroup9 = 13
	SOUNDGROUP_GameSoundGroup10 = 14
	SOUNDGROUP_GameSoundGroup11 = 15
	SOUNDGROUP_GameSoundGroup12 = 16
	SOUNDGROUP_GameSoundGroup13 = 17
	SOUNDGROUP_GameSoundGroup14 = 18
	SOUNDGROUP_GameSoundGroup15 = 19
	SOUNDGROUP_GameSoundGroup16 = 20
	SOUNDGROUP_GameSoundGroup17 = 21
	SOUNDGROUP_GameSoundGroup18 = 22
	SOUNDGROUP_GameSoundGroup19 = 23
	SOUNDGROUP_GameSoundGroup20 = 24
	SOUNDGROUP_MAX = 25
};

// Enum Engine.ModulationParamMode
enum class ModulationParamMode : uint8 {
	MPM_Normal = 0
	MPM_Abs = 1
	MPM_Direct = 2
	MPM_MAX = 3
};

// Enum Engine.ESourceBusChannels
enum class ESourceBusChannels : uint8 {
	ESourceBusChannels = 0
	ESourceBusChannels = 1
	ESourceBusChannels = 2
};

// Enum Engine.ESourceBusSendLevelControlMethod
enum class ESourceBusSendLevelControlMethod : uint8 {
	ESourceBusSendLevelControlMethod = 0
	ESourceBusSendLevelControlMethod = 1
	ESourceBusSendLevelControlMethod = 2
	ESourceBusSendLevelControlMethod = 3
};

// Enum Engine.ESendLevelControlMethod
enum class ESendLevelControlMethod : uint8 {
	ESendLevelControlMethod = 0
	ESendLevelControlMethod = 1
	ESendLevelControlMethod = 2
	ESendLevelControlMethod = 3
};

// Enum Engine.EAudioRecordingExportType
enum class EAudioRecordingExportType : uint8 {
	EAudioRecordingExportType = 0
	EAudioRecordingExportType = 1
	EAudioRecordingExportType = 2
};

// Enum Engine.ESoundWaveFFTSize
enum class ESoundWaveFFTSize : uint8 {
	ESoundWaveFFTSize_65 = 0
	ESoundWaveFFTSize_257 = 1
	ESoundWaveFFTSize_513 = 2
	ESoundWaveFFTSize_1025 = 3
	ESoundWaveFFTSize_2049 = 4
	ESoundWaveFFTSize = 5
};

// Enum Engine.EDecompressionType
enum class EDecompressionType : uint8 {
	DTYPE_Setup = 0
	DTYPE_Invalid = 1
	DTYPE_Preview = 2
	DTYPE_Native = 3
	DTYPE_RealTime = 4
	DTYPE_Procedural = 5
	DTYPE_Xenon = 6
	DTYPE_Streaming = 7
	DTYPE_MAX = 8
};

// Enum Engine.ESoundWaveLoadingBehavior
enum class ESoundWaveLoadingBehavior : uint8 {
	ESoundWaveLoadingBehavior = 0
	ESoundWaveLoadingBehavior = 1
	ESoundWaveLoadingBehavior = 2
	ESoundWaveLoadingBehavior = 3
	ESoundWaveLoadingBehavior = 4
	ESoundWaveLoadingBehavior = 255
	ESoundWaveLoadingBehavior = 256
};

// Enum Engine.ESplineCoordinateSpace
enum class ESplineCoordinateSpace : uint8 {
	ESplineCoordinateSpace = 0
	ESplineCoordinateSpace = 1
	ESplineCoordinateSpace = 2
};

// Enum Engine.ESplinePointType
enum class ESplinePointType : uint8 {
	ESplinePointType = 0
	ESplinePointType = 1
	ESplinePointType = 2
	ESplinePointType = 3
	ESplinePointType = 4
	ESplinePointType = 5
};

// Enum Engine.ESplineMeshAxis
enum class ESplineMeshAxis : uint8 {
	ESplineMeshAxis = 0
	ESplineMeshAxis = 1
	ESplineMeshAxis = 2
	ESplineMeshAxis = 3
};

// Enum Engine.EOptimizationType
enum class EOptimizationType : uint8 {
	OT_NumOfTriangles = 0
	OT_MaxDeviation = 1
	OT_MAX = 2
};

// Enum Engine.EImportanceLevel
enum class EImportanceLevel : uint8 {
	IL_Off = 0
	IL_Lowest = 1
	IL_Low = 2
	IL_Normal = 3
	IL_High = 4
	IL_Highest = 5
	TEMP_BROKEN2 = 6
	EImportanceLevel_MAX = 7
};

// Enum Engine.ENormalMode
enum class ENormalMode : uint8 {
	NM_PreserveSmoothingGroups = 0
	NM_RecalculateNormals = 1
	NM_RecalculateNormalsSmooth = 2
	NM_RecalculateNormalsHard = 3
	TEMP_BROKEN = 4
	ENormalMode_MAX = 5
};

// Enum Engine.EStereoLayerShape
enum class EStereoLayerShape : uint8 {
	SLSH_QuadLayer = 0
	SLSH_CylinderLayer = 1
	SLSH_CubemapLayer = 2
	SLSH_EquirectLayer = 3
	SLSH_MAX = 4
};

// Enum Engine.EStereoLayerType
enum class EStereoLayerType : uint8 {
	SLT_WorldLocked = 0
	SLT_TrackerLocked = 1
	SLT_FaceLocked = 2
	SLT_MAX = 3
};

// Enum Engine.EOpacitySourceMode
enum class EOpacitySourceMode : uint8 {
	OSM_Alpha = 0
	OSM_ColorBrightness = 1
	OSM_RedChannel = 2
	OSM_GreenChannel = 3
	OSM_BlueChannel = 4
	OSM_MAX = 5
};

// Enum Engine.ESubUVBoundingVertexCount
enum class ESubUVBoundingVertexCount : uint8 {
	BVC_FourVertices = 0
	BVC_EightVertices = 1
	BVC_MAX = 2
};

// Enum Engine.EVerticalTextAligment
enum class EVerticalTextAligment : uint8 {
	EVRTA_TextTop = 0
	EVRTA_TextCenter = 1
	EVRTA_TextBottom = 2
	EVRTA_QuadTop = 3
	EVRTA_MAX = 4
};

// Enum Engine.EHorizTextAligment
enum class EHorizTextAligment : uint8 {
	EHTA_Left = 0
	EHTA_Center = 1
	EHTA_Right = 2
	EHTA_MAX = 3
};

// Enum Engine.ETextureLossyCompressionAmount
enum class ETextureLossyCompressionAmount : uint8 {
	TLCA_Default = 0
	TLCA_None = 1
	TLCA_Lowest = 2
	TLCA_Low = 3
	TLCA_Medium = 4
	TLCA_High = 5
	TLCA_Highest = 6
	TLCA_MAX = 7
};

// Enum Engine.ETextureCompressionQuality
enum class ETextureCompressionQuality : uint8 {
	TCQ_Default = 0
	TCQ_Lowest = 1
	TCQ_Low = 2
	TCQ_Medium = 3
	TCQ_High = 4
	TCQ_Highest = 5
	TCQ_MAX = 6
};

// Enum Engine.ETextureSourceFormat
enum class ETextureSourceFormat : uint8 {
	TSF_Invalid = 0
	TSF_G8 = 1
	TSF_BGRA8 = 2
	TSF_BGRE8 = 3
	TSF_RGBA16 = 4
	TSF_RGBA16F = 5
	TSF_RGBA8 = 6
	TSF_RGBE8 = 7
	TSF_G16 = 8
	TSF_MAX = 9
};

// Enum Engine.ETextureSourceArtType
enum class ETextureSourceArtType : uint8 {
	TSAT_Uncompressed = 0
	TSAT_PNGCompressed = 1
	TSAT_DDSFile = 2
	TSAT_MAX = 3
};

// Enum Engine.ETextureMipCount
enum class ETextureMipCount : uint8 {
	TMC_ResidentMips = 0
	TMC_AllMips = 1
	TMC_AllMipsBiased = 2
	TMC_MAX = 3
};

// Enum Engine.ECompositeTextureMode
enum class ECompositeTextureMode : uint8 {
	CTM_Disabled = 0
	CTM_NormalRoughnessToRed = 1
	CTM_NormalRoughnessToGreen = 2
	CTM_NormalRoughnessToBlue = 3
	CTM_NormalRoughnessToAlpha = 4
	CTM_MAX = 5
};

// Enum Engine.TextureAddress
enum class TextureAddress : uint8 {
	TA_Wrap = 0
	TA_Clamp = 1
	TA_Mirror = 2
	TA_MAX = 3
};

// Enum Engine.TextureCompressionSettings
enum class TextureCompressionSettings : uint8 {
	TC_Default = 0
	TC_Normalmap = 1
	TC_Masks = 2
	TC_Grayscale = 3
	TC_Displacementmap = 4
	TC_VectorDisplacementmap = 5
	TC_HDR = 6
	TC_EditorIcon = 7
	TC_Alpha = 8
	TC_DistanceFieldFont = 9
	TC_HDR_Compressed = 10
	TC_BC7 = 11
	TC_MAX = 12
};

// Enum Engine.ETextureMipLoadOptions
enum class ETextureMipLoadOptions : uint8 {
	ETextureMipLoadOptions = 0
	ETextureMipLoadOptions = 1
	ETextureMipLoadOptions = 2
	ETextureMipLoadOptions = 3
};

// Enum Engine.ETextureSamplerFilter
enum class ETextureSamplerFilter : uint8 {
	ETextureSamplerFilter = 0
	ETextureSamplerFilter = 1
	ETextureSamplerFilter = 2
	ETextureSamplerFilter = 3
	ETextureSamplerFilter = 4
	ETextureSamplerFilter = 5
};

// Enum Engine.ETexturePowerOfTwoSetting
enum class ETexturePowerOfTwoSetting : uint8 {
	ETexturePowerOfTwoSetting = 0
	ETexturePowerOfTwoSetting = 1
	ETexturePowerOfTwoSetting = 2
	ETexturePowerOfTwoSetting = 3
};

// Enum Engine.TextureMipGenSettings
enum class TextureMipGenSettings : uint8 {
	TMGS_FromTextureGroup = 0
	TMGS_SimpleAverage = 1
	TMGS_Sharpen0 = 2
	TMGS_Sharpen1 = 3
	TMGS_Sharpen2 = 4
	TMGS_Sharpen3 = 5
	TMGS_Sharpen4 = 6
	TMGS_Sharpen5 = 7
	TMGS_Sharpen6 = 8
	TMGS_Sharpen7 = 9
	TMGS_Sharpen8 = 10
	TMGS_Sharpen9 = 11
	TMGS_Sharpen10 = 12
	TMGS_NoMipmaps = 13
	TMGS_LeaveExistingMips = 14
	TMGS_Blur1 = 15
	TMGS_Blur2 = 16
	TMGS_Blur3 = 17
	TMGS_Blur4 = 18
	TMGS_Blur5 = 19
	TMGS_Unfiltered = 20
	TMGS_MAX = 21
};

// Enum Engine.TextureGroup
enum class TextureGroup : uint8 {
	TEXTUREGROUP_World = 0
	TEXTUREGROUP_WorldNormalMap = 1
	TEXTUREGROUP_WorldSpecular = 2
	TEXTUREGROUP_Character = 3
	TEXTUREGROUP_CharacterNormalMap = 4
	TEXTUREGROUP_CharacterSpecular = 5
	TEXTUREGROUP_Weapon = 6
	TEXTUREGROUP_WeaponNormalMap = 7
	TEXTUREGROUP_WeaponSpecular = 8
	TEXTUREGROUP_Vehicle = 9
	TEXTUREGROUP_VehicleNormalMap = 10
	TEXTUREGROUP_VehicleSpecular = 11
	TEXTUREGROUP_Cinematic = 12
	TEXTUREGROUP_Effects = 13
	TEXTUREGROUP_EffectsNotFiltered = 14
	TEXTUREGROUP_Skybox = 15
	TEXTUREGROUP_UI = 16
	TEXTUREGROUP_Lightmap = 17
	TEXTUREGROUP_RenderTarget = 18
	TEXTUREGROUP_MobileFlattened = 19
	TEXTUREGROUP_ProcBuilding_Face = 20
	TEXTUREGROUP_ProcBuilding_LightMap = 21
	TEXTUREGROUP_Shadowmap = 22
	TEXTUREGROUP_ColorLookupTable = 23
	TEXTUREGROUP_Terrain_Heightmap = 24
	TEXTUREGROUP_Terrain_Weightmap = 25
	TEXTUREGROUP_Bokeh = 26
	TEXTUREGROUP_IESLightProfile = 27
	TEXTUREGROUP_Pixels2D = 28
	TEXTUREGROUP_HierarchicalLOD = 29
	TEXTUREGROUP_Impostor = 30
	TEXTUREGROUP_ImpostorNormalDepth = 31
	TEXTUREGROUP_8BitData = 32
	TEXTUREGROUP_16BitData = 33
	TEXTUREGROUP_Project01 = 34
	TEXTUREGROUP_Project02 = 35
	TEXTUREGROUP_Project03 = 36
	TEXTUREGROUP_Project04 = 37
	TEXTUREGROUP_Project05 = 38
	TEXTUREGROUP_Project06 = 39
	TEXTUREGROUP_Project07 = 40
	TEXTUREGROUP_Project08 = 41
	TEXTUREGROUP_Project09 = 42
	TEXTUREGROUP_Project10 = 43
	TEXTUREGROUP_Project11 = 44
	TEXTUREGROUP_Project12 = 45
	TEXTUREGROUP_Project13 = 46
	TEXTUREGROUP_Project14 = 47
	TEXTUREGROUP_Project15 = 48
	TEXTUREGROUP_MAX = 49
};

// Enum Engine.ETextureRenderTargetFormat
enum class ETextureRenderTargetFormat : uint8 {
	RTF_R8 = 0
	RTF_RG8 = 1
	RTF_RGBA8 = 2
	RTF_RGBA8_SRGB = 3
	RTF_R16f = 4
	RTF_RG16f = 5
	RTF_RGBA16f = 6
	RTF_R32f = 7
	RTF_RG32f = 8
	RTF_RGBA32f = 9
	RTF_RGB10A2 = 10
	RTF_MAX = 11
};

// Enum Engine.ETimecodeProviderSynchronizationState
enum class ETimecodeProviderSynchronizationState : uint8 {
	ETimecodeProviderSynchronizationState = 0
	ETimecodeProviderSynchronizationState = 1
	ETimecodeProviderSynchronizationState = 2
	ETimecodeProviderSynchronizationState = 3
	ETimecodeProviderSynchronizationState = 4
};

// Enum Engine.ETimelineDirection
enum class ETimelineDirection : uint8 {
	ETimelineDirection = 0
	ETimelineDirection = 1
	ETimelineDirection = 2
};

// Enum Engine.ETimeStretchCurveMapping
enum class ETimeStretchCurveMapping : uint8 {
	ETimeStretchCurveMapping = 0
	ETimeStretchCurveMapping = 1
	ETimeStretchCurveMapping = 2
	ETimeStretchCurveMapping = 3
};

// Enum Engine.ETwitterIntegrationDelegate
enum class ETwitterIntegrationDelegate : uint8 {
	TID_AuthorizeComplete = 0
	TID_TweetUIComplete = 1
	TID_RequestComplete = 2
	TID_MAX = 3
};

// Enum Engine.ETwitterRequestMethod
enum class ETwitterRequestMethod : uint8 {
	T = 0
	T = 1
	T = 2
	T = 3
};

// Enum Engine.EUserDefinedStructureStatus
enum class EUserDefinedStructureStatus : uint8 {
	UDSS_UpToDate = 0
	UDSS_Dirty = 1
	UDSS_Error = 2
	UDSS_Duplicate = 3
	UDSS_MAX = 4
};

// Enum Engine.EUIScalingRule
enum class EUIScalingRule : uint8 {
	EUIScalingRule = 0
	EUIScalingRule = 1
	EUIScalingRule = 2
	EUIScalingRule = 3
	EUIScalingRule = 4
	EUIScalingRule = 5
};

// Enum Engine.E
enum class E : uint8 {
	E = 0
	E = 1
	E = 2
	E = 3
	E = 4
};

// Enum Engine.EVectorFieldConstructionOp
enum class EVectorFieldConstructionOp : uint8 {
	VFCO_Extrude = 0
	VFCO_Revolve = 1
	VFCO_MAX = 2
};

// Enum Engine.EWindSourceType
enum class EWindSourceType : uint8 {
	EWindSourceType = 0
	EWindSourceType = 1
	EWindSourceType = 2
};

// Enum Engine.ELevelScanRule
enum class ELevelScanRule : uint8 {
	ELevelScanRule = 0
	ELevelScanRule = 1
	ELevelScanRule = 2
	ELevelScanRule = 3
	ELevelScanRule = 4
	ELevelScanRule = 5
	ELevelScanRule = 6
	ELevelScanRule = 7
	ELevelScanRule = 8
	ELevelScanRule = 9
};

// Enum Engine.EPSCPoolMethod
enum class EPSCPoolMethod : uint8 {
	EPSCPoolMethod = 0
	EPSCPoolMethod = 1
	EPSCPoolMethod = 2
	EPSCPoolMethod = 3
	EPSCPoolMethod = 4
	EPSCPoolMethod = 5
};

// Enum Engine.EVolumeLightingMethod
enum class EVolumeLightingMethod : uint8 {
	VLM_VolumetricLightmap = 0
	VLM_SparseVolumeLightingSamples = 1
	VLM_MAX = 2
};

// Enum Engine.EVisibilityAggressiveness
enum class EVisibilityAggressiveness : uint8 {
	VIS_LeastAggressive = 0
	VIS_ModeratelyAggressive = 1
	VIS_MostAggressive = 2
	VIS_Max = 3
};

// Class Engine.ActorComponent
struct UActorComponent : Object {
	struct Unknown PrimaryComponentTick; // 0x30 (48)
	struct TArray<Unknown> ComponentTags; // 0x60 (16)
	struct TArray<Unknown> AssetUserData; // 0x70 (16)
	int32_t UCSSerializationIndex; // 0x84 (4)
	char bNetAddressable : 0; // 0x88 (1)
	char b : 0; // 0x88 (1)
	char bAutoActivate : 0; // 0x89 (1)
	char bIsActive : 0; // 0x8A (1)
	char bEditableWhenInherited : 0; // 0x8A (1)
	char bCanEverAffectNavigation : 0; // 0x8A (1)
	char bIsEditorOnly : 0; // 0x8A (1)
	enum class Unknow CreationMethod; // 0x8C (1)
	struct FMulticastSparseDelegate OnComponentActivated; // 0x8D (1)
	struct FMulticastSparseDelegate OnComponentDeactivated; // 0x8E (1)
	struct TArray<Unknown> UCSModifiedProperties; // 0x90 (16)

	void ToggleActive(); // Function Engine.ActorComponent.ToggleActive(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x338A6D0>
	void SetTickGroup(char NewTickGroup); // Function Engine.ActorComponent.SetTickGroup(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C68FB0>
	void SetTickableWhenPaused(char bTickableWhenPaused); // Function Engine.ActorComponent.SetTickableWhenPaused(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C69030>
	void SetIsReplicated(char ShouldReplicate); // Function Engine.ActorComponent.SetIsReplicated(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C68F20>
	void SetComponentTickInterval(float TickInterval); // Function Engine.ActorComponent.SetComponentTickInterval(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C68EA0>
	void SetComponentTickEnabled(char bEnabled); // Function Engine.ActorComponent.SetComponentTickEnabled(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C63CB0>
	void SetAutoActivate(char bNewAutoActivate); // Function Engine.ActorComponent.SetAutoActivate(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C68E10>
	void SetActive(char bNewActive, char b); // Function Engine.ActorComponent.SetActive(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C68D40>
	void RemoveTickPrerequisiteComponent(struct Unknown PrerequisiteComponent); // Function Engine.ActorComponent.RemoveTickPrerequisiteComponent(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C68CB0>
	void RemoveTickPrerequisiteActor(struct Unknown PrerequisiteActor); // Function Engine.ActorComponent.RemoveTickPrerequisiteActor(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C68C20>
	void ReceiveTick(float DeltaSeconds); // Function Engine.ActorComponent.ReceiveTick(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveEndPlay(char EndPlayReason); // Function Engine.ActorComponent.ReceiveEndPlay(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveBeginPlay(); // Function Engine.ActorComponent.ReceiveBeginPlay(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnRep_IsActive(); // Function Engine.ActorComponent.OnRep_IsActive(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EE1BA0>
	void K2_DestroyComponent(struct Unknown Object); // Function Engine.ActorComponent.K2_DestroyComponent(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C68B20>
	char IsComponentTickEnabled(); // Function Engine.ActorComponent.IsComponentTickEnabled(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C68AF0>
	char IsBeingDestroyed(); // Function Engine.ActorComponent.IsBeingDestroyed(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C68AC0>
	char IsActive(); // Function Engine.ActorComponent.IsActive(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C68A90>
	struct Unknown GetOwner(); // Function Engine.ActorComponent.GetOwner(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C68A70>
	float GetComponentTickInterval(); // Function Engine.ActorComponent.GetComponentTickInterval(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C68A40>
	void Deactivate(); // Function Engine.ActorComponent.Deactivate(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EE1B80>
	char ComponentHasTag(struct FName Tag); // Function Engine.ActorComponent.ComponentHasTag(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C68830>
	void AddTickPrerequisiteComponent(struct Unknown PrerequisiteComponent); // Function Engine.ActorComponent.AddTickPrerequisiteComponent(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C686E0>
	void AddTickPrerequisiteActor(struct Unknown PrerequisiteActor); // Function Engine.ActorComponent.AddTickPrerequisiteActor(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C68650>
	void Activate(char b); // Function Engine.ActorComponent.Activate(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x338A970>
};

// Class Engine.SceneComponent
struct USceneComponent : UActorComponent {
	struct TWeakObjectPtr<struct Unknown> PhysicsVolume; // 0x144 (8)
	struct Unknown AttachParent; // 0x1D0 (8)
	struct FName AttachSocketName; // 0x1DC (8)
	struct TArray<Unknown> AttachChildren; // 0xB8 (16)
	struct TArray<Unknown> ClientAttachedChildren; // 0x190 (16)
	struct Unknown RelativeLocation; // 0x224 (12)
	struct Unknown RelativeRotation; // 0x1B4 (12)
	struct Unknown RelativeScale3D; // 0x1C4 (12)
	struct Unknown ComponentVelocity; // 0x164 (12)
	char bComponentToWorldUpdated : 0; // 0x140 (1)
	char bAbsoluteLocation : 0; // 0x220 (1)
	char bAbsoluteRotation : 0; // 0x1D8 (1)
	char bAbsoluteScale : 0; // 0x188 (1)
	char bVisible : 0; // 0xC8 (1)
	char bShouldBeAttached : 0; // 0x220 (1)
	char bShouldSnapLocationWhenAttached : 0; // 0x1B0 (1)
	char bShouldSnapRotationWhenAttached : 0; // 0x188 (1)
	char bShouldUpdatePhysicsVolume : 0; // 0x1A0 (1)
	char bHiddenInGame : 0; // 0x220 (1)
	char bBoundsChangeTriggersStreamingDataRebuild : 0; // 0xC8 (1)
	char bUseAttachParentBound : 0; // 0x1D8 (1)
	char Mobility; // 0x221 (1)
	char DetailMode; // 0x160 (1)
	struct FMulticastSparseDelegate PhysicsVolumeChangedDelegate; // 0xB0 (1)

	void ToggleVisibility(char bPropagateToChildren); // Function Engine.SceneComponent.ToggleVisibility(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE8840>
	char SnapTo(struct Unknown InParent, struct FName InSocketName); // Function Engine.SceneComponent.SnapTo(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE8780>
	void SetWorldScale3D(struct Unknown NewScale); // Function Engine.SceneComponent.SetWorldScale3D(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE85A0>
	void SetVisibility(char bNewVisibility, char bPropagateToChildren); // Function Engine.SceneComponent.SetVisibility(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE84D0>
	void SetShouldUpdatePhysicsVolume(char bInShouldUpdatePhysicsVolume); // Function Engine.SceneComponent.SetShouldUpdatePhysicsVolume(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE8440>
	void SetRelativeScale3D(struct Unknown NewScale3D); // Function Engine.SceneComponent.SetRelativeScale3D(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE83B0>
	void SetMobility(char NewMobility); // Function Engine.SceneComponent.SetMobility(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE8330>
	void SetHiddenInGame(char NewHidden, char bPropagateToChildren); // Function Engine.SceneComponent.SetHiddenInGame(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE8260>
	void SetAbsolute(char bNewAbsoluteLocation, char bNewAbsoluteRotation, char bNewAbsoluteScale); // Function Engine.SceneComponent.SetAbsolute(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE80C0>
	void ResetRelativeTransform(); // Function Engine.SceneComponent.ResetRelativeTransform(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE80A0>
	void OnRep_Visibility(char OldValue); // Function Engine.SceneComponent.OnRep_Visibility(Final|Native|Private) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE7EC0>
	void OnRep_Transform(); // Function Engine.SceneComponent.OnRep_Transform(Final|Native|Private) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE7EA0>
	void OnRep_AttachSocketName(); // Function Engine.SceneComponent.OnRep_AttachSocketName(Final|Native|Private) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE7E80>
	void OnRep_AttachParent(); // Function Engine.SceneComponent.OnRep_AttachParent(Final|Native|Private) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE7E80>
	void OnRep_AttachChildren(); // Function Engine.SceneComponent.OnRep_AttachChildren(Final|Native|Private) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE7E60>
	void K2_SetWorldTransform(struct Unknown& NewTransform, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.SceneComponent.K2_SetWorldTransform(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE7C60>
	void K2_SetWorldRotation(struct Unknown NewRotation, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.SceneComponent.K2_SetWorldRotation(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE7AC0>
	void K2_SetWorldLocationAndRotation(struct Unknown NewLocation, struct Unknown NewRotation, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.SceneComponent.K2_SetWorldLocationAndRotation(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE78D0>
	void K2_SetWorldLocation(struct Unknown NewLocation, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.SceneComponent.K2_SetWorldLocation(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE7730>
	void K2_SetRelativeTransform(struct Unknown& NewTransform, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.SceneComponent.K2_SetRelativeTransform(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE7530>
	void K2_SetRelativeRotation(struct Unknown NewRotation, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.SceneComponent.K2_SetRelativeRotation(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE7390>
	void K2_SetRelativeLocationAndRotation(struct Unknown NewLocation, struct Unknown NewRotation, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.SceneComponent.K2_SetRelativeLocationAndRotation(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE71A0>
	void K2_SetRelativeLocation(struct Unknown NewLocation, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.SceneComponent.K2_SetRelativeLocation(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE7000>
	struct Unknown K2_GetComponentToWorld(); // Function Engine.SceneComponent.K2_GetComponentToWorld(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE6FA0>
	struct Unknown K2_GetComponentScale(); // Function Engine.SceneComponent.K2_GetComponentScale(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE6F60>
	struct Unknown K2_GetComponentRotation(); // Function Engine.SceneComponent.K2_GetComponentRotation(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE6F20>
	struct Unknown K2_GetComponentLocation(); // Function Engine.SceneComponent.K2_GetComponentLocation(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE6EE0>
	void K2_DetachFromComponent(enum class Unknow LocationRule, enum class Unknow RotationRule, enum class Unknow ScaleRule, char bCallModify); // Function Engine.SceneComponent.K2_DetachFromComponent(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE6D90>
	char K2_AttachToComponent(struct Unknown Parent, struct FName SocketName, enum class Unknow LocationRule, enum class Unknow RotationRule, enum class Unknow ScaleRule, char bWeldSimulatedBodies); // Function Engine.SceneComponent.K2_AttachToComponent(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE6BE0>
	char K2_AttachTo(struct Unknown InParent, struct FName InSocketName, char AttachType, char bWeldSimulatedBodies); // Function Engine.SceneComponent.K2_AttachTo(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE6A90>
	void K2_AddWorldTransform(struct Unknown& DeltaTransform, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.SceneComponent.K2_AddWorldTransform(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE6890>
	void K2_AddWorldRotation(struct Unknown DeltaRotation, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.SceneComponent.K2_AddWorldRotation(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE66F0>
	void K2_AddWorldOffset(struct Unknown DeltaLocation, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.SceneComponent.K2_AddWorldOffset(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE6550>
	void K2_AddRelativeRotation(struct Unknown DeltaRotation, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.SceneComponent.K2_AddRelativeRotation(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE63B0>
	void K2_AddRelativeLocation(struct Unknown DeltaLocation, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.SceneComponent.K2_AddRelativeLocation(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE6210>
	void K2_AddLocalTransform(struct Unknown& DeltaTransform, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.SceneComponent.K2_AddLocalTransform(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE6010>
	void K2_AddLocalRotation(struct Unknown DeltaRotation, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.SceneComponent.K2_AddLocalRotation(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5E70>
	void K2_AddLocalOffset(struct Unknown DeltaLocation, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.SceneComponent.K2_AddLocalOffset(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5CD0>
	char IsVisible(); // Function Engine.SceneComponent.IsVisible(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5CA0>
	char IsSimulatingPhysics(struct FName BoneName); // Function Engine.SceneComponent.IsSimulatingPhysics(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5C00>
	char IsAnySimulatingPhysics(); // Function Engine.SceneComponent.IsAnySimulatingPhysics(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5BD0>
	struct Unknown GetUpVector(); // Function Engine.SceneComponent.GetUpVector(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5A40>
	struct Unknown GetSocketTransform(struct FName InSocketName, char TransformSpace); // Function Engine.SceneComponent.GetSocketTransform(Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5940>
	struct Unknown GetSocketRotation(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketRotation(Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5890>
	struct Unknown GetSocketQuaternion(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketQuaternion(Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE57F0>
	struct Unknown GetSocketLocation(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketLocation(Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5740>
	char GetShouldUpdatePhysicsVolume(); // Function Engine.SceneComponent.GetShouldUpdatePhysicsVolume(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5710>
	struct Unknown GetRightVector(); // Function Engine.SceneComponent.GetRightVector(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE56D0>
	struct Unknown GetRelativeTransform(); // Function Engine.SceneComponent.GetRelativeTransform(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5670>
	struct Unknown GetPhysicsVolume(); // Function Engine.SceneComponent.GetPhysicsVolume(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5640>
	void GetParentComponents(struct TArray<Unknown>& Parents); // Function Engine.SceneComponent.GetParentComponents(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5590>
	int32_t GetNumChildrenComponents(); // Function Engine.SceneComponent.GetNumChildrenComponents(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5560>
	struct Unknown GetForwardVector(); // Function Engine.SceneComponent.GetForwardVector(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DBC1E0>
	struct Unknown GetComponentVelocity(); // Function Engine.SceneComponent.GetComponentVelocity(Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5520>
	void GetChildrenComponents(char bIncludeAllDescendants, struct TArray<Unknown>& Children); // Function Engine.SceneComponent.GetChildrenComponents(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5420>
	struct Unknown GetChildComponent(int32_t ChildIndex); // Function Engine.SceneComponent.GetChildComponent(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5390>
	struct FName GetAttachSocketName(); // Function Engine.SceneComponent.GetAttachSocketName(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5370>
	struct Unknown GetAttachParent(); // Function Engine.SceneComponent.GetAttachParent(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5350>
	struct TArray<Unknown> GetAllSocketNames(); // Function Engine.SceneComponent.GetAllSocketNames(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE52D0>
	char DoesSocketExist(struct FName InSocketName); // Function Engine.SceneComponent.DoesSocketExist(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5230>
	void DetachFromParent(char bMaintainWorldPosition, char bCallModify); // Function Engine.SceneComponent.DetachFromParent(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DE5160>
};

// Class Engine.MKActorEx
struct UMKActorEx : Object {
	char ReplaySamplable; // 0x28 (1)
	struct Unknown* ReplaySampleClass; // 0x30 (8)
	float ReplaySamplingFrequency; // 0x38 (4)
	uint32_t ClientReplaySamplingGUID; // 0x3C (4)
	char b : 0; // 0x44 (1)
	struct TArray<Unknown> ReplaySamplesForPlayback; // 0x68 (16)
	struct Unknown SelfActor; // 0x88 (8)

	void OnTickReplaySampleRecord(struct Unknown DemoNetDriver, float MinRecordHz, float MaxRecordHz, char bSaveCheckpoint); // Function Engine.MKActorEx.OnTickReplaySampleRecord(Final|Native|Private) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3D957F0>
	void OnTickReplaySamplePlayback(struct Unknown DemoNetDriver); // Function Engine.MKActorEx.OnTickReplaySamplePlayback(Final|Native|Private) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3D95770>
	void OnReplayPreScrub(struct Unknown InWorld); // Function Engine.MKActorEx.OnReplayPreScrub(Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EE1910>
	void OnPostRecordReplay(struct Unknown InWorld, struct Unknown& DemoURL); // Function Engine.MKActorEx.OnPostRecordReplay(Final|Native|Private|HasOutParms) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3D95680>
	void LerpReplaySampleForPlayback(struct Unknown DemoNetDriver, struct Unknown L, struct Unknown R, float LerpPercent); // Function Engine.MKActorEx.LerpReplaySampleForPlayback(Native|Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3D95440>
	char HandleTimelineScrubbed(); // Function Engine.MKActorEx.HandleTimelineScrubbed(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2EE1B20>
	void GatherReplaySampleForRecording(struct Unknown DemoNetDriver, float DemoCurrentTime, char bSaveCheckpoint); // Function Engine.MKActorEx.GatherReplaySampleForRecording(Native|Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3D945C0>
	void ForceReplaySamplingUpdate(); // Function Engine.MKActorEx.ForceReplaySamplingUpdate(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CBCB60>
};

// Class Engine.Actor
struct UActor : UMKActorEx {
	struct Unknown PrimaryActorTick; // 0x1D8 (48)
	char bNetTemporary : 0; // 0x284 (1)
	char bNetStartup : 0; // 0x248 (1)
	char bOnlyRelevantToOwner : 0; // 0x1C4 (1)
	char bAlwaysRelevant : 0; // 0xA1 (1)
	char b : 0; // 0x260 (1)
	char bHidden : 0; // 0x222 (1)
	char bTearOff : 0; // 0x284 (1)
	char bExchangedRoles : 0; // 0x120 (1)
	char bNetLoadOnClient : 0; // 0x138 (1)
	char bNetUseOwnerRelevancy : 0; // 0xE8 (1)
	char b : 0; // 0x170 (1)
	char b : 0; // 0x138 (1)
	char b : 0; // 0x9F (1)
	char bAllowTickBeforeBeginPlay : 0; // 0x1C4 (1)
	char bAutoDestroyWhenFinished : 0; // 0x1C4 (1)
	char bCanBeDamaged : 0; // 0x1A0 (1)
	char bBlockInput : 0; // 0x303 (1)
	char bCollideWhenPlacing : 0; // 0x301 (1)
	char bFindCameraComponentWhenViewTarget : 0; // 0x251 (1)
	char bGenerateOverlapEventsDuringLevelStreaming : 0; // 0x30E (1)
	char bIgnoresOriginShifting : 0; // 0x155 (1)
	char bEnableAutoLODGeneration : 0; // 0x251 (1)
	char bIsEditorOnlyActor : 0; // 0x120 (1)
	char bActorSeamlessTraveled : 0; // 0xEA (1)
	char b : 0; // 0x9D (1)
	char bCanBeInCluster : 0; // 0x90 (1)
	char bAllowReceiveTickEv : 0; // 0x198 (1)
	char bActorEnableCollision : 0; // 0x1B8 (1)
	char bActorIsBeingDestroyed : 0; // 0x30E (1)
	enum class Unknow UpdateOverlapsMethodDuringLevelStreaming; // 0x154 (1)
	enum class Unknow DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0xA3 (1)
	char RemoteRole; // 0x279 (1)
	struct Unknown ReplicatedMovement; // 0xEC (52)
	float InitialLifeSpan; // 0x2E0 (4)
	float CustomTimeDilation; // 0x308 (4)
	struct Unknown AttachmentReplication; // 0xA8 (64)
	struct Unknown Owner; // 0x178 (8)
	struct FName NetDriverName; // 0x94 (8)
	char Role; // 0x9E (1)
	char NetDormancy; // 0x238 (1)
	enum class Unknow SpawnCollisionHandlingMethod; // 0x304 (1)
	char AutoReceiveInput; // 0x302 (1)
	int32_t InputPriority; // 0x150 (4)
	struct Unknown InputComponent; // 0x2F8 (8)
	float NetCullDistanceSquared; // 0x280 (4)
	int32_t NetTag; // 0x24C (4)
	float NetUpdateFrequency; // 0x27C (4)
	float MinNetUpdateFrequency; // 0x288 (4)
	float NetPriority; // 0x21C (4)
	struct Unknown Instigator; // 0x258 (8)
	struct TArray<Unknown> Children; // 0x268 (16)
	struct Unknown RootComponent; // 0x158 (8)
	struct TArray<Unknown> ControllingMatineeActors; // 0x208 (16)
	struct TArray<Unknown> Layers; // 0x188 (16)
	struct TWeakObjectPtr<struct Unknown> ParentComponent; // 0x1BC (8)
	char bEnableRerunConstructionScript : 0; // 0x30C (1)
	struct TArray<Unknown> Tags; // 0x140 (16)
	struct FMulticastSparseDelegate OnTakeAnyDamage; // 0x218 (1)
	struct FMulticastSparseDelegate OnTakePointDamage; // 0x27A (1)
	struct FMulticastSparseDelegate OnTakeRadialDamage; // 0x9C (1)
	struct FMulticastSparseDelegate OnActorBeginOverlap; // 0x27B (1)
	struct FMulticastSparseDelegate OnActorEndOverlap; // 0xA0 (1)
	struct FMulticastSparseDelegate OnBeginCursorOver; // 0x221 (1)
	struct FMulticastSparseDelegate OnEndCursorOver; // 0xE9 (1)
	struct FMulticastSparseDelegate OnClicked; // 0x278 (1)
	struct FMulticastSparseDelegate OnReleased; // 0x2E4 (1)
	struct FMulticastSparseDelegate OnInputTouchBegin; // 0x300 (1)
	struct FMulticastSparseDelegate OnInputTouchEnd; // 0x285 (1)
	struct FMulticastSparseDelegate OnInputTouchEnter; // 0xA2 (1)
	struct FMulticastSparseDelegate OnInputTouchLeave; // 0x250 (1)
	struct FMulticastSparseDelegate OnActorHit; // 0x180 (1)
	struct FMulticastSparseDelegate OnDestroyed; // 0x220 (1)
	struct FMulticastSparseDelegate OnEndPlay; // 0x30D (1)
	struct TArray<Unknown> InstanceComponents; // 0x128 (16)
	struct TArray<Unknown> BlueprintCreatedComponents; // 0x1A8 (16)
	struct TArray<Unknown> LoadedObjects; // 0x1C8 (16)

	char WasRecentlyRendered(float Tolerance); // Function Engine.Actor.WasRecentlyRendered(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C644A0>
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void TearOff(); // Function Engine.Actor.TearOff(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C64480>
	void SnapRootComponentTo(struct Unknown InParentActor, struct FName InSocketName); // Function Engine.Actor.SnapRootComponentTo(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C643C0>
	void SetTickGroup(char NewTickGroup); // Function Engine.Actor.SetTickGroup(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C642B0>
	void SetTickableWhenPaused(char bTickableWhenPaused); // Function Engine.Actor.SetTickableWhenPaused(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C64330>
	void SetReplicates(char bInReplicates); // Function Engine.Actor.SetReplicates(Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C64220>
	void SetReplicateMovement(char bInReplicateMovement); // Function Engine.Actor.SetReplicateMovement(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C64190>
	void SetOwner(struct Unknown NewOwner); // Function Engine.Actor.SetOwner(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C64100>
	void SetNetDormancy(char NewDormancy); // Function Engine.Actor.SetNetDormancy(Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C64080>
	void SetLifeSpan(float InLifespan); // Function Engine.Actor.SetLifeSpan(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C64000>
	void SetAutoDestroyWhenFinished(char bVal); // Function Engine.Actor.SetAutoDestroyWhenFinished(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C63F70>
	void SetActorTickInterval(float TickInterval); // Function Engine.Actor.SetActorTickInterval(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C63EF0>
	void SetActorTickEnabled(char bEnabled); // Function Engine.Actor.SetActorTickEnabled(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C63E60>
	void SetActorScale3D(struct Unknown NewScale3D); // Function Engine.Actor.SetActorScale3D(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C63DD0>
	void SetActorRelativeScale3D(struct Unknown NewRelativeScale); // Function Engine.Actor.SetActorRelativeScale3D(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C63D40>
	void SetActorHiddenInGame(char bNewHidden); // Function Engine.Actor.SetActorHiddenInGame(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C63CB0>
	void SetActorEnableCollision(char bNewActorEnableCollision); // Function Engine.Actor.SetActorEnableCollision(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C63C20>
	void RemoveTickPrerequisiteComponent(struct Unknown PrerequisiteComponent); // Function Engine.Actor.RemoveTickPrerequisiteComponent(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C63B90>
	void RemoveTickPrerequisiteActor(struct Unknown PrerequisiteActor); // Function Engine.Actor.RemoveTickPrerequisiteActor(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C63B00>
	void ReceiveTick(float DeltaSeconds); // Function Engine.Actor.ReceiveTick(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveRadialDamage(float DamageReceived, struct Unknown DamageType, struct Unknown Origin, struct Unknown& HitInfo, struct Unknown InstigatedBy, struct Unknown DamageCauser); // Function Engine.Actor.ReceiveRadialDamage(BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceivePointDamage(float Damage, struct Unknown DamageType, struct Unknown HitLocation, struct Unknown HitNormal, struct Unknown HitComponent, struct FName BoneName, struct Unknown ShotFromDirection, struct Unknown InstigatedBy, struct Unknown DamageCauser, struct Unknown& HitInfo); // Function Engine.Actor.ReceivePointDamage(BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveHit(struct Unknown MyComp, struct Unknown Other, struct Unknown OtherComp, char bSelfMoved, struct Unknown HitLocation, struct Unknown HitNormal, struct Unknown NormalImpulse, struct Unknown& Hit); // Function Engine.Actor.ReceiveHit(Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveEndPlay(char EndPlayReason); // Function Engine.Actor.ReceiveEndPlay(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveAnyDamage(float Damage, struct Unknown DamageType, struct Unknown InstigatedBy, struct Unknown DamageCauser); // Function Engine.Actor.ReceiveAnyDamage(BlueprintAuthorityOnly|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveActorOnReleased(struct Unknown ButtonReleased); // Function Engine.Actor.ReceiveActorOnReleased(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveActorOnInputTouchLeave(char FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchLeave(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveActorOnInputTouchEnter(char FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchEnter(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveActorOnInputTouchEnd(char FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchEnd(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveActorOnInputTouchBegin(char FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchBegin(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveActorOnClicked(struct Unknown ButtonPressed); // Function Engine.Actor.ReceiveActorOnClicked(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveActorEndOverlap(struct Unknown OtherActor); // Function Engine.Actor.ReceiveActorEndOverlap(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveActorBeginOv(struct Unknown OtherActor); // Function Engine.Actor.ReceiveActorBeginOv(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void PrestreamTextures(float Seconds, char bEnableStreaming, int32_t CinematicTextureGroups); // Function Engine.Actor.PrestreamTextures(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C639F0>
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EA7FD0>
	void OnRep_ReplicatedMov(); // Function Engine.Actor.OnRep_ReplicatedMov(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C639D0>
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner(Native|Protected) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EA7990>
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C639B0>
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EA7B30>
	void MakeNoise(float Loudness, struct Unknown NoiseInstigator, struct Unknown NoiseLocation, float MaxRange, struct FName Tag); // Function Engine.Actor.MakeNoise(Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C63820>
	struct Unknown MakeMIDForMaterial(struct Unknown Parent); // Function Engine.Actor.MakeMIDForMaterial(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C63790>
	char K2_TeleportTo(struct Unknown DestLocation, struct Unknown DestRotation); // Function Engine.Actor.K2_TeleportTo(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C636A0>
	char K2_SetActorTransform(struct Unknown& NewTransform, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.Actor.K2_SetActorTransform(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C634A0>
	char K2_SetActorRotation(struct Unknown NewRotation, char bTeleportPhysics); // Function Engine.Actor.K2_SetActorRotation(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C633C0>
	void K2_SetActorRelativeTransform(struct Unknown& NewRelativeTransform, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.Actor.K2_SetActorRelativeTransform(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C631C0>
	void K2_SetActorRelativeRotation(struct Unknown NewRelativeRotation, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.Actor.K2_SetActorRelativeRotation(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C63020>
	void K2_SetActorRelativeLocation(struct Unknown NewRelativeLocation, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.Actor.K2_SetActorRelativeLocation(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C62E80>
	char K2_SetActorLocationAndRotation(struct Unknown NewLocation, struct Unknown NewRotation, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.Actor.K2_SetActorLocationAndRotation(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C62C80>
	char K2_SetActorLocation(struct Unknown NewLocation, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.Actor.K2_SetActorLocation(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C62AD0>
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void K2_OnEndViewTarget(struct Unknown PC); // Function Engine.Actor.K2_OnEndViewTarget(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void K2_OnBecomeViewTarget(struct Unknown PC); // Function Engine.Actor.K2_OnBecomeViewTarget(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	struct Unknown K2_GetRootComponent(); // Function Engine.Actor.K2_GetRootComponent(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C62AB0>
	struct TArray<Unknown> K2_GetComponentsByClass(struct Unknown* ComponentClass); // Function Engine.Actor.K2_GetComponentsByClass(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C629D0>
	struct Unknown K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C62910>
	struct Unknown K2_GetActorLocation(); // Function Engine.Actor.K2_GetActorLocation(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C62870>
	void K2_DetachFromActor(enum class Unknow LocationRule, enum class Unknow RotationRule, enum class Unknow ScaleRule); // Function Engine.Actor.K2_DetachFromActor(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C62770>
	void K2_DestroyComponent(struct Unknown Component); // Function Engine.Actor.K2_DestroyComponent(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C626F0>
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C626D0>
	void K2_AttachToComponent(struct Unknown Parent, struct FName SocketName, enum class Unknow LocationRule, enum class Unknow RotationRule, enum class Unknow ScaleRule, char bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachToComponent(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C62510>
	void K2_AttachToActor(struct Unknown ParentActor, struct FName SocketName, enum class Unknow LocationRule, enum class Unknow RotationRule, enum class Unknow ScaleRule, char bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachToActor(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C62350>
	void K2_AttachRootComponentToActor(struct Unknown InParentActor, struct FName InSocketName, char AttachLocationType, char bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachRootComponentToActor(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C62200>
	void K2_AttachRootComponentTo(struct Unknown InParent, struct FName InSocketName, char AttachLocationType, char bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachRootComponentTo(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C620B0>
	void K2_AddActorWorldTransform(struct Unknown& DeltaTransform, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.Actor.K2_AddActorWorldTransform(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C61EB0>
	void K2_AddActorWorldRotation(struct Unknown DeltaRotation, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.Actor.K2_AddActorWorldRotation(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C61D10>
	void K2_AddActorWorldOffset(struct Unknown DeltaLocation, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.Actor.K2_AddActorWorldOffset(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C61B70>
	void K2_AddActorLocalTransform(struct Unknown& NewTransform, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.Actor.K2_AddActorLocalTransform(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C61970>
	void K2_AddActorLocalRotation(struct Unknown DeltaRotation, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.Actor.K2_AddActorLocalRotation(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C617D0>
	void K2_AddActorLocalOffset(struct Unknown DeltaLocation, char bSweep, struct Unknown& SweepHitResult, char bTeleport); // Function Engine.Actor.K2_AddActorLocalOffset(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C61630>
	char IsOverlappingActor(struct Unknown Other); // Function Engine.Actor.IsOverlappingActor(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C615A0>
	char IsChildActor(); // Function Engine.Actor.IsChildActor(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C61570>
	char IsActorTickEnabled(); // Function Engine.Actor.IsActorTickEnabled(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C61540>
	char IsActorBeingDestroyed(); // Function Engine.Actor.IsActorBeingDestroyed(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C61510>
	char HasAuthority(); // Function Engine.Actor.HasAuthority(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C614E0>
	float GetVerticalDistanceTo(struct Unknown OtherActor); // Function Engine.Actor.GetVerticalDistanceTo(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C61440>
	struct Unknown GetVelocity(); // Function Engine.Actor.GetVelocity(Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C61400>
	struct Unknown GetTransform(); // Function Engine.Actor.GetTransform(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C613B0>
	char GetTickableWhenPaused(); // Function Engine.Actor.GetTickableWhenPaused(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C61380>
	float GetSquaredDistanceTo(struct Unknown OtherActor); // Function Engine.Actor.GetSquaredDistanceTo(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C612E0>
	char GetRemoteRole(); // Function Engine.Actor.GetRemoteRole(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C612C0>
	struct Unknown GetParentComponent(); // Function Engine.Actor.GetParentComponent(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C61290>
	struct Unknown GetParentActor(); // Function Engine.Actor.GetParentActor(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C61260>
	struct Unknown GetOwner(); // Function Engine.Actor.GetOwner(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C61240>
	void GetOverlappingComponents(struct TArray<Unknown>& OverlappingComponents); // Function Engine.Actor.GetOverlappingComponents(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C61190>
	void GetOverlappingActors(struct TArray<Unknown>& OverlappingActors, struct Unknown* ClassFilter); // Function Engine.Actor.GetOverlappingActors(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C61090>
	char GetLocalRole(); // Function Engine.Actor.GetLocalRole(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C61070>
	float GetLifeSpan(); // Function Engine.Actor.GetLifeSpan(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C61030>
	struct Unknown GetInstigatorController(); // Function Engine.Actor.GetInstigatorController(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C61000>
	struct Unknown GetInstigator(); // Function Engine.Actor.GetInstigator(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60FD0>
	struct Unknown GetInputVectorAxisValue(struct Unknown InputAxisKey); // Function Engine.Actor.GetInputVectorAxisValue(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60ED0>
	float GetInputAxisValue(struct FName InputAxisName); // Function Engine.Actor.GetInputAxisValue(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60E30>
	float GetInputAxisKeyValue(struct Unknown InputAxisKey); // Function Engine.Actor.GetInputAxisKeyValue(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60D40>
	float GetHorizontalDotProductTo(struct Unknown OtherActor); // Function Engine.Actor.GetHorizontalDotProductTo(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60CA0>
	float GetHorizontalDistanceTo(struct Unknown OtherActor); // Function Engine.Actor.GetHorizontalDistanceTo(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60C00>
	float GetGameTimeSinceCreation(); // Function Engine.Actor.GetGameTimeSinceCreation(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60BD0>
	float GetDotProductTo(struct Unknown OtherActor); // Function Engine.Actor.GetDotProductTo(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60B30>
	float GetDistanceTo(struct Unknown OtherActor); // Function Engine.Actor.GetDistanceTo(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60A90>
	struct TArray<Unknown> GetComponentsByTag(struct Unknown* ComponentClass, struct FName Tag); // Function Engine.Actor.GetComponentsByTag(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60980>
	struct TArray<Unknown> GetComponentsByInterface(struct Unknown* Interface); // Function Engine.Actor.GetComponentsByInterface(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C608A0>
	struct Unknown GetComponentByClass(struct Unknown* ComponentClass); // Function Engine.Actor.GetComponentByClass(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60810>
	struct FName GetAttachParentSocketName(); // Function Engine.Actor.GetAttachParentSocketName(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60590>
	void GetAttachParentActors(struct TArray<Unknown>& OutActors); // Function Engine.Actor.GetAttachParentActors(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C604E0>
	struct Unknown GetAttachParentActorMost(); // Function Engine.Actor.GetAttachParentActorMost(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C604B0>
	struct Unknown GetAttachParentActor(); // Function Engine.Actor.GetAttachParentActor(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60480>
	void GetAttachedActorsRecursive(struct TArray<Unknown>& OutActors, char bIncludeChildActor); // Function Engine.Actor.GetAttachedActorsRecursive(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60710>
	void GetAttachedActors(struct TArray<Unknown>& OutActors, char b, char bIncludeChildActor); // Function Engine.Actor.GetAttachedActors(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C605D0>
	void GetAllChildActors(struct TArray<Unknown>& ChildActors, char bIncludeDescendants); // Function Engine.Actor.GetAllChildActors(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60380>
	struct Unknown GetActorUpVector(); // Function Engine.Actor.GetActorUpVector(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60310>
	float GetActorTimeDilation(); // Function Engine.Actor.GetActorTimeDilation(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C602E0>
	float GetActorTickInterval(); // Function Engine.Actor.GetActorTickInterval(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C602B0>
	struct Unknown GetActorScale3D(); // Function Engine.Actor.GetActorScale3D(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60270>
	struct Unknown GetActorRightVector(); // Function Engine.Actor.GetActorRightVector(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60200>
	struct Unknown GetActorRelativeScale3D(); // Function Engine.Actor.GetActorRelativeScale3D(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C601C0>
	struct Unknown GetActorForwardVector(); // Function Engine.Actor.GetActorForwardVector(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60150>
	void GetActorEyesViewPoint(struct Unknown& OutLocation, struct Unknown& OutRotation); // Function Engine.Actor.GetActorEyesViewPoint(Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60060>
	char GetActorEnableCollision(); // Function Engine.Actor.GetActorEnableCollision(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C60030>
	void GetActorBounds(char bOnlyCollidingComponents, struct Unknown& Origin, struct Unknown& BoxExtent, char bIncludeFromChildActors); // Function Engine.Actor.GetActorBounds(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C5FEB0>
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C5FE90>
	void FlushNetDormancy(); // Function Engine.Actor.FlushNetDormancy(Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C5FE70>
	void EnableInput(struct Unknown PlayerController); // Function Engine.Actor.EnableInput(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C5FDE0>
	void DisableInput(struct Unknown PlayerController); // Function Engine.Actor.DisableInput(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C5FD50>
	void DetachRootComponentFromParent(char bMaintainWorldPosition); // Function Engine.Actor.DetachRootComponentFromParent(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C5FCC0>
	void AddTickPrerequisiteComponent(struct Unknown PrerequisiteComponent); // Function Engine.Actor.AddTickPrerequisiteComponent(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C5FC30>
	void AddTickPrerequisiteActor(struct Unknown PrerequisiteActor); // Function Engine.Actor.AddTickPrerequisiteActor(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C5FBA0>
	struct Unknown AddComponent(struct FName TemplateName, char bManualAttachment, struct Unknown& RelativeTransform, struct Unknown ComponentTemplateContext); // Function Engine.Actor.AddComponent(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C5F9E0>
	char ActorHasTag(struct FName Tag); // Function Engine.Actor.ActorHasTag(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C5F950>
};

// Class Engine.SkeletalMeshActor
struct ASkeletalMeshActor : UActor {
	char bShouldDoAnimNotifies : 0; // 0x318 (1)
	char bWakeOnLevelStart : 0; // 0x318 (1)
	struct Unknown SkeletalMeshComponent; // 0x320 (8)
	struct Unknown ReplicatedMesh; // 0x328 (8)
	struct Unknown ReplicatedPhysAsset; // 0x330 (8)
	struct Unknown ReplicatedMaterial0; // 0x338 (8)
	struct Unknown ReplicatedMaterial1; // 0x340 (8)

	void OnRep_ReplicatedPhysAsset(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedPhysAsset(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x12372B0>
	void OnRep_ReplicatedMesh(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMesh(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E52540>
	void OnRep_ReplicatedMaterial1(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMaterial1(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F1B4E0>
	void OnRep_ReplicatedMaterial0(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMaterial0(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F1CD70>
};

// Class Engine.PrimitiveComponent
struct UPrimitiveComponent : USceneComponent {
	float MinDrawDistance; // 0x240 (4)
	float LDMaxDrawDistance; // 0x244 (4)
	float CachedMaxDrawDistance; // 0x248 (4)
	char DepthPriorityGroup; // 0x24C (1)
	char ViewOwnerDepthPriorityGroup; // 0x24D (1)
	char IndirectLightingCacheQuality; // 0x24E (1)
	enum class Unknow LightmapType; // 0x24F (1)
	char bUseMaxLODAsImposter : 0; // 0x250 (1)
	char bBatchImpostersAsInstances : 0; // 0x250 (1)
	char bNeverDistanceCull : 0; // 0x250 (1)
	char bAlwaysCreatePhysicsState : 0; // 0x250 (1)
	char bGenerateOverlapEvents : 0; // 0x251 (1)
	char bMultiBodyOverlap : 0; // 0x251 (1)
	char bTraceComplexOnMove : 0; // 0x251 (1)
	char b : 0; // 0x251 (1)
	char bUseViewOwnerDepthPriorityGroup : 0; // 0x251 (1)
	char bAllowCullDistanceVolume : 0; // 0x251 (1)
	char bHasMotionBlurVelocityMeshes : 0; // 0x251 (1)
	char bVisibleInReflectionCaptures : 0; // 0x251 (1)
	char bVisibleInRayTracing : 0; // 0x252 (1)
	char b : 0; // 0x252 (1)
	char b : 0; // 0x252 (1)
	char b : 0; // 0x252 (1)
	char bOwnerNoSee : 0; // 0x252 (1)
	char bOnlyOwnerSee : 0; // 0x252 (1)
	char bIgnoreNearClippingForOcclusion : 0; // 0x252 (1)
	char bTreatAsBackgroundForOcclusion : 0; // 0x252 (1)
	char bUseAsOccluder : 0; // 0x253 (1)
	char bSelectable : 0; // 0x253 (1)
	char bForceMipStreaming : 0; // 0x253 (1)
	char bHasPerInstanceHitProxies : 0; // 0x253 (1)
	char CastShadow : 0; // 0x253 (1)
	char bAffectDynamicIndirectLighting : 0; // 0x253 (1)
	char bAffectDistanceFieldLighting : 0; // 0x253 (1)
	char bCastDynamicShadow : 0; // 0x253 (1)
	char bCastStaticShadow : 0; // 0x254 (1)
	char bCastDirectionalShadow : 0; // 0x254 (1)
	char bCastVolumetricTranslucentShadow : 0; // 0x254 (1)
	char bSelfShadowOnly : 0; // 0x254 (1)
	char bCastFarShadow : 0; // 0x254 (1)
	char bCastInsetShadow : 0; // 0x254 (1)
	char bCastCinematicShadow : 0; // 0x254 (1)
	char bCastHiddenShadow : 0; // 0x254 (1)
	char bCastShadowAsTwoSided : 0; // 0x255 (1)
	char bLightAsIfStatic : 0; // 0x255 (1)
	char bLightAttachmentsAsGroup : 0; // 0x255 (1)
	char bExcludeFromLightAttachmentGroup : 0; // 0x255 (1)
	char b : 0; // 0x255 (1)
	char bSingleSampleShadowFromStationaryLights : 0; // 0x255 (1)
	char bIgnoreRadialImpulse : 0; // 0x255 (1)
	char bIgnoreRadialForce : 0; // 0x255 (1)
	char bApplyImpulseOnDamage : 0; // 0x256 (1)
	char b : 0; // 0x256 (1)
	char bFillCollisionUnderneathForNavmesh : 0; // 0x256 (1)
	char AlwaysLoadOnClient : 0; // 0x256 (1)
	char AlwaysLoadOnServer : 0; // 0x256 (1)
	char bUseEditorCompositing : 0; // 0x256 (1)
	char b : 0; // 0x256 (1)
	char bHasNoStreamableTextures : 0; // 0x257 (1)
	char bHasCustomNavigableGeometry; // 0x258 (1)
	char CanCharacterStepUpOn; // 0x25A (1)
	struct Unknown LightingChannels; // 0x25B (1)
	enum class Unknow CustomDepthStencilWriteMask; // 0x25C (1)
	int32_t CustomDepthStencilValue; // 0x260 (4)
	struct Unknown CustomPrimitiveData; // 0x268 (16)
	struct Unknown CustomPrimitiveDataInternal; // 0x278 (16)
	int32_t TranslucencySortPriority; // 0x288 (4)
	int32_t VisibilityId; // 0x28C (4)
	struct TArray<Unknown> RuntimeVirtualTextures; // 0x290 (16)
	int8_t VirtualTextureLodBias; // 0x2A0 (1)
	int8_t VirtualTextureCullMips; // 0x2A1 (1)
	int8_t VirtualTextureMinCoverage; // 0x2A2 (1)
	enum class Unknow VirtualTextureRenderPassType; // 0x2A3 (1)
	float LpvBiasMultiplier; // 0x2A8 (4)
	float BoundsScale; // 0x2B4 (4)
	struct TArray<Unknown> MoveIgnoreActors; // 0x2C8 (16)
	struct TArray<Unknown> MoveIgnoreComponents; // 0x2D8 (16)
	struct Unknown BodyInstance; // 0x2F8 (400)
	struct FMulticastSparseDelegate OnComponentHit; // 0x488 (1)
	struct FMulticastSparseDelegate OnComponentBeginOverlap; // 0x489 (1)
	struct FMulticastSparseDelegate OnComponentEndOverlap; // 0x48A (1)
	struct FMulticastSparseDelegate OnComponentWake; // 0x48B (1)
	struct FMulticastSparseDelegate OnComponentSleep; // 0x48C (1)
	struct FMulticastSparseDelegate OnBeginCursorOver; // 0x48E (1)
	struct FMulticastSparseDelegate OnEndCursorOver; // 0x48F (1)
	struct FMulticastSparseDelegate OnClicked; // 0x490 (1)
	struct FMulticastSparseDelegate OnReleased; // 0x491 (1)
	struct FMulticastSparseDelegate OnInputTouchBegin; // 0x492 (1)
	struct FMulticastSparseDelegate OnInputTouchEnd; // 0x493 (1)
	struct FMulticastSparseDelegate OnInputTouchEnter; // 0x494 (1)
	struct FMulticastSparseDelegate OnInputTouchLeave; // 0x495 (1)
	struct Unknown LODParentPrimitive; // 0x4B0 (8)

	char WasRecentlyRendered(float Tolerance); // Function Engine.PrimitiveComponent.WasRecentlyRendered(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD5B30>
	void WakeRigidBody(struct FName BoneName); // Function Engine.PrimitiveComponent.WakeRigidBody(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD5AA0>
	void WakeAllRigidBodies(); // Function Engine.PrimitiveComponent.WakeAllRigidBodies(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB47A0>
	void SetWalkableSlopeOverride(struct Unknown& NewOverride); // Function Engine.PrimitiveComponent.SetWalkableSlopeOverride(Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD59F0>
	void SetUseCCD(char InUseCCD, struct FName BoneName); // Function Engine.PrimitiveComponent.SetUseCCD(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD5920>
	void SetTranslucentSortPriority(int32_t NewTranslucentSortPriority); // Function Engine.PrimitiveComponent.SetTranslucentSortPriority(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD58A0>
	void SetSingleSampleShadowFromStationaryLights(char bNewSingleSampleShadowFromStationaryLights); // Function Engine.PrimitiveComponent.SetSingleSampleShadowFromStationaryLights(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD5810>
	void SetSimulatePhysics(char bSimulate); // Function Engine.PrimitiveComponent.SetSimulatePhysics(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD5780>
	void SetRenderInMainPass(char bValue); // Function Engine.PrimitiveComponent.SetRenderInMainPass(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD56F0>
	void SetRenderCustomDepth(char bValue); // Function Engine.PrimitiveComponent.SetRenderCustomDepth(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD5660>
	void SetReceivesDecals(char bNewReceivesDecals); // Function Engine.PrimitiveComponent.SetReceivesDecals(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD55D0>
	void SetPhysMaterialOverride(struct Unknown NewPhysMaterial); // Function Engine.PrimitiveComponent.SetPhysMaterialOverride(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD4FA0>
	void SetPhysicsMaxAngularVelocityInRadians(float NewMaxAngVel, char bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocityInRadians(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD54C0>
	void SetPhysicsMaxAngularVelocityInDegrees(float NewMaxAngVel, char bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocityInDegrees(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD53B0>
	void SetPhysicsMaxAngularVelocity(float NewMaxAngVel, char bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocity(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD53B0>
	void SetPhysicsLinearVelocity(struct Unknown NewVel, char bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsLinearVelocity(Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD5290>
	void SetPhysicsAngularVelocityInRadians(struct Unknown NewAngVel, char bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocityInRadians(Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD5170>
	void SetPhysicsAngularVelocityInDegrees(struct Unknown NewAngVel, char bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocityInDegrees(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD5030>
	void SetPhysicsAngularVelocity(struct Unknown NewAngVel, char bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocity(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD5030>
	void SetOwnerNoSee(char bNewOwnerNoSee); // Function Engine.PrimitiveComponent.SetOwnerNoSee(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD4F10>
	void SetOnlyOwnerSee(char bNewOnlyOwnerSee); // Function Engine.PrimitiveComponent.SetOnlyOwnerSee(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD4E80>
	void SetNotifyRigidBodyCollision(char bNewNotifyRigidBodyCollision); // Function Engine.PrimitiveComponent.SetNotifyRigidBodyCollision(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD4DF0>
	void SetMaterialByName(struct FName MaterialSlotName, struct Unknown Material); // Function Engine.PrimitiveComponent.SetMaterialByName(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD4D20>
	void SetMaterial(int32_t ElementIndex, struct Unknown Material); // Function Engine.PrimitiveComponent.SetMaterial(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD4C50>
	void SetMassScale(struct FName BoneName, float InMassScale); // Function Engine.PrimitiveComponent.SetMassScale(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD4B80>
	void SetMassOverrideInKg(struct FName BoneName, float MassInKg, char bOverrideMass); // Function Engine.PrimitiveComponent.SetMassOverrideInKg(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD4A80>
	void SetLinearDamping(float InDamping); // Function Engine.PrimitiveComponent.SetLinearDamping(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD4A00>
	void SetLightingChannels(char bChannel0, char bChannel1, char bChannel2); // Function Engine.PrimitiveComponent.SetLightingChannels(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD48E0>
	void SetLightAttachmentsAsGroup(char bInLightAttachmentsAsGroup); // Function Engine.PrimitiveComponent.SetLightAttachmentsAsGroup(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD4850>
	void SetGenerateOverlapEvents(char bInGenerateOverlapEvents); // Function Engine.PrimitiveComponent.SetGenerateOverlapEvents(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD47C0>
	void SetExcludeFromLightAttachmentGroup(char bInExcludeFromLightAttachmentGroup); // Function Engine.PrimitiveComponent.SetExcludeFromLightAttachmentGroup(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD4730>
	void SetEnableGravity(char bGravityEnabled); // Function Engine.PrimitiveComponent.SetEnableGravity(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD46A0>
	void SetCustomPrimitiveDataVector4(int32_t DataIndex, struct Unknown Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector4(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD45D0>
	void SetCustomPrimitiveDataVector3(int32_t DataIndex, struct Unknown Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector3(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD4500>
	void SetCustomPrimitiveDataVector2(int32_t DataIndex, struct Unknown Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector2(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD4440>
	void SetCustomPrimitiveDataFloat(int32_t DataIndex, float Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataFloat(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD4370>
	void SetCustomDepthStencilWriteMask(enum class Unknow WriteMaskBit); // Function Engine.PrimitiveComponent.SetCustomDepthStencilWriteMask(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD42F0>
	void SetCustomDepthStencilValue(int32_t Value); // Function Engine.PrimitiveComponent.SetCustomDepthStencilValue(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD4270>
	void SetCullDistance(float NewCullDistance); // Function Engine.PrimitiveComponent.SetCullDistance(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD41F0>
	void SetConstraintMode(char ConstraintMode); // Function Engine.PrimitiveComponent.SetConstraintMode(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD4170>
	void SetCollisionResponseToChannel(char Channel, char NewResponse); // Function Engine.PrimitiveComponent.SetCollisionResponseToChannel(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD40B0>
	void SetCollisionResponseToAllChannels(char NewResponse); // Function Engine.PrimitiveComponent.SetCollisionResponseToAllChannels(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD4030>
	void SetCollisionProfileName(struct FName InCollisionProfileName, char bUpdateOverlaps); // Function Engine.PrimitiveComponent.SetCollisionProfileName(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD3F60>
	void SetCollisionObjectType(char Channel); // Function Engine.PrimitiveComponent.SetCollisionObjectType(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD3EE0>
	void SetCollisionEnabled(char NewType); // Function Engine.PrimitiveComponent.SetCollisionEnabled(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD3E60>
	void SetCenterOfMass(struct Unknown CenterOfMassOffset, struct FName BoneName); // Function Engine.PrimitiveComponent.SetCenterOfMass(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD3D90>
	void SetCastShadow(char NewCastShadow); // Function Engine.PrimitiveComponent.SetCastShadow(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD3D00>
	void SetCastInsetShadow(char bInCastInsetShadow); // Function Engine.PrimitiveComponent.SetCastInsetShadow(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD3C70>
	void SetBoundsScale(float NewBoundsScale); // Function Engine.PrimitiveComponent.SetBoundsScale(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD3BF0>
	void SetAngularDamping(float InDamping); // Function Engine.PrimitiveComponent.SetAngularDamping(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD3B70>
	void SetAllUseCCD(char InUseCCD); // Function Engine.PrimitiveComponent.SetAllUseCCD(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DC5450>
	void SetAllPhysicsLinearVelocity(struct Unknown NewVel, char bAddToCurrent); // Function Engine.PrimitiveComponent.SetAllPhysicsLinearVelocity(Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD3A90>
	void SetAllPhysicsAngularVelocityInRadians(struct Unknown& NewAngVel, char bAddToCurrent); // Function Engine.PrimitiveComponent.SetAllPhysicsAngularVelocityInRadians(Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD39B0>
	void SetAllPhysicsAngularVelocityInDegrees(struct Unknown& NewAngVel, char bAddToCurrent); // Function Engine.PrimitiveComponent.SetAllPhysicsAngularVelocityInDegrees(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD3890>
	void SetAllMassScale(float InMassScale); // Function Engine.PrimitiveComponent.SetAllMassScale(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB3660>
	struct Unknown ScaleByMomentOfInertia(struct Unknown InputVector, struct FName BoneName); // Function Engine.PrimitiveComponent.ScaleByMomentOfInertia(Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD3790>
	void PutRigidBodyToSleep(struct FName BoneName); // Function Engine.PrimitiveComponent.PutRigidBodyToSleep(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD3710>
	char K2_SphereTraceComponent(struct Unknown TraceStart, struct Unknown TraceEnd, float SphereRadius, char bTraceComplex, char bShowTrace, char bPersistentShowTrace, struct Unknown& HitLocation, struct Unknown& HitNormal, struct FName& BoneName, struct Unknown& OutHit); // Function Engine.PrimitiveComponent.K2_SphereTraceComponent(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD3380>
	char K2_SphereOverlapComponent(struct Unknown InSphereCentre, float InSphereRadius, char bTraceComplex, char bShowTrace, char bPersistentShowTrace, struct Unknown& HitLocation, struct Unknown& HitNormal, struct FName& BoneName, struct Unknown& OutHit); // Function Engine.PrimitiveComponent.K2_SphereOverlapComponent(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD3040>
	char K2_LineTraceComponent(struct Unknown TraceStart, struct Unknown TraceEnd, char bTraceComplex, char bShowTrace, char bPersistentShowTrace, struct Unknown& HitLocation, struct Unknown& HitNormal, struct FName& BoneName, struct Unknown& OutHit); // Function Engine.PrimitiveComponent.K2_LineTraceComponent(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD2CF0>
	char K2_IsQueryCollisionEnabled(); // Function Engine.PrimitiveComponent.K2_IsQueryCollisionEnabled(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD2CB0>
	char K2_IsPhysicsCollisionEnabled(); // Function Engine.PrimitiveComponent.K2_IsPhysicsCollisionEnabled(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD2C70>
	char K2_IsCollisionEnabled(); // Function Engine.PrimitiveComponent.K2_IsCollisionEnabled(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD2C30>
	char K2_BoxOverlapComponent(struct Unknown InBoxCentre, struct Unknown InBox, char bTraceComplex, char bShowTrace, char bPersistentShowTrace, struct Unknown& HitLocation, struct Unknown& HitNormal, struct FName& BoneName, struct Unknown& OutHit); // Function Engine.PrimitiveComponent.K2_BoxOverlapComponent(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD28E0>
	char IsOverlappingComponent(struct Unknown OtherComp); // Function Engine.PrimitiveComponent.IsOverlappingComponent(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD2850>
	char IsOverlappingActor(struct Unknown Other); // Function Engine.PrimitiveComponent.IsOverlappingActor(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD27C0>
	char IsGravityEnabled(); // Function Engine.PrimitiveComponent.IsGravityEnabled(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CBFFA0>
	char IsAnyRigidBodyAwake(); // Function Engine.PrimitiveComponent.IsAnyRigidBodyAwake(Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD2790>
	void IgnoreComponentWhenMoving(struct Unknown Component, char bShouldIgnore); // Function Engine.PrimitiveComponent.IgnoreComponentWhenMoving(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD26C0>
	void IgnoreActorWhenMoving(struct Unknown Actor, char bShouldIgnore); // Function Engine.PrimitiveComponent.IgnoreActorWhenMoving(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD25F0>
	struct Unknown GetWalkableSlopeOverride(); // Function Engine.PrimitiveComponent.GetWalkableSlopeOverride(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD25C0>
	struct Unknown GetPhysicsLinearVelocityAtPoint(struct Unknown Point, struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocityAtPoint(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD24D0>
	struct Unknown GetPhysicsLinearVelocity(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocity(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD2430>
	struct Unknown GetPhysicsAngularVelocityInRadians(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocityInRadians(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD2390>
	struct Unknown GetPhysicsAngularVelocityInDegrees(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocityInDegrees(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD22C0>
	struct Unknown GetPhysicsAngularVelocity(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocity(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD22C0>
	void GetOverlappingComponents(struct TArray<Unknown>& OutOverlappingComponents); // Function Engine.PrimitiveComponent.GetOverlappingComponents(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD2210>
	void GetOverlappingActors(struct TArray<Unknown>& OverlappingActors, struct Unknown* ClassFilter); // Function Engine.PrimitiveComponent.GetOverlappingActors(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD2110>
	int32_t GetNumMaterials(); // Function Engine.PrimitiveComponent.GetNumMaterials(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD20E0>
	struct Unknown GetMaterialFromCollisionFaceIndex(int32_t FaceIndex, int32_t& SectionIndex); // Function Engine.PrimitiveComponent.GetMaterialFromCollisionFaceIndex(Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD2000>
	struct Unknown GetMaterial(int32_t ElementIndex); // Function Engine.PrimitiveComponent.GetMaterial(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1F60>
	float GetMassScale(struct FName BoneName); // Function Engine.PrimitiveComponent.GetMassScale(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1EC0>
	float GetMass(); // Function Engine.PrimitiveComponent.GetMass(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1E80>
	float GetLinearDamping(); // Function Engine.PrimitiveComponent.GetLinearDamping(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1E40>
	struct Unknown GetInertiaTensor(struct FName BoneName); // Function Engine.PrimitiveComponent.GetInertiaTensor(Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1D90>
	char GetGenerateOverlapEvents(); // Function Engine.PrimitiveComponent.GetGenerateOverlapEvents(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1D60>
	char GetCollisionResponseToChannel(char Channel); // Function Engine.PrimitiveComponent.GetCollisionResponseToChannel(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1CD0>
	struct FName GetCollisionProfileName(); // Function Engine.PrimitiveComponent.GetCollisionProfileName(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1C90>
	char GetCollisionObjectType(); // Function Engine.PrimitiveComponent.GetCollisionObjectType(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1C60>
	char GetCollisionEnabled(); // Function Engine.PrimitiveComponent.GetCollisionEnabled(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1C30>
	float GetClosestPointOnCollision(struct Unknown& Point, struct Unknown& OutPointOnBody, struct FName BoneName); // Function Engine.PrimitiveComponent.GetClosestPointOnCollision(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1AF0>
	struct Unknown GetCenterOfMass(struct FName BoneName); // Function Engine.PrimitiveComponent.GetCenterOfMass(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1A50>
	float GetAngularDamping(); // Function Engine.PrimitiveComponent.GetAngularDamping(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1A10>
	struct Unknown CreateDynamicMaterialInstance(int32_t ElementIndex, struct Unknown SourceMaterial, struct FName OptionalName); // Function Engine.PrimitiveComponent.CreateDynamicMaterialInstance(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1900>
	struct Unknown CreateAndSetMaterialInstanceDynamicFromMaterial(int32_t ElementIndex, struct Unknown Parent); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamicFromMaterial(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1830>
	struct Unknown CreateAndSetMaterialInstanceDynamic(int32_t ElementIndex); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamic(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1790>
	struct TArray<Unknown> CopyArrayOfMoveIgnoreComponents(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreComponents(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1710>
	struct TArray<Unknown> CopyArrayOfMoveIgnoreActors(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreActors(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1690>
	void ClearMoveIgnoreComponents(); // Function Engine.PrimitiveComponent.ClearMoveIgnoreComponents(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1660>
	void ClearMoveIgnoreActors(); // Function Engine.PrimitiveComponent.ClearMoveIgnoreActors(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1640>
	char CanCharacterStepUp(struct Unknown Pawn); // Function Engine.PrimitiveComponent.CanCharacterStepUp(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD15A0>
	void AddTorqueInRadians(struct Unknown Torque, struct FName BoneName, char bAccelChange); // Function Engine.PrimitiveComponent.AddTorqueInRadians(Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1340>
	void AddTorqueInDegrees(struct Unknown Torque, struct FName BoneName, char bAccelChange); // Function Engine.PrimitiveComponent.AddTorqueInDegrees(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1460>
	void AddTorque(struct Unknown Torque, struct FName BoneName, char bAccelChange); // Function Engine.PrimitiveComponent.AddTorque(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1340>
	void AddRadialImpulse(struct Unknown Origin, float Radius, float Strength, char Falloff, char bVelChange); // Function Engine.PrimitiveComponent.AddRadialImpulse(Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD1180>
	void AddRadialForce(struct Unknown Origin, float Radius, float Strength, char Falloff, char bAccelChange); // Function Engine.PrimitiveComponent.AddRadialForce(Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD0FC0>
	void AddImpulseAtLocation(struct Unknown Impulse, struct Unknown Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddImpulseAtLocation(Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD0E90>
	void AddImpulse(struct Unknown Impulse, struct FName BoneName, char bVelChange); // Function Engine.PrimitiveComponent.AddImpulse(Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD0D70>
	void AddForceAtLocationLocal(struct Unknown Force, struct Unknown Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddForceAtLocationLocal(Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD0C40>
	void AddForceAtLocation(struct Unknown Force, struct Unknown Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddForceAtLocation(Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD0B10>
	void AddForce(struct Unknown Force, struct FName BoneName, char bAccelChange); // Function Engine.PrimitiveComponent.AddForce(Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD09F0>
	void AddAngularImpulseInRadians(struct Unknown Impulse, struct FName BoneName, char bVelChange); // Function Engine.PrimitiveComponent.AddAngularImpulseInRadians(Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD08D0>
	void AddAngularImpulseInDegrees(struct Unknown Impulse, struct FName BoneName, char bVelChange); // Function Engine.PrimitiveComponent.AddAngularImpulseInDegrees(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD0790>
	void AddAngularImpulse(struct Unknown Impulse, struct FName BoneName, char bVelChange); // Function Engine.PrimitiveComponent.AddAngularImpulse(Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DD0670>
};

// Class Engine.MeshComponent
struct UMeshComponent : UPrimitiveComponent {
	float MipStreamingScale; // 0x4B8 (4)
	struct TArray<Unknown> OverrideMaterials; // 0x4C0 (16)
	char bEnableMaterialParameterCaching : 0; // 0x4E0 (1)

	void SetVectorParameterValueOnMaterials(struct FName ParameterName, struct Unknown ParameterValue); // Function Engine.MeshComponent.SetVectorParameterValueOnMaterials(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3D8D520>
	void SetScalarParameterValueOnMaterials(struct FName ParameterName, float ParameterValue); // Function Engine.MeshComponent.SetScalarParameterValueOnMaterials(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3D8D450>
	void SetColorParameterValueOnMaterials(struct FName ParameterName, struct Unknown ParameterValue); // Function Engine.MeshComponent.SetColorParameterValueOnMaterials(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3D8D220>
	void PrestreamTextures(float Seconds, char bPrioritizeCharacterTextures, int32_t CinematicTextureGroups); // Function Engine.MeshComponent.PrestreamTextures(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3D8D110>
	char IsMaterialSlotNameValid(struct FName MaterialSlotName); // Function Engine.MeshComponent.IsMaterialSlotNameValid(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3D8D070>
	struct TArray<Unknown> GetMaterialSlotNames(); // Function Engine.MeshComponent.GetMaterialSlotNames(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3D8CF70>
	struct TArray<Unknown> GetMaterials(); // Function Engine.MeshComponent.GetMaterials(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3D8CFF0>
	int32_t GetMaterialIndex(struct FName MaterialSlotName); // Function Engine.MeshComponent.GetMaterialIndex(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3D8CED0>
};

// Class Engine.SkinnedMeshComponent
struct USkinnedMeshComponent : UMeshComponent {
	struct Unknown SkeletalMesh; // 0x4E8 (8)
	struct TWeakObjectPtr<struct Unknown> MasterPoseComponent; // 0x4F0 (8)
	struct TArray<Unknown> SkinCacheUsage; // 0x4F8 (16)
	struct Unknown PhysicsAssetOverride; // 0x600 (8)
	int32_t ForcedLodModel; // 0x608 (4)
	int32_t MinLodModel; // 0x60C (4)
	float StreamingDistanceMultiplier; // 0x618 (4)
	struct TArray<Unknown> LODInfo; // 0x628 (16)
	enum class Unknow VisibilityBasedAnimTickOption; // 0x65C (1)
	char bOverrideMinLod : 0; // 0x65E (1)
	char bUseBoundsFromMasterPoseComponent : 0; // 0x65E (1)
	char bForceWireframe : 0; // 0x65E (1)
	char bDisplayBones : 0; // 0x65E (1)
	char bDisableMorphTarget : 0; // 0x65E (1)
	char bHideSkin : 0; // 0x65E (1)
	char bPerBoneMotionBlur : 0; // 0x65F (1)
	char bComponentUseFixedSkelBounds : 0; // 0x65F (1)
	char bConsiderAllBodiesForBounds : 0; // 0x65F (1)
	char bSyncAttachParentLOD : 0; // 0x65F (1)
	char bCanHighlightSelectedSections : 0; // 0x65F (1)
	char b : 0; // 0x65F (1)
	char bCastCapsuleDirectShadow : 0; // 0x65F (1)
	char bCastCapsuleIndirectShadow : 0; // 0x65F (1)
	char bCPUSkinning : 0; // 0x660 (1)
	char bEnableUpdateRateOptimizations : 0; // 0x660 (1)
	char bDisplayDebugUpdateRateOptimizations : 0; // 0x660 (1)
	char b : 0; // 0x660 (1)
	char bIgnoreMasterPoseComponentLOD : 0; // 0x660 (1)
	char bCachedLocalBoundsUpToDate : 0; // 0x660 (1)
	char bForceMeshObjectUpdate : 0; // 0x661 (1)
	float CapsuleIndirectShadowMinVisibility; // 0x664 (4)
	struct Unknown CachedWorldSpaceBounds; // 0x678 (28)
	struct Unknown CachedWorldToLocalTransform; // 0x6A0 (64)

	void UnloadSkinWeightProfile(struct FName InProfileName); // Function Engine.SkinnedMeshComponent.UnloadSkinWeightProfile(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFC400>
	void UnHideBoneByName(struct FName BoneName); // Function Engine.SkinnedMeshComponent.UnHideBoneByName(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFC380>
	void TransformToBoneSpace(struct FName BoneName, struct Unknown InPosition, struct Unknown InRotation, struct Unknown& OutPosition, struct Unknown& OutRotation); // Function Engine.SkinnedMeshComponent.TransformToBoneSpace(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFC1C0>
	void TransformFromBoneSpace(struct FName BoneName, struct Unknown InPosition, struct Unknown InRotation, struct Unknown& OutPosition, struct Unknown& OutRotation); // Function Engine.SkinnedMeshComponent.TransformFromBoneSpace(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFC000>
	void ShowMaterialSection(int32_t MaterialID, int32_t SectionIndex, char bShow, int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ShowMaterialSection(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFBEC0>
	void ShowAllMaterialSections(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ShowAllMaterialSections(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFBE40>
	void SetVertexColorOverride_LinearColor(int32_t LODIndex, struct TArray<Unknown>& VertexColors); // Function Engine.SkinnedMeshComponent.SetVertexColorOverride_LinearColor(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFBD50>
	char SetSkinWeightProfile(struct FName InProfileName); // Function Engine.SkinnedMeshComponent.SetSkinWeightProfile(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFBCC0>
	void SetSkinWeightOverride(int32_t LODIndex, struct TArray<Unknown>& SkinWeights); // Function Engine.SkinnedMeshComponent.SetSkinWeightOverride(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFBBD0>
	void SetSkeletalMesh(struct Unknown NewMesh, char b); // Function Engine.SkinnedMeshComponent.SetSkeletalMesh(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFBB00>
	void SetRenderStatic(char bNewValue); // Function Engine.SkinnedMeshComponent.SetRenderStatic(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFBA70>
	void SetPhysicsAsset(struct Unknown NewPhysicsAsset, char bForceReInit); // Function Engine.SkinnedMeshComponent.SetPhysicsAsset(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFB9A0>
	void SetMinLOD(int32_t InNewMinLOD); // Function Engine.SkinnedMeshComponent.SetMinLOD(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFB920>
	void SetMasterPoseComponent(struct Unknown NewMasterBoneComponent, char bForceUpdate); // Function Engine.SkinnedMeshComponent.SetMasterPoseComponent(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFB850>
	void SetForcedLOD(int32_t InNewForcedLOD); // Function Engine.SkinnedMeshComponent.SetForcedLOD(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFB7D0>
	void SetCastCapsuleIndirectShadow(char bNewValue); // Function Engine.SkinnedMeshComponent.SetCastCapsuleIndirectShadow(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFB740>
	void SetCastCapsuleDirectShadow(char bNewValue); // Function Engine.SkinnedMeshComponent.SetCastCapsuleDirectShadow(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFB6B0>
	void SetCapsuleIndirectShadowMinVisibility(float NewValue); // Function Engine.SkinnedMeshComponent.SetCapsuleIndirectShadowMinVisibility(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFB630>
	char IsUsingSkinWeightProfile(); // Function Engine.SkinnedMeshComponent.IsUsingSkinWeightProfile(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFB600>
	char IsMaterialSectionShown(int32_t MaterialID, int32_t LODIndex); // Function Engine.SkinnedMeshComponent.IsMaterialSectionShown(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFB540>
	char IsBoneHiddenByName(struct FName BoneName); // Function Engine.SkinnedMeshComponent.IsBoneHiddenByName(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFB4B0>
	void HideBoneByName(struct FName BoneName, char PhysBodyOption); // Function Engine.SkinnedMeshComponent.HideBoneByName(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFB2D0>
	char GetTwistAndSwingAngleOfDeltaRotationFromRefPose(struct FName BoneName, float& OutTwistAngle, float& OutSwingAngle); // Function Engine.SkinnedMeshComponent.GetTwistAndSwingAngleOfDeltaRotationFromRefPose(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFB1B0>
	struct FName GetSocketBoneName(struct FName InSocketName); // Function Engine.SkinnedMeshComponent.GetSocketBoneName(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFB080>
	struct Unknown GetRefPosePosition(int32_t BoneIndex); // Function Engine.SkinnedMeshComponent.GetRefPosePosition(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFAFE0>
	struct FName GetParentBone(struct FName BoneName); // Function Engine.SkinnedMeshComponent.GetParentBone(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFAF50>
	int32_t GetNumLODs(); // Function Engine.SkinnedMeshComponent.GetNumLODs(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFAF20>
	int32_t GetNumBones(); // Function Engine.SkinnedMeshComponent.GetNumBones(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFAEF0>
	int32_t GetForcedLOD(); // Function Engine.SkinnedMeshComponent.GetForcedLOD(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFAEC0>
	struct Unknown GetDeltaTransformFromRefPose(struct FName BoneName, struct FName BaseName); // Function Engine.SkinnedMeshComponent.GetDeltaTransformFromRefPose(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFADC0>
	struct FName GetCurrentSkinWeightProfileName(); // Function Engine.SkinnedMeshComponent.GetCurrentSkinWeightProfileName(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFADA0>
	struct FName GetBoneName(int32_t BoneIndex); // Function Engine.SkinnedMeshComponent.GetBoneName(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFAD10>
	int32_t GetBoneIndex(struct FName BoneName); // Function Engine.SkinnedMeshComponent.GetBoneIndex(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFAC80>
	struct FName FindClosestBone_K2(struct Unknown TestLocation, struct Unknown& BoneLocation, float IgnoreScale, char b); // Function Engine.SkinnedMeshComponent.FindClosestBone_K2(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFAAF0>
	void ClearVertexColorOverride(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ClearVertexColorOverride(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFAA70>
	void ClearSkinWeightProfile(); // Function Engine.SkinnedMeshComponent.ClearSkinWeightProfile(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFAA50>
	void ClearSkinWeightOverride(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ClearSkinWeightOverride(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFA9D0>
	char BoneIsChildOf(struct FName BoneName, struct FName ParentBoneName); // Function Engine.SkinnedMeshComponent.BoneIsChildOf(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DFA910>
};

// Class Engine.StreamableRenderAsset
struct UStreamableRenderAsset : Object {
	double ForceMipLevelsToBeResidentTimestamp; // 0x28 (8)
	int32_t NumCinematicMipLevels; // 0x30 (4)
	int32_t StreamingIndex; // 0x34 (4)
	int32_t CachedCombinedLODBias; // 0x38 (4)
	char CachedNumResidentLODs; // 0x3C (1)
	char bCachedReadyForStreaming : 0; // 0x3D (1)
	char NeverStream : 0; // 0x3D (1)
	char bGlobalForceMipLevelsToBeResident : 0; // 0x3D (1)
	char bIsStreamable : 0; // 0x3D (1)
	char bHasStreamingUpdatePending : 0; // 0x3D (1)
	char bForceMiplevelsToBeResident : 0; // 0x3D (1)
	char bIgnoreStreamingMipBias : 0; // 0x3D (1)
	char bUseCinematicMipLev : 0; // 0x3D (1)
};

// Class Engine.SkeletalMesh
struct USkeletalMesh : UStreamableRenderAsset {
	struct Unknown Skeleton; // 0x60 (8)
	struct Unknown ImportedBounds; // 0x68 (28)
	struct Unknown ExtendedBounds; // 0x84 (28)
	struct Unknown PositiveBoundsExtension; // 0xA0 (12)
	struct Unknown NegativeBoundsExtension; // 0xAC (12)
	struct TArray<Unknown> Materials; // 0xB8 (16)
	struct TArray<Unknown> SkelMirrorTable; // 0xC8 (16)
	struct TArray<Unknown> LODInfo; // 0xD8 (16)
	struct Unknown MinLOD; // 0x138 (4)
	struct Unknown DisableBelowMinLodStripping; // 0x13C (1)
	char SkelMirrorAxis; // 0x13D (1)
	char SkelMirrorFlipAxis; // 0x13E (1)
	char bUseFullPrecisionUVs : 0; // 0x13F (1)
	char bUseHighPrecisionTangentBasis : 0; // 0x13F (1)
	char bHasBeenSimplified : 0; // 0x13F (1)
	char bHasVertexColors : 0; // 0x13F (1)
	char bEnablePerPolyCollision : 0; // 0x13F (1)
	struct Unknown BodySetup; // 0x140 (8)
	struct Unknown PhysicsAsset; // 0x148 (8)
	struct Unknown ShadowPhysicsAsset; // 0x150 (8)
	struct TArray<Unknown> NodeMappingData; // 0x158 (16)
	struct TArray<Unknown> MorphTargets; // 0x168 (16)
	struct Unknown* PostProcessAnimBlueprint; // 0x2F0 (8)
	struct TArray<Unknown> MeshClothingAssets; // 0x2F8 (16)
	struct Unknown SamplingInfo; // 0x308 (48)
	struct TArray<Unknown> AssetUserData; // 0x338 (16)
	struct TArray<Unknown> Sockets; // 0x350 (16)
	struct TArray<Unknown> SkinWeightProfiles; // 0x370 (16)

	void SetLODSettings(struct Unknown InLODSettings); // Function Engine.SkeletalMesh.SetLODSettings(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x16B4710>
	int32_t NumSockets(); // Function Engine.SkeletalMesh.NumSockets(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DEE4C0>
	struct TArray<Unknown> K2_GetAllMorphTargetNames(); // Function Engine.SkeletalMesh.K2_GetAllMorphTargetNames(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DEE3E0>
	char IsSectionUsingCloth(int32_t InSectionIndex, char bCheckCorrespondingSections); // Function Engine.SkeletalMesh.IsSectionUsingCloth(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DEE320>
	struct Unknown GetSocketByIndex(int32_t Index); // Function Engine.SkeletalMesh.GetSocketByIndex(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DEE290>
	struct Unknown GetNodeMappingContainer(struct Unknown SourceAsset); // Function Engine.SkeletalMesh.GetNodeMappingContainer(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DEE200>
	struct Unknown GetImportedBounds(); // Function Engine.SkeletalMesh.GetImportedBounds(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DEE1B0>
	struct Unknown GetBounds(); // Function Engine.SkeletalMesh.GetBounds(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DEE160>
	struct Unknown FindSocketInfo(struct FName InSocketName, struct Unknown& OutTransform, int32_t& OutBoneIndex, int32_t& OutIndex); // Function Engine.SkeletalMesh.FindSocketInfo(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DEDF90>
	struct Unknown FindSocketAndIndex(struct FName InSocketName, int32_t& OutIndex); // Function Engine.SkeletalMesh.FindSocketAndIndex(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DEDEC0>
	struct Unknown FindSocket(struct FName InSocketName); // Function Engine.SkeletalMesh.FindSocket(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DEDE30>
};

// Class Engine.StaticMeshActor
struct AStaticMeshActor : UActor {
	struct Unknown StaticMeshComponent; // 0x310 (8)
	char bStaticMeshReplicateMovement : 0; // 0x318 (1)
	enum class Unknow NavigationGeometryGatheringMode; // 0x319 (1)

	void SetMobility(char InMobility); // Function Engine.StaticMeshActor.SetMobility(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x124CF50>
};

// Class Engine.Texture
struct UTexture : UStreamableRenderAsset {
	struct Unknown LightingGuid; // 0x48 (16)
	int32_t LODBias; // 0x58 (4)
	char CompressionSettings; // 0x5C (1)
	char Filter; // 0x5D (1)
	enum class Unknow MipLoadOptions; // 0x5E (1)
	char LODGroup; // 0x5F (1)
	char S : 0; // 0x60 (1)
	char bNoTiling : 0; // 0x60 (1)
	char VirtualTextureStreaming : 0; // 0x60 (1)
	char CompressionYCoCg : 0; // 0x60 (1)
	char bAsyncResourceReleaseHasBeenStarted : 0; // 0x60 (1)
	struct TArray<Unknown> AssetUserData; // 0x68 (16)
};

// Class Engine.Texture2DDynamic
struct UTexture2DDynamic : UTexture {
	char Format; // 0xC0 (1)
};

// Class Engine.HUD
struct AHUD : UActor {
	struct Unknown PlayerOwner; // 0x310 (8)
	char bLostFocusPaused : 0; // 0x318 (1)
	char bShowHUD : 0; // 0x318 (1)
	char bShowDebugInfo : 0; // 0x318 (1)
	int32_t CurrentTargetIndex; // 0x31C (4)
	char bShowHitBoxDebugInfo : 0; // 0x320 (1)
	char bShowOverlays : 0; // 0x320 (1)
	char bEnableDebugTextShadow : 0; // 0x320 (1)
	struct TArray<Unknown> PostRenderedActors; // 0x328 (16)
	struct TArray<Unknown> DebugDisplay; // 0x340 (16)
	struct TArray<Unknown> ToggledDebugCategories; // 0x350 (16)
	struct Unknown Canvas; // 0x360 (8)
	struct Unknown DebugCanvas; // 0x368 (8)
	struct TArray<Unknown> DebugTextList; // 0x370 (16)
	struct Unknown* ShowDebugTargetDesiredClass; // 0x380 (8)
	struct Unknown ShowDebugTargetActor; // 0x388 (8)

	void ShowHUD(); // Function Engine.HUD.ShowHUD(Exec|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E52540>
	void ShowDebugToggleSubCategory(struct FName Category); // Function Engine.HUD.ShowDebugToggleSubCategory(Final|Exec|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CFC350>
	void ShowDebugForReticleTargetToggle(struct Unknown* DesiredClass); // Function Engine.HUD.ShowDebugForReticleTargetToggle(Final|Exec|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CFC2D0>
	void ShowDebug(struct FName DebugType); // Function Engine.HUD.ShowDebug(Exec|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E77990>
	void RemoveDebugText(struct Unknown SrcActor, char bLeaveDurationText); // Function Engine.HUD.RemoveDebugText(Final|Net|NetReliableNative|Event|Public|NetClient) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CFC0B0>
	void RemoveAllDebugStrings(); // Function Engine.HUD.RemoveAllDebugStrings(Final|Net|NetReliableNative|Event|Public|NetClient) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CFC090>
	void ReceiveHitBoxRelease(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxRelease(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveHitBoxEndCursorOver(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxEndCursorOver(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveHitBoxClick(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxClick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveHitBoxBeginCursorOver(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxBeginCursorOver(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveDrawHUD(int32_t SizeX, int32_t SizeY); // Function Engine.HUD.ReceiveDrawHUD(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	struct Unknown Project(struct Unknown Location); // Function Engine.HUD.Project(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CFBFE0>
	void PreviousDebugTarget(); // Function Engine.HUD.PreviousDebugTarget(Exec|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1FAC130>
	void NextDebugTarget(); // Function Engine.HUD.NextDebugTarget(Exec|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x11CCC90>
	void GetTextSize(struct FString Text, float& OutWidth, float& OutHeight, struct Unknown Font, float Scale); // Function Engine.HUD.GetTextSize(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CFBCE0>
	struct Unknown GetOwningPlayerController(); // Function Engine.HUD.GetOwningPlayerController(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x16D1E60>
	struct Unknown GetOwningPawn(); // Function Engine.HUD.GetOwningPawn(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CFBCB0>
	void GetActorsInSelectionRectangle(struct Unknown* ClassFilter, struct Unknown& FirstPoint, struct Unknown& SecondPoint, struct TArray<Unknown>& OutActors, char bIncludeNonCollidingComponents, char bActorMustBeFullyEnclosed); // Function Engine.HUD.GetActorsInSelectionRectangle(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CFBAA0>
	void DrawTextureSimple(struct Unknown Texture, float ScreenX, float ScreenY, float Scale, char bScalePosition); // Function Engine.HUD.DrawTextureSimple(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CFB910>
	void DrawTexture(struct Unknown Texture, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float TextureU, float TextureV, float TextureUWidth, float TextureVHeight, struct Unknown TintColor, char BlendMode, float Scale, char bScalePosition, float Rotation, struct Unknown RotPivot); // Function Engine.HUD.DrawTexture(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CFB4F0>
	void DrawText(struct FString Text, struct Unknown TextColor, float ScreenX, float ScreenY, struct Unknown Font, float Scale, char bScalePosition); // Function Engine.HUD.DrawText(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CFB2C0>
	void DrawRect(struct Unknown RectColor, float ScreenX, float ScreenY, float ScreenW, float ScreenH); // Function Engine.HUD.DrawRect(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CFB110>
	void DrawMaterialTriangle(struct Unknown Material, struct Unknown V0_Pos, struct Unknown V1_Pos, struct Unknown V2_Pos, struct Unknown V0_UV, struct Unknown V1_UV, struct Unknown V2_UV, struct Unknown V0_Color, struct Unknown V1_Color, struct Unknown V2_Color); // Function Engine.HUD.DrawMaterialTriangle(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CFAE50>
	void DrawMaterialSimple(struct Unknown Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float Scale, char bScalePosition); // Function Engine.HUD.DrawMaterialSimple(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CFAC50>
	void DrawMaterial(struct Unknown Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float MaterialU, float MaterialV, float MaterialUWidth, float MaterialVHeight, float Scale, char bScalePosition, float Rotation, struct Unknown RotPivot); // Function Engine.HUD.DrawMaterial(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CFA8C0>
	void DrawLine(float StartScreenX, float StartScreenY, float EndScreenX, float EndScreenY, struct Unknown LineColor, float LineThickness); // Function Engine.HUD.DrawLine(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CFA6E0>
	void Deproject(float ScreenX, float ScreenY, struct Unknown& WorldPosition, struct Unknown& WorldDirection); // Function Engine.HUD.Deproject(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CFA4E0>
	void AddHitBox(struct Unknown Position, struct Unknown Size, struct FName InName, char bConsumesInput, int32_t Priority); // Function Engine.HUD.AddHitBox(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CFA350>
	void AddDebugText(struct FString DebugText, struct Unknown SrcActor, float Duration, struct Unknown Offset, struct Unknown DesiredOffset, struct Unknown TextColor, char bSkipOverwriteCheck, char bAbsoluteLocation, char bKeepAttachedToActor, struct Unknown InFont, float FontScale, char bDrawShadow); // Function Engine.HUD.AddDebugText(Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF9FB0>
};

// Class Engine.Player
struct UPlayer : Object {
	struct Unknown PlayerController; // 0x30 (8)
	int32_t CurrentNetSpeed; // 0x38 (4)
	int32_t ConfiguredInternetSpeed; // 0x3C (4)
	int32_t ConfiguredLanSpeed; // 0x40 (4)
};

// Class Engine.MKNetConnectionEx
struct UMKNetConnectionEx : UPlayer {
	struct Unknown SelfNetConnection; // 0xB0 (8)
};

// Class Engine.NetConnection
struct UNetConnection : UMKNetConnectionEx {
	struct TArray<Unknown> Children; // 0xB8 (16)
	struct Unknown Driver; // 0xC8 (8)
	struct Unknown* PackageMapClass; // 0xD0 (8)
	struct Unknown PackageMap; // 0xD8 (8)
	struct TArray<Unknown> OpenChannels; // 0xE0 (16)
	struct TArray<Unknown> SentTemporaries; // 0xF0 (16)
	struct Unknown ViewTarget; // 0x100 (8)
	struct Unknown OwningActor; // 0x108 (8)
	int32_t MaxPacket; // 0x110 (4)
	char InternalAck : 0; // 0x114 (1)
	struct Unknown PlayerId; // 0x1D0 (40)
	double LastReceiveTime; // 0x240 (8)
	struct TArray<Unknown> ChannelsToTick; // 0x1580 (16)
};

// Class Engine.NetDriver
struct UNetDriver : Object {
	struct FString NetConnectionClassName; // 0x30 (16)
	struct FString ReplicationDriverClassName; // 0x40 (16)
	int32_t MaxDownloadSize; // 0x50 (4)
	char bClampListenServerTickRate : 0; // 0x54 (1)
	int32_t NetServerMaxTickRate; // 0x58 (4)
	int32_t MaxNetTickRate; // 0x5C (4)
	int32_t MaxInternetClientRate; // 0x60 (4)
	int32_t MaxClientRate; // 0x64 (4)
	float ServerTravelPause; // 0x68 (4)
	float SpawnPrioritySeconds; // 0x6C (4)
	float RelevantTimeout; // 0x70 (4)
	float KeepAliveTime; // 0x74 (4)
	float InitialConnectTimeout; // 0x78 (4)
	float ConnectionTimeout; // 0x7C (4)
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x80 (4)
	char bNoTimeouts : 0; // 0x84 (1)
	char bNeverApplyNetworkEmulationSettings : 0; // 0x85 (1)
	struct Unknown ServerConnection; // 0x88 (8)
	struct TArray<Unknown> ClientConnections; // 0x90 (16)
	int32_t RecentlyDisconnectedTrackingTime; // 0x100 (4)
	struct Unknown World; // 0x140 (8)
	struct Unknown WorldPackage; // 0x148 (8)
	struct Unknown* NetConnectionClass; // 0x170 (8)
	struct Unknown* ReplicationDriverClass; // 0x178 (8)
	struct FName NetDriverName; // 0x190 (8)
	struct TArray<Unknown> ChannelDefinitions; // 0x198 (16)
	struct TMap<Unknown, Unknown>Unknown ChannelDefinitionMap; // 0x1A8 (80)
	struct TArray<Unknown> ActorChannelPool; // 0x1F8 (16)
	float Time; // 0x210 (4)
	struct Unknown ReplicationDriver; // 0x6E8 (8)
};

// Class Engine.Engine
struct UEngine : Object {
	struct Unknown TinyFont; // 0x30 (8)
	struct Unknown TinyFontName; // 0x38 (24)
	struct Unknown SmallFont; // 0x50 (8)
	struct Unknown SmallFontName; // 0x58 (24)
	struct Unknown MediumFont; // 0x70 (8)
	struct Unknown MediumFontName; // 0x78 (24)
	struct Unknown LargeFont; // 0x90 (8)
	struct Unknown LargeFontName; // 0x98 (24)
	struct Unknown SubtitleFont; // 0xB0 (8)
	struct Unknown SubtitleFontName; // 0xB8 (24)
	struct TArray<Unknown> AdditionalFonts; // 0xD0 (16)
	struct TArray<Unknown> AdditionalFontNames; // 0xE8 (16)
	struct Unknown* ConsoleClass; // 0xF8 (8)
	struct Unknown ConsoleClassName; // 0x100 (24)
	struct Unknown* GameViewportClientClass; // 0x118 (8)
	struct Unknown GameViewportClientClassName; // 0x120 (24)
	struct Unknown* LocalPlayerClass; // 0x138 (8)
	struct Unknown LocalPlayerClassName; // 0x140 (24)
	struct Unknown* WorldSettingsClass; // 0x158 (8)
	struct Unknown WorldSettingsClassName; // 0x160 (24)
	struct Unknown NavigationSystemClassName; // 0x178 (24)
	struct Unknown* NavigationSystemClass; // 0x190 (8)
	struct Unknown NavigationSystemConfigClassName; // 0x198 (24)
	struct Unknown* NavigationSystemConfigClass; // 0x1B0 (8)
	struct Unknown AvoidanceManagerClassName; // 0x1B8 (24)
	struct Unknown* AvoidanceManagerClass; // 0x1D0 (8)
	struct Unknown* PhysicsCollisionHandlerClass; // 0x1D8 (8)
	struct Unknown PhysicsCollisionHandlerClassName; // 0x1E0 (24)
	struct Unknown GameUserSettingsClassName; // 0x1F8 (24)
	struct Unknown* GameUserSettingsClass; // 0x210 (8)
	struct Unknown AIControllerClassName; // 0x218 (24)
	struct Unknown GameUserSettings; // 0x230 (8)
	struct Unknown* LevelScriptActorClass; // 0x238 (8)
	struct Unknown LevelScriptActorClassName; // 0x240 (24)
	struct Unknown DefaultBlueprintBaseClassName; // 0x258 (24)
	struct Unknown GameSingletonClassName; // 0x270 (24)
	struct Unknown GameSingleton; // 0x288 (8)
	struct Unknown AssetManagerClassName; // 0x290 (24)
	struct Unknown AssetManager; // 0x2A8 (8)
	struct Unknown DefaultTexture; // 0x2B0 (8)
	struct Unknown DefaultTextureName; // 0x2B8 (24)
	struct Unknown DefaultDiffuseTexture; // 0x2D0 (8)
	struct Unknown DefaultDiffuseTextureName; // 0x2D8 (24)
	struct Unknown DefaultBSPVertexTexture; // 0x2F0 (8)
	struct Unknown DefaultBSPVertexTextureName; // 0x2F8 (24)
	struct Unknown HighFrequencyNoiseTexture; // 0x310 (8)
	struct Unknown HighFrequencyNoiseTextureName; // 0x318 (24)
	struct Unknown DefaultBokehTexture; // 0x330 (8)
	struct Unknown DefaultBokehTextureName; // 0x338 (24)
	struct Unknown DefaultBloomKernelTexture; // 0x350 (8)
	struct Unknown DefaultBloomKernelTextureName; // 0x358 (24)
	struct Unknown WireframeMaterial; // 0x370 (8)
	struct FString WireframeMaterialName; // 0x378 (16)
	struct Unknown DebugMeshMaterial; // 0x388 (8)
	struct Unknown DebugMeshMaterialName; // 0x390 (24)
	struct Unknown EmissiveMeshMaterial; // 0x3A8 (8)
	struct Unknown EmissiveMeshMaterialName; // 0x3B0 (24)
	struct Unknown LevelColorationLitMaterial; // 0x3C8 (8)
	struct FString LevelColorationLitMaterialName; // 0x3D0 (16)
	struct Unknown LevelColorationUnlitMaterial; // 0x3E0 (8)
	struct FString LevelColorationUnlitMaterialName; // 0x3E8 (16)
	struct Unknown LightingTexelDensityMaterial; // 0x3F8 (8)
	struct FString LightingTexelDensityName; // 0x400 (16)
	struct Unknown ShadedLevelColorationLitMaterial; // 0x410 (8)
	struct FString ShadedLevelColorationLitMaterialName; // 0x418 (16)
	struct Unknown ShadedLevelColorationUnlitMaterial; // 0x428 (8)
	struct FString ShadedLevelColorationUnlitMaterialName; // 0x430 (16)
	struct Unknown RemoveSurfaceMaterial; // 0x440 (8)
	struct Unknown RemoveSurfaceMaterialName; // 0x448 (24)
	struct Unknown VertexColorMaterial; // 0x460 (8)
	struct FString VertexColorMaterialName; // 0x468 (16)
	struct Unknown VertexColorViewModeMaterial_ColorOnly; // 0x478 (8)
	struct FString VertexColorViewModeMaterialName_ColorOnly; // 0x480 (16)
	struct Unknown VertexColorViewModeMaterial_AlphaAsColor; // 0x490 (8)
	struct FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x498 (16)
	struct Unknown VertexColorViewModeMaterial_RedOnly; // 0x4A8 (8)
	struct FString VertexColorViewModeMaterialName_RedOnly; // 0x4B0 (16)
	struct Unknown VertexColorViewModeMaterial_GreenOnly; // 0x4C0 (8)
	struct FString VertexColorViewModeMaterialName_GreenOnly; // 0x4C8 (16)
	struct Unknown VertexColorViewModeMaterial_BlueOnly; // 0x4D8 (8)
	struct FString VertexColorViewModeMaterialName_BlueOnly; // 0x4E0 (16)
	struct Unknown DebugEditorMaterialName; // 0x4F0 (24)
	struct Unknown ConstraintLimitMaterial; // 0x508 (8)
	struct Unknown ConstraintLimitMaterialX; // 0x510 (8)
	struct Unknown ConstraintLimitMaterialXAxis; // 0x518 (8)
	struct Unknown ConstraintLimitMaterialY; // 0x520 (8)
	struct Unknown ConstraintLimitMaterialYAxis; // 0x528 (8)
	struct Unknown ConstraintLimitMaterialZ; // 0x530 (8)
	struct Unknown ConstraintLimitMaterialZAxis; // 0x538 (8)
	struct Unknown ConstraintLimitMaterialPrismatic; // 0x540 (8)
	struct Unknown InvalidLightmapSettingsMaterial; // 0x548 (8)
	struct Unknown InvalidLightmapSettingsMaterialName; // 0x550 (24)
	struct Unknown PreviewShadowsIndicatorMaterial; // 0x568 (8)
	struct Unknown PreviewShadowsIndicatorMaterialName; // 0x570 (24)
	struct Unknown ArrowMaterial; // 0x588 (8)
	struct Unknown ArrowMaterialYellow; // 0x590 (8)
	struct Unknown ArrowMaterialName; // 0x598 (24)
	struct Unknown LightingOnlyBrightness; // 0x5B0 (16)
	struct TArray<Unknown> ShaderComplexityColors; // 0x5C0 (16)
	struct TArray<Unknown> QuadComplexityColors; // 0x5D0 (16)
	struct TArray<Unknown> LightComplexityColors; // 0x5E0 (16)
	struct TArray<Unknown> StationaryLightOverlapColors; // 0x5F0 (16)
	struct TArray<Unknown> LODColorationColors; // 0x600 (16)
	struct TArray<Unknown> HLODColorationColors; // 0x610 (16)
	struct TArray<Unknown> StreamingAccuracyColors; // 0x620 (16)
	float MaxPixelShaderAdditiveComplexityCount; // 0x630 (4)
	float MaxES3PixelShaderAdditiveComplexityCount; // 0x634 (4)
	float MinLightMapDensity; // 0x638 (4)
	float IdealLightMapDensity; // 0x63C (4)
	float MaxLightMapDensity; // 0x640 (4)
	char b : 0; // 0x644 (1)
	float RenderLightMapDensityGrayscaleScale; // 0x648 (4)
	float RenderLightMapDensityColorScale; // 0x64C (4)
	struct Unknown LightMapDensityVertexMappedColor; // 0x650 (16)
	struct Unknown LightMapDensitySelectedColor; // 0x660 (16)
	struct TArray<Unknown> StatColorMappings; // 0x670 (16)
	struct Unknown DefaultPhysMaterial; // 0x680 (8)
	struct Unknown DefaultPhysMaterialName; // 0x688 (24)
	struct TArray<Unknown> ActiveGameNameRedirects; // 0x6A0 (16)
	struct TArray<Unknown> ActiveClassRedirects; // 0x6B0 (16)
	struct TArray<Unknown> ActivePluginRedirects; // 0x6C0 (16)
	struct TArray<Unknown> ActiveStructRedirects; // 0x6D0 (16)
	struct Unknown PreIntegratedSkinBRDFTexture; // 0x6E0 (8)
	struct Unknown PreIntegratedSkinBRDFTextureName; // 0x6E8 (24)
	struct Unknown BlueNoiseTexture; // 0x700 (8)
	struct Unknown BlueNoiseTextureName; // 0x708 (24)
	struct Unknown MiniFontTexture; // 0x720 (8)
	struct Unknown MiniFontTextureName; // 0x728 (24)
	struct Unknown WeightMapPlaceholderTexture; // 0x740 (8)
	struct Unknown WeightMapPlaceholderTextureName; // 0x748 (24)
	struct Unknown LightMapDensityTexture; // 0x760 (8)
	struct Unknown LightMapDensityTextureName; // 0x768 (24)
	struct Unknown GameViewport; // 0x788 (8)
	struct TArray<Unknown> DeferredCommands; // 0x790 (16)
	int32_t TickCycles; // 0x7A0 (4)
	int32_t GameCycles; // 0x7A4 (4)
	int32_t ClientCycles; // 0x7A8 (4)
	float NearClipPlane; // 0x7AC (4)
	float EditorNearClipPlane; // 0x7B0 (4)
	char bUseCustomAudioModule : 0; // 0x7B4 (1)
	char bHardwareSurveyEnabled : 0; // 0x7B8 (1)
	char bSubtitlesEnabled : 0; // 0x7B8 (1)
	char bSubtitlesForcedOff : 0; // 0x7B8 (1)
	int32_t MaximumLoopIterationCount; // 0x7BC (4)
	char bCanBlueprintsTickByDefault : 0; // 0x7C0 (1)
	char bOptimizeAnimBlueprintMemberVariableAccess : 0; // 0x7C0 (1)
	char bAllowMultiThreadedAnimationUpdate : 0; // 0x7C0 (1)
	char bEnableEditorPSysRealtimeLOD : 0; // 0x7C0 (1)
	char bSmoothFrameRate : 0; // 0x7C0 (1)
	char bUseFixedFrameRate : 0; // 0x7C0 (1)
	float FixedFrameRate; // 0x7C4 (4)
	struct Unknown SmoothedFrameRateRange; // 0x7C8 (16)
	struct Unknown CustomTimeStep; // 0x7D8 (8)
	struct Unknown CustomTimeStepClassName; // 0x800 (24)
	struct Unknown TimecodeProvider; // 0x818 (8)
	struct Unknown TimecodeProviderClassName; // 0x840 (24)
	char bGenerateDefaultTimecode : 0; // 0x858 (1)
	struct Unknown GenerateDefaultTimecodeFrameRate; // 0x85C (8)
	float GenerateDefaultTimecodeFrameDelay; // 0x864 (4)
	char bCheckForMultiplePawnsSpawnedInAFrame : 0; // 0x868 (1)
	int32_t NumPawnsAllowedToBeSpawnedInAFrame; // 0x86C (4)
	char bShouldGenerateLowQualityLightmaps : 0; // 0x870 (1)
	struct Unknown C_WorldBox; // 0x874 (4)
	struct Unknown C_BrushWire; // 0x878 (4)
	struct Unknown C_AddWire; // 0x87C (4)
	struct Unknown C_SubtractWire; // 0x880 (4)
	struct Unknown C_SemiSolidWire; // 0x884 (4)
	struct Unknown C_NonSolidWire; // 0x888 (4)
	struct Unknown C_WireBackground; // 0x88C (4)
	struct Unknown C_ScaleBoxHi; // 0x890 (4)
	struct Unknown C_VolumeCollision; // 0x894 (4)
	struct Unknown C_BSPCollision; // 0x898 (4)
	struct Unknown C_OrthoBackground; // 0x89C (4)
	struct Unknown C_Volume; // 0x8A0 (4)
	struct Unknown C_BrushShape; // 0x8A4 (4)
	float StreamingDistanceFactor; // 0x8A8 (4)
	struct Unknown GameScreenshotSaveDirectory; // 0x8B0 (16)
	enum class Unknow TransitionType; // 0x8C0 (1)
	struct FString TransitionDescription; // 0x8C8 (16)
	struct FString TransitionGameMode; // 0x8D8 (16)
	float MeshLODRange; // 0x8E8 (4)
	char bAllowMatureLanguage : 0; // 0x8EC (1)
	float CameraRotationThreshold; // 0x8F0 (4)
	float CameraTranslationThreshold; // 0x8F4 (4)
	float PrimitiveProbablyVisibleTime; // 0x8F8 (4)
	float MaxOcclusionPixelsFraction; // 0x8FC (4)
	char bPauseOnLossOfFocus : 0; // 0x900 (1)
	int32_t MaxParticleResize; // 0x904 (4)
	int32_t MaxParticleResizeWarn; // 0x908 (4)
	struct TArray<Unknown> PendingDroppedNotes; // 0x910 (16)
	float NetClientTicksPerSecond; // 0x920 (4)
	float DisplayGamma; // 0x924 (4)
	float MinDesiredFrameRate; // 0x928 (4)
	struct Unknown DefaultSelectedMaterialColor; // 0x92C (16)
	struct Unknown SelectedMaterialColor; // 0x93C (16)
	struct Unknown SelectionOutlineColor; // 0x94C (16)
	struct Unknown SubduedSelectionOutlineColor; // 0x95C (16)
	struct Unknown SelectedMaterialColorOverride; // 0x96C (16)
	char bIsOverridingSelectedColor : 0; // 0x97C (1)
	char bEnableOnScreenDebugMessages : 0; // 0x980 (1)
	char bEnableOnScreenDebugMessagesDisplay : 0; // 0x980 (1)
	char bSuppressMapWarnings : 0; // 0x980 (1)
	char bDisableAILogging : 0; // 0x980 (1)
	uint32_t bEnableVisualLogRecordingOnStart; // 0x984 (4)
	int32_t ScreenSaverInhibitorSemaphore; // 0x98C (4)
	char bLockReadOnlyLevels : 0; // 0x990 (1)
	struct FString ParticleEventManagerClass; // 0x998 (16)
	float SelectionHighlightIntensity; // 0x9A8 (4)
	float BSPSelectionHighlightIntensity; // 0x9AC (4)
	float SelectionHighlightIntensityBillboards; // 0x9B0 (4)
	struct TArray<Unknown> NetDriverDefinitions; // 0xC00 (16)
	struct TArray<Unknown> ServerActors; // 0xC10 (16)
	struct TArray<Unknown> RuntimeServerActors; // 0xC20 (16)
	float NetErrorLogInterval; // 0xC30 (4)
	char bStartedLoadMapMovie : 0; // 0xC34 (1)
	int32_t NextWorldContextHandle; // 0xC50 (4)
};

// Class Engine.LocalPlayer
struct ULocalPlayer : UPlayer {
	struct Unknown ViewportClient; // 0x70 (8)
	char AspectRatioAxisConstraint; // 0x94 (1)
	struct Unknown* PendingLevelPlayerControllerClass; // 0x98 (8)
	char bSentSplitJoin : 0; // 0xA0 (1)
	int32_t ControllerId; // 0xB8 (4)
};

// Class Engine.SkeletalMeshComponent
struct USkeletalMeshComponent : USkinnedMeshComponent {
	struct Unknown* AnimBlueprintGeneratedClass; // 0x700 (8)
	struct Unknown* AnimClass; // 0x708 (8)
	struct Unknown AnimScriptInstance; // 0x710 (8)
	struct Unknown PostprocessAnimInstance; // 0x718 (8)
	struct Unknown AnimationData; // 0x720 (24)
	struct Unknown RootBoneTranslation; // 0x748 (12)
	struct Unknown LineCheckBoundsScale; // 0x754 (12)
	struct TArray<Unknown> LinkedInstances; // 0x780 (16)
	struct TArray<Unknown> CachedBoneSpaceTransforms; // 0x790 (16)
	struct TArray<Unknown> CachedComponentSpaceTransforms; // 0x7A0 (16)
	float GlobalAnimRateScale; // 0x7D0 (4)
	char KinematicBonesUpdateType; // 0x7D4 (1)
	char PhysicsTransformUpdateMode; // 0x7D5 (1)
	char AnimationMode; // 0x7DD (1)
	char bDisablePostProcessBlueprint : 0; // 0x7DF (1)
	char bUpdateOverlapsOnAnimationFinalize : 0; // 0x7DF (1)
	char bHasValidBodies : 0; // 0x7DF (1)
	char bBlendPhysics : 0; // 0x7DF (1)
	char bEnablePhysicsOnDedicatedServer : 0; // 0x7DF (1)
	char bUpdateJointsFromAnimation : 0; // 0x7E0 (1)
	char bDisableClothSimulation : 0; // 0x7E0 (1)
	char bDisableRigidBodyAnimNode : 0; // 0x7E0 (1)
	char bAllowAnimCurveEvaluation : 0; // 0x7E0 (1)
	char bDisableAnimCurves : 0; // 0x7E0 (1)
	char bCollideWithEnvironment : 0; // 0x7E1 (1)
	char bCollideWithAttachedChildren : 0; // 0x7E1 (1)
	char bLocalSpaceSimulation : 0; // 0x7E1 (1)
	char b : 0; // 0x7E1 (1)
	char bDeferKinematicBoneUpdate : 0; // 0x7E1 (1)
	char bNoSkeletonUpdate : 0; // 0x7E1 (1)
	char bPauseAnims : 0; // 0x7E1 (1)
	char bUseRefPoseOnInitAnim : 0; // 0x7E2 (1)
	char bEnablePerPolyCollision : 0; // 0x7E2 (1)
	char bForceRefpose : 0; // 0x7E2 (1)
	char bOnlyAllowAutonomousTickPose : 0; // 0x7E2 (1)
	char bIsAutonomousTickPose : 0; // 0x7E2 (1)
	char bOldForceRefPose : 0; // 0x7E2 (1)
	char bShowPrePhysBones : 0; // 0x7E2 (1)
	char b : 0; // 0x7E2 (1)
	char bAnimTreeInitialised : 0; // 0x7E3 (1)
	char bIncludeComponentLocationIntoBounds : 0; // 0x7E3 (1)
	char bEnableLineCheckWithBounds : 0; // 0x7E3 (1)
	char bUseBendingElements : 0; // 0x7E3 (1)
	char bUseTetrahedralConstraints : 0; // 0x7E3 (1)
	char bUseThinShellVolumeConstraints : 0; // 0x7E3 (1)
	char bUseSelfCollisions : 0; // 0x7E3 (1)
	char bUseContinuousCollisionDetection : 0; // 0x7E3 (1)
	char bPropagateCurvesToSlaves : 0; // 0x7E4 (1)
	char bSkipKinematicUpdateWhenInterpolating : 0; // 0x7E4 (1)
	char bSkipBoundsUpdateWhenInterpolating : 0; // 0x7E4 (1)
	char bNeedsQueuedAnimEventsDispatched : 0; // 0x7E4 (1)
	uint16_t CachedAnimCurveUidVersion; // 0x7E6 (2)
	enum class Unknow MassMode; // 0x7E8 (1)
	float UniformMass; // 0x7EC (4)
	float TotalMass; // 0x7F0 (4)
	float Density; // 0x7F4 (4)
	float MinPerParticleMass; // 0x7F8 (4)
	float ClothBlendWeight; // 0x7FC (4)
	float EdgeStiffness; // 0x800 (4)
	float BendingStiffness; // 0x804 (4)
	float AreaStiffness; // 0x808 (4)
	float VolumeStiffness; // 0x80C (4)
	float StrainLimitingStiffness; // 0x810 (4)
	float ShapeTargetStiffness; // 0x814 (4)
	struct TArray<Unknown> DisallowedAnimCurves; // 0x818 (16)
	struct Unknown BodySetup; // 0x828 (8)
	struct FMulticastInlineDelegate OnConstraintBroken; // 0x838 (16)
	struct Unknown* ClothingSimulationFactory; // 0x848 (8)
	float TeleportDistanceThreshold; // 0x918 (4)
	float TeleportRotationThreshold; // 0x91C (4)
	uint32_t LastPoseTickFrame; // 0x928 (4)
	struct Unknown ClothingInteractor; // 0x980 (8)
	struct FMulticastInlineDelegate OnAnimInitialized; // 0xA50 (16)

	void UnlinkAnimClassLayers(struct Unknown* InClass); // Function Engine.SkeletalMeshComponent.UnlinkAnimClassLayers(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3F90>
	void UnbindClothFromMasterPoseComponent(char b); // Function Engine.SkeletalMeshComponent.UnbindClothFromMasterPoseComponent(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3F00>
	void ToggleDisablePostProcessBlueprint(); // Function Engine.SkeletalMeshComponent.ToggleDisablePostProcessBlueprint(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3EE0>
	void TermBodiesBelow(struct FName ParentBoneName); // Function Engine.SkeletalMeshComponent.TermBodiesBelow(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3E60>
	void SuspendClothingSimulation(); // Function Engine.SkeletalMeshComponent.SuspendClothingSimulation(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3E40>
	void Stop(); // Function Engine.SkeletalMeshComponent.Stop(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3E20>
	void SnapshotPose(struct Unknown& Snapshot); // Function Engine.SkeletalMeshComponent.SnapshotPose(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3D50>
	void SetUpdateAnimationInEditor(char NewUpdateState); // Function Engine.SkeletalMeshComponent.SetUpdateAnimationInEditor(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x124CBC0>
	void SetTeleportRotationThreshold(float threshold); // Function Engine.SkeletalMeshComponent.SetTeleportRotationThreshold(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3CD0>
	void SetTeleportDistanceThreshold(float threshold); // Function Engine.SkeletalMeshComponent.SetTeleportDistanceThreshold(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3C50>
	void SetPosition(float InPos, char bFireNotifies); // Function Engine.SkeletalMeshComponent.SetPosition(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3B80>
	void SetPlayRate(float Rate); // Function Engine.SkeletalMeshComponent.SetPlayRate(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3B00>
	void SetPhysicsBlendWeight(float PhysicsBlendWeight); // Function Engine.SkeletalMeshComponent.SetPhysicsBlendWeight(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3A80>
	void SetNotifyRigidBodyCollisionBelow(char bNewNotifyRigidBodyCollision, struct FName BoneName, char bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetNotifyRigidBodyCollisionBelow(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3970>
	void SetMorphTarget(struct FName MorphTargetName, float Value, char b); // Function Engine.SkeletalMeshComponent.SetMorphTarget(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3860>
	void SetEnablePhysicsBlending(char bNewBlendPhysics); // Function Engine.SkeletalMeshComponent.SetEnablePhysicsBlending(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF37D0>
	void SetEnableGravityOnAllBodiesBelow(char bEnableGravity, struct FName BoneName, char bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetEnableGravityOnAllBodiesBelow(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF36C0>
	void SetEnableBodyGravity(char bEnableGravity, struct FName BoneName); // Function Engine.SkeletalMeshComponent.SetEnableBodyGravity(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3600>
	void SetDisablePostProcessBlueprint(char bInDisablePostProcess); // Function Engine.SkeletalMeshComponent.SetDisablePostProcessBlueprint(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3570>
	void SetDisableAnimCurves(char bInDisableAnimCurves); // Function Engine.SkeletalMeshComponent.SetDisableAnimCurves(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF34E0>
	void SetConstraintProfileForAll(struct FName ProfileName, char bDefaultIfNotFound); // Function Engine.SkeletalMeshComponent.SetConstraintProfileForAll(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3410>
	void SetConstraintProfile(struct FName JointName, struct FName ProfileName, char bDefaultIfNotFound); // Function Engine.SkeletalMeshComponent.SetConstraintProfile(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3300>
	void SetClothMaxDistanceScale(float Scale); // Function Engine.SkeletalMeshComponent.SetClothMaxDistanceScale(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3280>
	void SetBodyNotifyRigidBodyCollision(char bNewNotifyRigidBodyCollision, struct FName BoneName); // Function Engine.SkeletalMeshComponent.SetBodyNotifyRigidBodyCollision(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF31B0>
	void SetAnimClass(struct Unknown* NewClass); // Function Engine.SkeletalMeshComponent.SetAnimClass(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3020>
	void SetAnimationMode(char InAnimationMode); // Function Engine.SkeletalMeshComponent.SetAnimationMode(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF3130>
	void SetAnimation(struct Unknown NewAnimToPlay); // Function Engine.SkeletalMeshComponent.SetAnimation(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF30B0>
	void SetAngularLimits(struct FName InBoneName, float Swing1LimitAngle, float TwistLimitAngle, float Swing2LimitAngle); // Function Engine.SkeletalMeshComponent.SetAngularLimits(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF2ED0>
	void SetAllowRigidBodyAnimNode(char bInAllow, char b); // Function Engine.SkeletalMeshComponent.SetAllowRigidBodyAnimNode(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF2D00>
	void SetAllowedAnimCurvesEvaluation(struct TArray<Unknown>& List, char bAllow); // Function Engine.SkeletalMeshComponent.SetAllowedAnimCurvesEvaluation(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF2DD0>
	void SetAllowAnimCurveEvnt(char bInAllow); // Function Engine.SkeletalMeshComponent.SetAllowAnimCurveEvnt(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF2C70>
	void SetAllMotorsAngularVelocityDrive(char bEnableSwingDrive, char bEnableTwistDrive, char bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllMotorsAngularVelocityDrive(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF2B50>
	void SetAllMotorsAngularPositionDrive(char bEnableSwingDrive, char bEnableTwistDrive, char bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllMotorsAngularPositionDrive(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF2A30>
	void SetAllMotorsAngularDriveParams(float InSpring, float InDamping, float InForceLimit, char bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllMotorsAngularDriveParams(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF28D0>
	void SetAllBodiesSimulatePhysics(char bNewSimulate); // Function Engine.SkeletalMeshComponent.SetAllBodiesSimulatePhysics(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF2840>
	void SetAllBodiesPhysicsBlendWeight(float PhysicsBlendWeight, char bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllBodiesPhysicsBlendWeight(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF2770>
	void SetAllBodiesBelowSimulate(struct FName& InBoneName, char bNewSimulate, char bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetAllBodiesBelowSimulate(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF2650>
	void SetAllBodiesBelowPhysicsBlendWeight(struct FName& InBoneName, float PhysicsBlendWeight, char bSkipCustomPhysicsType, char bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetAllBodiesBelowPhysicsBlendWeight(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF24E0>
	void ResumeClothingSimulation(); // Function Engine.SkeletalMeshComponent.ResumeClothingSimulation(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF24C0>
	void ResetClothTeleportMode(); // Function Engine.SkeletalMeshComponent.ResetClothTeleportMode(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF24A0>
	void ResetAnimInstanceDynamics(enum class Unknow InTeleportType); // Function Engine.SkeletalMeshComponent.ResetAnimInstanceDynamics(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF2420>
	void ResetAllowedAnimCurveEvaluation(); // Function Engine.SkeletalMeshComponent.ResetAllowedAnimCurveEvaluation(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF2400>
	void ResetAllBodiesSimulatePhysics(); // Function Engine.SkeletalMeshComponent.ResetAllBodiesSimulatePhysics(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF23E0>
	void PlayAnimation(struct Unknown NewAnimToPlay, char bLooping); // Function Engine.SkeletalMeshComponent.PlayAnimation(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF2310>
	void Play(char bLooping); // Function Engine.SkeletalMeshComponent.Play(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF2280>
	void OverrideAnimationData(struct Unknown InAnimToPlay, char bIsLooping, char bIsPlaying, float Position, float PlayRate); // Function Engine.SkeletalMeshComponent.OverrideAnimationData(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF20E0>
	void LinkAnimGraphByTag(struct FName InTag, struct Unknown* InClass); // Function Engine.SkeletalMeshComponent.LinkAnimGraphByTag(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF2020>
	void LinkAnimClassLayers(struct Unknown* InClass); // Function Engine.SkeletalMeshComponent.LinkAnimClassLayers(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1FA0>
	char K2_GetClosestPointOnPhysicsAsset(struct Unknown& WorldPosition, struct Unknown& ClosestWorldPosition, struct Unknown& Normal, struct FName& BoneName, float& Distance); // Function Engine.SkeletalMeshComponent.K2_GetClosestPointOnPhysicsAsset(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1DA0>
	char IsPlaying(); // Function Engine.SkeletalMeshComponent.IsPlaying(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1D70>
	char IsClothingSimulationSuspended(); // Function Engine.SkeletalMeshComponent.IsClothingSimulationSuspended(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1D40>
	char IsBodyGravityEnabled(struct FName BoneName); // Function Engine.SkeletalMeshComponent.IsBodyGravityEnabled(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1CB0>
	char HasValidAnimationInstance(); // Function Engine.SkeletalMeshComponent.HasValidAnimationInstance(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1C80>
	float GetTeleportRotationThreshold(); // Function Engine.SkeletalMeshComponent.GetTeleportRotationThreshold(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1C50>
	float GetTeleportDistanceThreshold(); // Function Engine.SkeletalMeshComponent.GetTeleportDistanceThreshold(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1C50>
	struct Unknown GetSkeletalCenterOfMass(); // Function Engine.SkeletalMeshComponent.GetSkeletalCenterOfMass(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1C10>
	struct Unknown GetPostProcessInstance(); // Function Engine.SkeletalMeshComponent.GetPostProcessInstance(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E51470>
	float GetPosition(); // Function Engine.SkeletalMeshComponent.GetPosition(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1BE0>
	float GetPlayRate(); // Function Engine.SkeletalMeshComponent.GetPlayRate(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1BB0>
	float GetMorphTarget(struct FName MorphTargetName); // Function Engine.SkeletalMeshComponent.GetMorphTarget(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1B10>
	struct Unknown GetLinkedAnimLayerInstanceByGroup(struct FName InGroup); // Function Engine.SkeletalMeshComponent.GetLinkedAnimLayerInstanceByGroup(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1A80>
	struct Unknown GetLinkedAnimLayerInstanceByClass(struct Unknown* InClass); // Function Engine.SkeletalMeshComponent.GetLinkedAnimLayerInstanceByClass(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF19F0>
	void GetLinkedAnimGraphInstancesByTag(struct FName InTag, struct TArray<Unknown>& OutLinkedInstances); // Function Engine.SkeletalMeshComponent.GetLinkedAnimGraphInstancesByTag(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1900>
	struct Unknown GetLinkedAnimGraphInstanceByTag(struct FName InTag); // Function Engine.SkeletalMeshComponent.GetLinkedAnimGraphInstanceByTag(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1870>
	char GetDisablePostProcessBlueprint(); // Function Engine.SkeletalMeshComponent.GetDisablePostProcessBlueprint(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1840>
	char GetDisableAnimCurves(); // Function Engine.SkeletalMeshComponent.GetDisableAnimCurves(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1810>
	void GetCurrentJointAngles(struct FName InBoneName, float& Swing1Angle, float& TwistAngle, float& Swing2Angle); // Function Engine.SkeletalMeshComponent.GetCurrentJointAngles(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1690>
	float GetClothMaxDistanceScale(); // Function Engine.SkeletalMeshComponent.GetClothMaxDistanceScale(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1630>
	struct Unknown GetClothingSimulationInteractor(); // Function Engine.SkeletalMeshComponent.GetClothingSimulationInteractor(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1660>
	float GetBoneMass(struct FName BoneName, char bScaleMass); // Function Engine.SkeletalMeshComponent.GetBoneMass(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1560>
	struct Unknown GetAnimInstance(); // Function Engine.SkeletalMeshComponent.GetAnimInstance(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1500>
	struct Unknown* GetAnimClass(); // Function Engine.SkeletalMeshComponent.GetAnimClass(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF14D0>
	char GetAnimationMode(); // Function Engine.SkeletalMeshComponent.GetAnimationMode(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1530>
	char GetAllowRigidBodyAnimNode(); // Function Engine.SkeletalMeshComponent.GetAllowRigidBodyAnimNode(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1470>
	char GetAllowedAnimCurveEvaluate(); // Function Engine.SkeletalMeshComponent.GetAllowedAnimCurveEvaluate(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF14A0>
	void ForceClothNextUpdateTeleportAndReset(); // Function Engine.SkeletalMeshComponent.ForceClothNextUpdateTeleportAndReset(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1450>
	void ForceClothNextUpdateTeleport(); // Function Engine.SkeletalMeshComponent.ForceClothNextUpdateTeleport(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1430>
	struct FName FindConstraintBoneName(int32_t ConstraintIndex); // Function Engine.SkeletalMeshComponent.FindConstraintBoneName(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF13A0>
	void ClearMorphTargets(); // Function Engine.SkeletalMeshComponent.ClearMorphTargets(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1380>
	void BreakConstraint(struct Unknown Impulse, struct Unknown HitLocation, struct FName InBoneName); // Function Engine.SkeletalMeshComponent.BreakConstraint(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1250>
	void BindClothToMasterPoseComponent(); // Function Engine.SkeletalMeshComponent.BindClothToMasterPoseComponent(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1230>
	void AllowAnimCurveEvaluation(struct FName NameOfCurve, char bAllow); // Function Engine.SkeletalMeshComponent.AllowAnimCurveEvaluation(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF1160>
	void AddImpulseToAllBodiesBelow(struct Unknown Impulse, struct FName BoneName, char bVelChange, char bIncludeSelf); // Function Engine.SkeletalMeshComponent.AddImpulseToAllBodiesBelow(Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF0FF0>
	void AddForceToAllBodiesBelow(struct Unknown Force, struct FName BoneName, char bAccelChange, char bIncludeSelf); // Function Engine.SkeletalMeshComponent.AddForceToAllBodiesBelow(Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF0E80>
	void AccumulateAllBodiesBelowPhysicsBlendWeight(struct FName& InBoneName, float AddPhysicsBlendWeight, char bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.AccumulateAllBodiesBelowPhysicsBlendWeight(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DF0D60>
};

// Class Engine.AnimInstance
struct UAnimInstance : Object {
	struct Unknown CurrentSkeleton; // 0x28 (8)
	char RootMotionMode; // 0x30 (1)
	char bUseMultiThreadedAnimationUpdate : 0; // 0x31 (1)
	char bUsingCopyPoseFromMesh : 0; // 0x31 (1)
	char b : 0; // 0x31 (1)
	char bPropagateNotifiesToLinkedInstances : 0; // 0x31 (1)
	char bQueueMontageEvents : 0; // 0x31 (1)
	struct FMulticastInlineDelegate OnMontageBlendingOut; // 0x38 (16)
	struct FMulticastInlineDelegate OnMontageStarted; // 0x48 (16)
	struct FMulticastInlineDelegate OnMontageEnded; // 0x58 (16)
	struct FMulticastInlineDelegate OnAllMontageInstancesEnded; // 0x68 (16)
	struct Unknown NotifyQueue; // 0x100 (112)
	struct TArray<Unknown> ActiveAnimNotifyState; // 0x170 (16)

	void UnlockAIResources(char bUnlockMovement, char UnlockAILogic); // Function Engine.AnimInstance.UnlockAIResources(Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EDF3B0>
	void UnlinkAnimClassLayers(struct Unknown* InClass); // Function Engine.AnimInstance.UnlinkAnimClassLayers(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C74530>
	struct Unknown TryGetPawnOwner(); // Function Engine.AnimInstance.TryGetPawnOwner(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C74500>
	void StopSlotAnimation(float InBlendOutTime, struct FName SlotNodeName); // Function Engine.AnimInstance.StopSlotAnimation(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C74430>
	void SnapshotPose(struct Unknown& Snapshot); // Function Engine.AnimInstance.SnapshotPose(Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C74360>
	void SetRootMotionMode(char Value); // Function Engine.AnimInstance.SetRootMotionMode(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C742E0>
	void SetReceiveNotifiesFromLinkedInstances(char bSet); // Function Engine.AnimInstance.SetReceiveNotifiesFromLinkedInstances(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C74250>
	void SetPropagateNotifiesToLinkedInstances(char bSet); // Function Engine.AnimInstance.SetPropagateNotifiesToLinkedInstances(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C741C0>
	void SetMorphTarget(struct FName MorphTargetName, float Value); // Function Engine.AnimInstance.SetMorphTarget(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C740F0>
	void SavePoseSnapshot(struct FName SnapshotName); // Function Engine.AnimInstance.SavePoseSnapshot(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C74060>
	void ResetDynamics(enum class Unknow InTeleportType); // Function Engine.AnimInstance.ResetDynamics(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C73FE0>
	struct Unknown PlaySlotAnimationAsDynamicMontage(struct Unknown Asset, struct FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32_t LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C73DA0>
	float PlaySlotAnimation(struct Unknown Asset, struct FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32_t LoopCount); // Function Engine.AnimInstance.PlaySlotAnimation(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C73BE0>
	void Montage_StopGroupByName(float InBlendOutTime, struct FName GroupName); // Function Engine.AnimInstance.Montage_StopGroupByName(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C73B10>
	void Montage_Stop(float InBlendOutTime, struct Unknown Montage); // Function Engine.AnimInstance.Montage_Stop(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C73A40>
	void Montage_SetPosition(struct Unknown Montage, float NewPosition); // Function Engine.AnimInstance.Montage_SetPosition(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C73970>
	void Montage_SetPlayRate(struct Unknown Montage, float NewPlayRate); // Function Engine.AnimInstance.Montage_SetPlayRate(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C738A0>
	void Montage_SetNextSection(struct FName SectionNameToChange, struct FName NextSection, struct Unknown Montage); // Function Engine.AnimInstance.Montage_SetNextSection(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C737A0>
	void Montage_Resume(struct Unknown Montage); // Function Engine.AnimInstance.Montage_Resume(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C73720>
	float Montage_Play(struct Unknown MontageToPlay, float InPlayRate, enum class Unknow ReturnValueType, float InTimeToStartMontageAt, char bStopAllMontages); // Function Engine.AnimInstance.Montage_Play(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C73590>
	void Montage_Pause(struct Unknown Montage); // Function Engine.AnimInstance.Montage_Pause(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C73510>
	void Montage_JumpToSectionsEnd(struct FName SectionName, struct Unknown Montage); // Function Engine.AnimInstance.Montage_JumpToSectionsEnd(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C73450>
	void Montage_JumpToSection(struct FName SectionName, struct Unknown Montage); // Function Engine.AnimInstance.Montage_JumpToSection(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C73390>
	char Montage_IsPlaying(struct Unknown Montage); // Function Engine.AnimInstance.Montage_IsPlaying(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C73300>
	char Montage_IsActive(struct Unknown Montage); // Function Engine.AnimInstance.Montage_IsActive(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C73270>
	float Montage_GetPosition(struct Unknown Montage); // Function Engine.AnimInstance.Montage_GetPosition(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C731D0>
	float Montage_GetPlayRate(struct Unknown Montage); // Function Engine.AnimInstance.Montage_GetPlayRate(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C73130>
	char Montage_GetIsStopped(struct Unknown Montage); // Function Engine.AnimInstance.Montage_GetIsStopped(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C730A0>
	struct FName Montage_GetCurrentSection(struct Unknown Montage); // Function Engine.AnimInstance.Montage_GetCurrentSection(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C73010>
	float Montage_GetBlendTime(struct Unknown Montage); // Function Engine.AnimInstance.Montage_GetBlendTime(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C72F70>
	void LockAIResources(char bLockMovement, char LockAILogic); // Function Engine.AnimInstance.LockAIResources(Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EDF3B0>
	void LinkAnimGraphByTag(struct FName InTag, struct Unknown* InClass); // Function Engine.AnimInstance.LinkAnimGraphByTag(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C72EB0>
	void LinkAnimClassLayers(struct Unknown* InClass); // Function Engine.AnimInstance.LinkAnimClassLayers(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C72E30>
	char IsSyncGroupBetweenMarkers(struct FName InSyncGroupName, struct FName PreviousMarker, struct FName NextMarker, char b); // Function Engine.AnimInstance.IsSyncGroupBetweenMarkers(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C72CE0>
	char IsPlayingSlotAnimation(struct Unknown Asset, struct FName SlotNodeName); // Function Engine.AnimInstance.IsPlayingSlotAnimation(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C72C20>
	char IsAnyMontagePlaying(); // Function Engine.AnimInstance.IsAnyMontagePlaying(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C72BF0>
	char HasMarkerBeenHitThisFrame(struct FName SyncGroup, struct FName MarkerName); // Function Engine.AnimInstance.HasMarkerBeenHitThisFrame(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C72B30>
	char GetTimeToClosestMarker(struct FName SyncGroup, struct FName MarkerName, float& OutMarkerTime); // Function Engine.AnimInstance.GetTimeToClosestMarker(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C72A20>
	struct Unknown GetSyncGroupPosition(struct FName InSyncGroupName); // Function Engine.AnimInstance.GetSyncGroupPosition(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C72980>
	float GetRelevantAnimTimeRemainingFraction(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeRemainingFraction(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C728C0>
	float GetRelevantAnimTimeRemaining(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeRemaining(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C72800>
	float GetRelevantAnimTimeFraction(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeFraction(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C72740>
	float GetRelevantAnimTime(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTime(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C72680>
	float GetRelevantAnimLength(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimLength(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C725C0>
	char GetReceiveNotifiesFromLinkedInstances(); // Function Engine.AnimInstance.GetReceiveNotifiesFromLinkedInstances(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C72590>
	char GetPropagateNotifiesToLinkedInstances(); // Function Engine.AnimInstance.GetPropagateNotifiesToLinkedInstances(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C72560>
	struct Unknown GetOwningComponent(); // Function Engine.AnimInstance.GetOwningComponent(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C72530>
	struct Unknown GetOwningActor(); // Function Engine.AnimInstance.GetOwningActor(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C72500>
	struct Unknown GetLinkedAnimLayerInstanceByGroup(struct FName InGroup); // Function Engine.AnimInstance.GetLinkedAnimLayerInstanceByGroup(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C72470>
	struct Unknown GetLinkedAnimLayerInstanceByClass(struct Unknown* InClass); // Function Engine.AnimInstance.GetLinkedAnimLayerInstanceByClass(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C723E0>
	void GetLinkedAnimGraphInstancesByTag(struct FName InTag, struct TArray<Unknown>& OutLinkedInstances); // Function Engine.AnimInstance.GetLinkedAnimGraphInstancesByTag(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C722F0>
	struct Unknown GetLinkedAnimGraphInstanceByTag(struct FName InTag); // Function Engine.AnimInstance.GetLinkedAnimGraphInstanceByTag(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C72260>
	float GetInstanceTransitionTimeElapsedFraction(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionTimeElapsedFraction(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C721A0>
	float GetInstanceTransitionTimeElapsed(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionTimeElapsed(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C720E0>
	float GetInstanceTransitionCrossfadeDuration(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionCrossfadeDuration(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C72020>
	float GetInstanceStateWeight(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetInstanceStateWeight(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C71F60>
	float GetInstanceMachineWeight(int32_t MachineIndex); // Function Engine.AnimInstance.GetInstanceMachineWeight(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C71ED0>
	float GetInstanceCurrentStateElapsedTime(int32_t MachineIndex); // Function Engine.AnimInstance.GetInstanceCurrentStateElapsedTime(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C71E40>
	float GetInstanceAssetPlayerTimeFromEndFraction(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFromEndFraction(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C71DB0>
	float GetInstanceAssetPlayerTimeFromEnd(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFromEnd(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C71D20>
	float GetInstanceAssetPlayerTimeFraction(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFraction(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C71C90>
	float GetInstanceAssetPlayerTime(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTime(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C71C00>
	float GetInstanceAssetPlayerLength(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerLength(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C71B70>
	float GetCurveValue(struct FName CurveName); // Function Engine.AnimInstance.GetCurveValue(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C71AD0>
	struct FName GetCurrentStateName(int32_t MachineIndex); // Function Engine.AnimInstance.GetCurrentStateName(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C71A40>
	struct Unknown GetCurrentActiveMontage(); // Function Engine.AnimInstance.GetCurrentActiveMontage(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C71A10>
	void GetAllCurveNames(struct TArray<Unknown>& OutNames); // Function Engine.AnimInstance.GetAllCurveNames(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C71960>
	void GetActiveCurveNames(enum class Unknow CurveType, struct TArray<Unknown>& OutNames); // Function Engine.AnimInstance.GetActiveCurveNames(Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C71870>
	void ClearMorphTargets(); // Function Engine.AnimInstance.ClearMorphTargets(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C71850>
	float CalculateDirection(struct Unknown& Velocity, struct Unknown& BaseRotation); // Function Engine.AnimInstance.CalculateDirection(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3C71750>
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Engine.AnimInstance.BlueprintUpdateAnimation(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BlueprintPostEvaluateAnimation(); // Function Engine.AnimInstance.BlueprintPostEvaluateAnimation(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BlueprintLinkedAnimationLayersInitialized(); // Function Engine.AnimInstance.BlueprintLinkedAnimationLayersInitialized(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BlueprintInitializeAnimation(); // Function Engine.AnimInstance.BlueprintInitializeAnimation(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BlueprintBeginPlay(); // Function Engine.AnimInstance.BlueprintBeginPlay(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// Class Engine.Exporter
struct UExporter : Object {
	struct Unknown* SupportedClass; // 0x28 (8)
	struct Unknown ExportRootScope; // 0x30 (8)
	struct TArray<Unknown> FormatExtension; // 0x38 (16)
	struct TArray<Unknown> FormatDescription; // 0x48 (16)
	int32_t PreferredFormatIndex; // 0x58 (4)
	int32_t TextIndent; // 0x5C (4)
	char bText : 0; // 0x60 (1)
	char bSelectedOnly : 0; // 0x60 (1)
	char bForceFileOperations : 0; // 0x60 (1)
	struct Unknown ExportTask; // 0x68 (8)

	char ScriptRunAssetExportTask(struct Unknown Task); // Function Engine.Exporter.ScriptRunAssetExportTask(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	char RunAssetExportTasks(struct TArray<Unknown>& ExportTasks); // Function Engine.Exporter.RunAssetExportTasks(Final|RequiredAPI|Native|Static|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CE3370>
	char RunAssetExportTask(struct Unknown Task); // Function Engine.Exporter.RunAssetExportTask(Final|RequiredAPI|Native|Static|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x17D8130>
};

// Class Engine.LevelScriptActor
struct ALevelScriptActor : UActor {
	char bInputEnabled : 0; // 0x310 (1)

	void WorldOriginLocationChanged(struct Unknown OldOriginLocation, struct Unknown NewOriginLocation); // Function Engine.LevelScriptActor.WorldOriginLocationChanged(Event|Public|HasDefaults|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetCinematicMode(char bCinematicMode, char bHidePlayer, char bAffectsHUD, char bAffectsMovement, char bAffectsTurning); // Function Engine.LevelScriptActor.SetCinematicMode(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3D6D780>
	char RemoteEvent(struct FName EventName); // Function Engine.LevelScriptActor.RemoteEvent(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3D6D230>
	void LevelReset(); // Function Engine.LevelScriptActor.LevelReset(BlueprintAuthorityOnly|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

// Class Engine.FXSystemAsset
struct UFXSystemAsset : Object {
	uint32_t MaxPoolSize; // 0x28 (4)
};

// Class Engine.Brush
struct ABrush : UActor {
	char BrushType; // 0x310 (1)
	struct Unknown BrushColor; // 0x314 (4)
	int32_t PolyFlags; // 0x318 (4)
	char bColored : 0; // 0x31C (1)
	char bSolidWhenSelected : 0; // 0x31C (1)
	char bPlaceableFromClassBrowser : 0; // 0x31C (1)
	char bNotForClientOrServ : 0; // 0x31C (1)
	struct Unknown Brush; // 0x320 (8)
	struct Unknown BrushComponent; // 0x328 (8)
	char bInManipulation : 0; // 0x330 (1)
	struct TArray<Unknown> SavedSelections; // 0x338 (16)
};

// Class Engine.MKWorldEx
struct UMKWorldEx : Object {
	struct Unknown SelfWorld; // 0x38 (8)
};

// Class Engine.World
struct UWorld : UMKWorldEx {
	struct Unknown PersistentLevel; // 0x48 (8)
	struct Unknown NetDriver; // 0x50 (8)
	struct Unknown LineBatcher; // 0x58 (8)
	struct Unknown PersistentLineBatcher; // 0x60 (8)
	struct Unknown ForegroundLineBatcher; // 0x68 (8)
	struct Unknown NetworkManager; // 0x70 (8)
	struct Unknown PhysicsCollisionHandler; // 0x78 (8)
	struct TArray<Unknown> ExtraReferencedObjects; // 0x80 (16)
	struct TArray<Unknown> PerModuleDataObjects; // 0x90 (16)
	struct TArray<Unknown> LevelSequenceActors; // 0xA0 (16)
	struct TArray<Unknown> StreamingLevels; // 0xB0 (16)
	struct Unknown StreamingLevelsToConsider; // 0xC0 (72)
	struct FString StreamingLevelsPrefix; // 0x120 (16)
	struct Unknown CurrentLevelPendingVisibility; // 0x130 (8)
	struct Unknown CurrentLevelPendingInvisibility; // 0x138 (8)
	struct Unknown DemoNetDriver; // 0x140 (8)
	struct Unknown MyParticleEventManager; // 0x148 (8)
	struct Unknown DefaultPhysicsVolume; // 0x150 (8)
	char bAreConstraintsDirty : 0; // 0x16E (1)
	struct Unknown NavigationSystem; // 0x170 (8)
	struct Unknown AuthorityGameMode; // 0x178 (8)
	struct Unknown GameState; // 0x180 (8)
	struct Unknown AISystem; // 0x188 (8)
	struct Unknown AvoidanceManager; // 0x190 (8)
	struct TArray<Unknown> Levels; // 0x198 (16)
	struct TArray<Unknown> LevelCollections; // 0x1A8 (16)
	struct Unknown OwningGameInstance; // 0x1D8 (8)
	struct TArray<Unknown> ParameterCollectionInstances; // 0x1E0 (16)
	struct Unknown CanvasForRenderingToTarget; // 0x1F0 (8)
	struct Unknown CanvasForDrawMaterialToRenderTarget; // 0x1F8 (8)
	struct TArray<Unknown> ComponentsThatNeedEndOfFrameUpdate; // 0x250 (16)
	struct TArray<Unknown> ComponentsThatNeedEndOfFrameUpdate_OnGameThread; // 0x260 (16)
	struct Unknown WorldComposition; // 0x5B0 (8)
	struct Unknown PSCPool; // 0x650 (88)

	struct Unknown K2_GetWorldSettings(); // Function Engine.World.K2_GetWorldSettings(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E2E050>
	void HandleTimelineScrubbed(); // Function Engine.World.HandleTimelineScrubbed(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E2E030>
};

// Class Engine.InterpTrack
struct UInterpTrack : Object {
	struct TArray<Unknown> SubTracks; // 0x38 (16)
	struct Unknown* TrackInstClass; // 0x48 (8)
	char ActiveCondition; // 0x50 (1)
	struct FString TrackTitle; // 0x58 (16)
	char bOnePerGroup : 0; // 0x68 (1)
	char bDirGroupOnly : 0; // 0x68 (1)
	char bDisableTrack : 0; // 0x68 (1)
	char bIsSelected : 0; // 0x68 (1)
	char bIsAnimControlTrack : 0; // 0x68 (1)
	char bSubTrackOnly : 0; // 0x68 (1)
	char bVisible : 0; // 0x68 (1)
	char bIsRecording : 0; // 0x68 (1)
};

// Class Engine.InterpTrackVectorBase
struct UInterpTrackVectorBase : UInterpTrack {
	struct Unknown VectorTrack; // 0x70 (24)
	float CurveTension; // 0x88 (4)
};

// Class Engine.InterpTrackFloatBase
struct UInterpTrackFloatBase : UInterpTrack {
	struct Unknown FloatTrack; // 0x70 (24)
	float CurveTension; // 0x88 (4)
};

// Class Engine.DataAsset
struct UDataAsset : Object {
	struct Unknown* NativeClass; // 0x28 (8)
};

// Class Engine.MaterialExpression
struct UMaterialExpression : Object {
	struct Unknown Material; // 0x28 (8)
	struct Unknown Function; // 0x30 (8)
	char bIsParameterExpression : 0; // 0x38 (1)
};

// Class Engine.MaterialExpressionTextureBase
struct UMaterialExpressionTextureBase : UMaterialExpression {
	struct Unknown Texture; // 0x40 (8)
	char SamplerType; // 0x48 (1)
	char IsDefaultMeshpaintTexture : 0; // 0x49 (1)
};

// Class Engine.MaterialExpressionTextureSample
struct UMaterialExpressionTextureSample : UMaterialExpressionTextureBase {
	struct Unknown Coordinates; // 0x50 (12)
	struct Unknown TextureObject; // 0x64 (12)
	struct Unknown MipValue; // 0x78 (12)
	struct Unknown CoordinatesDX; // 0x8C (12)
	struct Unknown CoordinatesDY; // 0xA0 (12)
	struct Unknown AutomaticViewMipBiasValue; // 0xB4 (12)
	char MipValueMode; // 0xC8 (1)
	char SamplerSource; // 0xC9 (1)
	char AutomaticViewMipBias : 0; // 0xCA (1)
	char ConstCoordinate; // 0xCB (1)
	int32_t ConstMipValue; // 0xCC (4)
};

// Class Engine.MaterialExpressionTextureSampleParameter
struct UMaterialExpressionTextureSampleParameter : UMaterialExpressionTextureSample {
	struct FName ParameterName; // 0xD0 (8)
	struct Unknown ExpressionGUID; // 0xD8 (16)
	struct FName Group; // 0xE8 (8)
};

// Class Engine.MKPawnEx
struct AMKPawnEx : UActor {
	struct Unknown SelfPawn; // 0x318 (8)

	void OnChangedViewMode(); // Function Engine.MKPawnEx.OnChangedViewMode(Native|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1E52540>
};

// Class Engine.Pawn
struct APawn : AMKPawnEx {
	char bUseControllerRotationPitch : 0; // 0x328 (1)
	char bUseControllerRotationYaw : 0; // 0x328 (1)
	char bUseControllerRotationRoll : 0; // 0x328 (1)
	char bCanAffectNavigationGeneration : 0; // 0x328 (1)
	float BaseEyeHeight; // 0x32C (4)
	char AutoPossessPlayer; // 0x330 (1)
	enum class Unknow AutoPossessAI; // 0x331 (1)
	uint16_t RemoteViewPitch; // 0x332 (2)
	uint16_t RemoteViewYaw; // 0x334 (2)
	struct Unknown* AIControllerClass; // 0x338 (8)
	struct Unknown PlayerState; // 0x340 (8)
	struct Unknown LastHitBy; // 0x350 (8)
	struct Unknown Controller; // 0x358 (8)
	struct Unknown ControlInputVector; // 0x364 (12)
	struct Unknown LastControlInputVector; // 0x370 (12)

	void SpawnDefaultController(); // Function Engine.Pawn.SpawnDefaultController(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB47A0>
	void SetCanAffectNavigationGeneration(char bNewValue, char bForceUpdate); // Function Engine.Pawn.SetCanAffectNavigationGeneration(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB45D0>
	void ReceiveUnpossessed(struct Unknown OldController); // Function Engine.Pawn.ReceiveUnpossessed(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceivePossessed(struct Unknown NewController); // Function Engine.Pawn.ReceivePossessed(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void PawnMakeNoise(float Loudness, struct Unknown NoiseLocation, char bUseNoiseMakerLocation, struct Unknown NoiseMaker); // Function Engine.Pawn.PawnMakeNoise(Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB4460>
	void OnRep_PlayerState(); // Function Engine.Pawn.OnRep_PlayerState(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F1F240>
	void OnRep_Controller(); // Function Engine.Pawn.OnRep_Controller(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CC0150>
	void LaunchPawn(struct Unknown LaunchVelocity, char bXYOverride, char bZOverride); // Function Engine.Pawn.LaunchPawn(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB4220>
	struct Unknown K2_GetMovementInputVector(); // Function Engine.Pawn.K2_GetMovementInputVector(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB4090>
	char IsPlayerControlled(); // Function Engine.Pawn.IsPlayerControlled(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB41F0>
	char IsPawnControlled(); // Function Engine.Pawn.IsPawnControlled(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB41C0>
	char IsMoveInputIgnored(); // Function Engine.Pawn.IsMoveInputIgnored(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB4160>
	char IsLocallyControlled(); // Function Engine.Pawn.IsLocallyControlled(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB4130>
	char IsControlled(); // Function Engine.Pawn.IsControlled(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB4100>
	char IsBotControlled(); // Function Engine.Pawn.IsBotControlled(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB40D0>
	struct Unknown GetPendingMovementInputVector(); // Function Engine.Pawn.GetPendingMovementInputVector(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB4090>
	struct Unknown GetNavAgentLocation(); // Function Engine.Pawn.GetNavAgentLocation(Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB3FD0>
	struct Unknown GetMovementComponent(); // Function Engine.Pawn.GetMovementComponent(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB3FA0>
	struct Unknown GetMovementBaseActor(struct Unknown Pawn); // Function Engine.Pawn.GetMovementBaseActor(Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB3F20>
	struct Unknown GetLastMovementInputVector(); // Function Engine.Pawn.GetLastMovementInputVector(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB3EE0>
	struct Unknown GetControlRotation(); // Function Engine.Pawn.GetControlRotation(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB3E40>
	struct Unknown GetController(); // Function Engine.Pawn.GetController(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB3E80>
	struct Unknown GetBaseAimRotation(); // Function Engine.Pawn.GetBaseAimRotation(Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB3D40>
	void DetachFromControllerPendingDestroy(); // Function Engine.Pawn.DetachFromControllerPendingDestroy(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1F2B3B0>
	struct Unknown ConsumeMovementInputVector(); // Function Engine.Pawn.ConsumeMovementInputVector(Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB3D00>
	void AddMovementInput(struct Unknown WorldDirection, float ScaleValue, char bForce); // Function Engine.Pawn.AddMovementInput(Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB3840>
	void AddControllerYawInput(float Val); // Function Engine.Pawn.AddControllerYawInput(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB36E0>
	void AddControllerRollInput(float Val); // Function Engine.Pawn.AddControllerRollInput(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB3660>
	void AddControllerPitchInput(float Val); // Function Engine.Pawn.AddControllerPitchInput(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3DB35E0>
};

// Class Engine.MKCharacterEx
struct AMKCharacterEx : APawn {
	struct Unknown SelfCharacter; // 0x388 (8)
};

// Class Engine.Character
struct ACharacter : AMKCharacterEx {
	struct Unknown Mesh; // 0x398 (8)
	struct Unknown CharacterMovement; // 0x3A0 (8)
	struct Unknown CapsuleComponent; // 0x3A8 (8)
	struct Unknown BasedMovement; // 0x3B8 (48)
	struct Unknown ReplicatedBasedMovement; // 0x3E8 (48)
	float AnimRootMotionTranslationScale; // 0x418 (4)
	struct Unknown BaseTranslationOffset; // 0x41C (12)
	struct Unknown BaseRotationOffset; // 0x430 (16)
	float ReplicatedServerLastTransformUpdateTimeStamp; // 0x440 (4)
	float ReplayLastTransformUpdateTimeStamp; // 0x444 (4)
	char ReplicatedMovementMode; // 0x448 (1)
	char bInBaseReplication : 0; // 0x449 (1)
	float CrouchedEyeHeight; // 0x44C (4)
	char bIsCrouched : 0; // 0x450 (1)
	char bProxyIsJumpForceApplied : 0; // 0x450 (1)
	char bPressedJump : 0; // 0x450 (1)
	char bClientUpdating : 0; // 0x450 (1)
	char bClientWasFalling : 0; // 0x450 (1)
	char bClientResimulateRootMotion : 0; // 0x450 (1)
	char bClientResimulateRootMotionSources : 0; // 0x450 (1)
	char bSimGravityDisabled : 0; // 0x450 (1)
	char bClientCheckEncroachmentOnNetUpdate : 0; // 0x451 (1)
	char bServerMoveIgnoreRootMotion : 0; // 0x451 (1)
	char bWasJumping : 0; // 0x451 (1)
	float JumpKeyHoldTime; // 0x454 (4)
	float JumpForceTimeRemaining; // 0x458 (4)
	float ProxyJumpForceStartedTime; // 0x45C (4)
	float JumpMaxHoldTime; // 0x460 (4)
	int32_t JumpMaxCount; // 0x464 (4)
	int32_t JumpCurrentCount; // 0x468 (4)
	struct FMulticastInlineDelegate OnReachedJumpApex; // 0x470 (16)
	struct FMulticastInlineDelegate MovementModeChangedDelegate; // 0x490 (16)
	struct FMulticastInlineDelegate OnCharacterMovementUpdated; // 0x4A0 (16)
	struct Unknown SavedRootMotion; // 0x4B0 (56)
	struct Unknown ClientRootMotionParams; // 0x4F0 (64)
	struct TArray<Unknown> RootMotionRepMoves; // 0x530 (16)
	struct Unknown RepRootMotion; // 0x540 (152)

	void UnCrouch(char bClientSimulation); // Function Engine.Character.UnCrouch(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x202DF60>
	void StopJumping(); // Function Engine.Character.StopJumping(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x202F670>
	void StopAnimMontage(struct Unknown AnimMontage); // Function Engine.Character.StopAnimMontage(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB4FC0>
	void ServerMoveOld(float OldTimeStamp, struct Unknown OldAccel, struct Unknown InVel, char OldMoveFlags); // Function Engine.Character.ServerMoveOld(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB4B50>
	void ServerMoveNoBase(float Timestamp, struct Unknown InAccel, struct Unknown InVel, struct Unknown ClientLoc, char CompressedMoveFlags, char ClientRoll, uint32_t View, char ClientMovementMode); // Function Engine.Character.ServerMoveNoBase(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB4860>
	void ServerMoveDualNoBase(float TimeStamp0, struct Unknown InAccel0, struct Unknown InVel, char PendingFlags, uint32_t View0, float Timestamp, struct Unknown InAccel, struct Unknown ClientLoc, char NewFlags, char ClientRoll, uint32_t View, char ClientMovementMode); // Function Engine.Character.ServerMoveDualNoBase(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB4420>
	void ServerMoveDualHybridRootMotion(float TimeStamp0, struct Unknown InAccel0, struct Unknown InVel, char PendingFlags, uint32_t View0, float Timestamp, struct Unknown InAccel, struct Unknown ClientLoc, char NewFlags, char ClientRoll, uint32_t View, struct Unknown ClientMovementBase, struct FName ClientBaseBoneName, char ClientMovementMode); // Function Engine.Character.ServerMoveDualHybridRootMotion(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB3F70>
	void ServerMoveDual(float TimeStamp0, struct Unknown InAccel0, struct Unknown InVel, char PendingFlags, uint32_t View0, float Timestamp, struct Unknown InAccel, struct Unknown ClientLoc, char NewFlags, char ClientRoll, uint32_t View, struct Unknown ClientMovementBase, struct FName ClientBaseBoneName, char ClientMovementMode); // Function Engine.Character.ServerMoveDual(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB3AC0>
	void ServerMove(float Timestamp, struct Unknown InAccel, struct Unknown InVel, struct Unknown ClientLoc, char CompressedMoveFlags, char ClientRoll, uint32_t View, struct Unknown ClientMovementBase, struct FName ClientBaseBoneName, char ClientMovementMode); // Function Engine.Character.ServerMove(Net|Native|Event|Public|NetServer|NetValidate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB3740>
	void RootMotionDebugClientPrintOnScreen(struct FString inString); // Function Engine.Character.RootMotionDebugClientPrintOnScreen(Net|NetReliableNative|Event|Public|NetClient) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB3690>
	float PlayAnimMontage(struct Unknown AnimMontage, float InPlayRate, struct FName StartSectionName); // Function Engine.Character.PlayAnimMontage(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB3580>
	void OnWalkingOffLedge(struct Unknown& PreviousFloorImpactNormal, struct Unknown& PreviousFloorContactNormal, struct Unknown& PreviousLocation, float TimeDelta); // Function Engine.Character.OnWalkingOffLedge(Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB33E0>
	void OnRep_RootMotion(); // Function Engine.Character.OnRep_RootMotion(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB33C0>
	void OnRep_ReplicatedBasedMovement(); // Function Engine.Character.OnRep_ReplicatedBasedMovement(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB33A0>
	void OnRep_ReplayLastTransformUpdateTimeStamp(); // Function Engine.Character.OnRep_ReplayLastTransformUpdateTimeStamp(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB3380>
	void OnRep_IsCrouched(); // Function Engine.Character.OnRep_IsCrouched(Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB3360>
	void OnLaunched(struct Unknown LaunchVelocity, char bXYOverride, char bZOverride); // Function Engine.Character.OnLaunched(Event|Public|HasDefaults|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnLanded(struct Unknown& Hit); // Function Engine.Character.OnLanded(Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnJumped(); // Function Engine.Character.OnJumped(Native|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB3340>
	void LaunchCharacter(struct Unknown LaunchVelocity, char bXYOverride, char bZOverride); // Function Engine.Character.LaunchCharacter(Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB3220>
	void K2_UpdateCustomMovement(float DeltaTime); // Function Engine.Character.K2_UpdateCustomMovement(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void K2_OnStartCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function Engine.Character.K2_OnStartCrouch(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void K2_OnMovementModeChanged(char PrevMovementMode, char NewMovementMode, char PrevCustomMode, char NewCustomMode); // Function Engine.Character.K2_OnMovementModeChanged(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void K2_OnEndCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function Engine.Character.K2_OnEndCrouch(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Jump(); // Function Engine.Character.Jump(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x202DFF0>
	char IsPlayingRootMotion(); // Function Engine.Character.IsPlayingRootMotion(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB31F0>
	char IsPlayingNetworkedRootMotionMontage(); // Function Engine.Character.IsPlayingNetworkedRootMotionMontage(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB31C0>
	char IsJumpProvidingForce(); // Function Engine.Character.IsJumpProvidingForce(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x202DDE0>
	char HasAnyRootMotion(); // Function Engine.Character.HasAnyRootMotion(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB3190>
	struct Unknown GetCurrentMontage(); // Function Engine.Character.GetCurrentMontage(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB2B00>
	struct Unknown GetBaseTranslationOffset(); // Function Engine.Character.GetBaseTranslationOffset(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB2AD0>
	struct Unknown GetBaseRotationOffsetRotator(); // Function Engine.Character.GetBaseRotationOffsetRotator(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB2A80>
	float GetAnimRootMotionTranslationScale(); // Function Engine.Character.GetAnimRootMotionTranslationScale(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB2A50>
	void ForceLastAckMove(); // Function Engine.Character.ForceLastAckMove(Net|Native|Event|Public|NetClient) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB2A30>
	void Crouch(char bClientSimulation); // Function Engine.Character.Crouch(Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB29A0>
	void ClientVeryShortAdjustPosition(float Timestamp, struct Unknown NewLoc, struct Unknown NewBase, struct FName NewBaseBoneName, char bHasBase, char bBaseRelativePosition, char ServerMovementMode); // Function Engine.Character.ClientVeryShortAdjustPosition(Net|Native|Event|Public|HasDefaults|NetClient) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB2650>
	void ClientCheatWalk(); // Function Engine.Character.ClientCheatWalk(Net|NetReliableNative|Event|Public|NetClient) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1EA8FB0>
	void ClientCheatGhost(); // Function Engine.Character.ClientCheatGhost(Net|NetReliableNative|Event|Public|NetClient) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2026C80>
	void ClientCheatFly(); // Function Engine.Character.ClientCheatFly(Net|NetReliableNative|Event|Public|NetClient) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3394E80>
	void ClientAdjustRootMotionSourcePosition(float Timestamp, struct Unknown ServerRootMotion, char bHasAnimRootMotion, float ServerMontageTrackPosition, struct Unknown ServerLoc, struct Unknown ServerRotation, float ServerVelZ, struct Unknown ServerBase, struct FName ServerBoneName, char bHasBase, char bBaseRelativePosition, char ServerMovementMode); // Function Engine.Character.ClientAdjustRootMotionSourcePosition(Net|Native|Event|Public|HasDefaults|NetClient) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB2190>
	void ClientAdjustRootMotionPosition(float Timestamp, float ServerMontageTrackPosition, struct Unknown ServerLoc, struct Unknown ServerRotation, float ServerVelZ, struct Unknown ServerBase, struct FName ServerBoneName, char bHasBase, char bBaseRelativePosition, char ServerMovementMode); // Function Engine.Character.ClientAdjustRootMotionPosition(Net|Native|Event|Public|HasDefaults|NetClient) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB1EA0>
	void ClientAdjustPosition(float Timestamp, struct Unknown NewLoc, struct Unknown NewVel, struct Unknown NewBase, struct FName NewBaseBoneName, char bHasBase, char bBaseRelativePosition, char ServerMovementMode); // Function Engine.Character.ClientAdjustPosition(Net|Native|Event|Public|HasDefaults|NetClient) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB1C30>
	void ClientAckGoodMove(float Timestamp); // Function Engine.Character.ClientAckGoodMove(Net|Native|Event|Public|NetClient) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB1BB0>
	char CanJumpInternal(); // Function Engine.Character.CanJumpInternal(Native|Event|Protected|BlueprintEvent|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB1B80>
	char CanJump(); // Function Engine.Character.CanJump(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB1B50>
	char CanCrouch(); // Function Engine.Character.CanCrouch(Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB1B20>
	void CacheInitialMeshOffset(struct Unknown MeshRelativeLocation, struct Unknown MeshRelativeRotation); // Function Engine.Character.CacheInitialMeshOffset(Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CB1A40>
};

// Class Engine.SplineComponent
struct USplineComponent : UPrimitiveComponent {
	struct Unknown SplineCurves; // 0x4B8 (104)
	struct Unknown SplineInfo; // 0x520 (24)
	struct Unknown SplineRotInfo; // 0x538 (24)
	struct Unknown SplineScaleInfo; // 0x550 (24)
	struct Unknown SplineReparamTable; // 0x568 (24)
	char bAllowSplineEditingPerInstance : 0; // 0x580 (1)
	int32_t ReparamStepsPerSegment; // 0x584 (4)
	float Duration; // 0x588 (4)
	char bStationaryEndpoints : 0; // 0x58C (1)
	char bSplineHasBeenEdited : 0; // 0x58D (1)
	char bModifiedByConstructionScript : 0; // 0x58E (1)
	char bInputSplinePointsToConstructionScript : 0; // 0x58F (1)
	char bDrawDebug : 0; // 0x590 (1)
	char bClosedLoop : 0; // 0x591 (1)
	char bLoopPositionOverride : 0; // 0x592 (1)
	float LoopPosition; // 0x594 (4)
	struct Unknown DefaultUpVector; // 0x598 (12)

	void UpdateSpline(); // Function Engine.SplineComponent.UpdateSpline(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E118F0>
	void SetWorldLocationAtSplinePoint(int32_t PointIndex, struct Unknown& InLocation); // Function Engine.SplineComponent.SetWorldLocationAtSplinePoint(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E11810>
	void SetUpVectorAtSplinePoint(int32_t PointIndex, struct Unknown& InUpVector, char CoordinateSpace, char bUpdateSpline); // Function Engine.SplineComponent.SetUpVectorAtSplinePoint(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E116B0>
	void SetUnselectedSplineSegmentColor(struct Unknown& SegmentColor); // Function Engine.SplineComponent.SetUnselectedSplineSegmentColor(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E10EA0>
	void SetTangentsAtSplinePoint(int32_t PointIndex, struct Unknown& InArriveTangent, struct Unknown& InLeaveTangent, char CoordinateSpace, char bUpdateSpline); // Function Engine.SplineComponent.SetTangentsAtSplinePoint(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E114F0>
	void SetTangentAtSplinePoint(int32_t PointIndex, struct Unknown& InTangent, char CoordinateSpace, char bUpdateSpline); // Function Engine.SplineComponent.SetTangentAtSplinePoint(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E11390>
	void SetSplineWorldPoints(struct TArray<Unknown>& Points); // Function Engine.SplineComponent.SetSplineWorldPoints(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E112E0>
	void SetSplinePointType(int32_t PointIndex, char Type, char bUpdateSpline); // Function Engine.SplineComponent.SetSplinePointType(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E110B0>
	void SetSplinePoints(struct TArray<Unknown>& Points, char CoordinateSpace, char bUpdateSpline); // Function Engine.SplineComponent.SetSplinePoints(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E111B0>
	void SetSplineLocalPoints(struct TArray<Unknown>& Points); // Function Engine.SplineComponent.SetSplineLocalPoints(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E11000>
	void SetSelectedSplineSegmentColor(struct Unknown& SegmentColor); // Function Engine.SplineComponent.SetSelectedSplineSegmentColor(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E10EA0>
	void SetLocationAtSplinePoint(int32_t PointIndex, struct Unknown& InLocation, char CoordinateSpace, char bUpdateSpline); // Function Engine.SplineComponent.SetLocationAtSplinePoint(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E10D40>
	void SetDrawDebug(char bShow); // Function Engine.SplineComponent.SetDrawDebug(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E10CB0>
	void SetDefaultUpVector(struct Unknown& UpVector, char CoordinateSpace); // Function Engine.SplineComponent.SetDefaultUpVector(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E10BD0>
	void SetClosedLoopAtPosition(char bInClosedLoop, float Key, char bUpdateSpline); // Function Engine.SplineComponent.SetClosedLoopAtPosition(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E10AC0>
	void SetClosedLoop(char bInClosedLoop, char bUpdateSpline); // Function Engine.SplineComponent.SetClosedLoop(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E109F0>
	void RemoveSplinePoint(int32_t Index, char bUpdateSpline); // Function Engine.SplineComponent.RemoveSplinePoint(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E10930>
	char IsClosedLoop(); // Function Engine.SplineComponent.IsClosedLoop(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E10900>
	struct Unknown GetWorldTangentAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldTangentAtDistanceAlongSpline(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E10850>
	struct Unknown GetWorldRotationAtTime(float Time, char bUseConstantVelocity); // Function Engine.SplineComponent.GetWorldRotationAtTime(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E10760>
	struct Unknown GetWorldRotationAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldRotationAtDistanceAlongSpline(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E106B0>
	struct Unknown GetWorldLocationAtTime(float Time, char bUseConstantVelocity); // Function Engine.SplineComponent.GetWorldLocationAtTime(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E105C0>
	struct Unknown GetWorldLocationAtSplinePoint(int32_t PointIndex); // Function Engine.SplineComponent.GetWorldLocationAtSplinePoint(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E10510>
	struct Unknown GetWorldLocationAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldLocationAtDistanceAlongSpline(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E10460>
	struct Unknown GetWorldDirectionAtTime(float Time, char bUseConstantVelocity); // Function Engine.SplineComponent.GetWorldDirectionAtTime(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E10370>
	struct Unknown GetWorldDirectionAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldDirectionAtDistanceAlongSpline(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E102C0>
	struct Unknown GetVectorPropertyAtSplinePint(int32_t Index, struct FName PropertyName); // Function Engine.SplineComponent.GetVectorPropertyAtSpline(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E101F0>
	struct Unknown GetVectorPropertyAtSplineInputKey(float InKey, struct FName PropertyName); // Function Engine.SplineComponent.GetVectorPropertyAtSplineInputKey(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E10110>
	struct Unknown GetUpVectorAtTime(float Time, char CoordinateSpace, char bUseConstantVelocity); // Function Engine.SplineComponent.GetUpVectorAtTime(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E0FFF0>
	struct Unknown GetUpVectorAtSplinePoint(int32_t PointIndex, char CoordinateSpace); // Function Engine.SplineComponent.GetUpVectorAtSplinePoint(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E0FF20>
	struct Unknown GetUpVectorAtSplineInputKey(float InKey, char CoordinateSpace); // Function Engine.SplineComponent.GetUpVectorAtSplineInputKey(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E0FE40>
	struct Unknown GetUpVectorAtDistanceAlongSpline(float Distance, char CoordinateSpace); // Function Engine.SplineComponent.GetUpVectorAtDistanceAlongSpline(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E0FD60>
	struct Unknown GetTransformAtTime(float Time, char CoordinateSpace, char bUseConstantVelocity, char bUseScale); // Function Engine.SplineComponent.GetTransformAtTime(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E0FBD0>
	struct Unknown GetTransformAtSplinePoint(int32_t PointIndex, char CoordinateSpace, char bUseScale); // Function Engine.SplineComponent.GetTransformAtSplinePoint(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E0FA90>
	struct Unknown GetTransformAtSplineInputKey(float InKey, char CoordinateSpace, char bUseScale); // Function Engine.SplineComponent.GetTransformAtSplineInputKey(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E0F940>
	struct Unknown GetTransformAtDistanceAlongSpline(float Distance, char CoordinateSpace, char bUseScale); // Function Engine.SplineComponent.GetTransformAtDistanceAlongSpline(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E0F7F0>
	struct Unknown GetTangentAtTime(float Time, char CoordinateSpace, char bUseConstantVelocity); // Function Engine.SplineComponent.GetTangentAtTime(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E0F6D0>
	struct Unknown GetTangentAtSplinePoint(int32_t PointIndex, char CoordinateSpace); // Function Engine.SplineComponent.GetTangentAtSplinePoint(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E0DEB0>
	struct Unknown GetTangentAtSplineInputKey(float InKey, char CoordinateSpace); // Function Engine.SplineComponent.GetTangentAtSplineInputKey(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3E0F5F0>
