// WidgetBlueprintGeneratedClass GamePlayWidget.GamePlayWidget_C
struct UGamePlayWidget_C : UBravoHotelSettingSubWidget {
	Unknown UberGraphFrame; //  0x298 Size(8)
	Unknown AmmoEffect; //  0x2a0 Size(8)
	Unknown AR; //  0x2a8 Size(8)
	Unknown AutoLadder; //  0x2b0 Size(8)
	Unknown autoReload; //  0x2b8 Size(8)
	Unknown AutoUseMedicalLv1; //  0x2c0 Size(8)
	Unknown AutoUseMedicalLv2; //  0x2c8 Size(8)
	Unknown AutoUseMedicalLv3; //  0x2d0 Size(8)
	Unknown BlueBoostEffect; //  0x2d8 Size(8)
	Unknown CrossHair; //  0x2e0 Size(8)
	Unknown CustsomUseItem; //  0x2e8 Size(8)
	Unknown DMR; //  0x2f0 Size(8)
	Unknown GreenBoostEffect; //  0x2f8 Size(8)
	Unknown ImmediateAttachment; //  0x300 Size(8)
	Unknown InheritAttachment; //  0x308 Size(8)
	Unknown MedicalLv1Effect; //  0x310 Size(8)
	Unknown MedicalLv2Effect; //  0x318 Size(8)
	Unknown MedicalLv3Effect; //  0x320 Size(8)
	Unknown NetworkDebug; //  0x328 Size(8)
	Unknown Pistol; //  0x330 Size(8)
	Unknown RedBoostEffect; //  0x338 Size(8)
	Unknown ScrollBox_55; //  0x340 Size(8)
	Unknown SearchExpertWeaponMaterialItem; //  0x348 Size(8)
	Unknown SearchMaterialItem; //  0x350 Size(8)
	Unknown ShowAircraftUI; //  0x358 Size(8)
	Unknown ShowGuideWidget; //  0x360 Size(8)
	Unknown ShowPerkSlot; //  0x368 Size(8)
	Unknown ShowSmartPing; //  0x370 Size(8)
	Unknown ShowSmartPingLightPole; //  0x378 Size(8)
	Unknown ShowSmartPingSupplyBox; //  0x380 Size(8)
	Unknown ShowUseaableItemEffect; //  0x388 Size(8)
	Unknown SMG; //  0x390 Size(8)
	Unknown SR; //  0x398 Size(8)
	Unknown Tutorial; //  0x3a0 Size(8)
	Unknown Tutorial_RePlay; //  0x3a8 Size(8)
	Unknown UseItem1; //  0x3b0 Size(8)
	Unknown UseItem2; //  0x3b8 Size(8)
	Unknown UseItem3; //  0x3c0 Size(8)
	Unknown UseItem4; //  0x3c8 Size(8)
	Unknown UseItem5; //  0x3d0 Size(8)
	Unknown UseItem6; //  0x3d8 Size(8)
	Unknown UseItem7; //  0x3e0 Size(8)
	Unknown UseItem8; //  0x3e8 Size(8)
	Unknown VerticalBox_154; //  0x3f0 Size(8)
	Unknown ; //  0x3f8 Size(8)
	Unknown ; //  0x400 Size(8)
	Unknown ; //  0x408 Size(8)
	Unknown ScrollBarTimer; //  0x410 Size(8)

	void _1(Unknown Type); // Function GamePlayWidget.GamePlayWidget_C._1(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

