// WidgetBlueprintGeneratedClass GamePlayWidget.GamePlayWidget_C
class UGamePlayWidget_C : public UBravoHotelSettingSubWidget {

public:

	struct Unknown UberGraphFrame; // 0x298 (8)
	struct Unknown AmmoEffect; // 0x2A0 (8)
	struct Unknown AR; // 0x2A8 (8)
	struct Unknown AutoLadder; // 0x2B0 (8)
	struct Unknown autoReload; // 0x2B8 (8)
	struct Unknown AutoUseMedicalLv1; // 0x2C0 (8)
	struct Unknown AutoUseMedicalLv2; // 0x2C8 (8)
	struct Unknown AutoUseMedicalLv3; // 0x2D0 (8)
	struct Unknown BlueBoostEffect; // 0x2D8 (8)
	struct Unknown CrossHair; // 0x2E0 (8)
	struct Unknown CustsomUseItem; // 0x2E8 (8)
	struct Unknown DMR; // 0x2F0 (8)
	struct Unknown GreenBoostEffect; // 0x2F8 (8)
	struct Unknown ImmediateAttachment; // 0x300 (8)
	struct Unknown InheritAttachment; // 0x308 (8)
	struct Unknown MedicalLv1Effect; // 0x310 (8)
	struct Unknown MedicalLv2Effect; // 0x318 (8)
	struct Unknown MedicalLv3Effect; // 0x320 (8)
	struct Unknown NetworkDebug; // 0x328 (8)
	struct Unknown Pistol; // 0x330 (8)
	struct Unknown RedBoostEffect; // 0x338 (8)
	struct Unknown ScrollBox_55; // 0x340 (8)
	struct Unknown SearchExpertWeaponMaterialItem; // 0x348 (8)
	struct Unknown SearchMaterialItem; // 0x350 (8)
	struct Unknown ShowAircraftUI; // 0x358 (8)
	struct Unknown ShowGuideWidget; // 0x360 (8)
	struct Unknown ShowPerkSlot; // 0x368 (8)
	struct Unknown ShowSmartPing; // 0x370 (8)
	struct Unknown ShowSmartPingLightPole; // 0x378 (8)
	struct Unknown ShowSmartPingSupplyBox; // 0x380 (8)
	struct Unknown ShowUseaableItemEffect; // 0x388 (8)
	struct Unknown SMG; // 0x390 (8)
	struct Unknown SR; // 0x398 (8)
	struct Unknown Tutorial; // 0x3A0 (8)
	struct Unknown Tutorial_RePlay; // 0x3A8 (8)
	struct Unknown UseItem1; // 0x3B0 (8)
	struct Unknown UseItem2; // 0x3B8 (8)
	struct Unknown UseItem3; // 0x3C0 (8)
	struct Unknown UseItem4; // 0x3C8 (8)
	struct Unknown UseItem5; // 0x3D0 (8)
	struct Unknown UseItem6; // 0x3D8 (8)
	struct Unknown UseItem7; // 0x3E0 (8)
	struct Unknown UseItem8; // 0x3E8 (8)
	struct Unknown VerticalBox_154; // 0x3F0 (8)
	struct Unknown ; // 0x3F8 (8)
	struct Unknown ; // 0x400 (8)
	struct Unknown ; // 0x408 (8)
	struct Unknown ScrollBarTimer; // 0x410 (8)

	void (enum class Unknow Type); // Function GamePlayWidget.GamePlayWidget_C.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DelegateChangeValue_Event_1(struct Unknown Value); // Function GamePlayWidget.GamePlayWidget_C.DelegateChangeValue_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function GamePlayWidget.GamePlayWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ScrollBox_54_K2Node_Com(float CurrentOffset); // Function GamePlayWidget.GamePlayWidget_C.BndEvt__ScrollBox_54_K2Node_Com(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent(); // Function GamePlayWidget.GamePlayWidget_C.CustomEvent(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_GamePlayWidget(int32_t EntryPoint); // Function GamePlayWidget.GamePlayWidget_C.ExecuteUbergraph_GamePlayWidget(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

