// WidgetBlueprintGeneratedClass GamePlayWidget.GamePlayWidget_C
class UGamePlayWidget_C : public UBravoHotelSettingSubWidget {

public:

	struct Unknown UberGraphFrame; // 0x298 (8)
	struct Unknown AmmoEffect; // 0x2A0 (8)
	struct Unknown AR; // 0x2A8 (8)
	struct Unknown AutoLadder; // 0x2B0 (8)
	struct Unknown autoReload; // 0x2B8 (8)
	struct Unknown AutoUseMedicalLv1; // 0x2C0 (8)
	struct Unknown AutoUseMedicalLv2; // 0x2C8 (8)
	struct Unknown AutoUseMedicalLv3; // 0x2D0 (8)
	struct Unknown BlueBoostEffect; // 0x2D8 (8)
	struct Unknown CrossHair; // 0x2E0 (8)
	struct Unknown CustsomUseItem; // 0x2E8 (8)
	struct Unknown DMR; // 0x2F0 (8)
	struct Unknown GreenBoostEffect; // 0x2F8 (8)
	struct Unknown ImmediateAttachment; // 0x300 (8)
	struct Unknown InheritAttachment; // 0x308 (8)
	struct Unknown inventory; // 0x310 (8)
	struct Unknown InventoryOrder; // 0x318 (8)
	struct Unknown MedicalLv1Effect; // 0x320 (8)
	struct Unknown MedicalLv2Effect; // 0x328 (8)
	struct Unknown MedicalLv3Effect; // 0x330 (8)
	struct Unknown NetworkDebug; // 0x338 (8)
	struct Unknown Pistol; // 0x340 (8)
	struct Unknown RedBoostEffect; // 0x348 (8)
	struct Unknown ScrollBox_55; // 0x350 (8)
	struct Unknown SearchExpertWeaponMaterialItem; // 0x358 (8)
	struct Unknown SearchMaterialItem; // 0x360 (8)
	struct Unknown ShowDamageLog; // 0x368 (8)
	struct Unknown ShowGuideWidget; // 0x370 (8)
	struct Unknown ShowPerkSlot; // 0x378 (8)
	struct Unknown ShowSmartPing; // 0x380 (8)
	struct Unknown ShowSmartPingLightPole; // 0x388 (8)
	struct Unknown ShowSmartPingSupplyBox; // 0x390 (8)
	struct Unknown ShowUseaableItemEffect; // 0x398 (8)
	struct Unknown SMG; // 0x3A0 (8)
	struct Unknown SR; // 0x3A8 (8)
	struct Unknown Tutorial; // 0x3B0 (8)
	struct Unknown Tutorial_RePlay; // 0x3B8 (8)
	struct Unknown UseItem1; // 0x3C0 (8)
	struct Unknown UseItem2; // 0x3C8 (8)
	struct Unknown UseItem3; // 0x3D0 (8)
	struct Unknown UseItem4; // 0x3D8 (8)
	struct Unknown UseItem5; // 0x3E0 (8)
	struct Unknown UseItem6; // 0x3E8 (8)
	struct Unknown UseItem7; // 0x3F0 (8)
	struct Unknown UseItem8; // 0x3F8 (8)
	struct Unknown VerticalBox_154; // 0x400 (8)
	struct Unknown ¬©¨Ü; // 0x408 (8)
	struct Unknown xŒ„; // 0x410 (8)
	struct Unknown œ ¬¼; // 0x418 (8)
	struct Unknown ScrollBarTimer; // 0x420 (8)

	void ä¤@t¤¸_1(enum class Unknow Type); // Function GamePlayWidget.GamePlayWidget_C.ä¤@t¤¸_1(BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	void DelegateChangeValue_Event_1(struct Unknown Value); // Function GamePlayWidget.GamePlayWidget_C.DelegateChangeValue_Event_1(BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	void Construct(); // Function GamePlayWidget.GamePlayWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	void BndEvt__ScrollBox_54_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature(float CurrentOffset); // Function GamePlayWidget.GamePlayWidget_C.BndEvt__ScrollBox_54_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature(BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	void CustomEvent(); // Function GamePlayWidget.GamePlayWidget_C.CustomEvent(BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	void ExecuteUbergraph_GamePlayWidget(int32_t EntryPoint); // Function GamePlayWidget.GamePlayWidget_C.ExecuteUbergraph_GamePlayWidget(Final|UbergraphFunction|HasDefaults) // <Game_BE.exe+0x2B812B0>
};

// Function GamePlayWidget.GamePlayWidget_C.ä¤@t¤¸_1
inline void UGamePlayWidget_C::ä¤@t¤¸_1(enum class Unknow Type) {
	static auto fn = UObject::FindObject<UFunction>("Function GamePlayWidget.GamePlayWidget_C.ä¤@t¤¸_1");

	struct ä¤@t¤¸_1_Params {
		enum class Unknow Type;
	}; ä¤@t¤¸_1_Params Params;

	Params.Type = Type;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function GamePlayWidget.GamePlayWidget_C.DelegateChangeValue_Event_1
inline void UGamePlayWidget_C::DelegateChangeValue_Event_1(struct Unknown Value) {
	static auto fn = UObject::FindObject<UFunction>("Function GamePlayWidget.GamePlayWidget_C.DelegateChangeValue_Event_1");

	struct DelegateChangeValue_Event_1_Params {
		struct Unknown Value;
	}; DelegateChangeValue_Event_1_Params Params;

	Params.Value = Value;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function GamePlayWidget.GamePlayWidget_C.Construct
inline void UGamePlayWidget_C::Construct() {
	static auto fn = UObject::FindObject<UFunction>("Function GamePlayWidget.GamePlayWidget_C.Construct");

	struct Construct_Params {
		
	}; Construct_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function GamePlayWidget.GamePlayWidget_C.BndEvt__ScrollBox_54_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature
inline void UGamePlayWidget_C::BndEvt__ScrollBox_54_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature(float CurrentOffset) {
	static auto fn = UObject::FindObject<UFunction>("Function GamePlayWidget.GamePlayWidget_C.BndEvt__ScrollBox_54_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature");

	struct BndEvt__ScrollBox_54_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature_Params {
		float CurrentOffset;
	}; BndEvt__ScrollBox_54_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature_Params Params;

	Params.CurrentOffset = CurrentOffset;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function GamePlayWidget.GamePlayWidget_C.CustomEvent
inline void UGamePlayWidget_C::CustomEvent() {
	static auto fn = UObject::FindObject<UFunction>("Function GamePlayWidget.GamePlayWidget_C.CustomEvent");

	struct CustomEvent_Params {
		
	}; CustomEvent_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function GamePlayWidget.GamePlayWidget_C.ExecuteUbergraph_GamePlayWidget
inline void UGamePlayWidget_C::ExecuteUbergraph_GamePlayWidget(int32_t EntryPoint) {
	static auto fn = UObject::FindObject<UFunction>("Function GamePlayWidget.GamePlayWidget_C.ExecuteUbergraph_GamePlayWidget");

	struct ExecuteUbergraph_GamePlayWidget_Params {
		int32_t EntryPoint;
	}; ExecuteUbergraph_GamePlayWidget_Params Params;

	Params.EntryPoint = EntryPoint;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

