// WidgetBlueprintGeneratedClass GraphicWidget.GraphicWidget_C
struct UGraphicWidget_C : UBravoHotelSettingSubWidget {
	struct Unknown UberGraphFrame; //  0x298 Size(8)
	struct Unknown Anti; //  0x2a0 Size(8)
	struct Unknown display; //  0x2a8 Size(8)
	struct Unknown DisplayMode; //  0x2b0 Size(8)
	struct Unknown DLSS; //  0x2b8 Size(8)
	struct Unknown DOF; //  0x2c0 Size(8)
	struct Unknown Effect; //  0x2c8 Size(8)
	struct Unknown Foliage; //  0x2d0 Size(8)
	struct Unknown FOV; //  0x2d8 Size(8)
	struct Unknown FSR; //  0x2e0 Size(8)
	struct Unknown LanguageSetting; //  0x2e8 Size(8)
	struct Unknown MaxFrameRate; //  0x2f0 Size(8)
	struct Unknown MaxLobbyFrameRate; //  0x2f8 Size(8)
	struct Unknown PP; //  0x300 Size(8)
	struct Unknown Reflex; //  0x308 Size(8)
	struct Unknown Resolution; //  0x310 Size(8)
	struct Unknown ResolutionScaling; //  0x318 Size(8)
	struct Unknown ScrollBox_55; //  0x320 Size(8)
	struct Unknown Shading; //  0x328 Size(8)
	struct Unknown Shadow; //  0x330 Size(8)
	struct Unknown Sharpen; //  0x338 Size(8)
	struct Unknown SlotItemWidget_C_1; //  0x340 Size(8)
	struct Unknown Smooth; //  0x348 Size(8)
	struct Unknown SubTitleSlotWidget; //  0x350 Size(8)
	struct Unknown Texture; //  0x358 Size(8)
	struct Unknown v; //  0x360 Size(8)
	struct Unknown View; //  0x368 Size(8)
	struct Unknown ; //  0x370 Size(8)
	struct Unknown ; //  0x378 Size(8)
	float OldDisplayModeValue; //  0x380 Size(4)
	float OldDisplayResolutionValue; //  0x384 Size(4)
	struct Unknown ScrollBarTimer; //  0x388 Size(8)

	void CustomEvent_1(struct Unknown Value); // Function GraphicWidget.GraphicWidget_C.CustomEvent_1(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

