// BlueprintGeneratedClass Items.B
struct AB : ABHPersonalSupplyBox {
	struct Unknown UberGraphFrame; //  0x378 Size(8)
	struct Unknown StaticMeshUnassigned; //  0x380 Size(8)
	struct Unknown StaticMeshAssigned; //  0x388 Size(8)
	float LandingTimer; //  0x390 Size(4)
	char bLanding; //  0x394 Size(1)
	struct TArray<Unknown> ItemResult; //  0x398 Size(10)
	float ParachuteTimer; //  0x3a8 Size(4)
	float VisibleValue; //  0x3ac Size(4)
	char VisibleAnimationState; //  0x3b0 Size(1)

	void ReceiveTick(float DeltaSeconds); // Function Items.B.ReceiveTick(Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

