// BlueprintGeneratedClass Items.B
struct AB : ABravoHotelBootyBoxActor {
	struct Unknown StaticMesh; //  0x3b8 Size(8)
};

// BlueprintGeneratedClass Items.B
struct AB : ABravoHotelTransportDropBoxActor {
	struct Unknown UberGraphFrame; //  0x4a0 Size(8)
	float OverWater_CV_OverWater_77012AB948B572A268E635834; //  0x4a8 Size(4)
	char OverWater__Direction_77012AB948B572A268E63583418444D0; //  0x4ac Size(1)
	struct Unknown OverWater; //  0x4b0 Size(8)
	float HittingWater_CV_OverWater_7E5F9D2E4D0DDDC70F2F67AD035A6212; //  0x4b8 Size(4)
	char HittingWater__Direction_7E5F9D2E4D0DDDC70F2F67AD035A6212; //  0x4bc Size(1)
	struct Unknown HittingWater; //  0x4c0 Size(8)
	float LandingTimer; //  0x4c8 Size(4)
	struct TArray<Unknown> ItemResult; //  0x4d0 Size(10)
	float ParachuteTimer; //  0x4e0 Size(4)
	float LandingDelay; //  0x4e4 Size(4)
	float ForceLanding; //  0x4e8 Size(4)
	char bLandedOnGround; //  0x4ec Size(1)

	void UserConstructionScript(); // Function Items.B.UserConstructionScript(Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass Items_.B
struct AB : ABravoHotelBrokenEquipment {
	struct Unknown UberGraphFrame; //  0x330 Size(8)
	float Power_Min; //  0x338 Size(4)
	float Power_Max; //  0x33c Size(4)
	float FlyAngle; //  0x340 Size(4)

	void ReceiveBeginPlay(); // Function Items.B.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <Game+0x23b1e70>
};

