// WidgetBlueprintGeneratedClass KeyImageWidget.KeyImageWidget_C
struct UKeyImageWidget_C : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Alt; //  0x250 Size(8)
	Unknown Alt; //  0x258 Size(8)
	Unknown Ctrl; //  0x260 Size(8)
	Unknown Ctrl; //  0x268 Size(8)
	Unknown HorizontalBox_169; //  0x270 Size(8)
	Unknown Key; //  0x278 Size(8)
	Unknown ScaleBox_1; //  0x280 Size(8)
	Unknown Shift; //  0x288 Size(8)
	Unknown Shift; //  0x290 Size(8)
	Unknown Horizontal; //  0x298 Size(1)
	Unknown vertical; //  0x299 Size(1)
	char UsingAlphaBg; //  0x29a Size(1)
	Unknown PreKeyType; //  0x29b Size(1)
	Unknown PreKeyMappingData; //  0x2a0 Size(28)
	char UsingKeyMappingData; //  0x2c8 Size(1)
	float DefaultScale; //  0x2cc Size(4)
	char OverrideFontSize; //  0x2d0 Size(1)
	int32_t FontSize; //  0x2d4 Size(4)

	void SetFontSize(char Override); // Function KeyImageWidget.KeyImageWidget_C.SetFontSize(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

