// WidgetBlueprintGeneratedClass KeyWidget.KeyWidget_C
struct UKeyWidget_C : UBravoHotelSettingSubWidget {
	struct Unknown UberGraphFrame; //  0x298 Size(8)
	struct Unknown ButtomButtonWidget; //  0x2a0 Size(8)
	struct Unknown Image_154; //  0x2a8 Size(8)
	struct Unknown Overlay_1; //  0x2b0 Size(8)
	struct Unknown ScrollBox_55; //  0x2b8 Size(8)
	struct Unknown UniformGridPanel_119; //  0x2c0 Size(8)
	enum class Unknow Begin; //  0x2c8 Size(1)
	enum class Unknow End; //  0x2c9 Size(1)
	enum class Unknow PreSubType; //  0x2ca Size(1)
	struct FMulticastInlineDelegate EventDispatcher_KeyNotiMess; //  0x2d0 Size(10)
	struct Unknown ScrollBarTimer; //  0x2e0 Size(8)
	struct TMap<{}, {}>Unknown List; //  0x2e8 Size(50)
	struct TArray<Unknown> SubTypeSort; //  0x338 Size(10)
	int32_t TempCount; //  0x348 Size(4)
	struct TMap<{}, {}>Unknown Hot; //  0x350 Size(50)
	float Size; //  0x3a0 Size(4)
	struct TMap<{}, {}>Unknown Offset; //  0x3a8 Size(50)

	void EnableShowReplayType(char& bRet); // Function KeyWidget.KeyWidget_C.EnableShowReplayType(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

