// WidgetBlueprintGeneratedClass KeyWidget.KeyWidget_C
struct UKeyWidget_C : UBravoHotelSettingSubWidget {
	Unknown UberGraphFrame; //  0x298 Size(8)
	Unknown ButtomButtonWidget; //  0x2a0 Size(8)
	Unknown Image_154; //  0x2a8 Size(8)
	Unknown Overlay_1; //  0x2b0 Size(8)
	Unknown ScrollBox_55; //  0x2b8 Size(8)
	Unknown UniformGridPanel_119; //  0x2c0 Size(8)
	Unknown Begin; //  0x2c8 Size(1)
	Unknown End; //  0x2c9 Size(1)
	Unknown PreSubType; //  0x2ca Size(1)
	struct FMulticastInlineDelegate EventDispatcher_KeyNotiMessage; //  0x2d0 Size(10)
	Unknown ScrollBarTimer; //  0x2e0 Size(8)
	Unknown List; //  0x2e8 Size(50)
	Unknown SubTypeSort; //  0x338 Size(10)
	int32_t TempCount; //  0x348 Size(4)
	Unknown Hot; //  0x350 Size(50)
	float Size; //  0x3a0 Size(4)
	Unknown Offset; //  0x3a8 Size(50)

	void Enab(char& bRet); // Function KeyWidget.KeyWidget_C.Enab(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

