// BlueprintGeneratedClass L.L
class AL : ALevelScriptActor {
	struct Unknown UberGraphFrame; // 0x318 (8)
	struct Unknown TitleWidgetRef; // 0x320 (8)
	struct Unknown LobbyWidgetRef; // 0x328 (8)
	struct TArray<Unknown> LobbyPawns; // 0x330 (16)
	struct TSoftClassPtr<UObject> LobbyPawnClass; // 0x340 (40)
	struct Unknown SkipKey; // 0x368 (24)
	char bSkip : 0; // 0x380 (1)
	char bNotFirstTime : 0; // 0x381 (1)
	struct Unknown LobbyCustomizePawn; // 0x388 (8)
	char IsCharacterAppearance : 0; // 0x390 (1)
	struct Unknown TargetWearableCamera; // 0x398 (8)
	struct FString CurrentArmorySceneState; // 0x3A0 (16)
	float SurveyUPanValue; // 0x3B0 (4)
	float GunSurveyMovingValue; // 0x3B4 (4)
	struct Unknown SurveyUPan; // 0x3B8 (8)
	struct Unknown GunSurveyMoving; // 0x3C0 (8)
	struct Unknown IdentifiedTimer; // 0x3C8 (8)
	struct FString CurrentTab; // 0x3D0 (16)
	struct Unknown P; // 0x3E0 (8)
	struct Unknown AudioIndex_BGM; // 0x3E8 (4)
	struct Unknown AudioIndex_Ambience; // 0x3EC (4)
	struct Unknown AudioIndex_Analyze; // 0x3F0 (4)
	char PendingPartyInfoChange : 0; // 0x3F4 (1)
	struct Unknown EnhanceTimerHandle; // 0x3F8 (8)
	struct Unknown ProceedingTimerHandle; // 0x400 (8)
	struct Unknown CreateCharacterRef; // 0x408 (8)
	struct Unknown IntroBGWidget; // 0x410 (8)
	struct Unknown MediaSoundComponent; // 0x418 (8)
	char bPlaySoloSequencePlayer : 0; // 0x420 (1)
	struct FString CurrentArmoryTab; // 0x428 (16)
	struct Unknown LoginWidget; // 0x438 (8)
	char bFinished_SequencePlayer_Endgame : 0; // 0x440 (1)
	struct Unknown ANI; // 0x448 (8)
	struct Unknown ANI; // 0x450 (8)
	struct Unknown ANI; // 0x458 (8)
	struct Unknown ANI; // 0x460 (8)
	struct Unknown S; // 0x468 (8)
	struct Unknown Title_TowerBridge_Squard_5_Exec; // 0x470 (8)
	struct Unknown S; // 0x478 (8)
	struct Unknown Ak; // 0x480 (8)
	struct Unknown Title_TowerBridge_Endgame_2_ExecuteUbergraph_L; // 0x488 (8)
	struct Unknown Title_TowerBridge_Readyshot_2_ExecuteUbergraph_L; // 0x490 (8)
	struct Unknown Character_Creation_2_ExecuteUbergraph_L; // 0x498 (8)
	struct Unknown ExponentialHeightFog3_ExecuteUbergraph_L; // 0x4A0 (8)
	struct Unknown ExponentialHeightFog_1_ExecuteUbergraph_L; // 0x4A8 (8)
	struct Unknown CineCameraActor_1_ExecuteUbergraph_L; // 0x4B0 (8)
	struct Unknown CineCamera_Supplybox_ExecuteUbergraph_L; // 0x4B8 (8)
	struct Unknown CineCamera_All_ExecuteUbergraph_L; // 0x4C0 (8)
	struct Unknown Character_Customization_Face_3_ExecuteUbergraph_L; // 0x4C8 (8)
	struct Unknown Supplybox_Lobby_4_ExecuteUbergraph_L; // 0x4D0 (8)
	struct Unknown Supplybox_Lobby_3_ExecuteUbergraph_L; // 0x4D8 (8)
	struct Unknown CineCamera_Target_ExecuteUbergraph_L; // 0x4E0 (8)
	struct Unknown CineCamera_Rank_ExecuteUbergraph_L; // 0x4E8 (8)
	struct Unknown Title_Rank_2_ExecuteUbergraph_L; // 0x4F0 (8)
	struct Unknown Gun_Survey_Plane_ExecuteUbergraph_L; // 0x4F8 (8)
	struct Unknown Weapon_Lobby_01_2_ExecuteUbergraph_L; // 0x500 (8)
	struct Unknown CineCamera_Face3_ExecuteUbergraph_L; // 0x508 (8)
	struct Unknown Screen_Transition_ExecuteUbergraph_L; // 0x510 (8)
	struct Unknown Character_Fade_2_ExecuteUbergraph_L; // 0x518 (8)
	struct Unknown P; // 0x520 (8)
	struct Unknown P; // 0x528 (8)
	struct Unknown P; // 0x530 (8)
	struct Unknown P; // 0x538 (8)
	struct Unknown P; // 0x540 (8)
	struct Unknown P; // 0x548 (8)
	struct Unknown P; // 0x550 (8)
	struct Unknown P; // 0x558 (8)
	struct Unknown Weapon_Lobby_Disassemble_ExecuteUbergraph_L; // 0x560 (8)
	struct Unknown Weapon_Lobby_Repair_ExecuteUbergraph_L; // 0x568 (8)
	struct Unknown CineCamera_Weapon_Customization02_ExecuteUbergraph_L; // 0x570 (8)
	struct Unknown CineCamera_Weapon_Customization_2_ExecuteUbergraph_L; // 0x578 (8)
	struct Unknown Weapon_Lobby_Custom_ExecuteUbergraph_L; // 0x580 (8)
	struct Unknown S; // 0x588 (8)
	struct Unknown CineCameraActor_1_EdGraph_4_RefProperty; // 0x590 (8)
	struct Unknown Gun_Survey_Plane_EdGraph_11_RefProperty; // 0x598 (8)
	struct Unknown Gun_Survey_Plane_EdGraph_12_RefProperty; // 0x5A0 (8)
	struct Unknown Gun_Survey_Plane_EdGraph_13_RefProperty; // 0x5A8 (8)
	struct Unknown PostProcessVolume2_EdGraph_14_RefProperty; // 0x5B0 (8)
	struct Unknown PostProcessVolume2_EdGraph_15_RefProperty; // 0x5B8 (8)
	struct Unknown Supplybox_Lobby_4_EdGraph_16_RefProperty; // 0x5C0 (8)
	struct Unknown Title_Rank_2_EdGraph_16_RefProperty; // 0x5C8 (8)
	struct Unknown Character_Customization_Face_3_EdGraph_16_RefProperty; // 0x5D0 (8)
	struct Unknown Supplybox_Lobby_3_EdGraph_16_RefProperty; // 0x5D8 (8)
	struct Unknown Plane_3_EdGraph_27_RefProperty; // 0x5E0 (8)
	struct Unknown Plane_2_EdGraph_27_RefProperty; // 0x5E8 (8)
	struct Unknown Plane_4_EdGraph_27_RefProperty; // 0x5F0 (8)

	void SetSequecePanelColor(int32_t WeaponRarity); // Function L.L.SetSequecePanelColor(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ChangeMenu(struct FString Menu); // Function L.L.ChangeMenu(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetTutorial(); // Function L.L.SetTutorial(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void PlayLobbySound(); // Function L.L.PlayLobbySound(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void UpdatePartyInfo(); // Function L.L.UpdatePartyInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void GetGammaSettings(struct Unknown& GammaWidget); // Function L.L.GetGammaSettings(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void GetTitleWdiget(struct Unknown& HUD); // Function L.L.GetTitleWdiget(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void StopArmoryAnalyzeSound(); // Function L.L.StopArmoryAnalyzeSound(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void PlayArmoryAnalyzeSound(); // Function L.L.PlayArmoryAnalyzeSound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void StopArmoryAmbienceSound(); // Function L.L.StopArmoryAmbienceSound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void PlayArmoryAmbienceSound(); // Function L.L.PlayArmoryAmbienceSound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void StopSequence(); // Function L.L.StopSequence(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetOutlineGlow(float Value); // Function L.L.SetOutlineGlow(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void InitPostProcess(); // Function L.L.InitPostProcess(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void FinishIdentified(); // Function L.L.FinishIdentified(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ResetIdentified(); // Function L.L.ResetIdentified(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void UpdateIdentifiedEffect(float DeltaTime); // Function L.L.UpdateIdentifiedEffect(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SequencePlay(struct Unknown Sequence, int32_t StartFrame, int32_t Duration); // Function L.L.SequencePlay(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void StopLobbySound(); // Function L.L.StopLobbySound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void PlayMoveLobbySound(); // Function L.L.PlayMoveLobbySound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void PlayAmbienceSound(); // Function L.L.PlayAmbienceSound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void PlayBGM(); // Function L.L.PlayBGM(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ShowLobbyWidget(char IsConnectedLoginServer); // Function L.L.ShowLobbyWidget(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetCamera(char bLogin); // Function L.L.SetCamera(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void LoadSavedData(); // Function L.L.LoadSavedData(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SaveUserData(); // Function L.L.SaveUserData(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetTitleWidget(); // Function L.L.SetTitleWidget(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void InitData(); // Function L.L.InitData(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BindPartyEvent(); // Function L.L.BindPartyEvent(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnPartyInfoChanged(struct Unknown& PartyInfo); // Function L.L.OnPartyInfoChanged(HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetPartyView(char bIsParty); // Function L.L.SetPartyView(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BindPartyInfo(); // Function L.L.BindPartyInfo(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void CustomEvent_5(); // Function L.L.CustomEvent_5(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnMatchingSucceeded(); // Function L.L.OnMatchingSucceeded(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BindLoginProcess(); // Function L.L.BindLoginProcess(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnTriedToLogin(struct FName UserName, struct FString Password); // Function L.L.OnTriedToLogin(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetLobbyAkComponent(); // Function L.L.SetLobbyAkComponent(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void InitFlow(char IsConnectedLoginServer); // Function L.L.InitFlow(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MoveSceneNotice(); // Function L.L.MoveSceneNotice(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MoveSceneGammaSettings(); // Function L.L.MoveSceneGammaSettings(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MoveSceneCompanyLogo(); // Function L.L.MoveSceneCompanyLogo(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MoveSceneSupportProgram(); // Function L.L.MoveSceneSupportProgram(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MoveSceneLogin(); // Function L.L.MoveSceneLogin(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MoveSceneOpeningMov(); // Function L.L.MoveSceneOpeningMove_(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MoveSceneTermsConditions(); // Function L.L.MoveSceneTermsConditions(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MoveSceneCreateCharacter(); // Function L.L.MoveSceneCreateCharacter(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MoveSceneTutorialMovie(); // Function L.L.MoveSceneTutorialMovie(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ChangedSceneDelegate_Event_1(enum class Unknow SceneType); // Function L.L.ChangedSceneDelegate_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void CustomEvent_13(); // Function L.L.CustomEvent_13(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ChangedLoginDelegate_Event_1(enum class Unknow LoginFlow); // Function L.L.ChangedLoginDelegate_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MoveLoginFlowServicePlatform(); // Function L.L.MoveLoginFlowServicePlatform(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MoveSceneLobby(); // Function L.L.MoveSceneLobby(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void CustomEvent_15(); // Function L.L.CustomEvent_15(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MoveLoginFlowWaitingTicket(); // Function L.L.MoveLoginFlowWaitingTicket(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MoveNextScene(); // Function L.L.MoveNextScene(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void CustomEvent_16(); // Function L.L.CustomEvent_16(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MoveSceneStartScenarioMode(); // Function L.L.MoveSceneStartScenarioMode(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MoveScenePlayTutorial(); // Function L.L.MoveScenePlayTutorial(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnFinished_Event_3(); // Function L.L.OnFinished_Event_3(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Event(); // Function L.L.Event(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Event(); // Function L.L.Event(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Event(); // Function L.L.Event(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Event(); // Function L.L.Event(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Event(); // Function L.L.Event(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnFinished_Event_1(); // Function L.L.OnFinished_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnFinished_Event_2(); // Function L.L.OnFinished_Event_2(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Event(); // Function L.L.Event(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void CustomEvent_2(); // Function L.L.CustomEvent_2(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Event(); // Function L.L.Event(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BindLobbyCharacterMenu(); // Function L.L.BindLobbyCharacterMenu(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EventMoveLobbyCharacterWearable(struct FString WearableMenu); // Function L.L.EventMoveLobbyCharacterWearable(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EventMoveLobbyCharacterAppearance(); // Function L.L.EventMoveLobbyCharacterAppearance(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EventChangeTab(struct FString TabName); // Function L.L.EventChangeTab(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Event_Enhance(); // Function L.L.Event_Enhance(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Event_Proceeding(); // Function L.L.Event_Proceeding(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Event_EnhanceResult(); // Function L.L.Event_EnhanceResult(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EventChangeArmmyScene(struct FString SceneName); // Function L.L.EventChangeArmmyScene(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Event_ArmoryEx(); // Function L.L.Event_ArmoryEx(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void CustomEvent_1(); // Function L.L.CustomEvent_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void EventSeasonChangedSubTab(struct FString TabName); // Function L.L.EventSeasonChangedSubTab(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void CustomEvent_4(); // Function L.L.CustomEvent_4(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ArmoryUI(); // Function L.L.ArmoryUI(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void CustomEvent_6(); // Function L.L.CustomEvent_6(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void CustomEvent_8(struct FString Menu); // Function L.L.CustomEvent_8(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void CustomEvent_7(); // Function L.L.CustomEvent_7(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void CustomEvent_9(struct FString TabName); // Function L.L.CustomEvent_9(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ApplyChangeTab(); // Function L.L.ApplyChangeTab(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void CustomEvent_11(struct FString TabName); // Function L.L.CustomEvent_11(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void CustomEvent_12(struct FString SceneName); // Function L.L.CustomEvent_12(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void CustomEvent_10(struct FString Menu); // Function L.L.CustomEvent_10(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MoveLobbyCharacterAppearanceDelegate_Event_1(); // Function L.L.MoveLobbyCharacterAppearanceDelegate_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MoveCreateCharacterAppearance(); // Function L.L.MoveCreateCharacterAppearance(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void MoveCreateCharacterWearable(); // Function L.L.MoveCreateCharacterWearable(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void OnChangedArmoryTab(struct FString TabName); // Function L.L.OnChangedArmoryTab(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Event_Craft(); // Function L.L.Event_Craft(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void CustomEvent(); // Function L.L.CustomEvent(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void Event_CraftResult(); // Function L.L.Event_CraftResult(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetCurrentArmoryCamera(); // Function L.L.SetCurrentArmoryCamera(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void SetArmorySequenceCamera(); // Function L.L.SetArmorySequenceCamera(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void InitArmoryTab(); // Function L.L.InitArmoryTab(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveBeginPlay(); // Function L.L.ReceiveBeginPlay(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveTick(float DeltaSeconds); // Function L.L.ReceiveTick(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveDestroyed(); // Function L.L.ReceiveDestroyed(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ReceiveEndPlay(char EndPlayReason); // Function L.L.ReceiveEndPlay(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ExecuteUbergraph_L(int32_t EntryPoint); // Function L.L.ExecuteUbergraph_L(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

