// BlueprintGeneratedClass L.L
struct AL : ALevelScriptActor {
	struct Unknown UberGraphFrame; //  0x318 Size(8)
	struct Unknown TitleWidgetRef; //  0x320 Size(8)
	struct Unknown LobbyWidgetRef; //  0x328 Size(8)
	struct TArray<Unknown> LobbyPawns; //  0x330 Size(10)
	struct TSoftClassPtr<UObject> LobbyPawnClass; //  0x340 Size(28)
	struct Unknown SkipKey; //  0x368 Size(18)
	char bSkip; //  0x380 Size(1)
	char bNotFirstTime; //  0x381 Size(1)
	struct Unknown LobbyCustomizePawn; //  0x388 Size(8)
	char IsCharacterAppearance; //  0x390 Size(1)
	struct Unknown TargetWearableCamera; //  0x398 Size(8)
	struct FString CurrentArmorySceneState; //  0x3a0 Size(10)
	float SurveyUPanValue; //  0x3b0 Size(4)
	float GunSurveyMovingValue; //  0x3b4 Size(4)
	struct Unknown SurveyUPan; //  0x3b8 Size(8)
	struct Unknown GunSurveyMoving; //  0x3c0 Size(8)
	struct Unknown IdentifiedTimer; //  0x3c8 Size(8)
	struct FString CurrentTab; //  0x3d0 Size(10)
	struct Unknown P; //  0x3e0 Size(8)
	struct Unknown AudioIndex_BGM; //  0x3e8 Size(4)
	struct Unknown AudioIndex_Ambience; //  0x3ec Size(4)
	struct Unknown AudioIndex_Analyze; //  0x3f0 Size(4)
	char PendingPartyInfoChange; //  0x3f4 Size(1)
	struct Unknown EnhanceTimerHandle; //  0x3f8 Size(8)
	struct Unknown ProceedingTimerHandle; //  0x400 Size(8)
	struct Unknown CreateCharacterRef; //  0x408 Size(8)
	struct Unknown IntroBGWidget; //  0x410 Size(8)
	struct Unknown MediaSoundComponent; //  0x418 Size(8)
	char bPlaySoloSequencePlayer; //  0x420 Size(1)
	struct FString CurrentArmoryTab; //  0x428 Size(10)
	struct Unknown LoginWidget; //  0x438 Size(8)
	char bFinished_SequencePlayer_Endgame; //  0x440 Size(1)
	struct Unknown ANI; //  0x448 Size(8)
	struct Unknown ANI; //  0x450 Size(8)
	struct Unknown ANI; //  0x458 Size(8)
	struct Unknown ANI; //  0x460 Size(8)
	struct Unknown S; //  0x468 Size(8)
	struct Unknown Title_TowerBridge_Squard_5_ExecuteUbergraph_L; //  0x470 Size(8)
	struct Unknown S; //  0x478 Size(8)
	struct Unknown Ak; //  0x480 Size(8)
	struct Unknown Title_TowerBridge_Endgame_2_ExecuteUbergraph_L; //  0x488 Size(8)
	struct Unknown Title_TowerBridge_Readyshot_2_ExecuteUbergraph_L; //  0x490 Size(8)
	struct Unknown Character_Creation_2_ExecuteUbergraph_L; //  0x498 Size(8)
	struct Unknown ExponentialHeightFog3_ExecuteUbergraph_L; //  0x4a0 Size(8)
	struct Unknown ExponentialHeightFog_1_ExecuteUbergraph_L; //  0x4a8 Size(8)
	struct Unknown CineCameraActor_1_ExecuteUbergraph_L_Animationi; //  0x4b0 Size(8)
	struct Unknown CineCamera_Supplybox_ExecuteUbergraph_L; //  0x4b8 Size(8)
	struct Unknown CineCamera_All_ExecuteUbergraph_L; //  0x4c0 Size(8)
	struct Unknown Character_Customization_Face_3_ExecuteUbergraph_L; //  0x4c8 Size(8)
	struct Unknown Supplybox_Lobby_4_ExecuteUbergraph_; //  0x4d0 Size(8)
	struct Unknown Supplybox_Lobby_3_ExecuteUbergraph_L; //  0x4d8 Size(8)
	struct Unknown CineCamera_Target_ExecuteUbergraph_; //  0x4e0 Size(8)
	struct Unknown CineCamera_Rank_ExecuteUbergraph_L; //  0x4e8 Size(8)
	struct Unknown Title_Rank_2_ExecuteUbergraph_L; //  0x4f0 Size(8)
	struct Unknown Gun_Survey_Plane_ExecuteUbergraph_L; //  0x4f8 Size(8)
	struct Unknown Weapon_Lobby_01_2_ExecuteUbergraph_Lj; //  0x500 Size(8)
	struct Unknown CineCamera_Face3_ExecuteUbergraph_L; //  0x508 Size(8)
	struct Unknown Screen_Transition_ExecuteUbergraph_; //  0x510 Size(8)
	struct Unknown Character_Fade_2_ExecuteUbergraph_L; //  0x518 Size(8)
	struct Unknown P; //  0x520 Size(8)
	struct Unknown P; //  0x528 Size(8)
	struct Unknown P; //  0x530 Size(8)
	struct Unknown P; //  0x538 Size(8)
	struct Unknown P; //  0x540 Size(8)
	struct Unknown P; //  0x548 Size(8)
	struct Unknown P; //  0x550 Size(8)
	struct Unknown P; //  0x558 Size(8)
	struct Unknown Weapon_Lobby_Disassemble_ExecuteUbergraph_L; //  0x560 Size(8)
	struct Unknown Weapon_Lobby_Repair_ExecuteUbergraph_L; //  0x568 Size(8)
	struct Unknown CineCamera_Weapon_Customization02_ExecuteUbergraph_L; //  0x570 Size(8)
	struct Unknown CineCamera_Weapon_Customization_2_ExecuteUbergraph_L; //  0x578 Size(8)
	struct Unknown Weapon_Lobby_Custom_ExecuteUbergraph_L; //  0x580 Size(8)
	struct Unknown S; //  0x588 Size(8)
	struct Unknown CineCameraActor_1_EdGraph_4_RefProperty; //  0x590 Size(8)
	struct Unknown Gun_Survey_Plane_EdGraph_11_RefProperty; //  0x598 Size(8)
	struct Unknown Gun_Survey_Plane_EdGraph_12_RefProperty; //  0x5a0 Size(8)
	struct Unknown Gun_Survey_Plane_EdGraph_13_RefProperty; //  0x5a8 Size(8)
	struct Unknown PostProcessVolume2_EdGraph_14_RefProperty; //  0x5b0 Size(8)
	struct Unknown PostProcessVolume2_EdGraph_15_RefProperty; //  0x5b8 Size(8)
	struct Unknown Supplybox_Lobby_4_EdGraph_16_RefProperty; //  0x5c0 Size(8)
	struct Unknown Title_Rank_2_EdGraph_16_RefProperty; //  0x5c8 Size(8)
	struct Unknown Character_Customization_Face_3_EdGraph_16_RefProperty; //  0x5d0 Size(8)
	struct Unknown Supplybox_Lobby_3_EdGraph_16_RefProperty; //  0x5d8 Size(8)
	struct Unknown Plane_3_EdGraph_27_RefProperty; //  0x5e0 Size(8)
	struct Unknown Plane_2_EdGraph_27_RefProperty; //  0x5e8 Size(8)
	struct Unknown Plane_4_EdGraph_27_RefProperty; //  0x5f0 Size(8)

	void SetSequecePanelColor(int32_t WeaponRarity); // Function L.L.SetSequecePanelColor(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

