// Class LevelSequence.DefaultLevelSequenceInstanceData
class UDefaultLevelSequenceInstanceData : public Object {

public:

	struct UActor TransformOriginActor; // 0x30 (8)
	struct FTransform TransformOrigin; // 0x40 (48)
};

// Class LevelSequence.LevelSequence
class ULevelSequence : public UMovieSceneSequence {

public:

	struct UMovieScene MovieScene; // 0x348 (8)
	struct FLevelSequenceObjectReferenceMap ObjectReferences; // 0x350 (80)
	struct FLevelSequenceBindingReferences BindingReferences; // 0x3A0 (160)
	struct TMap<struct FString, struct FLevelSequenceObject> PossessedObjects; // 0x440 (80)
	struct UClass* DirectorClass; // 0x490 (8)

	void RemoveMetaDataByClass(struct UClass* InClass); // Function LevelSequence.LevelSequence.RemoveMetaDataByClass(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF3250>
	struct Object FindOrAddMetaDataByClass(struct UClass* InClass); // Function LevelSequence.LevelSequence.FindOrAddMetaDataByClass(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF2BB0>
	struct Object FindMetaDataByClass(struct UClass* InClass); // Function LevelSequence.LevelSequence.FindMetaDataByClass(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF2BB0>
	struct Object CopyMetaData(struct Object InMetaData); // Function LevelSequence.LevelSequence.CopyMetaData(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF2BB0>
};

// Class LevelSequence.LevelSequenceBurnInOptions
class ULevelSequenceBurnInOptions : public Object {

public:

	char bUseBurnIn : 0; // 0x28 (1)
	struct FSoftClassPath BurnInClass; // 0x30 (24)
	struct ULevelSequenceBurnInInitSettings Settings; // 0x48 (8)

	void SetBurnIn(struct FSoftClassPath InBurnInClass); // Function LevelSequence.LevelSequenceBurnInOptions.SetBurnIn(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF3610>
};

// Class LevelSequence.LevelSequenceActor
class ALevelSequenceActor : public UActor {

public:

	struct FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x338 (20)
	struct ULevelSequencePlayer SequencePlayer; // 0x350 (8)
	struct FSoftObjectPath LevelSequence; // 0x358 (24)
	struct TArray<struct UActor> AdditionalEventReceivers; // 0x370 (16)
	struct FLevelSequenceCameraSettings CameraSettings; // 0x380 (2)
	struct ULevelSequenceBurnInOptions BurnInOptions; // 0x388 (8)
	struct UMovieSceneBindingOverrides BindingOverrides; // 0x390 (8)
	char bAutoPlay : 0; // 0x398 (1)
	char bOverrideInstanceData : 0; // 0x398 (1)
	char bReplicatePlayback : 0; // 0x398 (1)
	struct Object DefaultInstanceData; // 0x3A0 (8)
	struct ULevelSequenceBurnIn BurnInInstance; // 0x3A8 (8)
	char bShowBurnin : 0; // 0x3B0 (1)

	void ShowBurnin(); // Function LevelSequence.LevelSequenceActor.ShowBurnin(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF3970>
	void SetSequence(struct ULevelSequence InSequence); // Function LevelSequence.LevelSequenceActor.SetSequence(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF38F0>
	void SetReplicatePlayback(char ReplicatePlayback); // Function LevelSequence.LevelSequenceActor.SetReplicatePlayback(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF3860>
	void SetEventReceivers(struct TArray<struct UActor> AdditionalReceivers); // Function LevelSequence.LevelSequenceActor.SetEventReceivers(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF3710>
	void SetBindingByTag(struct FName BindingTag, struct TArray<struct UActor>& Actors, char bAllowBindingsFromAsset); // Function LevelSequence.LevelSequenceActor.SetBindingByTag(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF34E0>
	void SetBinding(struct FMovieSceneObjectBindingID Binding, struct TArray<struct UActor>& Actors, char bAllowBindingsFromAsset); // Function LevelSequence.LevelSequenceActor.SetBinding(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF3390>
	void ResetBindings(); // Function LevelSequence.LevelSequenceActor.ResetBindings(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF3370>
	void ResetBinding(struct FMovieSceneObjectBindingID Binding); // Function LevelSequence.LevelSequenceActor.ResetBinding(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF32C0>
	void RemoveBindingByTag(struct FName Tag, struct UActor Actor); // Function LevelSequence.LevelSequenceActor.RemoveBindingByTag(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF3190>
	void RemoveBinding(struct FMovieSceneObjectBindingID Binding, struct UActor Actor); // Function LevelSequence.LevelSequenceActor.RemoveBinding(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF30A0>
	void OnLevelSequenceLoaded__DelegateSignature(); // DelegateFunction LevelSequence.LevelSequenceActor.OnLevelSequenceLoaded__DelegateSignature(Public|Delegate) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
	struct ULevelSequence LoadSequence(); // Function LevelSequence.LevelSequenceActor.LoadSequence(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF3030>
	void HideBurnin(); // Function LevelSequence.LevelSequenceActor.HideBurnin(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF3010>
	struct ULevelSequencePlayer GetSequencePlayer(); // Function LevelSequence.LevelSequenceActor.GetSequencePlayer(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF2FC0>
	struct ULevelSequence GetSequence(); // Function LevelSequence.LevelSequenceActor.GetSequence(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF2F70>
	struct TArray<struct FMovieSceneObjectBindingID> FindNamedBindings(struct FName Tag); // Function LevelSequence.LevelSequenceActor.FindNamedBindings(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF2E50>
	struct FMovieSceneObjectBindingID FindNamedBinding(struct FName Tag); // Function LevelSequence.LevelSequenceActor.FindNamedBinding(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF2DA0>
	void AddBindingByTag(struct FName BindingTag, struct UActor Actor, char bAllowBindingsFromAsset); // Function LevelSequence.LevelSequenceActor.AddBindingByTag(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF2AA0>
	void AddBinding(struct FMovieSceneObjectBindingID Binding, struct UActor Actor, char bAllowBindingsFromAsset); // Function LevelSequence.LevelSequenceActor.AddBinding(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF2960>
};

// Class LevelSequence.LevelSequenceBurnIn
class ULevelSequenceBurnIn : public UUserWidget {

public:

	struct FLevelSequencePlayerSnapshot FrameInformation; // 0x248 (184)
	struct ALevelSequenceActor LevelSequenceActor; // 0x300 (8)

	void SetSettings(struct Object InSettings); // Function LevelSequence.LevelSequenceBurnIn.SetSettings(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
	struct UClass* GetSettingsClass(); // Function LevelSequence.LevelSequenceBurnIn.GetSettingsClass(Native|Event|Public|BlueprintEvent|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF2FF0>
};

// Class LevelSequence.LevelSequenceDirector
class ULevelSequenceDirector : public Object {

public:

	struct ULevelSequencePlayer Player; // 0x28 (8)

	void OnCreated(); // Function LevelSequence.LevelSequenceDirector.OnCreated(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
};

// Class LevelSequence.LevelSequencePlayer
class ULevelSequencePlayer : public UMovieSceneSequencePlayer {

public:

	struct FMulticastInlineDelegate OnCameraCut; // 0x890 (16)

	struct UCameraComponent GetActiveCameraComponent(); // Function LevelSequence.LevelSequencePlayer.GetActiveCameraComponent(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF2F30>
	struct ULevelSequencePlayer CreateLevelSequencePlayer(struct Object WorldContextObject, struct ULevelSequence LevelSequence, struct FMovieSceneSequencePlaybackSettings Settings, struct ALevelSequenceActor& OutActor); // Function LevelSequence.LevelSequencePlayer.CreateLevelSequencePlayer(Final|Native|Static|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF2C30>
};

// Class LevelSequence.LevelSequenceMediaController
class ALevelSequenceMediaController : public UActor {

public:

	struct ALevelSequenceActor Sequence; // 0x330 (8)
	struct UMediaComponent MediaComponent; // 0x338 (8)
	float ServerStartTimeSeconds; // 0x340 (4)

	void SynchronizeToServer(float DesyncThresholdSeconds); // Function LevelSequence.LevelSequenceMediaController.SynchronizeToServer(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF3990>
	void Play(); // Function LevelSequence.LevelSequenceMediaController.Play(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF3080>
	void OnRep_ServerStartTimeSeconds(); // Function LevelSequence.LevelSequenceMediaController.OnRep_ServerStartTimeSeconds(Final|Native|Private) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF3060>
	struct ALevelSequenceActor GetSequence(); // Function LevelSequence.LevelSequenceMediaController.GetSequence(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3CF2FA0>
	struct UMediaComponent GetMediaComponent(); // Function LevelSequence.LevelSequenceMediaController.GetMediaComponent(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x3B8BE40>
};

// ScriptStruct LevelSequence.LevelSequenceCameraSettings
struct FLevelSequenceCameraSettings {
	char bOverrideAspectRatioAxisConstraint : 0; // 0x0 (1)
	char AspectRatioAxisConstraint; // 0x1 (1)
};

// ScriptStruct LevelSequence.LevelSequenceBindingReferences
struct FLevelSequenceBindingReferences {
	struct TMap<struct FGuid, struct FLevelSequenceBindingReferenceArray> BindingIdToReferences; // 0x0 (80)
	struct TSet<struct FGuid> AnimSequenceInstances; // 0x50 (80)
};

// ScriptStruct LevelSequence.LevelSequenceBindingReferenceArray
struct FLevelSequenceBindingReferenceArray {
	struct TArray<struct FLevelSequenceBindingReference> References; // 0x0 (16)
};

// ScriptStruct LevelSequence.LevelSequenceBindingReference
struct FLevelSequenceBindingReference {
	struct FString PackageName; // 0x0 (16)
	struct FSoftObjectPath ExternalObjectPath; // 0x10 (24)
	struct FString ObjectPath; // 0x28 (16)
};

// ScriptStruct LevelSequence.LevelSequenceObject
struct FLevelSequenceObject {
	LazyObjectProperty ObjectOrOwner; // 0x0 (28)
	struct FString ComponentName; // 0x20 (16)
	struct TWeakObjectPtr<struct Object> CachedComponent; // 0x30 (8)
};

// ScriptStruct LevelSequence.LevelSequencePlayerSnapshot
struct FLevelSequencePlayerSnapshot {
	struct FString MasterName; // 0x0 (16)
	struct FQualifiedFrameTime MasterTime; // 0x10 (16)
	struct FQualifiedFrameTime SourceTime; // 0x20 (16)
	struct FString CurrentShotName; // 0x30 (16)
	struct FQualifiedFrameTime CurrentShotLocalTime; // 0x40 (16)
	struct FQualifiedFrameTime CurrentShotSourceTime; // 0x50 (16)
	struct FString SourceTimecode; // 0x60 (16)
	struct TSoftObjectPtr<UCameraComponent> CameraComponent; // 0x70 (40)
	struct FLevelSequenceSnapshotSettings Settings; // 0x98 (12)
	struct ULevelSequence ActiveShot; // 0xA8 (8)
	struct FMovieSceneSequenceID ShotID; // 0xB0 (4)
};

// ScriptStruct LevelSequence.LevelSequenceSnapshotSettings
struct FLevelSequenceSnapshotSettings {
	char ZeroPadAmount; // 0x0 (1)
	struct FFrameRate FrameRate; // 0x4 (8)
};

// Function LevelSequence.LevelSequence.RemoveMetaDataByClass
inline void ULevelSequence::RemoveMetaDataByClass(struct UClass* InClass) {
	static auto fn = UObject::FindObject<UFunction>("Function LevelSequence.LevelSequence.RemoveMetaDataByClass");

	struct RemoveMetaDataByClass_Params {
		struct UClass* InClass;
	}; RemoveMetaDataByClass_Params Params;

	Params.InClass = InClass;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function LevelSequence.LevelSequence.FindOrAddMetaDataByClass
inline struct Object ULevelSequence::FindOrAddMetaDataByClass(struct UClass* InClass) {
	static auto fn = UObject::FindObject<UFunction>("Function LevelSequence.LevelSequence.FindOrAddMetaDataByClass");

	struct FindOrAddMetaDataByClass_Params {
		struct UClass* InClass;
		struct Object ReturnValue;

	}; FindOrAddMetaDataByClass_Params Params;

	Params.InClass = InClass;

