// BlueprintGeneratedClass LV-Title_Alternative.LV-Title_Alternative_C
class ALV-Title_Alternative_C : public ALevelScriptActor {

public:

	struct Unknown UberGraphFrame; // 0x320 (8)
	struct Unknown TitleWidgetRef; // 0x328 (8)
	struct Unknown LobbyWidgetRef; // 0x330 (8)
	struct TArray<Unknown> LobbyPawns; // 0x338 (16)
	struct TSoftClassPtr<UObject> LobbyPawnClass; // 0x348 (40)
	struct Unknown SkipKey; // 0x370 (24)
	char bSkip : 0; // 0x388 (1)
	char bNotFirstTime : 0; // 0x389 (1)
	struct Unknown LobbyCustomizePawn; // 0x390 (8)
	char IsCharacterAppearance : 0; // 0x398 (1)
	struct Unknown TargetWearableCamera; // 0x3A0 (8)
	struct FString CurrentArmorySceneState; // 0x3A8 (16)
	float SurveyUPanValue; // 0x3B8 (4)
	float GunSurveyMovingValue; // 0x3BC (4)
	struct Unknown SurveyUPan; // 0x3C0 (8)
	struct Unknown GunSurveyMoving; // 0x3C8 (8)
	struct Unknown IdentifiedTimer; // 0x3D0 (8)
	struct FString CurrentTab; // 0x3D8 (16)
	struct Unknown PP-OutlineGlow; // 0x3E8 (8)
	struct Unknown AudioIndex_BGM; // 0x3F0 (4)
	struct Unknown AudioIndex_Ambience; // 0x3F4 (4)
	struct Unknown AudioIndex_Analyze; // 0x3F8 (4)
	char PendingPartyInfoChange : 0; // 0x3FC (1)
	struct Unknown EnhanceTimerHandle; // 0x400 (8)
	struct Unknown ProceedingTimerHandle; // 0x408 (8)
	struct Unknown CreateCharacterRef; // 0x410 (8)
	struct Unknown IntroBGWidget; // 0x418 (8)
	struct Unknown MediaSoundComponent; // 0x420 (8)
	char bPlaySoloSequencePlayer : 0; // 0x428 (1)
	struct FString CurrentArmoryTab; // 0x430 (16)
	struct Unknown LoginWidget; // 0x440 (8)
	char bFinished_SequencePlayer_Endgame : 0; // 0x448 (1)
	struct Unknown ANIM-Lobby01_5_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x450 (8)
	struct Unknown ANIM-Lobby02_8_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x458 (8)
	struct Unknown ANIM-Lobby03_2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x460 (8)
	struct Unknown ANIM-Lobby04_11_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x468 (8)
	struct Unknown SK-Body_Female_5_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x470 (8)
	struct Unknown Title_TowerBridge_Squard_5_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x478 (8)
	struct Unknown SK-Body_Female_Ranking_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x480 (8)
	struct Unknown Ak-LobbySound_1_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x488 (8)
	struct Unknown Title_TowerBridge_Endgame_2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x490 (8)
	struct Unknown Title_TowerBridge_Readyshot_2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x498 (8)
	struct Unknown Character_Creation_2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4A0 (8)
	struct Unknown ExponentialHeightFog3_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4A8 (8)
	struct Unknown ExponentialHeightFog_1_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4B0 (8)
	struct Unknown CineCameraActor_1_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4B8 (8)
	struct Unknown CineCamera_Supplybox_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4C0 (8)
	struct Unknown CineCamera_All_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4C8 (8)
	struct Unknown Character_Customization_Face_3_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4D0 (8)
	struct Unknown Supplybox_Lobby_4_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4D8 (8)
	struct Unknown Supplybox_Lobby_3_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4E0 (8)
	struct Unknown CineCamera_Target_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4E8 (8)
	struct Unknown CineCamera_Rank_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4F0 (8)
	struct Unknown Title_Rank_2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x4F8 (8)
	struct Unknown Gun_Survey_Plane_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x500 (8)
	struct Unknown Weapon_Lobby_01_2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x508 (8)
	struct Unknown CineCamera_Face3_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x510 (8)
	struct Unknown Screen_Transition_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x518 (8)
	struct Unknown Character_Fade_2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x520 (8)
	struct Unknown PS-LobbyRay1_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x528 (8)
	struct Unknown PS-LobbyRay2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x530 (8)
	struct Unknown PS-LobbyRay3_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x538 (8)
	struct Unknown PS-LobbyRay4_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x540 (8)
	struct Unknown PS-LobbyRay5_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x548 (8)
	struct Unknown PS-LobbyRay6_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x550 (8)
	struct Unknown PS-LobbyRay7_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x558 (8)
	struct Unknown PS-LobbyRay8_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x560 (8)
	struct Unknown Weapon_Lobby_Disassemble_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x568 (8)
	struct Unknown Weapon_Lobby_Repair_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x570 (8)
	struct Unknown CineCamera_Weapon_Customization02_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x578 (8)
	struct Unknown CineCamera_Weapon_Customization_2_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x580 (8)
	struct Unknown Weapon_Lobby_Custom_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x588 (8)
	struct Unknown SK-Body_Female_Creation_ExecuteUbergraph_LV-Title_Alternative_RefProperty; // 0x590 (8)
	struct Unknown CineCameraActor_1_EdGraph_4_RefProperty; // 0x598 (8)
	struct Unknown Gun_Survey_Plane_EdGraph_11_RefProperty; // 0x5A0 (8)
	struct Unknown Gun_Survey_Plane_EdGraph_12_RefProperty; // 0x5A8 (8)
	struct Unknown Gun_Survey_Plane_EdGraph_13_RefProperty; // 0x5B0 (8)
	struct Unknown PostProcessVolume2_EdGraph_14_RefProperty; // 0x5B8 (8)
	struct Unknown PostProcessVolume2_EdGraph_15_RefProperty; // 0x5C0 (8)
	struct Unknown Supplybox_Lobby_4_EdGraph_16_RefProperty; // 0x5C8 (8)
	struct Unknown Title_Rank_2_EdGraph_16_RefProperty; // 0x5D0 (8)
	struct Unknown Character_Customization_Face_3_EdGraph_16_RefProperty; // 0x5D8 (8)
	struct Unknown Supplybox_Lobby_3_EdGraph_16_RefProperty; // 0x5E0 (8)
	struct Unknown Plane_3_EdGraph_27_RefProperty; // 0x5E8 (8)
	struct Unknown Plane_2_EdGraph_27_RefProperty; // 0x5F0 (8)
	struct Unknown Plane_4_EdGraph_27_RefProperty; // 0x5F8 (8)

	void SetSequecePanelColor(int32_t WeaponRarity); // Function LV-Title_Alternative.LV-Title_Alternative_C.SetSequecePanelColor(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void ChangeMenu(struct FString Menu); // Function LV-Title_Alternative.LV-Title_Alternative_C.ChangeMenu(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void SetTutorial(); // Function LV-Title_Alternative.LV-Title_Alternative_C.SetTutorial(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void PlayLobbySound(); // Function LV-Title_Alternative.LV-Title_Alternative_C.PlayLobbySound(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void UpdatePartyInfo(); // Function LV-Title_Alternative.LV-Title_Alternative_C.UpdatePartyInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
