// AnimBlueprintGeneratedClass Mo.AB
struct UAB : UBravoHotelVehicleAnimInstance {
	Unknown UberGraphFrame; //  0xa20 Size(8)
	Unknown AnimGraphNode_ComponentToLo_2; //  0xa28 Size(20)
	Unknown AnimGraphNode_MeshRefPose_2; //  0xa48 Size(10)
	Unknown AnimGraphNode_MeshRefPose; //  0xa58 Size(10)
	Unknown AnimGraphNode_WheelHandler; //  0xa68 Size(e0)
	Unknown AnimGraphNode_ComponentToLo; //  0xb48 Size(20)
	Unknown AnimGraphNode_ModifyBone_2; //  0xb68 Size(108)
	Unknown AnimGraphNode_BlendListByBo; //  0xc70 Size(a0)
	Unknown AnimGraphNode_Root; //  0xd10 Size(30)
	Unknown AnimGraphNode_RotationMultiplier_3; //  0xd40 Size(f0)
	Unknown AnimGraphNode_RotationMultiplier_2; //  0xe30 Size(f0)
	Unknown AnimGraphNode_BoneDrivenController_4; //  0xf20 Size(118)
	Unknown AnimGraphNode_CopyBone; //  0x1038 Size(f0)
	Unknown AnimGraphNode_RotationMultiplier; //  0x1128 Size(f0)
	Unknown AnimGraphNode_BoneDrivenController_3; //  0x1218 Size(118)
	Unknown AnimGraphNode_BoneDrivenController_2; //  0x1330 Size(118)
	Unknown AnimGraphNode_BoneDrivenController; //  0x1448 Size(118)
	Unknown AnimGraphNode_ModifyBone; //  0x1560 Size(108)
	Unknown C; //  0x1668 Size(8)
	Unknown RotateCenterValue; //  0x1670 Size(c)

	void AnimGraph(Unknown& AnimGraph); // Function Mot.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// BlueprintGeneratedClass Mo.B
struct AB : AB {
	Unknown BravoHotelVehicleTire_R; //  0xd68 Size(8)
	Unknown BravoHotelVehicleTire_F; //  0xd70 Size(8)
	Unknown VehicleSeatCollision1; //  0xd78 Size(8)
	Unknown VehicleSeatCollision; //  0xd80 Size(8)
	Unknown BravoHotelVehicleSeat02; //  0xd88 Size(8)
};

