// BlueprintGeneratedClass Motorc.B
class AB : AB {
	struct Unknown BravoHotelVehicleTire_R; // 0xD68 (8)
	struct Unknown BravoHotelVehicleTire_F; // 0xD70 (8)
	struct Unknown VehicleSeatCollision1; // 0xD78 (8)
	struct Unknown VehicleSeatCollision; // 0xD80 (8)
	struct Unknown BravoHotelVehicleSeat02; // 0xD88 (8)
};

// AnimBlueprintGeneratedClass Motorc.AB
class UAB : UBravoHotelVehicleAnimInstance {
	struct Unknown UberGraphFrame; // 0xA20 (8)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_2; // 0xA28 (32)
	struct Unknown AnimGraphNode_MeshRefPose_2; // 0xA48 (16)
	struct Unknown AnimGraphNode_MeshRefPose; // 0xA58 (16)
	struct Unknown AnimGraphNode_WheelHandler; // 0xA68 (224)
	struct Unknown AnimGraphNode_ComponentToLocalSpace; // 0xB48 (32)
	struct Unknown AnimGraphNode_ModifyBone_2; // 0xB68 (264)
	struct Unknown AnimGraphNode_BlendListByBool; // 0xC70 (160)
	struct Unknown AnimGraphNode_Root; // 0xD10 (48)
	struct Unknown AnimGraphNode_RotationMultiplier_3; // 0xD40 (240)
	struct Unknown AnimGraphNode_RotationMultiplier_2; // 0xE30 (240)
	struct Unknown AnimGraphNode_BoneDrivenController_4; // 0xF20 (280)
	struct Unknown AnimGraphNode_CopyBone; // 0x1038 (240)
	struct Unknown AnimGraphNode_RotationMultiplier; // 0x1128 (240)
	struct Unknown AnimGraphNode_BoneDrivenController_3; // 0x1218 (280)
	struct Unknown AnimGraphNode_BoneDrivenController_2; // 0x1330 (280)
	struct Unknown AnimGraphNode_BoneDrivenController; // 0x1448 (280)
	struct Unknown AnimGraphNode_ModifyBone; // 0x1560 (264)
	struct Unknown C; // 0x1668 (8)
	struct Unknown RotateCenterValue; // 0x1670 (12)

	void AnimGraph(struct Unknown& AnimGraph); // Function Motorc.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Motorc.AB.BlueprintUpdateAnimation(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
	void ExecuteUbergraph_AB(int32_t EntryPoint); // Function Motorc.AB.ExecuteUbergraph_AB(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B1E70>
};

