// NetDriver Engine.NetDriver
// Size: 0x00 (Inherited: 0x28)
struct UNetDriver : Object {
	None GeometryCollection; // 0x28(0x08)
	None OriginalGeometryCollection; // 0x30(0x08)
	None GeometryCollectionLODIndex; // 0x38(0x04)
	None Adapters; // 0x3b8(0x10)
	None TextureCoordinateCount; // 0x3d0(0x04)
	None PendingCompactCounter; // 0x51c(0x04)
	None SubdivisionCount; // 0x520(0x04)
	None StaticMesh; // 0x28(0x08)
	None OriginalStaticMesh; // 0x30(0x08)
	None StaticMeshLODIndex; // 0x38(0x04)
	None GeneratedMaterials; // 0x30(0x10)
	None GeneratedMeshes; // 0x40(0x10)
	None GeneratedTextures; // 0x50(0x10)
	None ParameterDecorations; // 0xe8(0x10)
	None TextureReuseCache; // 0x108(0x50)
	None ReferencedMaterials; // 0x320(0x10)
	None PhysicsAssetsToMerge; // 0x3d0(0x10)
	None Materials; // 0x28(0x50)
	None Textures; // 0x78(0x50)
	None ReferenceSkeletalMesh; // 0x28(0x08)
	None ReferenceStaticMesh; // 0x30(0x08)
	None Relevancy; // 0x38(0x01)
	None bDisableTextureLayoutManagement; // 0x39(0x01)
	None ReferencedMaterials; // 0x40(0x10)
	None ImageProperties; // 0x50(0x10)
	None GroupNodeMap; // 0x60(0x50)
	None ContributingMorphTargets; // 0xb0(0x10)
	None MorphTargetReconstructionInfo; // 0xc0(0x10)
	None VersionId; // 0xd0(0x10)
	None ParameterProperties; // 0xe0(0x10)
	None ParameterUIDataMap; // 0x140(0x50)
	None StateUIDataMap; // 0x190(0x50)
	None PhysicsAssetsMap; // 0x1e0(0x50)
	None MaskOutCache; // 0x230(0x28)
	None bIsChildObject; // 0x258(0x01)
	None MaskOutCache_HardRef; // 0x260(0x08)
	None CustomizableObject; // 0x28(0x08)
	None SkeletalMesh; // 0x30(0x08)
	None BoolParameters; // 0x38(0x10)
	None IntParameters; // 0x48(0x10)
	None FloatParameters; // 0x58(0x10)
	None TextureParameters; // 0x68(0x10)
	None VectorParameters; // 0x78(0x10)
	None ProjectorParameters; // 0x88(0x10)
	None bBuildParameterDecorations; // 0x98(0x01)
	None UpdatedDelegate; // 0xa0(0x10)
	None SkeletalMeshStatus; // 0x110(0x10)
	None MaterialTags; // 0x140(0x10)
	None PrivateData; // 0x1d0(0x08)
	None Textures; // 0x28(0x10)
	None PendingReleaseSkeletalMesh; // 0x28(0x10)
	None PreviewExternalImageProvider; // 0x48(0x08)
	None ProtectedCachedTextures; // 0x150(0x10)
	None DefaultInstanceLODManagement; // 0x170(0x08)
	None CurrentInstanceLODManagement; // 0x178(0x08)
	None SkippedLastRenderTime; // 0x23c(0x04)
	None CustomizableObjectInstance; // 0x240(0x08)
	None CustomizableSkeletalComponent; // 0x398(0x08)
	None UberGraphFrame; // 0x248(0x08)
	None HorizontalBox_Rarity; // 0x250(0x08)
	None HorizontalBox_Rarity_NotOwn; // 0x258(0x08)
	None Img_BG; // 0x260(0x08)
	None Img_Icon; // 0x268(0x08)
	None RetainerBox_2; // 0x270(0x08)
	None T_CurrentCount; // 0x278(0x08)
	None T_MaxCount; // 0x280(0x08)
	None T_RecipeNum; // 0x288(0x08)
	None WidgetSwitcher_Rarity; // 0x290(0x08)
	None MaterialInfo; // 0x298(0xd0)
	None ItemId; // 0x368(0x04)
	None MaxCount; // 0x36c(0x04)
	None CurrentCount; // 0x370(0x04)
	None UberGraphFrame; // 0x268(0x08)
	None BT_UserName; // 0x270(0x08)
	None CP_Main; // 0x278(0x08)
	None HB_ItemInfo; // 0x280(0x08)
	None Image_264; // 0x288(0x08)
	None Image_265; // 0x290(0x08)
	None Image_1163; // 0x298(0x08)
	None IMG_Frontbar; // 0x2a0(0x08)
	None IMG_Item; // 0x2a8(0x08)
	None Img_TeamColor; // 0x2b0(0x08)
	None PB_HP; // 0x2b8(0x08)
	None PB_ItemCasting; // 0x2c0(0x08)
	None PB_Message; // 0x2c8(0x08)
	None SizeBox_Message; // 0x2d0(0x08)
	None Switcher_Casting; // 0x2d8(0x08)
	None T_Item; // 0x2e0(0x08)
	None T_Message; // 0x2e8(0x08)
	None T_Quantity; // 0x2f0(0x08)
	None T_TeamNum; // 0x2f8(0x08)
	None T_UserName; // 0x300(0x08)
	None PlayerState; // 0x308(0x08)
	None ReplayController; // 0x310(0x08)
	None TargetCharacter; // 0x318(0x08)
	None MaxViewportSize; // 0x320(0x08)
	None LocalScreenPosition; // 0x328(0x08)
	None IsPositionUpdated; // 0x330(0x01)
	None DefaultCharacterZLocation; // 0x334(0x04)
	None TargetPawn; // 0x338(0x08)
	None Params; // 0xe0(0x30)
	None AnimationSections; // 0x58(0x10)
	None UberGraphFrame; // 0x3d8(0x08)
	None BTN-Menu02; // 0x3e0(0x08)
	None BTN-Menu03; // 0x3e8(0x08)
	None CP-SlotInfo; // 0x3f0(0x08)
	None IMG-BG; // 0x3f8(0x08)
	None IMG-BG-Border; // 0x400(0x08)
	None IMG-Item; // 0x408(0x08)
	None IMG-Mask; // 0x410(0x08)
	None IMG-Over; // 0x418(0x08)
	None IMG-Over-Border; // 0x420(0x08)
	None Menu02; // 0x428(0x08)
	None Menu03; // 0x430(0x08)
	None Overlay_Mask; // 0x438(0x08)
	None TXT-ItemDesc; // 0x440(0x08)
	None TXT-ItemName; // 0x448(0x08)
	None TXT-Menu01; // 0x450(0x08)
	None TXT-Menu02; // 0x458(0x08)
	None TXT-Menu03; // 0x460(0x08)
	None UberGraphFrame; // 0x310(0x08)
	None FirstCamera; // 0x318(0x08)
	None FirstSpringArm; // 0x320(0x08)
	None ThirdCamera; // 0x328(0x08)
	None SecondCamera; // 0x330(0x08)
	None DefaultSceneRoot; // 0x338(0x08)
	None DeltaSeconds; // 0x340(0x04)
	None TargetDeltaLocation; // 0x344(0x0c)
	None Character; // 0x350(0x08)
	None LowerBoundCameraHeightDelta; // 0x358(0x04)
	None bHeightUpdateFinished; // 0x35c(0x01)
	None ThridCameraRotationYawDelta; // 0x360(0x04)
	None ThirdCameraMinHeight; // 0x364(0x04)
	None FirstSpringArmDeltaZ; // 0x368(0x04)
	None PrimaryComponentTick; // 0x30(0x30)
	None ComponentTags; // 0x60(0x10)
	None AssetUserData; // 0x70(0x10)
	None UCSSerializationIndex; // 0x84(0x04)
	None bNetAddressable; // 0x88(0x01)
	None bReplicates; // 0x88(0x01)
	None bAutoActivate; // 0x89(0x01)
	None bIsActive; // 0x8a(0x01)
	None bEditableWhenInherited; // 0x8a(0x01)
	None bCanEverAffectNavigation; // 0x8a(0x01)
	None bIsEditorOnly; // 0x8a(0x01)
	None CreationMethod; // 0x8c(0x01)
	None OnComponentActivated; // 0x8d(0x01)
	None OnComponentDeactivated; // 0x8e(0x01)
	None UCSModifiedProperties; // 0x90(0x10)
	None PhysicsVolume; // 0x144(0x08)
	None AttachParent; // 0x1d0(0x08)
	None AttachSocketName; // 0x1dc(0x08)
	None AttachChildren; // 0xb8(0x10)
	None ClientAttachedChildren; // 0x190(0x10)
	None RelativeLocation; // 0x224(0x0c)
	None RelativeRotation; // 0x1b4(0x0c)
	None RelativeScale3D; // 0x1c4(0x0c)
	None ComponentVelocity; // 0x164(0x0c)
	None bComponentToWorldUpdated; // 0x140(0x01)
	None bAbsoluteLocation; // 0x220(0x01)
	None bAbsoluteRotation; // 0x1d8(0x01)
	None bAbsoluteScale; // 0x188(0x01)
	None bVisible; // 0xc8(0x01)
	None bShouldBeAttached; // 0x220(0x01)
	None bShouldSnapLocationWhenAttached; // 0x1b0(0x01)
	None bShouldSnapRotationWhenAttached; // 0x188(0x01)
	None bShouldUpdatePhysicsVolume; // 0x1a0(0x01)
	None bHiddenInGame; // 0x220(0x01)
	None bBoundsChangeTriggersStreamingDataRebuild; // 0xc8(0x01)
	None bUseAttachParentBound; // 0x1d8(0x01)
	None Mobility; // 0x221(0x01)
	None DetailMode; // 0x160(0x01)
	None PhysicsVolumeChangedDelegate; // 0xb0(0x01)
	None ReplaySamplable; // 0x28(0x01)
	None ReplaySampleClass; // 0x30(0x08)
	None ReplaySamplingFrequency; // 0x38(0x04)
	None ClientReplaySamplingGUID; // 0x3c(0x04)
	None bReplayLevelAttached; // 0x44(0x01)
	None ReplaySamplesForPlayback; // 0x68(0x10)
	None SelfActor; // 0x88(0x08)
	None PrimaryActorTick; // 0x1d8(0x30)
	None bNetTemporary; // 0x284(0x01)
	None bNetStartup; // 0x248(0x01)
	None bOnlyRelevantToOwner; // 0x1c4(0x01)
	None bAlwaysRelevant; // 0xa1(0x01)
	None bReplicateMovement; // 0x260(0x01)
	None bHidden; // 0x222(0x01)
	None bTearOff; // 0x284(0x01)
	None bExchangedRoles; // 0x120(0x01)
	None bNetLoadOnClient; // 0x138(0x01)
	None bNetUseOwnerRelevancy; // 0xe8(0x01)
	None bRelevantForNetworkReplays; // 0x170(0x01)
	None bRelevantForLevelBounds; // 0x138(0x01)
	None bReplayRewindable; // 0x9f(0x01)
	None bAllowTickBeforeBeginPlay; // 0x1c4(0x01)
	None bAutoDestroyWhenFinished; // 0x1c4(0x01)
	None bCanBeDamaged; // 0x1a0(0x01)
	None bBlockInput; // 0x303(0x01)
	None bCollideWhenPlacing; // 0x301(0x01)
	None bFindCameraComponentWhenViewTarget; // 0x251(0x01)
	None bGenerateOverlapEventsDuringLevelStreaming; // 0x30e(0x01)
	None bIgnoresOriginShifting; // 0x155(0x01)
	None bEnableAutoLODGeneration; // 0x251(0x01)
	None bIsEditorOnlyActor; // 0x120(0x01)
	None bActorSeamlessTraveled; // 0xea(0x01)
	None bReplicates; // 0x9d(0x01)
	None bCanBeInCluster; // 0x90(0x01)
	None bAllowReceiveTickEventOnDedicatedServer; // 0x198(0x01)
	None bActorEnableCollision; // 0x1b8(0x01)
	None bActorIsBeingDestroyed; // 0x30e(0x01)
	None UpdateOverlapsMethodDuringLevelStreaming; // 0x154(0x01)
	None DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0xa3(0x01)
	None RemoteRole; // 0x279(0x01)
	None ReplicatedMovement; // 0xec(0x34)
	None InitialLifeSpan; // 0x2e0(0x04)
	None CustomTimeDilation; // 0x308(0x04)
	None AttachmentReplication; // 0xa8(0x40)
	None Owner; // 0x178(0x08)
	None NetDriverName; // 0x94(0x08)
	None Role; // 0x9e(0x01)
	None NetDormancy; // 0x238(0x01)
	None SpawnCollisionHandlingMethod; // 0x304(0x01)
	None AutoReceiveInput; // 0x302(0x01)
	None InputPriority; // 0x150(0x04)
	None InputComponent; // 0x2f8(0x08)
	None NetCullDistanceSquared; // 0x280(0x04)
	None NetTag; // 0x24c(0x04)
	None NetUpdateFrequency; // 0x27c(0x04)
	None MinNetUpdateFrequency; // 0x288(0x04)
	None NetPriority; // 0x21c(0x04)
	None Instigator; // 0x258(0x08)
	None Children; // 0x268(0x10)
	None RootComponent; // 0x158(0x08)
	None ControllingMatineeActors; // 0x208(0x10)
	None Layers; // 0x188(0x10)
	None ParentComponent; // 0x1bc(0x08)
	None bEnableRerunConstructionScript; // 0x30c(0x01)
	None Tags; // 0x140(0x10)
	None OnTakeAnyDamage; // 0x218(0x01)
	None OnTakePointDamage; // 0x27a(0x01)
	None OnTakeRadialDamage; // 0x9c(0x01)
	None OnActorBeginOverlap; // 0x27b(0x01)
	None OnActorEndOverlap; // 0xa0(0x01)
	None OnBeginCursorOver; // 0x221(0x01)
	None OnEndCursorOver; // 0xe9(0x01)
	None OnClicked; // 0x278(0x01)
	None OnReleased; // 0x2e4(0x01)
	None OnInputTouchBegin; // 0x300(0x01)
	None OnInputTouchEnd; // 0x285(0x01)
	None OnInputTouchEnter; // 0xa2(0x01)
	None OnInputTouchLeave; // 0x250(0x01)
	None OnActorHit; // 0x180(0x01)
	None OnDestroyed; // 0x220(0x01)
	None OnEndPlay; // 0x30d(0x01)
	None InstanceComponents; // 0x128(0x10)
	None BlueprintCreatedComponents; // 0x1a8(0x10)
	None LoadedObjects; // 0x1c8(0x10)
	None bShouldDoAnimNotifies; // 0x318(0x01)
	None bWakeOnLevelStart; // 0x318(0x01)
	None SkeletalMeshComponent; // 0x320(0x08)
	None ReplicatedMesh; // 0x328(0x08)
	None ReplicatedPhysAsset; // 0x330(0x08)
	None ReplicatedMaterial0; // 0x338(0x08)
	None ReplicatedMaterial1; // 0x340(0x08)
	None MinDrawDistance; // 0x240(0x04)
	None LDMaxDrawDistance; // 0x244(0x04)
	None CachedMaxDrawDistance; // 0x248(0x04)
	None DepthPriorityGroup; // 0x24c(0x01)
	None ViewOwnerDepthPriorityGroup; // 0x24d(0x01)
	None IndirectLightingCacheQuality; // 0x24e(0x01)
	None LightmapType; // 0x24f(0x01)
	None bUseMaxLODAsImposter; // 0x250(0x01)
	None bBatchImpostersAsInstances; // 0x250(0x01)
	None bNeverDistanceCull; // 0x250(0x01)
	None bAlwaysCreatePhysicsState; // 0x250(0x01)
	None bGenerateOverlapEvents; // 0x251(0x01)
	None bMultiBodyOverlap; // 0x251(0x01)
	None bTraceComplexOnMove; // 0x251(0x01)
	None bReturnMaterialOnMove; // 0x251(0x01)
	None bUseViewOwnerDepthPriorityGroup; // 0x251(0x01)
	None bAllowCullDistanceVolume; // 0x251(0x01)
	None bHasMotionBlurVelocityMeshes; // 0x251(0x01)
	None bVisibleInReflectionCaptures; // 0x251(0x01)
	None bVisibleInRayTracing; // 0x252(0x01)
	None bRenderInMainPass; // 0x252(0x01)
	None bRenderInDepthPass; // 0x252(0x01)
	None bReceivesDecals; // 0x252(0x01)
	None bOwnerNoSee; // 0x252(0x01)
	None bOnlyOwnerSee; // 0x252(0x01)
	None bIgnoreNearClippingForOcclusion; // 0x252(0x01)
	None bTreatAsBackgroundForOcclusion; // 0x252(0x01)
	None bUseAsOccluder; // 0x253(0x01)
	None bSelectable; // 0x253(0x01)
	None bForceMipStreaming; // 0x253(0x01)
	None bHasPerInstanceHitProxies; // 0x253(0x01)
	None CastShadow; // 0x253(0x01)
	None bAffectDynamicIndirectLighting; // 0x253(0x01)
	None bAffectDistanceFieldLighting; // 0x253(0x01)
	None bCastDynamicShadow; // 0x253(0x01)
	None bCastStaticShadow; // 0x254(0x01)
	None bCastDirectionalShadow; // 0x254(0x01)
	None bCastVolumetricTranslucentShadow; // 0x254(0x01)
	None bSelfShadowOnly; // 0x254(0x01)
	None bCastFarShadow; // 0x254(0x01)
	None bCastInsetShadow; // 0x254(0x01)
	None bCastCinematicShadow; // 0x254(0x01)
	None bCastHiddenShadow; // 0x254(0x01)
	None bCastShadowAsTwoSided; // 0x255(0x01)
	None bLightAsIfStatic; // 0x255(0x01)
	None bLightAttachmentsAsGroup; // 0x255(0x01)
	None bExcludeFromLightAttachmentGroup; // 0x255(0x01)
	None bReceiveMobileCSMShadows; // 0x255(0x01)
	None bSingleSampleShadowFromStationaryLights; // 0x255(0x01)
	None bIgnoreRadialImpulse; // 0x255(0x01)
	None bIgnoreRadialForce; // 0x255(0x01)
	None bApplyImpulseOnDamage; // 0x256(0x01)
	None bReplicatePhysicsToAutonomousProxy; // 0x256(0x01)
	None bFillCollisionUnderneathForNavmesh; // 0x256(0x01)
	None AlwaysLoadOnClient; // 0x256(0x01)
	None AlwaysLoadOnServer; // 0x256(0x01)
	None bUseEditorCompositing; // 0x256(0x01)
	None bRenderCustomDepth; // 0x256(0x01)
	None bHasNoStreamableTextures; // 0x257(0x01)
	None bHasCustomNavigableGeometry; // 0x258(0x01)
	None CanCharacterStepUpOn; // 0x25a(0x01)
	None LightingChannels; // 0x25b(0x01)
	None CustomDepthStencilWriteMask; // 0x25c(0x01)
	None CustomDepthStencilValue; // 0x260(0x04)
	None CustomPrimitiveData; // 0x268(0x10)
	None CustomPrimitiveDataInternal; // 0x278(0x10)
	None TranslucencySortPriority; // 0x288(0x04)
	None VisibilityId; // 0x28c(0x04)
	None RuntimeVirtualTextures; // 0x290(0x10)
	None VirtualTextureLodBias; // 0x2a0(0x01)
	None VirtualTextureCullMips; // 0x2a1(0x01)
	None VirtualTextureMinCoverage; // 0x2a2(0x01)
	None VirtualTextureRenderPassType; // 0x2a3(0x01)
	None LpvBiasMultiplier; // 0x2a8(0x04)
	None BoundsScale; // 0x2b4(0x04)
	None MoveIgnoreActors; // 0x2c8(0x10)
	None MoveIgnoreComponents; // 0x2d8(0x10)
	None BodyInstance; // 0x2f8(0x190)
	None OnComponentHit; // 0x488(0x01)
	None OnComponentBeginOverlap; // 0x489(0x01)
	None OnComponentEndOverlap; // 0x48a(0x01)
	None OnComponentWake; // 0x48b(0x01)
	None OnComponentSleep; // 0x48c(0x01)
	None OnBeginCursorOver; // 0x48e(0x01)
	None OnEndCursorOver; // 0x48f(0x01)
	None OnClicked; // 0x490(0x01)
	None OnReleased; // 0x491(0x01)
	None OnInputTouchBegin; // 0x492(0x01)
	None OnInputTouchEnd; // 0x493(0x01)
	None OnInputTouchEnter; // 0x494(0x01)
	None OnInputTouchLeave; // 0x495(0x01)
	None LODParentPrimitive; // 0x4b0(0x08)
	None MipStreamingScale; // 0x4b8(0x04)
	None OverrideMaterials; // 0x4c0(0x10)
	None bEnableMaterialParameterCaching; // 0x4e0(0x01)
	None SkeletalMesh; // 0x4e8(0x08)
	None MasterPoseComponent; // 0x4f0(0x08)
	None SkinCacheUsage; // 0x4f8(0x10)
	None PhysicsAssetOverride; // 0x600(0x08)
	None ForcedLodModel; // 0x608(0x04)
	None MinLodModel; // 0x60c(0x04)
	None StreamingDistanceMultiplier; // 0x618(0x04)
	None LODInfo; // 0x628(0x10)
	None VisibilityBasedAnimTickOption; // 0x65c(0x01)
	None bOverrideMinLod; // 0x65e(0x01)
	None bUseBoundsFromMasterPoseComponent; // 0x65e(0x01)
	None bForceWireframe; // 0x65e(0x01)
	None bDisplayBones; // 0x65e(0x01)
	None bDisableMorphTarget; // 0x65e(0x01)
	None bHideSkin; // 0x65e(0x01)
	None bPerBoneMotionBlur; // 0x65f(0x01)
	None bComponentUseFixedSkelBounds; // 0x65f(0x01)
	None bConsiderAllBodiesForBounds; // 0x65f(0x01)
	None bSyncAttachParentLOD; // 0x65f(0x01)
	None bCanHighlightSelectedSections; // 0x65f(0x01)
	None bRecentlyRendered; // 0x65f(0x01)
	None bCastCapsuleDirectShadow; // 0x65f(0x01)
	None bCastCapsuleIndirectShadow; // 0x65f(0x01)
	None bCPUSkinning; // 0x660(0x01)
	None bEnableUpdateRateOptimizations; // 0x660(0x01)
	None bDisplayDebugUpdateRateOptimizations; // 0x660(0x01)
	None bRenderStatic; // 0x660(0x01)
	None bIgnoreMasterPoseComponentLOD; // 0x660(0x01)
	None bCachedLocalBoundsUpToDate; // 0x660(0x01)
	None bForceMeshObjectUpdate; // 0x661(0x01)
	None CapsuleIndirectShadowMinVisibility; // 0x664(0x04)
	None CachedWorldSpaceBounds; // 0x678(0x1c)
	None CachedWorldToLocalTransform; // 0x6a0(0x40)
	None ForceMipLevelsToBeResidentTimestamp; // 0x28(0x08)
	None NumCinematicMipLevels; // 0x30(0x04)
	None StreamingIndex; // 0x34(0x04)
	None CachedCombinedLODBias; // 0x38(0x04)
	None CachedNumResidentLODs; // 0x3c(0x01)
	None bCachedReadyForStreaming; // 0x3d(0x01)
	None NeverStream; // 0x3d(0x01)
	None bGlobalForceMipLevelsToBeResident; // 0x3d(0x01)
	None bIsStreamable; // 0x3d(0x01)
	None bHasStreamingUpdatePending; // 0x3d(0x01)
	None bForceMiplevelsToBeResident; // 0x3d(0x01)
	None bIgnoreStreamingMipBias; // 0x3d(0x01)
	None bUseCinematicMipLevels; // 0x3d(0x01)
	None Skeleton; // 0x60(0x08)
	None ImportedBounds; // 0x68(0x1c)
	None ExtendedBounds; // 0x84(0x1c)
	None PositiveBoundsExtension; // 0xa0(0x0c)
	None NegativeBoundsExtension; // 0xac(0x0c)
	None Materials; // 0xb8(0x10)
	None SkelMirrorTable; // 0xc8(0x10)
	None LODInfo; // 0xd8(0x10)
	None MinLOD; // 0x138(0x04)
	None DisableBelowMinLodStripping; // 0x13c(0x01)
	None SkelMirrorAxis; // 0x13d(0x01)
	None SkelMirrorFlipAxis; // 0x13e(0x01)
	None bUseFullPrecisionUVs; // 0x13f(0x01)
	None bUseHighPrecisionTangentBasis; // 0x13f(0x01)
	None bHasBeenSimplified; // 0x13f(0x01)
	None bHasVertexColors; // 0x13f(0x01)
	None bEnablePerPolyCollision; // 0x13f(0x01)
	None BodySetup; // 0x140(0x08)
	None PhysicsAsset; // 0x148(0x08)
	None ShadowPhysicsAsset; // 0x150(0x08)
	None NodeMappingData; // 0x158(0x10)
	None MorphTargets; // 0x168(0x10)
	None PostProcessAnimBlueprint; // 0x2f0(0x08)
	None MeshClothingAssets; // 0x2f8(0x10)
	None SamplingInfo; // 0x308(0x30)
	None AssetUserData; // 0x338(0x10)
	None Sockets; // 0x350(0x10)
	None SkinWeightProfiles; // 0x370(0x10)
	None StaticMeshComponent; // 0x310(0x08)
	None bStaticMeshReplicateMovement; // 0x318(0x01)
	None NavigationGeometryGatheringMode; // 0x319(0x01)
	None LightingGuid; // 0x48(0x10)
	None LODBias; // 0x58(0x04)
	None CompressionSettings; // 0x5c(0x01)
	None Filter; // 0x5d(0x01)
	None MipLoadOptions; // 0x5e(0x01)
	None LODGroup; // 0x5f(0x01)
	None SRGB; // 0x60(0x01)
	None bNoTiling; // 0x60(0x01)
	None VirtualTextureStreaming; // 0x60(0x01)
	None CompressionYCoCg; // 0x60(0x01)
	None bAsyncResourceReleaseHasBeenStarted; // 0x60(0x01)
	None AssetUserData; // 0x68(0x10)
	None Format; // 0xc0(0x01)
	None PlayerOwner; // 0x310(0x08)
	None bLostFocusPaused; // 0x318(0x01)
	None bShowHUD; // 0x318(0x01)
	None bShowDebugInfo; // 0x318(0x01)
	None CurrentTargetIndex; // 0x31c(0x04)
	None bShowHitBoxDebugInfo; // 0x320(0x01)
	None bShowOverlays; // 0x320(0x01)
	None bEnableDebugTextShadow; // 0x320(0x01)
	None PostRenderedActors; // 0x328(0x10)
	None DebugDisplay; // 0x340(0x10)
	None ToggledDebugCategories; // 0x350(0x10)
	None Canvas; // 0x360(0x08)
	None DebugCanvas; // 0x368(0x08)
	None DebugTextList; // 0x370(0x10)
	None ShowDebugTargetDesiredClass; // 0x380(0x08)
	None ShowDebugTargetActor; // 0x388(0x08)
	None PlayerController; // 0x30(0x08)
	None CurrentNetSpeed; // 0x38(0x04)
	None ConfiguredInternetSpeed; // 0x3c(0x04)
	None ConfiguredLanSpeed; // 0x40(0x04)
	None SelfNetConnection; // 0xb0(0x08)
	None Children; // 0xb8(0x10)
	None Driver; // 0xc8(0x08)
	None PackageMapClass; // 0xd0(0x08)
	None PackageMap; // 0xd8(0x08)
	None OpenChannels; // 0xe0(0x10)
	None SentTemporaries; // 0xf0(0x10)
	None ViewTarget; // 0x100(0x08)
	None OwningActor; // 0x108(0x08)
	None MaxPacket; // 0x110(0x04)
	None InternalAck; // 0x114(0x01)
	None PlayerId; // 0x1d0(0x28)
	None LastReceiveTime; // 0x240(0x08)
	None ChannelsToTick; // 0x1580(0x10)
	None NetConnectionClassName; // 0x30(0x10)
	None ReplicationDriverClassName; // 0x40(0x10)
	None MaxDownloadSize; // 0x50(0x04)
	None bClampListenServerTickRate; // 0x54(0x01)
	None NetServerMaxTickRate; // 0x58(0x04)
	None MaxNetTickRate; // 0x5c(0x04)
	None MaxInternetClientRate; // 0x60(0x04)
	None MaxClientRate; // 0x64(0x04)
	None ServerTravelPause; // 0x68(0x04)
	None SpawnPrioritySeconds; // 0x6c(0x04)
	None RelevantTimeout; // 0x70(0x04)
	None KeepAliveTime; // 0x74(0x04)
	None InitialConnectTimeout; // 0x78(0x04)
	None ConnectionTimeout; // 0x7c(0x04)
	None TimeoutMultiplierForUnoptimizedBuilds; // 0x80(0x04)
	None bNoTimeouts; // 0x84(0x01)
	None bNeverApplyNetworkEmulationSettings; // 0x85(0x01)
	None ServerConnection; // 0x88(0x08)
	None ClientConnections; // 0x90(0x10)
	None RecentlyDisconnectedTrackingTime; // 0x100(0x04)
	None World; // 0x140(0x08)
	None WorldPackage; // 0x148(0x08)
	None NetConnectionClass; // 0x170(0x08)
	None ReplicationDriverClass; // 0x178(0x08)
	None NetDriverName; // 0x190(0x08)
	None ChannelDefinitions; // 0x198(0x10)
	None ChannelDefinitionMap; // 0x1a8(0x50)
	None ActorChannelPool; // 0x1f8(0x10)
	None Time; // 0x210(0x04)
	None ReplicationDriver; // 0x6e8(0x08)

	void SetStaticGestureConfidenceThreshold(None Gesture, None Confidence); // SetStaticGestureConfidenceThreshold MagicLeapHandTracking.MagicLeapHandTrackingFunctionLibrary.SetStaticGestureConfidenceThreshold // (Final|Native|Static|Public|BlueprintCallable) // <Game+0x17e7cb0>
	void WeldVertices(None& VertexIDs, None& OutNewVertexID); // WeldVertices EditableMesh.EditableMesh.WeldVertices // (Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x1770a30>
	None MakeEditableMesh(None PrimitiveComponent, None LODIndex); // MakeEditableMesh EditableMesh.EditableMeshFactory.MakeEditableMesh // (Final|Native|Static|Public|BlueprintCallable) // <Game+0x1776fd0>
	void UnloadMaskOutCache(); // UnloadMaskOutCache CustomizableObject.CustomizableObject.UnloadMaskOutCache // (Final|Native|Public|BlueprintCallable) // <Game+0x10384d0>
	void UpdateSkeletalMeshAsync(None bIgnoreCloseDist, None bForceHighPriority); // UpdateSkeletalMeshAsync CustomizableObject.CustomizableObjectInstance.UpdateSkeletalMeshAsync // (Final|Native|Public|BlueprintCallable) // <Game+0x10384f0>
	void SetReleaseMutableTexturesImmediately(None bReleaseTextures); // SetReleaseMutableTexturesImmediately CustomizableObject.CustomizableObjectSystem.SetReleaseMutableTexturesImmediately // (Final|Native|Public|BlueprintCallable) // <Game+0x103cb50>
	void UpdateSkeletalMeshAsync(None bNeverSkipUpdate); // UpdateSkeletalMeshAsync CustomizableObject.CustomizableSkeletalComponent.UpdateSkeletalMeshAsync // (Final|Native|Public|BlueprintCallable) // <Game+0x103cbe0>
	void DelegatedCallback(None Instance); // DelegatedCallback CustomizableObject.InstanceUpdatedHelper.DelegatedCallback // (Final|Native|Public) // <Game+0x103c930>
	void SetNotOwnRarityVisibility(None Rarity); // SetNotOwnRarityVisibility UW-Lobby_Craft_Recipe_Item.UW-Lobby_Craft_Recipe_Item_C.SetNotOwnRarityVisibility // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23ad490>
	void SetEquippedWeapon(None& SUCCESS); // SetEquippedWeapon UW_ReplayUserNameTooltip.UW_ReplayUserNameTooltip_C.SetEquippedWeapon // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23ad490>
	void ExecuteUbergraph(None EntryPoint); // ExecuteUbergraph CoreUObject.Object.ExecuteUbergraph // (Event|Public|BlueprintEvent) // <Game+0x23ad490>
	void SetIconTexture(None IconTexture); // SetIconTexture UW-BlackMarket_Slot_Preset.UW-BlackMarket_Slot_Preset_C.SetIconTexture // (Public|BlueprintCallable|BlueprintEvent) // <Game+0x23ad490>
	void CheckThirdCameraLocationRange(); // CheckThirdCameraLocationRange BP-DeathCam.BP-DeathCam_C.CheckThirdCameraLocationRange // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23ad490>
	void ToggleActive(); // ToggleActive Engine.ActorComponent.ToggleActive // (Native|Public|BlueprintCallable) // <Game+0x3385ac0>
	void ToggleVisibility(None bPropagateToChildren); // ToggleVisibility Engine.SceneComponent.ToggleVisibility // (Final|Native|Public|BlueprintCallable) // <Game+0x3de3730>
	void OnTickReplaySampleRecord(None DemoNetDriver, None MinRecordHz, None MaxRecordHz, None bSaveCheckpoint); // OnTickReplaySampleRecord Engine.MKActorEx.OnTickReplaySampleRecord // (Final|Native|Private) // <Game+0x3d90770>
	None WasRecentlyRendered(None Tolerance); // WasRecentlyRendered Engine.Actor.WasRecentlyRendered // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game+0x3c5f4e0>
	void OnRep_ReplicatedPhysAsset(); // OnRep_ReplicatedPhysAsset Engine.SkeletalMeshActor.OnRep_ReplicatedPhysAsset // (Native|Public) // <Game+0x1237680>
	None WasRecentlyRendered(None Tolerance); // WasRecentlyRendered Engine.PrimitiveComponent.WasRecentlyRendered // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game+0x3dd0a20>
	void SetVectorParameterValueOnMaterials(None ParameterName, None ParameterValue); // SetVectorParameterValueOnMaterials Engine.MeshComponent.SetVectorParameterValueOnMaterials // (Final|Native|Public|HasDefaults|BlueprintCallable) // <Game+0x3d884d0>
	void UnloadSkinWeightProfile(None InProfileName); // UnloadSkinWeightProfile Engine.SkinnedMeshComponent.UnloadSkinWeightProfile // (Final|Native|Public|BlueprintCallable) // <Game+0x3df72f0>
	void SetLODSettings(None InLODSettings); // SetLODSettings Engine.SkeletalMesh.SetLODSettings // (Final|Native|Public|BlueprintCallable) // <Game+0x16b4b10>
	void SetMobility(None InMobility); // SetMobility Engine.StaticMeshActor.SetMobility // (Final|Native|Public|BlueprintCallable) // <Game+0x124d330>
	void ShowHUD(); // ShowHUD Engine.HUD.ShowHUD // (Exec|Native|Public) // <Game+0x1e4f220>
};

