// Enum Niagara.ENiagaraSystemSpawnSectionEndBehavior
enum class ENiagaraSystemSpawnSectionEndBehavior : uint8 {
	ENiagaraSystemSpawnSectionEndBehavior = 0,
	ENiagaraSystemSpawnSectionEndBehavior = 1,
	ENiagaraSystemSpawnSectionEndBehavior = 2,
	ENiagaraSystemSpawnSectionEndBehavior = 3
};

// Enum Niagara.ENiagaraSystemSpawnSectionEvaluateBehavior
enum class ENiagaraSystemSpawnSectionEvaluateBehavior : uint8 {
	ENiagaraSystemSpawnSectionEvaluateBehavior = 0,
	ENiagaraSystemSpawnSectionEvaluateBehavior = 1,
	ENiagaraSystemSpawnSectionEvaluateBehavior = 2
};

// Enum Niagara.ENiagaraSystemSpawnSectionStartBehavior
enum class ENiagaraSystemSpawnSectionStartBehavior : uint8 {
	ENiagaraSystemSpawnSectionStartBehavior = 0,
	ENiagaraSystemSpawnSectionStartBehavior = 1
};

// Enum Niagara.ENiagaraCollisionMode
enum class ENiagaraCollisionMode : uint8 {
	ENiagaraCollisionMode = 0,
	ENiagaraCollisionMode = 1,
	ENiagaraCollisionMode = 2,
	ENiagaraCollisionMode = 3,
	ENiagaraCollisionMode = 4
};

// Enum Niagara.ENiagaraLegacyTrailWidthMode
enum class ENiagaraLegacyTrailWidthMode : uint8 {
	ENiagaraLegacyTrailWidthMode = 0,
	ENiagaraLegacyTrailWidthMode = 1,
	ENiagaraLegacyTrailWidthMode = 2,
	ENiagaraLegacyTrailWidthMode = 3
};

// Enum Niagara.ENiagaraIterationSource
enum class ENiagaraIterationSource : uint8 {
	ENiagaraIterationSource = 0,
	ENiagaraIterationSource = 1,
	ENiagaraIterationSource = 2
};

// Enum Niagara.ENiagaraScriptGroup
enum class ENiagaraScriptGroup : uint8 {
	ENiagaraScriptGroup = 0,
	ENiagaraScriptGroup = 1,
	ENiagaraScriptGroup = 2,
	ENiagaraScriptGroup = 3
};

// Enum Niagara.ENiagaraScriptUsage
enum class ENiagaraScriptUsage : uint8 {
	ENiagaraScriptUsage = 0,
	ENiagaraScriptUsage = 1,
	ENiagaraScriptUsage = 2,
	ENiagaraScriptUsage = 3,
	ENiagaraScriptUsage = 4,
	ENiagaraScriptUsage = 5,
	ENiagaraScriptUsage = 6,
	ENiagaraScriptUsage = 7,
	ENiagaraScriptUsage = 8,
	ENiagaraScriptUsage = 9,
	ENiagaraScriptUsage = 10,
	ENiagaraScriptUsage = 11,
	ENiagaraScriptUsage = 12,
	ENiagaraScriptUsage = 13
};

// Enum Niagara.ENiagaraScriptCompileStatus
enum class ENiagaraScriptCompileStatus : uint8 {
	ENiagaraScriptCompileStatusnb = 0,
	ENiagaraScriptCompileStatus = 1,
	ENiagaraScriptCompileStatuson = 2,
	ENiagaraScriptCompileStatus = 3,
	ENiagaraScriptCompileStatus = 4,
	ENiagaraScriptCompileStatus = 5,
	ENiagaraScriptCompileStatus = 6,
	ENiagaraScriptCompileStatusnb = 7
};

// Enum Niagara.ENiagaraInputNodeUsage
enum class ENiagaraInputNodeUsage : uint8 {
	ENiagaraInputNodeUsage = 0,
	ENiagaraInputNodeUsage = 1,
	ENiagaraInputNodeUsage = 2,
	ENiagaraInputNodeUsage = 3,
	ENiagaraInputNodeUsage = 4,
	ENiagaraInputNodeUsage = 5,
	ENiagaraInputNodeUsage = 6
};

// Enum Niagara.ENiagaraDataSetType
enum class ENiagaraDataSetType : uint8 {
	ENiagaraDataSetType = 0,
	ENiagaraDataSetType = 1,
	ENiagaraDataSetType = 2,
	ENiagaraDataSetType = 3
};

// Enum Niagara.ENiagaraAgeUpdateMode
enum class ENiagaraAgeUpdateMode : uint8 {
	ENiagaraAgeUpdateMode = 0,
	ENiagaraAgeUpdateMode = 1,
	ENiagaraAgeUpdateMode = 2,
	ENiagaraAgeUpdateMode = 3
};

// Enum Niagara.ENiagaraSimTarget
enum class ENiagaraSimTarget : uint8 {
	ENiagaraSimTarget = 0,
	ENiagaraSimTarget = 1,
	ENiagaraSimTarget = 2
};

// Enum Niagara.ENiagaraDefaultMode
enum class ENiagaraDefaultMode : uint8 {
	ENiagaraDefaultMode = 0,
	ENiagaraDefaultMode = 1,
	ENiagaraDefaultMode = 2,
	ENiagaraDefaultMode = 3
};

// Enum Niagara.ENiagaraTickBehavior
enum class ENiagaraTickBehavior : uint8 {
	ENiagaraTickBehavior = 0,
	ENiagaraTickBehavior = 1,
	ENiagaraTickBehavior = 2,
	ENiagaraTickBehavior = 3,
	ENiagaraTickBehavior = 4
};

// Enum Niagara.ENCPoolMethod
enum class ENCPoolMethod : uint8 {
	ENCPoolMethod = 0,
	ENCPoolMethod = 1,
	ENCPoolMethod = 2,
	ENCPoolMethod = 3,
	ENCPoolMethod = 4,
	ENCPoolMethod = 5
};

// Enum Niagara.ENDISkeletalMesh_SkinningMode
enum class ENDISkeletalMesh_SkinningMode : uint8 {
	ENDISkeletalMesh_SkinningMode = 255,
	ENDISkeletalMesh_SkinningMode = 0,
	ENDISkeletalMesh_SkinningMode = 1,
	ENDISkeletalMesh_SkinningMode = 2,
	ENDISkeletalMesh_SkinningMode = 256
};

// Enum Niagara.ENiagaraScalabilityUpdateFrequency
enum class ENiagaraScalabilityUpdateFrequency : uint8 {
	ENiagaraScalabilityUpdateFrequency = 0,
	ENiagaraScalabilityUpdateFrequency = 1,
	ENiagaraScalabilityUpdateFrequency = 2,
	ENiagaraScalabilityUpdateFrequency = 3,
	ENiagaraScalabilityUpdateFrequency = 4,
	ENiagaraScalabilityUpdateFrequency = 5
};

// Enum Niagara.ENiagaraCullReaction
enum class ENiagaraCullReaction : uint8 {
	ENiagaraCullReaction = 0,
	ENiagaraCullReaction = 1,
	ENiagaraCullReaction = 2,
	ENiagaraCullReaction = 3,
	ENiagaraCullReaction = 4
};

// Enum Niagara.EParticleAllocationMode
enum class EParticleAllocationMode : uint8 {
	EParticleAllocationMode = 0,
	EParticleAllocationMode = 1,
	EParticleAllocationMode = 2
};

// Enum Niagara.EScriptExecutionMode
enum class EScriptExecutionMode : uint8 {
	EScriptExecutionMode = 0,
	EScriptExecutionMode = 1,
	EScriptExecutionMode = 2,
	EScriptExecutionMode = 3
};

// Enum Niagara.ENiagaraSortMode
enum class ENiagaraSortMode : uint8 {
	ENiagaraSortMode = 0,
	ENiagaraSortMode = 1,
	ENiagaraSortMode = 2,
	ENiagaraSortMode = 3,
	ENiagaraSortMode = 4,
	ENiagaraSortMode = 5
};

// Enum Niagara.ENiagaraMeshLockedAxisSpace
enum class ENiagaraMeshLockedAxisSpace : uint8 {
	ENiagaraMeshLockedAxisSpace = 0,
	ENiagaraMeshLockedAxisSpace = 1,
	ENiagaraMeshLockedAxisSpace = 2,
	ENiagaraMeshLockedAxisSpace = 3
};

// Enum Niagara.ENiagaraMeshFacingMode
enum class ENiagaraMeshFacingMode : uint8 {
	ENiagaraMeshFacingMode = 0,
	ENiagaraMeshFacingMode = 1,
	ENiagaraMeshFacingMode = 2,
	ENiagaraMeshFacingMode = 3,
	ENiagaraMeshFacingMode = 4
};

// Enum Niagara.ENiagaraPlatformSetState
enum class ENiagaraPlatformSetState : uint8 {
	ENiagaraPlatformSetState = 0,
	ENiagaraPlatformSetState = 1,
	ENiagaraPlatformSetState = 2,
	ENiagaraPlatformSetState = 3,
	ENiagaraPlatformSetState = 4
};

// Enum Niagara.ENiagaraPlatformSelectionState
enum class ENiagaraPlatformSelectionState : uint8 {
	ENiagaraPlatformSelectionState = 0,
	ENiagaraPlatformSelectionState = 1,
	ENiagaraPlatformSelectionState = 2,
	ENiagaraPlatformSelectionState = 3
};

// Enum Niagara.ENiagaraPreviewGridResetMode
enum class ENiagaraPreviewGridResetMode : uint8 {
	ENiagaraPreviewGridResetMode = 0,
	ENiagaraPreviewGridResetMode = 1,
	ENiagaraPreviewGridResetMode = 2,
	ENiagaraPreviewGridResetMode = 3
};

// Enum Niagara.ENiagaraRibbonTessellationMode
enum class ENiagaraRibbonTessellationMode : uint8 {
	ENiagaraRibbonTessellationMode = 0,
	ENiagaraRibbonTessellationMode = 1,
	ENiagaraRibbonTessellationMode = 2,
	ENiagaraRibbonTessellationMode = 3
};

// Enum Niagara.ENiagaraRibbonDrawDirection
enum class ENiagaraRibbonDrawDirection : uint8 {
	ENiagaraRibbonDrawDirection = 0,
	ENiagaraRibbonDrawDirection = 1,
	ENiagaraRibbonDrawDirection = 2
};

// Enum Niagara.ENiagaraRibbonAgeOffsetMode
enum class ENiagaraRibbonAgeOffsetMode : uint8 {
	ENiagaraRibbonAgeOffsetMode = 0,
	ENiagaraRibbonAgeOffsetMode = 1,
	ENiagaraRibbonAgeOffsetMode = 2
};

// Enum Niagara.ENiagaraRibbonFacingMode
enum class ENiagaraRibbonFacingMode : uint8 {
	ENiagaraRibbonFacingMode = 0,
	ENiagaraRibbonFacingMode = 1,
	ENiagaraRibbonFacingMode = 2,
	ENiagaraRibbonFacingMode = 3
};

// Enum Niagara.ENiagaraModuleDependencyScriptConstraint
enum class ENiagaraModuleDependencyScriptConstraint : uint8 {
	ENiagaraModuleDependencyScriptConstraint = 0,
	ENiagaraModuleDependencyScriptConstraint = 1,
	ENiagaraModuleDependencyScriptConstraint = 2
};

// Enum Niagara.ENiagaraModuleDependencyType
enum class ENiagaraModuleDependencyType : uint8 {
	ENiagaraModuleDependencyType = 0,
	ENiagaraModuleDependencyType = 1,
	ENiagaraModuleDependencyType = 2
};

// Enum Niagara.EUnusedAttributeBehaviour
enum class EUnusedAttributeBehaviour : uint8 {
	EUnusedAttributeBehaviour = 0,
	EUnusedAttributeBehaviour = 1,
	EUnusedAttributeBehaviour = 2,
	EUnusedAttributeBehaviour = 3,
	EUnusedAttributeBehaviour = 4,
	EUnusedAttributeBehaviour = 5
};

// Enum Niagara.ENiagaraSpriteFacingMode
enum class ENiagaraSpriteFacingMode : uint8 {
	ENiagaraSpriteFacingMode = 0,
	ENiagaraSpriteFacingMode = 1,
	ENiagaraSpriteFacingMode = 2,
	ENiagaraSpriteFacingMode = 3,
	ENiagaraSpriteFacingMode = 4,
	ENiagaraSpriteFacingMode = 5
};

// Enum Niagara.ENiagaraSpriteAlignment
enum class ENiagaraSpriteAlignment : uint8 {
	ENiagaraSpriteAlignment = 0,
	ENiagaraSpriteAlignment = 1,
	ENiagaraSpriteAlignment = 2,
	ENiagaraSpriteAlignment = 3
};

// Enum Niagara.ENiagaraParameterPanelCategory
enum class ENiagaraParameterPanelCategory : uint8 {
	ENiagaraParameterPanelCategory = 0,
	ENiagaraParameterPanelCategory = 1,
	ENiagaraParameterPanelCategory = 2,
	ENiagaraParameterPanelCategory = 3,
	ENiagaraParameterPanelCategory = 4,
	ENiagaraParameterPanelCategory = 5,
	ENiagaraParameterPanelCategory = 6,
	ENiagaraParameterPanelCategory = 7,
	ENiagaraParameterPanelCategory = 8,
	ENiagaraParameterPanelCategory = 9,
	ENiagaraParameterPanelCategory = 10,
	ENiagaraParameterPanelCategory = 11,
	ENiagaraParameterPanelCategory = 12,
	ENiagaraParameterPanelCategory = 13,
	ENiagaraParameterPanelCategory = 14
};

// Enum Niagara.ENiagaraScriptParameterUsage
enum class ENiagaraScriptParameterUsage : uint8 {
	ENiagaraScriptParameterUsage = 0,
	ENiagaraScriptParameterUsage = 1,
	ENiagaraScriptParameterUsage = 2,
	ENiagaraScriptParameterUsage = 3,
	ENiagaraScriptParameterUsage = 4,
	ENiagaraScriptParameterUsage = 5,
	ENiagaraScriptParameterUsage = 6,
	ENiagaraScriptParameterUsage = 7
};

// Enum Niagara.ENiagaraParameterScope
enum class ENiagaraParameterScope : uint8 {
	ENiagaraParameterScope = 0,
	ENiagaraParameterScope = 1,
	ENiagaraParameterScope = 2,
	ENiagaraParameterScope = 3,
	ENiagaraParameterScope = 4,
	ENiagaraParameterScope = 5,
	ENiagaraParameterScope = 6,
	ENiagaraParameterScope = 7,
	ENiagaraParameterScope = 8,
	ENiagaraParameterScope = 9,
	ENiagaraParameterScope = 10,
	ENiagaraParameterScope = 11,
	ENiagaraParameterScope = 12,
	ENiagaraParameterScope = 13,
	ENiagaraParameterScope = 14,
	ENiagaraParameterScope = 15
};

// Enum Niagara.ENiagaraExecutionState
enum class ENiagaraExecutionState : uint8 {
	ENiagaraExecutionState = 0,
	ENiagaraExecutionState = 1,
	ENiagaraExecutionState = 2,
	ENiagaraExecutionState = 3,
	ENiagaraExecutionState = 4,
	ENiagaraExecutionState = 5,
	ENiagaraExecutionState = 6
};

// Enum Niagara.ENiagaraExecutionStateSource
enum class ENiagaraExecutionStateSource : uint8 {
	ENiagaraExecutionStateSource = 0,
	ENiagaraExecutionStateSource = 1,
	ENiagaraExecutionStateSource = 2,
	ENiagaraExecutionStateSource = 3,
	ENiagaraExecutionStateSource = 4
};

// Enum Niagara.ENiagaraNumericOutputTypeSelectionMode
enum class ENiagaraNumericOutputTypeSelectionMode : uint8 {
	ENiagaraNumericOutputTypeSelectionMode = 0,
	ENiagaraNumericOutputTypeSelectionMode = 1,
	ENiagaraNumericOutputTypeSelectionMode = 2,
	ENiagaraNumericOutputTypeSelectionMode = 3,
	ENiagaraNumericOutputTypeSelectionMode = 4
};

// Enum Niagara.ENiagaraVariantMode
enum class ENiagaraVariantMode : uint8 {
	ENiagaraVariantMode = 0,
	ENiagaraVariantMode = 1,
	ENiagaraVariantMode = 2,
	ENiagaraVariantMode = 3,
	ENiagaraVariantMode = 4
};

// Class Niagara.MovieSceneNiagaraTrack
struct UMovieSceneNiagaraTrack : UMovieSceneNameableTrack {
	struct TArray<Unknown> Sections; //  0x58 Size(10)
};

// Class Niagara.MovieSceneNiagaraParameterTrack
struct UMovieSceneNiagaraParameterTrack : UMovieSceneNiagaraTrack {
	struct Unknown Parameter; //  0x68 Size(28)
};

// Class Niagara.MovieSceneNiagaraSystemSpawnSection
struct UMovieSceneNiagaraSystemSpawnSection : UMovieSceneSection {
	enum class Unknow SectionStartBehavior; //  0xe0 Size(4)
	enum class Unknow SectionEvaluateBehavior; //  0xe4 Size(4)
	enum class Unknow SectionEndBehavior; //  0xe8 Size(4)
	enum class Unknow AgeUpdateMode; //  0xec Size(1)
};

// Class Niagara.MovieSceneNiagaraVectorParameterTrack
struct UMovieSceneNiagaraVectorParameterTrack : UMovieSceneNiagaraParameterTrack {
	int32_t ChannelsUsed; //  0x90 Size(4)
};

// Class Niagara.NiagaraActor
struct ANiagaraActor : UActor {
	struct Unknown NiagaraComponent; //  0x310 Size(8)
	char bDestroyOnSystemFinish; //  0x318 Size(1)

	void SetDestroyOnSystemFinish(char bShouldDestroyOnSystemFinis); // Function Niagara.NiagaraActor.SetDestroyOnSystemFinish(Final|RequiredAPI|Native|Public|BlueprintCallable) // <Game+0x1507e60>
};

// Class Niagara.NiagaraComponent
struct UNiagaraComponent : UFXSystemComponent {
	struct Unknown Asset; //  0x4b8 Size(8)
	enum class Unknow TickBehavior; //  0x4c0 Size(1)
	struct Unknown OverrideParameters; //  0x4c8 Size(108)
	char bForceSolo; //  0x5d0 Size(1)
	char bAutoDestroy; //  0x5fc Size(1)
	char bRenderingEnabled; //  0x5fc Size(1)
	char bAutoManageAttachment; //  0x5fc Size(1)
	char bAutoAttachWeldSimulatedBodies; //  0x5fc Size(1)
	float MaxTimeBeforeForceUpdateTransform; //  0x600 Size(4)
	struct FMulticastInlineDelegate OnSystemFinished; //  0x608 Size(10)
	struct TWeakObjectPtr<struct Unknown> AutoAttachParent; //  0x618 Size(8)
	struct FName AutoAttachSocketName; //  0x620 Size(8)
	enum class Unknow AutoAttachLocationRule; //  0x628 Size(1)
	enum class Unknow AutoAttachRotationRule; //  0x629 Size(1)
	enum class Unknow AutoAttachScaleRule; //  0x62a Size(1)

	void SetVariableVec4(struct FName InVariableName, struct Unknown& InValue); // Function Niagara.NiagaraComponent.SetVariableVec4(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <Game+0x1509290>
};

// Class Niagara.NiagaraComponentPool
struct UNiagaraComponentPool : Object {
	struct TMap<{}, {}>Unknown WorldParticleSystemPools; //  0x28 Size(50)
};

// Class Niagara.NiagaraDataInterfaceAudioSubmix
struct UNiagaraDataInterfaceAudioSubmix : UNiagaraDataInterface {
	struct Unknown Submix; //  0x30 Size(8)
};

// Class Niagara.NiagaraDataInterfaceAudioOs
struct UNiagaraDataInterfaceAudioOs : UNiagaraDataInterface {
	struct Unknown Submix; //  0x30 Size(8)
	int32_t Resolution; //  0x38 Size(4)
	float ScopeInMilliseconds; //  0x3c Size(4)
};

// Class Niagara.NiagaraDataInterfaceAudioSpectrum
struct UNiagaraDataInterfaceAudioSpectrum : UNiagaraDataInterfaceAudioSubmix {
	int32_t Resolution; //  0x38 Size(4)
	float MinimumFrequency; //  0x3c Size(4)
	float MaximumFrequency; //  0x40 Size(4)
	float NoiseFloorDb; //  0x44 Size(4)
};

// Class Niagara.NiagaraDataInterfaceCamera
struct UNiagaraDataInterfaceCamera : UNiagaraDataInterface {
	int32_t PlayerControllerIndex; //  0x30 Size(4)
};

// Class Niagara.NiagaraDataInterfaceCurveBase
struct UNiagaraDataInterfaceCurveBase : UNiagaraDataInterface {
	struct TArray<Unknown> ShaderLUT; //  0x30 Size(10)
	float LUTMinTime; //  0x40 Size(4)
	float LUTMaxTime; //  0x44 Size(4)
	float LUTInvTimeRange; //  0x48 Size(4)
	float LUTNumSamplesMinusOne; //  0x4c Size(4)
	char bUseLUT; //  0x50 Size(1)
};

// Class Niagara.NiagaraDataInterfaceColorCurve
struct UNiagaraDataInterfaceColorCurve : UNiagaraDataInterfaceCurveBase {
	struct Unknown RedCurve; //  0x58 Size(80)
	struct Unknown GreenCurve; //  0xd8 Size(80)
	struct Unknown BlueCurve; //  0x158 Size(80)
	struct Unknown AlphaCurve; //  0x1d8 Size(80)
};

// Class Niagara.NiagaraDataInterfaceCurlNoise
struct UNiagaraDataInterfaceCurlNoise : UNiagaraDataInterface {
	uint32_t Seed; //  0x30 Size(4)
};

// Class Niagara.NiagaraDataInterfaceCurve
struct UNiagaraDataInterfaceCurve : UNiagaraDataInterfaceCurveBase {
	struct Unknown Curve; //  0x58 Size(80)
};

// Class Niagara.NiagaraDataInterfaceExport
struct UNiagaraDataInterfaceExport : UNiagaraDataInterface {
	struct Unknown CallbackHandlerParameter; //  0x30 Size(28)
};

// Class Niagara.NiagaraDataInterfaceRWBase
struct UNiagaraDataInterfaceRWBase : UNiagaraDataInterface {
	struct TSet<Unknown> OutputShaderStages; //  0x30 Size(50)
	struct TSet<Unknown> IterationShaderStages; //  0x80 Size(50)
};

// Class Niagara.NiagaraDataInterfaceGrid2D
struct UNiagaraDataInterfaceGrid2D : UNiagaraDataInterfaceRWBase {
	int32_t NumCellsX; //  0xd0 Size(4)
	int32_t NumCellsY; //  0xd4 Size(4)
	int32_t NumCellsMaxAxis; //  0xd8 Size(4)
	int32_t NumAttributes; //  0xdc Size(4)
	char SetG; //  0xe0 Size(1)
	struct Unknown WorldBBoxSize; //  0xe4 Size(8)
};

// Class Niagara.NiagaraDataInterfaceGrid3D
struct UNiagaraDataInterfaceGrid3D : UNiagaraDataInterfaceRWBase {
	struct Unknown NumVoxels; //  0xd0 Size(c)
	float VoxelSize; //  0xdc Size(4)
	char SetG; //  0xe0 Size(1)
	struct Unknown WorldBBoxSize; //  0xe4 Size(c)
};

// Class Niagara.NiagaraDataInterfaceNeighborGri
struct UNiagaraDataInterfaceNeighborGri : UNiagaraDataInterfaceGrid3D {
	uint32_t MaxNeighborsPerVoxel; //  0xf0 Size(4)
};

// Class Niagara.NiagaraDataInterfaceParticleRead
struct UNiagaraDataInterfaceParticleRead : UNiagaraDataInterface {
	struct FString EmitterName; //  0x30 Size(10)
};

// Class Niagara.NiagaraDataInterfaceSkeletalMesh
struct UNiagaraDataInterfaceSkeletalMesh : UNiagaraDataInterface {
	struct Unknown Source; //  0x30 Size(8)
	struct Unknown MeshUserParameter; //  0x38 Size(28)
	struct Unknown SourceComponent; //  0x60 Size(8)
	enum class Unknow SkinningMode; //  0x68 Size(1)
	struct TArray<Unknown> SamplingRegions; //  0x70 Size(10)
	int32_t WholeMeshLOD; //  0x80 Size(4)
	struct TArray<Unknown> FilteredBones; //  0x88 Size(10)
	struct TArray<Unknown> FilteredSockets; //  0x98 Size(10)
	struct FName ExcludeBoneName; //  0xa8 Size(8)
	char bExcludeBone; //  0xb0 Size(1)
};

// Class Niagara.NiagaraDataInterfaceSpline
struct UNiagaraDataInterfaceSpline : UNiagaraDataInterface {
	struct Unknown Source; //  0x30 Size(8)
};

// Class Niagara.NiagaraDataInterfaceStaticMesh
struct UNiagaraDataInterfaceStaticMesh : UNiagaraDataInterface {
	struct Unknown DefaultMesh; //  0x30 Size(8)
	struct Unknown Source; //  0x38 Size(8)
	struct Unknown SourceComponent; //  0x40 Size(8)
	struct Unknown SectionFilter; //  0x48 Size(10)
};

// Class Niagara.NiagaraDataInterfaceTexture
struct UNiagaraDataInterfaceTexture : UNiagaraDataInterface {
	struct Unknown Texture; //  0x30 Size(8)
};

// Class Niagara.NiagaraDataInterfaceVector2DCurve
struct UNiagaraDataInterfaceVector2DCurve : UNiagaraDataInterfaceCurveBase {
	struct Unknown XCurve; //  0x58 Size(80)
	struct Unknown YCurve; //  0xd8 Size(80)
};

// Class Niagara.NiagaraDataInterfaceVector4Curve
struct UNiagaraDataInterfaceVector4Curve : UNiagaraDataInterfaceCurveBase {
	struct Unknown XCurve; //  0x58 Size(80)
	struct Unknown YCurve; //  0xd8 Size(80)
	struct Unknown ZCurve; //  0x158 Size(80)
	struct Unknown WCurve; //  0x1d8 Size(80)
};

// Class Niagara.NiagaraDataInterfaceVectorCurve
struct UNiagaraDataInterfaceVectorCurve : UNiagaraDataInterfaceCurveBase {
	struct Unknown XCurve; //  0x58 Size(80)
	struct Unknown YCurve; //  0xd8 Size(80)
	struct Unknown ZCurve; //  0x158 Size(80)
};

// Class Niagara.NiagaraDataInterfaceVectorField
struct UNiagaraDataInterfaceVectorField : UNiagaraDataInterface {
	struct Unknown Field; //  0x30 Size(8)
	char bTileX; //  0x38 Size(1)
	char bTileY; //  0x39 Size(1)
	char bTileZ; //  0x3a Size(1)
};

// Class Niagara.NiagaraDataInterfaceVolumeTexture
struct UNiagaraDataInterfaceVolumeTexture : UNiagaraDataInterface {
	struct Unknown Texture; //  0x30 Size(8)
};

// Class Niagara.NiagaraEffectType
struct UNiagaraEffectType : Object {
	enum class Unknow UpdateFrequency; //  0x28 Size(4)
	enum class Unknow CullReaction; //  0x2c Size(4)
	struct TArray<Unknown> DetailLevelScalabilitySettings; //  0x30 Size(10)
	struct Unknown SystemScalabilitySettings; //  0x40 Size(10)
	struct Unknown EmitterScalabilitySettings; //  0x50 Size(10)
};

// Class Niagara.NiagaraEmitter
struct UNiagaraEmitter : Object {
	char bLocalSpace; //  0x28 Size(1)
	char bDeterminism; //  0x29 Size(1)
	int32_t RandomSeed; //  0x2c Size(4)
	enum class Unknow AllocationMode; //  0x30 Size(1)
	int32_t PreAllocationCount; //  0x34 Size(4)
	struct Unknown UpdateScriptProps; //  0x38 Size(28)
	struct Unknown SpawnScriptProps; //  0x60 Size(28)
	struct Unknown EmitterSpawnScriptProps; //  0x88 Size(28)
	struct Unknown EmitterUpdateScriptProps; //  0xb0 Size(28)
	enum class Unknow SimTarget; //  0xd8 Size(1)
	struct Unknown FixedBounds; //  0xdc Size(1c)
	int32_t MinDetailLevel; //  0xf8 Size(4)
	int32_t MaxDetailLevel; //  0xfc Size(4)
	struct Unknown GlobalSpawnCountScaleOverrides; //  0x100 Size(14)
	struct Unknown Platforms; //  0x118 Size(20)
	struct Unknown ScalabilityOverrides; //  0x138 Size(10)
	char bInterpolatedSpawning; //  0x148 Size(1)
	char bFixedBounds; //  0x148 Size(1)
	char bUseMinDetailLevel; //  0x148 Size(1)
	char bUseMaxDetailLevel; //  0x148 Size(1)
	char bOverrideGlobalSpawnCountScale; //  0x148 Size(1)
	char bRequiresPersistentI; //  0x148 Size(1)
	float MaxDeltaTimePerTick; //  0x14c Size(4)
	uint32_t DefaultShaderStageIndex; //  0x150 Size(4)
	uint32_t MaxUpdateIterations; //  0x154 Size(4)
	struct TSet<Unknown> SpawnStages; //  0x158 Size(50)
	char bSimulationStagesEnabled; //  0x1a8 Size(1)
	char bDeprecatedShaderStagesEnabled; //  0x1a8 Size(1)
	char bLimitDeltaTime; //  0x1a8 Size(1)
	struct FString UniqueEmitterName; //  0x1b0 Size(10)
	struct TArray<Unknown> RendererProperties; //  0x1c0 Size(10)
	struct TArray<Unknown> EventHandlerScriptProps; //  0x1d0 Size(10)
	struct TArray<Unknown> SimulationStages; //  0x1e0 Size(10)
	struct Unknown GPUComputeScript; //  0x1f0 Size(8)
	struct TArray<Unknown> SharedEventGeneratorIds; //  0x1f8 Size(10)
};

// Class Niagara.NiagaraEventReceiverEmitterActi
struct UNiagaraEventReceiverEmitterActi : UNiagaraEventReceiverEmitterActi {
	uint32_t NumParticles; //  0x28 Size(4)
};

// Class Niagara.NiagaraRendererProperties
struct UNiagaraRendererProperties : UNiagaraMergeable {
	int32_t SortOrderHint; //  0x28 Size(4)
	char bIsEnabled; //  0x2c Size(1)
	char bMotionBlurEnabled; //  0x2d Size(1)
};

// Class Niagara.NiagaraLightRendererProperties
struct UNiagaraLightRendererProperties : UNiagaraRendererProperties {
	char bUseInverseSquaredFalloff; //  0x50 Size(1)
	char bAffectsTranslucency; //  0x50 Size(1)
	char bOverrideRenderingEnabled; //  0x50 Size(1)
	float RadiusScale; //  0x54 Size(4)
	struct Unknown ColorAdd; //  0x58 Size(c)
	struct Unknown LightRenderingEnabledBinding; //  0x68 Size(78)
	struct Unknown LightExponentBinding; //  0xe0 Size(78)
	struct Unknown PositionBinding; //  0x158 Size(78)
	struct Unknown ColorBinding; //  0x1d0 Size(78)
	struct Unknown RadiusBinding; //  0x248 Size(78)
	struct Unknown VolumetricScatteringBinding; //  0x2c0 Size(78)
};

// Class Niagara.NiagaraMeshRendererProperties
struct UNiagaraMeshRendererProperties : UNiagaraRendererProperties {
	struct Unknown ParticleMesh; //  0x50 Size(8)
	enum class Unknow SortMode; //  0x58 Size(1)
	char bOverrideMaterials; //  0x5c Size(1)
	char bSortOnlyWhenTranslucent; //  0x5c Size(1)
	struct TArray<Unknown> OverrideMaterials; //  0x60 Size(10)
	struct Unknown SubImageSize; //  0x70 Size(8)
	char bSubImageBlend; //  0x78 Size(1)
	enum class Unknow FacingMode; //  0x7c Size(1)
	char bLockedAxisEnable; //  0x80 Size(1)
	struct Unknown LockedAxis; //  0x84 Size(c)
	enum class Unknow LockedAxisSpace; //  0x90 Size(1)
	struct Unknown PositionBinding; //  0x98 Size(78)
	struct Unknown ColorBinding; //  0x110 Size(78)
	struct Unknown VelocityBinding; //  0x188 Size(78)
	struct Unknown MeshOrientationBinding; //  0x200 Size(78)
	struct Unknown ScaleBinding; //  0x278 Size(78)
	struct Unknown SubImageIndexBinding; //  0x2f0 Size(78)
	struct Unknown DynamicMaterialBinding; //  0x368 Size(78)
	struct Unknown DynamicMaterial1Binding; //  0x3e0 Size(78)
	struct Unknown DynamicMaterial2Binding; //  0x458 Size(78)
	struct Unknown DynamicMaterial3Binding; //  0x4d0 Size(78)
	struct Unknown MaterialRandomBinding; //  0x548 Size(78)
	struct Unknown CustomSortingBinding; //  0x5c0 Size(78)
	struct Unknown NormalizedAgeBinding; //  0x638 Size(78)
	struct Unknown CameraOffsetBinding; //  0x6b0 Size(78)
};

// Class Niagara.NiagaraParameterCollectionInstance
struct UNiagaraParameterCollectionInstance : Object {
	struct Unknown Collection; //  0x28 Size(8)
	struct TArray<Unknown> OverridenParameters; //  0x30 Size(10)
	struct Unknown ParameterStorage; //  0x40 Size(b8)

	void SetVectorParameter(struct FString InVariableName, struct Unknown InValue); // Function Niagara.NiagaraParameterCollectionInstance.SetVectorParameter(Final|Native|Public|HasDefaults|BlueprintCallable) // <Game+0x1514d50>
};

// Class Niagara.NiagaraParameterCollection
struct UNiagaraParameterCollection : Object {
	struct FName Namespace; //  0x28 Size(8)
	struct TArray<Unknown> Parameters; //  0x30 Size(10)
	struct Unknown DefaultInstance; //  0x40 Size(8)
	struct Unknown CompileId; //  0x48 Size(10)
};

// Class Niagara.NiagaraPrecompileContainer
struct UNiagaraPrecompileContainer : Object {
	struct TArray<Unknown> Scripts; //  0x28 Size(10)
	struct Unknown System; //  0x38 Size(8)
};

// Class Niagara.NiagaraPreviewAxis_InterpParamBase
struct UNiagaraPreviewAxis_InterpParamBase : UNiagaraPreviewAxis {
	struct FName Param; //  0x28 Size(8)
	int32_t Count; //  0x30 Size(4)
};

// Class Niagara.NiagaraPreviewAxis_InterpParamInt32
struct UNiagaraPreviewAxis_InterpParamInt32 : UNiagaraPreviewAxis_InterpParamBase {
	int32_t Min; //  0x38 Size(4)
	int32_t MAX; //  0x3c Size(4)
};

// Class Niagara.NiagaraPreviewAxis_InterpParamFloat
struct UNiagaraPreviewAxis_InterpParamFloat : UNiagaraPreviewAxis_InterpParamBase {
	float Min; //  0x38 Size(4)
	float MAX; //  0x3c Size(4)
};

// Class Niagara.NiagaraPreviewAxis_InterpParamVector2D
struct UNiagaraPreviewAxis_InterpParamVector2D : UNiagaraPreviewAxis_InterpParamBase {
	struct Unknown Min; //  0x38 Size(8)
	struct Unknown MAX; //  0x40 Size(8)
};

// Class Niagara.NiagaraPreviewAxis_InterpParamVector
struct UNiagaraPreviewAxis_InterpParamVector : UNiagaraPreviewAxis_InterpParamBase {
	struct Unknown Min; //  0x38 Size(c)
	struct Unknown MAX; //  0x44 Size(c)
};

// Class Niagara.NiagaraPreviewAxis_InterpParamVector4
struct UNiagaraPreviewAxis_InterpParamVector4 : UNiagaraPreviewAxis_InterpParamBase {
	struct Unknown Min; //  0x40 Size(10)
	struct Unknown MAX; //  0x50 Size(10)
};

// Class Niagara.NiagaraPreviewAxis_InterpParamLinearColor
struct UNiagaraPreviewAxis_InterpParamLinearColor : UNiagaraPreviewAxis_InterpParamBase {
	struct Unknown Min; //  0x38 Size(10)
	struct Unknown MAX; //  0x48 Size(10)
};

// Class Niagara.NiagaraPreviewGrid
struct ANiagaraPreviewGrid : UActor {
	struct Unknown System; //  0x310 Size(8)
	enum class Unknow ResetMode; //  0x318 Size(1)
	struct Unknown PreviewAxisX; //  0x320 Size(8)
	struct Unknown PreviewAxisY; //  0x328 Size(8)
	struct Unknown* PreviewClass; //  0x330 Size(8)
	float SpacingX; //  0x338 Size(4)
	float SpacingY; //  0x33c Size(4)
	int32_t NumX; //  0x340 Size(4)
	int32_t NumY; //  0x344 Size(4)
	struct TArray<Unknown> PreviewComponents; //  0x348 Size(10)

	void SetPaused(char bPaused); // Function Niagara.NiagaraPreviewGrid.SetPaused(Final|Native|Public|BlueprintCallable) // <Game+0x151af30>
};

// Class Niagara.NiagaraRibbonRendererProperties
struct UNiagaraRibbonRendererProperties : UNiagaraRendererProperties {
	struct Unknown Material; //  0x50 Size(8)
	struct Unknown MaterialUserParamBinding; //  0x58 Size(28)
	enum class Unknow FacingMode; //  0x80 Size(1)
	float UV0TilingDistance; //  0x84 Size(4)
	struct Unknown UV0Scale; //  0x88 Size(8)
	struct Unknown UV0Offset; //  0x90 Size(8)
	enum class Unknow UV0AgeOffsetMode; //  0x98 Size(1)
	float UV1TilingDistance; //  0x9c Size(4)
	struct Unknown UV1Scale; //  0xa0 Size(8)
	struct Unknown UV1Offset; //  0xa8 Size(8)
	enum class Unknow UV1AgeOffsetMode; //  0xb0 Size(1)
	enum class Unknow Draw; //  0xb1 Size(1)
	float CurveTension; //  0xb4 Size(4)
	enum class Unknow TessellationMode; //  0xb8 Size(1)
	int32_t TessellationFactor; //  0xbc Size(4)
	char bUseConstantFactor; //  0xc0 Size(1)
	float TessellationAngle; //  0xc4 Size(4)
	char bScreenSpaceTessellation; //  0xc8 Size(1)
	struct Unknown PositionBinding; //  0xd0 Size(78)
	struct Unknown ColorBinding; //  0x148 Size(78)
	struct Unknown VelocityBinding; //  0x1c0 Size(78)
	struct Unknown NormalizedAgeBinding; //  0x238 Size(78)
	struct Unknown RibbonTwistBinding; //  0x2b0 Size(78)
	struct Unknown RibbonWidthBinding; //  0x328 Size(78)
	struct Unknown RibbonFacingBinding; //  0x3a0 Size(78)
	struct Unknown RibbonIdBinding; //  0x418 Size(78)
	struct Unknown RibbonLinkOrderBinding; //  0x490 Size(78)
	struct Unknown MaterialRandomBinding; //  0x508 Size(78)
	struct Unknown DynamicMaterialBinding; //  0x580 Size(78)
	struct Unknown DynamicMaterial1Binding; //  0x5f8 Size(78)
	struct Unknown DynamicMaterial2Binding; //  0x670 Size(78)
	struct Unknown DynamicMaterial3Binding; //  0x6e8 Size(78)
};

// Class Niagara.NiagaraScript
struct UNiagaraScript : Object {
	enum class Unknow Usage; //  0x28 Size(1)
	int32_t UsageIndex; //  0x2c Size(4)
	struct Unknown UsageId; //  0x30 Size(10)
	struct Unknown RapidIterationParameters; //  0x40 Size(b8)
	struct Unknown ScriptExecutionParamStore; //  0xf8 Size(d8)
	struct TArray<Unknown> ScriptExecutionBoundParameters; //  0x1d0 Size(10)
	struct Unknown CachedScriptVMId; //  0x1e0 Size(48)
	struct Unknown CachedScriptVM; //  0x3d8 Size(128)
	struct TArray<Unknown> CachedParameterCollectionReferences; //  0x500 Size(10)
	struct TArray<Unknown> CachedDefaultDataInterfaces; //  0x510 Size(10)

	void RaiseOnGPUCompilationComplete(); // Function Niagara.NiagaraScript.RaiseOnGPUCompilationComplete(Final|Native|Public) // <Game+0x151af10>
};

// Class Niagara.NiagaraSettings
struct UNiagaraSettings : UDeveloperSettings {
	struct TArray<Unknown> AdditionalParameterTypes; //  0x38 Size(10)
	struct TArray<Unknown> AdditionalPayloadTypes; //  0x48 Size(10)
	struct TArray<Unknown> AdditionalParameterEnums; //  0x58 Size(10)
	struct Unknown DefaultEffectType; //  0x68 Size(18)
	struct TArray<Unknown> QualityLevels; //  0x80 Size(10)
	struct Unknown DefaultEffectTypePtr; //  0x90 Size(8)
};

// Class Niagara.NiagaraSimulationStageBase
struct UNiagaraSimulationStageBase : UNiagaraMergeable {
	struct Unknown Script; //  0x28 Size(8)
	struct FName SimulationStageName; //  0x30 Size(8)
};

// Class Niagara.NiagaraSimulationStageGeneric
struct UNiagaraSimulationStageGeneric : UNiagaraSimulationStageBase {
	enum class Unknow IterationSource; //  0x38 Size(1)
	int32_t Iterations; //  0x3c Size(4)
	char bSpawnOnly; //  0x40 Size(1)
	struct Unknown DataInterface; //  0x48 Size(28)
};

// Class Niagara.NiagaraSpriteRendererProperties
struct UNiagaraSpriteRendererProperties : UNiagaraRendererProperties {
	struct Unknown Material; //  0x50 Size(8)
	struct Unknown MaterialUserParamBinding; //  0x58 Size(28)
	enum class Unknow Alignment; //  0x80 Size(1)
	enum class Unknow FacingMode; //  0x81 Size(1)
	struct Unknown PivotInUVSpace; //  0x84 Size(8)
	enum class Unknow SortMode; //  0x8c Size(1)
	struct Unknown SubImageSize; //  0x90 Size(8)
	char bSubImageBlend; //  0x98 Size(1)
	char bRemoveHMDRollInVR; //  0x98 Size(1)
	char bSortOnlyWhenTranslucent; //  0x98 Size(1)
	float MinFacingCameraBlendDeGeneri; //  0x9c Size(4)
	float MaxFacingCameraBlend; //  0xa0 Size(4)
	struct Unknown PositionBinding; //  0xa8 Size(78)
	struct Unknown ColorBinding; //  0x120 Size(78)
	struct Unknown VelocityBinding; //  0x198 Size(78)
	struct Unknown SpriteRotationBinding; //  0x210 Size(78)
	struct Unknown SpriteSizeBinding; //  0x288 Size(78)
	struct Unknown SpriteFacingBinding; //  0x300 Size(78)
	struct Unknown SpriteAlignmentBinding; //  0x378 Size(78)
	struct Unknown SubImageIndexBinding; //  0x3f0 Size(78)
	struct Unknown DynamicMaterialBinding; //  0x468 Size(78)
	struct Unknown DynamicMaterial1Binding; //  0x4e0 Size(78)
	struct Unknown DynamicMaterial2Binding; //  0x558 Size(78)
	struct Unknown DynamicMaterial3Binding; //  0x5d0 Size(78)
	struct Unknown CameraOffsetBinding; //  0x648 Size(78)
	struct Unknown UVScaleBinding; //  0x6c0 Size(78)
	struct Unknown MaterialRandomBinding; //  0x738 Size(78)
	struct Unknown CustomSortingBinding; //  0x7b0 Size(78)
	struct Unknown NormalizedAgeBinding; //  0x828 Size(78)
};

// Class Niagara.NiagaraSystem
struct UNiagaraSystem : UFXSystemAsset {
	char bDumpDebugSystemInfo; //  0x31 Size(1)
	char bDumpDebugEmitterInfo; //  0x32 Size(1)
	char bFixedBounds; //  0x34 Size(1)
	struct Unknown EffectType; //  0x38 Size(8)
	char bOverrideScalabilitySettings; //  0x40 Size(1)
	struct TArray<Unknown> ScalabilityOverrides; //  0x48 Size(10)
	struct Unknown SystemScalabilityOv; //  0x58 Size(10)
	struct TArray<Unknown> EmitterHandles; //  0x68 Size(10)
	struct TArray<Unknown> ParameterCollectionOverrides; //  0x78 Size(10)
	struct Unknown SystemSpawnScript; //  0x88 Size(8)
	struct Unknown SystemUpdateScript; //  0x90 Size(8)
	struct Unknown SystemCompiledData; //  0xa8 Size(258)
	struct Unknown ExposedParameters; //  0x300 Size(108)
	struct Unknown FixedBounds; //  0x408 Size(1c)
	char bAutoDeactivate; //  0x424 Size(1)
	float WarmupTime; //  0x428 Size(4)
	int32_t WarmupTickCount; //  0x42c Size(4)
	float WarmupTickDelta; //  0x430 Size(4)
	char bHasSystemScriptDIsWithPerInstanceData; //  0x434 Size(1)
	struct TArray<Unknown> User; //  0x438 Size(10)
};

