// Enum Niagara.ENiagaraSystemSpawnSectionEndBehavior
enum class ENiagaraSystemSpawnSectionEndBehavior : uint8_t {
	ENiagaraSystemSpawnSectionEndBehavior = 0,
	ENiagaraSystemSpawnSectionEndBehavior = 1,
	ENiagaraSystemSpawnSectionEndBehavior = 2,
	ENiagaraSystemSpawnSectionEndBehavior = 3,
};

// Enum Niagara.ENiagaraSystemSpawnSectionEvaluateBehavior
enum class ENiagaraSystemSpawnSectionEvaluateBehavior : uint8_t {
	ENiagaraSystemSpawnSectionEvaluateBehavior = 0,
	ENiagaraSystemSpawnSectionEvaluateBehavior = 1,
	ENiagaraSystemSpawnSectionEvaluateBehavior = 2,
};

// Enum Niagara.ENiagaraSystemSpawnSectionStartBehavior
enum class ENiagaraSystemSpawnSectionStartBehavior : uint8_t {
	ENiagaraSystemSpawnSectionStartBehavior = 0,
	ENiagaraSystemSpawnSectionStartBehavior = 1,
};

// Enum Niagara.ENiagaraCollisionMode
enum class ENiagaraCollisionMode : uint8_t {
	ENiagaraCollisionMode = 0,
	ENiagaraCollisionMode = 1,
	ENiagaraCollisionMode = 2,
	ENiagaraCollisionMode = 3,
	ENiagaraCollisionMode = 4,
};

// Enum Niagara.ENiagaraLegacyTrailWidthMode
enum class ENiagaraLegacyTrailWidthMode : uint8_t {
	ENiagaraLegacyTrailWidthMode = 0,
	ENiagaraLegacyTrailWidthMode = 1,
	ENiagaraLegacyTrailWidthMode = 2,
	ENiagaraLegacyTrailWidthMode = 3,
};

// Enum Niagara.ENiagaraIterationSource
enum class ENiagaraIterationSource : uint8_t {
	ENiagaraIterationSource = 0,
	ENiagaraIterationSource = 1,
	ENiagaraIterationSource = 2,
};

// Enum Niagara.ENiagaraScriptGroup
enum class ENiagaraScriptGroup : uint8_t {
	ENiagaraScriptGroup = 0,
	ENiagaraScriptGroup = 1,
	ENiagaraScriptGroup = 2,
	ENiagaraScriptGroup = 3,
};

// Enum Niagara.ENiagaraScriptUsage
enum class ENiagaraScriptUsage : uint8_t {
	ENiagaraScriptUsage = 0,
	ENiagaraScriptUsage = 1,
	ENiagaraScriptUsage = 2,
	ENiagaraScriptUsage = 3,
	ENiagaraScriptUsage = 4,
	ENiagaraScriptUsage = 5,
	ENiagaraScriptUsage = 6,
	ENiagaraScriptUsage = 7,
	ENiagaraScriptUsage = 8,
	ENiagaraScriptUsage = 9,
	ENiagaraScriptUsage = 10,
	ENiagaraScriptUsage = 11,
	ENiagaraScriptUsage = 12,
	ENiagaraScriptUsage = 13,
};

// Enum Niagara.ENiagaraScriptCompileStatus
enum class ENiagaraScriptCompileStatus : uint8_t {
	ENiagaraScriptCompileStatus = 0,
	ENiagaraScriptCompileStatus = 1,
	ENiagaraScriptCompileStatus = 2,
	ENiagaraScriptCompileStatus = 3,
	ENiagaraScriptCompileStatus = 4,
	ENiagaraScriptCompileStatus = 5,
	ENiagaraScriptCompileStatus = 6,
	ENiagaraScriptCompileStatus = 7,
};

// Enum Niagara.ENiagaraInputNodeUsage
enum class ENiagaraInputNodeUsage : uint8_t {
	ENiagaraInputNodeUsage = 0,
	ENiagaraInputNodeUsage = 1,
	ENiagaraInputNodeUsage = 2,
	ENiagaraInputNodeUsage = 3,
	ENiagaraInputNodeUsage = 4,
	ENiagaraInputNodeUsage = 5,
	ENiagaraInputNodeUsage = 6,
};

// Enum Niagara.ENiagaraDataSetType
enum class ENiagaraDataSetType : uint8_t {
	ENiagaraDataSetType = 0,
	ENiagaraDataSetType = 1,
	ENiagaraDataSetType = 2,
	ENiagaraDataSetType = 3,
};

// Enum Niagara.ENiagaraAgeUpdateMode
enum class ENiagaraAgeUpdateMode : uint8_t {
	ENiagaraAgeUpdateMode = 0,
	ENiagaraAgeUpdateMode = 1,
	ENiagaraAgeUpdateMode = 2,
	ENiagaraAgeUpdateMode = 3,
};

// Enum Niagara.ENiagaraSimTarget
enum class ENiagaraSimTarget : uint8_t {
	ENiagaraSimTarget = 0,
	ENiagaraSimTarget = 1,
	ENiagaraSimTarget = 2,
};

// Enum Niagara.ENiagaraDefaultMode
enum class ENiagaraDefaultMode : uint8_t {
	ENiagaraDefaultMode = 0,
	ENiagaraDefaultMode = 1,
	ENiagaraDefaultMode = 2,
	ENiagaraDefaultMode = 3,
};

// Enum Niagara.ENiagaraTickBehavior
enum class ENiagaraTickBehavior : uint8_t {
	ENiagaraTickBehavior = 0,
	ENiagaraTickBehavior = 1,
	ENiagaraTickBehavior = 2,
	ENiagaraTickBehavior = 3,
	ENiagaraTickBehavior = 4,
};

// Enum Niagara.ENCPoolMethod
enum class ENCPoolMethod : uint8_t {
	ENCPoolMethod = 0,
	ENCPoolMethod = 1,
	ENCPoolMethod = 2,
	ENCPoolMethod = 3,
	ENCPoolMethod = 4,
	ENCPoolMethod = 5,
};

// Enum Niagara.ENDISkeletalMesh_SkinningMng
enum class ENDISkeletalMesh_SkinningMng : uint8_t {
	ENDISkeletalMesh_SkinningModeg = 255,
	ENDISkeletalMesh_SkinningModeg = 0,
	ENDISkeletalMesh_SkinningMng = 1,
	ENDISkeletalMesh_Skinning = 2,
	ENDISkeletalMesh_Skinning = 256,
};

// Enum Niagara.ENiagaraScalabilityUpdateFrequency
enum class ENiagaraScalabilityUpdateFrequency : uint8_t {
	ENiagaraScalabilityUpdateFrequency = 0,
	ENiagaraScalabilityUpdateFrequency = 1,
	ENiagaraScalabilityUpdateFrequency = 2,
	ENiagaraScalabilityUpdateFrequency = 3,
	ENiagaraScalabilityUpdateFrequency = 4,
	ENiagaraScalabilityUpdateFrequency = 5,
};

// Enum Niagara.ENiagaraCullReaction
enum class ENiagaraCullReaction : uint8_t {
	ENiagaraCullReaction = 0,
	ENiagaraCullReaction = 1,
	ENiagaraCullReaction = 2,
	ENiagaraCullReaction = 3,
	ENiagaraCullReaction = 4,
};

// Enum Niagara.EParticleAllocationMode
enum class EParticleAllocationMode : uint8_t {
	EParticleAllocationMode = 0,
	EParticleAllocationMode = 1,
	EParticleAllocationMode = 2,
};

// Enum Niagara.EScriptExecutionMode
enum class EScriptExecutionMode : uint8_t {
	EScriptExecutionMode = 0,
	EScriptExecutionMode = 1,
	EScriptExecutionMode = 2,
	EScriptExecutionMode = 3,
};

// Enum Niagara.ENiagaraSortMode
enum class ENiagaraSortMode : uint8_t {
	ENiagaraSortMode = 0,
	ENiagaraSortMode = 1,
	ENiagaraSortMode = 2,
	ENiagaraSortMode = 3,
	ENiagaraSortMode = 4,
	ENiagaraSortMode = 5,
};

// Enum Niagara.ENiagaraMeshLockedAxisSpace
enum class ENiagaraMeshLockedAxisSpace : uint8_t {
	ENiagaraMeshLockedAxisSpace = 0,
	ENiagaraMeshLockedAxisSpace = 1,
	ENiagaraMeshLockedAxisSpace = 2,
	ENiagaraMeshLockedAxisSpace = 3,
};

// Enum Niagara.ENiagaraMeshFacingMode
enum class ENiagaraMeshFacingMode : uint8_t {
	ENiagaraMeshFacingMode = 0,
	ENiagaraMeshFacingMode = 1,
	ENiagaraMeshFacingMode = 2,
	ENiagaraMeshFacingMode = 3,
	ENiagaraMeshFacingMode = 4,
};

// Enum Niagara.ENiagaraPlatformSetState
enum class ENiagaraPlatformSetState : uint8_t {
	ENiagaraPlatformSetState = 0,
	ENiagaraPlatformSetState = 1,
	ENiagaraPlatformSetState = 2,
	ENiagaraPlatformSetState = 3,
	ENiagaraPlatformSetState = 4,
};

// Enum Niagara.ENiagaraPlatformSelectionState
enum class ENiagaraPlatformSelectionState : uint8_t {
	ENiagaraPlatformSelectionState = 0,
	ENiagaraPlatformSelectionState = 1,
	ENiagaraPlatformSelectionState = 2,
	ENiagaraPlatformSelectionState = 3,
};

// Enum Niagara.ENiagaraPreviewGridResetMode
enum class ENiagaraPreviewGridResetMode : uint8_t {
	ENiagaraPreviewGridResetMode = 0,
	ENiagaraPreviewGridResetMode = 1,
	ENiagaraPreviewGridResetMode = 2,
	ENiagaraPreviewGridResetMode = 3,
};

// Enum Niagara.ENiagaraRibbonTessellationMode
enum class ENiagaraRibbonTessellationMode : uint8_t {
	ENiagaraRibbonTessellationMode = 0,
	ENiagaraRibbonTessellationMode = 1,
	ENiagaraRibbonTessellationMode = 2,
	ENiagaraRibbonTessellationMode = 3,
};

// Enum Niagara.ENiagaraRibbonDrawDirection
enum class ENiagaraRibbonDrawDirection : uint8_t {
	ENiagaraRibbonDrawDirection = 0,
	ENiagaraRibbonDrawDirection = 1,
	ENiagaraRibbonDrawDirection = 2,
};

// Enum Niagara.ENiagaraRibbonAgeOffsetMode
enum class ENiagaraRibbonAgeOffsetMode : uint8_t {
	ENiagaraRibbonAgeOffsetMode = 0,
	ENiagaraRibbonAgeOffsetMode = 1,
	ENiagaraRibbonAgeOffsetMode = 2,
};

// Enum Niagara.ENiagaraRibbonFacingMode
enum class ENiagaraRibbonFacingMode : uint8_t {
	ENiagaraRibbonFacingMode = 0,
	ENiagaraRibbonFacingMode = 1,
	ENiagaraRibbonFacingMode = 2,
	ENiagaraRibbonFacingMode = 3,
};

// Enum Niagara.ENiagaraModuleDependencyScriptConstraint
enum class ENiagaraModuleDependencyScriptConstraint : uint8_t {
	ENiagaraModuleDependencyScriptConstraint = 0,
	ENiagaraModuleDependencyScriptConstraint = 1,
	ENiagaraModuleDependencyScriptConstraint = 2,
};

// Enum Niagara.ENiagaraModuleDependencyType
enum class ENiagaraModuleDependencyType : uint8_t {
	ENiagaraModuleDependencyType = 0,
	ENiagaraModuleDependencyType = 1,
	ENiagaraModuleDependencyType = 2,
};

// Enum Niagara.EUnusedAttributeBehaviour
enum class EUnusedAttributeBehaviour : uint8_t {
	EUnusedAttributeBehaviour = 0,
	EUnusedAttributeBehaviour = 1,
	EUnusedAttributeBehaviour = 2,
	EUnusedAttributeBehaviour = 3,
	EUnusedAttributeBehaviour = 4,
	EUnusedAttributeBehaviour = 5,
};

// Enum Niagara.ENiagaraSpriteFacingMode
enum class ENiagaraSpriteFacingMode : uint8_t {
	ENiagaraSpriteFacingMode = 0,
	ENiagaraSpriteFacingMode = 1,
	ENiagaraSpriteFacingMode = 2,
	ENiagaraSpriteFacingMode = 3,
	ENiagaraSpriteFacingMode = 4,
	ENiagaraSpriteFacingMode = 5,
};

// Enum Niagara.ENiagaraSpriteAlignment
enum class ENiagaraSpriteAlignment : uint8_t {
	ENiagaraSpriteAlignment = 0,
	ENiagaraSpriteAlignment = 1,
	ENiagaraSpriteAlignment = 2,
	ENiagaraSpriteAlignment = 3,
};

// Enum Niagara.ENiagaraParameterPanelCategory
enum class ENiagaraParameterPanelCategory : uint8_t {
	ENiagaraParameterPanelCategory = 0,
	ENiagaraParameterPanelCategory = 1,
	ENiagaraParameterPanelCategory = 2,
	ENiagaraParameterPanelCategory = 3,
	ENiagaraParameterPanelCategory = 4,
	ENiagaraParameterPanelCategory = 5,
	ENiagaraParameterPanelCategory = 6,
	ENiagaraParameterPanelCategory = 7,
	ENiagaraParameterPanelCategory = 8,
	ENiagaraParameterPanelCategory = 9,
	ENiagaraParameterPanelCategory = 10,
	ENiagaraParameterPanelCategory = 11,
	ENiagaraParameterPanelCategory = 12,
	ENiagaraParameterPanelCategory = 13,
	ENiagaraParameterPanelCategory = 14,
};

// Enum Niagara.ENiagaraScriptParameterUsage
enum class ENiagaraScriptParameterUsage : uint8_t {
	ENiagaraScriptParameterUsage = 0,
	ENiagaraScriptParameterUsage = 1,
	ENiagaraScriptParameterUsage = 2,
	ENiagaraScriptParameterUsage = 3,
	ENiagaraScriptParameterUsage = 4,
	ENiagaraScriptParameterUsage = 5,
	ENiagaraScriptParameterUsage = 6,
	ENiagaraScriptParameterUsage = 7,
};

// Enum Niagara.ENiagaraParameterScope
enum class ENiagaraParameterScope : uint8_t {
	ENiagaraParameterScope = 0,
	ENiagaraParameterScope = 1,
	ENiagaraParameterScope = 2,
	ENiagaraParameterScope = 3,
	ENiagaraParameterScope = 4,
	ENiagaraParameterScope = 5,
	ENiagaraParameterScope = 6,
	ENiagaraParameterScope = 7,
	ENiagaraParameterScope = 8,
	ENiagaraParameterScope = 9,
	ENiagaraParameterScope = 10,
	ENiagaraParameterScope = 11,
	ENiagaraParameterScope = 12,
	ENiagaraParameterScope = 13,
	ENiagaraParameterScope = 14,
	ENiagaraParameterScope = 15,
};

// Enum Niagara.ENiagaraExecutionState
enum class ENiagaraExecutionState : uint8_t {
	ENiagaraExecutionState = 0,
	ENiagaraExecutionState = 1,
	ENiagaraExecutionState = 2,
	ENiagaraExecutionState = 3,
	ENiagaraExecutionState = 4,
	ENiagaraExecutionState = 5,
	ENiagaraExecutionState = 6,
};

// Enum Niagara.ENiagaraExecutionStateSource
enum class ENiagaraExecutionStateSource : uint8_t {
	ENiagaraExecutionStateSource = 0,
	ENiagaraExecutionStateSource = 1,
	ENiagaraExecutionStateSource = 2,
	ENiagaraExecutionStateSource = 3,
	ENiagaraExecutionStateSource = 4,
};

// Enum Niagara.ENiagaraNumericOutputTypeSelectionMode
enum class ENiagaraNumericOutputTypeSelectionMode : uint8_t {
	ENiagaraNumericOutputTypeSelectionMode = 0,
	ENiagaraNumericOutputTypeSelectionMode = 1,
	ENiagaraNumericOutputTypeSelectionMode = 2,
	ENiagaraNumericOutputTypeSelectionMode = 3,
	ENiagaraNumericOutputTypeSelectionMode = 4,
};

// Enum Niagara.ENiagaraVariantMode
enum class ENiagaraVariantMode : uint8_t {
	ENiagaraVariantMode = 0,
	ENiagaraVariantMode = 1,
	ENiagaraVariantMode = 2,
	ENiagaraVariantMode = 3,
	ENiagaraVariantMode = 4,
};

// Class Niagara.MovieSceneNiagaraTrack
class UMovieSceneNiagaraTrack : public UMovieSceneNameableTrack {

public:

	struct TArray<Unknown> Sections; // 0x58 (16)
};

// Class Niagara.MovieSceneNiagaraParameterTrack
class UMovieSceneNiagaraParameterTrack : public UMovieSceneNiagaraTrack {

public:

	struct Unknown Parameter; // 0x68 (40)
};

// Class Niagara.MovieSceneNiagaraSystemSpawnSection
class UMovieSceneNiagaraSystemSpawnSection : public UMovieSceneSection {

public:

	enum class Unknow SectionStartBehavior; // 0xE0 (4)
	enum class Unknow SectionEvaluateBehavior; // 0xE4 (4)
	enum class Unknow SectionEndBehavior; // 0xE8 (4)
	enum class Unknow AgeUpdateMode; // 0xEC (1)
};

// Class Niagara.MovieSceneNiagaraVectorParameterTrack
class UMovieSceneNiagaraVectorParameterTrack : public UMovieSceneNiagaraParameterTrack {

public:

	int32_t ChannelsUsed; // 0x90 (4)
};

// Class Niagara.NiagaraActor
class ANiagaraActor : public UActor {

public:

	struct Unknown NiagaraComponent; // 0x310 (8)
	char bDestroyOnSystemFinish : 0; // 0x318 (1)

	void SetDestroyOnSystemFinish(char bShouldDestroyOnSystemFinish); // Function Niagara.NiagaraActor.SetDestroyOnSystemFinish(Final|RequiredAPI|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15092B0>
	void OnNiagaraSystemFinished(struct Unknown FinishedComponent); // Function Niagara.NiagaraActor.OnNiagaraSystemFinished(Final|Native|Private) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508E40>
};

// Class Niagara.NiagaraComponent
class UNiagaraComponent : public UFXSystemComponent {

public:

	struct Unknown Asset; // 0x4B8 (8)
	enum class Unknow TickBehavior; // 0x4C0 (1)
	struct Unknown OverrideParameters; // 0x4C8 (264)
	char bForceSolo : 0; // 0x5D0 (1)
	char bAutoDestroy : 0; // 0x5FC (1)
	char bRenderingEnabled : 0; // 0x5FC (1)
	char bAutoManageAttachment : 0; // 0x5FC (1)
	char bAutoAttachWeldSimulatedBodies : 0; // 0x5FC (1)
	float MaxTimeBeforeForceUpdateTransform; // 0x600 (4)
	struct FMulticastInlineDelegate OnSystemFinished; // 0x608 (16)
	struct TWeakObjectPtr<struct Unknown> AutoAttachParent; // 0x618 (8)
	struct FName AutoAttachSocketName; // 0x620 (8)
	enum class Unknow AutoAttachLocationRule; // 0x628 (1)
	enum class Unknow AutoAttachRotationRule; // 0x629 (1)
	enum class Unknow AutoAttachScaleRule; // 0x62A (1)

	void SetVariableVec4(struct FName InVariableName, struct Unknown& InValue); // Function Niagara.NiagaraComponent.SetVariableVec4(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x150A6E0>
	void SetVariableVec3(struct FName InVariableName, struct Unknown InValue); // Function Niagara.NiagaraComponent.SetVariableVec3(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x150A610>
	void SetVariableVec2(struct FName InVariableName, struct Unknown InValue); // Function Niagara.NiagaraComponent.SetVariableVec2(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x150A550>
	void SetVariableQuat(struct FName InVariableName, struct Unknown& InValue); // Function Niagara.NiagaraComponent.SetVariableQuat(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x150A480>
	void SetVariableObject(struct FName InVariableName, struct Unknown Object); // Function Niagara.NiagaraComponent.SetVariableObject(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x150A3C0>
	void SetVariableMaterial(struct FName InVariableName, struct Unknown Object); // Function Niagara.NiagaraComponent.SetVariableMaterial(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x150A300>
	void SetVariableLinearColor(struct FName InVariableName, struct Unknown& InValue); // Function Niagara.NiagaraComponent.SetVariableLinearColor(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x150A230>
	void SetVariableInt(struct FName InVariableName, int32_t InValue); // Function Niagara.NiagaraComponent.SetVariableInt(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x150A170>
	void SetVariableFloat(struct FName InVariableName, float InValue); // Function Niagara.NiagaraComponent.SetVariableFloat(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x150A0A0>
	void SetVariableBool(struct FName InVariableName, char InValue); // Function Niagara.NiagaraComponent.SetVariableBool(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509FD0>
	void SetVariableActor(struct FName InVariableName, struct Unknown Actor); // Function Niagara.NiagaraComponent.SetVariableActor(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509F10>
	void SetSeekDelta(float InSeekDelta); // Function Niagara.NiagaraComponent.SetSeekDelta(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509E90>
	void SetRenderingEnabled(char bInRenderingEnabled); // Function Niagara.NiagaraComponent.SetRenderingEnabled(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509E00>
	void SetPreviewLODDistance(char bEnablePreviewLODDistance, float PreviewLODDistance); // Function Niagara.NiagaraComponent.SetPreviewLODDistance(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509D30>
	void SetPaused(char bInPaused); // Function Niagara.NiagaraComponent.SetPaused(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509CA0>
	void SetNiagaraVariableVec4(struct FString InVariableName, struct Unknown& InValue); // Function Niagara.NiagaraComponent.SetNiagaraVariableVec4(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509BA0>
	void SetNiagaraVariableVec3(struct FString InVariableName, struct Unknown InValue); // Function Niagara.NiagaraComponent.SetNiagaraVariableVec3(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509AB0>
	void SetNiagaraVariableVec2(struct FString InVariableName, struct Unknown InValue); // Function Niagara.NiagaraComponent.SetNiagaraVariableVec2(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15099D0>
	void SetNiagaraVariableQuat(struct FString InVariableName, struct Unknown& InValue); // Function Niagara.NiagaraComponent.SetNiagaraVariableQuat(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15098E0>
	void SetNiagaraVariableObject(struct FString InVariableName, struct Unknown Object); // Function Niagara.NiagaraComponent.SetNiagaraVariableObject(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509450>
	void SetNiagaraVariableLinearColor(struct FString InVariableName, struct Unknown& InValue); // Function Niagara.NiagaraComponent.SetNiagaraVariableLinearColor(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15097F0>
	void SetNiagaraVariableInt(struct FString InVariableName, int32_t InValue); // Function Niagara.NiagaraComponent.SetNiagaraVariableInt(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509710>
	void SetNiagaraVariableFloat(struct FString InVariableName, float InValue); // Function Niagara.NiagaraComponent.SetNiagaraVariableFloat(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509620>
	void SetNiagaraVariableBool(struct FString InVariableName, char InValue); // Function Niagara.NiagaraComponent.SetNiagaraVariableBool(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509530>
	void SetNiagaraVariableActor(struct FString InVariableName, struct Unknown Actor); // Function Niagara.NiagaraComponent.SetNiagaraVariableActor(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509450>
	void SetMaxSimTime(float InMaxTime); // Function Niagara.NiagaraComponent.SetMaxSimTime(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15093D0>
	void SetForceSolo(char bInForceSolo); // Function Niagara.NiagaraComponent.SetForceSolo(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509340>
	void SetDesiredAge(float InDesiredAge); // Function Niagara.NiagaraComponent.SetDesiredAge(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509230>
	void SetCanRenderWhileSeeking(char bInCanRenderWhileSeeking); // Function Niagara.NiagaraComponent.SetCanRenderWhileSeeking(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15091A0>
	void SetAutoDestroy(char bInAutoDestroy); // Function Niagara.NiagaraComponent.SetAutoDestroy(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509110>
	void SetAsset(struct Unknown InAsset); // Function Niagara.NiagaraComponent.SetAsset(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509090>
	void SetAllowScalability(char bAllow); // Function Niagara.NiagaraComponent.SetAllowScalability(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509000>
	void SetAgeUpdateMode(enum class Unknow InAgeUpdateMode); // Function Niagara.NiagaraComponent.SetAgeUpdateMode(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508F80>
	void SeekToDesiredAge(float InDesiredAge); // Function Niagara.NiagaraComponent.SeekToDesiredAge(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508F00>
	void ResetSystem(); // Function Niagara.NiagaraComponent.ResetSystem(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508EE0>
	void ReinitializeSystem(); // Function Niagara.NiagaraComponent.ReinitializeSystem(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508EC0>
	char IsPaused(); // Function Niagara.NiagaraComponent.IsPaused(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508E10>
	float GetSeekDelta(); // Function Niagara.NiagaraComponent.GetSeekDelta(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508DE0>
	char GetPreviewLODDistanceEnabled(); // Function Niagara.NiagaraComponent.GetPreviewLODDistanceEnabled(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508DC0>
	int32_t GetPreviewLODDistance(); // Function Niagara.NiagaraComponent.GetPreviewLODDistance(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508DA0>
	struct TArray<Unknown> GetNiagaraParticleValueVec3_DebugOnly(struct FString InEmitterName, struct FString InValueName); // Function Niagara.NiagaraComponent.GetNiagaraParticleValueVec3_DebugOnly(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508B00>
	struct TArray<Unknown> GetNiagaraParticleValues_Debugt(struct FString InEmitterName, struct FString InValueName); // Function Niagara.NiagaraComponent.GetNiagaraParticleValues_Debug(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508C50>
	struct TArray<Unknown> GetNiagaraParticlePositions_DebugOnly(struct FString InEmitterName); // Function Niagara.NiagaraComponent.GetNiagaraParticlePositions_DebugOnly(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508A10>
	float GetMaxSimTime(); // Function Niagara.NiagaraComponent.GetMaxSimTime(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15089E0>
	char GetForceSolo(); // Function Niagara.NiagaraComponent.GetForceSolo(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15089B0>
	float GetDesiredAge(); // Function Niagara.NiagaraComponent.GetDesiredAge(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508980>
	struct Unknown GetDataInterface(struct FString Name); // Function Niagara.NiagaraComponent.GetDataInterface(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15088D0>
	struct Unknown GetAsset(); // Function Niagara.NiagaraComponent.GetAsset(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15088B0>
	enum class Unknow GetAgeUpdateMode(); // Function Niagara.NiagaraComponent.GetAgeUpdateMode(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508880>
	void AdvanceSimulationByTime(float SimulateTime, float TickDeltaSeconds); // Function Niagara.NiagaraComponent.AdvanceSimulationByTime(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15087C0>
	void AdvanceSimulation(int32_t TickCount, float TickDeltaSeconds); // Function Niagara.NiagaraComponent.AdvanceSimulation(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15086F0>
};

// Class Niagara.NiagaraComponentPool
class UNiagaraComponentPool : public Object {

public:

	struct TMap<Unknown, Unknown> WorldParticleSystemPools; // 0x28 (80)
};

// Class Niagara.NiagaraDataInterfaceAudioSubmix
class UNiagaraDataInterfaceAudioSubmix : public UNiagaraDataInterface {

public:

	struct Unknown Submix; // 0x30 (8)
};

// Class Niagara.NiagaraDataInterfaceAudioOscilloscope
class UNiagaraDataInterfaceAudioOscilloscope : public UNiagaraDataInterface {

public:

	struct Unknown Submix; // 0x30 (8)
	int32_t Resolution; // 0x38 (4)
	float ScopeInMilliseconds; // 0x3C (4)
};

// Class Niagara.NiagaraDataInterfaceAudioSpectrum
class UNiagaraDataInterfaceAudioSpectrum : public UNiagaraDataInterfaceAudioSubmix {

public:

	int32_t Resolution; // 0x38 (4)
	float MinimumFrequency; // 0x3C (4)
	float MaximumFrequency; // 0x40 (4)
	float NoiseFloorDb; // 0x44 (4)
};

// Class Niagara.NiagaraDataInterfaceCamera
class UNiagaraDataInterfaceCamera : public UNiagaraDataInterface {

public:

	int32_t PlayerControllerIndex; // 0x30 (4)
};

// Class Niagara.NiagaraDataInterfaceCurveBase
class UNiagaraDataInterfaceCurveBase : public UNiagaraDataInterface {

public:

	struct TArray<Unknown> ShaderLUT; // 0x30 (16)
	float LUTMinTime; // 0x40 (4)
	float LUTMaxTime; // 0x44 (4)
	float LUTInvTimeRange; // 0x48 (4)
	float LUTNumSamplesMinusOne; // 0x4C (4)
	char bUseLUT : 0; // 0x50 (1)
};

// Class Niagara.NiagaraDataInterfaceColorCurve
class UNiagaraDataInterfaceColorCurve : public UNiagaraDataInterfaceCurveBase {

public:

	struct Unknown RedCurve; // 0x58 (128)
	struct Unknown GreenCurve; // 0xD8 (128)
	struct Unknown BlueCurve; // 0x158 (128)
	struct Unknown AlphaCurve; // 0x1D8 (128)
};

// Class Niagara.NiagaraDataInterfaceCurlNoise
class UNiagaraDataInterfaceCurlNoise : public UNiagaraDataInterface {

public:

	uint32_t Seed; // 0x30 (4)
};

// Class Niagara.NiagaraDataInterfaceCurve
class UNiagaraDataInterfaceCurve : public UNiagaraDataInterfaceCurveBase {

public:

	struct Unknown Curve; // 0x58 (128)
};

// Class Niagara.NiagaraDataInterfaceExport
class UNiagaraDataInterfaceExport : public UNiagaraDataInterface {

public:

	struct Unknown CallbackHandlerParameter; // 0x30 (40)
};

// Class Niagara.NiagaraDataInterfaceRWBase
class UNiagaraDataInterfaceRWBase : public UNiagaraDataInterface {

public:

	struct TSet<Unknown> OutputShaderStages; // 0x30 (80)
	struct TSet<Unknown> IterationShaderStages; // 0x80 (80)
};

// Class Niagara.NiagaraDataInterfaceGrid2D
class UNiagaraDataInterfaceGrid2D : public UNiagaraDataInterfaceRWBase {

public:

	int32_t NumCellsX; // 0xD0 (4)
	int32_t NumCellsY; // 0xD4 (4)
	int32_t NumCellsMaxAxis; // 0xD8 (4)
	int32_t NumAttributes; // 0xDC (4)
	char SetGridFromMaxAxis : 0; // 0xE0 (1)
	struct Unknown WorldBBoxSize; // 0xE4 (8)
};

// Class Niagara.NiagaraDataInterfaceGrid3D
class UNiagaraDataInterfaceGrid3D : public UNiagaraDataInterfaceRWBase {

public:

	struct Unknown NumVoxels; // 0xD0 (12)
	float VoxelSize; // 0xDC (4)
	char SetGridFromVoxelSize : 0; // 0xE0 (1)
	struct Unknown WorldBBoxSize; // 0xE4 (12)
};

// Class Niagara.NiagaraDataInterfaceNeighborGrid3D
class UNiagaraDataInterfaceNeighborGrid3D : public UNiagaraDataInterfaceGrid3D {

public:

	uint32_t MaxNeighborsPerVoxel; // 0xF0 (4)
};

// Class Niagara.NiagaraDataInterfaceParticleRead
class UNiagaraDataInterfaceParticleRead : public UNiagaraDataInterface {

public:

	struct FString EmitterName; // 0x30 (16)
};

// Class Niagara.NiagaraDataInterfaceSkeletalMesh
class UNiagaraDataInterfaceSkeletalMesh : public UNiagaraDataInterface {

public:

	struct Unknown Source; // 0x30 (8)
	struct Unknown MeshUserParameter; // 0x38 (40)
	struct Unknown SourceComponent; // 0x60 (8)
	enum class Unknow SkinningMode; // 0x68 (1)
	struct TArray<Unknown> SamplingRegions; // 0x70 (16)
	int32_t WholeMeshLOD; // 0x80 (4)
	struct TArray<Unknown> FilteredBones; // 0x88 (16)
	struct TArray<Unknown> FilteredSockets; // 0x98 (16)
	struct FName ExcludeBoneName; // 0xA8 (8)
	char bExcludeBone : 0; // 0xB0 (1)
};

// Class Niagara.NiagaraDataInterfaceSpline
class UNiagaraDataInterfaceSpline : public UNiagaraDataInterface {

public:

	struct Unknown Source; // 0x30 (8)
};

// Class Niagara.NiagaraDataInterfaceStaticMesh
class UNiagaraDataInterfaceStaticMesh : public UNiagaraDataInterface {

public:

	struct Unknown DefaultMesh; // 0x30 (8)
	struct Unknown Source; // 0x38 (8)
	struct Unknown SourceComponent; // 0x40 (8)
	struct Unknown SectionFilter; // 0x48 (16)
};

// Class Niagara.NiagaraDataInterfaceTexture
class UNiagaraDataInterfaceTexture : public UNiagaraDataInterface {

public:

	struct Unknown Texture; // 0x30 (8)
};

// Class Niagara.NiagaraDataInterfaceVector2DCurve
class UNiagaraDataInterfaceVector2DCurve : public UNiagaraDataInterfaceCurveBase {

public:

	struct Unknown XCurve; // 0x58 (128)
	struct Unknown YCurve; // 0xD8 (128)
};

// Class Niagara.NiagaraDataInterfaceVector4Curve
class UNiagaraDataInterfaceVector4Curve : public UNiagaraDataInterfaceCurveBase {

public:

	struct Unknown XCurve; // 0x58 (128)
	struct Unknown YCurve; // 0xD8 (128)
	struct Unknown ZCurve; // 0x158 (128)
	struct Unknown WCurve; // 0x1D8 (128)
};

// Class Niagara.NiagaraDataInterfaceVectorCurve
class UNiagaraDataInterfaceVectorCurve : public UNiagaraDataInterfaceCurveBase {

public:

	struct Unknown XCurve; // 0x58 (128)
	struct Unknown YCurve; // 0xD8 (128)
	struct Unknown ZCurve; // 0x158 (128)
};

// Class Niagara.NiagaraDataInterfaceVectorField
class UNiagaraDataInterfaceVectorField : public UNiagaraDataInterface {

public:

	struct Unknown Field; // 0x30 (8)
	char bTileX : 0; // 0x38 (1)
	char bTileY : 0; // 0x39 (1)
	char bTileZ : 0; // 0x3A (1)
};

// Class Niagara.NiagaraDataInterfaceVolumeTexture
class UNiagaraDataInterfaceVolumeTexture : public UNiagaraDataInterface {

public:

	struct Unknown Texture; // 0x30 (8)
};

// Class Niagara.NiagaraEffectType
class UNiagaraEffectType : public Object {

public:

	enum class Unknow UpdateFrequency; // 0x28 (4)
	enum class Unknow CullReaction; // 0x2C (4)
	struct TArray<Unknown> DetailLevelScalabilitySettings; // 0x30 (16)
	struct Unknown SystemScalabilitySettings; // 0x40 (16)
	struct Unknown EmitterScalabilitySettings; // 0x50 (16)
};

// Class Niagara.NiagaraEmitter
class UNiagaraEmitter : public Object {

public:

	char bLocalSpace : 0; // 0x28 (1)
	char bDeterminism : 0; // 0x29 (1)
	int32_t RandomSeed; // 0x2C (4)
	enum class Unknow AllocationMode; // 0x30 (1)
	int32_t PreAllocationCount; // 0x34 (4)
	struct Unknown UpdateScriptProps; // 0x38 (40)
	struct Unknown SpawnScriptProps; // 0x60 (40)
	struct Unknown EmitterSpawnScriptProps; // 0x88 (40)
	struct Unknown EmitterUpdateScriptProps; // 0xB0 (40)
	enum class Unknow SimTarget; // 0xD8 (1)
	struct Unknown FixedBounds; // 0xDC (28)
	int32_t MinDetailLevel; // 0xF8 (4)
	int32_t MaxDetailLevel; // 0xFC (4)
	struct Unknown GlobalSpawnCountScaleOverrides; // 0x100 (20)
	struct Unknown Platforms; // 0x118 (32)
	struct Unknown ScalabilityOverrides; // 0x138 (16)
	char bInterpolatedSpawning : 0; // 0x148 (1)
	char bFixedBounds : 0; // 0x148 (1)
	char bUseMinDetailLevel : 0; // 0x148 (1)
	char bUseMaxDetailLevel : 0; // 0x148 (1)
	char bOverrideGlobalSpawnCountScale : 0; // 0x148 (1)
	char bRequiresPersistentIDs : 0; // 0x148 (1)
	float MaxDeltaTimePerTick; // 0x14C (4)
	uint32_t DefaultShaderStageIndex; // 0x150 (4)
	uint32_t MaxUpdateIterations; // 0x154 (4)
	struct TSet<Unknown> SpawnStages; // 0x158 (80)
	char bSimulationStagesEnabled : 0; // 0x1A8 (1)
	char bDeprecatedShaderStagesEnabled : 0; // 0x1A8 (1)
	char bLimitDeltaTime : 0; // 0x1A8 (1)
	struct FString UniqueEmitterName; // 0x1B0 (16)
	struct TArray<Unknown> RendererProperties; // 0x1C0 (16)
	struct TArray<Unknown> EventHandlerScriptProps; // 0x1D0 (16)
	struct TArray<Unknown> SimulationStages; // 0x1E0 (16)
	struct Unknown GPUComputeScript; // 0x1F0 (8)
	struct TArray<Unknown> SharedEventGeneratorIds; // 0x1F8 (16)
};

// Class Niagara.NiagaraEventReceiverEmitterAction_SpawnParticles
class UNiagaraEventReceiverEmitterAction_SpawnParticles : public UNiagaraEventReceiverEmitterAction {

public:

	uint32_t NumParticles; // 0x28 (4)
};

// Class Niagara.NiagaraRendererProperties
class UNiagaraRendererProperties : public UNiagaraMergeable {

public:

	int32_t SortOrderHint; // 0x28 (4)
	char bIsEnabled : 0; // 0x2C (1)
	char bMotionBlurEnabled : 0; // 0x2D (1)
};

// Class Niagara.NiagaraLightRendererProperties
class UNiagaraLightRendererProperties : public UNiagaraRendererProperties {

public:

	char bUseInverseSquaredFalloff : 0; // 0x50 (1)
	char bAffectsTranslucency : 0; // 0x50 (1)
	char bOverrideRenderingEnabled : 0; // 0x50 (1)
	float RadiusScale; // 0x54 (4)
	struct Unknown ColorAdd; // 0x58 (12)
	struct Unknown LightRenderingEnabledBinding; // 0x68 (120)
	struct Unknown LightExponentBinding; // 0xE0 (120)
	struct Unknown PositionBinding; // 0x158 (120)
	struct Unknown ColorBinding; // 0x1D0 (120)
	struct Unknown RadiusBinding; // 0x248 (120)
	struct Unknown VolumetricScatteringBinding; // 0x2C0 (120)
};

// Class Niagara.NiagaraMeshRendererProperties
class UNiagaraMeshRendererProperties : public UNiagaraRendererProperties {

public:

	struct Unknown ParticleMesh; // 0x50 (8)
	enum class Unknow SortMode; // 0x58 (1)
	char bOverrideMaterials : 0; // 0x5C (1)
	char bSortOnlyWhenTranslucent : 0; // 0x5C (1)
	struct TArray<Unknown> OverrideMaterials; // 0x60 (16)
	struct Unknown SubImageSize; // 0x70 (8)
	char bSubImageBlend : 0; // 0x78 (1)
	enum class Unknow FacingMode; // 0x7C (1)
	char bLockedAxisEnable : 0; // 0x80 (1)
	struct Unknown LockedAxis; // 0x84 (12)
	enum class Unknow LockedAxisSpace; // 0x90 (1)
	struct Unknown PositionBinding; // 0x98 (120)
	struct Unknown ColorBinding; // 0x110 (120)
	struct Unknown VelocityBinding; // 0x188 (120)
	struct Unknown MeshOrientationBinding; // 0x200 (120)
	struct Unknown ScaleBinding; // 0x278 (120)
	struct Unknown SubImageIndexBinding; // 0x2F0 (120)
	struct Unknown DynamicMaterialBinding; // 0x368 (120)
	struct Unknown DynamicMaterial1Binding; // 0x3E0 (120)
	struct Unknown DynamicMaterial2Binding; // 0x458 (120)
	struct Unknown DynamicMaterial3Binding; // 0x4D0 (120)
	struct Unknown MaterialRandomBinding; // 0x548 (120)
	struct Unknown CustomSortingBinding; // 0x5C0 (120)
	struct Unknown NormalizedAgeBinding; // 0x638 (120)
	struct Unknown CameraOffsetBinding; // 0x6B0 (120)
};

// Class Niagara.NiagaraParameterCollectionInstance
class UNiagaraParameterCollectionInstance : public Object {

public:

	struct Unknown Collection; // 0x28 (8)
	struct TArray<Unknown> OverridenParameters; // 0x30 (16)
	struct Unknown ParameterStorage; // 0x40 (184)

	void SetVectorParameter(struct FString InVariableName, struct Unknown InValue); // Function Niagara.NiagaraParameterCollectionInstance.SetVectorParameter(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15161A0>
	void SetVector4Parameter(struct FString InVariableName, struct Unknown& InValue); // Function Niagara.NiagaraParameterCollectionInstance.SetVector4Parameter(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15160A0>
	void SetVector2DParameter(struct FString InVariableName, struct Unknown InValue); // Function Niagara.NiagaraParameterCollectionInstance.SetVector2DParameter(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1515FC0>
	void SetQuatParameter(struct FString InVariableName, struct Unknown& InValue); // Function Niagara.NiagaraParameterCollectionInstance.SetQuatParameter(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1515DC0>
	void SetIntParameter(struct FString InVariableName, int32_t InValue); // Function Niagara.NiagaraParameterCollectionInstance.SetIntParameter(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1515CE0>
	void SetFloatParameter(struct FString InVariableName, float InValue); // Function Niagara.NiagaraParameterCollectionInstance.SetFloatParameter(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1515BF0>
	void SetColorParameter(struct FString InVariableName, struct Unknown InValue); // Function Niagara.NiagaraParameterCollectionInstance.SetColorParameter(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1515B00>
	void SetBoolParameter(struct FString InVariableName, char InValue); // Function Niagara.NiagaraParameterCollectionInstance.SetBoolParameter(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1515A10>
	struct Unknown GetVectorParameter(struct FString InVariableName); // Function Niagara.NiagaraParameterCollectionInstance.GetVectorParameter(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1515620>
	struct Unknown GetVector4Parameter(struct FString InVariableName); // Function Niagara.NiagaraParameterCollectionInstance.GetVector4Parameter(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1515560>
	struct Unknown GetVector2DParameter(struct FString InVariableName); // Function Niagara.NiagaraParameterCollectionInstance.GetVector2DParameter(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15154A0>
	struct Unknown GetQuatParameter(struct FString InVariableName); // Function Niagara.NiagaraParameterCollectionInstance.GetQuatParameter(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15153E0>
	int32_t GetIntParameter(struct FString InVariableName); // Function Niagara.NiagaraParameterCollectionInstance.GetIntParameter(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1515270>
	float GetFloatParameter(struct FString InVariableName); // Function Niagara.NiagaraParameterCollectionInstance.GetFloatParameter(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15151C0>
	struct Unknown GetColorParameter(struct FString InVariableName); // Function Niagara.NiagaraParameterCollectionInstance.GetColorParameter(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1515100>
	char GetBoolParameter(struct FString InVariableName); // Function Niagara.NiagaraParameterCollectionInstance.GetBoolParameter(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1515050>
};

// Class Niagara.NiagaraParameterCollection
class UNiagaraParameterCollection : public Object {

public:

	struct FName Namespace; // 0x28 (8)
	struct TArray<Unknown> Parameters; // 0x30 (16)
	struct Unknown DefaultInstance; // 0x40 (8)
	struct Unknown CompileId; // 0x48 (16)
};

// Class Niagara.NiagaraPrecompileContainer
class UNiagaraPrecompileContainer : public Object {

public:

	struct TArray<Unknown> Scripts; // 0x28 (16)
	struct Unknown System; // 0x38 (8)
};

// Class Niagara.NiagaraPreviewAxis_InterpParamBase
class UNiagaraPreviewAxis_InterpParamBase : public UNiagaraPreviewAxis {

public:

	struct FName Param; // 0x28 (8)
	int32_t Count; // 0x30 (4)
};

// Class Niagara.NiagaraPreviewAxis_InterpParamInt32
class UNiagaraPreviewAxis_InterpParamInt32 : public UNiagaraPreviewAxis_InterpParamBase {

public:

	int32_t Min; // 0x38 (4)
	int32_t MAX; // 0x3C (4)
};

// Class Niagara.NiagaraPreviewAxis_InterpParamFloat
class UNiagaraPreviewAxis_InterpParamFloat : public UNiagaraPreviewAxis_InterpParamBase {

public:

	float Min; // 0x38 (4)
	float MAX; // 0x3C (4)
};

// Class Niagara.NiagaraPreviewAxis_InterpParamVector2D
class UNiagaraPreviewAxis_InterpParamVector2D : public UNiagaraPreviewAxis_InterpParamBase {

public:

	struct Unknown Min; // 0x38 (8)
	struct Unknown MAX; // 0x40 (8)
};

// Class Niagara.NiagaraPreviewAxis_InterpParamVector
class UNiagaraPreviewAxis_InterpParamVector : public UNiagaraPreviewAxis_InterpParamBase {

public:

	struct Unknown Min; // 0x38 (12)
	struct Unknown MAX; // 0x44 (12)
};

// Class Niagara.NiagaraPreviewAxis_InterpParamVector4
class UNiagaraPreviewAxis_InterpParamVector4 : public UNiagaraPreviewAxis_InterpParamBase {

public:

	struct Unknown Min; // 0x40 (16)
	struct Unknown MAX; // 0x50 (16)
};

// Class Niagara.NiagaraPreviewAxis_InterpParamLinearColor
class UNiagaraPreviewAxis_InterpParamLinearColor : public UNiagaraPreviewAxis_InterpParamBase {

public:

	struct Unknown Min; // 0x38 (16)
	struct Unknown MAX; // 0x48 (16)
};

// Class Niagara.NiagaraPreviewGrid
class ANiagaraPreviewGrid : public UActor {

public:

	struct Unknown System; // 0x310 (8)
	enum class Unknow ResetMode; // 0x318 (1)
	struct Unknown PreviewAxisX; // 0x320 (8)
	struct Unknown PreviewAxisY; // 0x328 (8)
	struct Unknown* PreviewClass; // 0x330 (8)
	float SpacingX; // 0x338 (4)
	float SpacingY; // 0x33C (4)
	int32_t NumX; // 0x340 (4)
	int32_t NumY; // 0x344 (4)
	struct TArray<Unknown> PreviewComponents; // 0x348 (16)

	void SetPaused(char bPaused); // Function Niagara.NiagaraPreviewGrid.SetPaused(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x151C380>
	void GetPreviews(struct TArray<Unknown>& OutPreviews); // Function Niagara.NiagaraPreviewGrid.GetPreviews(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x151C280>
	void DeactivatePreviews(); // Function Niagara.NiagaraPreviewGrid.DeactivatePreviews(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x151C260>
	void ActivatePreviews(char bReset); // Function Niagara.NiagaraPreviewGrid.ActivatePreviews(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x151C050>
};

// Class Niagara.NiagaraRibbonRendererProperties
class UNiagaraRibbonRendererProperties : public UNiagaraRendererProperties {

public:

	struct Unknown Material; // 0x50 (8)
	struct Unknown MaterialUserParamBinding; // 0x58 (40)
	enum class Unknow FacingMode; // 0x80 (1)
	float UV0TilingDistance; // 0x84 (4)
	struct Unknown UV0Scale; // 0x88 (8)
	struct Unknown UV0Offset; // 0x90 (8)
	enum class Unknow UV0AgeOffsetMode; // 0x98 (1)
	float UV1TilingDistance; // 0x9C (4)
	struct Unknown UV1Scale; // 0xA0 (8)
	struct Unknown UV1Offset; // 0xA8 (8)
	enum class Unknow UV1AgeOffsetMode; // 0xB0 (1)
	enum class Unknow DrawDirection; // 0xB1 (1)
	float CurveTension; // 0xB4 (4)
	enum class Unknow TessellationMode; // 0xB8 (1)
	int32_t TessellationFactor; // 0xBC (4)
	char bUseConstantFactor : 0; // 0xC0 (1)
	float TessellationAngle; // 0xC4 (4)
	char bScreenSpaceTessellation : 0; // 0xC8 (1)
	struct Unknown PositionBinding; // 0xD0 (120)
	struct Unknown ColorBinding; // 0x148 (120)
	struct Unknown VelocityBinding; // 0x1C0 (120)
	struct Unknown NormalizedAgeBinding; // 0x238 (120)
	struct Unknown RibbonTwistBinding; // 0x2B0 (120)
	struct Unknown RibbonWidthBinding; // 0x328 (120)
	struct Unknown RibbonFacingBinding; // 0x3A0 (120)
	struct Unknown RibbonIdBinding; // 0x418 (120)
	struct Unknown RibbonLinkOrderBinding; // 0x490 (120)
	struct Unknown MaterialRandomBinding; // 0x508 (120)
	struct Unknown DynamicMaterialBinding; // 0x580 (120)
	struct Unknown DynamicMaterial1Binding; // 0x5F8 (120)
	struct Unknown DynamicMaterial2Binding; // 0x670 (120)
	struct Unknown DynamicMaterial3Binding; // 0x6E8 (120)
};

// Class Niagara.NiagaraScript
class UNiagaraScript : public Object {

public:

	enum class Unknow Usage; // 0x28 (1)
	int32_t UsageIndex; // 0x2C (4)
	struct Unknown UsageId; // 0x30 (16)
	struct Unknown RapidIterationParameters; // 0x40 (184)
	struct Unknown ScriptExecutionParamStore; // 0xF8 (216)
	struct TArray<Unknown> ScriptExecutionBoundParameters; // 0x1D0 (16)
	struct Unknown CachedScriptVMId; // 0x1E0 (72)
	struct Unknown CachedScriptVM; // 0x3D8 (296)
	struct TArray<Unknown> CachedParameterCollectionReferences; // 0x500 (16)
	struct TArray<Unknown> CachedDefaultDataInterfaces; // 0x510 (16)

	void RaiseOnGPUCompilationComplete(); // Function Niagara.NiagaraScript.RaiseOnGPUCompilationComplete(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x151C360>
};

// Class Niagara.NiagaraSettings
class UNiagaraSettings : public UDeveloperSettings {

public:

	struct TArray<Unknown> AdditionalParameterTypes; // 0x38 (16)
	struct TArray<Unknown> AdditionalPayloadTypes; // 0x48 (16)
	struct TArray<Unknown> AdditionalParameterEnums; // 0x58 (16)
	struct Unknown DefaultEffectType; // 0x68 (24)
	struct TArray<Unknown> QualityLevels; // 0x80 (16)
	struct Unknown DefaultEffectTypePtr; // 0x90 (8)
};

// Class Niagara.NiagaraSimulationStageBase
class UNiagaraSimulationStageBase : public UNiagaraMergeable {

public:

	struct Unknown Script; // 0x28 (8)
	struct FName SimulationStageName; // 0x30 (8)
};

// Class Niagara.NiagaraSimulationStageGeneric
class UNiagaraSimulationStageGeneric : public UNiagaraSimulationStageBase {

public:

	enum class Unknow IterationSource; // 0x38 (1)
	int32_t Iterations; // 0x3C (4)
	char bSpawnOnly : 0; // 0x40 (1)
	struct Unknown DataInterface; // 0x48 (40)
};

// Class Niagara.NiagaraSpriteRendererProperties
class UNiagaraSpriteRendererProperties : public UNiagaraRendererProperties {

public:

	struct Unknown Material; // 0x50 (8)
	struct Unknown MaterialUserParamBinding; // 0x58 (40)
	enum class Unknow Alignment; // 0x80 (1)
	enum class Unknow FacingMode; // 0x81 (1)
	struct Unknown PivotInUVSpace; // 0x84 (8)
	enum class Unknow SortMode; // 0x8C (1)
	struct Unknown SubImageSize; // 0x90 (8)
	char bSubImageBlend : 0; // 0x98 (1)
	char bRemoveHMDRollInVR : 0; // 0x98 (1)
	char bSortOnlyWhenTranslucent : 0; // 0x98 (1)
	float MinFacingCameraBlendDistance; // 0x9C (4)
	float MaxFacingCameraBlendDistance; // 0xA0 (4)
	struct Unknown PositionBinding; // 0xA8 (120)
	struct Unknown ColorBinding; // 0x120 (120)
	struct Unknown VelocityBinding; // 0x198 (120)
	struct Unknown SpriteRotationBinding; // 0x210 (120)
	struct Unknown SpriteSizeBinding; // 0x288 (120)
	struct Unknown SpriteFacingBinding; // 0x300 (120)
	struct Unknown SpriteAlignmentBinding; // 0x378 (120)
	struct Unknown SubImageIndexBinding; // 0x3F0 (120)
	struct Unknown DynamicMaterialBinding; // 0x468 (120)
	struct Unknown DynamicMaterial1Binding; // 0x4E0 (120)
	struct Unknown DynamicMaterial2Binding; // 0x558 (120)
	struct Unknown DynamicMaterial3Binding; // 0x5D0 (120)
	struct Unknown CameraOffsetBinding; // 0x648 (120)
	struct Unknown UVScaleBinding; // 0x6C0 (120)
	struct Unknown MaterialRandomBinding; // 0x738 (120)
	struct Unknown CustomSortingBinding; // 0x7B0 (120)
	struct Unknown NormalizedAgeBinding; // 0x828 (120)
};

// Class Niagara.NiagaraSystem
class UNiagaraSystem : public UFXSystemAsset {

public:

	char bDumpDebugSystemInfo : 0; // 0x31 (1)
	char bDumpDebugEmitterInfo : 0; // 0x32 (1)
	char bFixedBounds : 0; // 0x34 (1)
	struct Unknown EffectType; // 0x38 (8)
	char bOverrideScalabilitySettings : 0; // 0x40 (1)
	struct TArray<Unknown> ScalabilityOverrides; // 0x48 (16)
	struct Unknown SystemScalabilityOv; // 0x58 (16)
	struct TArray<Unknown> EmitterHandles; // 0x68 (16)
	struct TArray<Unknown> ParameterCollectionOverrides; // 0x78 (16)
	struct Unknown SystemSpawnScript; // 0x88 (8)
	struct Unknown SystemUpdateScript; // 0x90 (8)
	struct Unknown SystemCompiledData; // 0xA8 (600)
	struct Unknown ExposedParameters; // 0x300 (264)
	struct Unknown FixedBounds; // 0x408 (28)
	char bAutoDeactivate : 0; // 0x424 (1)
	float WarmupTime; // 0x428 (4)
	int32_t WarmupTickCount; // 0x42C (4)
	float WarmupTickDelta; // 0x430 (4)
	char bHasSystemScriptDIsWithPerInstanceData : 0; // 0x434 (1)
	struct TArray<Unknown> UserDINamesReadInSystemScripts; // 0x438 (16)
};

// ScriptStruct Niagara.MovieSceneNiagaraParameterSectionTemplate
struct FMovieSceneNiagaraParameterSectionTemplate : FMovieSceneEvalTemplate {
	struct Unknown Parameter; // 0x20 (40)
};

// ScriptStruct Niagara.NiagaraVariableBase
struct FNiagaraVariableBase {
	struct FName Name; // 0x0 (8)
	struct Unknown TypeDef; // 0x8 (16)
};

// ScriptStruct Niagara.NiagaraTypeDefinition
struct FNiagaraTypeDefinition {
	struct Unknown ClassStructOrEnum; // 0x0 (8)
	uint16_t UnderlyingType; // 0x8 (2)
};

// ScriptStruct Niagara.NiagaraVariable
struct FNiagaraVariable : FNiagaraVariableBase {
	struct TArray<Unknown> VarData; // 0x18 (16)
};

// ScriptStruct Niagara.MovieSceneNiagaraBoolParameterSectionTemplate
struct FMovieSceneNiagaraBoolParameterSectionTemplate : FMovieSceneNiagaraParameterSectionTemplate {
	struct Unknown BoolChannel; // 0x48 (144)
};

// ScriptStruct Niagara.MovieSceneNiagaraColorParameterSectionTemplate
struct FMovieSceneNiagaraColorParameterSectionTemplate : FMovieSceneNiagaraParameterSectionTemplate {
	struct Unknown RedChannel; // 0x48 (160)
	struct Unknown GreenChannel; // 0xE8 (160)
	struct Unknown BlueChannel; // 0x188 (160)
	struct Unknown AlphaChannel; // 0x228 (160)
};

// ScriptStruct Niagara.MovieSceneNiagaraFloatParameterSectionTemplate
struct FMovieSceneNiagaraFloatParameterSectionTemplate : FMovieSceneNiagaraParameterSectionTemplate {
	struct Unknown FloatChannel; // 0x48 (160)
};

// ScriptStruct Niagara.MovieSceneNiagaraIntegerParameterSectionTemplate
struct FMovieSceneNiagaraIntegerParameterSectionTemplate : FMovieSceneNiagaraParameterSectionTemplate {
	struct Unknown IntegerChannel; // 0x48 (144)
};

// ScriptStruct Niagara.MovieSceneNiagaraSystemTrackImplementation
struct FMovieSceneNiagaraSystemTrackImplementation : FMovieSceneTrackImplementation {
	struct Unknown SpawnSectionStartFrame; // 0x10 (4)
	struct Unknown SpawnSectionEndFrame; // 0x14 (4)
	enum class Unknow SpawnSectionStartBehavior; // 0x18 (4)
	enum class Unknow SpawnSectionEvaluateBehavior; // 0x1C (4)
	enum class Unknow SpawnSectionEndBehavior; // 0x20 (4)
	enum class Unknow AgeUpdateMode; // 0x24 (1)
};

// ScriptStruct Niagara.MovieSceneNiagaraVectorParameterSectionTemplate
struct FMovieSceneNiagaraVectorParameterSectionTemplate : FMovieSceneNiagaraParameterSectionTemplate {
	struct Unknown VectorChannels[0x4]; // 0x48 (640)
	int32_t ChannelsUsed; // 0x2C8 (4)
};

// ScriptStruct Niagara.NiagaraRandInfo
struct FNiagaraRandInfo {
	int32_t Seed1; // 0x0 (4)
	int32_t Seed2; // 0x4 (4)
	int32_t Seed3; // 0x8 (4)
};

// ScriptStruct Niagara.NiagaraUserParameterBinding
struct FNiagaraUserParameterBinding {
	struct Unknown Parameter; // 0x0 (40)
};

// ScriptStruct Niagara.NiagaraScriptVariableBinding
struct FNiagaraScriptVariableBinding {
	struct FName Name; // 0x0 (8)
};

// ScriptStruct Niagara.NiagaraVariableDataInterfaceBinding
struct FNiagaraVariableDataInterfaceBinding {
	struct Unknown BoundVariable; // 0x0 (40)
};

// ScriptStruct Niagara.NiagaraVariableAttributeBinding
struct FNiagaraVariableAttributeBinding {
	struct Unknown BoundVariable; // 0x0 (40)
	struct Unknown DataSetVariable; // 0x28 (40)
	struct Unknown DefaultValueIfNonExistent; // 0x50 (40)
};

// ScriptStruct Niagara.NiagaraVariableInfo
struct FNiagaraVariableInfo {
	struct Unknown Variable; // 0x0 (40)
	struct FText Definition; // 0x28 (24)
	struct Unknown DataInterface; // 0x40 (8)
};

// ScriptStruct Niagara.NiagaraSystemUpdateContext
struct FNiagaraSystemUpdateContext {
	struct TArray<Unknown> ComponentsToReset; // 0x0 (16)
	struct TArray<Unknown> ComponentsToReInit; // 0x10 (16)
	struct TArray<Unknown> SystemSimsToDestroy; // 0x20 (16)
};

// ScriptStruct Niagara.VMExternalFunctionBindingInfo
struct FVMExternalFunctionBindingInfo {
	struct FName Name; // 0x0 (8)
	struct FName OwnerName; // 0x8 (8)
	struct TArray<Unknown> InputParamLocations; // 0x10 (16)
	int32_t NumOutputs; // 0x20 (4)
	struct TArray<Unknown> FunctionSpecifiers; // 0x28 (16)
};

// ScriptStruct Niagara.VMFunctionSpecifier
struct FVMFunctionSpecifier {
	struct FName Key; // 0x0 (8)
	struct FName Value; // 0x8 (8)
};

// ScriptStruct Niagara.NiagaraStatScope
struct FNiagaraStatScope {
	struct FName FullName; // 0x0 (8)
	struct FName FriendlyName; // 0x8 (8)
};

// ScriptStruct Niagara.NiagaraScriptDataInterfaceCompileInfo
struct FNiagaraScriptDataInterfaceCompileInfo {
	struct FName Name; // 0x0 (8)
	int32_t UserPtrIdx; // 0x8 (4)
	struct Unknown Type; // 0x10 (16)
	struct FName RegisteredParameterMapRead; // 0x20 (8)
	struct FName RegisteredParameterMapWrite; // 0x28 (8)
	char bIsPlaceholder : 0; // 0x30 (1)
};

// ScriptStruct Niagara.NiagaraScriptDataInterfaceInfo
struct FNiagaraScriptDataInterfaceInfo {
	struct Unknown DataInterface; // 0x0 (8)
	struct FName Name; // 0x8 (8)
	int32_t UserPtrIdx; // 0x10 (4)
	struct Unknown Type; // 0x18 (16)
	struct FName RegisteredParameterMapRead; // 0x28 (8)
	struct FName RegisteredParameterMapWrite; // 0x30 (8)
};

// ScriptStruct Niagara.NiagaraFunctionSignature
struct FNiagaraFunctionSignature {
	struct FName Name; // 0x0 (8)
	struct TArray<Unknown> Inputs; // 0x8 (16)
	struct TArray<Unknown> Outputs; // 0x18 (16)
	struct FName OwnerName; // 0x28 (8)
	char bRequiresContext : 0; // 0x30 (1)
	char bMemberFunction : 0; // 0x30 (1)
	char bExperimental : 0; // 0x30 (1)
	char bSupportsCPU : 0; // 0x30 (1)
	char bSupportsGPU : 0; // 0x30 (1)
	char bWriteFunction : 0; // 0x30 (1)
	struct TMap<Unknown, Unknown> FunctionSpecifiers; // 0x38 (80)
};

// ScriptStruct Niagara.NiagaraScriptDataUsageInfo
struct FNiagaraScriptDataUsageInfo {
	char bReadsAttributeData : 0; // 0x0 (1)
};

// ScriptStruct Niagara.NiagaraDataSetProperties
struct FNiagaraDataSetProperties {
	struct Unknown ID; // 0x0 (12)
	struct TArray<Unknown> Variables; // 0x10 (16)
};

// ScriptStruct Niagara.NiagaraDataSetID
struct FNiagaraDataSetID {
	struct FName Name; // 0x0 (8)
	enum class Unknow Type; // 0x8 (1)
};

// ScriptStruct Niagara.NCPool
struct FNCPool {
	struct TArray<Unknown> FreeElements; // 0x0 (16)
	struct TArray<Unknown> InUseComponents_Auto; // 0x10 (16)
	struct TArray<Unknown> InUseComponents_Manual; // 0x20 (16)
};

// ScriptStruct Niagara.NCPoolElement
struct FNCPoolElement {
	struct Unknown Component; // 0x0 (8)
};

// ScriptStruct Niagara.BasicParticleData
struct FBasicParticleData {
	struct Unknown Position; // 0x0 (12)
	float Size; // 0xC (4)
	struct Unknown Velocity; // 0x10 (12)
};

// ScriptStruct Niagara.MeshTriCoordinate
struct FMeshTriCoordinate {
	int32_t Tri; // 0x0 (4)
	struct Unknown BaryCoord; // 0x4 (12)
};

// ScriptStruct Niagara.NDIStaticMeshSectionFilter
struct FNDIStaticMeshSectionFilter {
	struct TArray<Unknown> AllowedMaterialSlots; // 0x0 (16)
};

// ScriptStruct Niagara.NiagaraDataSetCompiledData
struct FNiagaraDataSetCompiledData {
	struct TArray<Unknown> Variables; // 0x0 (16)
	struct TArray<Unknown> VariableLayouts; // 0x10 (16)
	uint32_t TotalFloatComponents; // 0x20 (4)
	uint32_t TotalInt32Components; // 0x24 (4)
	char bRequiresPersistentIDs : 0; // 0x28 (1)
	struct Unknown ID; // 0x2C (12)
	enum class Unknow SimTarget; // 0x38 (1)
};

// ScriptStruct Niagara.NiagaraVariableLayoutInfo
struct FNiagaraVariableLayoutInfo {
	uint32_t FloatComponentStart; // 0x0 (4)
	uint32_t Int32ComponentStart; // 0x4 (4)
	struct Unknown LayoutInfo; // 0x8 (64)
};

// ScriptStruct Niagara.NiagaraTypeLayoutInfo
struct FNiagaraTypeLayoutInfo {
	struct TArray<Unknown> FloatComponentByteOffsets; // 0x0 (16)
	struct TArray<Unknown> FloatComponentRegisterOffsets; // 0x10 (16)
	struct TArray<Unknown> Int32ComponentByteOffsets; // 0x20 (16)
	struct TArray<Unknown> Int32ComponentRegisterOffsets; // 0x30 (16)
};

// ScriptStruct Niagara.NiagaraGraphViewSettings
struct FNiagaraGraphViewSettings {
	struct Unknown Location; // 0x0 (8)
	float Zoom; // 0x8 (4)
	char bIsValid : 0; // 0xC (1)
};

// ScriptStruct Niagara.NiagaraEmitterScalabilityOverrides
struct FNiagaraEmitterScalabilityOverrides {
	struct TArray<Unknown> Overrides; // 0x0 (16)
};

// ScriptStruct Niagara.NiagaraEmitterScalabilitySettings
struct FNiagaraEmitterScalabilitySettings {
	struct Unknown Platforms; // 0x0 (32)
	char bScaleSpawnCount : 0; // 0x20 (1)
	float SpawnCountScale; // 0x24 (4)
};

// ScriptStruct Niagara.NiagaraPlatformSet
struct FNiagaraPlatformSet {
	int32_t QualityLevelMask; // 0x0 (4)
	struct TArray<Unknown> DeviceProfileStates; // 0x8 (16)
};

// ScriptStruct Niagara.NiagaraDeviceProfileStateEntry
struct FNiagaraDeviceProfileStateEntry {
	struct FName ProfileName; // 0x0 (8)
	uint32_t QualityLevelMask; // 0x8 (4)
	uint32_t SetQualityLevelMask; // 0xC (4)
};

// ScriptStruct Niagara.NiagaraEmitterScalabilityOverride
struct FNiagaraEmitterScalabilityOverride : FNiagaraEmitterScalabilitySettings {
	char bOverrideSpawnCountScale : 0; // 0x28 (1)
};

// ScriptStruct Niagara.NiagaraEmitterScalabilitySettingsArray
struct FNiagaraEmitterScalabilitySettingsArray {
	struct TArray<Unknown> Settings; // 0x0 (16)
};

// ScriptStruct Niagara.NiagaraSystemScalabilityOverrides
struct FNiagaraSystemScalabilityOverrides {
	struct TArray<Unknown> Overrides; // 0x0 (16)
};

// ScriptStruct Niagara.NiagaraSystemScalabilitySettings
struct FNiagaraSystemScalabilitySettings {
	struct Unknown Platforms; // 0x0 (32)
	char bCullByDistance : 0; // 0x20 (1)
	char bCullMaxInstanceCount : 0; // 0x20 (1)
	char bCullByMaxTimeWithoutRender : 0; // 0x20 (1)
	float MaxDistance; // 0x24 (4)
	float MaxInstances; // 0x28 (4)
	float MaxTimeWithoutRender; // 0x2C (4)
};

// ScriptStruct Niagara.NiagaraSystemScalabilityOverride
struct FNiagaraSystemScalabilityOverride : FNiagaraSystemScalabilitySettings {
	char bOverrideDistanceSettings : 0; // 0x30 (1)
	char bOverrideInstanceCountSettings : 0; // 0x30 (1)
	char bOverrideTimeSinceRendererSettings : 0; // 0x30 (1)
};

// ScriptStruct Niagara.NiagaraSystemScalabilitySettingsArray
struct FNiagaraSystemScalabilitySettingsArray {
	struct TArray<Unknown> Settings; // 0x0 (16)
};

// ScriptStruct Niagara.NiagaraDetailsLevelScaleOverrides
struct FNiagaraDetailsLevelScaleOverrides {
	float Low; // 0x0 (4)
	float Medium; // 0x4 (4)
	float High; // 0x8 (4)
	float Epic; // 0xC (4)
	float Cine; // 0x10 (4)
};

// ScriptStruct Niagara.NiagaraEmitterScriptProperties
struct FNiagaraEmitterScriptProperties {
	struct Unknown Script; // 0x0 (8)
	struct TArray<Unknown> EventReceivers; // 0x8 (16)
	struct TArray<Unknown> EventGenerators; // 0x18 (16)
};

// ScriptStruct Niagara.NiagaraEventGeneratorProperties
struct FNiagaraEventGeneratorProperties {
	int32_t MaxEventsPerFrame; // 0x0 (4)
	struct FName ID; // 0x4 (8)
	struct Unknown DataSetCompiledData; // 0x10 (64)
};

// ScriptStruct Niagara.NiagaraEventReceiverProperties
struct FNiagaraEventReceiverProperties {
	struct FName Name; // 0x0 (8)
	struct FName SourceEventGenerator; // 0x8 (8)
	struct FName SourceEmitter; // 0x10 (8)
};

// ScriptStruct Niagara.NiagaraEventScriptProperties
struct FNiagaraEventScriptProperties : FNiagaraEmitterScriptProperties {
	enum class Unknow ExecutionMode; // 0x28 (1)
	uint32_t SpawnNumber; // 0x2C (4)
	uint32_t MaxEventsPerFrame; // 0x30 (4)
	struct Unknown SourceEmitterID; // 0x34 (16)
	struct FName SourceEventName; // 0x44 (8)
	char bRandomSpawnNumber : 0; // 0x4C (1)
	uint32_t MinSpawnNumber; // 0x50 (4)
};

// ScriptStruct Niagara.NiagaraEmitterHandle
struct FNiagaraEmitterHandle {
	struct Unknown ID; // 0x0 (16)
	struct FName IdName; // 0x10 (8)
	char bIsEnabled : 0; // 0x18 (1)
	struct FName Name; // 0x1C (8)
	struct Unknown Instance; // 0x28 (8)
};

// ScriptStruct Niagara.NiagaraCollisionEventPayload
struct FNiagaraCollisionEventPayload {
	struct Unknown CollisionPos; // 0x0 (12)
	struct Unknown CollisionNormal; // 0xC (12)
	struct Unknown CollisionVelocity; // 0x18 (12)
	int32_t ParticleIndex; // 0x24 (4)
	int32_t PhysicalMaterialIndex; // 0x28 (4)
};

// ScriptStruct Niagara.NiagaraMeshMaterialOverride
struct FNiagaraMeshMaterialOverride {
	struct Unknown ExplicitMat; // 0x0 (8)
	struct Unknown UserParamBinding; // 0x8 (40)
};

// ScriptStruct Niagara.NiagaraParameters
struct FNiagaraParameters {
	struct TArray<Unknown> Parameters; // 0x0 (16)
};

// ScriptStruct Niagara.NiagaraParameterStore
struct FNiagaraParameterStore {
	struct Unknown Owner; // 0x8 (8)
	struct TArray<Unknown> SortedParameterOffsets; // 0x10 (16)
	struct TArray<Unknown> ParameterData; // 0x20 (16)
	struct TArray<Unknown> DataInterfaces; // 0x30 (16)
	struct TArray<Unknown> UObjects; // 0x40 (16)
};

// ScriptStruct Niagara.NiagaraVariableWithOffset
struct FNiagaraVariableWithOffset : FNiagaraVariableBase {
	int32_t Offset; // 0x18 (4)
};

// ScriptStruct Niagara.NiagaraBoundParameter
struct FNiagaraBoundParameter {
	struct Unknown Parameter; // 0x0 (40)
	int32_t SrcOffset; // 0x28 (4)
	int32_t DestOffset; // 0x2C (4)
};

// ScriptStruct Niagara.NiagaraPlatformSetConflictInfo
struct FNiagaraPlatformSetConflictInfo {
	int32_t SetAIndex; // 0x0 (4)
	int32_t SetBIndex; // 0x4 (4)
	struct TArray<Unknown> Conflicts; // 0x8 (16)
};

// ScriptStruct Niagara.NiagaraPlatformSetConflictEntry
struct FNiagaraPlatformSetConflictEntry {
	struct FName ProfileName; // 0x0 (8)
	int32_t QualityLevelMask; // 0x8 (4)
};

// ScriptStruct Niagara.NiagaraScalabilityManager
struct FNiagaraScalabilityManager {
	struct Unknown EffectType; // 0x0 (8)
	struct TArray<Unknown> ManagedComponents; // 0x8 (16)
};

// ScriptStruct Niagara.NiagaraVMExecutableData
struct FNiagaraVMExecutableData {
	struct TArray<Unknown> ByteCode; // 0x0 (16)
	struct TArray<Unknown> OptimizedByteCode; // 0x10 (16)
	int32_t NumTempRegisters; // 0x20 (4)
	int32_t NumUserPtrs; // 0x24 (4)
	struct Unknown Parameters; // 0x28 (16)
	struct Unknown InternalParameters; // 0x38 (16)
	struct TMap<Unknown, Unknown> DataSetToParameters; // 0x48 (80)
	struct TArray<Unknown> Attributes; // 0x98 (16)
	struct Unknown DataUsage; // 0xA8 (1)
	struct TArray<Unknown> DataInterfaceInfo; // 0xB0 (16)
	struct TArray<Unknown> CalledVMExternalFunctions; // 0xC0 (16)
	struct TArray<Unknown> ReadDataSets; // 0xD0 (16)
	struct TArray<Unknown> WriteDataSets; // 0xE0 (16)
	struct TArray<Unknown> StatScopes; // 0xF0 (16)
	struct TArray<Unknown> DIParamInfo; // 0x100 (16)
	enum class Unknow LastCompileStatus; // 0x110 (1)
	struct TArray<Unknown> SimulationStageMetaData; // 0x118 (16)
};

// ScriptStruct Niagara.SimulationStageMetaData
struct FSimulationStageMetaData {
	struct FName IterationSource; // 0x0 (8)
	char bSpawnOnly : 0; // 0x8 (1)
	char bWritesParticles : 0; // 0x8 (1)
	struct TArray<Unknown> OutputDestinations; // 0x10 (16)
	int32_t MinStage; // 0x20 (4)
	int32_t MaxStage; // 0x24 (4)
};

// ScriptStruct Niagara.NiagaraVMExecutableDataId
struct FNiagaraVMExecutableDataId {
	struct Unknown CompilerVersionID; // 0x0 (16)
	enum class Unknow ScriptUsageType; // 0x10 (1)
	struct Unknown ScriptUsageTypeID; // 0x14 (16)
	char bUsesRapidIterationParams : 0; // 0x24 (1)
	char bInterpolatedSpawn : 0; // 0x24 (1)
	char bRequiresPersistentIDs : 0; // 0x24 (1)
	struct Unknown BaseScriptID; // 0x28 (16)
	struct Unknown BaseScriptCompileHash; // 0x38 (16)
};

// ScriptStruct Niagara.NiagaraModuleDependency
struct FNiagaraModuleDependency {
	struct FName ID; // 0x0 (8)
	enum class Unknow Type; // 0x8 (1)
	enum class Unknow ScriptConstraint; // 0x9 (1)
	struct FText Description; // 0x10 (24)
};

// ScriptStruct Niagara.NiagaraScriptExecutionParameterStore
struct FNiagaraScriptExecutionParameterStore : FNiagaraParameterStore {
	int32_t ParameterSize; // 0xB8 (4)
	uint32_t PaddedParameterSize; // 0xBC (4)
	struct TArray<Unknown> PaddingInfo; // 0xC0 (16)
	char bInitialized : 0; // 0xD0 (1)
};

// ScriptStruct Niagara.NiagaraScriptExecutionPaddingInfo
struct FNiagaraScriptExecutionPaddingInfo {
	uint16_t SrcOffset; // 0x0 (2)
	uint16_t DestOffset; // 0x2 (2)
	uint16_t SrcSize; // 0x4 (2)
	uint16_t DestSize; // 0x6 (2)
};

// ScriptStruct Niagara.NiagaraScriptHighlight
struct FNiagaraScriptHighlight {
	struct Unknown Color; // 0x0 (16)
	struct FText DisplayName; // 0x10 (24)
};

// ScriptStruct Niagara.NiagaraSystemCompileRequest
struct FNiagaraSystemCompileRequest {
	struct TArray<Unknown> RootObjects; // 0x8 (16)
};

// ScriptStruct Niagara.NiagaraSystemCompiledData
struct FNiagaraSystemCompiledData {
	struct Unknown InstanceParamStore; // 0x0 (184)
	struct Unknown DataSetCompiledData; // 0xB8 (64)
	struct Unknown SpawnInstanceParamsDataSetCompiledData; // 0xF8 (64)
	struct Unknown UpdateInstanceParamsDataSetCompiledData; // 0x138 (64)
	struct Unknown SpawnInstanceGlobalBinding; // 0x178 (32)
	struct Unknown SpawnInstanceSystemBinding; // 0x198 (32)
	struct Unknown SpawnInstanceOwnerBinding; // 0x1B8 (32)
	struct TArray<Unknown> SpawnInstanceEmitterBindings; // 0x1D8 (16)
	struct Unknown UpdateInstanceGlobalBinding; // 0x1E8 (32)
	struct Unknown UpdateInstanceSystemBinding; // 0x208 (32)
	struct Unknown UpdateInstanceOwnerBinding; // 0x228 (32)
	struct TArray<Unknown> UpdateInstanceEmitterBindings; // 0x248 (16)
};

// ScriptStruct Niagara.NiagaraParameterDataSetBinding
struct FNiagaraParameterDataSetBinding {
	struct TArray<Unknown> FloatOffsets; // 0x0 (16)
	struct TArray<Unknown> Int32Offsets; // 0x10 (16)
};

// ScriptStruct Niagara.NiagaraParameterDataSetBinding
struct FNiagaraParameterDataSetBinding {
	int32_t ParameterOffset; // 0x0 (4)
	int32_t DataSetComponentOffset; // 0x4 (4)
};

// ScriptStruct Niagara.NiagaraEmitterCompiledData
struct FNiagaraEmitterCompiledData {
	struct TArray<Unknown> SpawnAttributes; // 0x0 (16)
	struct Unknown EmitterSpawnIntervalVar; // 0x10 (40)
	struct Unknown EmitterInterpSpawnStartDTVar; // 0x38 (40)
	struct Unknown EmitterSpawnGroupVar; // 0x60 (40)
	struct Unknown EmitterAgeVar; // 0x88 (40)
	struct Unknown EmitterRandomSeedVar; // 0xB0 (40)
	struct Unknown EmitterTotalSpawnedParticlesVar; // 0xD8 (40)
	struct Unknown DataSetCompiledData; // 0x100 (64)
};

// ScriptStruct Niagara.NiagaraVariableMetaData
struct FNiagaraVariableMetaData {
	struct FText Description; // 0x0 (24)
	struct FText CategoryName; // 0x18 (24)
	char bAdvancedDisplay : 0; // 0x30 (1)
	int32_t EditorSortPriority; // 0x34 (4)
	char bInlineEditConditionToggle : 0; // 0x38 (1)
	struct Unknown EditCondition; // 0x40 (24)
	struct Unknown VisibleCondition; // 0x58 (24)
	struct TMap<Unknown, Unknown> PropertyMetaData; // 0x70 (80)
	struct FName ScopeName; // 0xC0 (8)
	enum class Unknow Usage; // 0xC8 (4)
	char bIsStaticSwitch : 0; // 0xCC (1)
	int32_t StaticSwitchDefaultValue; // 0xD0 (4)
	char bAddedToNodeGraphDeepCopy : 0; // 0xD4 (1)
	char bOutputIsPersistent : 0; // 0xD5 (1)
	struct FName CachedNamespacelessVariableName; // 0xD8 (8)
	char bCreatedInSystemEditor : 0; // 0xE0 (1)
	char bUseLegacyNameString : 0; // 0xE1 (1)
};

// ScriptStruct Niagara.NiagaraInputConditionMetadata
struct FNiagaraInputConditionMetadata {
	struct FName InputName; // 0x0 (8)
	struct TArray<Unknown> TargetValues; // 0x8 (16)
};

// ScriptStruct Niagara.NiagaraParameterScopeInfo
struct FNiagaraParameterScopeInfo {
	enum class Unknow Scope; // 0x0 (4)
	struct FString NamespaceString; // 0x8 (16)
};

// ScriptStruct Niagara.NiagaraCompileHashVisitorDebug
struct FNiagaraCompileHashVisitorDebug {
	struct FString Object; // 0x0 (16)
	struct TArray<Unknown> PropertyKeys; // 0x10 (16)
	struct TArray<Unknown> PropertyValues; // 0x20 (16)
};

// ScriptStruct Niagara.NiagaraID
struct FNiagaraID {
	int32_t Index; // 0x0 (4)
	int32_t AcquireTag; // 0x4 (4)
};

// ScriptStruct Niagara.NiagaraSpawnInfo
struct FNiagaraSpawnInfo {
	int32_t Count; // 0x0 (4)
	float InterpStartDt; // 0x4 (4)
	float IntervalDt; // 0x8 (4)
	int32_t SpawnGroup; // 0xC (4)
};

// ScriptStruct Niagara.NiagaraMatrix
struct FNiagaraMatrix {
	struct Unknown Row0; // 0x0 (16)
	struct Unknown Row1; // 0x10 (16)
	struct Unknown Row2; // 0x20 (16)
	struct Unknown Row3; // 0x30 (16)
};

// ScriptStruct Niagara.NiagaraTestStruct
struct FNiagaraTestStruct {
	struct Unknown Vector1; // 0x0 (12)
	struct Unknown Vector2; // 0xC (12)
	struct Unknown InnerStruct1; // 0x18 (24)
	struct Unknown InnerStruct2; // 0x30 (24)
};

// ScriptStruct Niagara.NiagaraTestStructInner
struct FNiagaraTestStructInner {
	struct Unknown InnerVector1; // 0x0 (12)
	struct Unknown InnerVector2; // 0xC (12)
};

// ScriptStruct Niagara.NiagaraBool
struct FNiagaraBool {
	int32_t Value; // 0x0 (4)
};

// ScriptStruct Niagara.NiagaraInt32
struct FNiagaraInt32 {
	int32_t Value; // 0x0 (4)
};

// ScriptStruct Niagara.NiagaraFloat
struct FNiagaraFloat {
	float Value; // 0x0 (4)
};

// ScriptStruct Niagara.NiagaraUserRedirectionParameterStore
struct FNiagaraUserRedirectionParameterStore : FNiagaraParameterStore {
	struct TMap<Unknown, Unknown> UserParameterRedirects; // 0xB8 (80)
};

// ScriptStruct Niagara.NiagaraVariant
struct FNiagaraVariant {
	struct Unknown Object; // 0x0 (8)
	struct Unknown DataInterface; // 0x8 (8)
	struct TArray<Unknown> Bytes; // 0x10 (16)
	enum class Unknow CurrentMode; // 0x20 (4)
};

// Function Niagara.NiagaraActor.SetDestroyOnSystemFinish
inline void ANiagaraActor::SetDestroyOnSystemFinish(char bShouldDestroyOnSystemFinish) {
	static auto fn = UObject::FindObject<UFunction>("Function Niagara.NiagaraActor.SetDestroyOnSystemFinish");

	struct SetDestroyOnSystemFinish_Params {
		char bShouldDestroyOnSystemFinish;
	}; SetDestroyOnSystemFinish_Params Params;

	Params.bShouldDestroyOnSystemFinish = bShouldDestroyOnSystemFinish;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function Niagara.NiagaraActor.OnNiagaraSystemFinished
inline void ANiagaraActor::OnNiagaraSystemFinished(struct Unknown FinishedComponent) {
	static auto fn = UObject::FindObject<UFunction>("Function Niagara.NiagaraActor.OnNiagaraSystemFinished");

	struct OnNiagaraSystemFinished_Params {
		struct Unknown FinishedComponent;
	}; OnNiagaraSystemFinished_Params Params;

