// Enum Niagara.ENiagaraSystemSpawnSectionEndBehavior
enum class ENiagaraSystemSpawnSectionEndBehavior : uint8 {
	ENiagaraSystemSpawnSectionEndBehavior = 0
	ENiagaraSystemSpawnSectionEndBehavior = 1
	ENiagaraSystemSpawnSectionEndBehavior = 2
	ENiagaraSystemSpawnSectionEndBehavior = 3
};

// Enum Niagara.ENiagaraSystemSpawnSectionEvaluateBehavior
enum class ENiagaraSystemSpawnSectionEvaluateBehavior : uint8 {
	ENiagaraSystemSpawnSectionEvaluateBehavior = 0
	ENiagaraSystemSpawnSectionEvaluateBehavior = 1
	ENiagaraSystemSpawnSectionEvaluateBehavior = 2
};

// Enum Niagara.ENiagaraSystemSpawnSectionStartBehavior
enum class ENiagaraSystemSpawnSectionStartBehavior : uint8 {
	ENiagaraSystemSpawnSectionStartBehavior = 0
	ENiagaraSystemSpawnSectionStartBehavior = 1
};

// Enum Niagara.ENiagaraCollisionMode
enum class ENiagaraCollisionMode : uint8 {
	ENiagaraCollisionMode = 0
	ENiagaraCollisionMode = 1
	ENiagaraCollisionMode = 2
	ENiagaraCollisionMode = 3
	ENiagaraCollisionMode = 4
};

// Enum Niagara.ENiagaraLegacyTrailWidthMode
enum class ENiagaraLegacyTrailWidthMode : uint8 {
	ENiagaraLegacyTrailWidthMode = 0
	ENiagaraLegacyTrailWidthMode = 1
	ENiagaraLegacyTrailWidthMode = 2
	ENiagaraLegacyTrailWidthMode = 3
};

// Enum Niagara.ENiagaraIterationSource
enum class ENiagaraIterationSource : uint8 {
	ENiagaraIterationSource = 0
	ENiagaraIterationSource = 1
	ENiagaraIterationSource = 2
};

// Enum Niagara.ENiagaraScriptGroup
enum class ENiagaraScriptGroup : uint8 {
	ENiagaraScriptGroup = 0
	ENiagaraScriptGroup = 1
	ENiagaraScriptGroup = 2
	ENiagaraScriptGroup = 3
};

// Enum Niagara.ENiagaraScriptUsage
enum class ENiagaraScriptUsage : uint8 {
	ENiagaraScriptUsage = 0
	ENiagaraScriptUsage = 1
	ENiagaraScriptUsage = 2
	ENiagaraScriptUsage = 3
	ENiagaraScriptUsage = 4
	ENiagaraScriptUsage = 5
	ENiagaraScriptUsage = 6
	ENiagaraScriptUsage = 7
	ENiagaraScriptUsage = 8
	ENiagaraScriptUsage = 9
	ENiagaraScriptUsage = 10
	ENiagaraScriptUsage = 11
	ENiagaraScriptUsage = 12
	ENiagaraScriptUsage = 13
};

// Enum Niagara.ENiagaraScriptCompileStatus
enum class ENiagaraScriptCompileStatus : uint8 {
	ENiagaraScriptCompileStatus = 0
	ENiagaraScriptCompileStatus = 1
	ENiagaraScriptCompileStatus = 2
	ENiagaraScriptCompileStatus = 3
	ENiagaraScriptCompileStatus = 4
	ENiagaraScriptCompileStatus = 5
	ENiagaraScriptCompileStatus = 6
	ENiagaraScriptCompileStatus = 7
};

// Enum Niagara.ENiagaraInputNodeUsage
enum class ENiagaraInputNodeUsage : uint8 {
	ENiagaraInputNodeUsage = 0
	ENiagaraInputNodeUsage = 1
	ENiagaraInputNodeUsage = 2
	ENiagaraInputNodeUsage = 3
	ENiagaraInputNodeUsage = 4
	ENiagaraInputNodeUsage = 5
	ENiagaraInputNodeUsage = 6
};

// Enum Niagara.ENiagaraDataSetType
enum class ENiagaraDataSetType : uint8 {
	ENiagaraDataSetType = 0
	ENiagaraDataSetType = 1
	ENiagaraDataSetType = 2
	ENiagaraDataSetType = 3
};

// Enum Niagara.ENiagaraAgeUpdateMode
enum class ENiagaraAgeUpdateMode : uint8 {
	ENiagaraAgeUpdateMode = 0
	ENiagaraAgeUpdateMode = 1
	ENiagaraAgeUpdateMode = 2
	ENiagaraAgeUpdateMode = 3
};

// Enum Niagara.ENiagaraSimTarget
enum class ENiagaraSimTarget : uint8 {
	ENiagaraSimTarget = 0
	ENiagaraSimTarget = 1
	ENiagaraSimTarget = 2
};

// Enum Niagara.ENiagaraDefaultMode
enum class ENiagaraDefaultMode : uint8 {
	ENiagaraDefaultMode = 0
	ENiagaraDefaultMode = 1
	ENiagaraDefaultMode = 2
	ENiagaraDefaultMode = 3
};

// Enum Niagara.ENiagaraTickBehavior
enum class ENiagaraTickBehavior : uint8 {
	ENiagaraTickBehavior = 0
	ENiagaraTickBehavior = 1
	ENiagaraTickBehavior = 2
	ENiagaraTickBehavior = 3
	ENiagaraTickBehavior = 4
};

// Enum Niagara.ENCPoolMethod
enum class ENCPoolMethod : uint8 {
	ENCPoolMethod = 0
	ENCPoolMethod = 1
	ENCPoolMethod = 2
	ENCPoolMethod = 3
	ENCPoolMethod = 4
	ENCPoolMethod = 5
};

// Enum Niagara.ENDISkeletalMesh_SkinningMode
enum class ENDISkeletalMesh_SkinningMode : uint8 {
	ENDISkeletalMesh_SkinningMode = 255
	ENDISkeletalMesh_SkinningMode = 0
	ENDISkeletalMesh_SkinningMode = 1
	ENDISkeletalMesh_SkinningMode = 2
	ENDISkeletalMesh_SkinningMode = 256
};

// Enum Niagara.ENiagaraScalabilityUpdateFrequency
enum class ENiagaraScalabilityUpdateFrequency : uint8 {
	ENiagaraScalabilityUpdateFrequency = 0
	ENiagaraScalabilityUpdateFrequency = 1
	ENiagaraScalabilityUpdateFrequency = 2
	ENiagaraScalabilityUpdateFrequency = 3
	ENiagaraScalabilityUpdateFrequency = 4
	ENiagaraScalabilityUpdateFrequency = 5
};

// Enum Niagara.ENiagaraCullReaction
enum class ENiagaraCullReaction : uint8 {
	ENiagaraCullReaction = 0
	ENiagaraCullReaction = 1
	ENiagaraCullReaction = 2
	ENiagaraCullReaction = 3
	ENiagaraCullReaction = 4
};

// Enum Niagara.EParticleAllocationMode
enum class EParticleAllocationMode : uint8 {
	EParticleAllocationMode = 0
	EParticleAllocationMode = 1
	EParticleAllocationMode = 2
};

// Enum Niagara.EScriptExecutionMode
enum class EScriptExecutionMode : uint8 {
	EScriptExecutionMode = 0
	EScriptExecutionMode = 1
	EScriptExecutionMode = 2
	EScriptExecutionMode = 3
};

// Enum Niagara.ENiagaraSortMode
enum class ENiagaraSortMode : uint8 {
	ENiagaraSortMode = 0
	ENiagaraSortMode = 1
	ENiagaraSortMode = 2
	ENiagaraSortMode = 3
	ENiagaraSortMode = 4
	ENiagaraSortMode = 5
};

// Enum Niagara.ENiagaraMeshLockedAxisSpace
enum class ENiagaraMeshLockedAxisSpace : uint8 {
	ENiagaraMeshLockedAxisSpace = 0
	ENiagaraMeshLockedAxisSpace = 1
	ENiagaraMeshLockedAxisSpace = 2
	ENiagaraMeshLockedAxisSpace = 3
};

// Enum Niagara.ENiagaraMeshFacingMode
enum class ENiagaraMeshFacingMode : uint8 {
	ENiagaraMeshFacingMode = 0
	ENiagaraMeshFacingMode = 1
	ENiagaraMeshFacingMode = 2
	ENiagaraMeshFacingMode = 3
	ENiagaraMeshFacingMode = 4
};

// Enum Niagara.ENiagaraPlatformSetState
enum class ENiagaraPlatformSetState : uint8 {
	ENiagaraPlatformSetState = 0
	ENiagaraPlatformSetState = 1
	ENiagaraPlatformSetState = 2
	ENiagaraPlatformSetState = 3
	ENiagaraPlatformSetState = 4
};

// Enum Niagara.ENiagaraPlatformSelectionState
enum class ENiagaraPlatformSelectionState : uint8 {
	ENiagaraPlatformSelectionState = 0
	ENiagaraPlatformSelectionState = 1
	ENiagaraPlatformSelectionState = 2
	ENiagaraPlatformSelectionState = 3
};

// Enum Niagara.ENiagaraPreviewGridResetMode
enum class ENiagaraPreviewGridResetMode : uint8 {
	ENiagaraPreviewGridResetMode = 0
	ENiagaraPreviewGridResetMode = 1
	ENiagaraPreviewGridResetMode = 2
	ENiagaraPreviewGridResetMode = 3
};

// Enum Niagara.ENiagaraRibbonTessellationMode
enum class ENiagaraRibbonTessellationMode : uint8 {
	ENiagaraRibbonTessellationMode = 0
	ENiagaraRibbonTessellationMode = 1
	ENiagaraRibbonTessellationMode = 2
	ENiagaraRibbonTessellationMode = 3
};

// Enum Niagara.ENiagaraRibbonDrawDirection
enum class ENiagaraRibbonDrawDirection : uint8 {
	ENiagaraRibbonDrawDirection = 0
	ENiagaraRibbonDrawDirection = 1
	ENiagaraRibbonDrawDirection = 2
};

// Enum Niagara.ENiagaraRibbonAgeOffsetMode
enum class ENiagaraRibbonAgeOffsetMode : uint8 {
	ENiagaraRibbonAgeOffsetMode = 0
	ENiagaraRibbonAgeOffsetMode = 1
	ENiagaraRibbonAgeOffsetMode = 2
};

// Enum Niagara.ENiagaraRibbonFacingMode
enum class ENiagaraRibbonFacingMode : uint8 {
	ENiagaraRibbonFacingMode = 0
	ENiagaraRibbonFacingMode = 1
	ENiagaraRibbonFacingMode = 2
	ENiagaraRibbonFacingMode = 3
};

// Enum Niagara.ENiagaraModuleDependencyScriptConstraint
enum class ENiagaraModuleDependencyScriptConstraint : uint8 {
	ENiagaraModuleDependencyScriptConstraint = 0
	ENiagaraModuleDependencyScriptConstraint = 1
	ENiagaraModuleDependencyScriptConstraint = 2
};

// Enum Niagara.ENiagaraModuleDependencyType
enum class ENiagaraModuleDependencyType : uint8 {
	ENiagaraModuleDependencyType = 0
	ENiagaraModuleDependencyType = 1
	ENiagaraModuleDependencyType = 2
};

// Enum Niagara.EUnusedAttributeBehaviour
enum class EUnusedAttributeBehaviour : uint8 {
	EUnusedAttributeBehaviour = 0
	EUnusedAttributeBehaviour = 1
	EUnusedAttributeBehaviour = 2
	EUnusedAttributeBehaviour = 3
	EUnusedAttributeBehaviour = 4
	EUnusedAttributeBehaviour = 5
};

// Enum Niagara.ENiagaraSpriteFacingMode
enum class ENiagaraSpriteFacingMode : uint8 {
	ENiagaraSpriteFacingMode = 0
	ENiagaraSpriteFacingMode = 1
	ENiagaraSpriteFacingMode = 2
	ENiagaraSpriteFacingMode = 3
	ENiagaraSpriteFacingMode = 4
	ENiagaraSpriteFacingMode = 5
};

// Enum Niagara.ENiagaraSpriteAlignment
enum class ENiagaraSpriteAlignment : uint8 {
	ENiagaraSpriteAlignment = 0
	ENiagaraSpriteAlignment = 1
	ENiagaraSpriteAlignment = 2
	ENiagaraSpriteAlignment = 3
};

// Enum Niagara.ENiagaraParameterPanelCategory
enum class ENiagaraParameterPanelCategory : uint8 {
	ENiagaraParameterPanelCategory = 0
	ENiagaraParameterPanelCategory = 1
	ENiagaraParameterPanelCategory = 2
	ENiagaraParameterPanelCategory = 3
	ENiagaraParameterPanelCategory = 4
	ENiagaraParameterPanelCategory = 5
	ENiagaraParameterPanelCategory = 6
	ENiagaraParameterPanelCategory = 7
	ENiagaraParameterPanelCategory = 8
	ENiagaraParameterPanelCategory = 9
	ENiagaraParameterPanelCategory = 10
	ENiagaraParameterPanelCategory = 11
	ENiagaraParameterPanelCategory = 12
	ENiagaraParameterPanelCategory = 13
	ENiagaraParameterPanelCategory = 14
};

// Enum Niagara.ENiagaraScriptParameterUsage
enum class ENiagaraScriptParameterUsage : uint8 {
	ENiagaraScriptParameterUsage = 0
	ENiagaraScriptParameterUsage = 1
	ENiagaraScriptParameterUsage = 2
	ENiagaraScriptParameterUsage = 3
	ENiagaraScriptParameterUsage = 4
	ENiagaraScriptParameterUsage = 5
	ENiagaraScriptParameterUsage = 6
	ENiagaraScriptParameterUsage = 7
};

// Enum Niagara.ENiagaraParameterScope
enum class ENiagaraParameterScope : uint8 {
	ENiagaraParameterScope = 0
	ENiagaraParameterScope = 1
	ENiagaraParameterScope = 2
	ENiagaraParameterScope = 3
	ENiagaraParameterScope = 4
	ENiagaraParameterScope = 5
	ENiagaraParameterScope = 6
	ENiagaraParameterScope = 7
	ENiagaraParameterScope = 8
	ENiagaraParameterScope = 9
	ENiagaraParameterScope = 10
	ENiagaraParameterScope = 11
	ENiagaraParameterScope = 12
	ENiagaraParameterScope = 13
	ENiagaraParameterScope = 14
	ENiagaraParameterScope = 15
};

// Enum Niagara.ENiagaraExecutionState
enum class ENiagaraExecutionState : uint8 {
	ENiagaraExecutionState = 0
	ENiagaraExecutionState = 1
	ENiagaraExecutionState = 2
	ENiagaraExecutionState = 3
	ENiagaraExecutionState = 4
	ENiagaraExecutionState = 5
	ENiagaraExecutionState = 6
};

// Enum Niagara.ENiagaraExecutionStateSource
enum class ENiagaraExecutionStateSource : uint8 {
	ENiagaraExecutionStateSource = 0
	ENiagaraExecutionStateSource = 1
	ENiagaraExecutionStateSource = 2
	ENiagaraExecutionStateSource = 3
	ENiagaraExecutionStateSource = 4
};

// Enum Niagara.ENiagaraNumericOutputTypeSelectionMode
enum class ENiagaraNumericOutputTypeSelectionMode : uint8 {
	ENiagaraNumericOutputTypeSelectionMode = 0
	ENiagaraNumericOutputTypeSelectionMode = 1
	ENiagaraNumericOutputTypeSelectionMode = 2
	ENiagaraNumericOutputTypeSelectionMode = 3
	ENiagaraNumericOutputTypeSelectionMode = 4
};

// Enum Niagara.ENiagaraVariantMode
enum class ENiagaraVariantMode : uint8 {
	ENiagaraVariantMode = 0
	ENiagaraVariantMode = 1
	ENiagaraVariantMode = 2
	ENiagaraVariantMode = 3
	ENiagaraVariantMode = 4
};

// Class Niagara.MovieSceneNiagaraTrack
struct UMovieSceneNiagaraTrack : UMovieSceneNameableTrack {
	struct TArray<Unknown> Sections; // 0x58 (16)
};

// Class Niagara.MovieSceneNiagaraParameterTrack
struct UMovieSceneNiagaraParameterTrack : UMovieSceneNiagaraTrack {
	struct Unknown Parameter; // 0x68 (40)
};

// Class Niagara.MovieSceneNiagaraSystemSpawnSection
struct UMovieSceneNiagaraSystemSpawnSection : UMovieSceneSection {
	enum class Unknow SectionStartBehavior; // 0xE0 (4)
	enum class Unknow SectionEvaluateBehavior; // 0xE4 (4)
	enum class Unknow SectionEndBehavior; // 0xE8 (4)
	enum class Unknow AgeUpdateMode; // 0xEC (1)
};

// Class Niagara.MovieSceneNiagaraVectorParameterTrack
struct UMovieSceneNiagaraVectorParameterTrack : UMovieSceneNiagaraParameterTrack {
	int32_t ChannelsUsed; // 0x90 (4)
};

// Class Niagara.NiagaraActor
struct ANiagaraActor : UActor {
	struct Unknown NiagaraComponent; // 0x310 (8)
	char bDestroyOnSystemFinish : 0; // 0x318 (1)

	void SetDestroyOnSystemFinish(char bShouldDestroyOnSystemFinish); // Function Niagara.NiagaraActor.SetDestroyOnSystemFinish(Final|RequiredAPI|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507E60>
	void OnNiagaraSystemFinished(struct Unknown FinishedComponent); // Function Niagara.NiagaraActor.OnNiagaraSystemFinished(Final|Native|Private) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15079F0>
};

// Class Niagara.NiagaraComponent
struct UNiagaraComponent : UFXSystemComponent {
	struct Unknown Asset; // 0x4B8 (8)
	enum class Unknow TickBehavior; // 0x4C0 (1)
	struct Unknown OverrideParameters; // 0x4C8 (264)
	char bForceSolo : 0; // 0x5D0 (1)
	char bAutoDestroy : 0; // 0x5FC (1)
	char b : 0; // 0x5FC (1)
	char bAutoManageAttachment : 0; // 0x5FC (1)
	char bAutoAttachWeldSimulatedBodies : 0; // 0x5FC (1)
	float MaxTimeBeforeForceUpdateTransform; // 0x600 (4)
	struct FMulticastInlineDelegate OnSystemFinished; // 0x608 (16)
	struct TWeakObjectPtr<struct Unknown> AutoAttachParent; // 0x618 (8)
	struct FName AutoAttachSocketName; // 0x620 (8)
	enum class Unknow AutoAttachLocationRule; // 0x628 (1)
	enum class Unknow AutoAttachRotationRule; // 0x629 (1)
	enum class Unknow AutoAttachScaleRule; // 0x62A (1)

	void SetVariableVec4(struct FName InVariableName, struct Unknown& InValue); // Function Niagara.NiagaraComponent.SetVariableVec4(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509290>
	void SetVariableVec3(struct FName InVariableName, struct Unknown InValue); // Function Niagara.NiagaraComponent.SetVariableVec3(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15091C0>
	void SetVariableVec2(struct FName InVariableName, struct Unknown InValue); // Function Niagara.NiagaraComponent.SetVariableVec2(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509100>
	void SetVariableQuat(struct FName InVariableName, struct Unknown& InValue); // Function Niagara.NiagaraComponent.SetVariableQuat(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1509030>
	void SetVariableObject(struct FName InVariableName, struct Unknown Object); // Function Niagara.NiagaraComponent.SetVariableObject(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508F70>
	void SetVariableMaterial(struct FName InVariableName, struct Unknown Object); // Function Niagara.NiagaraComponent.SetVariableMaterial(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508EB0>
	void SetVariableLinearColor(struct FName InVariableName, struct Unknown& InValue); // Function Niagara.NiagaraComponent.SetVariableLinearColor(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508DE0>
	void SetVariableInt(struct FName InVariableName, int32_t InValue); // Function Niagara.NiagaraComponent.SetVariableInt(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508D20>
	void SetVariableFloat(struct FName InVariableName, float InValue); // Function Niagara.NiagaraComponent.SetVariableFloat(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508C50>
	void SetVariableBool(struct FName InVariableName, char InValue); // Function Niagara.NiagaraComponent.SetVariableBool(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508B80>
	void SetVariableActor(struct FName InVariableName, struct Unknown Actor); // Function Niagara.NiagaraComponent.SetVariableActor(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508AC0>
	void SetSeekDelta(float InSeekDelta); // Function Niagara.NiagaraComponent.SetSeekDelta(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508A40>
	void SetRenderingEnabled(char bInRenderingEnabled); // Function Niagara.NiagaraComponent.SetRenderingEnabled(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15089B0>
	void SetPreviewLODDistance(char bEnablePreviewLODDistance, float PreviewLODDistance); // Function Niagara.NiagaraComponent.SetPreviewLODDistance(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15088E0>
	void SetPaused(char bInPaused); // Function Niagara.NiagaraComponent.SetPaused(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508850>
	void SetNiagaraVariableVec4(struct FString InVariableName, struct Unknown& InValue); // Function Niagara.NiagaraComponent.SetNiagaraVariableVec4(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508750>
	void SetNiagaraVariableVec3(struct FString InVariableName, struct Unknown InValue); // Function Niagara.NiagaraComponent.SetNiagaraVariableVec3(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508660>
	void SetNiagaraVariableVec2(struct FString InVariableName, struct Unknown InValue); // Function Niagara.NiagaraComponent.SetNiagaraVariableVec2(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508580>
	void SetNiagaraVariableQuat(struct FString InVariableName, struct Unknown& InValue); // Function Niagara.NiagaraComponent.SetNiagaraVariableQuat(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508490>
	void SetNiagaraVariableObject(struct FString InVariableName, struct Unknown Object); // Function Niagara.NiagaraComponent.SetNiagaraVariableObject(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508000>
	void SetNiagaraVariableLinearColor(struct FString InVariableName, struct Unknown& InValue); // Function Niagara.NiagaraComponent.SetNiagaraVariableLinearColor(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15083A0>
	void SetNiagaraVariableInt(struct FString InVariableName, int32_t InValue); // Function Niagara.NiagaraComponent.SetNiagaraVariableInt(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15082C0>
	void SetNiagaraVariableFloat(struct FString InVariableName, float InValue); // Function Niagara.NiagaraComponent.SetNiagaraVariableFloat(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15081D0>
	void SetNiagaraVariableBool(struct FString InVariableName, char InValue); // Function Niagara.NiagaraComponent.SetNiagaraVariableBool(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15080E0>
	void SetNiagaraVariableActor(struct FString InVariableName, struct Unknown Actor); // Function Niagara.NiagaraComponent.SetNiagaraVariableActor(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1508000>
	void SetMaxSimTime(float InMaxTime); // Function Niagara.NiagaraComponent.SetMaxSimTime(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507F80>
	void SetForceSolo(char bInForceSolo); // Function Niagara.NiagaraComponent.SetForceSolo(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507EF0>
	void SetDesiredAge(float InDesiredAge); // Function Niagara.NiagaraComponent.SetDesiredAge(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507DE0>
	void SetCanRenderWhileSeeking(char bInCanRenderWhileSeeking); // Function Niagara.NiagaraComponent.SetCanRenderWhileSeeking(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507D50>
	void SetAutoDestroy(char bInAutoDestroy); // Function Niagara.NiagaraComponent.SetAutoDestroy(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507CC0>
	void SetAsset(struct Unknown InAsset); // Function Niagara.NiagaraComponent.SetAsset(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507C40>
	void SetAllowScalability(char bAllow); // Function Niagara.NiagaraComponent.SetAllowScalability(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507BB0>
	void SetAgeUpdateMode(enum class Unknow InAgeUpdateMode); // Function Niagara.NiagaraComponent.SetAgeUpdateMode(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507B30>
	void SeekToDesiredAge(float InDesiredAge); // Function Niagara.NiagaraComponent.SeekToDesiredAge(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507AB0>
	void ResetSystem(); // Function Niagara.NiagaraComponent.ResetSystem(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507A90>
	void ReinitializeSystem(); // Function Niagara.NiagaraComponent.ReinitializeSystem(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507A70>
	char IsPaused(); // Function Niagara.NiagaraComponent.IsPaused(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15079C0>
	float GetSeekDelta(); // Function Niagara.NiagaraComponent.GetSeekDelta(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507990>
	char GetPreviewLODDistanceEnabled(); // Function Niagara.NiagaraComponent.GetPreviewLODDistanceEnabled(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507970>
	int32_t GetPreviewLODDistance(); // Function Niagara.NiagaraComponent.GetPreviewLODDistance(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507950>
	struct TArray<Unknown> GetNiagaraParticleValueVec3_DebugOnly(struct FString InEmitterName, struct FString InValueName); // Function Niagara.NiagaraComponent.GetNiagaraParticleValueVec3_DebugOnly(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15076B0>
	struct TArray<Unknown> GetNiagaraParticleValues_DebugOnly(struct FString InEmitterName, struct FString InValueName); // Function Niagara.NiagaraComponent.GetNiagaraParticleValues_DebugOnly(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507800>
	struct TArray<Unknown> GetNiagaraParticlePositions_DebugOnly(struct FString InEmitterName); // Function Niagara.NiagaraComponent.GetNiagaraParticlePositions_DebugOnly(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15075C0>
	float GetMaxSimTime(); // Function Niagara.NiagaraComponent.GetMaxSimTime(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507590>
	char GetForceSolo(); // Function Niagara.NiagaraComponent.GetForceSolo(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507560>
	float GetDesiredAge(); // Function Niagara.NiagaraComponent.GetDesiredAge(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507530>
	struct Unknown GetDataInterface(struct FString Name); // Function Niagara.NiagaraComponent.GetDataInterface(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507480>
	struct Unknown GetAsset(); // Function Niagara.NiagaraComponent.GetAsset(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507460>
	enum class Unknow GetAgeUpdateMode(); // Function Niagara.NiagaraComponent.GetAgeUpdateMode(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507430>
	void AdvanceSimulationByTime(float SimulateTime, float TickDeltaSeconds); // Function Niagara.NiagaraComponent.AdvanceSimulationByTime(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1507370>
	void AdvanceSimulation(int32_t TickCount, float TickDeltaSeconds); // Function Niagara.NiagaraComponent.AdvanceSimulation(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15072A0>
};

// Class Niagara.NiagaraComponentPool
struct UNiagaraComponentPool : Object {
	struct TMap<Unknown, Unknown>Unknown WorldParticleSystemPools; // 0x28 (80)
};

// Class Niagara.NiagaraDataInterfaceAudioSubmix
struct UNiagaraDataInterfaceAudioSubmix : UNiagaraDataInterface {
	struct Unknown Submix; // 0x30 (8)
};

// Class Niagara.NiagaraDataInterfaceAudioOscilloscope
struct UNiagaraDataInterfaceAudioOscilloscope : UNiagaraDataInterface {
	struct Unknown Submix; // 0x30 (8)
	int32_t Resolution; // 0x38 (4)
	float ScopeInMilliseconds; // 0x3C (4)
};

// Class Niagara.NiagaraDataInterfaceAudioSpectrum
struct UNiagaraDataInterfaceAudioSpectrum : UNiagaraDataInterfaceAudioSubmix {
	int32_t Resolution; // 0x38 (4)
	float MinimumFrequency; // 0x3C (4)
	float MaximumFrequency; // 0x40 (4)
	float NoiseFloorDb; // 0x44 (4)
};

// Class Niagara.NiagaraDataInterfaceCamera
struct UNiagaraDataInterfaceCamera : UNiagaraDataInterface {
	int32_t PlayerControllerIndex; // 0x30 (4)
};

// Class Niagara.NiagaraDataInterfaceCurveBase
struct UNiagaraDataInterfaceCurveBase : UNiagaraDataInterface {
	struct TArray<Unknown> ShaderLUT; // 0x30 (16)
	float LUTMinTime; // 0x40 (4)
	float LUTMaxTime; // 0x44 (4)
	float LUTInvTimeRange; // 0x48 (4)
	float LUTNumSamplesMinusOne; // 0x4C (4)
	char bUseLUT : 0; // 0x50 (1)
};

// Class Niagara.NiagaraDataInterfaceColorCurve
struct UNiagaraDataInterfaceColorCurve : UNiagaraDataInterfaceCurveBase {
	struct Unknown RedCurve; // 0x58 (128)
	struct Unknown GreenCurve; // 0xD8 (128)
	struct Unknown BlueCurve; // 0x158 (128)
	struct Unknown AlphaCurve; // 0x1D8 (128)
};

// Class Niagara.NiagaraDataInterfaceCurlNoise
struct UNiagaraDataInterfaceCurlNoise : UNiagaraDataInterface {
	uint32_t Seed; // 0x30 (4)
};

// Class Niagara.NiagaraDataInterfaceCurve
struct UNiagaraDataInterfaceCurve : UNiagaraDataInterfaceCurveBase {
	struct Unknown Curve; // 0x58 (128)
};

// Class Niagara.NiagaraDataInterfaceExport
struct UNiagaraDataInterfaceExport : UNiagaraDataInterface {
	struct Unknown CallbackHandlerParameter; // 0x30 (40)
};

// Class Niagara.NiagaraDataInterfaceRWBase
struct UNiagaraDataInterfaceRWBase : UNiagaraDataInterface {
	struct TSet<Unknown> OutputShaderStages; // 0x30 (80)
	struct TSet<Unknown> IterationShaderStages; // 0x80 (80)
};

// Class Niagara.NiagaraDataInterfaceGrid2D
struct UNiagaraDataInterfaceGrid2D : UNiagaraDataInterfaceRWBase {
	int32_t NumCellsX; // 0xD0 (4)
	int32_t NumCellsY; // 0xD4 (4)
	int32_t NumCellsMaxAxis; // 0xD8 (4)
	int32_t NumAttributes; // 0xDC (4)
	char SetGridFromMaxAxis : 0; // 0xE0 (1)
	struct Unknown WorldBBoxSize; // 0xE4 (8)
};

// Class Niagara.NiagaraDataInterfaceGrid3D
struct UNiagaraDataInterfaceGrid3D : UNiagaraDataInterfaceRWBase {
	struct Unknown NumVoxels; // 0xD0 (12)
	float VoxelSize; // 0xDC (4)
	char SetGridFromVoxelSize : 0; // 0xE0 (1)
	struct Unknown WorldBBoxSize; // 0xE4 (12)
};

// Class Niagara.NiagaraDataInterfaceNeighborGrid3D
struct UNiagaraDataInterfaceNeighborGrid3D : UNiagaraDataInterfaceGrid3D {
	uint32_t MaxNeighborsPerVoxel; // 0xF0 (4)
};

// Class Niagara.NiagaraDataInterfaceParticleRead
struct UNiagaraDataInterfaceParticleRead : UNiagaraDataInterface {
	struct FString EmitterName; // 0x30 (16)
};

// Class Niagara.NiagaraDataInterfaceSkeletalMesh
struct UNiagaraDataInterfaceSkeletalMesh : UNiagaraDataInterface {
	struct Unknown Source; // 0x30 (8)
	struct Unknown MeshUserParameter; // 0x38 (40)
	struct Unknown SourceComponent; // 0x60 (8)
	enum class Unknow SkinningMode; // 0x68 (1)
	struct TArray<Unknown> SamplingRegions; // 0x70 (16)
	int32_t WholeMeshLOD; // 0x80 (4)
	struct TArray<Unknown> FilteredBones; // 0x88 (16)
	struct TArray<Unknown> FilteredSockets; // 0x98 (16)
	struct FName ExcludeBoneName; // 0xA8 (8)
	char bExcludeBone : 0; // 0xB0 (1)
};

// Class Niagara.NiagaraDataInterfaceSpline
struct UNiagaraDataInterfaceSpline : UNiagaraDataInterface {
	struct Unknown Source; // 0x30 (8)
};

// Class Niagara.NiagaraDataInterfaceStaticMesh
struct UNiagaraDataInterfaceStaticMesh : UNiagaraDataInterface {
	struct Unknown DefaultMesh; // 0x30 (8)
	struct Unknown Source; // 0x38 (8)
	struct Unknown SourceComponent; // 0x40 (8)
	struct Unknown SectionFilter; // 0x48 (16)
};

// Class Niagara.NiagaraDataInterfaceTexture
struct UNiagaraDataInterfaceTexture : UNiagaraDataInterface {
	struct Unknown Texture; // 0x30 (8)
};

// Class Niagara.NiagaraDataInterfaceVector2DCurve
struct UNiagaraDataInterfaceVector2DCurve : UNiagaraDataInterfaceCurveBase {
	struct Unknown XCurve; // 0x58 (128)
	struct Unknown YCurve; // 0xD8 (128)
};

// Class Niagara.NiagaraDataInterfaceVector4Curve
struct UNiagaraDataInterfaceVector4Curve : UNiagaraDataInterfaceCurveBase {
	struct Unknown XCurve; // 0x58 (128)
	struct Unknown YCurve; // 0xD8 (128)
	struct Unknown ZCurve; // 0x158 (128)
	struct Unknown WCurve; // 0x1D8 (128)
};

// Class Niagara.NiagaraDataInterfaceVectorCurve
struct UNiagaraDataInterfaceVectorCurve : UNiagaraDataInterfaceCurveBase {
	struct Unknown XCurve; // 0x58 (128)
	struct Unknown YCurve; // 0xD8 (128)
	struct Unknown ZCurve; // 0x158 (128)
};

// Class Niagara.NiagaraDataInterfaceVectorField
struct UNiagaraDataInterfaceVectorField : UNiagaraDataInterface {
	struct Unknown Field; // 0x30 (8)
	char bTileX : 0; // 0x38 (1)
	char bTileY : 0; // 0x39 (1)
	char bTileZ : 0; // 0x3A (1)
};

// Class Niagara.NiagaraDataInterfaceVolumeTexture
struct UNiagaraDataInterfaceVolumeTexture : UNiagaraDataInterface {
	struct Unknown Texture; // 0x30 (8)
};

// Class Niagara.NiagaraEffectType
struct UNiagaraEffectType : Object {
	enum class Unknow UpdateFrequency; // 0x28 (4)
	enum class Unknow CullReaction; // 0x2C (4)
	struct TArray<Unknown> DetailLevelScalabilitySettings; // 0x30 (16)
	struct Unknown SystemScalabilitySettings; // 0x40 (16)
	struct Unknown EmitterScalabilitySettings; // 0x50 (16)
};

// Class Niagara.NiagaraEmitter
struct UNiagaraEmitter : Object {
	char bLocalSpace : 0; // 0x28 (1)
	char bDeterminism : 0; // 0x29 (1)
	int32_t RandomSeed; // 0x2C (4)
	enum class Unknow AllocationMode; // 0x30 (1)
	int32_t PreAllocationCount; // 0x34 (4)
	struct Unknown UpdateScriptProps; // 0x38 (40)
	struct Unknown SpawnScriptProps; // 0x60 (40)
	struct Unknown EmitterSpawnScriptProps; // 0x88 (40)
	struct Unknown EmitterUpdateScriptProps; // 0xB0 (40)
	enum class Unknow SimTarget; // 0xD8 (1)
	struct Unknown FixedBounds; // 0xDC (28)
	int32_t MinDetailLevel; // 0xF8 (4)
	int32_t MaxDetailLevel; // 0xFC (4)
	struct Unknown GlobalSpawnCountScaleOverrides; // 0x100 (20)
	struct Unknown Platforms; // 0x118 (32)
	struct Unknown ScalabilityOverrides; // 0x138 (16)
	char bInterpolatedSpawning : 0; // 0x148 (1)
	char bFixedBounds : 0; // 0x148 (1)
	char bUseMinDetailLevel : 0; // 0x148 (1)
	char bUseMaxDetailLevel : 0; // 0x148 (1)
	char bOverrideGlobalSpawnCountScale : 0; // 0x148 (1)
	char b : 0; // 0x148 (1)
	float MaxDeltaTimePerTick; // 0x14C (4)
	uint32_t DefaultShaderStageIndex; // 0x150 (4)
	uint32_t MaxUpdateIterations; // 0x154 (4)
	struct TSet<Unknown> SpawnStages; // 0x158 (80)
	char bSimulationStagesEnabled : 0; // 0x1A8 (1)
	char bDeprecatedShaderStagesEnabled : 0; // 0x1A8 (1)
	char bLimitDeltaTime : 0; // 0x1A8 (1)
	struct FString UniqueEmitterName; // 0x1B0 (16)
	struct TArray<Unknown> RendererProperties; // 0x1C0 (16)
	struct TArray<Unknown> EventHandlerScriptProps; // 0x1D0 (16)
	struct TArray<Unknown> SimulationStages; // 0x1E0 (16)
	struct Unknown GPUComputeScript; // 0x1F0 (8)
	struct TArray<Unknown> SharedEventGeneratorIds; // 0x1F8 (16)
};

// Class Niagara.NiagaraEventReceiverEmitterAction_SpawnParticles
struct UNiagaraEventReceiverEmitterAction_SpawnParticles : UNiagaraEventReceiverEmitterAction {
	uint32_t NumParticles; // 0x28 (4)
};

// Class Niagara.NiagaraRendererProperties
struct UNiagaraRendererProperties : UNiagaraMergeable {
	int32_t SortOrderHint; // 0x28 (4)
	char bIsEnabled : 0; // 0x2C (1)
	char bMotionBlurEnabled : 0; // 0x2D (1)
};

// Class Niagara.NiagaraLightRendererProperties
struct UNiagaraLightRendererProperties : UNiagaraRendererProperties {
	char bUseInverseSquaredFalloff : 0; // 0x50 (1)
	char bAffectsTranslucency : 0; // 0x50 (1)
	char bOverrideRenderingEnabled : 0; // 0x50 (1)
	float RadiusScale; // 0x54 (4)
	struct Unknown ColorAdd; // 0x58 (12)
	struct Unknown LightRenderingEnabledBinding; // 0x68 (120)
	struct Unknown LightExponentBinding; // 0xE0 (120)
	struct Unknown PositionBinding; // 0x158 (120)
	struct Unknown ColorBinding; // 0x1D0 (120)
	struct Unknown RadiusBinding; // 0x248 (120)
	struct Unknown VolumetricScatteringBinding; // 0x2C0 (120)
};

// Class Niagara.NiagaraMeshRendererProperties
struct UNiagaraMeshRendererProperties : UNiagaraRendererProperties {
	struct Unknown ParticleMesh; // 0x50 (8)
	enum class Unknow SortMode; // 0x58 (1)
	char bOverrideMaterials : 0; // 0x5C (1)
	char bSortOnlyWhenTranslucent : 0; // 0x5C (1)
	struct TArray<Unknown> OverrideMaterials; // 0x60 (16)
	struct Unknown SubImageSize; // 0x70 (8)
	char bSubImageBlend : 0; // 0x78 (1)
	enum class Unknow FacingMode; // 0x7C (1)
	char bLockedAxisEnable : 0; // 0x80 (1)
	struct Unknown LockedAxis; // 0x84 (12)
	enum class Unknow LockedAxisSpace; // 0x90 (1)
	struct Unknown PositionBinding; // 0x98 (120)
	struct Unknown ColorBinding; // 0x110 (120)
	struct Unknown VelocityBinding; // 0x188 (120)
	struct Unknown MeshOrientationBinding; // 0x200 (120)
	struct Unknown ScaleBinding; // 0x278 (120)
	struct Unknown SubImageIndexBinding; // 0x2F0 (120)
	struct Unknown DynamicMaterialBinding; // 0x368 (120)
	struct Unknown DynamicMaterial1Binding; // 0x3E0 (120)
	struct Unknown DynamicMaterial2Binding; // 0x458 (120)
	struct Unknown DynamicMaterial3Binding; // 0x4D0 (120)
	struct Unknown MaterialRandomBinding; // 0x548 (120)
	struct Unknown CustomSortingBinding; // 0x5C0 (120)
	struct Unknown NormalizedAgeBinding; // 0x638 (120)
	struct Unknown CameraOffsetBinding; // 0x6B0 (120)
};

// Class Niagara.NiagaraParameterCollectionInstance
struct UNiagaraParameterCollectionInstance : Object {
	struct Unknown Collection; // 0x28 (8)
	struct TArray<Unknown> OverridenParameters; // 0x30 (16)
	struct Unknown ParameterStorage; // 0x40 (184)

	void SetVectorParameter(struct FString InVariableName, struct Unknown InValue); // Function Niagara.NiagaraParameterCollectionInstance.SetVectorParameter(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1514D50>
	void SetVector4Parameter(struct FString InVariableName, struct Unknown& InValue); // Function Niagara.NiagaraParameterCollectionInstance.SetVector4Parameter(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1514C50>
	void SetVector2DParameter(struct FString InVariableName, struct Unknown InValue); // Function Niagara.NiagaraParameterCollectionInstance.SetVector2DParameter(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1514B70>
	void SetQuatParameter(struct FString InVariableName, struct Unknown& InValue); // Function Niagara.NiagaraParameterCollectionInstance.SetQuatParameter(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1514970>
	void SetIntParameter(struct FString InVariableName, int32_t InValue); // Function Niagara.NiagaraParameterCollectionInstance.SetIntParameter(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1514890>
	void SetFloatParameter(struct FString InVariableName, float InValue); // Function Niagara.NiagaraParameterCollectionInstance.SetFloatParameter(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15147A0>
	void SetColorParameter(struct FString InVariableName, struct Unknown InValue); // Function Niagara.NiagaraParameterCollectionInstance.SetColorParameter(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15146B0>
	void SetBoolParameter(struct FString InVariableName, char InValue); // Function Niagara.NiagaraParameterCollectionInstance.SetBoolParameter(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15145C0>
	struct Unknown GetVectorParameter(struct FString InVariableName); // Function Niagara.NiagaraParameterCollectionInstance.GetVectorParameter(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x15141D0>
	struct Unknown GetVector4Parameter(struct FString InVariableName); // Function Niagara.NiagaraParameterCollectionInstance.GetVector4Parameter(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1514110>
	struct Unknown GetVector2DParameter(struct FString InVariableName); // Function Niagara.NiagaraParameterCollectionInstance.GetVector2DParameter(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1514050>
	struct Unknown GetQuatParameter(struct FString InVariableName); // Function Niagara.NiagaraParameterCollectionInstance.GetQuatParameter(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1513F90>
	int32_t GetIntParameter(struct FString InVariableName); // Function Niagara.NiagaraParameterCollectionInstance.GetIntParameter(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1513E20>
	float GetFloatParameter(struct FString InVariableName); // Function Niagara.NiagaraParameterCollectionInstance.GetFloatParameter(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1513D70>
	struct Unknown GetColorParameter(struct FString InVariableName); // Function Niagara.NiagaraParameterCollectionInstance.GetColorParameter(Final|Native|Public|HasDefaults|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1513CB0>
	char GetBoolParameter(struct FString InVariableName); // Function Niagara.NiagaraParameterCollectionInstance.GetBoolParameter(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1513C00>
};

// Class Niagara.NiagaraParameterCollection
struct UNiagaraParameterCollection : Object {
	struct FName Namespace; // 0x28 (8)
	struct TArray<Unknown> Parameters; // 0x30 (16)
	struct Unknown DefaultInstance; // 0x40 (8)
	struct Unknown CompileId; // 0x48 (16)
};

// Class Niagara.NiagaraPrecompileContainer
struct UNiagaraPrecompileContainer : Object {
	struct TArray<Unknown> Scripts; // 0x28 (16)
	struct Unknown System; // 0x38 (8)
};

// Class Niagara.NiagaraPreviewAxis_Interp
struct UNiagaraPreviewAxis_Interp : UNiagaraPreviewAxis {
	struct FName Param; // 0x28 (8)
	int32_t Count; // 0x30 (4)
};

// Class Niagara.NiagaraPreviewAxis_Interp
struct UNiagaraPreviewAxis_Interp : UNiagaraPreviewAxis_Interp {
	int32_t Min; // 0x38 (4)
	int32_t MAX; // 0x3C (4)
};

// Class Niagara.NiagaraPreviewAxis_Interp
struct UNiagaraPreviewAxis_Interp : UNiagaraPreviewAxis_Interp {
	float Min; // 0x38 (4)
	float MAX; // 0x3C (4)
};

// Class Niagara.NiagaraPreviewAxis_Interp
struct UNiagaraPreviewAxis_Interp : UNiagaraPreviewAxis_Interp {
	struct Unknown Min; // 0x38 (8)
	struct Unknown MAX; // 0x40 (8)
};

// Class Niagara.NiagaraPreviewAxis_Interp
struct UNiagaraPreviewAxis_Interp : UNiagaraPreviewAxis_Interp {
	struct Unknown Min; // 0x38 (12)
	struct Unknown MAX; // 0x44 (12)
};

// Class Niagara.NiagaraPreviewAxis_Interp
struct UNiagaraPreviewAxis_Interp : UNiagaraPreviewAxis_Interp {
	struct Unknown Min; // 0x40 (16)
	struct Unknown MAX; // 0x50 (16)
};

// Class Niagara.NiagaraPreviewAxis_Interp
struct UNiagaraPreviewAxis_Interp : UNiagaraPreviewAxis_Interp {
	struct Unknown Min; // 0x38 (16)
	struct Unknown MAX; // 0x48 (16)
};

// Class Niagara.NiagaraPreviewGrid
struct ANiagaraPreviewGrid : UActor {
	struct Unknown System; // 0x310 (8)
	enum class Unknow ResetMode; // 0x318 (1)
	struct Unknown PreviewAxisX; // 0x320 (8)
	struct Unknown PreviewAxisY; // 0x328 (8)
	struct Unknown* PreviewClass; // 0x330 (8)
	float SpacingX; // 0x338 (4)
	float SpacingY; // 0x33C (4)
	int32_t NumX; // 0x340 (4)
	int32_t NumY; // 0x344 (4)
	struct TArray<Unknown> PreviewComponents; // 0x348 (16)

	void SetPaused(char bPaused); // Function Niagara.NiagaraPreviewGrid.SetPaused(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x151AF30>
	void GetPreviews(struct TArray<Unknown>& OutPreviews); // Function Niagara.NiagaraPreviewGrid.GetPreviews(Final|Native|Public|HasOutParms|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x151AE30>
	void DeactivatePreviews(); // Function Niagara.NiagaraPreviewGrid.DeactivatePreviews(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x151AE10>
	void ActivatePreviews(char b); // Function Niagara.NiagaraPreviewGrid.ActivatePreviews(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x151AC00>
};

// Class Niagara.NiagaraRibbonRendererProperties
struct UNiagaraRibbonRendererProperties : UNiagaraRendererProperties {
	struct Unknown Material; // 0x50 (8)
	struct Unknown MaterialUserParamBinding; // 0x58 (40)
	enum class Unknow FacingMode; // 0x80 (1)
	float UV0TilingDistance; // 0x84 (4)
	struct Unknown UV0Scale; // 0x88 (8)
	struct Unknown UV0Offset; // 0x90 (8)
	enum class Unknow UV0AgeOffsetMode; // 0x98 (1)
	float UV1TilingDistance; // 0x9C (4)
	struct Unknown UV1Scale; // 0xA0 (8)
	struct Unknown UV1Offset; // 0xA8 (8)
	enum class Unknow UV1AgeOffsetMode; // 0xB0 (1)
	enum class Unknow DrawDirection; // 0xB1 (1)
	float CurveTension; // 0xB4 (4)
	enum class Unknow TessellationMode; // 0xB8 (1)
	int32_t TessellationFactor; // 0xBC (4)
	char bUseConstantFactor : 0; // 0xC0 (1)
	float TessellationAngle; // 0xC4 (4)
	char bScreenSpaceTessellation : 0; // 0xC8 (1)
	struct Unknown PositionBinding; // 0xD0 (120)
	struct Unknown ColorBinding; // 0x148 (120)
	struct Unknown VelocityBinding; // 0x1C0 (120)
	struct Unknown NormalizedAgeBinding; // 0x238 (120)
	struct Unknown RibbonTwistBinding; // 0x2B0 (120)
	struct Unknown RibbonWidthBinding; // 0x328 (120)
	struct Unknown RibbonFacingBinding; // 0x3A0 (120)
	struct Unknown RibbonIdBinding; // 0x418 (120)
	struct Unknown RibbonLinkOrderBinding; // 0x490 (120)
	struct Unknown MaterialRandomBinding; // 0x508 (120)
	struct Unknown DynamicMaterialBinding; // 0x580 (120)
	struct Unknown DynamicMaterial1Binding; // 0x5F8 (120)
	struct Unknown DynamicMaterial2Binding; // 0x670 (120)
	struct Unknown DynamicMaterial3Binding; // 0x6E8 (120)
};

// Class Niagara.NiagaraScript
struct UNiagaraScript : Object {
	enum class Unknow Usage; // 0x28 (1)
	int32_t UsageIndex; // 0x2C (4)
	struct Unknown UsageId; // 0x30 (16)
	struct Unknown RapidIterationParameters; // 0x40 (184)
	struct Unknown ScriptExecutionParamStore; // 0xF8 (216)
	struct TArray<Unknown> ScriptExecutionBoundParameters; // 0x1D0 (16)
	struct Unknown CachedScriptVMId; // 0x1E0 (72)
	struct Unknown CachedScriptVM; // 0x3D8 (296)
	struct TArray<Unknown> CachedParameterCollectionReferences; // 0x500 (16)
	struct TArray<Unknown> CachedDefaultDataInterfaces; // 0x510 (16)

	void RaiseOnGPUCompilationComplete(); // Function Niagara.NiagaraScript.RaiseOnGPUCompilationComplete(Final|Native|Public) // <BravoHotelClient-Win64-Shipping.protected.exe+0x151AF10>
};

// Class Niagara.NiagaraSettings
struct UNiagaraSettings : UDeveloperSettings {
	struct TArray<Unknown> AdditionalParameterTypes; // 0x38 (16)
	struct TArray<Unknown> AdditionalPayloadTypes; // 0x48 (16)
	struct TArray<Unknown> AdditionalParameterEnums; // 0x58 (16)
	struct Unknown DefaultEffectType; // 0x68 (24)
	struct TArray<Unknown> QualityLevels; // 0x80 (16)
	struct Unknown DefaultEffectTypePtr; // 0x90 (8)
};

// Class Niagara.NiagaraSimulationStageBase
struct UNiagaraSimulationStageBase : UNiagaraMergeable {
	struct Unknown Script; // 0x28 (8)
	struct FName SimulationStageName; // 0x30 (8)
};

// Class Niagara.NiagaraSimulationStageGeneric
struct UNiagaraSimulationStageGeneric : UNiagaraSimulationStageBase {
	enum class Unknow IterationSource; // 0x38 (1)
	int32_t Iterations; // 0x3C (4)
	char bSpawnOnly : 0; // 0x40 (1)
	struct Unknown DataInterface; // 0x48 (40)
};

// Class Niagara.NiagaraSpriteRendererProperties
struct UNiagaraSpriteRendererProperties : UNiagaraRendererProperties {
	struct Unknown Material; // 0x50 (8)
	struct Unknown MaterialUserParamBinding; // 0x58 (40)
	enum class Unknow Alignment; // 0x80 (1)
	enum class Unknow FacingMode; // 0x81 (1)
	struct Unknown PivotInUVSpace; // 0x84 (8)
	enum class Unknow SortMode; // 0x8C (1)
	struct Unknown SubImageSize; // 0x90 (8)
	char bSubImageBlend : 0; // 0x98 (1)
	char b : 0; // 0x98 (1)
	char bSortOnlyWhenTranslucent : 0; // 0x98 (1)
	float MinFacingCameraBlendDistance; // 0x9C (4)
	float MaxFacingCameraBlendDistance; // 0xA0 (4)
	struct Unknown PositionBinding; // 0xA8 (120)
	struct Unknown ColorBinding; // 0x120 (120)
	struct Unknown VelocityBinding; // 0x198 (120)
	struct Unknown SpriteRotationBinding; // 0x210 (120)
	struct Unknown SpriteSizeBinding; // 0x288 (120)
	struct Unknown SpriteFacingBinding; // 0x300 (120)
	struct Unknown SpriteAlignmentBinding; // 0x378 (120)
	struct Unknown SubImageIndexBinding; // 0x3F0 (120)
	struct Unknown DynamicMaterialBinding; // 0x468 (120)
	struct Unknown DynamicMaterial1Binding; // 0x4E0 (120)
	struct Unknown DynamicMaterial2Binding; // 0x558 (120)
	struct Unknown DynamicMaterial3Binding; // 0x5D0 (120)
	struct Unknown CameraOffsetBinding; // 0x648 (120)
	struct Unknown UVScaleBinding; // 0x6C0 (120)
	struct Unknown MaterialRandomBinding; // 0x738 (120)
	struct Unknown CustomSortingBinding; // 0x7B0 (120)
	struct Unknown NormalizedAgeBinding; // 0x828 (120)
};

// Class Niagara.NiagaraSystem
struct UNiagaraSystem : UFXSystemAsset {
	char bDumpDebugSystemInfo : 0; // 0x31 (1)
	char bDumpDebugEmitterInfo : 0; // 0x32 (1)
	char bFixedBounds : 0; // 0x34 (1)
	struct Unknown EffectType; // 0x38 (8)
	char bOverrideScalabilitySettings : 0; // 0x40 (1)
	struct TArray<Unknown> ScalabilityOverrides; // 0x48 (16)
	struct Unknown SystemScalabilityOv; // 0x58 (16)
	struct TArray<Unknown> EmitterHandles; // 0x68 (16)
	struct TArray<Unknown> ParameterCollectionOverrides; // 0x78 (16)
	struct Unknown SystemSpawnScript; // 0x88 (8)
	struct Unknown SystemUpdateScript; // 0x90 (8)
	struct Unknown SystemCompiledData; // 0xA8 (600)
	struct Unknown ExposedParameters; // 0x300 (264)
	struct Unknown FixedBounds; // 0x408 (28)
	char bAutoDeactivate : 0; // 0x424 (1)
	float WarmupTime; // 0x428 (4)
	int32_t WarmupTickCount; // 0x42C (4)
	float WarmupTickDelta; // 0x430 (4)
	char bHasSystemScriptDIsWithPerInstanceData : 0; // 0x434 (1)
	struct TArray<Unknown> UserDINamesReadInSystemScripts; // 0x438 (16)
};

