// Object CoreUObject.Object
// Size: 0x00 (Inherited: 0x00)
struct Object {
	None AnimGraphNode_Root; // 0x10f8(0x40)
	None AnimGraphNode_TransitionResult_37; // 0x1138(0x38)
	None AnimGraphNode_TransitionResult_36; // 0x1170(0x38)
	None AnimGraphNode_TransitionResult_35; // 0x11a8(0x38)
	None AnimGraphNode_TransitionResult_34; // 0x11e0(0x38)
	None AnimGraphNode_TransitionResult_33; // 0x1218(0x38)
	None AnimGraphNode_TransitionResult_32; // 0x1250(0x38)
	None AnimGraphNode_TransitionResult_31; // 0x1288(0x38)
	None AnimGraphNode_TransitionResult_30; // 0x12c0(0x38)
	None AnimGraphNode_TransitionResult_29; // 0x12f8(0x38)
	None AnimGraphNode_TransitionResult_28; // 0x1330(0x38)
	None AnimGraphNode_TransitionResult_27; // 0x1368(0x38)
	None AnimGraphNode_TransitionResult_26; // 0x13a0(0x38)
	None AnimGraphNode_TransitionResult_25; // 0x13d8(0x38)
	None AnimGraphNode_TransitionResult_24; // 0x1410(0x38)
	None AnimGraphNode_TransitionResult_23; // 0x1448(0x38)
	None AnimGraphNode_TransitionResult_22; // 0x1480(0x38)
	None AnimGraphNode_TransitionResult_21; // 0x14b8(0x38)
	None AnimGraphNode_TransitionResult_20; // 0x14f0(0x38)
	None AnimGraphNode_TransitionResult_19; // 0x1528(0x38)
	None AnimGraphNode_TransitionResult_18; // 0x1560(0x38)
	None AnimGraphNode_TransitionResult_17; // 0x1598(0x38)
	None AnimGraphNode_TransitionResult_16; // 0x15d0(0x38)
	None AnimGraphNode_TransitionResult_15; // 0x1608(0x38)
	None AnimGraphNode_TransitionResult_14; // 0x1640(0x38)
	None AnimGraphNode_TransitionResult_13; // 0x1678(0x38)
	None AnimGraphNode_TransitionResult_12; // 0x16b0(0x38)
	None AnimGraphNode_TransitionResult_11; // 0x16e8(0x38)
	None AnimGraphNode_TransitionResult_10; // 0x1720(0x38)
	None AnimGraphNode_TransitionResult_9; // 0x1758(0x38)
	None AnimGraphNode_TransitionResult_8; // 0x1790(0x38)
	None AnimGraphNode_TransitionResult_7; // 0x17c8(0x38)
	None AnimGraphNode_TransitionResult_6; // 0x1800(0x38)
	None AnimGraphNode_TransitionResult_5; // 0x1838(0x38)
	None AnimGraphNode_TransitionResult_4; // 0x1870(0x38)
	None AnimGraphNode_TransitionResult_3; // 0x18a8(0x38)
	None AnimGraphNode_TransitionResult_2; // 0x18e0(0x38)
	None AnimGraphNode_TransitionResult; // 0x1918(0x38)
	None AnimGraphNode_SequenceSkinned_13; // 0x1950(0x160)
	None AnimGraphNode_SequencePlayer_13; // 0x1ab0(0x88)
	None AnimGraphNode_StateResult_9; // 0x1b38(0x40)
	None AnimGraphNode_SequenceSkinned_12; // 0x1b78(0x160)
	None AnimGraphNode_SequenceSkinned_11; // 0x1cd8(0x160)
	None AnimGraphNode_SequenceSkinned_10; // 0x1e38(0x160)
	None AnimGraphNode_SequenceSkinned_9; // 0x1f98(0x160)
	None AnimGraphNode_SequencePlayer_12; // 0x20f8(0x88)
	None AnimGraphNode_BlendListByInt_2; // 0x2180(0xb0)
	None AnimGraphNode_SequencePlayer_11; // 0x2230(0x88)
	None AnimGraphNode_SequencePlayer_10; // 0x22b8(0x88)
	None AnimGraphNode_BlendListByInt; // 0x2340(0xb0)
	None AnimGraphNode_SequencePlayer_9; // 0x23f0(0x88)
	None AnimGraphNode_BlendListByBool_11; // 0x2478(0xb0)
	None AnimGraphNode_StateResult_8; // 0x2528(0x40)
	None AnimGraphNode_SequenceSkinned_8; // 0x2568(0x160)
	None AnimGraphNode_SequenceSkinned_7; // 0x26c8(0x160)
	None AnimGraphNode_BlendSpaceSkinned_6; // 0x2828(0x200)
	None AnimGraphNode_BlendSpacePlayer_6; // 0x2a28(0xf0)
	None AnimGraphNode_SequencePlayer_8; // 0x2b18(0x88)
	None AnimGraphNode_BlendListByBool_10; // 0x2ba0(0xb0)
	None AnimGraphNode_BlendListByBool_9; // 0x2c50(0xb0)
	None AnimGraphNode_SequencePlayer_7; // 0x2d00(0x88)
	None AnimGraphNode_StateResult_7; // 0x2d88(0x40)
	None AnimGraphNode_SequenceEvaluator_2; // 0x2dc8(0x58)
	None AnimGraphNode_SequenceEvaluator; // 0x2e20(0x58)
	None AnimGraphNode_BlendListByBool_8; // 0x2e78(0xb0)
	None AnimGraphNode_StateResult_6; // 0x2f28(0x40)
	None AnimGraphNode_BlendSpaceSkinned_5; // 0x2f68(0x200)
	None AnimGraphNode_BlendSpaceSkinned_4; // 0x3168(0x200)
	None AnimGraphNode_BlendSpacePlayer_5; // 0x3368(0xf0)
	None AnimGraphNode_BlendListByBool_7; // 0x3458(0xb0)
	None AnimGraphNode_BlendSpacePlayer_4; // 0x3508(0xf0)
	None AnimGraphNode_StateResult_5; // 0x35f8(0x40)
	None AnimGraphNode_SequenceSkinned_6; // 0x3638(0x160)
	None AnimGraphNode_SequenceSkinned_5; // 0x3798(0x160)
	None AnimGraphNode_SequenceSkinned_4; // 0x38f8(0x160)
	None AnimGraphNode_SequenceSkinned_3; // 0x3a58(0x160)
	None AnimGraphNode_BlendSpaceSkinned_3; // 0x3bb8(0x200)
	None AnimGraphNode_SequencePlayer_6; // 0x3db8(0x88)
	None AnimGraphNode_SequencePlayer_5; // 0x3e40(0x88)
	None AnimGraphNode_SequencePlayer_4; // 0x3ec8(0x88)
	None AnimGraphNode_SequencePlayer_3; // 0x3f50(0x88)
	None AnimGraphNode_BlendListByEnum; // 0x3fd8(0xc0)
	None AnimGraphNode_BlendListByBool_6; // 0x4098(0xb0)
	None AnimGraphNode_BlendSpacePlayer_3; // 0x4148(0xf0)
	None AnimGraphNode_StateResult_4; // 0x4238(0x40)
	None AnimGraphNode_BlendSpaceSkinned_2; // 0x4278(0x200)
	None AnimGraphNode_BlendSpaceSkinned; // 0x4478(0x200)
	None AnimGraphNode_BlendSpacePlayer_2; // 0x4678(0xf0)
	None AnimGraphNode_BlendListByBool_5; // 0x4768(0xb0)
	None AnimGraphNode_BlendSpacePlayer; // 0x4818(0xf0)
	None AnimGraphNode_StateResult_3; // 0x4908(0x40)
	None AnimGraphNode_SequenceSkinned_2; // 0x4948(0x160)
	None AnimGraphNode_SequenceSkinned; // 0x4aa8(0x160)
	None AnimGraphNode_SequencePlayer_2; // 0x4c08(0x88)
	None AnimGraphNode_RandomPlayer; // 0x4c90(0x88)
	None AnimGraphNode_BlendListByBool_4; // 0x4d18(0xb0)
	None AnimGraphNode_StateResult_2; // 0x4dc8(0x40)
	None AnimGraphNode_StateMachine_2; // 0x4e08(0xc0)
	None AnimGraphNode_SequencePlayer; // 0x4ec8(0x88)
	None AnimGraphNode_StateResult; // 0x4f50(0x40)
	None AnimGraphNode_StateMachine; // 0x4f90(0xc0)
	None AnimGraphNode_BlendListByBool_3; // 0x5050(0xb0)
	None AnimGraphNode_BlendListByBool_2; // 0x5100(0xb0)
	None AnimGraphNode_LocalToComponentSpace; // 0x51b0(0x30)
	None AnimGraphNode_ComponentToLocalSpace; // 0x51e0(0x30)
	None AnimGraphNode_ModifyBone; // 0x5210(0x118)
	None AnimGraphNode_BlendListByBool; // 0x5328(0xb0)
	None AnimGraphNode_AimOffsetSkinned; // 0x53d8(0x1c0)
	None AnimGraphNode_SaveCachedPose; // 0x5598(0xc8)
	None AnimGraphNode_UseCachedPose_3; // 0x5660(0x38)
	None AnimGraphNode_UseCachedPose_2; // 0x5698(0x38)
	None AnimGraphNode_UseCachedPose; // 0x56d0(0x38)
	None MaxMantleHt; // 0x5708(0x04)
	None Max2StoryMantleHt; // 0x570c(0x04)
	None StringMantlesTogether; // 0x5710(0x01)
	None Start Swim Moving; // 0x5718(0x08)
	None Start Swim Moving B; // 0x5720(0x08)
	None Start Swim Moving A; // 0x5728(0x08)
	None Cached Angle; // 0x5730(0x04)
	None Stop Swim Moving A; // 0x5738(0x08)
	None Stop Swim Moving B; // 0x5740(0x08)
	None Stop Swim Moving; // 0x5748(0x08)
	None Cached Stop Angle; // 0x5750(0x04)
	None locoStartDir; // 0x5754(0x01)
	None locoStopDir; // 0x5755(0x01)
	None TurnVal; // 0x5758(0x04)
	None Transition_Downed; // 0x575c(0x01)
	None Transition_Pivot; // 0x575d(0x01)
	None IsFallingToWater; // 0x575e(0x01)
	None Replace with code; // 0x5760(0x0c)
	None Character; // 0x5770(0x08)
	None Transition State Lock; // 0x5778(0x01)
	None CallFunc_BreakRotator_Roll; // 0x577c(0x04)
	None CallFunc_BreakRotator_Pitch; // 0x5780(0x04)
	None CallFunc_BreakRotator_Yaw; // 0x5784(0x04)
	None CallFunc_BreakRotator_Roll_2; // 0x5788(0x04)
	None CallFunc_BreakRotator_Pitch_2; // 0x578c(0x04)
	None CallFunc_BreakRotator_Yaw_2; // 0x5790(0x04)
	None CallFunc_BreakRotator_Roll_3; // 0x5794(0x04)
	None CallFunc_BreakRotator_Pitch_3; // 0x5798(0x04)
	None CallFunc_BreakRotator_Yaw_3; // 0x579c(0x04)
	None CallFunc_BreakRotator_Roll_4; // 0x57a0(0x04)
	None CallFunc_BreakRotator_Pitch_4; // 0x57a4(0x04)
	None CallFunc_BreakRotator_Yaw_4; // 0x57a8(0x04)
	None CallFunc_BreakRotator_Roll_5; // 0x57ac(0x04)
	None CallFunc_BreakRotator_Pitch_5; // 0x57b0(0x04)
	None CallFunc_BreakRotator_Yaw_5; // 0x57b4(0x04)
	None CallFunc_BreakVector_X; // 0x57b8(0x04)
	None CallFunc_BreakVector_Y; // 0x57bc(0x04)
	None CallFunc_BreakVector_Z; // 0x57c0(0x04)
	None CallFunc_BreakRotator_Roll_6; // 0x57c4(0x04)
	None CallFunc_BreakRotator_Pitch_6; // 0x57c8(0x04)
	None CallFunc_BreakRotator_Yaw_6; // 0x57cc(0x04)
	None Temp_bool_Variable; // 0x57d0(0x01)
	None K2Node_Select_Default; // 0x57d4(0x0c)
	None CallFunc_BreakVector_X_2; // 0x57e0(0x04)
	None CallFunc_BreakVector_Y_2; // 0x57e4(0x04)
	None CallFunc_BreakVector_Z_2; // 0x57e8(0x04)
	None Temp_bool_Variable_2; // 0x57ec(0x01)
	None K2Node_Select_Default_2; // 0x57f0(0x0c)
	None Temp_bool_Variable_3; // 0x57fc(0x01)
	None Temp_bool_Variable_4; // 0x57fd(0x01)
	None K2Node_Select_Default_3; // 0x5800(0x0c)
	None K2Node_Event_DeltaTimeX; // 0x580c(0x04)
	None K2Node_Select_Default_4; // 0x5810(0x0c)
	None K2Node_Event_StartLocation; // 0x581c(0x0c)
	None CallFunc_BreakVector_X_3; // 0x5828(0x04)
	None CallFunc_BreakVector_Y_3; // 0x582c(0x04)
	None CallFunc_BreakVector_Z_3; // 0x5830(0x04)
	None K2Node_Event_StopLocation; // 0x5834(0x0c)
	None K2Node_Event_AnimationVariant; // 0x5840(0x01)
	None K2Node_Event_DelayTime; // 0x5844(0x04)
	None K2Node_SwitchEnum_CmpSuccess; // 0x5848(0x01)
	None K2Node_DynamicCast_AsKSCharacter; // 0x5850(0x08)
	None K2Node_DynamicCast_bSuccess; // 0x5858(0x01)
	None K2Node_Event_PivotLocation; // 0x585c(0x0c)
	None K2Node_Event_bShouldLock; // 0x5868(0x01)
	None BaseBar; // 0x238(0x08)
	None ProgressBarFill; // 0x240(0x08)
	None UberGraphFrame; // 0x238(0x08)
	None FadeOut; // 0x240(0x08)
	None Show; // 0x248(0x08)
	None NameButton; // 0x250(0x08)
	None NameText; // 0x258(0x08)
	None Panel; // 0x260(0x08)
	None Text; // 0x268(0x08)
	None ChatDataCopy; // 0x270(0x40)
	None IsWindowCollapsed; // 0x2b0(0x01)
	None IsInitialShowFinished; // 0x2b1(0x01)
	None ChatMessageDisplayDuration; // 0x2b4(0x04)
	None LobbyState; // 0x2b0(0x08)
	None PlayerState; // 0x2b8(0x08)
	None LobbyJoinServerState; // 0x2c1(0x01)
	None LobbyStateClass; // 0x250(0x28)
	None LobbyState; // 0x278(0x08)
	None DisplayName; // 0x220(0x18)
	None UniqueId; // 0x238(0x28)
	None PartyOwnerUniqueId; // 0x260(0x28)
	None bInLobby; // 0x288(0x01)
	None ClientActor; // 0x290(0x08)
	None MaxPlayers; // 0x220(0x04)
	None LobbyBeaconPlayerStateClass; // 0x228(0x08)
	None bLobbyStarted; // 0x238(0x01)
	None WaitForPlayersTimeRemaining; // 0x23c(0x04)
	None Players; // 0x240(0x120)

	void SwimNotifyTransitionStateLock(None bpp__bShouldLock__pf); // SwimNotifyTransitionStateLock Sub_Hero_ABP_Swimming.Sub_Hero_ABP_Swimming_C.SwimNotifyTransitionStateLock // (Native|Event|Public|BlueprintCallable) // <Game+0x195dfa0>
	void SetFillPercentage(None Percentage); // SetFillPercentage WBP_ProgressBar.WBP_ProgressBar_C.SetFillPercentage // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x260f470>
	void HandleInitialSpawn(); // HandleInitialSpawn WBP_TextChat_ChatEntry.WBP_TextChat_ChatEntry_C.HandleInitialSpawn // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x260f470>
	void ServerSetPartyOwner(None InUniqueId, None InPartyOwnerId); // ServerSetPartyOwner Lobby.LobbyBeaconClient.ServerSetPartyOwner // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <Game+0xb3cad0>
	void OnRep_UniqueId(); // OnRep_UniqueId Lobby.LobbyBeaconPlayerState.OnRep_UniqueId // (Final|Native|Protected) // <Game+0xb3c5f0>
	void OnRep_WaitForPlayersTimeRemaining(); // OnRep_WaitForPlayersTimeRemaining Lobby.LobbyBeaconState.OnRep_WaitForPlayersTimeRemaining // (Final|Native|Protected) // <Game+0xb3c610>
	void ExecuteUbergraph(None EntryPoint); // ExecuteUbergraph CoreUObject.Object.ExecuteUbergraph // (Event|Public|BlueprintEvent) // <Game+0x260f470>
};

