// ParticleModuleRotation_Seeded Engine.ParticleModuleRotation_Seeded
// Size: 0x00 (Inherited: 0x60)
struct UParticleModuleRotation_Seeded : UParticleModuleRotation {
	None AnimGraphNode_Root; // 0x10f8(0x40)
	None AnimGraphNode_TransitionResult_37; // 0x1138(0x38)
	None AnimGraphNode_TransitionResult_36; // 0x1170(0x38)
	None AnimGraphNode_TransitionResult_35; // 0x11a8(0x38)
	None AnimGraphNode_TransitionResult_34; // 0x11e0(0x38)
	None AnimGraphNode_TransitionResult_33; // 0x1218(0x38)
	None AnimGraphNode_TransitionResult_32; // 0x1250(0x38)
	None AnimGraphNode_TransitionResult_31; // 0x1288(0x38)
	None AnimGraphNode_TransitionResult_30; // 0x12c0(0x38)
	None AnimGraphNode_TransitionResult_29; // 0x12f8(0x38)
	None AnimGraphNode_TransitionResult_28; // 0x1330(0x38)
	None AnimGraphNode_TransitionResult_27; // 0x1368(0x38)
	None AnimGraphNode_TransitionResult_26; // 0x13a0(0x38)
	None AnimGraphNode_TransitionResult_25; // 0x13d8(0x38)
	None AnimGraphNode_TransitionResult_24; // 0x1410(0x38)
	None AnimGraphNode_TransitionResult_23; // 0x1448(0x38)
	None AnimGraphNode_TransitionResult_22; // 0x1480(0x38)
	None AnimGraphNode_TransitionResult_21; // 0x14b8(0x38)
	None AnimGraphNode_TransitionResult_20; // 0x14f0(0x38)
	None AnimGraphNode_TransitionResult_19; // 0x1528(0x38)
	None AnimGraphNode_TransitionResult_18; // 0x1560(0x38)
	None AnimGraphNode_TransitionResult_17; // 0x1598(0x38)
	None AnimGraphNode_TransitionResult_16; // 0x15d0(0x38)
	None AnimGraphNode_TransitionResult_15; // 0x1608(0x38)
	None AnimGraphNode_TransitionResult_14; // 0x1640(0x38)
	None AnimGraphNode_TransitionResult_13; // 0x1678(0x38)
	None AnimGraphNode_TransitionResult_12; // 0x16b0(0x38)
	None AnimGraphNode_TransitionResult_11; // 0x16e8(0x38)
	None AnimGraphNode_TransitionResult_10; // 0x1720(0x38)
	None AnimGraphNode_TransitionResult_9; // 0x1758(0x38)
	None AnimGraphNode_TransitionResult_8; // 0x1790(0x38)
	None AnimGraphNode_TransitionResult_7; // 0x17c8(0x38)
	None AnimGraphNode_TransitionResult_6; // 0x1800(0x38)
	None AnimGraphNode_TransitionResult_5; // 0x1838(0x38)
	None AnimGraphNode_TransitionResult_4; // 0x1870(0x38)
	None AnimGraphNode_TransitionResult_3; // 0x18a8(0x38)
	None AnimGraphNode_TransitionResult_2; // 0x18e0(0x38)
	None AnimGraphNode_TransitionResult; // 0x1918(0x38)
	None AnimGraphNode_SequenceSkinned_13; // 0x1950(0x160)
	None AnimGraphNode_SequencePlayer_13; // 0x1ab0(0x88)
	None AnimGraphNode_StateResult_9; // 0x1b38(0x40)
	None AnimGraphNode_SequenceSkinned_12; // 0x1b78(0x160)
	None AnimGraphNode_SequenceSkinned_11; // 0x1cd8(0x160)
	None AnimGraphNode_SequenceSkinned_10; // 0x1e38(0x160)
	None AnimGraphNode_SequenceSkinned_9; // 0x1f98(0x160)
	None AnimGraphNode_SequencePlayer_12; // 0x20f8(0x88)
	None AnimGraphNode_BlendListByInt_2; // 0x2180(0xb0)
	None AnimGraphNode_SequencePlayer_11; // 0x2230(0x88)
	None AnimGraphNode_SequencePlayer_10; // 0x22b8(0x88)
	None AnimGraphNode_BlendListByInt; // 0x2340(0xb0)
	None AnimGraphNode_SequencePlayer_9; // 0x23f0(0x88)
	None AnimGraphNode_BlendListByBool_11; // 0x2478(0xb0)
	None AnimGraphNode_StateResult_8; // 0x2528(0x40)
	None AnimGraphNode_SequenceSkinned_8; // 0x2568(0x160)
	None AnimGraphNode_SequenceSkinned_7; // 0x26c8(0x160)
	None AnimGraphNode_BlendSpaceSkinned_6; // 0x2828(0x200)
	None AnimGraphNode_BlendSpacePlayer_6; // 0x2a28(0xf0)
	None AnimGraphNode_SequencePlayer_8; // 0x2b18(0x88)
	None AnimGraphNode_BlendListByBool_10; // 0x2ba0(0xb0)
	None AnimGraphNode_BlendListByBool_9; // 0x2c50(0xb0)
	None AnimGraphNode_SequencePlayer_7; // 0x2d00(0x88)
	None AnimGraphNode_StateResult_7; // 0x2d88(0x40)
	None AnimGraphNode_SequenceEvaluator_2; // 0x2dc8(0x58)
	None AnimGraphNode_SequenceEvaluator; // 0x2e20(0x58)
	None AnimGraphNode_BlendListByBool_8; // 0x2e78(0xb0)
	None AnimGraphNode_StateResult_6; // 0x2f28(0x40)
	None AnimGraphNode_BlendSpaceSkinned_5; // 0x2f68(0x200)
	None AnimGraphNode_BlendSpaceSkinned_4; // 0x3168(0x200)
	None AnimGraphNode_BlendSpacePlayer_5; // 0x3368(0xf0)
	None AnimGraphNode_BlendListByBool_7; // 0x3458(0xb0)
	None AnimGraphNode_BlendSpacePlayer_4; // 0x3508(0xf0)
	None AnimGraphNode_StateResult_5; // 0x35f8(0x40)
	None AnimGraphNode_SequenceSkinned_6; // 0x3638(0x160)
	None AnimGraphNode_SequenceSkinned_5; // 0x3798(0x160)
	None AnimGraphNode_SequenceSkinned_4; // 0x38f8(0x160)
	None AnimGraphNode_SequenceSkinned_3; // 0x3a58(0x160)
	None AnimGraphNode_BlendSpaceSkinned_3; // 0x3bb8(0x200)
	None AnimGraphNode_SequencePlayer_6; // 0x3db8(0x88)
	None AnimGraphNode_SequencePlayer_5; // 0x3e40(0x88)
	None AnimGraphNode_SequencePlayer_4; // 0x3ec8(0x88)
	None AnimGraphNode_SequencePlayer_3; // 0x3f50(0x88)
	None AnimGraphNode_BlendListByEnum; // 0x3fd8(0xc0)
	None AnimGraphNode_BlendListByBool_6; // 0x4098(0xb0)
	None AnimGraphNode_BlendSpacePlayer_3; // 0x4148(0xf0)
	None AnimGraphNode_StateResult_4; // 0x4238(0x40)
	None AnimGraphNode_BlendSpaceSkinned_2; // 0x4278(0x200)
	None AnimGraphNode_BlendSpaceSkinned; // 0x4478(0x200)
	None AnimGraphNode_BlendSpacePlayer_2; // 0x4678(0xf0)
	None AnimGraphNode_BlendListByBool_5; // 0x4768(0xb0)
	None AnimGraphNode_BlendSpacePlayer; // 0x4818(0xf0)
	None AnimGraphNode_StateResult_3; // 0x4908(0x40)
	None AnimGraphNode_SequenceSkinned_2; // 0x4948(0x160)
	None AnimGraphNode_SequenceSkinned; // 0x4aa8(0x160)
	None AnimGraphNode_SequencePlayer_2; // 0x4c08(0x88)
	None AnimGraphNode_RandomPlayer; // 0x4c90(0x88)
	None AnimGraphNode_BlendListByBool_4; // 0x4d18(0xb0)
	None AnimGraphNode_StateResult_2; // 0x4dc8(0x40)
	None AnimGraphNode_StateMachine_2; // 0x4e08(0xc0)
	None AnimGraphNode_SequencePlayer; // 0x4ec8(0x88)
	None AnimGraphNode_StateResult; // 0x4f50(0x40)
	None AnimGraphNode_StateMachine; // 0x4f90(0xc0)
	None AnimGraphNode_BlendListByBool_3; // 0x5050(0xb0)
	None AnimGraphNode_BlendListByBool_2; // 0x5100(0xb0)
	None AnimGraphNode_LocalToComponentSpace; // 0x51b0(0x30)
	None AnimGraphNode_ComponentToLocalSpace; // 0x51e0(0x30)
	None AnimGraphNode_ModifyBone; // 0x5210(0x118)
	None AnimGraphNode_BlendListByBool; // 0x5328(0xb0)
	None AnimGraphNode_AimOffsetSkinned; // 0x53d8(0x1c0)
	None AnimGraphNode_SaveCachedPose; // 0x5598(0xc8)
	None AnimGraphNode_UseCachedPose_3; // 0x5660(0x38)
	None AnimGraphNode_UseCachedPose_2; // 0x5698(0x38)
	None AnimGraphNode_UseCachedPose; // 0x56d0(0x38)
	None MaxMantleHt; // 0x5708(0x04)
	None Max2StoryMantleHt; // 0x570c(0x04)
	None StringMantlesTogether; // 0x5710(0x01)
	None Start Swim Moving; // 0x5718(0x08)
	None Start Swim Moving B; // 0x5720(0x08)
	None Start Swim Moving A; // 0x5728(0x08)
	None Cached Angle; // 0x5730(0x04)
	None Stop Swim Moving A; // 0x5738(0x08)
	None Stop Swim Moving B; // 0x5740(0x08)
	None Stop Swim Moving; // 0x5748(0x08)
	None Cached Stop Angle; // 0x5750(0x04)
	None locoStartDir; // 0x5754(0x01)
	None locoStopDir; // 0x5755(0x01)
	None TurnVal; // 0x5758(0x04)
	None Transition_Downed; // 0x575c(0x01)
	None Transition_Pivot; // 0x575d(0x01)
	None IsFallingToWater; // 0x575e(0x01)
	None Replace with code; // 0x5760(0x0c)
	None Character; // 0x5770(0x08)
	None Transition State Lock; // 0x5778(0x01)
	None CallFunc_BreakRotator_Roll; // 0x577c(0x04)
	None CallFunc_BreakRotator_Pitch; // 0x5780(0x04)
	None CallFunc_BreakRotator_Yaw; // 0x5784(0x04)
	None CallFunc_BreakRotator_Roll_2; // 0x5788(0x04)
	None CallFunc_BreakRotator_Pitch_2; // 0x578c(0x04)
	None CallFunc_BreakRotator_Yaw_2; // 0x5790(0x04)
	None CallFunc_BreakRotator_Roll_3; // 0x5794(0x04)
	None CallFunc_BreakRotator_Pitch_3; // 0x5798(0x04)
	None CallFunc_BreakRotator_Yaw_3; // 0x579c(0x04)
	None CallFunc_BreakRotator_Roll_4; // 0x57a0(0x04)
	None CallFunc_BreakRotator_Pitch_4; // 0x57a4(0x04)
	None CallFunc_BreakRotator_Yaw_4; // 0x57a8(0x04)
	None CallFunc_BreakRotator_Roll_5; // 0x57ac(0x04)
	None CallFunc_BreakRotator_Pitch_5; // 0x57b0(0x04)
	None CallFunc_BreakRotator_Yaw_5; // 0x57b4(0x04)
	None CallFunc_BreakVector_X; // 0x57b8(0x04)
	None CallFunc_BreakVector_Y; // 0x57bc(0x04)
	None CallFunc_BreakVector_Z; // 0x57c0(0x04)
	None CallFunc_BreakRotator_Roll_6; // 0x57c4(0x04)
	None CallFunc_BreakRotator_Pitch_6; // 0x57c8(0x04)
	None CallFunc_BreakRotator_Yaw_6; // 0x57cc(0x04)
	None Temp_bool_Variable; // 0x57d0(0x01)
	None K2Node_Select_Default; // 0x57d4(0x0c)
	None CallFunc_BreakVector_X_2; // 0x57e0(0x04)
	None CallFunc_BreakVector_Y_2; // 0x57e4(0x04)
	None CallFunc_BreakVector_Z_2; // 0x57e8(0x04)
	None Temp_bool_Variable_2; // 0x57ec(0x01)
	None K2Node_Select_Default_2; // 0x57f0(0x0c)
	None Temp_bool_Variable_3; // 0x57fc(0x01)
	None Temp_bool_Variable_4; // 0x57fd(0x01)
	None K2Node_Select_Default_3; // 0x5800(0x0c)
	None K2Node_Event_DeltaTimeX; // 0x580c(0x04)
	None K2Node_Select_Default_4; // 0x5810(0x0c)
	None K2Node_Event_StartLocation; // 0x581c(0x0c)
	None CallFunc_BreakVector_X_3; // 0x5828(0x04)
	None CallFunc_BreakVector_Y_3; // 0x582c(0x04)
	None CallFunc_BreakVector_Z_3; // 0x5830(0x04)
	None K2Node_Event_StopLocation; // 0x5834(0x0c)
	None K2Node_Event_AnimationVariant; // 0x5840(0x01)
	None K2Node_Event_DelayTime; // 0x5844(0x04)
	None K2Node_SwitchEnum_CmpSuccess; // 0x5848(0x01)
	None K2Node_DynamicCast_AsKSCharacter; // 0x5850(0x08)
	None K2Node_DynamicCast_bSuccess; // 0x5858(0x01)
	None K2Node_Event_PivotLocation; // 0x585c(0x0c)
	None K2Node_Event_bShouldLock; // 0x5868(0x01)
	None BaseBar; // 0x238(0x08)
	None ProgressBarFill; // 0x240(0x08)
	None UberGraphFrame; // 0x238(0x08)
	None FadeOut; // 0x240(0x08)
	None Show; // 0x248(0x08)
	None NameButton; // 0x250(0x08)
	None NameText; // 0x258(0x08)
	None Panel; // 0x260(0x08)
	None Text; // 0x268(0x08)
	None ChatDataCopy; // 0x270(0x40)
	None IsWindowCollapsed; // 0x2b0(0x01)
	None IsInitialShowFinished; // 0x2b1(0x01)
	None ChatMessageDisplayDuration; // 0x2b4(0x04)
	None LobbyState; // 0x2b0(0x08)
	None PlayerState; // 0x2b8(0x08)
	None LobbyJoinServerState; // 0x2c1(0x01)
	None LobbyStateClass; // 0x250(0x28)
	None LobbyState; // 0x278(0x08)
	None DisplayName; // 0x220(0x18)
	None UniqueId; // 0x238(0x28)
	None PartyOwnerUniqueId; // 0x260(0x28)
	None bInLobby; // 0x288(0x01)
	None ClientActor; // 0x290(0x08)
	None MaxPlayers; // 0x220(0x04)
	None LobbyBeaconPlayerStateClass; // 0x228(0x08)
	None bLobbyStarted; // 0x238(0x01)
	None WaitForPlayersTimeRemaining; // 0x23c(0x04)
	None Players; // 0x240(0x120)
	None LastKnownStatus; // 0x28(0x01)
	None bRejoinAfterCheck; // 0x29(0x01)
	None bAttemptingRejoin; // 0x2a(0x01)
	None DestructibleComponent; // 0x220(0x08)
	None OnActorFracture; // 0x228(0x10)
	None bFractureEffectOverride; // 0x670(0x01)
	None FractureEffects; // 0x678(0x10)
	None bEnableHardSleeping; // 0x688(0x01)
	None LargeChunkThreshold; // 0x68c(0x04)
	None OnComponentFracture; // 0x6a0(0x10)
	None CellSiteCount; // 0x28(0x04)
	None FractureMaterialDesc; // 0x2c(0x24)
	None RandomSeed; // 0x50(0x04)
	None VoronoiSites; // 0x58(0x10)
	None OriginalSubmeshCount; // 0x68(0x04)
	None Materials; // 0x70(0x10)
	None ChunkParameters; // 0x80(0x10)
	None DefaultDestructibleParameters; // 0x388(0x88)
	None FractureEffects; // 0x410(0x10)
	None OSSName; // 0x1e0(0x10)
	None HotfixManagerClassName; // 0x1f0(0x10)
	None DebugPrefix; // 0x200(0x10)
	None AssetsHotfixedFromIniFiles; // 0x210(0x10)
	None HotfixCheckCompleteDelay; // 0x88(0x04)
	None UpdateCheckCompleteDelay; // 0x8c(0x04)
	None HotfixAvailabilityCheckCompleteDelay; // 0x90(0x04)
	None UpdateCheckAvailabilityCompleteDelay; // 0x94(0x04)
	None bCheckPlatformOSSForUpdate; // 0x98(0x01)
	None bCheckOSSForUpdate; // 0x99(0x01)
	None AppSuspendedUpdateCheckTimeSeconds; // 0x9c(0x04)
	None bPlatformEnvironmentDetected; // 0xa8(0x01)
	None bInitialUpdateFinished; // 0xa9(0x01)
	None bCheckHotfixAvailabilityOnly; // 0xaa(0x01)
	None CurrentUpdateState; // 0xab(0x01)
	None WorstNumFilesPendingLoadViewed; // 0xac(0x04)
	None LastPatchCheckResult; // 0xb0(0x01)
	None LastHotfixResult; // 0xb1(0x01)
	None LastUpdateCheck; // 0xe0(0x10)
	None LastCompletionResult; // 0xf0(0x02)
	None UpdateStateEnum; // 0x108(0x08)
	None UpdateCompletionEnum; // 0x110(0x08)
	None PrimaryActorTick; // 0x28(0x30)
	None bNetTemporary; // 0x58(0x01)
	None bNetStartup; // 0x58(0x01)
	None bOnlyRelevantToOwner; // 0x58(0x01)
	None bAlwaysRelevant; // 0x58(0x01)
	None bReplicateMovement; // 0x58(0x01)
	None bHidden; // 0x58(0x01)
	None bTearOff; // 0x58(0x01)
	None bExchangedRoles; // 0x58(0x01)
	None bNetLoadOnClient; // 0x59(0x01)
	None bNetUseOwnerRelevancy; // 0x59(0x01)
	None bRelevantForNetworkReplays; // 0x59(0x01)
	None bRelevantForLevelBounds; // 0x59(0x01)
	None bReplayRewindable; // 0x59(0x01)
	None bAllowTickBeforeBeginPlay; // 0x59(0x01)
	None bAutoDestroyWhenFinished; // 0x59(0x01)
	None bCanBeDamaged; // 0x59(0x01)
	None bBlockInput; // 0x5a(0x01)
	None bCollideWhenPlacing; // 0x5a(0x01)
	None bFindCameraComponentWhenViewTarget; // 0x5a(0x01)
	None bGenerateOverlapEventsDuringLevelStreaming; // 0x5a(0x01)
	None bIgnoresOriginShifting; // 0x5a(0x01)
	None bEnableAutoLODGeneration; // 0x5a(0x01)
	None bIsEditorOnlyActor; // 0x5a(0x01)
	None bActorSeamlessTraveled; // 0x5a(0x01)
	None bReplicates; // 0x5b(0x01)
	None bCanBeInCluster; // 0x5b(0x01)
	None bAllowReceiveTickEventOnDedicatedServer; // 0x5b(0x01)
	None bActorEnableCollision; // 0x5c(0x01)
	None bActorIsBeingDestroyed; // 0x5c(0x01)
	None UpdateOverlapsMethodDuringLevelStreaming; // 0x5d(0x01)
	None DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x5e(0x01)
	None RemoteRole; // 0x5f(0x01)
	None ReplicatedMovement; // 0x60(0x34)
	None InitialLifeSpan; // 0x94(0x04)
	None CustomTimeDilation; // 0x98(0x04)
	None AttachmentReplication; // 0xa0(0x40)
	None Owner; // 0xe0(0x08)
	None NetDriverName; // 0xe8(0x08)
	None Role; // 0xf0(0x01)
	None NetDormancy; // 0xf1(0x01)
	None SpawnCollisionHandlingMethod; // 0xf2(0x01)
	None AutoReceiveInput; // 0xf3(0x01)
	None InputPriority; // 0xf4(0x04)
	None InputComponent; // 0xf8(0x08)
	None NetCullDistanceSquared; // 0x100(0x04)
	None NetTag; // 0x104(0x04)
	None NetUpdateFrequency; // 0x108(0x04)
	None MinNetUpdateFrequency; // 0x10c(0x04)
	None NetPriority; // 0x110(0x04)
	None Instigator; // 0x118(0x08)
	None Children; // 0x120(0x10)
	None RootComponent; // 0x130(0x08)
	None ControllingMatineeActors; // 0x138(0x10)
	None Layers; // 0x150(0x10)
	None ParentComponent; // 0x160(0x08)
	None Tags; // 0x170(0x10)
	None OnTakeAnyDamage; // 0x180(0x01)
	None OnTakePointDamage; // 0x181(0x01)
	None OnTakeRadialDamage; // 0x182(0x01)
	None OnActorBeginOverlap; // 0x183(0x01)
	None OnActorEndOverlap; // 0x184(0x01)
	None OnBeginCursorOver; // 0x185(0x01)
	None OnEndCursorOver; // 0x186(0x01)
	None OnClicked; // 0x187(0x01)
	None OnReleased; // 0x188(0x01)
	None OnInputTouchBegin; // 0x189(0x01)
	None OnInputTouchEnd; // 0x18a(0x01)
	None OnInputTouchEnter; // 0x18b(0x01)
	None OnInputTouchLeave; // 0x18c(0x01)
	None OnActorHit; // 0x18d(0x01)
	None OnDestroyed; // 0x18e(0x01)
	None OnEndPlay; // 0x18f(0x01)
	None InstanceComponents; // 0x1f0(0x10)
	None BlueprintCreatedComponents; // 0x200(0x10)
	None PrimaryComponentTick; // 0x30(0x30)
	None ComponentTags; // 0x60(0x10)
	None AssetUserData; // 0x70(0x10)
	None UCSSerializationIndex; // 0x84(0x04)
	None bNetAddressable; // 0x88(0x01)
	None bReplicates; // 0x88(0x01)
	None bAutoActivate; // 0x89(0x01)
	None bIsActive; // 0x8a(0x01)
	None bEditableWhenInherited; // 0x8a(0x01)
	None bCanEverAffectNavigation; // 0x8a(0x01)
	None bIsEditorOnly; // 0x8a(0x01)
	None CreationMethod; // 0x8c(0x01)
	None OnComponentActivated; // 0x8d(0x01)
	None OnComponentDeactivated; // 0x8e(0x01)
	None UCSModifiedProperties; // 0x90(0x10)
	None PhysicsVolume; // 0xb8(0x08)
	None AttachParent; // 0xc0(0x08)
	None AttachSocketName; // 0xc8(0x08)
	None AttachChildren; // 0xd0(0x10)
	None ClientAttachedChildren; // 0xe0(0x10)
	None RelativeLocation; // 0x11c(0x0c)
	None RelativeRotation; // 0x128(0x0c)
	None RelativeScale3D; // 0x134(0x0c)
	None ComponentVelocity; // 0x140(0x0c)
	None bComponentToWorldUpdated; // 0x14c(0x01)
	None bAbsoluteLocation; // 0x14c(0x01)
	None bAbsoluteRotation; // 0x14c(0x01)
	None bAbsoluteScale; // 0x14c(0x01)
	None bVisible; // 0x14c(0x01)
	None bShouldBeAttached; // 0x14c(0x01)
	None bShouldSnapLocationWhenAttached; // 0x14c(0x01)
	None bShouldSnapRotationWhenAttached; // 0x14d(0x01)
	None bShouldUpdatePhysicsVolume; // 0x14d(0x01)
	None bHiddenInGame; // 0x14d(0x01)
	None bBoundsChangeTriggersStreamingDataRebuild; // 0x14d(0x01)
	None bUseAttachParentBound; // 0x14d(0x01)
	None Mobility; // 0x14f(0x01)
	None DetailMode; // 0x150(0x01)
	None PhysicsVolumeChangedDelegate; // 0x151(0x01)
	None MinDrawDistance; // 0x210(0x04)
	None LDMaxDrawDistance; // 0x214(0x04)
	None CachedMaxDrawDistance; // 0x218(0x04)
	None DepthPriorityGroup; // 0x21c(0x01)
	None ViewOwnerDepthPriorityGroup; // 0x21d(0x01)
	None IndirectLightingCacheQuality; // 0x21e(0x01)
	None LightmapType; // 0x21f(0x01)
	None bUseMaxLODAsImposter; // 0x220(0x01)
	None bBatchImpostersAsInstances; // 0x220(0x01)
	None bNeverDistanceCull; // 0x220(0x01)
	None bForceLocalLighting; // 0x220(0x01)
	None bAlwaysCreatePhysicsState; // 0x221(0x01)
	None bGenerateOverlapEvents; // 0x221(0x01)
	None bMultiBodyOverlap; // 0x221(0x01)
	None bTraceComplexOnMove; // 0x221(0x01)
	None bReturnMaterialOnMove; // 0x221(0x01)
	None bUseViewOwnerDepthPriorityGroup; // 0x221(0x01)
	None bAllowCullDistanceVolume; // 0x221(0x01)
	None bHasMotionBlurVelocityMeshes; // 0x221(0x01)
	None bVisibleInReflectionCaptures; // 0x222(0x01)
	None bVisibleInRayTracing; // 0x222(0x01)
	None bRenderInMainPass; // 0x222(0x01)
	None bRenderInDepthPass; // 0x222(0x01)
	None bReceivesDecals; // 0x222(0x01)
	None bOwnerNoSee; // 0x222(0x01)
	None bOnlyOwnerSee; // 0x222(0x01)
	None bTreatAsBackgroundForOcclusion; // 0x222(0x01)
	None bUseAsOccluder; // 0x223(0x01)
	None bSelectable; // 0x223(0x01)
	None bForceMipStreaming; // 0x223(0x01)
	None bHasPerInstanceHitProxies; // 0x223(0x01)
	None CastShadow; // 0x223(0x01)
	None bAffectDynamicIndirectLighting; // 0x223(0x01)
	None bAffectDistanceFieldLighting; // 0x223(0x01)
	None bCastDynamicShadow; // 0x223(0x01)
	None bCastStaticShadow; // 0x224(0x01)
	None bCastVolumetricTranslucentShadow; // 0x224(0x01)
	None bSelfShadowOnly; // 0x224(0x01)
	None bCastFarShadow; // 0x224(0x01)
	None bCastInsetShadow; // 0x224(0x01)
	None bCastCinematicShadow; // 0x224(0x01)
	None bCastHiddenShadow; // 0x224(0x01)
	None bCastShadowAsTwoSided; // 0x224(0x01)
	None bShouldNotReceiveCapsuleShadows; // 0x225(0x01)
	None bLightAsIfStatic; // 0x225(0x01)
	None bLightAttachmentsAsGroup; // 0x225(0x01)
	None bExcludeFromLightAttachmentGroup; // 0x225(0x01)
	None bReceiveMobileCSMShadows; // 0x225(0x01)
	None bSingleSampleShadowFromStationaryLights; // 0x225(0x01)
	None bIgnoreRadialImpulse; // 0x225(0x01)
	None bIgnoreRadialForce; // 0x225(0x01)
	None bApplyImpulseOnDamage; // 0x226(0x01)
	None bReplicatePhysicsToAutonomousProxy; // 0x226(0x01)
	None bFillCollisionUnderneathForNavmesh; // 0x226(0x01)
	None AlwaysLoadOnClient; // 0x226(0x01)
	None AlwaysLoadOnServer; // 0x226(0x01)
	None bUseEditorCompositing; // 0x226(0x01)
	None bRenderCustomDepth; // 0x226(0x01)
	None bExcludeFromContributionCulling; // 0x226(0x01)
	None bHasCustomNavigableGeometry; // 0x228(0x01)
	None OutlineDepthMode; // 0x229(0x01)
	None CanCharacterStepUpOn; // 0x22b(0x01)
	None LightingChannels; // 0x22c(0x01)
	None CustomDepthStencilWriteMask; // 0x22d(0x01)
	None CustomDepthStencilValue; // 0x230(0x04)
	None CustomPrimitiveData; // 0x238(0x10)
	None CustomPrimitiveDataInternal; // 0x248(0x10)
	None TranslucencySortPriority; // 0x260(0x04)
	None VisibilityId; // 0x264(0x04)
	None RuntimeVirtualTextures; // 0x268(0x10)
	None VirtualTextureLodBias; // 0x278(0x01)
	None VirtualTextureCullMips; // 0x279(0x01)
	None VirtualTextureMinCoverage; // 0x27a(0x01)
	None VirtualTextureRenderPassType; // 0x27b(0x01)
	None LpvBiasMultiplier; // 0x280(0x04)
	None OutlineThicknessMultiplier; // 0x284(0x04)
	None OutlineColor; // 0x288(0x10)
	None OutlineZFadeMin; // 0x298(0x04)
	None OutlineZFadeMax; // 0x29c(0x04)
	None BoundsScale; // 0x2a8(0x04)
	None MoveIgnoreActors; // 0x2b8(0x10)
	None MoveIgnoreComponents; // 0x2c8(0x10)
	None BodyInstance; // 0x2e8(0x110)
	None OnComponentHit; // 0x3f8(0x01)
	None OnComponentBeginOverlap; // 0x3f9(0x01)
	None OnComponentEndOverlap; // 0x3fa(0x01)
	None OnComponentWake; // 0x3fb(0x01)
	None OnComponentSleep; // 0x3fc(0x01)
	None OnBeginCursorOver; // 0x3fe(0x01)
	None OnEndCursorOver; // 0x3ff(0x01)
	None OnClicked; // 0x400(0x01)
	None OnReleased; // 0x401(0x01)
	None OnInputTouchBegin; // 0x402(0x01)
	None OnInputTouchEnd; // 0x403(0x01)
	None OnInputTouchEnter; // 0x404(0x01)
	None OnInputTouchLeave; // 0x405(0x01)
	None LODParentPrimitive; // 0x420(0x08)
	None CustomFOV; // 0x428(0x04)
	None OverrideMaterials; // 0x430(0x10)
	None bEnableMaterialParameterCaching; // 0x450(0x01)
	None SkeletalMesh; // 0x458(0x08)
	None MasterPoseComponent; // 0x460(0x08)
	None SkinCacheUsage; // 0x468(0x10)
	None bSuppressSocketByNameWarnings; // 0x548(0x01)
	None PhysicsAssetOverride; // 0x578(0x08)
	None ForcedLodModel; // 0x580(0x04)
	None MinLodModel; // 0x584(0x04)
	None StreamingDistanceMultiplier; // 0x590(0x04)
	None LODInfo; // 0x5a0(0x10)
	None VisibilityBasedAnimTickOption; // 0x5d4(0x01)
	None bOverrideMinLod; // 0x5d6(0x01)
	None bUseBoundsFromMasterPoseComponent; // 0x5d6(0x01)
	None bForceWireframe; // 0x5d6(0x01)
	None bDisplayBones; // 0x5d6(0x01)
	None bDisableMorphTarget; // 0x5d6(0x01)
	None bHideSkin; // 0x5d6(0x01)
	None bPerBoneMotionBlur; // 0x5d7(0x01)
	None bComponentUseFixedSkelBounds; // 0x5d7(0x01)
	None bConsiderAllBodiesForBounds; // 0x5d7(0x01)
	None bSyncAttachParentLOD; // 0x5d7(0x01)
	None bCanHighlightSelectedSections; // 0x5d7(0x01)
	None bRecentlyRendered; // 0x5d7(0x01)
	None bCastCapsuleDirectShadow; // 0x5d7(0x01)
	None bCastCapsuleIndirectShadow; // 0x5d7(0x01)
	None bCPUSkinning; // 0x5d8(0x01)
	None bEnableUpdateRateOptimizations; // 0x5d8(0x01)
	None bDisplayDebugUpdateRateOptimizations; // 0x5d8(0x01)
	None bRenderStatic; // 0x5d8(0x01)
	None bIgnoreMasterPoseComponentLOD; // 0x5d8(0x01)
	None bCachedLocalBoundsUpToDate; // 0x5d8(0x01)
	None bForceMeshObjectUpdate; // 0x5d9(0x01)
	None CapsuleIndirectShadowMinVisibility; // 0x5dc(0x04)
	None CachedWorldSpaceBounds; // 0x5f0(0x1c)
	None CachedWorldToLocalTransform; // 0x610(0x40)
	None ForceMipLevelsToBeResidentTimestamp; // 0x28(0x08)
	None NumCinematicMipLevels; // 0x30(0x04)
	None StreamingIndex; // 0x34(0x04)
	None CachedCombinedLODBias; // 0x38(0x04)
	None CachedNumResidentLODs; // 0x3c(0x01)
	None bCachedReadyForStreaming; // 0x3d(0x01)
	None NeverStream; // 0x3d(0x01)
	None bGlobalForceMipLevelsToBeResident; // 0x3d(0x01)
	None bIsStreamable; // 0x3d(0x01)
	None bHasStreamingUpdatePending; // 0x3d(0x01)
	None bForceMiplevelsToBeResident; // 0x3d(0x01)
	None bIgnoreStreamingMipBias; // 0x3d(0x01)
	None bUseCinematicMipLevels; // 0x3d(0x01)
	None Skeleton; // 0x60(0x08)
	None ImportedBounds; // 0x68(0x1c)
	None ExtendedBounds; // 0x84(0x1c)
	None PositiveBoundsExtension; // 0xa0(0x0c)
	None NegativeBoundsExtension; // 0xac(0x0c)
	None Materials; // 0xb8(0x10)
	None SkelMirrorTable; // 0xc8(0x10)
	None LODInfo; // 0xd8(0x10)
	None MinLOD; // 0x138(0x04)
	None MaxLod; // 0x13c(0x04)
	None DisableBelowMinLodStripping; // 0x140(0x01)
	None SkelMirrorAxis; // 0x141(0x01)
	None SkelMirrorFlipAxis; // 0x142(0x01)
	None bWillNeverMergeMesh; // 0x143(0x01)
	None bUseFullPrecisionUVs; // 0x143(0x01)
	None bUseHighPrecisionTangentBasis; // 0x143(0x01)
	None bSmoothNormalsInVertexColor; // 0x143(0x01)
	None bVertexCurvature; // 0x143(0x01)
	None bHasBeenSimplified; // 0x143(0x01)
	None bHasVertexColors; // 0x143(0x01)
	None bEnablePerPolyCollision; // 0x144(0x01)
	None BodySetup; // 0x148(0x08)
	None PhysicsAsset; // 0x150(0x08)
	None ShadowPhysicsAsset; // 0x158(0x08)
	None NodeMappingData; // 0x160(0x10)
	None MorphTargets; // 0x170(0x10)
	None PostProcessAnimBlueprint; // 0x2f8(0x08)
	None MeshClothingAssets; // 0x300(0x10)
	None SamplingInfo; // 0x310(0x30)
	None AssetUserData; // 0x340(0x10)
	None Sockets; // 0x358(0x10)
	None SkinWeightProfiles; // 0x378(0x10)
	None TinyFont; // 0x30(0x08)
	None TinyFontName; // 0x38(0x18)
	None SmallFont; // 0x50(0x08)
	None SmallFontName; // 0x58(0x18)
	None MediumFont; // 0x70(0x08)
	None MediumFontName; // 0x78(0x18)
	None LargeFont; // 0x90(0x08)
	None LargeFontName; // 0x98(0x18)
	None SubtitleFont; // 0xb0(0x08)
	None SubtitleFontName; // 0xb8(0x18)
	None AdditionalFonts; // 0xd0(0x10)
	None AdditionalFontNames; // 0xe8(0x10)
	None ConsoleClass; // 0xf8(0x08)
	None ShippingConsoleClass; // 0x100(0x08)
	None ConsoleClassName; // 0x108(0x18)
	None ShippingConsoleClassName; // 0x120(0x18)
	None GameViewportClientClass; // 0x138(0x08)
	None GameViewportClientClassName; // 0x140(0x18)
	None LocalPlayerClass; // 0x158(0x08)
	None LocalPlayerClassName; // 0x160(0x18)
	None WorldSettingsClass; // 0x178(0x08)
	None WorldSettingsClassName; // 0x180(0x18)
	None NavigationSystemClassName; // 0x198(0x18)
	None NavigationSystemClass; // 0x1b0(0x08)
	None NavigationSystemConfigClassName; // 0x1b8(0x18)
	None NavigationSystemConfigClass; // 0x1d0(0x08)
	None AvoidanceManagerClassName; // 0x1d8(0x18)
	None AvoidanceManagerClass; // 0x1f0(0x08)
	None PhysicsCollisionHandlerClass; // 0x1f8(0x08)
	None PhysicsCollisionHandlerClassName; // 0x200(0x18)
	None GameUserSettingsClassName; // 0x218(0x18)
	None GameUserSettingsClass; // 0x230(0x08)
	None AIControllerClassName; // 0x238(0x18)
	None GameUserSettings; // 0x250(0x08)
	None LevelScriptActorClass; // 0x258(0x08)
	None LevelScriptActorClassName; // 0x260(0x18)
	None DefaultBlueprintBaseClassName; // 0x278(0x18)
	None GameSingletonClassName; // 0x290(0x18)
	None GameSingleton; // 0x2a8(0x08)
	None AssetManagerClassName; // 0x2b0(0x18)
	None AssetManager; // 0x2c8(0x08)
	None DefaultTexture; // 0x2d0(0x08)
	None DefaultTextureName; // 0x2d8(0x18)
	None DefaultDiffuseTexture; // 0x2f0(0x08)
	None DefaultDiffuseTextureName; // 0x2f8(0x18)
	None DefaultBSPVertexTexture; // 0x310(0x08)
	None DefaultBSPVertexTextureName; // 0x318(0x18)
	None HighFrequencyNoiseTexture; // 0x330(0x08)
	None HighFrequencyNoiseTextureName; // 0x338(0x18)
	None DefaultBokehTexture; // 0x350(0x08)
	None DefaultBokehTextureName; // 0x358(0x18)
	None DefaultBloomKernelTexture; // 0x370(0x08)
	None DefaultBloomKernelTextureName; // 0x378(0x18)
	None WireframeMaterial; // 0x390(0x08)
	None WireframeMaterialName; // 0x398(0x10)
	None DebugMeshMaterial; // 0x3a8(0x08)
	None DebugMeshMaterialName; // 0x3b0(0x18)
	None EmissiveMeshMaterial; // 0x3c8(0x08)
	None EmissiveMeshMaterialName; // 0x3d0(0x18)
	None LevelColorationLitMaterial; // 0x3e8(0x08)
	None LevelColorationLitMaterialName; // 0x3f0(0x10)
	None LevelColorationUnlitMaterial; // 0x400(0x08)
	None LevelColorationUnlitMaterialName; // 0x408(0x10)
	None LightingTexelDensityMaterial; // 0x418(0x08)
	None WorldNormalsMaterialName; // 0x420(0x10)
	None WorldNormalsMaterial; // 0x430(0x08)
	None LightingTexelDensityName; // 0x438(0x10)
	None ShadedLevelColorationLitMaterial; // 0x448(0x08)
	None ShadedLevelColorationLitMaterialName; // 0x450(0x10)
	None ShadedLevelColorationUnlitMaterial; // 0x460(0x08)
	None ShadedLevelColorationUnlitMaterialName; // 0x468(0x10)
	None RemoveSurfaceMaterial; // 0x478(0x08)
	None RemoveSurfaceMaterialName; // 0x480(0x18)
	None VertexColorMaterial; // 0x498(0x08)
	None VertexColorMaterialName; // 0x4a0(0x10)
	None VertexColorViewModeMaterial_ColorOnly; // 0x4b0(0x08)
	None VertexColorViewModeMaterialName_ColorOnly; // 0x4b8(0x10)
	None VertexColorViewModeMaterial_AlphaAsColor; // 0x4c8(0x08)
	None VertexColorViewModeMaterialName_AlphaAsColor; // 0x4d0(0x10)
	None VertexColorViewModeMaterial_RedOnly; // 0x4e0(0x08)
	None VertexColorViewModeMaterialName_RedOnly; // 0x4e8(0x10)
	None VertexColorViewModeMaterial_GreenOnly; // 0x4f8(0x08)
	None VertexColorViewModeMaterialName_GreenOnly; // 0x500(0x10)
	None VertexColorViewModeMaterial_BlueOnly; // 0x510(0x08)
	None VertexColorViewModeMaterialName_BlueOnly; // 0x518(0x10)
	None DebugEditorMaterialName; // 0x528(0x18)
	None ConstraintLimitMaterial; // 0x540(0x08)
	None ConstraintLimitMaterialX; // 0x548(0x08)
	None ConstraintLimitMaterialXAxis; // 0x550(0x08)
	None ConstraintLimitMaterialY; // 0x558(0x08)
	None ConstraintLimitMaterialYAxis; // 0x560(0x08)
	None ConstraintLimitMaterialZ; // 0x568(0x08)
	None ConstraintLimitMaterialZAxis; // 0x570(0x08)
	None ConstraintLimitMaterialPrismatic; // 0x578(0x08)
	None InvalidLightmapSettingsMaterial; // 0x580(0x08)
	None InvalidLightmapSettingsMaterialName; // 0x588(0x18)
	None PreviewShadowsIndicatorMaterial; // 0x5a0(0x08)
	None PreviewShadowsIndicatorMaterialName; // 0x5a8(0x18)
	None ArrowMaterial; // 0x5c0(0x08)
	None ArrowMaterialYellow; // 0x5c8(0x08)
	None ArrowMaterialName; // 0x5d0(0x18)
	None LightingOnlyBrightness; // 0x5e8(0x10)
	None ShaderComplexityColors; // 0x5f8(0x10)
	None QuadComplexityColors; // 0x608(0x10)
	None LightComplexityColors; // 0x618(0x10)
	None StationaryLightOverlapColors; // 0x628(0x10)
	None LODColorationColors; // 0x638(0x10)
	None HLODColorationColors; // 0x648(0x10)
	None StreamingAccuracyColors; // 0x658(0x10)
	None MaxPixelShaderAdditiveComplexityCount; // 0x668(0x04)
	None MaxES3PixelShaderAdditiveComplexityCount; // 0x66c(0x04)
	None MinLightMapDensity; // 0x670(0x04)
	None IdealLightMapDensity; // 0x674(0x04)
	None MaxLightMapDensity; // 0x678(0x04)
	None bRenderLightMapDensityGrayscale; // 0x67c(0x01)
	None RenderLightMapDensityGrayscaleScale; // 0x680(0x04)
	None RenderLightMapDensityColorScale; // 0x684(0x04)
	None LightMapDensityVertexMappedColor; // 0x688(0x10)
	None LightMapDensitySelectedColor; // 0x698(0x10)
	None StatColorMappings; // 0x6a8(0x10)
	None DefaultPhysMaterial; // 0x6b8(0x08)
	None DefaultPhysMaterialName; // 0x6c0(0x18)
	None ActiveGameNameRedirects; // 0x6d8(0x10)
	None ActiveClassRedirects; // 0x6e8(0x10)
	None ActivePluginRedirects; // 0x6f8(0x10)
	None ActiveStructRedirects; // 0x708(0x10)
	None PreIntegratedSkinBRDFTexture; // 0x718(0x08)
	None PreIntegratedSkinBRDFTextureName; // 0x720(0x18)
	None HirezPreIntegratedSkinBRDFTexture; // 0x738(0x08)
	None HirezPreIntegratedSkinBRDFTextureName; // 0x740(0x18)
	None HirezPreIntegratedShadowTexture; // 0x758(0x08)
	None HirezPreIntegratedShadowTextureName; // 0x760(0x18)
	None BlueNoiseTexture; // 0x778(0x08)
	None BlueNoiseTextureName; // 0x780(0x18)
	None MiniFontTexture; // 0x798(0x08)
	None MiniFontTextureName; // 0x7a0(0x18)
	None WeightMapPlaceholderTexture; // 0x7b8(0x08)
	None WeightMapPlaceholderTextureName; // 0x7c0(0x18)
	None LightMapDensityTexture; // 0x7d8(0x08)
	None LightMapDensityTextureName; // 0x7e0(0x18)
	None GameViewport; // 0x800(0x08)
	None DeferredCommands; // 0x808(0x10)
	None TickCycles; // 0x818(0x04)
	None GameCycles; // 0x81c(0x04)
	None ClientCycles; // 0x820(0x04)
	None NearClipPlane; // 0x824(0x04)
	None bStreamTexturesDuringLoadScreen; // 0x828(0x01)
	None bHardwareSurveyEnabled; // 0x828(0x01)
	None bSubtitlesEnabled; // 0x828(0x01)
	None bSubtitlesForcedOff; // 0x828(0x01)
	None MaximumLoopIterationCount; // 0x82c(0x04)
	None bCanBlueprintsTickByDefault; // 0x830(0x01)
	None bOptimizeAnimBlueprintMemberVariableAccess; // 0x830(0x01)
	None bAllowMultiThreadedAnimationUpdate; // 0x830(0x01)
	None bEnableEditorPSysRealtimeLOD; // 0x830(0x01)
	None bSmoothFrameRate; // 0x830(0x01)
	None bUseFixedFrameRate; // 0x830(0x01)
	None FixedFrameRate; // 0x834(0x04)
	None SmoothedFrameRateRange; // 0x838(0x10)
	None CustomTimeStep; // 0x848(0x08)
	None CustomTimeStepClassName; // 0x870(0x18)
	None TimecodeProvider; // 0x888(0x08)
	None TimecodeProviderClassName; // 0x8b0(0x18)
	None bGenerateDefaultTimecode; // 0x8c8(0x01)
	None GenerateDefaultTimecodeFrameRate; // 0x8cc(0x08)
	None GenerateDefaultTimecodeFrameDelay; // 0x8d4(0x04)
	None bCheckForMultiplePawnsSpawnedInAFrame; // 0x8d8(0x01)
	None NumPawnsAllowedToBeSpawnedInAFrame; // 0x8dc(0x04)
	None bShouldGenerateLowQualityLightmaps; // 0x8e0(0x01)
	None C_WorldBox; // 0x8e4(0x04)
	None C_BrushWire; // 0x8e8(0x04)
	None C_AddWire; // 0x8ec(0x04)
	None C_SubtractWire; // 0x8f0(0x04)
	None C_SemiSolidWire; // 0x8f4(0x04)
	None C_NonSolidWire; // 0x8f8(0x04)
	None C_WireBackground; // 0x8fc(0x04)
	None C_ScaleBoxHi; // 0x900(0x04)
	None C_VolumeCollision; // 0x904(0x04)
	None C_BSPCollision; // 0x908(0x04)
	None C_OrthoBackground; // 0x90c(0x04)
	None C_Volume; // 0x910(0x04)
	None C_BrushShape; // 0x914(0x04)
	None StreamingDistanceFactor; // 0x918(0x04)
	None GameScreenshotSaveDirectory; // 0x920(0x10)
	None TransitionType; // 0x930(0x01)
	None TransitionDescription; // 0x938(0x10)
	None TransitionGameMode; // 0x948(0x10)
	None MeshLODRange; // 0x958(0x04)
	None bAllowMatureLanguage; // 0x95c(0x01)
	None CameraRotationThreshold; // 0x960(0x04)
	None CameraTranslationThreshold; // 0x964(0x04)
	None PrimitiveProbablyVisibleTime; // 0x968(0x04)
	None MaxOcclusionPixelsFraction; // 0x96c(0x04)
	None bPauseOnLossOfFocus; // 0x970(0x01)
	None MaxParticleResize; // 0x974(0x04)
	None MaxParticleResizeWarn; // 0x978(0x04)
	None PendingDroppedNotes; // 0x980(0x10)
	None NetClientTicksPerSecond; // 0x990(0x04)
	None DisplayGamma; // 0x994(0x04)
	None MinDesiredFrameRate; // 0x998(0x04)
	None DefaultSelectedMaterialColor; // 0x99c(0x10)
	None SelectedMaterialColor; // 0x9ac(0x10)
	None SelectionOutlineColor; // 0x9bc(0x10)
	None SubduedSelectionOutlineColor; // 0x9cc(0x10)
	None SelectedMaterialColorOverride; // 0x9dc(0x10)
	None bIsOverridingSelectedColor; // 0x9ec(0x01)
	None bEnableOnScreenDebugMessages; // 0x9f0(0x01)
	None bEnableOnScreenDebugMessagesDisplay; // 0x9f0(0x01)
	None bSuppressMapWarnings; // 0x9f0(0x01)
	None bDisableAILogging; // 0x9f0(0x01)
	None bEnableVisualLogRecordingOnStart; // 0x9f4(0x04)
	None ScreenSaverInhibitorSemaphore; // 0x9fc(0x04)
	None bLockReadOnlyLevels; // 0xa00(0x01)
	None ParticleEventManagerClassPath; // 0xa08(0x10)
	None SelectionHighlightIntensity; // 0xa18(0x04)
	None BSPSelectionHighlightIntensity; // 0xa1c(0x04)
	None SelectionHighlightIntensityBillboards; // 0xa20(0x04)
	None NetDriverDefinitions; // 0xc70(0x10)
	None ServerActors; // 0xc80(0x10)
	None RuntimeServerActors; // 0xc90(0x10)
	None NetErrorLogInterval; // 0xca0(0x04)
	None bStartedLoadMapMovie; // 0xca4(0x01)
	None NextWorldContextHandle; // 0xcc0(0x04)
	None MaxDeltaTime; // 0xe58(0x04)
	None ServerFlushLogInterval; // 0xe5c(0x04)
	None GameInstance; // 0xe60(0x08)
	None PlayerController; // 0x30(0x08)
	None CurrentNetSpeed; // 0x38(0x04)
	None ConfiguredInternetSpeed; // 0x3c(0x04)
	None ConfiguredLanSpeed; // 0x40(0x04)
	None Children; // 0x48(0x10)
	None Driver; // 0x58(0x08)
	None PackageMapClass; // 0x60(0x08)
	None PackageMap; // 0x68(0x08)
	None OpenChannels; // 0x70(0x10)
	None SentTemporaries; // 0x80(0x10)
	None ViewTarget; // 0x90(0x08)
	None OwningActor; // 0x98(0x08)
	None MaxPacket; // 0xa0(0x04)
	None InternalAck; // 0xa4(0x01)
	None PlayerId; // 0x160(0x28)
	None LastReceiveTime; // 0x1d0(0x08)
	None ChannelsToTick; // 0x1510(0x10)
	None ViewportClient; // 0x70(0x08)
	None AspectRatioAxisConstraint; // 0x94(0x01)
	None PendingLevelPlayerControllerClass; // 0x98(0x08)
	None bSentSplitJoin; // 0xa0(0x01)
	None ControllerId; // 0xb8(0x04)
	None FrameDelay; // 0x28(0x04)
	None NetConnectionClassName; // 0x30(0x10)
	None ReplicationDriverClassName; // 0x40(0x10)
	None MaxDownloadSize; // 0x50(0x04)
	None bClampListenServerTickRate; // 0x54(0x01)
	None NetServerMaxTickRate; // 0x58(0x04)
	None MaxNetTickRate; // 0x5c(0x04)
	None MaxInternetClientRate; // 0x60(0x04)
	None MaxClientRate; // 0x64(0x04)
	None ServerTravelPause; // 0x68(0x04)
	None SpawnPrioritySeconds; // 0x6c(0x04)
	None RelevantTimeout; // 0x70(0x04)
	None KeepAliveTime; // 0x74(0x04)
	None HandshakeTimeout; // 0x78(0x04)
	None InitialConnectTimeout; // 0x7c(0x04)
	None ConnectionTimeout; // 0x80(0x04)
	None TimeoutMultiplierForUnoptimizedBuilds; // 0x84(0x04)
	None bNoTimeouts; // 0x88(0x01)
	None bNeverApplyNetworkEmulationSettings; // 0x89(0x01)
	None ServerConnection; // 0x90(0x08)
	None ClientConnections; // 0x98(0x10)
	None RecentlyDisconnectedTrackingTime; // 0x108(0x04)
	None World; // 0x148(0x08)
	None WorldPackage; // 0x150(0x08)
	None NetConnectionClass; // 0x178(0x08)
	None ReplicationDriverClass; // 0x180(0x08)
	None NetDriverName; // 0x198(0x08)
	None ChannelDefinitions; // 0x1a0(0x10)
	None ChannelDefinitionMap; // 0x1b0(0x50)
	None ThrottleSpawnDefinitions; // 0x200(0x10)
	None ThrottleSpawnsRemaining; // 0x210(0x10)
	None ThrottleSpawnPausedFrameNumber; // 0x220(0x04)
	None ActorChannelPool; // 0x228(0x10)
	None Time; // 0x240(0x04)
	None ReplicationDriver; // 0x718(0x08)
	None bCanBeBaked; // 0x30(0x01)
	None bIsDirty; // 0x30(0x01)
	None bBakedDataSuccesfully; // 0x30(0x01)
	None bUseControllerRotationPitch; // 0x228(0x01)
	None bUseControllerRotationYaw; // 0x228(0x01)
	None bUseControllerRotationRoll; // 0x228(0x01)
	None bCanAffectNavigationGeneration; // 0x228(0x01)
	None BaseEyeHeight; // 0x22c(0x04)
	None AutoPossessPlayer; // 0x230(0x01)
	None AutoPossessAI; // 0x231(0x01)
	None RemoteViewPitch; // 0x232(0x01)
	None AIControllerClass; // 0x238(0x08)
	None PlayerState; // 0x240(0x08)
	None LastHitBy; // 0x250(0x08)
	None Controller; // 0x258(0x08)
	None ControlInputVector; // 0x264(0x0c)
	None LastControlInputVector; // 0x270(0x0c)
	None Mesh; // 0x280(0x08)
	None CharacterMovement; // 0x288(0x08)
	None CapsuleComponent; // 0x290(0x08)
	None BasedMovement; // 0x298(0x30)
	None ReplicatedBasedMovement; // 0x2c8(0x30)
	None AnimRootMotionTranslationScale; // 0x2f8(0x04)
	None BaseTranslationOffset; // 0x2fc(0x0c)
	None BaseRotationOffset; // 0x310(0x10)
	None ReplicatedServerLastTransformUpdateTimeStamp; // 0x320(0x04)
	None ReplayLastTransformUpdateTimeStamp; // 0x324(0x04)
	None ReplicatedMovementMode; // 0x328(0x01)
	None bInBaseReplication; // 0x329(0x01)
	None CrouchedEyeHeight; // 0x32c(0x04)
	None bIsCrouched; // 0x330(0x01)
	None bProxyIsJumpForceApplied; // 0x330(0x01)
	None bPressedJump; // 0x330(0x01)
	None bClientUpdating; // 0x330(0x01)
	None bClientWasFalling; // 0x330(0x01)
	None bClientResimulateRootMotion; // 0x330(0x01)
	None bClientResimulateRootMotionSources; // 0x330(0x01)
	None bSimGravityDisabled; // 0x330(0x01)
	None bClientCheckEncroachmentOnNetUpdate; // 0x331(0x01)
	None bServerMoveIgnoreRootMotion; // 0x331(0x01)
	None bWasJumping; // 0x331(0x01)
	None JumpKeyHoldTime; // 0x334(0x04)
	None JumpForceTimeRemaining; // 0x338(0x04)
	None ProxyJumpForceStartedTime; // 0x33c(0x04)
	None JumpMaxHoldTime; // 0x340(0x04)
	None JumpMaxCount; // 0x344(0x04)
	None JumpCurrentCount; // 0x348(0x04)
	None JumpCurrentCountPreJump; // 0x34c(0x04)
	None OnReachedJumpApex; // 0x358(0x10)
	None MovementModeChangedDelegate; // 0x378(0x10)
	None OnCharacterMovementUpdated; // 0x388(0x10)
	None SavedRootMotion; // 0x398(0x38)
	None ClientRootMotionParams; // 0x3d0(0x40)
	None RootMotionRepMoves; // 0x410(0x10)
	None RepRootMotion; // 0x420(0x98)
	None UpdatedComponent; // 0xb0(0x08)
	None UpdatedPrimitive; // 0xb8(0x08)
	None Velocity; // 0xc4(0x0c)
	None PlaneConstraintNormal; // 0xd0(0x0c)
	None PlaneConstraintOrigin; // 0xdc(0x0c)
	None bUpdateOnlyIfRendered; // 0xe8(0x01)
	None bAutoUpdateTickRegistration; // 0xe8(0x01)
	None bTickBeforeOwner; // 0xe8(0x01)
	None bAutoRegisterUpdatedComponent; // 0xe8(0x01)
	None bConstrainToPlane; // 0xe8(0x01)
	None bSnapToPlaneAtStart; // 0xe8(0x01)
	None bAutoRegisterPhysicsVolumeUpdates; // 0xe8(0x01)
	None bComponentShouldUpdatePhysicsVolume; // 0xe8(0x01)
	None PlaneConstraintAxisSetting; // 0xeb(0x01)
	None NavAgentProps; // 0xf0(0x30)
	None FixedPathBrakingDistance; // 0x120(0x04)
	None bUpdateNavAgentWithOwnersCollision; // 0x124(0x01)
	None bUseAccelerationForPaths; // 0x124(0x01)
	None bUseFixedBrakingDistanceForPaths; // 0x124(0x01)
	None MovementState; // 0x125(0x01)
	None PathFollowingComp; // 0x128(0x08)
	None PawnOwner; // 0x130(0x08)
	None CharacterOwner; // 0x148(0x08)
	None GravityScale; // 0x150(0x04)
	None MaxStepHeight; // 0x154(0x04)
	None JumpZVelocity; // 0x158(0x04)
	None JumpOffJumpZFactor; // 0x15c(0x04)
	None WalkableFloorAngle; // 0x160(0x04)
	None WalkableFloorZ; // 0x164(0x04)
	None MovementMode; // 0x168(0x01)
	None CustomMovementMode; // 0x169(0x01)
	None NetworkSmoothingMode; // 0x16a(0x01)
	None GroundFriction; // 0x16c(0x04)
	None MaxWalkSpeed; // 0x18c(0x04)
	None MaxWalkSpeedCrouched; // 0x190(0x04)
	None MaxSwimSpeed; // 0x194(0x04)
	None MaxFlySpeed; // 0x198(0x04)
	None MaxCustomMovementSpeed; // 0x19c(0x04)
	None MaxAcceleration; // 0x1a0(0x04)
	None MinAnalogWalkSpeed; // 0x1a4(0x04)
	None BrakingFrictionFactor; // 0x1a8(0x04)
	None BrakingFriction; // 0x1ac(0x04)
	None BrakingSubStepTime; // 0x1b0(0x04)
	None BrakingDecelerationWalking; // 0x1b4(0x04)
	None BrakingDecelerationFalling; // 0x1b8(0x04)
	None BrakingDecelerationSwimming; // 0x1bc(0x04)
	None BrakingDecelerationFlying; // 0x1c0(0x04)
	None AirControl; // 0x1c4(0x04)
	None AirControlBoostMultiplier; // 0x1c8(0x04)
	None AirControlBoostVelocityThreshold; // 0x1cc(0x04)
	None FallingLateralFriction; // 0x1d0(0x04)
	None CrouchedHalfHeight; // 0x1d4(0x04)
	None Buoyancy; // 0x1d8(0x04)
	None PerchRadiusThreshold; // 0x1dc(0x04)
	None PerchAdditionalHeight; // 0x1e0(0x04)
	None RotationRate; // 0x1e4(0x0c)
	None bUseSeparateBrakingFriction; // 0x1f0(0x01)
	None bApplyGravityWhileJumping; // 0x1f0(0x01)
	None bUseControllerDesiredRotation; // 0x1f0(0x01)
	None bOrientRotationToMovement; // 0x1f0(0x01)
	None bSweepWhileNavWalking; // 0x1f0(0x01)
	None bMovementInProgress; // 0x1f0(0x01)
	None bEnableScopedMovementUpdates; // 0x1f0(0x01)
	None bEnableServerDualMoveScopedMovementUpdates; // 0x1f1(0x01)
	None bForceMaxAccel; // 0x1f1(0x01)
	None bRunPhysicsWithNoController; // 0x1f1(0x01)
	None bForceNextFloorCheck; // 0x1f1(0x01)
	None bShrinkProxyCapsule; // 0x1f1(0x01)
	None bCanWalkOffLedges; // 0x1f1(0x01)
	None bCanWalkOffLedgesWhenCrouching; // 0x1f1(0x01)
	None bNetworkSkipProxyPredictionOnNetUpdate; // 0x1f2(0x01)
	None bNetworkAlwaysReplicateTransformUpdateTimestamp; // 0x1f2(0x01)
	None bDeferUpdateMoveComponent; // 0x1f2(0x01)
	None bPreventMeshDoubleMode; // 0x1f2(0x01)
	None bEnablePhysicsInteraction; // 0x1f2(0x01)
	None bTouchForceScaledToMass; // 0x1f2(0x01)
	None bPushForceScaledToMass; // 0x1f2(0x01)
	None bPushForceUsingZOffset; // 0x1f3(0x01)
	None bScalePushForceToVelocity; // 0x1f3(0x01)
	None DeferredUpdatedMoveComponent; // 0x1f8(0x08)
	None MaxOutOfWaterStepHeight; // 0x200(0x04)
	None OutofWaterZ; // 0x204(0x04)
	None Mass; // 0x208(0x04)
	None StandingDownwardForceScale; // 0x20c(0x04)
	None InitialPushForceFactor; // 0x210(0x04)
	None PushForceFactor; // 0x214(0x04)
	None PushForcePointZOffsetFactor; // 0x218(0x04)
	None TouchForceFactor; // 0x21c(0x04)
	None MinTouchForce; // 0x220(0x04)
	None MaxTouchForce; // 0x224(0x04)
	None RepulsionForce; // 0x228(0x04)
	None Acceleration; // 0x22c(0x0c)
	None LastUpdateRotation; // 0x240(0x10)
	None LastUpdateLocation; // 0x250(0x0c)
	None LastUpdateVelocity; // 0x25c(0x0c)
	None bHasQueuedServerMove; // 0x268(0x01)
	None QueuedServerLocation; // 0x26c(0x0c)
	None QueuedServerRotation; // 0x280(0x10)
	None ParallelUpdateMoveMode; // 0x298(0x01)
	None ParallelUpdateTransform; // 0x2a0(0x30)
	None ServerLastTransformUpdateTimeStamp; // 0x2d0(0x04)
	None ServerLastClientGoodMoveAckTime; // 0x2d4(0x04)
	None ServerLastClientAdjustmentTime; // 0x2d8(0x04)
	None PendingImpulseToApply; // 0x2dc(0x0c)
	None PendingForceToApply; // 0x2e8(0x0c)
	None AnalogInputModifier; // 0x2f4(0x04)
	None MaxSimulationTimeStep; // 0x304(0x04)
	None MaxSimulationIterations; // 0x308(0x04)
	None MaxJumpApexAttemptsPerSimulation; // 0x30c(0x04)
	None MaxDepenetrationWithGeometry; // 0x310(0x04)
	None MaxDepenetrationWithGeometryAsProxy; // 0x314(0x04)
	None MaxDepenetrationWithPawn; // 0x318(0x04)
	None MaxDepenetrationWithPawnAsProxy; // 0x31c(0x04)
	None NetworkSimulatedSmoothLocationTime; // 0x320(0x04)
	None NetworkSimulatedSmoothRotationTime; // 0x324(0x04)
	None ListenServerNetworkSimulatedSmoothLocationTime; // 0x328(0x04)
	None ListenServerNetworkSimulatedSmoothRotationTime; // 0x32c(0x04)
	None NetProxyShrinkRadius; // 0x330(0x04)
	None NetProxyShrinkHalfHeight; // 0x334(0x04)
	None NetworkMaxSmoothUpdateDistance; // 0x338(0x04)
	None NetworkNoSmoothUpdateDistance; // 0x33c(0x04)
	None NetworkMinTimeBetweenClientAckGoodMoves; // 0x340(0x04)
	None NetworkMinTimeBetweenClientAdjustments; // 0x344(0x04)
	None NetworkMinTimeBetweenClientAdjustmentsLargeCorrection; // 0x348(0x04)
	None NetworkLargeClientCorrectionDistance; // 0x34c(0x04)
	None LedgeCheckThreshold; // 0x350(0x04)
	None JumpOutOfWaterPitch; // 0x354(0x04)
	None CurrentFloor; // 0x358(0x94)
	None DefaultLandMovementMode; // 0x3ec(0x01)
	None DefaultWaterMovementMode; // 0x3ed(0x01)
	None GroundMovementMode; // 0x3ee(0x01)
	None bMaintainHorizontalGroundVelocity; // 0x3ef(0x01)
	None bImpartBaseVelocityX; // 0x3ef(0x01)
	None bImpartBaseVelocityY; // 0x3ef(0x01)
	None bImpartBaseVelocityZ; // 0x3ef(0x01)
	None bImpartBaseAngularVelocity; // 0x3ef(0x01)
	None bJustTeleported; // 0x3ef(0x01)
	None bNetworkUpdateReceived; // 0x3ef(0x01)
	None bNetworkMovementModeChanged; // 0x3ef(0x01)
	None bIgnoreClientMovementErrorChecksAndCorrection; // 0x3f0(0x01)
	None bServerAcceptClientAuthoritativePosition; // 0x3f0(0x01)
	None bNotifyApex; // 0x3f0(0x01)
	None bCheatFlying; // 0x3f0(0x01)
	None bWantsToCrouch; // 0x3f0(0x01)
	None bCrouchMaintainsBaseLocation; // 0x3f0(0x01)
	None bIgnoreBaseRotation; // 0x3f0(0x01)
	None bFastAttachedMove; // 0x3f0(0x01)
	None bAlwaysCheckFloor; // 0x3f1(0x01)
	None bUseFlatBaseForFloorChecks; // 0x3f1(0x01)
	None bPerformingJumpOff; // 0x3f1(0x01)
	None bWantsToLeaveNavWalking; // 0x3f1(0x01)
	None bUseRVOAvoidance; // 0x3f1(0x01)
	None bRequestedMoveUseAcceleration; // 0x3f1(0x01)
	None bWasSimulatingRootMotion; // 0x3f1(0x01)
	None bAllowPhysicsRotationDuringAnimRootMotion; // 0x3f2(0x01)
	None bHasRequestedVelocity; // 0x3f2(0x01)
	None bRequestedMoveWithMaxSpeed; // 0x3f2(0x01)
	None bWasAvoidanceUpdated; // 0x3f2(0x01)
	None bProjectNavMeshWalking; // 0x3f2(0x01)
	None bProjectNavMeshOnBothWorldChannels; // 0x3f2(0x01)
	None AvoidanceConsiderationRadius; // 0x408(0x04)
	None RequestedVelocity; // 0x40c(0x0c)
	None AvoidanceUID; // 0x418(0x04)
	None AvoidanceGroup; // 0x41c(0x04)
	None GroupsToAvoid; // 0x420(0x04)
	None GroupsToIgnore; // 0x424(0x04)
	None AvoidanceWeight; // 0x428(0x04)
	None PendingLaunchVelocity; // 0x42c(0x0c)
	None NavMeshProjectionInterval; // 0x4d8(0x04)
	None NavMeshProjectionTimer; // 0x4dc(0x04)
	None NavMeshProjectionInterpSpeed; // 0x4e0(0x04)
	None NavMeshProjectionHeightScaleUp; // 0x4e4(0x04)
	None NavMeshProjectionHeightScaleDown; // 0x4e8(0x04)
	None NavWalkingFloorDistTolerance; // 0x4ec(0x04)
	None PostPhysicsTickFunction; // 0x4f0(0x30)
	None MinTimeBetweenTimeStampResets; // 0x538(0x04)
	None CurrentRootMotion; // 0x540(0x38)
	None RootMotionParams; // 0x610(0x40)
	None AnimRootMotionVelocity; // 0x650(0x0c)
	None LocalPlayers; // 0x38(0x10)
	None OnlineSession; // 0x48(0x08)
	None ReferencedObjects; // 0x50(0x10)
	None OptionsString; // 0x220(0x10)
	None GameSessionClass; // 0x230(0x08)
	None GameStateClass; // 0x238(0x08)
	None PlayerControllerClass; // 0x240(0x08)
	None PlayerStateClass; // 0x248(0x08)
	None HUDClass; // 0x250(0x08)
	None DefaultPawnClass; // 0x258(0x08)
	None SpectatorClass; // 0x260(0x08)
	None ReplaySpectatorPlayerControllerClass; // 0x268(0x08)
	None ServerStatReplicatorClass; // 0x270(0x08)
	None GameSession; // 0x278(0x08)
	None GameState; // 0x280(0x08)
	None ServerStatReplicator; // 0x288(0x08)
	None DefaultPlayerName; // 0x290(0x18)
	None bUseSeamlessTravel; // 0x2a8(0x01)
	None bStartPlayersAsSpectators; // 0x2a8(0x01)
	None bPauseable; // 0x2a8(0x01)
	None MatchState; // 0x2c0(0x08)
	None bDelayedStart; // 0x2c8(0x01)
	None NumSpectators; // 0x2cc(0x04)
	None NumPlayers; // 0x2d0(0x04)
	None NumBots; // 0x2d4(0x04)
	None MinRespawnDelay; // 0x2d8(0x04)
	None NumTravellingPlayers; // 0x2dc(0x04)
	None EngineMessageClass; // 0x2e0(0x08)
	None InactivePlayerArray; // 0x2e8(0x10)
	None InactivePlayerStateLifeSpan; // 0x2f8(0x04)
	None MaxInactivePlayers; // 0x2fc(0x04)
	None bHandleDedicatedServerReplays; // 0x300(0x01)
	None GameModeClass; // 0x220(0x08)
	None AuthorityGameMode; // 0x228(0x08)
	None SpectatorClass; // 0x230(0x08)
	None PlayerArray; // 0x238(0x10)
	None bReplicatedHasBegunPlay; // 0x248(0x01)
	None ReplicatedWorldTimeSeconds; // 0x24c(0x04)
	None ServerWorldTimeSecondsDelta; // 0x250(0x04)
	None ServerWorldTimeSecondsUpdateFrequency; // 0x254(0x04)
	None MatchState; // 0x270(0x08)
	None PreviousMatchState; // 0x278(0x08)
	None ElapsedTime; // 0x280(0x04)
	None PlayerState; // 0x228(0x08)
	None OnInstigatedAnyDamage; // 0x238(0x10)
	None StateName; // 0x248(0x08)
	None Pawn; // 0x250(0x08)
	None Character; // 0x260(0x08)
	None TransformComponent; // 0x268(0x08)
	None ControlRotation; // 0x288(0x0c)
	None bAttachToPawn; // 0x294(0x01)
	None Player; // 0x298(0x08)
	None AcknowledgedPawn; // 0x2a0(0x08)
	None ControllingDirTrackInst; // 0x2a8(0x08)
	None MyHud; // 0x2b0(0x08)
	None PlayerCameraManager; // 0x2b8(0x08)
	None PlayerCameraManagerClass; // 0x2c0(0x08)
	None bAutoManageActiveCameraTarget; // 0x2c8(0x01)
	None TargetViewRotation; // 0x2cc(0x0c)
	None SmoothTargetViewRotationSpeed; // 0x2e4(0x04)
	None HiddenActors; // 0x2f0(0x10)
	None HiddenPrimitiveComponents; // 0x300(0x10)
	None LastSpectatorStateSynchTime; // 0x314(0x04)
	None LastSpectatorSyncLocation; // 0x318(0x0c)
	None LastSpectatorSyncRotation; // 0x324(0x0c)
	None ClientCap; // 0x330(0x04)
	None CheatManager; // 0x338(0x08)
	None CheatClass; // 0x340(0x08)
	None PlayerInputClass; // 0x348(0x08)
	None PlayerInput; // 0x350(0x08)
	None ActiveForceFeedbackEffects; // 0x358(0x10)
	None bPlayerIsWaiting; // 0x3d8(0x01)
	None NetPlayerIndex; // 0x3dc(0x01)
	None PendingSwapConnection; // 0x418(0x08)
	None NetConnection; // 0x420(0x08)
	None InputYawScale; // 0x440(0x04)
	None InputPitchScale; // 0x444(0x04)
	None InputRollScale; // 0x448(0x04)
	None bShowMouseCursor; // 0x44c(0x01)
	None bEnableClickEvents; // 0x44c(0x01)
	None bEnableTouchEvents; // 0x44c(0x01)
	None bEnableMouseOverEvents; // 0x44c(0x01)
	None bEnableTouchOverEvents; // 0x44c(0x01)
	None bForceFeedbackEnabled; // 0x44c(0x01)
	None ForceFeedbackScale; // 0x450(0x04)
	None ClickEventKeys; // 0x458(0x10)
	None DefaultMouseCursor; // 0x468(0x01)
	None CurrentMouseCursor; // 0x469(0x01)
	None DefaultClickTraceChannel; // 0x46a(0x01)
	None CurrentClickTraceChannel; // 0x46b(0x01)
	None HitResultTraceDistance; // 0x46c(0x04)
	None SeamlessTravelCount; // 0x470(0x02)
	None LastCompletedSeamlessTravelCount; // 0x472(0x02)
	None InactiveStateInputComponent; // 0x4e8(0x08)
	None bShouldPerformFullTickWhenPaused; // 0x4f0(0x01)
	None CurrentTouchInterface; // 0x508(0x08)
	None SpectatorPawn; // 0x560(0x08)
	None bIsLocalPlayerController; // 0x56c(0x01)
	None SpawnLocation; // 0x570(0x0c)
	None DebugExecBindings; // 0x120(0x10)
	None InvertedAxis; // 0x160(0x10)
	None TouchRegionStates; // 0x12a0(0x10)
	None CachedKeyToActionInfo; // 0x120(0x10)
	None Score; // 0x220(0x04)
	None PlayerId; // 0x224(0x04)
	None Ping; // 0x228(0x01)
	None bShouldUpdateReplicatedPing; // 0x22a(0x01)
	None bIsSpectator; // 0x22a(0x01)
	None bOnlySpectator; // 0x22a(0x01)
	None bIsABot; // 0x22a(0x01)
	None bIsInactive; // 0x22a(0x01)
	None bFromPreviousLevel; // 0x22a(0x01)
	None StartTime; // 0x22c(0x04)
	None EngineMessageClass; // 0x230(0x08)
	None SavedNetworkAddress; // 0x240(0x10)
	None UniqueId; // 0x250(0x28)
	None PawnPrivate; // 0x280(0x08)
	None PlayerNamePrivate; // 0x300(0x10)
	None ViewportConsole; // 0x40(0x08)
	None DebugProperties; // 0x48(0x10)
	None MaxSplitscreenPlayers; // 0x68(0x04)
	None World; // 0x78(0x08)
	None GameInstance; // 0x80(0x08)
	None ConsoleTargetPlayer; // 0x38(0x08)
	None DefaultTexture_Black; // 0x40(0x08)
	None DefaultTexture_White; // 0x48(0x08)
	None HistoryBuffer; // 0x68(0x10)
	None DefaultHeight; // 0x130(0x04)
	None VisibilityCellSize; // 0x228(0x04)
	None VisibilityAggressiveness; // 0x22c(0x01)
	None bPrecomputeVisibility; // 0x22d(0x01)
	None bPlaceCellsOnlyAlongCameraTracks; // 0x22d(0x01)
	None bEnableWorldBoundsChecks; // 0x22d(0x01)
	None bEnableNavigationSystem; // 0x22d(0x01)
	None bEnableAISystem; // 0x22d(0x01)
	None bEnableWorldComposition; // 0x22d(0x01)
	None bUseClientSideLevelStreamingVolumes; // 0x22d(0x01)
	None bEnableWorldOriginRebasing; // 0x22d(0x01)
	None bWorldGravitySet; // 0x22e(0x01)
	None bGlobalGravitySet; // 0x22e(0x01)
	None bMinimizeBSPSections; // 0x22e(0x01)
	None bForceNoPrecomputedLighting; // 0x22e(0x01)
	None bHighPriorityLoading; // 0x22e(0x01)
	None bHighPriorityLoadingLocal; // 0x22e(0x01)
	None bOverrideDefaultBroadphaseSettings; // 0x22e(0x01)
	None NavigationSystemConfig; // 0x230(0x08)
	None NavigationSystemConfigOverride; // 0x238(0x08)
	None WorldToMeters; // 0x240(0x04)
	None KillZ; // 0x244(0x04)
	None KillZDamageType; // 0x248(0x08)
	None WorldGravityZ; // 0x250(0x04)
	None GlobalGravityZ; // 0x254(0x04)
	None DefaultPhysicsVolumeClass; // 0x258(0x08)
	None PhysicsCollisionHandlerClass; // 0x260(0x08)
	None DefaultGameMode; // 0x268(0x08)
	None GameNetworkManagerClass; // 0x270(0x08)
	None PackedLightAndShadowMapTextureSize; // 0x278(0x04)
	None DefaultColorScale; // 0x27c(0x0c)
	None DefaultMaxDistanceFieldOcclusionDistance; // 0x288(0x04)
	None GlobalDistanceFieldViewDistance; // 0x28c(0x04)
	None DynamicIndirectShadowsSelfShadowingIntensity; // 0x290(0x04)
	None DefaultReverbSettings; // 0x298(0x20)
	None DefaultAmbientZoneSettings; // 0x2b8(0x24)
	None MonoCullingDistance; // 0x2dc(0x04)
	None DefaultBaseSoundMix; // 0x2e0(0x08)
	None TimeDilation; // 0x2e8(0x04)
	None MatineeTimeDilation; // 0x2ec(0x04)
	None DemoPlayTimeDilation; // 0x2f0(0x04)
	None MinGlobalTimeDilation; // 0x2f4(0x04)
	None MaxGlobalTimeDilation; // 0x2f8(0x04)
	None MinUndilatedFrameTime; // 0x2fc(0x04)
	None MaxUndilatedFrameTime; // 0x300(0x04)
	None BroadphaseSettings; // 0x304(0x40)
	None Pauser; // 0x348(0x08)
	None ReplicationViewers; // 0x350(0x10)
	None AssetUserData; // 0x360(0x10)
	None PauserPlayerState; // 0x370(0x08)
	None MaxNumberOfBookmarks; // 0x378(0x04)
	None DefaultBookmarkClass; // 0x380(0x08)
	None BookmarkArray; // 0x388(0x10)
	None LastBookmarkClass; // 0x398(0x08)
	None NativeClass; // 0x28(0x08)
	None ObjectReferenceList; // 0x2c0(0x10)
	None bIsGlobalAsyncScanEnvironment; // 0x2d0(0x01)
	None bShouldGuessTypeAndName; // 0x2d1(0x01)
	None bShouldUseSynchronousLoad; // 0x2d2(0x01)
	None bIsLoadingFromPakFiles; // 0x2d3(0x01)
	None bShouldAcquireMissingChunksOnLoad; // 0x2d4(0x01)
	None bOnlyCookProductionAssets; // 0x2d5(0x01)
	None bIsBulkScanning; // 0x2d6(0x01)
	None bIsPrimaryAssetDirectoryCurrent; // 0x2d7(0x01)
	None bIsManagementDatabaseCurrent; // 0x2d8(0x01)
	None bUpdateManagementDatabaseAfterScan; // 0x2d9(0x01)
	None bIncludeOnlyOnDiskAssets; // 0x2da(0x01)
	None NumberOfSpawnedNotifications; // 0x2dc(0x04)
	None bForceUseAllBundlesDuringLoadRecursive; // 0x3d0(0x01)
	None PlayerOwner; // 0x220(0x08)
	None bLostFocusPaused; // 0x228(0x01)
	None bShowHUD; // 0x228(0x01)
	None bShowDebugInfo; // 0x228(0x01)
	None CurrentTargetIndex; // 0x22c(0x04)
	None bShowHitBoxDebugInfo; // 0x230(0x01)
	None bShowOverlays; // 0x230(0x01)
	None bEnableDebugTextShadow; // 0x230(0x01)
	None PostRenderedActors; // 0x238(0x10)
	None DebugDisplay; // 0x250(0x10)
	None ToggledDebugCategories; // 0x260(0x10)
	None Canvas; // 0x270(0x08)
	None DebugCanvas; // 0x278(0x08)
	None DebugTextList; // 0x280(0x10)
	None ShowDebugTargetDesiredClass; // 0x290(0x08)
	None ShowDebugTargetActor; // 0x298(0x08)
	None BrushType; // 0x220(0x01)
	None BrushColor; // 0x224(0x04)
	None PolyFlags; // 0x228(0x04)
	None bColored; // 0x22c(0x01)
	None bSolidWhenSelected; // 0x22c(0x01)
	None bPlaceableFromClassBrowser; // 0x22c(0x01)
	None bNotForClientOrServer; // 0x22c(0x01)
	None Brush; // 0x230(0x08)
	None BrushComponent; // 0x238(0x08)
	None bInManipulation; // 0x240(0x01)
	None SavedSelections; // 0x248(0x10)
	None PersistentLevel; // 0x30(0x08)
	None NetDriver; // 0x38(0x08)
	None LineBatcher; // 0x40(0x08)
	None PersistentLineBatcher; // 0x48(0x08)
	None ForegroundLineBatcher; // 0x50(0x08)
	None NetworkManager; // 0x58(0x08)
	None PhysicsCollisionHandler; // 0x60(0x08)
	None ExtraReferencedObjects; // 0x68(0x10)
	None PerModuleDataObjects; // 0x78(0x10)
	None LevelSequenceActors; // 0x88(0x10)
	None StreamingLevels; // 0x98(0x10)
	None StreamingLevelsToConsider; // 0xa8(0x28)
	None StreamingLevelsPrefix; // 0xd0(0x10)
	None CurrentLevelPendingVisibility; // 0xe0(0x08)
	None CurrentLevelPendingInvisibility; // 0xe8(0x08)
	None DemoNetDriver; // 0xf0(0x08)
	None MyParticleEventManager; // 0xf8(0x08)
	None DefaultPhysicsVolume; // 0x100(0x08)
	None bAreConstraintsDirty; // 0x11e(0x01)
	None NavigationSystem; // 0x120(0x08)
	None AuthorityGameMode; // 0x128(0x08)
	None GameState; // 0x130(0x08)
	None AISystem; // 0x138(0x08)
	None AvoidanceManager; // 0x140(0x08)
	None Levels; // 0x148(0x10)
	None LevelCollections; // 0x158(0x10)
	None OwningGameInstance; // 0x188(0x08)
	None ParameterCollectionInstances; // 0x190(0x10)
	None CanvasForRenderingToTarget; // 0x1a0(0x08)
	None CanvasForDrawMaterialToRenderTarget; // 0x1a8(0x08)
	None ComponentsThatNeedEndOfFrameUpdate; // 0x200(0x10)
	None ComponentsThatNeedEndOfFrameUpdate_OnGameThread; // 0x210(0x10)
	None WorldComposition; // 0x560(0x08)
	None PSCPool; // 0x5f0(0x58)
	None HirezObjectPool; // 0x710(0x68)
	None SubTracks; // 0x38(0x10)
	None TrackInstClass; // 0x48(0x08)
	None ActiveCondition; // 0x50(0x01)
	None TrackTitle; // 0x58(0x10)
	None bOnePerGroup; // 0x68(0x01)
	None bDirGroupOnly; // 0x68(0x01)
	None bDisableTrack; // 0x68(0x01)
	None bIsSelected; // 0x68(0x01)
	None bIsAnimControlTrack; // 0x68(0x01)
	None bSubTrackOnly; // 0x68(0x01)
	None bVisible; // 0x68(0x01)
	None bIsRecording; // 0x68(0x01)
	None VectorTrack; // 0x70(0x18)
	None CurveTension; // 0x88(0x04)
	None FloatTrack; // 0x70(0x18)
	None CurveTension; // 0x88(0x04)
	None AnimBlueprintGeneratedClass; // 0x670(0x08)
	None AnimClass; // 0x678(0x08)
	None AnimScriptInstance; // 0x680(0x08)
	None PostProcessAnimInstance; // 0x688(0x08)
	None AnimationData; // 0x690(0x18)
	None RootBoneTranslation; // 0x6b8(0x0c)
	None LineCheckBoundsScale; // 0x6c4(0x0c)
	None LinkedInstances; // 0x710(0x10)
	None CachedBoneSpaceTransforms; // 0x720(0x10)
	None CachedComponentSpaceTransforms; // 0x730(0x10)
	None GlobalAnimRateScale; // 0x760(0x04)
	None KinematicBonesUpdateType; // 0x764(0x01)
	None PhysicsTransformUpdateMode; // 0x765(0x01)
	None AnimationMode; // 0x767(0x01)
	None bDisablePostProcessBlueprint; // 0x769(0x01)
	None bUpdateOverlapsOnAnimationFinalize; // 0x769(0x01)
	None bHasValidBodies; // 0x769(0x01)
	None bBlendPhysics; // 0x769(0x01)
	None bEnablePhysicsOnDedicatedServer; // 0x769(0x01)
	None bUpdateJointsFromAnimation; // 0x76a(0x01)
	None bDisableClothSimulation; // 0x76a(0x01)
	None bDisableRigidBodyAnimNode; // 0x76a(0x01)
	None bAllowAnimCurveEvaluation; // 0x76a(0x01)
	None bDisableAnimCurves; // 0x76a(0x01)
	None bCollideWithEnvironment; // 0x76b(0x01)
	None bCollideWithAttachedChildren; // 0x76b(0x01)
	None bLocalSpaceSimulation; // 0x76b(0x01)
	None bResetAfterTeleport; // 0x76b(0x01)
	None bDeferKinematicBoneUpdate; // 0x76b(0x01)
	None bNoSkeletonUpdate; // 0x76b(0x01)
	None bPauseAnims; // 0x76b(0x01)
	None bUseRefPoseOnInitAnim; // 0x76c(0x01)
	None bEnablePerPolyCollision; // 0x76c(0x01)
	None bForceRefpose; // 0x76c(0x01)
	None bOnlyAllowAutonomousTickPose; // 0x76c(0x01)
	None bIsAutonomousTickPose; // 0x76c(0x01)
	None bOldForceRefPose; // 0x76c(0x01)
	None bShowPrePhysBones; // 0x76c(0x01)
	None bRequiredBonesUpToDate; // 0x76c(0x01)
	None bAnimTreeInitialised; // 0x76d(0x01)
	None bIncludeComponentLocationIntoBounds; // 0x76d(0x01)
	None bEnableLineCheckWithBounds; // 0x76d(0x01)
	None bUseBendingElements; // 0x76d(0x01)
	None bUseTetrahedralConstraints; // 0x76d(0x01)
	None bUseThinShellVolumeConstraints; // 0x76d(0x01)
	None bUseSelfCollisions; // 0x76d(0x01)
	None bUseContinuousCollisionDetection; // 0x76d(0x01)
	None bPropagateCurvesToSlaves; // 0x76e(0x01)
	None bSkipKinematicUpdateWhenInterpolating; // 0x76e(0x01)
	None bSkipBoundsUpdateWhenInterpolating; // 0x76e(0x01)
	None bNeedsQueuedAnimEventsDispatched; // 0x76e(0x01)
	None CachedAnimCurveUidVersion; // 0x770(0x02)
	None MassMode; // 0x772(0x01)
	None UniformMass; // 0x774(0x04)
	None TotalMass; // 0x778(0x04)
	None Density; // 0x77c(0x04)
	None MinPerParticleMass; // 0x780(0x04)
	None ClothBlendWeight; // 0x784(0x04)
	None EdgeStiffness; // 0x788(0x04)
	None BendingStiffness; // 0x78c(0x04)
	None AreaStiffness; // 0x790(0x04)
	None VolumeStiffness; // 0x794(0x04)
	None StrainLimitingStiffness; // 0x798(0x04)
	None ShapeTargetStiffness; // 0x79c(0x04)
	None DisallowedAnimCurves; // 0x7a0(0x10)
	None BodySetup; // 0x7b0(0x08)
	None OnConstraintBroken; // 0x7c0(0x10)
	None ClothingSimulationFactory; // 0x7d0(0x08)
	None TeleportDistanceThreshold; // 0x8a8(0x04)
	None TeleportRotationThreshold; // 0x8ac(0x04)
	None LastPoseTickFrame; // 0x8b8(0x04)
	None bDelayedAnimTaskValid; // 0x8c8(0x01)
	None bDisableDelayedAnimTask; // 0x8c9(0x01)
	None ClothingInteractor; // 0x920(0x08)
	None OnAnimInitialized; // 0xa50(0x10)
	None StaticMeshGuid; // 0x458(0x10)
	None ForcedLodModel; // 0x468(0x04)
	None PreviousLODLevel; // 0x46c(0x04)
	None MinLOD; // 0x470(0x04)
	None SubDivisionStepSize; // 0x474(0x04)
	None StaticMesh; // 0x478(0x08)
	None WireframeColorOverride; // 0x480(0x04)
	None bEvaluateWorldPositionOffset; // 0x484(0x01)
	None bOverrideWireframeColor; // 0x484(0x01)
	None bOverrideMinLod; // 0x484(0x01)
	None bOverrideNavigationExport; // 0x484(0x01)
	None bForceNavigationObstacle; // 0x484(0x01)
	None bDisallowMeshPaintPerInstance; // 0x484(0x01)
	None bIgnoreInstanceForTextureStreaming; // 0x484(0x01)
	None bOverrideLightMapRes; // 0x484(0x01)
	None bCastDistanceFieldIndirectShadow; // 0x485(0x01)
	None bOverrideDistanceFieldSelfShadowBias; // 0x485(0x01)
	None bUseSubDivisions; // 0x485(0x01)
	None bUseDefaultCollision; // 0x485(0x01)
	None bReverseCulling; // 0x485(0x01)
	None bHasReflectionCaptureOverrideLocation; // 0x485(0x01)
	None ReflectionCaptureOverrideLocation; // 0x488(0x0c)
	None OverriddenLightMapRes; // 0x494(0x04)
	None DistanceFieldIndirectShadowMinVisibility; // 0x498(0x04)
	None DistanceFieldSelfShadowBias; // 0x49c(0x04)
	None StreamingDistanceMultiplier; // 0x4a0(0x04)
	None LODData; // 0x4a8(0x10)
	None StreamingTextureData; // 0x4b8(0x10)
	None LightmassSettings; // 0x4c8(0x1c)
	None PSTemplate; // 0x38(0x08)
	None LocationOffset; // 0x40(0x0c)
	None RotationOffset; // 0x4c(0x0c)
	None Scale; // 0x58(0x0c)
	None Attached; // 0x80(0x01)
	None SocketName; // 0x84(0x08)
	None CurrentSkeleton; // 0x28(0x08)
	None RootMotionMode; // 0x30(0x01)
	None bUseMultiThreadedAnimationUpdate; // 0x31(0x01)
	None bUsingCopyPoseFromMesh; // 0x31(0x01)
	None bReceiveNotifiesFromLinkedInstances; // 0x31(0x01)
	None bPropagateNotifiesToLinkedInstances; // 0x31(0x01)
	None bQueueMontageEvents; // 0x31(0x01)
	None OnMontageBlendingOut; // 0x38(0x10)
	None OnMontageStarted; // 0x48(0x10)
	None OnMontageEnded; // 0x58(0x10)
	None OnAllMontageInstancesEnded; // 0x68(0x10)
	None NotifyQueue; // 0x100(0x70)
	None ActiveAnimNotifyState; // 0x170(0x10)
	None SubAnimInstanceWeight; // 0x180(0x04)
	None DecalMaterial; // 0x208(0x08)
	None SortOrder; // 0x210(0x04)
	None FadeScreenSize; // 0x214(0x04)
	None FadeStartDelay; // 0x218(0x04)
	None FadeDuration; // 0x21c(0x04)
	None FadeInDuration; // 0x220(0x04)
	None FadeInStartDelay; // 0x224(0x04)
	None bDestroyOwnerAfterFade; // 0x228(0x01)
	None DecalSize; // 0x22c(0x0c)
	None MaxPoolSize; // 0x28(0x04)
	None HelpDescription; // 0x28(0x10)
	None HelpUsage; // 0x38(0x10)
	None HelpWebLink; // 0x48(0x10)
	None HelpParamNames; // 0x58(0x10)
	None HelpParamDescriptions; // 0x68(0x10)
	None IsServer; // 0x78(0x01)
	None IsClient; // 0x78(0x01)
	None IsEditor; // 0x78(0x01)
	None LogToConsole; // 0x78(0x01)
	None ShowErrorCount; // 0x78(0x01)
	None ShowProgress; // 0x78(0x01)
	None Description; // 0x28(0x10)
	None Sound; // 0x208(0x08)
	None InstanceParameters; // 0x210(0x10)
	None SoundClassOverride; // 0x220(0x08)
	None bAutoDestroy; // 0x228(0x01)
	None bStopWhenOwnerDestroyed; // 0x228(0x01)
	None bShouldRemainActiveIfDropped; // 0x228(0x01)
	None bAllowSpatialization; // 0x228(0x01)
	None bOverrideAttenuation; // 0x228(0x01)
	None bOverrideSubtitlePriority; // 0x228(0x01)
	None bIsUISound; // 0x228(0x01)
	None bEnableLowPassFilter; // 0x228(0x01)
	None bOverridePriority; // 0x229(0x01)
	None bSuppressSubtitles; // 0x229(0x01)
	None bAutoManageAttachment; // 0x22a(0x01)
	None AudioComponentUserID; // 0x230(0x08)
	None PitchModulationMin; // 0x238(0x04)
	None PitchModulationMax; // 0x23c(0x04)
	None VolumeModulationMin; // 0x240(0x04)
	None VolumeModulationMax; // 0x244(0x04)
	None VolumeMultiplier; // 0x248(0x04)
	None EnvelopeFollowerAttackTime; // 0x24c(0x04)
	None EnvelopeFollowerReleaseTime; // 0x250(0x04)
	None Priority; // 0x254(0x04)
	None SubtitlePriority; // 0x258(0x04)
	None SourceEffectChain; // 0x260(0x08)
	None PitchMultiplier; // 0x268(0x04)
	None LowPassFilterFrequency; // 0x26c(0x04)
	None AttenuationSettings; // 0x278(0x08)
	None AttenuationOverrides; // 0x280(0x3a0)
	None ConcurrencySettings; // 0x620(0x08)
	None ConcurrencySet; // 0x628(0x50)
	None AutoAttachLocationRule; // 0x684(0x01)
	None AutoAttachRotationRule; // 0x685(0x01)
	None AutoAttachScaleRule; // 0x686(0x01)
	None OnAudioFinished; // 0x688(0x10)
	None OnAudioPlaybackPercent; // 0x6b0(0x10)
	None OnAudioSingleEnvelopeValue; // 0x6d8(0x10)
	None OnAudioMultiEnvelopeValue; // 0x700(0x10)
	None Modulation; // 0x728(0x10)
	None OnQueueSubtitles; // 0x738(0x10)
	None AutoAttachParent; // 0x748(0x08)
	None AutoAttachSocketName; // 0x750(0x08)
	None ShapeBodySetup; // 0x430(0x08)
	None AreaClass; // 0x438(0x08)
	None ShapeColor; // 0x440(0x04)
	None bDrawOnlyIfSelected; // 0x444(0x01)
	None bShouldCollideWhenPlacing; // 0x444(0x01)
	None bDynamicObstacle; // 0x444(0x01)
	None SphereRadius; // 0x448(0x04)
	None PSTemplate; // 0x30(0x08)
	None FirstSocketName; // 0x38(0x08)
	None SecondSocketName; // 0x40(0x08)
	None WidthScaleMode; // 0x48(0x01)
	None WidthScaleCurve; // 0x4c(0x08)
	None bRecycleSpawnedSystems; // 0x54(0x01)
	None bDebug; // 0x28(0x01)
	None bExclusive; // 0x28(0x01)
	None Priority; // 0x2c(0x01)
	None CameraOwner; // 0x30(0x08)
	None AlphaInTime; // 0x38(0x04)
	None AlphaOutTime; // 0x3c(0x04)
	None Alpha; // 0x40(0x04)
	None bSingleInstance; // 0x28(0x01)
	None OscillationDuration; // 0x2c(0x04)
	None OscillationBlendInTime; // 0x30(0x04)
	None OscillationBlendOutTime; // 0x34(0x04)
	None RotOscillation; // 0x38(0x24)
	None LocOscillation; // 0x5c(0x24)
	None FOVOscillation; // 0x80(0x0c)
	None AnimPlayRate; // 0x8c(0x04)
	None AnimScale; // 0x90(0x04)
	None AnimBlendInTime; // 0x94(0x04)
	None AnimBlendOutTime; // 0x98(0x04)
	None RandomAnimSegmentDuration; // 0x9c(0x04)
	None Anim; // 0xa0(0x08)
	None bRandomAnimSegment; // 0xa8(0x01)
	None CameraOwner; // 0xc0(0x08)
	None ShakeScale; // 0x148(0x04)
	None OscillatorTimeRemaining; // 0x14c(0x04)
	None AnimInst; // 0x150(0x08)
	None CapsuleHalfHeight; // 0x448(0x04)
	None CapsuleRadius; // 0x44c(0x04)
	None bCausedByWorld; // 0x28(0x01)
	None bScaleMomentumByMass; // 0x28(0x01)
	None bRadialDamageVelChange; // 0x28(0x01)
	None DamageImpulse; // 0x2c(0x04)
	None DestructibleImpulse; // 0x30(0x04)
	None DestructibleDamageSpreadScale; // 0x34(0x04)
	None DamageFalloff; // 0x38(0x04)
	None TerminalVelocity; // 0x258(0x04)
	None Priority; // 0x25c(0x04)
	None FluidFriction; // 0x260(0x04)
	None bWaterVolume; // 0x264(0x01)
	None bPhysicsOnContact; // 0x264(0x01)
	None bUseVSync; // 0x28(0x01)
	None bUseDynamicResolution; // 0x29(0x01)
	None ResolutionSizeX; // 0x80(0x04)
	None ResolutionSizeY; // 0x84(0x04)
	None LastUserConfirmedResolutionSizeX; // 0x88(0x04)
	None LastUserConfirmedResolutionSizeY; // 0x8c(0x04)
	None WindowPosX; // 0x90(0x04)
	None WindowPosY; // 0x94(0x04)
	None FullscreenMode; // 0x98(0x04)
	None LastConfirmedFullscreenMode; // 0x9c(0x04)
	None PreferredFullscreenMode; // 0xa0(0x04)
	None Version; // 0xa4(0x04)
	None AudioQualityLevel; // 0xa8(0x04)
	None LastConfirmedAudioQualityLevel; // 0xac(0x04)
	None FrameRateLimit; // 0xb0(0x04)
	None DesiredScreenWidth; // 0xb8(0x04)
	None bUseDesiredScreenHeight; // 0xbc(0x01)
	None DesiredScreenHeight; // 0xc0(0x04)
	None LastUserConfirmedDesiredScreenWidth; // 0xc4(0x04)
	None LastUserConfirmedDesiredScreenHeight; // 0xc8(0x04)
	None LastRecommendedScreenWidth; // 0xcc(0x04)
	None LastRecommendedScreenHeight; // 0xd0(0x04)
	None LastCPUBenchmarkResult; // 0xd4(0x04)
	None LastGPUBenchmarkResult; // 0xd8(0x04)
	None LastCPUBenchmarkSteps; // 0xe0(0x10)
	None LastGPUBenchmarkSteps; // 0xf0(0x10)
	None LastGPUBenchmarkMultiplier; // 0x100(0x04)
	None bUseHDRDisplayOutput; // 0x104(0x01)
	None HDRDisplayOutputNits; // 0x108(0x04)
	None OnGameUserSettingsUINeedsUpdate; // 0x110(0x10)
	None RowStruct; // 0x28(0x08)
	None bStripFromClientBuilds; // 0x80(0x01)
	None bIgnoreExtraFields; // 0x80(0x01)
	None bIgnoreMissingFields; // 0x80(0x01)
	None ImportKeyField; // 0x88(0x10)
	None AutoActivateForPlayer; // 0x220(0x01)
	None CameraComponent; // 0x228(0x08)
	None SceneComponent; // 0x230(0x08)
	None bConstrainAspectRatio; // 0x240(0x01)
	None AspectRatio; // 0x244(0x04)
	None FOVAngle; // 0x248(0x04)
	None PostProcessBlendWeight; // 0x24c(0x04)
	None PostProcessSettings; // 0x250(0x550)
	None Rules; // 0x30(0x0c)
	None bLabelAssetsInMyDirectory; // 0x3c(0x01)
	None bIsRuntimeLabel; // 0x3c(0x01)
	None ExplicitAssets; // 0x40(0x10)
	None ExplicitBlueprints; // 0x50(0x10)
	None AssetCollection; // 0x60(0x08)
	None CapsuleComponent; // 0x228(0x08)
	None GoodSprite; // 0x230(0x08)
	None BadSprite; // 0x238(0x08)
	None bIsPIEPlayerStart; // 0x240(0x01)
	None bSpawnModule; // 0x28(0x01)
	None bUpdateModule; // 0x28(0x01)
	None bFinalUpdateModule; // 0x28(0x01)
	None bUpdateForGPUEmitter; // 0x28(0x01)
	None bCurvesAsColor; // 0x28(0x01)
	None b3DDrawMode; // 0x28(0x01)
	None bSupported3DDrawMode; // 0x28(0x01)
	None bEnabled; // 0x28(0x01)
	None bEditable; // 0x29(0x01)
	None LODDuplicate; // 0x29(0x01)
	None bSupportsRandomSeed; // 0x29(0x01)
	None bRequiresLoopingNotification; // 0x29(0x01)
	None LODValidity; // 0x2a(0x01)
	None SourceType; // 0x30(0x01)
	None UniversalOffset; // 0x34(0x0c)
	None bUpdatePositionEachFrame; // 0x40(0x01)
	None bOrientMeshEmitters; // 0x40(0x01)
	None bInheritBoneVelocity; // 0x40(0x01)
	None InheritVelocityScale; // 0x44(0x04)
	None SkelMeshActorParamName; // 0x48(0x08)
	None ValidAssociatedBones; // 0x50(0x10)
	None bEnforceNormalCheck; // 0x60(0x01)
	None NormalToCompare; // 0x64(0x0c)
	None NormalCheckToleranceDegrees; // 0x70(0x04)
	None NormalCheckTolerance; // 0x74(0x04)
	None ValidMaterialIndices; // 0x78(0x10)
	None bInheritVertexColor; // 0x88(0x01)
	None bInheritUV; // 0x88(0x01)
	None InheritUVChannel; // 0x8c(0x04)
	None PCOwner; // 0x220(0x08)
	None TransformComponent; // 0x228(0x08)
	None DefaultFOV; // 0x238(0x04)
	None DefaultOrthoWidth; // 0x240(0x04)
	None DefaultAspectRatio; // 0x248(0x04)
	None CameraCache; // 0x290(0x5f0)
	None LastFrameCameraCache; // 0x880(0x5f0)
	None ViewTarget; // 0xe70(0x600)
	None PendingViewTarget; // 0x1470(0x600)
	None CameraCachePrivate; // 0x1aa0(0x5f0)
	None LastFrameCameraCachePrivate; // 0x2090(0x5f0)
	None ModifierList; // 0x2680(0x10)
	None DefaultModifiers; // 0x2690(0x10)
	None FreeCamDistance; // 0x26a0(0x04)
	None FreeCamOffset; // 0x26a4(0x0c)
	None ViewTargetOffset; // 0x26b0(0x0c)
	None CameraLensEffects; // 0x26d0(0x10)
	None CachedCameraShakeMod; // 0x26e0(0x08)
	None AnimInstPool; // 0x26e8(0x40)
	None PostProcessBlendCache; // 0x2728(0x10)
	None ActiveAnims; // 0x2748(0x10)
	None FreeAnims; // 0x2758(0x10)
	None AnimCameraActor; // 0x2768(0x08)
	None bIsOrthographic; // 0x2770(0x01)
	None bDefaultConstrainAspectRatio; // 0x2770(0x01)
	None bClientSimulatingViewTarget; // 0x2770(0x01)
	None bUseClientSideCameraUpdates; // 0x2770(0x01)
	None bGameCameraCutThisFrame; // 0x2771(0x01)
	None bForceLocalSpaceForInterpolatedRendering; // 0x2771(0x01)
	None ViewPitchMin; // 0x2774(0x04)
	None ViewPitchMax; // 0x2778(0x04)
	None ViewYawMin; // 0x277c(0x04)
	None ViewYawMax; // 0x2780(0x04)
	None ViewRollMin; // 0x2784(0x04)
	None ViewRollMax; // 0x2788(0x04)
	None ServerUpdateCameraTimeout; // 0x2790(0x04)
	None PlayerStartTag; // 0x248(0x08)
	None InitialSpeed; // 0xf0(0x04)
	None MaxSpeed; // 0xf4(0x04)
	None bRotationFollowsVelocity; // 0xf8(0x01)
	None bRotationRemainsVertical; // 0xf8(0x01)
	None bShouldBounce; // 0xf8(0x01)
	None bInitialVelocityInLocalSpace; // 0xf8(0x01)
	None bForceSubStepping; // 0xf8(0x01)
	None bSimulationEnabled; // 0xf8(0x01)
	None bSweepCollision; // 0xf8(0x01)
	None bIsHomingProjectile; // 0xf8(0x01)
	None bBounceAngleAffectsFriction; // 0xf9(0x01)
	None bIsSliding; // 0xf9(0x01)
	None bInterpMovement; // 0xf9(0x01)
	None bInterpRotation; // 0xf9(0x01)
	None PreviousHitTime; // 0xfc(0x04)
	None PreviousHitNormal; // 0x100(0x0c)
	None ProjectileGravityScale; // 0x10c(0x04)
	None Buoyancy; // 0x110(0x04)
	None Bounciness; // 0x114(0x04)
	None Friction; // 0x118(0x04)
	None BounceVelocityStopSimulatingThreshold; // 0x11c(0x04)
	None MinFrictionFraction; // 0x120(0x04)
	None OnProjectileBounce; // 0x128(0x10)
	None OnProjectileStop; // 0x138(0x10)
	None HomingAccelerationMagnitude; // 0x148(0x04)
	None HomingTargetComponent; // 0x14c(0x08)
	None MaxSimulationTimeStep; // 0x154(0x04)
	None MaxSimulationIterations; // 0x158(0x04)
	None BounceAdditionalIterations; // 0x15c(0x04)
	None InterpLocationTime; // 0x160(0x04)
	None InterpRotationTime; // 0x164(0x04)
	None InterpLocationMaxLagDistance; // 0x168(0x04)
	None InterpLocationSnapToTargetDistance; // 0x16c(0x04)
	None BaseTurnRate; // 0x280(0x04)
	None BaseLookUpRate; // 0x284(0x04)
	None MovementComponent; // 0x288(0x08)
	None CollisionComponent; // 0x290(0x08)
	None MeshComponent; // 0x298(0x08)
	None bAddDefaultMovementBindings; // 0x2a0(0x01)
	None Text; // 0x430(0x18)
	None TextMaterial; // 0x448(0x08)
	None Font; // 0x450(0x08)
	None HorizontalAlignment; // 0x458(0x01)
	None VerticalAlignment; // 0x459(0x01)
	None TextRenderColor; // 0x45c(0x04)
	None XScale; // 0x460(0x04)
	None YScale; // 0x464(0x04)
	None WorldSize; // 0x468(0x04)
	None InvDefaultSize; // 0x46c(0x04)
	None HorizSpacingAdjust; // 0x470(0x04)
	None VertSpacingAdjust; // 0x474(0x04)
	None bAlwaysRenderAsText; // 0x478(0x01)
	None TargetArmLength; // 0x208(0x04)
	None SocketOffset; // 0x20c(0x0c)
	None TargetOffset; // 0x218(0x0c)
	None ProbeSize; // 0x224(0x04)
	None ProbeChannel; // 0x228(0x01)
	None bDoCollisionTest; // 0x22c(0x01)
	None bUsePawnControlRotation; // 0x22c(0x01)
	None bInheritPitch; // 0x22c(0x01)
	None bInheritYaw; // 0x22c(0x01)
	None bInheritRoll; // 0x22c(0x01)
	None bEnableCameraLag; // 0x22c(0x01)
	None bEnableCameraRotationLag; // 0x22c(0x01)
	None bUseCameraLagSubstepping; // 0x22c(0x01)
	None bDrawDebugLagMarkers; // 0x22d(0x01)
	None CameraLagSpeed; // 0x230(0x04)
	None CameraRotationLagSpeed; // 0x234(0x04)
	None CameraLagMaxTimeStep; // 0x238(0x04)
	None CameraLagMaxDistance; // 0x23c(0x04)
	None Template; // 0x430(0x08)
	None EmitterMaterials; // 0x438(0x10)
	None SkelMeshComponents; // 0x448(0x10)
	None bRenderAfterDLSS; // 0x459(0x01)
	None bResetOnDetach; // 0x459(0x01)
	None bUpdateOnDedicatedServer; // 0x459(0x01)
	None bAllowRecycling; // 0x459(0x01)
	None bAutoManageAttachment; // 0x459(0x01)
	None bAutoAttachWeldSimulatedBodies; // 0x459(0x01)
	None bWarmingUp; // 0x45a(0x01)
	None bOverrideLODMethod; // 0x45a(0x01)
	None bSkipUpdateDynamicDataDuringTick; // 0x45a(0x01)
	None LODMethod; // 0x465(0x01)
	None RequiredSignificance; // 0x466(0x01)
	None InstanceParameters; // 0x468(0x10)
	None OnParticleSpawn; // 0x478(0x10)
	None OnParticleBurst; // 0x488(0x10)
	None OnParticleDeath; // 0x498(0x10)
	None OnParticleCollide; // 0x4a8(0x10)
	None OnParticleCollidePacked; // 0x4b8(0x10)
	None m_ParticleChannels; // 0x4c8(0x04)
	None bOldPositionValid; // 0x4cc(0x01)
	None OldPosition; // 0x4d0(0x0c)
	None PartSysVelocity; // 0x4dc(0x0c)
	None WarmupTime; // 0x4e8(0x04)
	None WarmupTickRate; // 0x4ec(0x04)
	None SecondsBeforeInactive; // 0x4f4(0x04)
	None MaxTimeBeforeForceUpdateTransform; // 0x4fc(0x04)
	None ReplayClips; // 0x520(0x10)
	None CustomTimeDilation; // 0x538(0x04)
	None AutoAttachParent; // 0x590(0x08)
	None AutoAttachSocketName; // 0x598(0x08)
	None AutoAttachLocationRule; // 0x5a0(0x01)
	None AutoAttachRotationRule; // 0x5a1(0x01)
	None AutoAttachScaleRule; // 0x5a2(0x01)
	None OnSystemFinished; // 0x5d0(0x10)
	None LightComponent; // 0x220(0x08)
	None bEnabled; // 0x228(0x01)
	None LightingGuid; // 0x48(0x10)
	None LODBias; // 0x58(0x04)
	None CompressionSettings; // 0x5c(0x01)
	None Filter; // 0x5d(0x01)
	None MipLoadOptions; // 0x5e(0x01)
	None LODGroup; // 0x5f(0x01)
	None SRGB; // 0x60(0x01)
	None bNoTiling; // 0x60(0x01)
	None VirtualTextureStreaming; // 0x60(0x01)
	None CompressionYCoCg; // 0x60(0x01)
	None bAsyncResourceReleaseHasBeenStarted; // 0x60(0x01)
	None AssetUserData; // 0x68(0x10)
	None PerInstanceSMData; // 0x4e8(0x10)
	None NumCustomDataFloats; // 0x4f8(0x04)
	None PerInstanceSMCustomData; // 0x500(0x10)
	None InstancingRandomSeed; // 0x510(0x04)
	None InstanceStartCullDistance; // 0x514(0x04)
	None InstanceEndCullDistance; // 0x518(0x04)
	None InstanceReorderTable; // 0x520(0x10)
	None NumPendingLightmaps; // 0x578(0x04)
	None CachedMappings; // 0x580(0x10)
	None SortedInstances; // 0x5a0(0x10)
	None NumBuiltInstances; // 0x5b0(0x04)
	None BuiltInstanceBounds; // 0x5b8(0x1c)
	None UnbuiltInstanceBounds; // 0x5d4(0x1c)
	None UnbuiltInstanceBoundsList; // 0x5f0(0x10)
	None bEnableDensityScaling; // 0x600(0x01)
	None OcclusionLayerNumNodes; // 0x608(0x04)
	None CacheMeshExtendedBounds; // 0x60c(0x1c)
	None bDisableCollision; // 0x628(0x01)
	None InstanceCountToRender; // 0x62c(0x04)
	None StaticMeshComponent; // 0x220(0x08)
	None bStaticMeshReplicateMovement; // 0x228(0x01)
	None NavigationGeometryGatheringMode; // 0x229(0x01)
	None SubsurfaceProfile; // 0x38(0x08)
	None LightmassSettings; // 0x50(0x10)
	None TextureStreamingData; // 0x60(0x10)
	None AssetUserData; // 0x70(0x10)
	None PhysMaterial; // 0x88(0x08)
	None PhysicalMaterialMap; // 0x90(0x40)
	None Parent; // 0xd0(0x08)
	None bHasStaticPermutationResource; // 0xd8(0x01)
	None bOverrideSubsurfaceProfile; // 0xd8(0x01)
	None ScalarParameterValues; // 0xe0(0x10)
	None VectorParameterValues; // 0xf0(0x10)
	None TextureParameterValues; // 0x100(0x10)
	None RuntimeVirtualTextureParameterValues; // 0x110(0x10)
	None FontParameterValues; // 0x120(0x10)
	None BasePropertyOverrides; // 0x130(0x08)
	None StaticParameters; // 0x148(0x40)
	None CachedLayerParameters; // 0x188(0x1a0)
	None CachedReferencedTextures; // 0x328(0x10)
	None PhysMaterialMask; // 0x408(0x08)
	None Material; // 0x28(0x08)
	None Function; // 0x30(0x08)
	None bIsParameterExpression; // 0x38(0x01)
	None NumReplicatedProperties; // 0x230(0x04)
	None bHasNativizedParent; // 0x234(0x01)
	None bHasCookedComponentInstancingData; // 0x234(0x01)
	None DynamicBindingObjects; // 0x238(0x10)
	None ComponentTemplates; // 0x248(0x10)
	None Timelines; // 0x258(0x10)
	None ComponentClassOverrides; // 0x268(0x10)
	None SimpleConstructionScript; // 0x278(0x08)
	None InheritableComponentHandler; // 0x280(0x08)
	None UberGraphFramePointerProperty; // 0x288(0x08)
	None UberGraphFunction; // 0x298(0x08)
	None CookedComponentInstancingData; // 0x2a0(0x50)
	None FieldOfView; // 0x208(0x04)
	None OrthoWidth; // 0x20c(0x04)
	None OrthoNearClipPlane; // 0x210(0x04)
	None OrthoFarClipPlane; // 0x214(0x04)
	None AspectRatio; // 0x218(0x04)
	None MaxAspectRatio; // 0x21c(0x04)
	None bConstrainAspectRatio; // 0x220(0x01)
	None bUseFieldOfViewForLOD; // 0x220(0x01)
	None bLockToHmd; // 0x220(0x01)
	None bUsePawnControlRotation; // 0x220(0x01)
	None ProjectionMode; // 0x221(0x01)
	None PostProcessBlendWeight; // 0x260(0x04)
	None PostProcessSettings; // 0x290(0x550)
	None SoundClassObject; // 0x28(0x08)
	None bDebug; // 0x30(0x01)
	None bOverrideConcurrency; // 0x30(0x01)
	None bOutputToBusOnly; // 0x30(0x01)
	None bHasDelayNode; // 0x30(0x01)
	None bHasConcatenatorNode; // 0x30(0x01)
	None bBypassVolumeScaleForPriority; // 0x30(0x01)
	None VirtualizationMode; // 0x31(0x01)
	None ConcurrencySet; // 0x88(0x50)
	None ConcurrencyOverrides; // 0xd8(0x20)
	None Duration; // 0xf8(0x04)
	None MaxDistance; // 0xfc(0x04)
	None TotalSamples; // 0x100(0x04)
	None Priority; // 0x104(0x04)
	None AttenuationSettings; // 0x108(0x08)
	None Modulation; // 0x110(0x10)
	None SoundSubmixObject; // 0x120(0x08)
	None SoundSubmixSends; // 0x128(0x10)
	None SourceEffectChain; // 0x138(0x08)
	None BusSends; // 0x140(0x10)
	None PreEffectBusSends; // 0x150(0x10)
	None CompressionQuality; // 0x160(0x04)
	None StreamingPriority; // 0x164(0x04)
	None SampleRateQuality; // 0x168(0x01)
	None SoundGroup; // 0x16a(0x01)
	None bLooping; // 0x16b(0x01)
	None bStreaming; // 0x16b(0x01)
	None bSeekableStreaming; // 0x16b(0x01)
	None LoadingBehavior; // 0x16c(0x01)
	None bMature; // 0x16d(0x01)
	None bManualWordWrap; // 0x16d(0x01)
	None bSingleLine; // 0x16d(0x01)
	None bIsAmbisonics; // 0x16e(0x01)
	None FrequenciesToAnalyze; // 0x170(0x10)
	None CookedSpectralTimeData; // 0x180(0x10)
	None CookedEnvelopeTimeData; // 0x190(0x10)
	None InitialChunkSize; // 0x1a0(0x04)
	None SpokenText; // 0x1e8(0x10)
	None SubtitlePriority; // 0x1f8(0x04)
	None Volume; // 0x1fc(0x04)
	None Pitch; // 0x200(0x04)
	None NumChannels; // 0x204(0x04)
	None SampleRate; // 0x208(0x04)
	None Subtitles; // 0x218(0x10)
	None Curves; // 0x228(0x08)
	None InternalCurves; // 0x230(0x08)
	None SkeletonGeneratedClass; // 0x28(0x08)
	None GeneratedClass; // 0x30(0x08)
	None bLegacyNeedToPurgeSkelRefs; // 0x38(0x01)
	None BlueprintGuid; // 0x3c(0x10)
	None ParentClass; // 0x50(0x08)
	None BlueprintType; // 0x58(0x01)
	None bRecompileOnLoad; // 0x59(0x01)
	None bHasBeenRegenerated; // 0x59(0x01)
	None bIsRegeneratingOnLoad; // 0x59(0x01)
	None BlueprintSystemVersion; // 0x5c(0x04)
	None SimpleConstructionScript; // 0x60(0x08)
	None ComponentTemplates; // 0x68(0x10)
	None Timelines; // 0x78(0x10)
	None ComponentClassOverrides; // 0x88(0x10)
	None InheritableComponentHandler; // 0x98(0x08)
	None Connection; // 0x28(0x08)
	None Actor; // 0x70(0x08)
	None CreateSubObjects; // 0x168(0x10)
	None Skeleton; // 0x38(0x08)
	None MetaData; // 0x60(0x10)
	None AssetUserData; // 0x70(0x10)
	None bRotationBlendInMeshSpace; // 0x88(0x01)
	None AnimLength; // 0x8c(0x04)
	None InterpolationParam; // 0x90(0x18)
	None TargetWeightInterpolationSpeedPerSec; // 0xa8(0x04)
	None NotifyTriggerMode; // 0xac(0x01)
	None PerBoneBlend; // 0xb0(0x10)
	None SampleIndexWithMarkers; // 0xc0(0x04)
	None SampleData; // 0xc8(0x10)
	None GridSamples; // 0xd8(0x10)
	None BlendParameters; // 0xe8(0x60)
	None AxisToScaleAnimation; // 0x148(0x01)
	None bScaleAnimation; // 0x148(0x01)
	None AISystemClassName; // 0x28(0x18)
	None AISystemModuleName; // 0x40(0x08)
	None bInstantiateAISystemOnClient; // 0x50(0x01)
	None AudioComponent; // 0x220(0x08)
	None CompressCommandletVersion; // 0x38(0x04)
	None KeyEndEffectorsMatchNameArray; // 0x40(0x10)
	None ForceRecompression; // 0x50(0x01)
	None bOnlyCheckForMissingSkeletalMeshes; // 0x51(0x01)
	None bForceBelowThreshold; // 0x52(0x01)
	None bFirstRecompressUsingCurrentOrDefault; // 0x53(0x01)
	None bRaiseMaxErrorToExisting; // 0x54(0x01)
	None bEnablePerformanceLog; // 0x55(0x01)
	None bStripAnimationDataOnDedicatedServer; // 0x56(0x01)
	None bTickAnimationOnSkeletalMeshInit; // 0x57(0x01)
	None TargetSkeleton; // 0xa8(0x08)
	None Groups; // 0xb0(0x10)
	None bUseMultiThreadedAnimationUpdate; // 0xc0(0x01)
	None bWarnAboutBlueprintUsage; // 0xc1(0x01)
	None BakedStateMachines; // 0x330(0x10)
	None TargetSkeleton; // 0x340(0x08)
	None AnimNotifies; // 0x348(0x10)
	None OrderedSavedPoseIndicesMap; // 0x358(0x50)
	None SyncGroupNames; // 0x428(0x10)
	None EvaluateGraphExposedInputs; // 0x438(0x10)
	None GraphAssetPlayerInformation; // 0x448(0x50)
	None GraphBlendOptions; // 0x498(0x50)
	None Codecs; // 0x28(0x10)
	None BakedStateMachines; // 0x30(0x10)
	None TargetSkeleton; // 0x40(0x08)
	None AnimNotifies; // 0x48(0x10)
	None OrderedSavedPoseIndicesMap; // 0x58(0x50)
	None AnimBlueprintFunctions; // 0xa8(0x10)
	None AnimBlueprintFunctionData; // 0xb8(0x10)
	None AnimNodeProperties; // 0xc8(0x10)
	None LinkedAnimGraphNodeProperties; // 0xe8(0x10)
	None LinkedAnimLayerNodeProperties; // 0x108(0x10)
	None PreUpdateNodeProperties; // 0x128(0x10)
	None DynamicResetNodeProperties; // 0x148(0x10)
	None StateMachineNodeProperties; // 0x168(0x10)
	None InitializationNodeProperties; // 0x188(0x10)
	None GraphNameAssetPlayers; // 0x1a8(0x50)
	None SyncGroupNames; // 0x1f8(0x10)
	None EvaluateGraphExposedInputs; // 0x208(0x10)
	None GraphBlendOptions; // 0x218(0x50)
	None Notifies; // 0x80(0x10)
	None SequenceLength; // 0x90(0x04)
	None RateScale; // 0x94(0x04)
	None RawCurveData; // 0x98(0x10)
	None AnimationTrack; // 0xa8(0x10)
	None bNeedsSkeleton; // 0x38(0x01)
	None TranslationCompressionFormat; // 0x3c(0x01)
	None RotationCompressionFormat; // 0x3d(0x01)
	None ScaleCompressionFormat; // 0x3e(0x01)
	None MaxPosDiff; // 0x40(0x04)
	None MaxAngleDiff; // 0x44(0x04)
	None MaxScaleDiff; // 0x48(0x04)
	None MaxEffectorDiff; // 0x4c(0x04)
	None MinEffectorDiff; // 0x50(0x04)
	None EffectorDiffSocket; // 0x54(0x04)
	None ParentKeyScale; // 0x58(0x04)
	None bRetarget; // 0x5c(0x01)
	None bActuallyFilterLinearKeys; // 0x5c(0x01)
	None MaxZeroingThreshold; // 0x60(0x04)
	None MaxPosDiffBitwise; // 0x64(0x04)
	None MaxAngleDiffBitwise; // 0x68(0x04)
	None MaxScaleDiffBitwise; // 0x6c(0x04)
	None AllowedRotationFormats; // 0x70(0x10)
	None AllowedTranslationFormats; // 0x80(0x10)
	None AllowedScaleFormats; // 0x90(0x10)
	None bResampleAnimation; // 0xa0(0x01)
	None ResampledFramerate; // 0xa4(0x04)
	None MinKeysForResampling; // 0xa8(0x04)
	None bUseAdaptiveError; // 0xac(0x01)
	None bUseOverrideForEndEffectors; // 0xac(0x01)
	None TrackHeightBias; // 0xb0(0x04)
	None ParentingDivisor; // 0xb4(0x04)
	None ParentingDivisorExponent; // 0xb8(0x04)
	None bUseAdaptiveError2; // 0xbc(0x01)
	None RotationErrorSourceRatio; // 0xc0(0x04)
	None TranslationErrorSourceRatio; // 0xc4(0x04)
	None ScaleErrorSourceRatio; // 0xc8(0x04)
	None MaxErrorPerTrackRatio; // 0xcc(0x04)
	None PerturbationProbeSize; // 0xd0(0x04)
	None MinKeys; // 0x40(0x04)
	None bStartAtSecondKey; // 0x44(0x01)
	None MaxPosDiff; // 0x40(0x04)
	None MaxAngleDiff; // 0x44(0x04)
	None MaxScaleDiff; // 0x48(0x04)
	None Codec; // 0x28(0x08)
	None BlendIn; // 0xa8(0x30)
	None BlendInTime; // 0xd8(0x04)
	None BlendOut; // 0xe0(0x30)
	None BlendOutTime; // 0x110(0x04)
	None BlendOutTriggerTime; // 0x114(0x04)
	None SyncGroup; // 0x118(0x08)
	None SyncSlotIndex; // 0x120(0x04)
	None MarkerData; // 0x128(0x20)
	None CompositeSections; // 0x148(0x10)
	None SlotAnimTracks; // 0x158(0x10)
	None BranchingPoints; // 0x168(0x10)
	None bEnableRootMotionTranslation; // 0x178(0x01)
	None bEnableRootMotionRotation; // 0x179(0x01)
	None bEnableAutoBlendOut; // 0x17a(0x01)
	None RootMotionRootLock; // 0x17b(0x01)
	None BranchingPointMarkers; // 0x180(0x10)
	None BranchingPointStateNotifyIndices; // 0x190(0x10)
	None TimeStretchCurve; // 0x1a0(0x28)
	None TimeStretchCurveName; // 0x1c8(0x08)
	None Sound; // 0x38(0x08)
	None VolumeMultiplier; // 0x40(0x04)
	None PitchMultiplier; // 0x44(0x04)
	None bFollow; // 0x48(0x01)
	None AttachName; // 0x4c(0x08)
	None PSTemplate; // 0x30(0x08)
	None SocketName; // 0x38(0x08)
	None LocationOffset; // 0x40(0x0c)
	None RotationOffset; // 0x4c(0x0c)
	None bDestroyAtEnd; // 0x58(0x01)
	None NumFrames; // 0xa8(0x04)
	None TrackToSkeletonMapTable; // 0xb0(0x10)
	None BoneCompressionSettings; // 0xd0(0x08)
	None CurveCompressionSettings; // 0xd8(0x08)
	None AdditiveAnimType; // 0x150(0x01)
	None RefPoseType; // 0x151(0x01)
	None RefPoseSeq; // 0x158(0x08)
	None RefFrameIndex; // 0x160(0x04)
	None RetargetSource; // 0x164(0x08)
	None Interpolation; // 0x16c(0x01)
	None bEnableRootMotion; // 0x16d(0x01)
	None RootMotionRootLock; // 0x16e(0x01)
	None bForceRootLock; // 0x16f(0x01)
	None bUseNormalizedRootMotionScale; // 0x170(0x01)
	None bRootMotionSettingsCopiedFromMontage; // 0x171(0x01)
	None AuthoredSyncMarkers; // 0x178(0x10)
	None bAnimRotationOnly; // 0x28(0x01)
	None TrackBoneNames; // 0x30(0x10)
	None LinkupCache; // 0x40(0x10)
	None BoneUseAnimTranslation; // 0x50(0x10)
	None ForceUseMeshTranslation; // 0x60(0x10)
	None UseTranslationBoneNames; // 0x70(0x10)
	None ForceMeshTranslationBoneNames; // 0x80(0x10)
	None PreviewSkelMeshName; // 0x90(0x08)
	None BestRatioSkelMeshName; // 0x98(0x08)
	None CurrentAsset; // 0x268(0x08)
	None PostEvaluateAnimEvent; // 0x270(0x10)
	None NumFrames; // 0xa8(0x04)
	None Interpolation; // 0xac(0x01)
	None RetargetSource; // 0xb0(0x08)
	None BoneCompressionSettings; // 0xc8(0x08)
	None CurveCompressionSettings; // 0xd0(0x08)
	None bEnableRootMotion; // 0xd8(0x01)
	None RootMotionRootLock; // 0xd9(0x01)
	None bForceRootLock; // 0xda(0x01)
	None bUseNormalizedRootMotionScale; // 0xdb(0x01)
	None ApplicationWillDeactivateDelegate; // 0xb0(0x10)
	None ApplicationHasReactivatedDelegate; // 0xc0(0x10)
	None ApplicationWillEnterBackgroundDelegate; // 0xd0(0x10)
	None ApplicationHasEnteredForegroundDelegate; // 0xe0(0x10)
	None ApplicationWillTerminateDelegate; // 0xf0(0x10)
	None ApplicationShouldUnloadResourcesDelegate; // 0x100(0x10)
	None ApplicationReceivedStartupArgumentsDelegate; // 0x110(0x10)
	None OnTemperatureChangeDelegate; // 0x120(0x10)
	None OnLowPowerModeDelegate; // 0x130(0x10)
	None ArrowColor; // 0x430(0x04)
	None ArrowSize; // 0x434(0x04)
	None ScreenSize; // 0x438(0x04)
	None bIsScreenSizeScaled; // 0x43c(0x01)
	None bTreatAsASprite; // 0x43c(0x01)
	None Object; // 0x28(0x08)
	None Exporter; // 0x30(0x08)
	None Filename; // 0x38(0x10)
	None bSelected; // 0x48(0x01)
	None bReplaceIdentical; // 0x49(0x01)
	None bPrompt; // 0x4a(0x01)
	None bAutomated; // 0x4b(0x01)
	None bUseFileArchive; // 0x4c(0x01)
	None bWriteEmptyFiles; // 0x4d(0x01)
	None IgnoreObjectList; // 0x50(0x10)
	None Options; // 0x60(0x08)
	None Errors; // 0x68(0x10)
	None PrimaryAssetTypesToScan; // 0x38(0x10)
	None DirectoriesToExclude; // 0x48(0x10)
	None PrimaryAssetRules; // 0x58(0x10)
	None CustomPrimaryAssetRules; // 0x68(0x10)
	None bOnlyCookProductionAssets; // 0x78(0x01)
	None bShouldManagerDetermineTypeAndName; // 0x79(0x01)
	None bShouldGuessTypeAndNameInEditor; // 0x7a(0x01)
	None bShouldAcquireMissingChunksOnLoad; // 0x7b(0x01)
	None PrimaryAssetIdRedirects; // 0x80(0x10)
	None PrimaryAssetTypeRedirects; // 0x90(0x10)
	None AssetPathRedirects; // 0xa0(0x10)
	None MetaDataTagsForAssetRegistry; // 0xb0(0x50)
	None PrimaryAssetTypeWrangleWhitelist; // 0x100(0x10)
	None bForceUseAllBundlesDuringLoadRecursive; // 0x110(0x01)
	None MappedAssets; // 0x28(0x10)
	None Completed; // 0x30(0x10)
	None SaveGameObject; // 0x60(0x08)
	None Completed; // 0x78(0x10)
	None Completed; // 0x78(0x10)
	None Completed; // 0x78(0x10)
	None Completed; // 0x78(0x10)
	None Completed; // 0x78(0x10)
	None AtmosphericFogComponent; // 0x220(0x08)
	None SunMultiplier; // 0x208(0x04)
	None FogMultiplier; // 0x20c(0x04)
	None DensityMultiplier; // 0x210(0x04)
	None DensityOffset; // 0x214(0x04)
	None DistanceScale; // 0x218(0x04)
	None AltitudeScale; // 0x21c(0x04)
	None DistanceOffset; // 0x220(0x04)
	None GroundOffset; // 0x224(0x04)
	None StartDistance; // 0x228(0x04)
	None SunDiscScale; // 0x22c(0x04)
	None DefaultBrightness; // 0x230(0x04)
	None DefaultLightColor; // 0x234(0x04)
	None bDisableSunDisk; // 0x238(0x01)
	None bAtmosphereAffectsSunIlluminance; // 0x238(0x01)
	None bDisableGroundScattering; // 0x238(0x01)
	None PrecomputeParams; // 0x23c(0x2c)
	None TransmittanceTexture; // 0x268(0x08)
	None IrradianceTexture; // 0x270(0x08)
	None DefaultSoundClassName; // 0x38(0x18)
	None DefaultMediaSoundClassName; // 0x50(0x18)
	None DefaultSoundConcurrencyName; // 0x68(0x18)
	None DefaultBaseSoundMix; // 0x80(0x18)
	None VoiPSoundClass; // 0x98(0x18)
	None MasterSubmix; // 0xb0(0x18)
	None ReverbSubmix; // 0xc8(0x18)
	None EQSubmix; // 0xe0(0x18)
	None VoiPSampleRate; // 0xf8(0x04)
	None DefaultReverbSendLevel; // 0xfc(0x04)
	None MaximumConcurrentStreams; // 0x100(0x04)
	None GlobalMinPitchScale; // 0x104(0x04)
	None GlobalMaxPitchScale; // 0x108(0x04)
	None QualityLevels; // 0x110(0x10)
	None bAllowPlayWhenSilent; // 0x120(0x01)
	None bDisableMasterEQ; // 0x120(0x01)
	None bAllowCenterChannel3DPanning; // 0x120(0x01)
	None NumStoppingSources; // 0x124(0x04)
	None PanningMethod; // 0x128(0x01)
	None MonoChannelUpmixMethod; // 0x129(0x01)
	None DialogueFilenameFormat; // 0x130(0x10)
	None Priority; // 0x258(0x04)
	None bEnabled; // 0x25c(0x01)
	None Settings; // 0x260(0x20)
	None AmbientZoneSettings; // 0x280(0x24)
	None ActorsToPoll; // 0x38(0x10)
	None EngineTestModules; // 0x28(0x10)
	None EditorTestModules; // 0x38(0x10)
	None AutomationTestmap; // 0x48(0x18)
	None EditorPerformanceTestMaps; // 0x60(0x10)
	None AssetsToOpen; // 0x70(0x10)
	None BuildPromotionTest; // 0x80(0x1f0)
	None MaterialEditorPromotionTest; // 0x270(0x30)
	None ParticleEditorPromotionTest; // 0x2a0(0x10)
	None BlueprintEditorPromotionTest; // 0x2b0(0x30)
	None TestLevelFolders; // 0x2e0(0x10)
	None ExternalTools; // 0x2f0(0x10)
	None ImportExportTestDefinitions; // 0x300(0x10)
	None LaunchOnSettings; // 0x310(0x10)
	None DefaultScreenshotResolution; // 0x320(0x08)
	None DefaultTimeToLive; // 0x30(0x04)
	None LockTimeAfterAvoid; // 0x34(0x04)
	None LockTimeAfterClean; // 0x38(0x04)
	None DeltaTimeToPredict; // 0x3c(0x04)
	None ArtificialRadiusExpansion; // 0x40(0x04)
	None TestHeightDifference; // 0x44(0x04)
	None HeightCheckMargin; // 0x48(0x04)
	None BandwidthGenerator; // 0x220(0x20)
	None Sprite; // 0x430(0x08)
	None bIsScreenSizeScaled; // 0x438(0x01)
	None ScreenSize; // 0x43c(0x04)
	None U; // 0x440(0x04)
	None UL; // 0x444(0x04)
	None V; // 0x448(0x04)
	None VL; // 0x44c(0x04)
	None BoneTree; // 0x38(0x10)
	None RefLocalPoses; // 0x48(0x10)
	None VirtualBoneGuid; // 0x170(0x10)
	None VirtualBones; // 0x180(0x10)
	None Sockets; // 0x190(0x10)
	None SmartNames; // 0x1f0(0x50)
	None BlendProfiles; // 0x270(0x10)
	None SlotGroups; // 0x280(0x10)
	None AssetUserData; // 0x358(0x10)
	None OwningSkeleton; // 0x30(0x08)
	None ProfileEntries; // 0x38(0x10)
	None ApplicationWillDeactivateDelegate; // 0x198(0x10)
	None ApplicationHasReactivatedDelegate; // 0x1a8(0x10)
	None ApplicationWillEnterBackgroundDelegate; // 0x1b8(0x10)
	None ApplicationHasEnteredForegroundDelegate; // 0x1c8(0x10)
	None ApplicationWillTerminateDelegate; // 0x1d8(0x10)
	None ApplicationShouldUnloadResourcesDelegate; // 0x1e8(0x10)
	None ApplicationReceivedStartupArgumentsDelegate; // 0x1f8(0x10)
	None ApplicationRegisteredForRemoteNotificationsDelegate; // 0x208(0x10)
	None ApplicationRegisteredForUserNotificationsDelegate; // 0x218(0x10)
	None ApplicationFailedToRegisterForRemoteNotificationsDelegate; // 0x228(0x10)
	None ApplicationReceivedRemoteNotificationDelegate; // 0x238(0x10)
	None ApplicationReceivedLocalNotificationDelegate; // 0x248(0x10)
	None ApplicationReceivedScreenOrientationChangedNotificationDelegate; // 0x258(0x10)
	None AggGeom; // 0x28(0x58)
	None BoneName; // 0x80(0x08)
	None PhysicsType; // 0x88(0x01)
	None bAlwaysFullAnimWeight; // 0x89(0x01)
	None bConsiderForBounds; // 0x89(0x01)
	None bMeshCollideAll; // 0x89(0x01)
	None bDoubleSidedGeometry; // 0x89(0x01)
	None bGenerateNonMirroredCollision; // 0x89(0x01)
	None bSharedCookedData; // 0x89(0x01)
	None bGenerateMirroredCollision; // 0x89(0x01)
	None bSupportUVsAndFaceRemap; // 0x89(0x01)
	None CollisionReponse; // 0x8b(0x01)
	None CollisionTraceFlag; // 0x8c(0x01)
	None PhysMaterial; // 0x90(0x08)
	None WalkableSlopeOverride; // 0x98(0x10)
	None DefaultInstance; // 0x120(0x110)
	None BuildScale3D; // 0x238(0x0c)
	None BlendPoses; // 0x28(0x10)
	None Location; // 0x28(0x0c)
	None Rotation; // 0x34(0x0c)
	None HiddenLevels; // 0x40(0x10)
	None Zoom2D; // 0x28(0x04)
	None Location; // 0x2c(0x08)
	None BoxExtent; // 0x448(0x0c)
	None LineThickness; // 0x454(0x04)
	None CaptureComponent; // 0x220(0x08)
	None CaptureOffsetComponent; // 0x208(0x08)
	None ReflectionSourceType; // 0x210(0x01)
	None Cubemap; // 0x218(0x08)
	None SourceCubemapAngle; // 0x220(0x04)
	None Brightness; // 0x224(0x04)
	None CaptureOffset; // 0x228(0x0c)
	None MapBuildDataId; // 0x234(0x10)
	None BoxTransitionDistance; // 0x280(0x04)
	None PreviewInfluenceBox; // 0x288(0x08)
	None PreviewCaptureBox; // 0x290(0x08)
	None bEnabled; // 0x28(0x01)
	None Node; // 0x30(0x08)
	None bStepOnce; // 0x38(0x01)
	None bStepOnce_WasPreviouslyDisabled; // 0x38(0x01)
	None bStepOnce_RemoveAfterHit; // 0x38(0x01)
	None BitmapFilename; // 0x28(0x10)
	None Tooltip; // 0x38(0x10)
	None NotifyBadParams; // 0x48(0x01)
	None Vertices; // 0x50(0x10)
	None Polys; // 0x60(0x10)
	None Layer; // 0x70(0x08)
	None MergeCoplanars; // 0x78(0x01)
	None Brush; // 0x430(0x08)
	None BrushBodySetup; // 0x438(0x08)
	None ButtonStyle; // 0x28(0x278)
	None CameraInterpGroup; // 0x28(0x08)
	None AnimLength; // 0x30(0x04)
	None BoundingBox; // 0x34(0x1c)
	None bRelativeToInitialTransform; // 0x50(0x01)
	None bRelativeToInitialFOV; // 0x50(0x01)
	None BaseFOV; // 0x54(0x04)
	None BasePostProcessSettings; // 0x60(0x550)
	None BasePostProcessBlendWeight; // 0x5b0(0x04)
	None CamAnim; // 0x28(0x08)
	None InterpGroupInst; // 0x30(0x08)
	None PlayRate; // 0x50(0x04)
	None MoveTrack; // 0x68(0x08)
	None MoveInst; // 0x70(0x08)
	None PlaySpace; // 0x78(0x01)
	None ActiveShakes; // 0x48(0x10)
	None ExpiredPooledShakesMap; // 0x58(0x50)
	None SplitScreenShakeScale; // 0xa8(0x04)
	None CameraShakeSourceComponent; // 0x220(0x08)
	None Attenuation; // 0x208(0x01)
	None InnerAttenuationRadius; // 0x20c(0x04)
	None OuterAttenuationRadius; // 0x210(0x04)
	None CameraShake; // 0x218(0x08)
	None bAutoPlay; // 0x220(0x01)
	None OrgX; // 0x28(0x04)
	None OrgY; // 0x2c(0x04)
	None ClipX; // 0x30(0x04)
	None ClipY; // 0x34(0x04)
	None DrawColor; // 0x38(0x04)
	None bCenterX; // 0x3c(0x01)
	None bCenterY; // 0x3c(0x01)
	None bNoSmooth; // 0x3c(0x01)
	None SizeX; // 0x40(0x04)
	None SizeY; // 0x44(0x04)
	None ColorModulate; // 0x50(0x10)
	None DefaultTexture; // 0x60(0x08)
	None GradientTexture0; // 0x68(0x08)
	None ReporterGraph; // 0x70(0x08)
	None TargetGamma; // 0xb8(0x04)
	None SizeX; // 0xc0(0x04)
	None SizeY; // 0xc4(0x04)
	None ClearColor; // 0xc8(0x10)
	None AddressX; // 0xd8(0x01)
	None AddressY; // 0xd9(0x01)
	None bForceLinearGamma; // 0xda(0x01)
	None bHDR; // 0xda(0x01)
	None bGPUSharedFlag; // 0xda(0x01)
	None RenderTargetFormat; // 0xdb(0x01)
	None bAutoGenerateMips; // 0xdc(0x01)
	None MipsSamplerFilter; // 0xdd(0x01)
	None MipsAddressU; // 0xde(0x01)
	None MipsAddressV; // 0xdf(0x01)
	None OverrideFormat; // 0xe0(0x01)
	None OnCanvasRenderTargetUpdate; // 0xe8(0x10)
	None World; // 0xf8(0x08)
	None bShouldClearRenderTargetOnReceiveUpdate; // 0x100(0x01)
	None Friction; // 0x28(0x04)
	None StaticFriction; // 0x2c(0x04)
	None Restitution; // 0x30(0x04)
	None LinearEtherDrag; // 0x34(0x04)
	None AngularEtherDrag; // 0x38(0x04)
	None SleepingLinearVelocityThreshold; // 0x3c(0x04)
	None SleepingAngularVelocityThreshold; // 0x40(0x04)
	None DebugCameraControllerRef; // 0x28(0x08)
	None DebugCameraControllerClass; // 0x30(0x08)
	None CheckBoxStyle; // 0x28(0x580)
	None ChildActorClass; // 0x208(0x08)
	None ChildActor; // 0x210(0x08)
	None ChildActorTemplate; // 0x218(0x08)
	None Parent; // 0x1a80(0x08)
	None AllDelegates; // 0x28(0x10)
	None LocalCloudFiles; // 0x38(0x10)
	None bSuppressDelegateCalls; // 0x48(0x01)
	None Profiles; // 0x38(0x10)
	None DefaultChannelResponses; // 0x48(0x10)
	None EditProfiles; // 0x58(0x10)
	None ProfileRedirects; // 0x68(0x10)
	None CollisionChannelRedirects; // 0x78(0x10)
	None ComponentDelegateBindings; // 0x28(0x10)
	None ParentTables; // 0xa0(0x10)
	None OldParentTables; // 0xb0(0x10)
	None ParentTables; // 0xc8(0x10)
	None OldParentTables; // 0xd8(0x10)
	None AsyncLoadingThreadEnabled; // 0x38(0x01)
	None WarnIfTimeLimitExceeded; // 0x38(0x01)
	None TimeLimitExceededMultiplier; // 0x3c(0x04)
	None TimeLimitExceededMinTime; // 0x40(0x04)
	None MinBulkDataSizeForAsyncLoading; // 0x44(0x04)
	None UseBackgroundLevelStreaming; // 0x48(0x01)
	None AsyncLoadingUseFullTimeLimit; // 0x48(0x01)
	None AsyncLoadingTimeLimit; // 0x4c(0x04)
	None PriorityAsyncLoadingExtraTime; // 0x50(0x04)
	None LevelStreamingActorsUpdateTimeLimit; // 0x54(0x04)
	None PriorityLevelStreamingActorsUpdateExtraTime; // 0x58(0x04)
	None LevelStreamingComponentsRegistrationGranularity; // 0x5c(0x04)
	None LevelStreamingUnregisterComponentsTimeLimit; // 0x60(0x04)
	None LevelStreamingComponentsUnregistrationGranularity; // 0x64(0x04)
	None FlushStreamingOnExit; // 0x68(0x01)
	None EventDrivenLoaderEnabled; // 0x68(0x01)
	None TimeBetweenPurgingPendingKillObjects; // 0x38(0x04)
	None FlushStreamingOnGC; // 0x3c(0x01)
	None AllowParallelGC; // 0x3c(0x01)
	None IncrementalBeginDestroyEnabled; // 0x3c(0x01)
	None MultithreadedDestructionEnabled; // 0x3c(0x01)
	None CreateGCClusters; // 0x3c(0x01)
	None AssetClusteringEnabled; // 0x3c(0x01)
	None ActorClusteringEnabled; // 0x3c(0x01)
	None BlueprintClusteringEnabled; // 0x3c(0x01)
	None UseDisregardForGCOnDedicatedServers; // 0x3d(0x01)
	None MinGCClusterSize; // 0x40(0x04)
	None NumRetriesBeforeForcingGC; // 0x44(0x04)
	None MaxObjectsNotConsideredByGC; // 0x48(0x04)
	None SizeOfPermanentObjectPool; // 0x4c(0x04)
	None MaxObjectsInGame; // 0x50(0x04)
	None MaxObjectsInEditor; // 0x54(0x04)
	None CullDistances; // 0x258(0x10)
	None bEnabled; // 0x268(0x01)
	None FloatCurve; // 0x30(0x80)
	None bIsEventCurve; // 0xb0(0x01)
	None FloatCurves; // 0x30(0x200)
	None AdjustHue; // 0x230(0x04)
	None AdjustSaturation; // 0x234(0x04)
	None AdjustBrightness; // 0x238(0x04)
	None AdjustBrightnessCurve; // 0x23c(0x04)
	None AdjustVibrance; // 0x240(0x04)
	None AdjustMinAlpha; // 0x244(0x04)
	None AdjustMaxAlpha; // 0x248(0x04)
	None LevelIndex; // 0xb8(0x04)
	None FirstResourceMemMip; // 0xbc(0x04)
	None bTemporarilyDisableStreaming; // 0xc0(0x01)
	None AddressX; // 0xc1(0x01)
	None AddressY; // 0xc2(0x01)
	None ImportedSize; // 0xc4(0x08)
	None TextureSize; // 0xe8(0x04)
	None GradientCurves; // 0xf0(0x10)
	None FloatCurves; // 0x30(0x180)
	None bShowSelectedInfo; // 0x588(0x01)
	None bIsFrozenRendering; // 0x588(0x01)
	None bIsOrbitingSelectedActor; // 0x588(0x01)
	None bOrbitPivotUseCenter; // 0x588(0x01)
	None bEnableBufferVisualization; // 0x588(0x01)
	None bEnableBufferVisualizationFullMode; // 0x588(0x01)
	None bIsBufferVisualizationInputSetup; // 0x588(0x01)
	None bLastDisplayEnabled; // 0x588(0x01)
	None DrawFrustum; // 0x590(0x08)
	None SelectedActor; // 0x598(0x08)
	None SelectedComponent; // 0x5a0(0x08)
	None SelectedHitPoint; // 0x5a8(0x88)
	None OriginalControllerRef; // 0x630(0x08)
	None OriginalPlayer; // 0x638(0x08)
	None SpeedScale; // 0x640(0x04)
	None InitialMaxSpeed; // 0x644(0x04)
	None InitialAccel; // 0x648(0x04)
	None InitialDecel; // 0x64c(0x04)
	None CycleViewModes; // 0x38(0x10)
	None Decal; // 0x220(0x08)
	None RollbackNetStartupActors; // 0x870(0x50)
	None CheckpointSaveMaxMSPerFrame; // 0xc84(0x04)
	None MulticastRecordOptions; // 0xcb8(0x10)
	None bIsLocalReplay; // 0xd18(0x01)
	None SpectatorControllers; // 0xd20(0x10)
	None NetDriver; // 0x30(0x08)
	None DemoNetDriver; // 0x38(0x08)
	None TextureLODGroups; // 0x28(0x10)
	None DeviceType; // 0x38(0x10)
	None BaseProfileName; // 0x48(0x10)
	None Parent; // 0x58(0x08)
	None CVars; // 0x78(0x10)
	None Profiles; // 0x28(0x10)
	None Gender; // 0x28(0x01)
	None Plurality; // 0x29(0x01)
	None LocalizationGUID; // 0x2c(0x10)
	None bMature; // 0x28(0x01)
	None bOverride_SubtitleOverride; // 0x28(0x01)
	None SpokenText; // 0x30(0x10)
	None SubtitleOverride; // 0x40(0x10)
	None ContextMappings; // 0x50(0x10)
	None LocalizationGUID; // 0x60(0x10)
	None LightComponent; // 0x220(0x08)
	None bEnabled; // 0x228(0x01)
	None LightGuid; // 0x208(0x10)
	None Brightness; // 0x218(0x04)
	None Intensity; // 0x21c(0x04)
	None LightColor; // 0x220(0x04)
	None bAffectsWorld; // 0x224(0x01)
	None CastShadows; // 0x224(0x01)
	None CastStaticShadows; // 0x224(0x01)
	None CastDynamicShadows; // 0x224(0x01)
	None bAffectTranslucentLighting; // 0x224(0x01)
	None bTransmission; // 0x224(0x01)
	None bCastVolumetricShadow; // 0x224(0x01)
	None bCastDeepShadow; // 0x224(0x01)
	None bCastRaytracedShadow; // 0x225(0x01)
	None bAffectReflection; // 0x225(0x01)
	None bAffectGlobalIllumination; // 0x225(0x01)
	None IndirectLightingIntensity; // 0x228(0x04)
	None VolumetricScatteringIntensity; // 0x22c(0x04)
	None SamplesPerPixel; // 0x230(0x04)
	None Temperature; // 0x238(0x04)
	None MaxDrawDistance; // 0x23c(0x04)
	None MaxDistanceFadeRange; // 0x240(0x04)
	None bUseTemperature; // 0x244(0x01)
	None ShadowMapChannel; // 0x248(0x04)
	None MinRoughness; // 0x250(0x04)
	None SpecularScale; // 0x254(0x04)
	None ShadowResolutionScale; // 0x258(0x04)
	None ShadowBias; // 0x25c(0x04)
	None ShadowSlopeBias; // 0x260(0x04)
	None ShadowSharpen; // 0x264(0x04)
	None ContactShadowLength; // 0x268(0x04)
	None ContactShadowLengthInWS; // 0x26c(0x01)
	None InverseSquaredFalloff; // 0x26c(0x01)
	None CastTranslucentShadows; // 0x26c(0x01)
	None bCastShadowsFromCinematicObjectsOnly; // 0x26c(0x01)
	None bAffectDynamicIndirectLighting; // 0x26c(0x01)
	None bForceCachedShadowsForMovablePrimitives; // 0x26c(0x01)
	None LightingChannels; // 0x270(0x01)
	None LightFunctionMaterial; // 0x278(0x08)
	None LightFunctionScale; // 0x280(0x0c)
	None IESTexture; // 0x290(0x08)
	None bUseIESBrightness; // 0x298(0x01)
	None IESBrightnessScale; // 0x29c(0x04)
	None LightFunctionFadeDistance; // 0x2a0(0x04)
	None DisabledBrightness; // 0x2a4(0x04)
	None bEnableLightShaftBloom; // 0x2a8(0x01)
	None BloomScale; // 0x2ac(0x04)
	None BloomThreshold; // 0x2b0(0x04)
	None BloomMaxBrightness; // 0x2b4(0x04)
	None BloomTint; // 0x2b8(0x04)
	None bUseRayTracedDistanceFieldShadows; // 0x2bc(0x01)
	None RayStartOffsetDepthScale; // 0x2c0(0x04)
	None ShadowCascadeBiasDistribution; // 0x338(0x04)
	None bEnableLightShaftOcclusion; // 0x33c(0x01)
	None OcclusionMaskDarkness; // 0x340(0x04)
	None OcclusionDepthRange; // 0x344(0x04)
	None LightShaftOverrideDirection; // 0x348(0x0c)
	None WholeSceneDynamicShadowRadius; // 0x354(0x04)
	None DynamicShadowDistanceMovableLight; // 0x358(0x04)
	None DynamicShadowDistanceStationaryLight; // 0x35c(0x04)
	None DynamicShadowCascades; // 0x360(0x04)
	None CascadeDistributionExponent; // 0x364(0x04)
	None CascadeTransitionFraction; // 0x368(0x04)
	None ShadowDistanceFadeoutFraction; // 0x36c(0x04)
	None bOnlyMovableObjectsInCascades; // 0x370(0x01)
	None bUseInsetShadowsForMovableObjects; // 0x370(0x01)
	None FarShadowCascadeCount; // 0x374(0x04)
	None FarShadowDistance; // 0x378(0x04)
	None DistanceFieldShadowDistance; // 0x37c(0x04)
	None LightSourceAngle; // 0x380(0x04)
	None LightSourceSoftAngle; // 0x384(0x04)
	None TraceDistance; // 0x388(0x04)
	None LightmassSettings; // 0x38c(0x10)
	None bCastModulatedShadows; // 0x39c(0x01)
	None ModulatedShadowColor; // 0x3a0(0x04)
	None ShadowAmount; // 0x3a4(0x04)
	None bUsedAsAtmosphereSunLight; // 0x3a8(0x01)
	None AtmosphereSunLightIndex; // 0x3ac(0x04)
	None bCanBeBaked; // 0x30(0x01)
	None bBakedDataSuccesfully; // 0x30(0x01)
	None Constant; // 0x38(0x04)
	None ConstantCurve; // 0x38(0x18)
	None ParameterName; // 0x40(0x08)
	None MinInput; // 0x48(0x04)
	None MaxInput; // 0x4c(0x04)
	None MinOutput; // 0x50(0x04)
	None MaxOutput; // 0x54(0x04)
	None ParamMode; // 0x58(0x01)
	None Min; // 0x38(0x04)
	None Max; // 0x3c(0x04)
	None ConstantCurve; // 0x38(0x18)
	None Constant; // 0x38(0x0c)
	None bLockAxes; // 0x44(0x01)
	None LockedAxes; // 0x48(0x01)
	None ConstantCurve; // 0x38(0x18)
	None bLockAxes; // 0x50(0x01)
	None LockedAxes; // 0x54(0x01)
	None ParameterName; // 0x50(0x08)
	None MinInput; // 0x58(0x0c)
	None MaxInput; // 0x64(0x0c)
	None MinOutput; // 0x70(0x0c)
	None MaxOutput; // 0x7c(0x0c)
	None ParamModes; // 0x88(0x03)
	None Max; // 0x38(0x0c)
	None Min; // 0x44(0x0c)
	None bLockAxes; // 0x50(0x01)
	None LockedAxes; // 0x54(0x01)
	None MirrorFlags; // 0x55(0x03)
	None bUseExtremes; // 0x58(0x01)
	None ConstantCurve; // 0x38(0x18)
	None bLockAxes1; // 0x50(0x01)
	None bLockAxes2; // 0x50(0x01)
	None LockedAxes; // 0x54(0x02)
	None MirrorFlags; // 0x56(0x03)
	None bUseExtremes; // 0x5c(0x01)
	None FrustumColor; // 0x430(0x04)
	None FrustumAngle; // 0x434(0x04)
	None FrustumAspectRatio; // 0x438(0x04)
	None FrustumStartDist; // 0x43c(0x04)
	None FrustumEndDist; // 0x440(0x04)
	None Texture; // 0x448(0x08)
	None Schema; // 0x28(0x08)
	None Nodes; // 0x30(0x10)
	None bEditable; // 0x40(0x01)
	None bAllowDeletion; // 0x40(0x01)
	None bAllowRenaming; // 0x40(0x01)
	None Blueprint; // 0x28(0x08)
	None Graph; // 0x30(0x08)
	None Node; // 0x38(0x08)
	None bIsDebugging; // 0x48(0x01)
	None DeprecatedPins; // 0x38(0x10)
	None NodePosX; // 0x48(0x04)
	None NodePosY; // 0x4c(0x04)
	None NodeWidth; // 0x50(0x04)
	None NodeHeight; // 0x54(0x04)
	None AdvancedPinDisplay; // 0x58(0x01)
	None EnabledState; // 0x59(0x01)
	None bDisplayAsDisabled; // 0x5b(0x01)
	None bUserSetEnabledState; // 0x5b(0x01)
	None bIsNodeEnabled; // 0x5b(0x01)
	None bHasCompilerMessage; // 0x5b(0x01)
	None NodeComment; // 0x60(0x10)
	None ErrorType; // 0x70(0x04)
	None ErrorMsg; // 0x78(0x10)
	None NodeGuid; // 0x88(0x10)
	None Link; // 0x98(0x10)
	None Excerpt; // 0xa8(0x10)
	None PinName; // 0x28(0x10)
	None PinToolTip; // 0x38(0x10)
	None Direction; // 0x48(0x01)
	None PinType; // 0x50(0x58)
	None DefaultValue; // 0xa8(0x10)
	None AutogeneratedDefaultValue; // 0xb8(0x10)
	None DefaultObject; // 0xc8(0x08)
	None DefaultTextValue; // 0xd0(0x18)
	None LinkedTo; // 0xe8(0x10)
	None SubPins; // 0xf8(0x10)
	None ParentPin; // 0x108(0x08)
	None ReferencePassThroughConnection; // 0x110(0x08)
	None ParticleSystemComponent; // 0x220(0x08)
	None bDestroyOnSystemFinish; // 0x228(0x01)
	None bPostUpdateTickGroup; // 0x228(0x01)
	None bCurrentlyActive; // 0x228(0x01)
	None OnParticleSpawn; // 0x230(0x10)
	None OnParticleBurst; // 0x240(0x10)
	None OnParticleDeath; // 0x250(0x10)
	None OnParticleCollide; // 0x260(0x10)
	None PS_CameraEffect; // 0x270(0x08)
	None PS_CameraEffectNonExtremeContent; // 0x278(0x08)
	None BaseCamera; // 0x280(0x08)
	None RelativeTransform; // 0x290(0x30)
	None BaseFOV; // 0x2c0(0x04)
	None bAllowMultipleInstances; // 0x2c4(0x01)
	None bResetWhenRetriggered; // 0x2c4(0x01)
	None EmittersToTreatAsSame; // 0x2c8(0x10)
	None DistFromCamera; // 0x2d8(0x04)
	None FailedPlaceMessage; // 0x28(0x10)
	None MaxedOutMessage; // 0x38(0x10)
	None EnteredMessage; // 0x48(0x10)
	None LeftMessage; // 0x58(0x10)
	None GlobalNameChange; // 0x68(0x10)
	None SpecEnteredMessage; // 0x78(0x10)
	None NewPlayerMessage; // 0x88(0x10)
	None NewSpecMessage; // 0x98(0x10)
	None Component; // 0x220(0x08)
	None bEnabled; // 0x228(0x01)
	None FogDensity; // 0x208(0x04)
	None FogHeightFalloff; // 0x20c(0x04)
	None SecondFogData; // 0x210(0x0c)
	None FogInscatteringColor; // 0x21c(0x10)
	None InscatteringColorCubemap; // 0x230(0x08)
	None InscatteringColorCubemapAngle; // 0x238(0x04)
	None InscatteringTextureTint; // 0x23c(0x10)
	None FullyDirectionalInscatteringColorDistance; // 0x24c(0x04)
	None NonDirectionalInscatteringColorDistance; // 0x250(0x04)
	None DirectionalInscatteringExponent; // 0x254(0x04)
	None DirectionalInscatteringStartDistance; // 0x258(0x04)
	None DirectionalInscatteringColor; // 0x25c(0x10)
	None FogMaxOpacity; // 0x26c(0x04)
	None StartDistance; // 0x270(0x04)
	None StartDistancePerPlatformScale; // 0x274(0x04)
	None FogCutoffDistance; // 0x278(0x04)
	None bEnableVolumetricFog; // 0x27c(0x01)
	None VolumetricFogScatteringDistribution; // 0x280(0x04)
	None VolumetricFogAlbedo; // 0x284(0x04)
	None VolumetricFogEmissive; // 0x288(0x10)
	None VolumetricFogExtinctionScale; // 0x298(0x04)
	None VolumetricFogDistance; // 0x29c(0x04)
	None VolumetricFogStaticLightingScatteringIntensity; // 0x2a0(0x04)
	None bOverrideLightColorsWithFogInscatteringColors; // 0x2a4(0x01)
	None SupportedClass; // 0x28(0x08)
	None ExportRootScope; // 0x30(0x08)
	None FormatExtension; // 0x38(0x10)
	None FormatDescription; // 0x48(0x10)
	None PreferredFormatIndex; // 0x58(0x04)
	None TextIndent; // 0x5c(0x04)
	None bText; // 0x60(0x01)
	None bSelectedOnly; // 0x60(0x01)
	None bForceFileOperations; // 0x60(0x01)
	None ExportTask; // 0x68(0x08)
	None MaxSpeed; // 0x138(0x04)
	None Acceleration; // 0x13c(0x04)
	None Deceleration; // 0x140(0x04)
	None TurningBoost; // 0x144(0x04)
	None bPositionCorrected; // 0x148(0x01)
	None FontCacheType; // 0x30(0x01)
	None Characters; // 0x38(0x10)
	None Textures; // 0x48(0x10)
	None IsRemapped; // 0x58(0x04)
	None EmScale; // 0x5c(0x04)
	None Ascent; // 0x60(0x04)
	None Descent; // 0x64(0x04)
	None Leading; // 0x68(0x04)
	None Kerning; // 0x6c(0x04)
	None ImportOptions; // 0x70(0xb0)
	None NumCharacters; // 0x120(0x04)
	None MaxCharHeight; // 0x128(0x10)
	None ScalingFactor; // 0x138(0x04)
	None LegacyFontSize; // 0x13c(0x04)
	None LegacyFontName; // 0x140(0x08)
	None CompositeFont; // 0x148(0x38)
	None SourceFilename; // 0x30(0x10)
	None Hinting; // 0x40(0x01)
	None LoadingPolicy; // 0x41(0x01)
	None LayoutMethod; // 0x42(0x01)
	None Data; // 0x28(0xb0)
	None Attenuation; // 0x28(0xb0)
	None ForceFeedbackEffect; // 0x208(0x08)
	None bAutoDestroy; // 0x210(0x01)
	None bStopWhenOwnerDestroyed; // 0x210(0x01)
	None bLooping; // 0x210(0x01)
	None bIgnoreTimeDilation; // 0x210(0x01)
	None bOverrideAttenuation; // 0x210(0x01)
	None IntensityMultiplier; // 0x214(0x04)
	None AttenuationSettings; // 0x218(0x08)
	None AttenuationOverrides; // 0x220(0xb0)
	None OnForceFeedbackFinished; // 0x2d0(0x10)
	None ChannelDetails; // 0x28(0x10)
	None Duration; // 0x38(0x04)
	None BadPacketLossThreshold; // 0x220(0x04)
	None SeverePacketLossThreshold; // 0x224(0x04)
	None BadPingThreshold; // 0x228(0x04)
	None SeverePingThreshold; // 0x22c(0x04)
	None AdjustedNetSpeed; // 0x230(0x04)
	None LastNetSpeedUpdateTime; // 0x234(0x04)
	None TotalNetBandwidth; // 0x238(0x04)
	None MinDynamicBandwidth; // 0x23c(0x04)
	None MaxDynamicBandwidth; // 0x240(0x04)
	None bIsStandbyCheckingEnabled; // 0x244(0x01)
	None bHasStandbyCheatTriggered; // 0x244(0x01)
	None StandbyRxCheatTime; // 0x248(0x04)
	None StandbyTxCheatTime; // 0x24c(0x04)
	None PercentMissingForRxStandby; // 0x250(0x04)
	None PercentMissingForTxStandby; // 0x254(0x04)
	None PercentForBadPing; // 0x258(0x04)
	None JoinInProgressStandbyWaitTime; // 0x25c(0x04)
	None MoveRepSize; // 0x260(0x04)
	None MAXPOSITIONERRORSQUARED; // 0x264(0x04)
	None MAXNEARZEROVELOCITYSQUARED; // 0x268(0x04)
	None CLIENTADJUSTUPDATECOST; // 0x26c(0x04)
	None MAXCLIENTUPDATEINTERVAL; // 0x270(0x04)
	None MaxClientForcedUpdateDuration; // 0x274(0x04)
	None ServerForcedUpdateHitchThreshold; // 0x278(0x04)
	None ServerForcedUpdateHitchCooldown; // 0x27c(0x04)
	None MaxMoveDeltaTime; // 0x280(0x04)
	None MaxClientSmoothingDeltaTime; // 0x284(0x04)
	None ClientNetSendMoveDeltaTime; // 0x288(0x04)
	None ClientNetSendMoveDeltaTimeThrottled; // 0x28c(0x04)
	None ClientNetSendMoveDeltaTimeStationary; // 0x290(0x04)
	None ClientNetSendMoveThrottleAtNetSpeed; // 0x294(0x04)
	None ClientNetSendMoveThrottleOverPlayerCount; // 0x298(0x04)
	None ClientAuthorativePosition; // 0x29c(0x01)
	None ClientErrorUpdateRateLimit; // 0x2a0(0x04)
	None ClientNetCamUpdateDeltaTime; // 0x2a4(0x04)
	None ClientNetCamUpdatePositionLimit; // 0x2a8(0x04)
	None bMovementTimeDiscrepancyDetection; // 0x2ac(0x01)
	None bMovementTimeDiscrepancyResolution; // 0x2ad(0x01)
	None MovementTimeDiscrepancyMaxTimeMargin; // 0x2b0(0x04)
	None MovementTimeDiscrepancyMinTimeMargin; // 0x2b4(0x04)
	None MovementTimeDiscrepancyResolutionRate; // 0x2b8(0x04)
	None MovementTimeDiscrepancyDriftAllowance; // 0x2bc(0x04)
	None bMovementTimeDiscrepancyForceCorrectionsDuringResolution; // 0x2c0(0x01)
	None bUseDistanceBasedRelevancy; // 0x2c1(0x01)
	None MaxSpectators; // 0x220(0x04)
	None MaxPlayers; // 0x224(0x04)
	None MaxPartySize; // 0x228(0x04)
	None MaxSplitscreensPerConnection; // 0x22c(0x01)
	None bRequiresPushToTalk; // 0x22d(0x01)
	None SessionName; // 0x230(0x08)
	None SpotLightComponent; // 0x230(0x08)
	None Amplitudes; // 0x28(0x10)
	None SampleRate; // 0x38(0x04)
	None HapticDetails; // 0x28(0x110)
	None SoundWave; // 0x28(0x08)
	None ProxyMeshes; // 0x28(0x10)
	None bShouldPauseWhileAdOpen; // 0x38(0x01)
	None ClickedBannerDelegates; // 0x40(0x10)
	None ClosedAdDelegates; // 0x50(0x10)
	None Records; // 0x28(0x10)
	None UnnecessaryComponents; // 0x38(0x10)
	None InputActionDelegateBindings; // 0x28(0x10)
	None InputAxisDelegateBindings; // 0x28(0x10)
	None InputAxisKeyDelegateBindings; // 0x28(0x10)
	None InputKeyDelegateBindings; // 0x28(0x10)
	None AxisConfig; // 0x28(0x10)
	None bAltEnterTogglesFullscreen; // 0x38(0x01)
	None bF11TogglesFullscreen; // 0x38(0x01)
	None bUseMouseForTouch; // 0x38(0x01)
	None bEnableMouseSmoothing; // 0x38(0x01)
	None bEnableFOVScaling; // 0x38(0x01)
	None bCaptureMouseOnLaunch; // 0x38(0x01)
	None bDefaultViewportMouseLock; // 0x38(0x01)
	None bAlwaysShowTouchInterface; // 0x38(0x01)
	None bShowConsoleOnFourFingerTap; // 0x39(0x01)
	None bEnableGestureRecognizer; // 0x39(0x01)
	None bUseAutocorrect; // 0x3a(0x01)
	None ExcludedAutocorrectOS; // 0x40(0x10)
	None ExcludedAutocorrectCultures; // 0x50(0x10)
	None ExcludedAutocorrectDeviceModels; // 0x60(0x10)
	None DefaultViewportMouseCaptureMode; // 0x70(0x01)
	None DefaultViewportMouseLockMode; // 0x71(0x01)
	None FOVScale; // 0x74(0x04)
	None DoubleClickTime; // 0x78(0x04)
	None ActionMappings; // 0x80(0x10)
	None AxisMappings; // 0x90(0x10)
	None SpeechMappings; // 0xa0(0x10)
	None DefaultTouchInterface; // 0xb0(0x18)
	None ConsoleKey; // 0xc8(0x18)
	None ConsoleKeys; // 0xe0(0x10)
	None InputTouchDelegateBindings; // 0x28(0x10)
	None Tabs; // 0x28(0x10)
	None ActiveTab; // 0x38(0x04)
	None InterpLength; // 0x28(0x04)
	None PathBuildTime; // 0x2c(0x04)
	None InterpGroups; // 0x30(0x10)
	None CurveEdSetup; // 0x40(0x08)
	None EdSectionStart; // 0x48(0x04)
	None EdSectionEnd; // 0x4c(0x04)
	None bShouldBakeAndPrune; // 0x50(0x01)
	None CachedDirectorGroup; // 0x58(0x08)
	None AllEventNames; // 0x60(0x10)
	None Caption; // 0x28(0x10)
	None InterpTracks; // 0x30(0x10)
	None GroupName; // 0x40(0x08)
	None GroupColor; // 0x48(0x04)
	None bCollapsed; // 0x4c(0x01)
	None bVisible; // 0x4c(0x01)
	None bIsFolder; // 0x4c(0x01)
	None bIsParented; // 0x4c(0x01)
	None bIsSelected; // 0x4c(0x01)
	None CameraAnimInst; // 0x50(0x08)
	None CompressTolerance; // 0x58(0x04)
	None Group; // 0x28(0x08)
	None GroupActor; // 0x30(0x08)
	None TrackInst; // 0x38(0x10)
	None Duration; // 0xf0(0x04)
	None bPauseOnImpact; // 0xf4(0x01)
	None bSweep; // 0xf8(0x01)
	None TeleportType; // 0xf9(0x01)
	None BehaviourType; // 0xfa(0x01)
	None bCheckIfStillInWorld; // 0xfb(0x01)
	None bForceSubStepping; // 0xfc(0x01)
	None OnInterpToReverse; // 0x100(0x10)
	None OnInterpToStop; // 0x110(0x10)
	None OnWaitBeginDelegate; // 0x120(0x10)
	None OnWaitEndDelegate; // 0x130(0x10)
	None OnResetDelegate; // 0x140(0x10)
	None MaxSimulationTimeStep; // 0x150(0x04)
	None MaxSimulationIterations; // 0x154(0x04)
	None ControlPoints; // 0x158(0x10)
	None SlotName; // 0x90(0x08)
	None AnimSeqs; // 0x98(0x10)
	None bSkipAnimNotifiers; // 0xa8(0x01)
	None BoolTrack; // 0x70(0x10)
	None PropertyName; // 0x80(0x08)
	None PropertyName; // 0x90(0x08)
	None CutTrack; // 0x70(0x10)
	None bSimulateCameraCutsOnClients; // 0x80(0x01)
	None EventTrack; // 0x70(0x10)
	None bFireEventsWhenForwards; // 0x80(0x01)
	None bFireEventsWhenBackwards; // 0x80(0x01)
	None bFireEventsWhenJumpingForwards; // 0x80(0x01)
	None bUseCustomEventName; // 0x80(0x01)
	None bPersistFade; // 0x90(0x01)
	None bFadeAudio; // 0x90(0x01)
	None FadeColor; // 0x94(0x10)
	None AnimBlueprintClass; // 0x90(0x08)
	None AnimClass; // 0x98(0x08)
	None ParamName; // 0xa0(0x08)
	None TargetMaterials; // 0x90(0x10)
	None ParamName; // 0xa0(0x08)
	None ParamName; // 0x90(0x08)
	None PropertyName; // 0x90(0x08)
	None LastUpdatePosition; // 0x28(0x04)
	None InterpProperty; // 0x28(0x28)
	None PropertyOuterObjectInst; // 0x50(0x08)
	None ResetBool; // 0x68(0x01)
	None ResetColor; // 0x60(0x04)
	None OldViewTarget; // 0x28(0x08)
	None LastUpdatePosition; // 0x28(0x04)
	None AnimScriptInstance; // 0x28(0x08)
	None ResetFloat; // 0x30(0x04)
	None MaterialInstances; // 0x28(0x10)
	None ResetFloats; // 0x38(0x10)
	None PrimitiveMaterialRefs; // 0x48(0x10)
	None InstancedTrack; // 0x58(0x08)
	None ResetFloat; // 0x28(0x04)
	None ResetFloat; // 0x60(0x04)
	None ResetColor; // 0x60(0x10)
	None ResetLocation; // 0x28(0x0c)
	None ResetRotation; // 0x34(0x0c)
	None LastUpdatePosition; // 0x28(0x04)
	None OldTimeDilation; // 0x28(0x04)
	None LastUpdatePosition; // 0x28(0x04)
	None PlayAudioComp; // 0x30(0x08)
	None Action; // 0x28(0x01)
	None LastUpdatePosition; // 0x2c(0x04)
	None bSavedActiveState; // 0x30(0x01)
	None MaterialInstances; // 0x28(0x10)
	None ResetVectors; // 0x38(0x10)
	None PrimitiveMaterialRefs; // 0x48(0x10)
	None InstancedTrack; // 0x58(0x08)
	None ResetVector; // 0x60(0x0c)
	None Action; // 0x28(0x01)
	None LastUpdatePosition; // 0x2c(0x04)
	None LinearColorTrack; // 0x70(0x18)
	None CurveTension; // 0x88(0x04)
	None PropertyName; // 0x90(0x08)
	None PosTrack; // 0x70(0x18)
	None EulerTrack; // 0x88(0x18)
	None LookupTrack; // 0xa0(0x10)
	None LookAtGroupName; // 0xb0(0x08)
	None LinCurveTension; // 0xb8(0x04)
	None AngCurveTension; // 0xbc(0x04)
	None bUseQuatInterpolation; // 0xc0(0x01)
	None bShowArrowAtKeys; // 0xc0(0x01)
	None bDisableMovement; // 0xc0(0x01)
	None bShowTranslationOnCurveEd; // 0xc0(0x01)
	None bShowRotationOnCurveEd; // 0xc0(0x01)
	None bHide3DTrack; // 0xc0(0x01)
	None RotMode; // 0xc4(0x01)
	None MoveAxis; // 0x90(0x01)
	None LookupTrack; // 0x98(0x10)
	None TrackKeys; // 0x70(0x10)
	None Sounds; // 0x90(0x10)
	None bPlayOnReverse; // 0xa0(0x01)
	None bContinueSoundOnMatineeEnd; // 0xa0(0x01)
	None bSuppressSubtitles; // 0xa0(0x01)
	None bTreatAsDialogue; // 0xa0(0x01)
	None bAttach; // 0xa0(0x01)
	None ToggleTrack; // 0x70(0x10)
	None bActivateSystemEachUpdate; // 0x80(0x01)
	None bActivateWithJustAttachedFlag; // 0x80(0x01)
	None bFireEventsWhenForwards; // 0x80(0x01)
	None bFireEventsWhenBackwards; // 0x80(0x01)
	None bFireEventsWhenJumpingForwards; // 0x80(0x01)
	None TargetMaterials; // 0x90(0x10)
	None ParamName; // 0xa0(0x08)
	None PropertyName; // 0x90(0x08)
	None VisibilityTrack; // 0x70(0x10)
	None bFireEventsWhenForwards; // 0x80(0x01)
	None bFireEventsWhenBackwards; // 0x80(0x01)
	None bFireEventsWhenJumpingForwards; // 0x80(0x01)
	None UnsignedInt16Variable; // 0x28(0x02)
	None UnsignedInt32Variable; // 0x2c(0x04)
	None UnsignedInt64Variable; // 0x30(0x08)
	None SignedInt8Variable; // 0x38(0x01)
	None SignedInt16Variable; // 0x3a(0x02)
	None SignedInt64Variable; // 0x40(0x08)
	None UnsignedInt8Variable; // 0x48(0x01)
	None SignedInt32Variable; // 0x4c(0x04)
	None LayerName; // 0x28(0x08)
	None bIsVisible; // 0x30(0x01)
	None ActorStats; // 0x38(0x10)
	None OwningWorld; // 0xb8(0x08)
	None Model; // 0xc0(0x08)
	None ModelComponents; // 0xc8(0x10)
	None ActorCluster; // 0xd8(0x08)
	None NumTextureStreamingUnbuiltComponents; // 0xe0(0x04)
	None NumTextureStreamingDirtyResources; // 0xe4(0x04)
	None LevelScriptActor; // 0xe8(0x08)
	None NavListStart; // 0xf0(0x08)
	None NavListEnd; // 0xf8(0x08)
	None NavDataChunks; // 0x100(0x10)
	None LightmapTotalSize; // 0x110(0x04)
	None ShadowmapTotalSize; // 0x114(0x04)
	None StaticNavigableGeometry; // 0x118(0x10)
	None StreamingTextureGuids; // 0x128(0x10)
	None LevelBuildDataId; // 0x1d0(0x10)
	None MapBuildData; // 0x1e0(0x08)
	None LightBuildLevelOffset; // 0x1e8(0x0c)
	None LightingScenarioQuality; // 0x1f4(0x01)
	None bIsLightingScenario; // 0x1f5(0x01)
	None bTextureStreamingRotationChanged; // 0x1f5(0x01)
	None bStaticComponentsRegisteredInStreamingManager; // 0x1f5(0x01)
	None bIsVisible; // 0x1f5(0x01)
	None WorldSettings; // 0x248(0x08)
	None AssetUserData; // 0x258(0x10)
	None DestroyedReplicatedStaticActors; // 0x278(0x10)
	None Actors; // 0x28(0x10)
	None BoxComponent; // 0x220(0x08)
	None bAutoUpdateBounds; // 0x228(0x01)
	None bInputEnabled; // 0x220(0x01)
	None WorldAsset; // 0x28(0x28)
	None PackageNameToLoad; // 0x50(0x08)
	None LODPackageNames; // 0x58(0x10)
	None LevelTransform; // 0x80(0x30)
	None LevelLODIndex; // 0xb4(0x04)
	None StreamingPriority; // 0xb8(0x04)
	None bShouldBeVisible; // 0xbe(0x01)
	None bShouldBeLoaded; // 0xbe(0x01)
	None bLocked; // 0xbe(0x01)
	None bIsStatic; // 0xbe(0x01)
	None bShouldBlockOnLoad; // 0xbe(0x01)
	None bShouldBlockOnUnload; // 0xbf(0x01)
	None bDisableDistanceStreaming; // 0xbf(0x01)
	None bDrawOnLevelStatusMap; // 0xbf(0x01)
	None LevelColor; // 0xc0(0x10)
	None EditorStreamingVolumes; // 0xd0(0x10)
	None MinTimeBetweenVolumeUnloadRequests; // 0xe0(0x04)
	None bExcludeFromAutomatedLightBake; // 0xe8(0x01)
	None OnLevelLoaded; // 0xf0(0x10)
	None OnLevelUnloaded; // 0x100(0x10)
	None OnLevelShown; // 0x110(0x10)
	None OnLevelHidden; // 0x120(0x10)
	None LoadedLevel; // 0x130(0x08)
	None PendingUnloadLevel; // 0x138(0x08)
	None bInitiallyLoaded; // 0x150(0x01)
	None bInitiallyVisible; // 0x150(0x01)
	None LightingScenarioQuality; // 0x150(0x01)
	None bDataIsStripped; // 0x151(0x01)
	None StreamingLevelNames; // 0x258(0x10)
	None bEditorPreVisOnly; // 0x268(0x01)
	None bDisabled; // 0x268(0x01)
	None StreamingUsage; // 0x26c(0x01)
	None SourceModel; // 0x28(0x08)
	None Surfaces; // 0x30(0x10)
	None PortalComponent; // 0x220(0x08)
	None PreviewBox; // 0x208(0x08)
	None LightmassSettings; // 0x28(0x1c)
	None IntensityUnits; // 0x338(0x01)
	None Radius; // 0x33c(0x04)
	None AttenuationRadius; // 0x340(0x04)
	None LightmassSettings; // 0x344(0x0c)
	None StaticMeshComponent; // 0x220(0x08)
	None ImpostersStaticMeshComponents; // 0x228(0x50)
	None Proxy; // 0x278(0x08)
	None Key; // 0x280(0x08)
	None LODDrawDistance; // 0x288(0x04)
	None LODLevel; // 0x28c(0x04)
	None SubActors; // 0x290(0x10)
	None CachedNumHLODLevels; // 0x2a0(0x01)
	None LevelLightingQuality; // 0x28(0x01)
	None LightingScenarioQuality; // 0x29(0x01)
	None bIsDataStripped; // 0x2a(0x01)
	None PhysMaterial; // 0x88(0x08)
	None PhysMaterialMask; // 0x90(0x08)
	None PhysicalMaterialMap; // 0x98(0x40)
	None Metallic; // 0xd8(0x0c)
	None Specular; // 0xec(0x0c)
	None Anisotropy; // 0x100(0x0c)
	None Normal; // 0x114(0x0c)
	None Tangent; // 0x128(0x0c)
	None EmissiveColor; // 0x13c(0x0c)
	None MaterialDomain; // 0x150(0x01)
	None BlendMode; // 0x151(0x01)
	None DecalBlendMode; // 0x152(0x01)
	None MaterialDecalResponse; // 0x153(0x01)
	None ShadingModel; // 0x154(0x01)
	None bCastDynamicShadowAsMasked; // 0x155(0x01)
	None ShadingModels; // 0x156(0x02)
	None OpacityMaskClipValue; // 0x158(0x04)
	None WorldPositionOffset; // 0x15c(0x0c)
	None Refraction; // 0x170(0x0c)
	None MaterialAttributes; // 0x184(0x10)
	None PixelDepthOffset; // 0x19c(0x0c)
	None ShadingModelFromMaterialExpression; // 0x1b0(0x0c)
	None bEnableTranslucencyAfterRefraction; // 0x1c4(0x01)
	None bEnableSeparateTranslucency; // 0x1c8(0x01)
	None bEnableResponsiveAA; // 0x1c8(0x01)
	None bScreenSpaceReflections; // 0x1c8(0x01)
	None bContactShadows; // 0x1c8(0x01)
	None TwoSided; // 0x1c8(0x01)
	None DitheredLODTransition; // 0x1c8(0x01)
	None DitherOpacityMask; // 0x1c8(0x01)
	None bAllowNegativeEmissiveColor; // 0x1c8(0x01)
	None TranslucencyLightingMode; // 0x1c9(0x01)
	None bEnableMobileSeparateTranslucency; // 0x1ca(0x01)
	None NumCustomizedUVs; // 0x1cc(0x04)
	None TranslucencyDirectionalLightingIntensity; // 0x1d0(0x04)
	None TranslucentShadowDensityScale; // 0x1d4(0x04)
	None TranslucentSelfShadowDensityScale; // 0x1d8(0x04)
	None TranslucentSelfShadowSecondDensityScale; // 0x1dc(0x04)
	None TranslucentSelfShadowSecondOpacity; // 0x1e0(0x04)
	None TranslucentBackscatteringExponent; // 0x1e4(0x04)
	None TranslucentMultipleScatteringExtinction; // 0x1e8(0x10)
	None TranslucentShadowStartOffset; // 0x1f8(0x04)
	None bDisableDepthTest; // 0x1fc(0x01)
	None bShouldRenderTranslucentOutline; // 0x1fc(0x01)
	None bWriteOnlyAlpha; // 0x1fc(0x01)
	None bGenerateSphericalParticleNormals; // 0x1fc(0x01)
	None bTangentSpaceNormal; // 0x1fc(0x01)
	None bUseEmissiveForDynamicAreaLighting; // 0x1fc(0x01)
	None bBlockGI; // 0x1fc(0x01)
	None bUsedAsSpecialEngineMaterial; // 0x1fc(0x01)
	None bUsedWithSkeletalMesh; // 0x1fd(0x01)
	None bUsedWithVertexCurvature; // 0x1fd(0x01)
	None bUsedWithBlurredNormals; // 0x1fd(0x01)
	None bUsedWithEditorCompositing; // 0x1fd(0x01)
	None bUsedWithParticleSprites; // 0x1fd(0x01)
	None bUsedWithBeamTrails; // 0x1fd(0x01)
	None bUsedWithMeshParticles; // 0x1fd(0x01)
	None bUsedWithNiagaraSprites; // 0x1fd(0x01)
	None bUsedWithNiagaraRibbons; // 0x1fe(0x01)
	None bUsedWithNiagaraMeshParticles; // 0x1fe(0x01)
	None bUsedWithGeometryCache; // 0x1fe(0x01)
	None bUsedWithStaticLighting; // 0x1fe(0x01)
	None bUsedWithMorphTargets; // 0x1fe(0x01)
	None bUsedWithSplineMeshes; // 0x1fe(0x01)
	None bUsedWithInstancedStaticMeshes; // 0x1fe(0x01)
	None bUsedWithGeometryCollections; // 0x1fe(0x01)
	None bUsesDistortion; // 0x1ff(0x01)
	None bUsedWithClothing; // 0x1ff(0x01)
	None bUsedWithWater; // 0x200(0x01)
	None bUsedWithHairStrands; // 0x200(0x01)
	None bUsedWithLidarPointCloud; // 0x200(0x01)
	None bUsedWithUI; // 0x204(0x01)
	None bAutomaticallySetUsageInEditor; // 0x204(0x01)
	None bFullyRough; // 0x204(0x01)
	None bUseFullPrecision; // 0x204(0x01)
	None bUseLightmapDirectionality; // 0x204(0x01)
	None bForwardRenderUsePreintegratedGFForSimpleIBL; // 0x208(0x01)
	None bUseHalfRateCheckerboardRendering; // 0x208(0x01)
	None bOnlyDirectionalLighting; // 0x208(0x01)
	None bUseHQForwardReflections; // 0x20c(0x01)
	None bUseHQForwardReflectionsOnLowEnd; // 0x210(0x01)
	None bUsePlanarForwardReflections; // 0x214(0x01)
	None bNormalCurvatureToRoughness; // 0x214(0x01)
	None D3D11TessellationMode; // 0x215(0x01)
	None bEnableCrackFreeDisplacement; // 0x216(0x01)
	None bEnableAdaptiveTessellation; // 0x216(0x01)
	None AllowTranslucentCustomDepthWrites; // 0x216(0x01)
	None Wireframe; // 0x216(0x01)
	None ShadingRate; // 0x217(0x01)
	None bCanMaskedBeAssumedOpaque; // 0x218(0x01)
	None bIsMasked; // 0x218(0x01)
	None bIsPreviewMaterial; // 0x218(0x01)
	None bIsFunctionPreviewMaterial; // 0x218(0x01)
	None bUseMaterialAttributes; // 0x218(0x01)
	None bCastRayTracedShadows; // 0x218(0x01)
	None bUseTranslucencyVertexFog; // 0x218(0x01)
	None bIsSky; // 0x218(0x01)
	None bComputeFogPerPixel; // 0x219(0x01)
	None bOutputTranslucentVelocity; // 0x219(0x01)
	None bAllowDevelopmentShaderCompile; // 0x219(0x01)
	None bIsMaterialEditorStatsMaterial; // 0x219(0x01)
	None BlendableLocation; // 0x21a(0x01)
	None BlendableOutputAlpha; // 0x21b(0x01)
	None bEnableStencilTest; // 0x21b(0x01)
	None StencilCompare; // 0x21c(0x01)
	None StencilRefValue; // 0x21d(0x01)
	None RefractionMode; // 0x21e(0x01)
	None BlendablePriority; // 0x220(0x04)
	None bIsBlendable; // 0x224(0x01)
	None UsageFlagWarnings; // 0x228(0x04)
	None RefractionDepthBias; // 0x22c(0x04)
	None StateId; // 0x230(0x10)
	None MaxDisplacement; // 0x240(0x04)
	None CachedExpressionData; // 0x2d0(0x228)
	None Elements; // 0x430(0x10)
	None Input; // 0x40(0x0c)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None ConstA; // 0x68(0x04)
	None ConstB; // 0x6c(0x04)
	None Texture; // 0x40(0x08)
	None SamplerType; // 0x48(0x01)
	None IsDefaultMeshpaintTexture; // 0x49(0x01)
	None Coordinates; // 0x50(0x0c)
	None TextureObject; // 0x64(0x0c)
	None MipValue; // 0x78(0x0c)
	None CoordinatesDX; // 0x8c(0x0c)
	None CoordinatesDY; // 0xa0(0x0c)
	None AutomaticViewMipBiasValue; // 0xb4(0x0c)
	None MipValueMode; // 0xc8(0x01)
	None SamplerSource; // 0xc9(0x01)
	None AutomaticViewMipBias; // 0xca(0x01)
	None ConstCoordinate; // 0xcb(0x01)
	None ConstMipValue; // 0xcc(0x04)
	None ParameterName; // 0xd0(0x08)
	None ExpressionGUID; // 0xd8(0x10)
	None Group; // 0xe8(0x08)
	None Threshold; // 0xf0(0x04)
	None Channel; // 0xf4(0x01)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None Input; // 0x40(0x0c)
	None Input; // 0x40(0x0c)
	None Input; // 0x40(0x0c)
	None Input; // 0x40(0x0c)
	None Input; // 0x40(0x0c)
	None Y; // 0x40(0x0c)
	None X; // 0x54(0x0c)
	None Y; // 0x40(0x0c)
	None X; // 0x54(0x0c)
	None Input; // 0x40(0x0c)
	None WorldPosition; // 0x40(0x0c)
	None Input; // 0x40(0x0c)
	None Temp; // 0x40(0x0c)
	None A; // 0x40(0x10)
	None B; // 0x58(0x10)
	None Alpha; // 0x70(0x0c)
	None PixelAttributeBlendType; // 0x84(0x01)
	None VertexAttributeBlendType; // 0x85(0x01)
	None Input; // 0x40(0x0c)
	None MaterialAttributes; // 0x40(0x10)
	None Coordinate; // 0x40(0x0c)
	None Height; // 0x54(0x0c)
	None HeightRatioInput; // 0x68(0x0c)
	None HeightRatio; // 0x7c(0x04)
	None ReferencePlane; // 0x80(0x04)
	None ConstCoordinate; // 0x84(0x04)
	None Input; // 0x40(0x0c)
	None ParameterName; // 0x40(0x08)
	None ExpressionGUID; // 0x48(0x10)
	None DefaultValue; // 0x58(0x10)
	None bUseCustomPrimitiveData; // 0x68(0x01)
	None PrimitiveDataIndex; // 0x69(0x01)
	None MaskChannel; // 0x70(0x01)
	None Input; // 0x74(0x0c)
	None Input; // 0x40(0x0c)
	None Min; // 0x54(0x0c)
	None Max; // 0x68(0x0c)
	None ClampMode; // 0x7c(0x01)
	None MinDefault; // 0x80(0x04)
	None MaxDefault; // 0x84(0x04)
	None Input; // 0x40(0x0c)
	None Collection; // 0x40(0x08)
	None ParameterName; // 0x48(0x08)
	None ParameterId; // 0x50(0x10)
	None SizeX; // 0x40(0x04)
	None SizeY; // 0x44(0x04)
	None Text; // 0x48(0x10)
	None CommentColor; // 0x58(0x10)
	None FontSize; // 0x68(0x04)
	None Input; // 0x40(0x0c)
	None R; // 0x54(0x01)
	None G; // 0x54(0x01)
	None B; // 0x54(0x01)
	None A; // 0x54(0x01)
	None R; // 0x40(0x04)
	None R; // 0x40(0x04)
	None G; // 0x44(0x04)
	None Constant; // 0x40(0x10)
	None Constant; // 0x40(0x10)
	None Input; // 0x40(0x0c)
	None Bias; // 0x54(0x04)
	None Scale; // 0x58(0x04)
	None Input; // 0x40(0x0c)
	None Period; // 0x54(0x04)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None DefaultValue; // 0x58(0x04)
	None bUseCustomPrimitiveData; // 0x5c(0x01)
	None PrimitiveDataIndex; // 0x5d(0x01)
	None Curve; // 0x60(0x08)
	None Atlas; // 0x68(0x08)
	None InputTime; // 0x70(0x0c)
	None Code; // 0x40(0x10)
	None OutputType; // 0x50(0x01)
	None Description; // 0x58(0x10)
	None Inputs; // 0x68(0x10)
	None AdditionalDefines; // 0x78(0x10)
	None IncludeFilePaths; // 0x88(0x10)
	None Value; // 0x40(0x0c)
	None Value; // 0x40(0x0c)
	None TextureSize; // 0x40(0x0c)
	None ConstWidth; // 0x54(0x04)
	None ConstHeight; // 0x58(0x04)
	None InOpacity; // 0x40(0x0c)
	None FadeDistance; // 0x54(0x0c)
	None OpacityDefault; // 0x68(0x04)
	None FadeDistanceDefault; // 0x6c(0x04)
	None FunctionValue; // 0x40(0x01)
	None Depth; // 0x44(0x0c)
	None InXY; // 0x40(0x0c)
	None Input; // 0x40(0x0c)
	None Fraction; // 0x54(0x0c)
	None LuminanceFactors; // 0x68(0x10)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None Position; // 0x40(0x0c)
	None Position; // 0x40(0x0c)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None ConstA; // 0x68(0x04)
	None ConstB; // 0x6c(0x04)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None ParamNames; // 0x40(0x10)
	None DefaultValue; // 0x50(0x10)
	None ParameterIndex; // 0x60(0x04)
	None Default; // 0x40(0x0c)
	None Inputs; // 0x54(0x30)
	None Input; // 0x40(0x0c)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None Font; // 0x40(0x08)
	None FontTexturePage; // 0x48(0x04)
	None ParameterName; // 0x50(0x08)
	None ExpressionGUID; // 0x58(0x10)
	None Group; // 0x68(0x08)
	None Input; // 0x40(0x0c)
	None ExponentIn; // 0x40(0x0c)
	None Exponent; // 0x54(0x04)
	None BaseReflectFractionIn; // 0x58(0x0c)
	None BaseReflectFraction; // 0x6c(0x04)
	None Normal; // 0x70(0x0c)
	None Preview; // 0x40(0x0c)
	None InputName; // 0x54(0x08)
	None Description; // 0x60(0x10)
	None ID; // 0x70(0x10)
	None InputType; // 0x80(0x01)
	None PreviewValue; // 0x90(0x10)
	None bUsePreviewValueAsDefault; // 0xa0(0x01)
	None SortPriority; // 0xa4(0x04)
	None bCompilingFunctionPreview; // 0xa8(0x01)
	None OutputName; // 0x40(0x08)
	None Description; // 0x48(0x10)
	None SortPriority; // 0x58(0x04)
	None A; // 0x5c(0x0c)
	None bLastPreviewed; // 0x70(0x01)
	None ID; // 0x74(0x10)
	None MaterialAttributes; // 0x40(0x10)
	None AttributeGetTypes; // 0x58(0x10)
	None Default; // 0x40(0x0c)
	None StaticIndirect; // 0x54(0x0c)
	None DynamicIndirect; // 0x68(0x0c)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None AGreaterThanB; // 0x68(0x0c)
	None AEqualsB; // 0x7c(0x0c)
	None ALessThanB; // 0x90(0x0c)
	None EqualsThreshold; // 0xa4(0x04)
	None ConstB; // 0xa8(0x04)
	None ConstAEqualsB; // 0xac(0x04)
	None Realtime; // 0x40(0x0c)
	None Lightmass; // 0x54(0x0c)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None Alpha; // 0x68(0x0c)
	None ConstA; // 0x7c(0x04)
	None ConstB; // 0x80(0x04)
	None ConstAlpha; // 0x84(0x04)
	None X; // 0x40(0x0c)
	None X; // 0x40(0x0c)
	None BaseColor; // 0x40(0x0c)
	None Metallic; // 0x54(0x0c)
	None Specular; // 0x68(0x0c)
	None Roughness; // 0x7c(0x0c)
	None Anisotropy; // 0x90(0x0c)
	None EmissiveColor; // 0xa4(0x0c)
	None Opacity; // 0xb8(0x0c)
	None OpacityMask; // 0xcc(0x0c)
	None Normal; // 0xe0(0x0c)
	None Tangent; // 0xf4(0x0c)
	None WorldPositionOffset; // 0x108(0x0c)
	None WorldDisplacement; // 0x11c(0x0c)
	None TessellationMultiplier; // 0x130(0x0c)
	None SubsurfaceColor; // 0x144(0x0c)
	None ClearCoat; // 0x158(0x0c)
	None ClearCoatRoughness; // 0x16c(0x0c)
	None AmbientOcclusion; // 0x180(0x0c)
	None Refraction; // 0x194(0x0c)
	None CustomizedUVs; // 0x1a8(0x60)
	None PixelDepthOffset; // 0x248(0x0c)
	None ShadingModel; // 0x25c(0x0c)
	None Coordinates; // 0x40(0x0c)
	None ParameterName; // 0x40(0x08)
	None ExpressionGUID; // 0x48(0x10)
	None Input; // 0x58(0x10)
	None DefaultLayers; // 0x70(0x40)
	None LayerCallers; // 0xb0(0x10)
	None NumActiveLayerCallers; // 0xc0(0x04)
	None BlendCallers; // 0xc8(0x10)
	None NumActiveBlendCallers; // 0xd8(0x04)
	None bIsLayerGraphBuilt; // 0xdc(0x01)
	None MaterialFunction; // 0x40(0x08)
	None FunctionParameterInfo; // 0x48(0x10)
	None Realtime; // 0x40(0x0c)
	None MaterialProxy; // 0x54(0x0c)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None ConstA; // 0x68(0x04)
	None ConstB; // 0x6c(0x04)
	None Input; // 0x40(0x0c)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None ConstA; // 0x68(0x04)
	None ConstB; // 0x6c(0x04)
	None Input; // 0x40(0x0c)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None ConstA; // 0x68(0x04)
	None ConstB; // 0x6c(0x04)
	None Position; // 0x40(0x0c)
	None FilterWidth; // 0x54(0x0c)
	None Scale; // 0x68(0x04)
	None Quality; // 0x6c(0x04)
	None NoiseFunction; // 0x70(0x01)
	None bTurbulence; // 0x74(0x01)
	None Levels; // 0x78(0x04)
	None OutputMin; // 0x7c(0x04)
	None OutputMax; // 0x80(0x04)
	None LevelScale; // 0x84(0x04)
	None bTiling; // 0x88(0x01)
	None RepeatSize; // 0x8c(0x04)
	None VectorInput; // 0x40(0x0c)
	None Input; // 0x40(0x0c)
	None Coordinate; // 0x40(0x0c)
	None Time; // 0x54(0x0c)
	None Speed; // 0x68(0x0c)
	None SpeedX; // 0x7c(0x04)
	None SpeedY; // 0x80(0x04)
	None ConstCoordinate; // 0x84(0x04)
	None bFractionalPart; // 0x88(0x01)
	None bBlend; // 0xd0(0x01)
	None DefaultValue; // 0x40(0x0c)
	None ConstDefaultValue; // 0x54(0x04)
	None DataIndex; // 0x58(0x04)
	None Base; // 0x40(0x0c)
	None Exponent; // 0x54(0x0c)
	None ConstExponent; // 0x68(0x04)
	None CurrentFrame; // 0x40(0x0c)
	None PreviousFrame; // 0x54(0x0c)
	None Default; // 0x40(0x0c)
	None Inputs; // 0x54(0x24)
	None BlurDist; // 0x40(0x0c)
	None ScreenUV; // 0x54(0x0c)
	None SceneTextureId; // 0x68(0x01)
	None Normal; // 0x40(0x0c)
	None RayTraced; // 0x54(0x0c)
	None CustomWorldNormal; // 0x40(0x0c)
	None bNormalizeCustomWorldNormal; // 0x54(0x01)
	None Input; // 0x40(0x0c)
	None NormalizedRotationAxis; // 0x40(0x0c)
	None RotationAngle; // 0x54(0x0c)
	None PivotPoint; // 0x68(0x0c)
	None Position; // 0x7c(0x0c)
	None Period; // 0x90(0x04)
	None Coordinate; // 0x40(0x0c)
	None Time; // 0x54(0x0c)
	None CenterX; // 0x68(0x04)
	None CenterY; // 0x6c(0x04)
	None Speed; // 0x70(0x04)
	None ConstCoordinate; // 0x74(0x04)
	None Input; // 0x40(0x0c)
	None BaseColor; // 0x40(0x0c)
	None Specular; // 0x54(0x0c)
	None Roughness; // 0x68(0x0c)
	None Normal; // 0x7c(0x0c)
	None WorldHeight; // 0x90(0x0c)
	None Opacity; // 0xa4(0x0c)
	None Mask; // 0xb8(0x0c)
	None Default; // 0x40(0x0c)
	None VirtualTextureOutput; // 0x54(0x0c)
	None Coordinates; // 0x40(0x0c)
	None WorldPosition; // 0x54(0x0c)
	None MipValue; // 0x68(0x0c)
	None VirtualTexture; // 0x80(0x08)
	None MaterialType; // 0x88(0x01)
	None bSinglePhysicalSpace; // 0x89(0x01)
	None MipValueMode; // 0x8a(0x01)
	None ParameterName; // 0x90(0x08)
	None ExpressionGUID; // 0x98(0x10)
	None Group; // 0xa8(0x08)
	None Input; // 0x40(0x0c)
	None InputMode; // 0x40(0x01)
	None Input; // 0x44(0x0c)
	None OffsetFraction; // 0x58(0x0c)
	None ConstInput; // 0x6c(0x08)
	None InputMode; // 0x40(0x01)
	None Input; // 0x44(0x0c)
	None Coordinates; // 0x58(0x0c)
	None ConstInput; // 0x6c(0x08)
	None Coordinates; // 0x40(0x0c)
	None SceneTextureId; // 0x54(0x01)
	None bFiltered; // 0x55(0x01)
	None Inputs; // 0x40(0x10)
	None AttributeSetTypes; // 0x50(0x10)
	None PixelShader; // 0x40(0x0c)
	None VertexShader; // 0x54(0x0c)
	None ShadingModel; // 0x40(0x01)
	None Default; // 0x40(0x0c)
	None Inputs; // 0x54(0x24)
	None Default; // 0x40(0x0c)
	None Shadow; // 0x54(0x0c)
	None Input; // 0x40(0x0c)
	None Input; // 0x40(0x0c)
	None Period; // 0x54(0x04)
	None ScatteringCoefficients; // 0x40(0x0c)
	None AbsorptionCoefficients; // 0x54(0x0c)
	None PhaseG; // 0x68(0x0c)
	None LightIndex; // 0x40(0x04)
	None LightIndex; // 0x40(0x04)
	None WorldPosition; // 0x44(0x0c)
	None LightIndex; // 0x40(0x04)
	None WorldPosition; // 0x40(0x0c)
	None Cell; // 0x40(0x0c)
	None Index; // 0x54(0x0c)
	None Seed; // 0x68(0x0c)
	None ConstIndex; // 0x7c(0x04)
	None ConstSeed; // 0x80(0x08)
	None GeometryInput; // 0x40(0x0c)
	None WindInput; // 0x54(0x0c)
	None LODInput; // 0x68(0x0c)
	None ExtraBendWS; // 0x7c(0x0c)
	None GeometryType; // 0x90(0x01)
	None WindType; // 0x91(0x01)
	None LODType; // 0x92(0x01)
	None BillboardThreshold; // 0x94(0x04)
	None bAccurateWindVelocities; // 0x98(0x01)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None Radius; // 0x68(0x0c)
	None Hardness; // 0x7c(0x0c)
	None AttenuationRadius; // 0x90(0x04)
	None HardnessPercent; // 0x94(0x04)
	None Density; // 0x40(0x0c)
	None ConstantDensity; // 0x54(0x04)
	None Input; // 0x40(0x0c)
	None Value; // 0x40(0x01)
	None DefaultValue; // 0x58(0x01)
	None Input; // 0x58(0x0c)
	None DefaultR; // 0x6c(0x01)
	None DefaultG; // 0x6c(0x01)
	None DefaultB; // 0x6c(0x01)
	None DefaultA; // 0x6c(0x01)
	None DefaultValue; // 0x40(0x01)
	None A; // 0x44(0x0c)
	None B; // 0x58(0x0c)
	None Value; // 0x6c(0x0c)
	None A; // 0x60(0x0c)
	None B; // 0x74(0x0c)
	None Input; // 0x40(0x0c)
	None Input; // 0x40(0x0c)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None ConstA; // 0x68(0x04)
	None ConstB; // 0x6c(0x04)
	None Input; // 0x40(0x0c)
	None Period; // 0x54(0x04)
	None Input; // 0x40(0x0c)
	None Index; // 0x40(0x0c)
	None Seed; // 0x54(0x0c)
	None ConstIndex; // 0x68(0x04)
	None ConstSeed; // 0x6c(0x08)
	None CoordinateIndex; // 0x40(0x04)
	None UTiling; // 0x44(0x04)
	None VTiling; // 0x48(0x04)
	None UnMirrorU; // 0x4c(0x01)
	None UnMirrorV; // 0x4c(0x01)
	None Coordinates; // 0x50(0x0c)
	None TextureObject; // 0x64(0x0c)
	None SamplerSource; // 0x78(0x01)
	None ConstCoordinate; // 0x79(0x01)
	None TextureObject; // 0x50(0x0c)
	None TextureObject; // 0x40(0x0c)
	None Property; // 0x54(0x01)
	None bBlend; // 0xf0(0x01)
	None TransmittanceColor; // 0x40(0x0c)
	None bIgnorePause; // 0x40(0x01)
	None bOverride_Period; // 0x40(0x01)
	None Period; // 0x44(0x04)
	None Input; // 0x40(0x0c)
	None TransformSourceType; // 0x54(0x01)
	None TransformType; // 0x55(0x01)
	None Input; // 0x40(0x0c)
	None TransformSourceType; // 0x54(0x01)
	None TransformType; // 0x55(0x01)
	None Input; // 0x40(0x0c)
	None Position; // 0x40(0x0c)
	None NoiseFunction; // 0x54(0x01)
	None Quality; // 0x58(0x04)
	None bTiling; // 0x5c(0x01)
	None TileSize; // 0x60(0x04)
	None Input; // 0x40(0x0c)
	None Property; // 0x40(0x01)
	None No; // 0x40(0x0c)
	None Yes; // 0x54(0x0c)
	None WorldPositionShaderOffset; // 0x40(0x01)
	None StateId; // 0x28(0x10)
	None MaterialFunctionUsage; // 0x38(0x01)
	None Description; // 0x40(0x10)
	None bExposeToLibrary; // 0x50(0x01)
	None bPrefixParameterNames; // 0x50(0x01)
	None bReentrantFlag; // 0x50(0x01)
	None Parent; // 0x40(0x08)
	None Base; // 0x48(0x08)
	None ScalarParameterValues; // 0x50(0x10)
	None VectorParameterValues; // 0x60(0x10)
	None TextureParameterValues; // 0x70(0x10)
	None FontParameterValues; // 0x80(0x10)
	None StaticSwitchParameterValues; // 0x90(0x10)
	None StaticComponentMaskParameterValues; // 0xa0(0x10)
	None RuntimeVirtualTextureParameterValues; // 0xb0(0x10)
	None TargetActors; // 0x220(0x10)
	None StateId; // 0x28(0x10)
	None ScalarParameters; // 0x38(0x10)
	None VectorParameters; // 0x48(0x10)
	None Collection; // 0x30(0x08)
	None MatineeData; // 0x220(0x08)
	None MatineeControllerName; // 0x228(0x08)
	None PlayRate; // 0x230(0x04)
	None bPlayOnLevelLoad; // 0x234(0x01)
	None bForceStartPos; // 0x234(0x01)
	None ForceStartPosition; // 0x238(0x04)
	None bLooping; // 0x23c(0x01)
	None bRewindOnPlay; // 0x23c(0x01)
	None bNoResetOnRewind; // 0x23c(0x01)
	None bRewindIfAlreadyPlaying; // 0x23c(0x01)
	None bDisableRadioFilter; // 0x23c(0x01)
	None bClientSideOnly; // 0x23c(0x01)
	None bSkipUpdateIfNotVisible; // 0x23c(0x01)
	None bIsSkippable; // 0x23c(0x01)
	None PreferredSplitScreenNum; // 0x240(0x04)
	None bDisableMovementInput; // 0x244(0x01)
	None bDisableLookAtInput; // 0x244(0x01)
	None bHidePlayer; // 0x244(0x01)
	None bHideHud; // 0x244(0x01)
	None GroupActorInfos; // 0x248(0x10)
	None bShouldShowGore; // 0x258(0x01)
	None GroupInst; // 0x260(0x10)
	None CameraCuts; // 0x270(0x10)
	None bIsPlaying; // 0x280(0x01)
	None bReversePlayback; // 0x280(0x01)
	None bPaused; // 0x280(0x01)
	None bPendingStop; // 0x280(0x01)
	None InterpPosition; // 0x284(0x04)
	None ReplicationForceIsPlaying; // 0x28c(0x01)
	None OnPlay; // 0x290(0x10)
	None OnStop; // 0x2a0(0x10)
	None OnPause; // 0x2b0(0x10)
	None CameraAnim; // 0x2c8(0x08)
	None MeshReductionModuleName; // 0x38(0x08)
	None AvailableProducts; // 0x38(0x10)
	None LastError; // 0x48(0x10)
	None LastErrorSolution; // 0x58(0x10)
	None ModelBodySetup; // 0x448(0x08)
	None BaseSkelMesh; // 0x28(0x08)
	None bIsDynamicObstacle; // 0x28(0x01)
	None NavigationDataName; // 0x28(0x08)
	None NavigationSystemClass; // 0x28(0x18)
	None SupportedAgentsMask; // 0x40(0x04)
	None DefaultAgentName; // 0x44(0x08)
	None bIsOverriden; // 0x4c(0x01)
	None Links; // 0x28(0x10)
	None SegmentLinks; // 0x38(0x10)
	None bVerifyPeer; // 0x38(0x01)
	None bEnableMultiplayerWorldOriginRebasing; // 0x38(0x01)
	None MaxRepArraySize; // 0x3c(0x04)
	None MaxRepArrayMemory; // 0x40(0x04)
	None NetworkEmulationProfiles; // 0x48(0x10)
	None SourceItems; // 0x28(0x50)
	None TargetItems; // 0x78(0x50)
	None SourceToTarget; // 0xc8(0x50)
	None SourceAsset; // 0x118(0x28)
	None TargetAsset; // 0x140(0x28)
	None ObjectBaseClass; // 0x28(0x08)
	None bHasBlueprintClasses; // 0x30(0x01)
	None Objects; // 0x38(0x10)
	None WeakObjects; // 0x48(0x10)
	None bUseWeakReferences; // 0x58(0x01)
	None bIsFullyLoaded; // 0x59(0x01)
	None ReferencedObjects; // 0x28(0x10)
	None bPainCausing; // 0x268(0x01)
	None DamagePerSec; // 0x26c(0x04)
	None DamageType; // 0x270(0x08)
	None PainInterval; // 0x278(0x04)
	None bEntryPain; // 0x27c(0x01)
	None BACKUP_bPainCausing; // 0x27c(0x01)
	None DamageInstigator; // 0x280(0x08)
	None Channels; // 0x28(0x04)
	None EmitterName; // 0x28(0x08)
	None SubUVDataOffset; // 0x30(0x04)
	None EmitterRenderMode; // 0x34(0x01)
	None SignificanceLevel; // 0x35(0x01)
	None bUseLegacySpawningBehavior; // 0x37(0x01)
	None ConvertedModules; // 0x37(0x01)
	None bIsSoloing; // 0x37(0x01)
	None bCookedOut; // 0x37(0x01)
	None bDisabledLODsKeepEmitterAlive; // 0x37(0x01)
	None bDisableWhenInsignficant; // 0x38(0x01)
	None LODLevels; // 0x40(0x10)
	None PeakActiveParticles; // 0x50(0x04)
	None InitialAllocationCount; // 0x54(0x04)
	None QualityLevelSpawnRateScale; // 0x58(0x04)
	None DetailModeBitmask; // 0x5c(0x04)
	None m_ParticleChannels; // 0x1b8(0x04)
	None Level; // 0x28(0x04)
	None bEnabled; // 0x2c(0x01)
	None RequiredModule; // 0x30(0x08)
	None Modules; // 0x38(0x10)
	None TypeDataModule; // 0x48(0x08)
	None SpawnModule; // 0x50(0x08)
	None EventGenerator; // 0x58(0x08)
	None SpawningModules; // 0x60(0x10)
	None SpawnModules; // 0x70(0x10)
	None UpdateModules; // 0x80(0x10)
	None OrbitModules; // 0x90(0x10)
	None EventReceiverModules; // 0xa0(0x10)
	None ConvertedModules; // 0xb0(0x01)
	None PeakActiveParticles; // 0xb4(0x04)
	None bAlwaysInWorldSpace; // 0x30(0x01)
	None Acceleration; // 0x38(0x48)
	None bApplyOwnerScale; // 0x80(0x01)
	None Acceleration; // 0x38(0x0c)
	None DragCoefficient; // 0x38(0x08)
	None DragCoefficientRaw; // 0x40(0x30)
	None DragScale; // 0x38(0x08)
	None DragScaleRaw; // 0x40(0x30)
	None AccelOverLife; // 0x38(0x48)
	None EndPoint0; // 0x30(0x0c)
	None EndPoint1; // 0x3c(0x0c)
	None Range; // 0x48(0x30)
	None Strength; // 0x78(0x30)
	None EmitterName; // 0x30(0x08)
	None Range; // 0x38(0x30)
	None bStrengthByDistance; // 0x68(0x01)
	None Strength; // 0x70(0x30)
	None bAffectBaseVelocity; // 0xa0(0x01)
	None SelectionMethod; // 0xa4(0x01)
	None bRenewSource; // 0xa8(0x01)
	None bInheritSourceVel; // 0xa8(0x01)
	None LastSelIndex; // 0xac(0x04)
	None Position; // 0x30(0x48)
	None Range; // 0x78(0x30)
	None Strength; // 0xa8(0x30)
	None StrengthByDistance; // 0xd8(0x01)
	None bAffectBaseVelocity; // 0xd8(0x01)
	None bOverrideVelocity; // 0xd8(0x01)
	None bUseWorldSpacePosition; // 0xd8(0x01)
	None Positive_X; // 0xd8(0x01)
	None Positive_Y; // 0xd8(0x01)
	None Positive_Z; // 0xd8(0x01)
	None Negative_X; // 0xd8(0x01)
	None Negative_Y; // 0xd9(0x01)
	None Negative_Z; // 0xd9(0x01)
	None Position; // 0x30(0x0c)
	None Radius; // 0x3c(0x04)
	None Strength; // 0x40(0x08)
	None StrengthRaw; // 0x48(0x30)
	None ModifierType; // 0x30(0x01)
	None PositionOptions; // 0x34(0x04)
	None Position; // 0x38(0x48)
	None TangentOptions; // 0x80(0x04)
	None Tangent; // 0x88(0x48)
	None bAbsoluteTangent; // 0xd0(0x01)
	None StrengthOptions; // 0xd4(0x04)
	None Strength; // 0xd8(0x30)
	None bLowFreq_Enabled; // 0x30(0x01)
	None Frequency; // 0x34(0x04)
	None Frequency_LowRange; // 0x38(0x04)
	None NoiseRange; // 0x40(0x48)
	None NoiseRangeScale; // 0x88(0x30)
	None bNRScaleEmitterTime; // 0xb8(0x01)
	None NoiseSpeed; // 0xc0(0x48)
	None bSmooth; // 0x108(0x01)
	None NoiseLockRadius; // 0x10c(0x04)
	None bNoiseLock; // 0x110(0x01)
	None bOscillate; // 0x110(0x01)
	None NoiseLockTime; // 0x114(0x04)
	None NoiseTension; // 0x118(0x04)
	None bUseNoiseTangents; // 0x11c(0x01)
	None NoiseTangentStrength; // 0x120(0x30)
	None NoiseTessellation; // 0x150(0x04)
	None bTargetNoise; // 0x154(0x01)
	None FrequencyDistance; // 0x158(0x04)
	None bApplyNoiseScale; // 0x15c(0x01)
	None NoiseScale; // 0x160(0x30)
	None SourceMethod; // 0x30(0x01)
	None SourceName; // 0x34(0x08)
	None bSourceAbsolute; // 0x3c(0x01)
	None Source; // 0x40(0x48)
	None bLockSource; // 0x88(0x01)
	None SourceTangentMethod; // 0x8c(0x01)
	None SourceTangent; // 0x90(0x48)
	None bLockSourceTangent; // 0xd8(0x01)
	None SourceStrength; // 0xe0(0x30)
	None bLockSourceStength; // 0x110(0x01)
	None TargetMethod; // 0x30(0x01)
	None TargetName; // 0x34(0x08)
	None Target; // 0x40(0x48)
	None bTargetAbsolute; // 0x88(0x01)
	None bLockTarget; // 0x88(0x01)
	None TargetTangentMethod; // 0x8c(0x01)
	None TargetTangent; // 0x90(0x48)
	None bLockTargetTangent; // 0xd8(0x01)
	None TargetStrength; // 0xe0(0x30)
	None bLockTargetStength; // 0x110(0x01)
	None LockRadius; // 0x114(0x04)
	None CameraOffset; // 0x30(0x30)
	None bSpawnTimeOnly; // 0x60(0x01)
	None UpdateMethod; // 0x64(0x01)
	None DampingFactor; // 0x30(0x48)
	None DampingFactorRotation; // 0x78(0x48)
	None MaxCollisions; // 0xc0(0x30)
	None CollisionCompletionOption; // 0xf0(0x01)
	None CollisionTypes; // 0xf8(0x10)
	None bApplyPhysics; // 0x110(0x01)
	None bIgnoreTriggerVolumes; // 0x110(0x01)
	None ParticleMass; // 0x118(0x30)
	None DirScalar; // 0x148(0x04)
	None bPawnsDoNotDecrementCount; // 0x14c(0x01)
	None bOnlyVerticalNormalsDecrementCount; // 0x14c(0x01)
	None VerticalFudgeFactor; // 0x150(0x04)
	None DelayAmount; // 0x158(0x30)
	None bDropDetail; // 0x188(0x01)
	None bCollideOnlyIfVisible; // 0x188(0x01)
	None bIgnoreSourceActor; // 0x188(0x01)
	None MaxCollisionDistance; // 0x18c(0x04)
	None Resilience; // 0x30(0x30)
	None ResilienceScaleOverLife; // 0x60(0x30)
	None Friction; // 0x90(0x04)
	None RandomSpread; // 0x94(0x04)
	None RandomDistribution; // 0x98(0x04)
	None RadiusScale; // 0x9c(0x04)
	None RadiusBias; // 0xa0(0x04)
	None Response; // 0xa4(0x01)
	None CollisionMode; // 0xa5(0x01)
	None StartColor; // 0x30(0x48)
	None StartAlpha; // 0x78(0x30)
	None bClampAlpha; // 0xa8(0x01)
	None RandomSeedInfo; // 0xb0(0x20)
	None ColorOverLife; // 0x30(0x48)
	None AlphaOverLife; // 0x78(0x30)
	None bClampAlpha; // 0xa8(0x01)
	None ColorScaleOverLife; // 0x30(0x48)
	None AlphaScaleOverLife; // 0x78(0x30)
	None bEmitterTime; // 0xa8(0x01)
	None Events; // 0x30(0x10)
	None EventGeneratorType; // 0x30(0x01)
	None EventName; // 0x34(0x08)
	None bStopSpawning; // 0x40(0x01)
	None SpawnCount; // 0x40(0x30)
	None bUseParticleTime; // 0x70(0x01)
	None bUsePSysLocation; // 0x70(0x01)
	None bInheritVelocity; // 0x70(0x01)
	None InheritVelocityScale; // 0x78(0x48)
	None PhysicalMaterials; // 0xc0(0x10)
	None bBanPhysicalMaterials; // 0xd0(0x01)
	None LowerLeftCorner; // 0x30(0x48)
	None UpperRightCorner; // 0x78(0x48)
	None bAbsolute; // 0xc0(0x01)
	None bKillInside; // 0xc0(0x01)
	None bAxisAlignedAndFixedSize; // 0xc0(0x01)
	None Height; // 0x30(0x30)
	None bAbsolute; // 0x60(0x01)
	None bFloor; // 0x60(0x01)
	None bApplyPSysScale; // 0x60(0x01)
	None Lifetime; // 0x30(0x30)
	None RandomSeedInfo; // 0x60(0x20)
	None bUseInverseSquaredFalloff; // 0x30(0x01)
	None bAffectsTranslucency; // 0x31(0x01)
	None bPreviewLightRadius; // 0x32(0x01)
	None SpawnFraction; // 0x34(0x04)
	None ColorScaleOverLife; // 0x38(0x48)
	None BrightnessOverLife; // 0x80(0x30)
	None RadiusScale; // 0xb0(0x30)
	None LightExponent; // 0xe0(0x30)
	None LightingChannels; // 0x110(0x01)
	None VolumetricScatteringIntensity; // 0x114(0x04)
	None bHighQualityLights; // 0x118(0x01)
	None bShadowCastingLights; // 0x119(0x01)
	None RandomSeedInfo; // 0x120(0x20)
	None StartLocation; // 0x30(0x48)
	None DistributeOverNPoints; // 0x78(0x04)
	None DistributeThreshold; // 0x7c(0x04)
	None RandomSeedInfo; // 0x80(0x20)
	None SourceType; // 0x30(0x01)
	None UniversalOffset; // 0x34(0x0c)
	None SourceLocations; // 0x40(0x10)
	None SelectionMethod; // 0x50(0x01)
	None bUpdatePositionEachFrame; // 0x54(0x01)
	None bOrientMeshEmitters; // 0x54(0x01)
	None bInheritBoneVelocity; // 0x54(0x01)
	None InheritVelocityScale; // 0x58(0x04)
	None SkelMeshActorParamName; // 0x5c(0x08)
	None NumPreSelectedIndices; // 0x64(0x04)
	None Location; // 0x30(0x48)
	None LocationOffset; // 0x78(0x48)
	None ScaleFactor; // 0xc0(0x48)
	None Direction; // 0x108(0x48)
	None EmitterName; // 0x30(0x08)
	None SelectionMethod; // 0x38(0x01)
	None InheritSourceVelocity; // 0x3c(0x01)
	None InheritSourceVelocityScale; // 0x40(0x04)
	None bInheritSourceRotation; // 0x44(0x01)
	None InheritSourceRotationScale; // 0x48(0x04)
	None EmitterName; // 0x30(0x08)
	None Positive_X; // 0x30(0x01)
	None Positive_Y; // 0x30(0x01)
	None Positive_Z; // 0x30(0x01)
	None Negative_X; // 0x30(0x01)
	None Negative_Y; // 0x30(0x01)
	None Negative_Z; // 0x30(0x01)
	None SurfaceOnly; // 0x30(0x01)
	None Velocity; // 0x30(0x01)
	None VelocityScale; // 0x38(0x30)
	None StartLocation; // 0x68(0x48)
	None RadialVelocity; // 0xb0(0x01)
	None StartRadius; // 0xb8(0x30)
	None StartHeight; // 0xe8(0x30)
	None HeightAxis; // 0x118(0x01)
	None RandomSeedInfo; // 0x120(0x20)
	None StartRadius; // 0xb0(0x30)
	None RandomSeedInfo; // 0xe0(0x20)
	None StartOffset; // 0x30(0x48)
	None Height; // 0x78(0x30)
	None Angle; // 0xa8(0x30)
	None Thickness; // 0xd8(0x30)
	None RandomSeedInfo; // 0x80(0x20)
	None MeshMaterials; // 0x30(0x10)
	None StartRotation; // 0x30(0x48)
	None bInheritParent; // 0x78(0x01)
	None RandomSeedInfo; // 0x80(0x20)
	None StartRotationRate; // 0x30(0x48)
	None RandomSeedInfo; // 0x78(0x20)
	None LifeMultiplier; // 0x30(0x48)
	None RotRate; // 0x30(0x48)
	None bScaleRotRate; // 0x78(0x01)
	None bUseEmitterTime; // 0x30(0x01)
	None ChainMode; // 0x38(0x01)
	None OffsetAmount; // 0x40(0x48)
	None OffsetOptions; // 0x88(0x04)
	None RotationAmount; // 0x90(0x48)
	None RotationOptions; // 0xd8(0x04)
	None RotationRateAmount; // 0xe0(0x48)
	None RotationRateOptions; // 0x128(0x04)
	None LockAxisFlags; // 0x30(0x01)
	None DynamicParams; // 0x30(0x10)
	None UpdateFlags; // 0x40(0x04)
	None bUsesVelocity; // 0x44(0x01)
	None RandomSeedInfo; // 0x48(0x20)
	None PivotOffset; // 0x30(0x08)
	None Material; // 0x30(0x08)
	None MinFacingCameraBlendDistance; // 0x38(0x04)
	None MaxFacingCameraBlendDistance; // 0x3c(0x04)
	None EmitterOrigin; // 0x40(0x0c)
	None EmitterRotation; // 0x4c(0x0c)
	None ScreenAlignment; // 0x58(0x01)
	None bUseLocalSpace; // 0x59(0x01)
	None bKillOnDeactivate; // 0x59(0x01)
	None bKillOnCompleted; // 0x59(0x01)
	None SortMode; // 0x5a(0x01)
	None bUseLegacyEmitterTime; // 0x5b(0x01)
	None bRemoveHMDRoll; // 0x5b(0x01)
	None bEmitterDurationUseRange; // 0x5b(0x01)
	None EmitterDuration; // 0x5c(0x04)
	None SpawnRate; // 0x60(0x30)
	None BurstList; // 0x90(0x10)
	None EmitterDelay; // 0xa0(0x04)
	None EmitterDelayLow; // 0xa4(0x04)
	None bDelayFirstLoopOnly; // 0xa8(0x01)
	None InterpolationMethod; // 0xa9(0x01)
	None bScaleUV; // 0xaa(0x01)
	None bEmitterDelayUseRange; // 0xaa(0x01)
	None ParticleBurstMethod; // 0xab(0x01)
	None bOverrideSystemMacroUV; // 0xac(0x01)
	None bUseMaxDrawCount; // 0xac(0x01)
	None OpacitySourceMode; // 0xad(0x01)
	None EmitterNormalsMode; // 0xae(0x01)
	None bOrbitModuleAffectsVelocityAlignment; // 0xaf(0x01)
	None SubImages_Horizontal; // 0xb0(0x04)
	None SubImages_Vertical; // 0xb4(0x04)
	None RandomImageTime; // 0xb8(0x04)
	None RandomImageChanges; // 0xbc(0x04)
	None MacroUVPosition; // 0xc0(0x0c)
	None MacroUVRadius; // 0xcc(0x04)
	None UVFlippingMode; // 0xd0(0x01)
	None BoundingMode; // 0xd1(0x01)
	None bDurationRecalcEachLoop; // 0xd2(0x01)
	None NormalsSphereCenter; // 0xd4(0x0c)
	None AlphaThreshold; // 0xe0(0x04)
	None EmitterLoops; // 0xe4(0x04)
	None CutoutTexture; // 0xe8(0x08)
	None MaxDrawCount; // 0xf0(0x04)
	None EmitterDurationLow; // 0xf4(0x04)
	None NormalsCylinderDirection; // 0xf8(0x0c)
	None NamedMaterialOverrides; // 0x108(0x10)
	None StartRotation; // 0x30(0x30)
	None RandomSeedInfo; // 0x60(0x20)

	void SwimNotifyTransitionStateLock(None bpp__bShouldLock__pf); // SwimNotifyTransitionStateLock Sub_Hero_ABP_Swimming.Sub_Hero_ABP_Swimming_C.SwimNotifyTransitionStateLock // (Native|Event|Public|BlueprintCallable) // <Game+0x195dfa0>
	void SetFillPercentage(None Percentage); // SetFillPercentage WBP_ProgressBar.WBP_ProgressBar_C.SetFillPercentage // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x260f470>
	void HandleInitialSpawn(); // HandleInitialSpawn WBP_TextChat_ChatEntry.WBP_TextChat_ChatEntry_C.HandleInitialSpawn // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x260f470>
	void ServerSetPartyOwner(None InUniqueId, None InPartyOwnerId); // ServerSetPartyOwner Lobby.LobbyBeaconClient.ServerSetPartyOwner // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <Game+0xb3cad0>
