// BlueprintGeneratedClass .B
struct AB : AB {
	struct Unknown BravoHotelVehicleTire_RR; // 0xD18 (8)
	struct Unknown BravoHotelVehicleTire_RL; // 0xD20 (8)
	struct Unknown BravoHotelVehicleTire_FR; // 0xD28 (8)
	struct Unknown BravoHotelVehicleTire_FL; // 0xD30 (8)
	struct Unknown B; // 0xD38 (8)
	struct Unknown B; // 0xD40 (8)
	struct Unknown BravoHotelVehicleSeat04; // 0xD48 (8)
	struct Unknown BravoHotelVehicleSeat03; // 0xD50 (8)
	struct Unknown BravoHotelVehicleSeat02; // 0xD58 (8)
};

