// PGame_LandingPanelJSONHandler PlatformGameFramework.PGame_LandingPanelJSONHandler
// Size: 0x00 (Inherited: 0x28)
struct UPGame_LandingPanelJSONHandler : Object {
	None AnimGraphNode_Root; // 0x10f8(0x40)
	None AnimGraphNode_TransitionResult_37; // 0x1138(0x38)
	None AnimGraphNode_TransitionResult_36; // 0x1170(0x38)
	None AnimGraphNode_TransitionResult_35; // 0x11a8(0x38)
	None AnimGraphNode_TransitionResult_34; // 0x11e0(0x38)
	None AnimGraphNode_TransitionResult_33; // 0x1218(0x38)
	None AnimGraphNode_TransitionResult_32; // 0x1250(0x38)
	None AnimGraphNode_TransitionResult_31; // 0x1288(0x38)
	None AnimGraphNode_TransitionResult_30; // 0x12c0(0x38)
	None AnimGraphNode_TransitionResult_29; // 0x12f8(0x38)
	None AnimGraphNode_TransitionResult_28; // 0x1330(0x38)
	None AnimGraphNode_TransitionResult_27; // 0x1368(0x38)
	None AnimGraphNode_TransitionResult_26; // 0x13a0(0x38)
	None AnimGraphNode_TransitionResult_25; // 0x13d8(0x38)
	None AnimGraphNode_TransitionResult_24; // 0x1410(0x38)
	None AnimGraphNode_TransitionResult_23; // 0x1448(0x38)
	None AnimGraphNode_TransitionResult_22; // 0x1480(0x38)
	None AnimGraphNode_TransitionResult_21; // 0x14b8(0x38)
	None AnimGraphNode_TransitionResult_20; // 0x14f0(0x38)
	None AnimGraphNode_TransitionResult_19; // 0x1528(0x38)
	None AnimGraphNode_TransitionResult_18; // 0x1560(0x38)
	None AnimGraphNode_TransitionResult_17; // 0x1598(0x38)
	None AnimGraphNode_TransitionResult_16; // 0x15d0(0x38)
	None AnimGraphNode_TransitionResult_15; // 0x1608(0x38)
	None AnimGraphNode_TransitionResult_14; // 0x1640(0x38)
	None AnimGraphNode_TransitionResult_13; // 0x1678(0x38)
	None AnimGraphNode_TransitionResult_12; // 0x16b0(0x38)
	None AnimGraphNode_TransitionResult_11; // 0x16e8(0x38)
	None AnimGraphNode_TransitionResult_10; // 0x1720(0x38)
	None AnimGraphNode_TransitionResult_9; // 0x1758(0x38)
	None AnimGraphNode_TransitionResult_8; // 0x1790(0x38)
	None AnimGraphNode_TransitionResult_7; // 0x17c8(0x38)
	None AnimGraphNode_TransitionResult_6; // 0x1800(0x38)
	None AnimGraphNode_TransitionResult_5; // 0x1838(0x38)
	None AnimGraphNode_TransitionResult_4; // 0x1870(0x38)
	None AnimGraphNode_TransitionResult_3; // 0x18a8(0x38)
	None AnimGraphNode_TransitionResult_2; // 0x18e0(0x38)
	None AnimGraphNode_TransitionResult; // 0x1918(0x38)
	None AnimGraphNode_SequenceSkinned_13; // 0x1950(0x160)
	None AnimGraphNode_SequencePlayer_13; // 0x1ab0(0x88)
	None AnimGraphNode_StateResult_9; // 0x1b38(0x40)
	None AnimGraphNode_SequenceSkinned_12; // 0x1b78(0x160)
	None AnimGraphNode_SequenceSkinned_11; // 0x1cd8(0x160)
	None AnimGraphNode_SequenceSkinned_10; // 0x1e38(0x160)
	None AnimGraphNode_SequenceSkinned_9; // 0x1f98(0x160)
	None AnimGraphNode_SequencePlayer_12; // 0x20f8(0x88)
	None AnimGraphNode_BlendListByInt_2; // 0x2180(0xb0)
	None AnimGraphNode_SequencePlayer_11; // 0x2230(0x88)
	None AnimGraphNode_SequencePlayer_10; // 0x22b8(0x88)
	None AnimGraphNode_BlendListByInt; // 0x2340(0xb0)
	None AnimGraphNode_SequencePlayer_9; // 0x23f0(0x88)
	None AnimGraphNode_BlendListByBool_11; // 0x2478(0xb0)
	None AnimGraphNode_StateResult_8; // 0x2528(0x40)
	None AnimGraphNode_SequenceSkinned_8; // 0x2568(0x160)
	None AnimGraphNode_SequenceSkinned_7; // 0x26c8(0x160)
	None AnimGraphNode_BlendSpaceSkinned_6; // 0x2828(0x200)
	None AnimGraphNode_BlendSpacePlayer_6; // 0x2a28(0xf0)
	None AnimGraphNode_SequencePlayer_8; // 0x2b18(0x88)
	None AnimGraphNode_BlendListByBool_10; // 0x2ba0(0xb0)
	None AnimGraphNode_BlendListByBool_9; // 0x2c50(0xb0)
	None AnimGraphNode_SequencePlayer_7; // 0x2d00(0x88)
	None AnimGraphNode_StateResult_7; // 0x2d88(0x40)
	None AnimGraphNode_SequenceEvaluator_2; // 0x2dc8(0x58)
	None AnimGraphNode_SequenceEvaluator; // 0x2e20(0x58)
	None AnimGraphNode_BlendListByBool_8; // 0x2e78(0xb0)
	None AnimGraphNode_StateResult_6; // 0x2f28(0x40)
	None AnimGraphNode_BlendSpaceSkinned_5; // 0x2f68(0x200)
	None AnimGraphNode_BlendSpaceSkinned_4; // 0x3168(0x200)
	None AnimGraphNode_BlendSpacePlayer_5; // 0x3368(0xf0)
	None AnimGraphNode_BlendListByBool_7; // 0x3458(0xb0)
	None AnimGraphNode_BlendSpacePlayer_4; // 0x3508(0xf0)
	None AnimGraphNode_StateResult_5; // 0x35f8(0x40)
	None AnimGraphNode_SequenceSkinned_6; // 0x3638(0x160)
	None AnimGraphNode_SequenceSkinned_5; // 0x3798(0x160)
	None AnimGraphNode_SequenceSkinned_4; // 0x38f8(0x160)
	None AnimGraphNode_SequenceSkinned_3; // 0x3a58(0x160)
	None AnimGraphNode_BlendSpaceSkinned_3; // 0x3bb8(0x200)
	None AnimGraphNode_SequencePlayer_6; // 0x3db8(0x88)
	None AnimGraphNode_SequencePlayer_5; // 0x3e40(0x88)
	None AnimGraphNode_SequencePlayer_4; // 0x3ec8(0x88)
	None AnimGraphNode_SequencePlayer_3; // 0x3f50(0x88)
	None AnimGraphNode_BlendListByEnum; // 0x3fd8(0xc0)
	None AnimGraphNode_BlendListByBool_6; // 0x4098(0xb0)
	None AnimGraphNode_BlendSpacePlayer_3; // 0x4148(0xf0)
	None AnimGraphNode_StateResult_4; // 0x4238(0x40)
	None AnimGraphNode_BlendSpaceSkinned_2; // 0x4278(0x200)
	None AnimGraphNode_BlendSpaceSkinned; // 0x4478(0x200)
	None AnimGraphNode_BlendSpacePlayer_2; // 0x4678(0xf0)
	None AnimGraphNode_BlendListByBool_5; // 0x4768(0xb0)
	None AnimGraphNode_BlendSpacePlayer; // 0x4818(0xf0)
	None AnimGraphNode_StateResult_3; // 0x4908(0x40)
	None AnimGraphNode_SequenceSkinned_2; // 0x4948(0x160)
	None AnimGraphNode_SequenceSkinned; // 0x4aa8(0x160)
	None AnimGraphNode_SequencePlayer_2; // 0x4c08(0x88)
	None AnimGraphNode_RandomPlayer; // 0x4c90(0x88)
	None AnimGraphNode_BlendListByBool_4; // 0x4d18(0xb0)
	None AnimGraphNode_StateResult_2; // 0x4dc8(0x40)
	None AnimGraphNode_StateMachine_2; // 0x4e08(0xc0)
	None AnimGraphNode_SequencePlayer; // 0x4ec8(0x88)
	None AnimGraphNode_StateResult; // 0x4f50(0x40)
	None AnimGraphNode_StateMachine; // 0x4f90(0xc0)
	None AnimGraphNode_BlendListByBool_3; // 0x5050(0xb0)
	None AnimGraphNode_BlendListByBool_2; // 0x5100(0xb0)
	None AnimGraphNode_LocalToComponentSpace; // 0x51b0(0x30)
	None AnimGraphNode_ComponentToLocalSpace; // 0x51e0(0x30)
	None AnimGraphNode_ModifyBone; // 0x5210(0x118)
	None AnimGraphNode_BlendListByBool; // 0x5328(0xb0)
	None AnimGraphNode_AimOffsetSkinned; // 0x53d8(0x1c0)
	None AnimGraphNode_SaveCachedPose; // 0x5598(0xc8)
	None AnimGraphNode_UseCachedPose_3; // 0x5660(0x38)
	None AnimGraphNode_UseCachedPose_2; // 0x5698(0x38)
	None AnimGraphNode_UseCachedPose; // 0x56d0(0x38)
	None MaxMantleHt; // 0x5708(0x04)
	None Max2StoryMantleHt; // 0x570c(0x04)
	None StringMantlesTogether; // 0x5710(0x01)
	None Start Swim Moving; // 0x5718(0x08)
	None Start Swim Moving B; // 0x5720(0x08)
	None Start Swim Moving A; // 0x5728(0x08)
	None Cached Angle; // 0x5730(0x04)
	None Stop Swim Moving A; // 0x5738(0x08)
	None Stop Swim Moving B; // 0x5740(0x08)
	None Stop Swim Moving; // 0x5748(0x08)
	None Cached Stop Angle; // 0x5750(0x04)
	None locoStartDir; // 0x5754(0x01)
	None locoStopDir; // 0x5755(0x01)
	None TurnVal; // 0x5758(0x04)
	None Transition_Downed; // 0x575c(0x01)
	None Transition_Pivot; // 0x575d(0x01)
	None IsFallingToWater; // 0x575e(0x01)
	None Replace with code; // 0x5760(0x0c)
	None Character; // 0x5770(0x08)
	None Transition State Lock; // 0x5778(0x01)
	None CallFunc_BreakRotator_Roll; // 0x577c(0x04)
	None CallFunc_BreakRotator_Pitch; // 0x5780(0x04)
	None CallFunc_BreakRotator_Yaw; // 0x5784(0x04)
	None CallFunc_BreakRotator_Roll_2; // 0x5788(0x04)
	None CallFunc_BreakRotator_Pitch_2; // 0x578c(0x04)
	None CallFunc_BreakRotator_Yaw_2; // 0x5790(0x04)
	None CallFunc_BreakRotator_Roll_3; // 0x5794(0x04)
	None CallFunc_BreakRotator_Pitch_3; // 0x5798(0x04)
	None CallFunc_BreakRotator_Yaw_3; // 0x579c(0x04)
	None CallFunc_BreakRotator_Roll_4; // 0x57a0(0x04)
	None CallFunc_BreakRotator_Pitch_4; // 0x57a4(0x04)
	None CallFunc_BreakRotator_Yaw_4; // 0x57a8(0x04)
	None CallFunc_BreakRotator_Roll_5; // 0x57ac(0x04)
	None CallFunc_BreakRotator_Pitch_5; // 0x57b0(0x04)
	None CallFunc_BreakRotator_Yaw_5; // 0x57b4(0x04)
	None CallFunc_BreakVector_X; // 0x57b8(0x04)
	None CallFunc_BreakVector_Y; // 0x57bc(0x04)
	None CallFunc_BreakVector_Z; // 0x57c0(0x04)
	None CallFunc_BreakRotator_Roll_6; // 0x57c4(0x04)
	None CallFunc_BreakRotator_Pitch_6; // 0x57c8(0x04)
	None CallFunc_BreakRotator_Yaw_6; // 0x57cc(0x04)
	None Temp_bool_Variable; // 0x57d0(0x01)
	None K2Node_Select_Default; // 0x57d4(0x0c)
	None CallFunc_BreakVector_X_2; // 0x57e0(0x04)
	None CallFunc_BreakVector_Y_2; // 0x57e4(0x04)
	None CallFunc_BreakVector_Z_2; // 0x57e8(0x04)
	None Temp_bool_Variable_2; // 0x57ec(0x01)
	None K2Node_Select_Default_2; // 0x57f0(0x0c)
	None Temp_bool_Variable_3; // 0x57fc(0x01)
	None Temp_bool_Variable_4; // 0x57fd(0x01)
	None K2Node_Select_Default_3; // 0x5800(0x0c)
	None K2Node_Event_DeltaTimeX; // 0x580c(0x04)
	None K2Node_Select_Default_4; // 0x5810(0x0c)
	None K2Node_Event_StartLocation; // 0x581c(0x0c)
	None CallFunc_BreakVector_X_3; // 0x5828(0x04)
	None CallFunc_BreakVector_Y_3; // 0x582c(0x04)
	None CallFunc_BreakVector_Z_3; // 0x5830(0x04)
	None K2Node_Event_StopLocation; // 0x5834(0x0c)
	None K2Node_Event_AnimationVariant; // 0x5840(0x01)
	None K2Node_Event_DelayTime; // 0x5844(0x04)
	None K2Node_SwitchEnum_CmpSuccess; // 0x5848(0x01)
	None K2Node_DynamicCast_AsKSCharacter; // 0x5850(0x08)
	None K2Node_DynamicCast_bSuccess; // 0x5858(0x01)
	None K2Node_Event_PivotLocation; // 0x585c(0x0c)
	None K2Node_Event_bShouldLock; // 0x5868(0x01)
	None BaseBar; // 0x238(0x08)
	None ProgressBarFill; // 0x240(0x08)
	None UberGraphFrame; // 0x238(0x08)
	None FadeOut; // 0x240(0x08)
	None Show; // 0x248(0x08)
	None NameButton; // 0x250(0x08)
	None NameText; // 0x258(0x08)
	None Panel; // 0x260(0x08)
	None Text; // 0x268(0x08)
	None ChatDataCopy; // 0x270(0x40)
	None IsWindowCollapsed; // 0x2b0(0x01)
	None IsInitialShowFinished; // 0x2b1(0x01)
	None ChatMessageDisplayDuration; // 0x2b4(0x04)
	None LobbyState; // 0x2b0(0x08)
	None PlayerState; // 0x2b8(0x08)
	None LobbyJoinServerState; // 0x2c1(0x01)
	None LobbyStateClass; // 0x250(0x28)
	None LobbyState; // 0x278(0x08)
	None DisplayName; // 0x220(0x18)
	None UniqueId; // 0x238(0x28)
	None PartyOwnerUniqueId; // 0x260(0x28)
	None bInLobby; // 0x288(0x01)
	None ClientActor; // 0x290(0x08)
	None MaxPlayers; // 0x220(0x04)
	None LobbyBeaconPlayerStateClass; // 0x228(0x08)
	None bLobbyStarted; // 0x238(0x01)
	None WaitForPlayersTimeRemaining; // 0x23c(0x04)
	None Players; // 0x240(0x120)
	None LastKnownStatus; // 0x28(0x01)
	None bRejoinAfterCheck; // 0x29(0x01)
	None bAttemptingRejoin; // 0x2a(0x01)
	None DestructibleComponent; // 0x220(0x08)
	None OnActorFracture; // 0x228(0x10)
	None bFractureEffectOverride; // 0x670(0x01)
	None FractureEffects; // 0x678(0x10)
	None bEnableHardSleeping; // 0x688(0x01)
	None LargeChunkThreshold; // 0x68c(0x04)
	None OnComponentFracture; // 0x6a0(0x10)
	None CellSiteCount; // 0x28(0x04)
	None FractureMaterialDesc; // 0x2c(0x24)
	None RandomSeed; // 0x50(0x04)
	None VoronoiSites; // 0x58(0x10)
	None OriginalSubmeshCount; // 0x68(0x04)
	None Materials; // 0x70(0x10)
	None ChunkParameters; // 0x80(0x10)
	None DefaultDestructibleParameters; // 0x388(0x88)
	None FractureEffects; // 0x410(0x10)
	None OSSName; // 0x1e0(0x10)
	None HotfixManagerClassName; // 0x1f0(0x10)
	None DebugPrefix; // 0x200(0x10)
	None AssetsHotfixedFromIniFiles; // 0x210(0x10)
	None HotfixCheckCompleteDelay; // 0x88(0x04)
	None UpdateCheckCompleteDelay; // 0x8c(0x04)
	None HotfixAvailabilityCheckCompleteDelay; // 0x90(0x04)
	None UpdateCheckAvailabilityCompleteDelay; // 0x94(0x04)
	None bCheckPlatformOSSForUpdate; // 0x98(0x01)
	None bCheckOSSForUpdate; // 0x99(0x01)
	None AppSuspendedUpdateCheckTimeSeconds; // 0x9c(0x04)
	None bPlatformEnvironmentDetected; // 0xa8(0x01)
	None bInitialUpdateFinished; // 0xa9(0x01)
	None bCheckHotfixAvailabilityOnly; // 0xaa(0x01)
	None CurrentUpdateState; // 0xab(0x01)
	None WorstNumFilesPendingLoadViewed; // 0xac(0x04)
	None LastPatchCheckResult; // 0xb0(0x01)
	None LastHotfixResult; // 0xb1(0x01)
	None LastUpdateCheck; // 0xe0(0x10)
	None LastCompletionResult; // 0xf0(0x02)
	None UpdateStateEnum; // 0x108(0x08)
	None UpdateCompletionEnum; // 0x110(0x08)
	None PrimaryActorTick; // 0x28(0x30)
	None bNetTemporary; // 0x58(0x01)
	None bNetStartup; // 0x58(0x01)
	None bOnlyRelevantToOwner; // 0x58(0x01)
	None bAlwaysRelevant; // 0x58(0x01)
	None bReplicateMovement; // 0x58(0x01)
	None bHidden; // 0x58(0x01)
	None bTearOff; // 0x58(0x01)
	None bExchangedRoles; // 0x58(0x01)
	None bNetLoadOnClient; // 0x59(0x01)
	None bNetUseOwnerRelevancy; // 0x59(0x01)
	None bRelevantForNetworkReplays; // 0x59(0x01)
	None bRelevantForLevelBounds; // 0x59(0x01)
	None bReplayRewindable; // 0x59(0x01)
	None bAllowTickBeforeBeginPlay; // 0x59(0x01)
	None bAutoDestroyWhenFinished; // 0x59(0x01)
	None bCanBeDamaged; // 0x59(0x01)
	None bBlockInput; // 0x5a(0x01)
	None bCollideWhenPlacing; // 0x5a(0x01)
	None bFindCameraComponentWhenViewTarget; // 0x5a(0x01)
	None bGenerateOverlapEventsDuringLevelStreaming; // 0x5a(0x01)
	None bIgnoresOriginShifting; // 0x5a(0x01)
	None bEnableAutoLODGeneration; // 0x5a(0x01)
	None bIsEditorOnlyActor; // 0x5a(0x01)
	None bActorSeamlessTraveled; // 0x5a(0x01)
	None bReplicates; // 0x5b(0x01)
	None bCanBeInCluster; // 0x5b(0x01)
	None bAllowReceiveTickEventOnDedicatedServer; // 0x5b(0x01)
	None bActorEnableCollision; // 0x5c(0x01)
	None bActorIsBeingDestroyed; // 0x5c(0x01)
	None UpdateOverlapsMethodDuringLevelStreaming; // 0x5d(0x01)
	None DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x5e(0x01)
	None RemoteRole; // 0x5f(0x01)
	None ReplicatedMovement; // 0x60(0x34)
	None InitialLifeSpan; // 0x94(0x04)
	None CustomTimeDilation; // 0x98(0x04)
	None AttachmentReplication; // 0xa0(0x40)
	None Owner; // 0xe0(0x08)
	None NetDriverName; // 0xe8(0x08)
	None Role; // 0xf0(0x01)
	None NetDormancy; // 0xf1(0x01)
	None SpawnCollisionHandlingMethod; // 0xf2(0x01)
	None AutoReceiveInput; // 0xf3(0x01)
	None InputPriority; // 0xf4(0x04)
	None InputComponent; // 0xf8(0x08)
	None NetCullDistanceSquared; // 0x100(0x04)
	None NetTag; // 0x104(0x04)
	None NetUpdateFrequency; // 0x108(0x04)
	None MinNetUpdateFrequency; // 0x10c(0x04)
	None NetPriority; // 0x110(0x04)
	None Instigator; // 0x118(0x08)
	None Children; // 0x120(0x10)
	None RootComponent; // 0x130(0x08)
	None ControllingMatineeActors; // 0x138(0x10)
	None Layers; // 0x150(0x10)
	None ParentComponent; // 0x160(0x08)
	None Tags; // 0x170(0x10)
	None OnTakeAnyDamage; // 0x180(0x01)
	None OnTakePointDamage; // 0x181(0x01)
	None OnTakeRadialDamage; // 0x182(0x01)
	None OnActorBeginOverlap; // 0x183(0x01)
	None OnActorEndOverlap; // 0x184(0x01)
	None OnBeginCursorOver; // 0x185(0x01)
	None OnEndCursorOver; // 0x186(0x01)
	None OnClicked; // 0x187(0x01)
	None OnReleased; // 0x188(0x01)
	None OnInputTouchBegin; // 0x189(0x01)
	None OnInputTouchEnd; // 0x18a(0x01)
	None OnInputTouchEnter; // 0x18b(0x01)
	None OnInputTouchLeave; // 0x18c(0x01)
	None OnActorHit; // 0x18d(0x01)
	None OnDestroyed; // 0x18e(0x01)
	None OnEndPlay; // 0x18f(0x01)
	None InstanceComponents; // 0x1f0(0x10)
	None BlueprintCreatedComponents; // 0x200(0x10)
	None PrimaryComponentTick; // 0x30(0x30)
	None ComponentTags; // 0x60(0x10)
	None AssetUserData; // 0x70(0x10)
	None UCSSerializationIndex; // 0x84(0x04)
	None bNetAddressable; // 0x88(0x01)
	None bReplicates; // 0x88(0x01)
	None bAutoActivate; // 0x89(0x01)
	None bIsActive; // 0x8a(0x01)
	None bEditableWhenInherited; // 0x8a(0x01)
	None bCanEverAffectNavigation; // 0x8a(0x01)
	None bIsEditorOnly; // 0x8a(0x01)
	None CreationMethod; // 0x8c(0x01)
	None OnComponentActivated; // 0x8d(0x01)
	None OnComponentDeactivated; // 0x8e(0x01)
	None UCSModifiedProperties; // 0x90(0x10)
	None PhysicsVolume; // 0xb8(0x08)
	None AttachParent; // 0xc0(0x08)
	None AttachSocketName; // 0xc8(0x08)
	None AttachChildren; // 0xd0(0x10)
	None ClientAttachedChildren; // 0xe0(0x10)
	None RelativeLocation; // 0x11c(0x0c)
	None RelativeRotation; // 0x128(0x0c)
	None RelativeScale3D; // 0x134(0x0c)
	None ComponentVelocity; // 0x140(0x0c)
	None bComponentToWorldUpdated; // 0x14c(0x01)
	None bAbsoluteLocation; // 0x14c(0x01)
	None bAbsoluteRotation; // 0x14c(0x01)
	None bAbsoluteScale; // 0x14c(0x01)
	None bVisible; // 0x14c(0x01)
	None bShouldBeAttached; // 0x14c(0x01)
	None bShouldSnapLocationWhenAttached; // 0x14c(0x01)
	None bShouldSnapRotationWhenAttached; // 0x14d(0x01)
	None bShouldUpdatePhysicsVolume; // 0x14d(0x01)
	None bHiddenInGame; // 0x14d(0x01)
	None bBoundsChangeTriggersStreamingDataRebuild; // 0x14d(0x01)
	None bUseAttachParentBound; // 0x14d(0x01)
	None Mobility; // 0x14f(0x01)
	None DetailMode; // 0x150(0x01)
	None PhysicsVolumeChangedDelegate; // 0x151(0x01)
	None MinDrawDistance; // 0x210(0x04)
	None LDMaxDrawDistance; // 0x214(0x04)
	None CachedMaxDrawDistance; // 0x218(0x04)
	None DepthPriorityGroup; // 0x21c(0x01)
	None ViewOwnerDepthPriorityGroup; // 0x21d(0x01)
	None IndirectLightingCacheQuality; // 0x21e(0x01)
	None LightmapType; // 0x21f(0x01)
	None bUseMaxLODAsImposter; // 0x220(0x01)
	None bBatchImpostersAsInstances; // 0x220(0x01)
	None bNeverDistanceCull; // 0x220(0x01)
	None bForceLocalLighting; // 0x220(0x01)
	None bAlwaysCreatePhysicsState; // 0x221(0x01)
	None bGenerateOverlapEvents; // 0x221(0x01)
	None bMultiBodyOverlap; // 0x221(0x01)
	None bTraceComplexOnMove; // 0x221(0x01)
	None bReturnMaterialOnMove; // 0x221(0x01)
	None bUseViewOwnerDepthPriorityGroup; // 0x221(0x01)
	None bAllowCullDistanceVolume; // 0x221(0x01)
	None bHasMotionBlurVelocityMeshes; // 0x221(0x01)
	None bVisibleInReflectionCaptures; // 0x222(0x01)
	None bVisibleInRayTracing; // 0x222(0x01)
	None bRenderInMainPass; // 0x222(0x01)
	None bRenderInDepthPass; // 0x222(0x01)
	None bReceivesDecals; // 0x222(0x01)
	None bOwnerNoSee; // 0x222(0x01)
	None bOnlyOwnerSee; // 0x222(0x01)
	None bTreatAsBackgroundForOcclusion; // 0x222(0x01)
	None bUseAsOccluder; // 0x223(0x01)
	None bSelectable; // 0x223(0x01)
	None bForceMipStreaming; // 0x223(0x01)
	None bHasPerInstanceHitProxies; // 0x223(0x01)
	None CastShadow; // 0x223(0x01)
	None bAffectDynamicIndirectLighting; // 0x223(0x01)
	None bAffectDistanceFieldLighting; // 0x223(0x01)
	None bCastDynamicShadow; // 0x223(0x01)
	None bCastStaticShadow; // 0x224(0x01)
	None bCastVolumetricTranslucentShadow; // 0x224(0x01)
	None bSelfShadowOnly; // 0x224(0x01)
	None bCastFarShadow; // 0x224(0x01)
	None bCastInsetShadow; // 0x224(0x01)
	None bCastCinematicShadow; // 0x224(0x01)
	None bCastHiddenShadow; // 0x224(0x01)
	None bCastShadowAsTwoSided; // 0x224(0x01)
	None bShouldNotReceiveCapsuleShadows; // 0x225(0x01)
	None bLightAsIfStatic; // 0x225(0x01)
	None bLightAttachmentsAsGroup; // 0x225(0x01)
	None bExcludeFromLightAttachmentGroup; // 0x225(0x01)
	None bReceiveMobileCSMShadows; // 0x225(0x01)
	None bSingleSampleShadowFromStationaryLights; // 0x225(0x01)
	None bIgnoreRadialImpulse; // 0x225(0x01)
	None bIgnoreRadialForce; // 0x225(0x01)
	None bApplyImpulseOnDamage; // 0x226(0x01)
	None bReplicatePhysicsToAutonomousProxy; // 0x226(0x01)
	None bFillCollisionUnderneathForNavmesh; // 0x226(0x01)
	None AlwaysLoadOnClient; // 0x226(0x01)
	None AlwaysLoadOnServer; // 0x226(0x01)
	None bUseEditorCompositing; // 0x226(0x01)
	None bRenderCustomDepth; // 0x226(0x01)
	None bExcludeFromContributionCulling; // 0x226(0x01)
	None bHasCustomNavigableGeometry; // 0x228(0x01)
	None OutlineDepthMode; // 0x229(0x01)
	None CanCharacterStepUpOn; // 0x22b(0x01)
	None LightingChannels; // 0x22c(0x01)
	None CustomDepthStencilWriteMask; // 0x22d(0x01)
	None CustomDepthStencilValue; // 0x230(0x04)
	None CustomPrimitiveData; // 0x238(0x10)
	None CustomPrimitiveDataInternal; // 0x248(0x10)
	None TranslucencySortPriority; // 0x260(0x04)
	None VisibilityId; // 0x264(0x04)
	None RuntimeVirtualTextures; // 0x268(0x10)
	None VirtualTextureLodBias; // 0x278(0x01)
	None VirtualTextureCullMips; // 0x279(0x01)
	None VirtualTextureMinCoverage; // 0x27a(0x01)
	None VirtualTextureRenderPassType; // 0x27b(0x01)
	None LpvBiasMultiplier; // 0x280(0x04)
	None OutlineThicknessMultiplier; // 0x284(0x04)
	None OutlineColor; // 0x288(0x10)
	None OutlineZFadeMin; // 0x298(0x04)
	None OutlineZFadeMax; // 0x29c(0x04)
	None BoundsScale; // 0x2a8(0x04)
	None MoveIgnoreActors; // 0x2b8(0x10)
	None MoveIgnoreComponents; // 0x2c8(0x10)
	None BodyInstance; // 0x2e8(0x110)
	None OnComponentHit; // 0x3f8(0x01)
	None OnComponentBeginOverlap; // 0x3f9(0x01)
	None OnComponentEndOverlap; // 0x3fa(0x01)
	None OnComponentWake; // 0x3fb(0x01)
	None OnComponentSleep; // 0x3fc(0x01)
	None OnBeginCursorOver; // 0x3fe(0x01)
	None OnEndCursorOver; // 0x3ff(0x01)
	None OnClicked; // 0x400(0x01)
	None OnReleased; // 0x401(0x01)
	None OnInputTouchBegin; // 0x402(0x01)
	None OnInputTouchEnd; // 0x403(0x01)
	None OnInputTouchEnter; // 0x404(0x01)
	None OnInputTouchLeave; // 0x405(0x01)
	None LODParentPrimitive; // 0x420(0x08)
	None CustomFOV; // 0x428(0x04)
	None OverrideMaterials; // 0x430(0x10)
	None bEnableMaterialParameterCaching; // 0x450(0x01)
	None SkeletalMesh; // 0x458(0x08)
	None MasterPoseComponent; // 0x460(0x08)
	None SkinCacheUsage; // 0x468(0x10)
	None bSuppressSocketByNameWarnings; // 0x548(0x01)
	None PhysicsAssetOverride; // 0x578(0x08)
	None ForcedLodModel; // 0x580(0x04)
	None MinLodModel; // 0x584(0x04)
	None StreamingDistanceMultiplier; // 0x590(0x04)
	None LODInfo; // 0x5a0(0x10)
	None VisibilityBasedAnimTickOption; // 0x5d4(0x01)
	None bOverrideMinLod; // 0x5d6(0x01)
	None bUseBoundsFromMasterPoseComponent; // 0x5d6(0x01)
	None bForceWireframe; // 0x5d6(0x01)
	None bDisplayBones; // 0x5d6(0x01)
	None bDisableMorphTarget; // 0x5d6(0x01)
	None bHideSkin; // 0x5d6(0x01)
	None bPerBoneMotionBlur; // 0x5d7(0x01)
	None bComponentUseFixedSkelBounds; // 0x5d7(0x01)
	None bConsiderAllBodiesForBounds; // 0x5d7(0x01)
	None bSyncAttachParentLOD; // 0x5d7(0x01)
	None bCanHighlightSelectedSections; // 0x5d7(0x01)
	None bRecentlyRendered; // 0x5d7(0x01)
	None bCastCapsuleDirectShadow; // 0x5d7(0x01)
	None bCastCapsuleIndirectShadow; // 0x5d7(0x01)
	None bCPUSkinning; // 0x5d8(0x01)
	None bEnableUpdateRateOptimizations; // 0x5d8(0x01)
	None bDisplayDebugUpdateRateOptimizations; // 0x5d8(0x01)
	None bRenderStatic; // 0x5d8(0x01)
	None bIgnoreMasterPoseComponentLOD; // 0x5d8(0x01)
	None bCachedLocalBoundsUpToDate; // 0x5d8(0x01)
	None bForceMeshObjectUpdate; // 0x5d9(0x01)
	None CapsuleIndirectShadowMinVisibility; // 0x5dc(0x04)
	None CachedWorldSpaceBounds; // 0x5f0(0x1c)
	None CachedWorldToLocalTransform; // 0x610(0x40)
	None ForceMipLevelsToBeResidentTimestamp; // 0x28(0x08)
	None NumCinematicMipLevels; // 0x30(0x04)
	None StreamingIndex; // 0x34(0x04)
	None CachedCombinedLODBias; // 0x38(0x04)
	None CachedNumResidentLODs; // 0x3c(0x01)
	None bCachedReadyForStreaming; // 0x3d(0x01)
	None NeverStream; // 0x3d(0x01)
	None bGlobalForceMipLevelsToBeResident; // 0x3d(0x01)
	None bIsStreamable; // 0x3d(0x01)
	None bHasStreamingUpdatePending; // 0x3d(0x01)
	None bForceMiplevelsToBeResident; // 0x3d(0x01)
	None bIgnoreStreamingMipBias; // 0x3d(0x01)
	None bUseCinematicMipLevels; // 0x3d(0x01)
	None Skeleton; // 0x60(0x08)
	None ImportedBounds; // 0x68(0x1c)
	None ExtendedBounds; // 0x84(0x1c)
	None PositiveBoundsExtension; // 0xa0(0x0c)
	None NegativeBoundsExtension; // 0xac(0x0c)
	None Materials; // 0xb8(0x10)
	None SkelMirrorTable; // 0xc8(0x10)
	None LODInfo; // 0xd8(0x10)
	None MinLOD; // 0x138(0x04)
	None MaxLod; // 0x13c(0x04)
	None DisableBelowMinLodStripping; // 0x140(0x01)
	None SkelMirrorAxis; // 0x141(0x01)
	None SkelMirrorFlipAxis; // 0x142(0x01)
	None bWillNeverMergeMesh; // 0x143(0x01)
	None bUseFullPrecisionUVs; // 0x143(0x01)
	None bUseHighPrecisionTangentBasis; // 0x143(0x01)
	None bSmoothNormalsInVertexColor; // 0x143(0x01)
	None bVertexCurvature; // 0x143(0x01)
	None bHasBeenSimplified; // 0x143(0x01)
	None bHasVertexColors; // 0x143(0x01)
	None bEnablePerPolyCollision; // 0x144(0x01)
	None BodySetup; // 0x148(0x08)
	None PhysicsAsset; // 0x150(0x08)
	None ShadowPhysicsAsset; // 0x158(0x08)
	None NodeMappingData; // 0x160(0x10)
	None MorphTargets; // 0x170(0x10)
	None PostProcessAnimBlueprint; // 0x2f8(0x08)
	None MeshClothingAssets; // 0x300(0x10)
	None SamplingInfo; // 0x310(0x30)
	None AssetUserData; // 0x340(0x10)
	None Sockets; // 0x358(0x10)
	None SkinWeightProfiles; // 0x378(0x10)
	None TinyFont; // 0x30(0x08)
	None TinyFontName; // 0x38(0x18)
	None SmallFont; // 0x50(0x08)
	None SmallFontName; // 0x58(0x18)
	None MediumFont; // 0x70(0x08)
	None MediumFontName; // 0x78(0x18)
	None LargeFont; // 0x90(0x08)
	None LargeFontName; // 0x98(0x18)
	None SubtitleFont; // 0xb0(0x08)
	None SubtitleFontName; // 0xb8(0x18)
	None AdditionalFonts; // 0xd0(0x10)
	None AdditionalFontNames; // 0xe8(0x10)
	None ConsoleClass; // 0xf8(0x08)
	None ShippingConsoleClass; // 0x100(0x08)
	None ConsoleClassName; // 0x108(0x18)
	None ShippingConsoleClassName; // 0x120(0x18)
	None GameViewportClientClass; // 0x138(0x08)
	None GameViewportClientClassName; // 0x140(0x18)
	None LocalPlayerClass; // 0x158(0x08)
	None LocalPlayerClassName; // 0x160(0x18)
	None WorldSettingsClass; // 0x178(0x08)
	None WorldSettingsClassName; // 0x180(0x18)
	None NavigationSystemClassName; // 0x198(0x18)
	None NavigationSystemClass; // 0x1b0(0x08)
	None NavigationSystemConfigClassName; // 0x1b8(0x18)
	None NavigationSystemConfigClass; // 0x1d0(0x08)
	None AvoidanceManagerClassName; // 0x1d8(0x18)
	None AvoidanceManagerClass; // 0x1f0(0x08)
	None PhysicsCollisionHandlerClass; // 0x1f8(0x08)
	None PhysicsCollisionHandlerClassName; // 0x200(0x18)
	None GameUserSettingsClassName; // 0x218(0x18)
	None GameUserSettingsClass; // 0x230(0x08)
	None AIControllerClassName; // 0x238(0x18)
	None GameUserSettings; // 0x250(0x08)
	None LevelScriptActorClass; // 0x258(0x08)
	None LevelScriptActorClassName; // 0x260(0x18)
	None DefaultBlueprintBaseClassName; // 0x278(0x18)
	None GameSingletonClassName; // 0x290(0x18)
	None GameSingleton; // 0x2a8(0x08)
	None AssetManagerClassName; // 0x2b0(0x18)
	None AssetManager; // 0x2c8(0x08)
	None DefaultTexture; // 0x2d0(0x08)
	None DefaultTextureName; // 0x2d8(0x18)
	None DefaultDiffuseTexture; // 0x2f0(0x08)
	None DefaultDiffuseTextureName; // 0x2f8(0x18)
	None DefaultBSPVertexTexture; // 0x310(0x08)
	None DefaultBSPVertexTextureName; // 0x318(0x18)
	None HighFrequencyNoiseTexture; // 0x330(0x08)
	None HighFrequencyNoiseTextureName; // 0x338(0x18)
	None DefaultBokehTexture; // 0x350(0x08)
	None DefaultBokehTextureName; // 0x358(0x18)
	None DefaultBloomKernelTexture; // 0x370(0x08)
	None DefaultBloomKernelTextureName; // 0x378(0x18)
	None WireframeMaterial; // 0x390(0x08)
	None WireframeMaterialName; // 0x398(0x10)
	None DebugMeshMaterial; // 0x3a8(0x08)
	None DebugMeshMaterialName; // 0x3b0(0x18)
	None EmissiveMeshMaterial; // 0x3c8(0x08)
	None EmissiveMeshMaterialName; // 0x3d0(0x18)
	None LevelColorationLitMaterial; // 0x3e8(0x08)
	None LevelColorationLitMaterialName; // 0x3f0(0x10)
	None LevelColorationUnlitMaterial; // 0x400(0x08)
	None LevelColorationUnlitMaterialName; // 0x408(0x10)
	None LightingTexelDensityMaterial; // 0x418(0x08)
	None WorldNormalsMaterialName; // 0x420(0x10)
	None WorldNormalsMaterial; // 0x430(0x08)
	None LightingTexelDensityName; // 0x438(0x10)
	None ShadedLevelColorationLitMaterial; // 0x448(0x08)
	None ShadedLevelColorationLitMaterialName; // 0x450(0x10)
	None ShadedLevelColorationUnlitMaterial; // 0x460(0x08)
	None ShadedLevelColorationUnlitMaterialName; // 0x468(0x10)
	None RemoveSurfaceMaterial; // 0x478(0x08)
	None RemoveSurfaceMaterialName; // 0x480(0x18)
	None VertexColorMaterial; // 0x498(0x08)
	None VertexColorMaterialName; // 0x4a0(0x10)
	None VertexColorViewModeMaterial_ColorOnly; // 0x4b0(0x08)
	None VertexColorViewModeMaterialName_ColorOnly; // 0x4b8(0x10)
	None VertexColorViewModeMaterial_AlphaAsColor; // 0x4c8(0x08)
	None VertexColorViewModeMaterialName_AlphaAsColor; // 0x4d0(0x10)
	None VertexColorViewModeMaterial_RedOnly; // 0x4e0(0x08)
	None VertexColorViewModeMaterialName_RedOnly; // 0x4e8(0x10)
	None VertexColorViewModeMaterial_GreenOnly; // 0x4f8(0x08)
	None VertexColorViewModeMaterialName_GreenOnly; // 0x500(0x10)
	None VertexColorViewModeMaterial_BlueOnly; // 0x510(0x08)
	None VertexColorViewModeMaterialName_BlueOnly; // 0x518(0x10)
	None DebugEditorMaterialName; // 0x528(0x18)
	None ConstraintLimitMaterial; // 0x540(0x08)
	None ConstraintLimitMaterialX; // 0x548(0x08)
	None ConstraintLimitMaterialXAxis; // 0x550(0x08)
	None ConstraintLimitMaterialY; // 0x558(0x08)
	None ConstraintLimitMaterialYAxis; // 0x560(0x08)
	None ConstraintLimitMaterialZ; // 0x568(0x08)
	None ConstraintLimitMaterialZAxis; // 0x570(0x08)
	None ConstraintLimitMaterialPrismatic; // 0x578(0x08)
	None InvalidLightmapSettingsMaterial; // 0x580(0x08)
	None InvalidLightmapSettingsMaterialName; // 0x588(0x18)
	None PreviewShadowsIndicatorMaterial; // 0x5a0(0x08)
	None PreviewShadowsIndicatorMaterialName; // 0x5a8(0x18)
	None ArrowMaterial; // 0x5c0(0x08)
	None ArrowMaterialYellow; // 0x5c8(0x08)
	None ArrowMaterialName; // 0x5d0(0x18)
	None LightingOnlyBrightness; // 0x5e8(0x10)
	None ShaderComplexityColors; // 0x5f8(0x10)
	None QuadComplexityColors; // 0x608(0x10)
	None LightComplexityColors; // 0x618(0x10)
	None StationaryLightOverlapColors; // 0x628(0x10)
	None LODColorationColors; // 0x638(0x10)
	None HLODColorationColors; // 0x648(0x10)
	None StreamingAccuracyColors; // 0x658(0x10)
	None MaxPixelShaderAdditiveComplexityCount; // 0x668(0x04)
	None MaxES3PixelShaderAdditiveComplexityCount; // 0x66c(0x04)
	None MinLightMapDensity; // 0x670(0x04)
	None IdealLightMapDensity; // 0x674(0x04)
	None MaxLightMapDensity; // 0x678(0x04)
	None bRenderLightMapDensityGrayscale; // 0x67c(0x01)
	None RenderLightMapDensityGrayscaleScale; // 0x680(0x04)
	None RenderLightMapDensityColorScale; // 0x684(0x04)
	None LightMapDensityVertexMappedColor; // 0x688(0x10)
	None LightMapDensitySelectedColor; // 0x698(0x10)
	None StatColorMappings; // 0x6a8(0x10)
	None DefaultPhysMaterial; // 0x6b8(0x08)
	None DefaultPhysMaterialName; // 0x6c0(0x18)
	None ActiveGameNameRedirects; // 0x6d8(0x10)
	None ActiveClassRedirects; // 0x6e8(0x10)
	None ActivePluginRedirects; // 0x6f8(0x10)
	None ActiveStructRedirects; // 0x708(0x10)
	None PreIntegratedSkinBRDFTexture; // 0x718(0x08)
	None PreIntegratedSkinBRDFTextureName; // 0x720(0x18)
	None HirezPreIntegratedSkinBRDFTexture; // 0x738(0x08)
	None HirezPreIntegratedSkinBRDFTextureName; // 0x740(0x18)
	None HirezPreIntegratedShadowTexture; // 0x758(0x08)
	None HirezPreIntegratedShadowTextureName; // 0x760(0x18)
	None BlueNoiseTexture; // 0x778(0x08)
	None BlueNoiseTextureName; // 0x780(0x18)
	None MiniFontTexture; // 0x798(0x08)
	None MiniFontTextureName; // 0x7a0(0x18)
	None WeightMapPlaceholderTexture; // 0x7b8(0x08)
	None WeightMapPlaceholderTextureName; // 0x7c0(0x18)
	None LightMapDensityTexture; // 0x7d8(0x08)
	None LightMapDensityTextureName; // 0x7e0(0x18)
	None GameViewport; // 0x800(0x08)
	None DeferredCommands; // 0x808(0x10)
	None TickCycles; // 0x818(0x04)
	None GameCycles; // 0x81c(0x04)
	None ClientCycles; // 0x820(0x04)
	None NearClipPlane; // 0x824(0x04)
	None bStreamTexturesDuringLoadScreen; // 0x828(0x01)
	None bHardwareSurveyEnabled; // 0x828(0x01)
	None bSubtitlesEnabled; // 0x828(0x01)
	None bSubtitlesForcedOff; // 0x828(0x01)
	None MaximumLoopIterationCount; // 0x82c(0x04)
	None bCanBlueprintsTickByDefault; // 0x830(0x01)
	None bOptimizeAnimBlueprintMemberVariableAccess; // 0x830(0x01)
	None bAllowMultiThreadedAnimationUpdate; // 0x830(0x01)
	None bEnableEditorPSysRealtimeLOD; // 0x830(0x01)
	None bSmoothFrameRate; // 0x830(0x01)
	None bUseFixedFrameRate; // 0x830(0x01)
	None FixedFrameRate; // 0x834(0x04)
	None SmoothedFrameRateRange; // 0x838(0x10)
	None CustomTimeStep; // 0x848(0x08)
	None CustomTimeStepClassName; // 0x870(0x18)
	None TimecodeProvider; // 0x888(0x08)
	None TimecodeProviderClassName; // 0x8b0(0x18)
	None bGenerateDefaultTimecode; // 0x8c8(0x01)
	None GenerateDefaultTimecodeFrameRate; // 0x8cc(0x08)
	None GenerateDefaultTimecodeFrameDelay; // 0x8d4(0x04)
	None bCheckForMultiplePawnsSpawnedInAFrame; // 0x8d8(0x01)
	None NumPawnsAllowedToBeSpawnedInAFrame; // 0x8dc(0x04)
	None bShouldGenerateLowQualityLightmaps; // 0x8e0(0x01)
	None C_WorldBox; // 0x8e4(0x04)
	None C_BrushWire; // 0x8e8(0x04)
	None C_AddWire; // 0x8ec(0x04)
	None C_SubtractWire; // 0x8f0(0x04)
	None C_SemiSolidWire; // 0x8f4(0x04)
	None C_NonSolidWire; // 0x8f8(0x04)
	None C_WireBackground; // 0x8fc(0x04)
	None C_ScaleBoxHi; // 0x900(0x04)
	None C_VolumeCollision; // 0x904(0x04)
	None C_BSPCollision; // 0x908(0x04)
	None C_OrthoBackground; // 0x90c(0x04)
	None C_Volume; // 0x910(0x04)
	None C_BrushShape; // 0x914(0x04)
	None StreamingDistanceFactor; // 0x918(0x04)
	None GameScreenshotSaveDirectory; // 0x920(0x10)
	None TransitionType; // 0x930(0x01)
	None TransitionDescription; // 0x938(0x10)
	None TransitionGameMode; // 0x948(0x10)
	None MeshLODRange; // 0x958(0x04)
	None bAllowMatureLanguage; // 0x95c(0x01)
	None CameraRotationThreshold; // 0x960(0x04)
	None CameraTranslationThreshold; // 0x964(0x04)
	None PrimitiveProbablyVisibleTime; // 0x968(0x04)
	None MaxOcclusionPixelsFraction; // 0x96c(0x04)
	None bPauseOnLossOfFocus; // 0x970(0x01)
	None MaxParticleResize; // 0x974(0x04)
	None MaxParticleResizeWarn; // 0x978(0x04)
	None PendingDroppedNotes; // 0x980(0x10)
	None NetClientTicksPerSecond; // 0x990(0x04)
	None DisplayGamma; // 0x994(0x04)
	None MinDesiredFrameRate; // 0x998(0x04)
	None DefaultSelectedMaterialColor; // 0x99c(0x10)
	None SelectedMaterialColor; // 0x9ac(0x10)
	None SelectionOutlineColor; // 0x9bc(0x10)
	None SubduedSelectionOutlineColor; // 0x9cc(0x10)
	None SelectedMaterialColorOverride; // 0x9dc(0x10)
	None bIsOverridingSelectedColor; // 0x9ec(0x01)
	None bEnableOnScreenDebugMessages; // 0x9f0(0x01)
	None bEnableOnScreenDebugMessagesDisplay; // 0x9f0(0x01)
	None bSuppressMapWarnings; // 0x9f0(0x01)
	None bDisableAILogging; // 0x9f0(0x01)
	None bEnableVisualLogRecordingOnStart; // 0x9f4(0x04)
	None ScreenSaverInhibitorSemaphore; // 0x9fc(0x04)
	None bLockReadOnlyLevels; // 0xa00(0x01)
	None ParticleEventManagerClassPath; // 0xa08(0x10)
	None SelectionHighlightIntensity; // 0xa18(0x04)
	None BSPSelectionHighlightIntensity; // 0xa1c(0x04)
	None SelectionHighlightIntensityBillboards; // 0xa20(0x04)
	None NetDriverDefinitions; // 0xc70(0x10)
	None ServerActors; // 0xc80(0x10)
	None RuntimeServerActors; // 0xc90(0x10)
	None NetErrorLogInterval; // 0xca0(0x04)
	None bStartedLoadMapMovie; // 0xca4(0x01)
	None NextWorldContextHandle; // 0xcc0(0x04)
	None MaxDeltaTime; // 0xe58(0x04)
	None ServerFlushLogInterval; // 0xe5c(0x04)
	None GameInstance; // 0xe60(0x08)
	None PlayerController; // 0x30(0x08)
	None CurrentNetSpeed; // 0x38(0x04)
	None ConfiguredInternetSpeed; // 0x3c(0x04)
	None ConfiguredLanSpeed; // 0x40(0x04)
	None Children; // 0x48(0x10)
	None Driver; // 0x58(0x08)
	None PackageMapClass; // 0x60(0x08)
	None PackageMap; // 0x68(0x08)
	None OpenChannels; // 0x70(0x10)
	None SentTemporaries; // 0x80(0x10)
	None ViewTarget; // 0x90(0x08)
	None OwningActor; // 0x98(0x08)
	None MaxPacket; // 0xa0(0x04)
	None InternalAck; // 0xa4(0x01)
	None PlayerId; // 0x160(0x28)
	None LastReceiveTime; // 0x1d0(0x08)
	None ChannelsToTick; // 0x1510(0x10)
	None ViewportClient; // 0x70(0x08)
	None AspectRatioAxisConstraint; // 0x94(0x01)
	None PendingLevelPlayerControllerClass; // 0x98(0x08)
	None bSentSplitJoin; // 0xa0(0x01)
	None ControllerId; // 0xb8(0x04)
	None FrameDelay; // 0x28(0x04)
	None NetConnectionClassName; // 0x30(0x10)
	None ReplicationDriverClassName; // 0x40(0x10)
	None MaxDownloadSize; // 0x50(0x04)
	None bClampListenServerTickRate; // 0x54(0x01)
	None NetServerMaxTickRate; // 0x58(0x04)
	None MaxNetTickRate; // 0x5c(0x04)
	None MaxInternetClientRate; // 0x60(0x04)
	None MaxClientRate; // 0x64(0x04)
	None ServerTravelPause; // 0x68(0x04)
	None SpawnPrioritySeconds; // 0x6c(0x04)
	None RelevantTimeout; // 0x70(0x04)
	None KeepAliveTime; // 0x74(0x04)
	None HandshakeTimeout; // 0x78(0x04)
	None InitialConnectTimeout; // 0x7c(0x04)
	None ConnectionTimeout; // 0x80(0x04)
	None TimeoutMultiplierForUnoptimizedBuilds; // 0x84(0x04)
	None bNoTimeouts; // 0x88(0x01)
	None bNeverApplyNetworkEmulationSettings; // 0x89(0x01)
	None ServerConnection; // 0x90(0x08)
	None ClientConnections; // 0x98(0x10)
	None RecentlyDisconnectedTrackingTime; // 0x108(0x04)
	None World; // 0x148(0x08)
	None WorldPackage; // 0x150(0x08)
	None NetConnectionClass; // 0x178(0x08)
	None ReplicationDriverClass; // 0x180(0x08)
	None NetDriverName; // 0x198(0x08)
	None ChannelDefinitions; // 0x1a0(0x10)
	None ChannelDefinitionMap; // 0x1b0(0x50)
	None ThrottleSpawnDefinitions; // 0x200(0x10)
	None ThrottleSpawnsRemaining; // 0x210(0x10)
	None ThrottleSpawnPausedFrameNumber; // 0x220(0x04)
	None ActorChannelPool; // 0x228(0x10)
	None Time; // 0x240(0x04)
	None ReplicationDriver; // 0x718(0x08)
	None bCanBeBaked; // 0x30(0x01)
	None bIsDirty; // 0x30(0x01)
	None bBakedDataSuccesfully; // 0x30(0x01)
	None bUseControllerRotationPitch; // 0x228(0x01)
	None bUseControllerRotationYaw; // 0x228(0x01)
	None bUseControllerRotationRoll; // 0x228(0x01)
	None bCanAffectNavigationGeneration; // 0x228(0x01)
	None BaseEyeHeight; // 0x22c(0x04)
	None AutoPossessPlayer; // 0x230(0x01)
	None AutoPossessAI; // 0x231(0x01)
	None RemoteViewPitch; // 0x232(0x01)
	None AIControllerClass; // 0x238(0x08)
	None PlayerState; // 0x240(0x08)
	None LastHitBy; // 0x250(0x08)
	None Controller; // 0x258(0x08)
	None ControlInputVector; // 0x264(0x0c)
	None LastControlInputVector; // 0x270(0x0c)
	None Mesh; // 0x280(0x08)
	None CharacterMovement; // 0x288(0x08)
	None CapsuleComponent; // 0x290(0x08)
	None BasedMovement; // 0x298(0x30)
	None ReplicatedBasedMovement; // 0x2c8(0x30)
	None AnimRootMotionTranslationScale; // 0x2f8(0x04)
	None BaseTranslationOffset; // 0x2fc(0x0c)
	None BaseRotationOffset; // 0x310(0x10)
	None ReplicatedServerLastTransformUpdateTimeStamp; // 0x320(0x04)
	None ReplayLastTransformUpdateTimeStamp; // 0x324(0x04)
	None ReplicatedMovementMode; // 0x328(0x01)
	None bInBaseReplication; // 0x329(0x01)
	None CrouchedEyeHeight; // 0x32c(0x04)
	None bIsCrouched; // 0x330(0x01)
	None bProxyIsJumpForceApplied; // 0x330(0x01)
	None bPressedJump; // 0x330(0x01)
	None bClientUpdating; // 0x330(0x01)
	None bClientWasFalling; // 0x330(0x01)
	None bClientResimulateRootMotion; // 0x330(0x01)
	None bClientResimulateRootMotionSources; // 0x330(0x01)
	None bSimGravityDisabled; // 0x330(0x01)
	None bClientCheckEncroachmentOnNetUpdate; // 0x331(0x01)
	None bServerMoveIgnoreRootMotion; // 0x331(0x01)
	None bWasJumping; // 0x331(0x01)
	None JumpKeyHoldTime; // 0x334(0x04)
	None JumpForceTimeRemaining; // 0x338(0x04)
	None ProxyJumpForceStartedTime; // 0x33c(0x04)
	None JumpMaxHoldTime; // 0x340(0x04)
	None JumpMaxCount; // 0x344(0x04)
	None JumpCurrentCount; // 0x348(0x04)
	None JumpCurrentCountPreJump; // 0x34c(0x04)
	None OnReachedJumpApex; // 0x358(0x10)
	None MovementModeChangedDelegate; // 0x378(0x10)
	None OnCharacterMovementUpdated; // 0x388(0x10)
	None SavedRootMotion; // 0x398(0x38)
	None ClientRootMotionParams; // 0x3d0(0x40)
	None RootMotionRepMoves; // 0x410(0x10)
	None RepRootMotion; // 0x420(0x98)
	None UpdatedComponent; // 0xb0(0x08)
	None UpdatedPrimitive; // 0xb8(0x08)
	None Velocity; // 0xc4(0x0c)
	None PlaneConstraintNormal; // 0xd0(0x0c)
	None PlaneConstraintOrigin; // 0xdc(0x0c)
	None bUpdateOnlyIfRendered; // 0xe8(0x01)
	None bAutoUpdateTickRegistration; // 0xe8(0x01)
	None bTickBeforeOwner; // 0xe8(0x01)
	None bAutoRegisterUpdatedComponent; // 0xe8(0x01)
	None bConstrainToPlane; // 0xe8(0x01)
	None bSnapToPlaneAtStart; // 0xe8(0x01)
	None bAutoRegisterPhysicsVolumeUpdates; // 0xe8(0x01)
	None bComponentShouldUpdatePhysicsVolume; // 0xe8(0x01)
	None PlaneConstraintAxisSetting; // 0xeb(0x01)
	None NavAgentProps; // 0xf0(0x30)
	None FixedPathBrakingDistance; // 0x120(0x04)
	None bUpdateNavAgentWithOwnersCollision; // 0x124(0x01)
	None bUseAccelerationForPaths; // 0x124(0x01)
	None bUseFixedBrakingDistanceForPaths; // 0x124(0x01)
	None MovementState; // 0x125(0x01)
	None PathFollowingComp; // 0x128(0x08)
	None PawnOwner; // 0x130(0x08)
	None CharacterOwner; // 0x148(0x08)
	None GravityScale; // 0x150(0x04)
	None MaxStepHeight; // 0x154(0x04)
	None JumpZVelocity; // 0x158(0x04)
	None JumpOffJumpZFactor; // 0x15c(0x04)
	None WalkableFloorAngle; // 0x160(0x04)
	None WalkableFloorZ; // 0x164(0x04)
	None MovementMode; // 0x168(0x01)
	None CustomMovementMode; // 0x169(0x01)
	None NetworkSmoothingMode; // 0x16a(0x01)
	None GroundFriction; // 0x16c(0x04)
	None MaxWalkSpeed; // 0x18c(0x04)
	None MaxWalkSpeedCrouched; // 0x190(0x04)
	None MaxSwimSpeed; // 0x194(0x04)
	None MaxFlySpeed; // 0x198(0x04)
	None MaxCustomMovementSpeed; // 0x19c(0x04)
	None MaxAcceleration; // 0x1a0(0x04)
	None MinAnalogWalkSpeed; // 0x1a4(0x04)
	None BrakingFrictionFactor; // 0x1a8(0x04)
	None BrakingFriction; // 0x1ac(0x04)
	None BrakingSubStepTime; // 0x1b0(0x04)
	None BrakingDecelerationWalking; // 0x1b4(0x04)
	None BrakingDecelerationFalling; // 0x1b8(0x04)
	None BrakingDecelerationSwimming; // 0x1bc(0x04)
	None BrakingDecelerationFlying; // 0x1c0(0x04)
	None AirControl; // 0x1c4(0x04)
	None AirControlBoostMultiplier; // 0x1c8(0x04)
	None AirControlBoostVelocityThreshold; // 0x1cc(0x04)
	None FallingLateralFriction; // 0x1d0(0x04)
	None CrouchedHalfHeight; // 0x1d4(0x04)
	None Buoyancy; // 0x1d8(0x04)
	None PerchRadiusThreshold; // 0x1dc(0x04)
	None PerchAdditionalHeight; // 0x1e0(0x04)
	None RotationRate; // 0x1e4(0x0c)
	None bUseSeparateBrakingFriction; // 0x1f0(0x01)
	None bApplyGravityWhileJumping; // 0x1f0(0x01)
	None bUseControllerDesiredRotation; // 0x1f0(0x01)
	None bOrientRotationToMovement; // 0x1f0(0x01)
	None bSweepWhileNavWalking; // 0x1f0(0x01)
	None bMovementInProgress; // 0x1f0(0x01)
	None bEnableScopedMovementUpdates; // 0x1f0(0x01)
	None bEnableServerDualMoveScopedMovementUpdates; // 0x1f1(0x01)
	None bForceMaxAccel; // 0x1f1(0x01)
	None bRunPhysicsWithNoController; // 0x1f1(0x01)
	None bForceNextFloorCheck; // 0x1f1(0x01)
	None bShrinkProxyCapsule; // 0x1f1(0x01)
	None bCanWalkOffLedges; // 0x1f1(0x01)
	None bCanWalkOffLedgesWhenCrouching; // 0x1f1(0x01)
	None bNetworkSkipProxyPredictionOnNetUpdate; // 0x1f2(0x01)
	None bNetworkAlwaysReplicateTransformUpdateTimestamp; // 0x1f2(0x01)
	None bDeferUpdateMoveComponent; // 0x1f2(0x01)
	None bPreventMeshDoubleMode; // 0x1f2(0x01)
	None bEnablePhysicsInteraction; // 0x1f2(0x01)
	None bTouchForceScaledToMass; // 0x1f2(0x01)
	None bPushForceScaledToMass; // 0x1f2(0x01)
	None bPushForceUsingZOffset; // 0x1f3(0x01)
	None bScalePushForceToVelocity; // 0x1f3(0x01)
	None DeferredUpdatedMoveComponent; // 0x1f8(0x08)
	None MaxOutOfWaterStepHeight; // 0x200(0x04)
	None OutofWaterZ; // 0x204(0x04)
	None Mass; // 0x208(0x04)
	None StandingDownwardForceScale; // 0x20c(0x04)
	None InitialPushForceFactor; // 0x210(0x04)
	None PushForceFactor; // 0x214(0x04)
	None PushForcePointZOffsetFactor; // 0x218(0x04)
	None TouchForceFactor; // 0x21c(0x04)
	None MinTouchForce; // 0x220(0x04)
	None MaxTouchForce; // 0x224(0x04)
	None RepulsionForce; // 0x228(0x04)
	None Acceleration; // 0x22c(0x0c)
	None LastUpdateRotation; // 0x240(0x10)
	None LastUpdateLocation; // 0x250(0x0c)
	None LastUpdateVelocity; // 0x25c(0x0c)
	None bHasQueuedServerMove; // 0x268(0x01)
	None QueuedServerLocation; // 0x26c(0x0c)
	None QueuedServerRotation; // 0x280(0x10)
	None ParallelUpdateMoveMode; // 0x298(0x01)
	None ParallelUpdateTransform; // 0x2a0(0x30)
	None ServerLastTransformUpdateTimeStamp; // 0x2d0(0x04)
	None ServerLastClientGoodMoveAckTime; // 0x2d4(0x04)
	None ServerLastClientAdjustmentTime; // 0x2d8(0x04)
	None PendingImpulseToApply; // 0x2dc(0x0c)
	None PendingForceToApply; // 0x2e8(0x0c)
	None AnalogInputModifier; // 0x2f4(0x04)
	None MaxSimulationTimeStep; // 0x304(0x04)
	None MaxSimulationIterations; // 0x308(0x04)
	None MaxJumpApexAttemptsPerSimulation; // 0x30c(0x04)
	None MaxDepenetrationWithGeometry; // 0x310(0x04)
	None MaxDepenetrationWithGeometryAsProxy; // 0x314(0x04)
	None MaxDepenetrationWithPawn; // 0x318(0x04)
	None MaxDepenetrationWithPawnAsProxy; // 0x31c(0x04)
	None NetworkSimulatedSmoothLocationTime; // 0x320(0x04)
	None NetworkSimulatedSmoothRotationTime; // 0x324(0x04)
	None ListenServerNetworkSimulatedSmoothLocationTime; // 0x328(0x04)
	None ListenServerNetworkSimulatedSmoothRotationTime; // 0x32c(0x04)
	None NetProxyShrinkRadius; // 0x330(0x04)
	None NetProxyShrinkHalfHeight; // 0x334(0x04)
	None NetworkMaxSmoothUpdateDistance; // 0x338(0x04)
	None NetworkNoSmoothUpdateDistance; // 0x33c(0x04)
	None NetworkMinTimeBetweenClientAckGoodMoves; // 0x340(0x04)
	None NetworkMinTimeBetweenClientAdjustments; // 0x344(0x04)
	None NetworkMinTimeBetweenClientAdjustmentsLargeCorrection; // 0x348(0x04)
	None NetworkLargeClientCorrectionDistance; // 0x34c(0x04)
	None LedgeCheckThreshold; // 0x350(0x04)
	None JumpOutOfWaterPitch; // 0x354(0x04)
	None CurrentFloor; // 0x358(0x94)
	None DefaultLandMovementMode; // 0x3ec(0x01)
	None DefaultWaterMovementMode; // 0x3ed(0x01)
	None GroundMovementMode; // 0x3ee(0x01)
	None bMaintainHorizontalGroundVelocity; // 0x3ef(0x01)
	None bImpartBaseVelocityX; // 0x3ef(0x01)
	None bImpartBaseVelocityY; // 0x3ef(0x01)
	None bImpartBaseVelocityZ; // 0x3ef(0x01)
	None bImpartBaseAngularVelocity; // 0x3ef(0x01)
	None bJustTeleported; // 0x3ef(0x01)
	None bNetworkUpdateReceived; // 0x3ef(0x01)
	None bNetworkMovementModeChanged; // 0x3ef(0x01)
	None bIgnoreClientMovementErrorChecksAndCorrection; // 0x3f0(0x01)
	None bServerAcceptClientAuthoritativePosition; // 0x3f0(0x01)
	None bNotifyApex; // 0x3f0(0x01)
	None bCheatFlying; // 0x3f0(0x01)
	None bWantsToCrouch; // 0x3f0(0x01)
	None bCrouchMaintainsBaseLocation; // 0x3f0(0x01)
	None bIgnoreBaseRotation; // 0x3f0(0x01)
	None bFastAttachedMove; // 0x3f0(0x01)
	None bAlwaysCheckFloor; // 0x3f1(0x01)
	None bUseFlatBaseForFloorChecks; // 0x3f1(0x01)
	None bPerformingJumpOff; // 0x3f1(0x01)
	None bWantsToLeaveNavWalking; // 0x3f1(0x01)
	None bUseRVOAvoidance; // 0x3f1(0x01)
	None bRequestedMoveUseAcceleration; // 0x3f1(0x01)
	None bWasSimulatingRootMotion; // 0x3f1(0x01)
	None bAllowPhysicsRotationDuringAnimRootMotion; // 0x3f2(0x01)
	None bHasRequestedVelocity; // 0x3f2(0x01)
	None bRequestedMoveWithMaxSpeed; // 0x3f2(0x01)
	None bWasAvoidanceUpdated; // 0x3f2(0x01)
	None bProjectNavMeshWalking; // 0x3f2(0x01)
	None bProjectNavMeshOnBothWorldChannels; // 0x3f2(0x01)
	None AvoidanceConsiderationRadius; // 0x408(0x04)
	None RequestedVelocity; // 0x40c(0x0c)
	None AvoidanceUID; // 0x418(0x04)
	None AvoidanceGroup; // 0x41c(0x04)
	None GroupsToAvoid; // 0x420(0x04)
	None GroupsToIgnore; // 0x424(0x04)
	None AvoidanceWeight; // 0x428(0x04)
	None PendingLaunchVelocity; // 0x42c(0x0c)
	None NavMeshProjectionInterval; // 0x4d8(0x04)
	None NavMeshProjectionTimer; // 0x4dc(0x04)
	None NavMeshProjectionInterpSpeed; // 0x4e0(0x04)
	None NavMeshProjectionHeightScaleUp; // 0x4e4(0x04)
	None NavMeshProjectionHeightScaleDown; // 0x4e8(0x04)
	None NavWalkingFloorDistTolerance; // 0x4ec(0x04)
	None PostPhysicsTickFunction; // 0x4f0(0x30)
	None MinTimeBetweenTimeStampResets; // 0x538(0x04)
	None CurrentRootMotion; // 0x540(0x38)
	None RootMotionParams; // 0x610(0x40)
	None AnimRootMotionVelocity; // 0x650(0x0c)
	None LocalPlayers; // 0x38(0x10)
	None OnlineSession; // 0x48(0x08)
	None ReferencedObjects; // 0x50(0x10)
	None OptionsString; // 0x220(0x10)
	None GameSessionClass; // 0x230(0x08)
	None GameStateClass; // 0x238(0x08)
	None PlayerControllerClass; // 0x240(0x08)
	None PlayerStateClass; // 0x248(0x08)
	None HUDClass; // 0x250(0x08)
	None DefaultPawnClass; // 0x258(0x08)
	None SpectatorClass; // 0x260(0x08)
	None ReplaySpectatorPlayerControllerClass; // 0x268(0x08)
	None ServerStatReplicatorClass; // 0x270(0x08)
	None GameSession; // 0x278(0x08)
	None GameState; // 0x280(0x08)
	None ServerStatReplicator; // 0x288(0x08)
	None DefaultPlayerName; // 0x290(0x18)
	None bUseSeamlessTravel; // 0x2a8(0x01)
	None bStartPlayersAsSpectators; // 0x2a8(0x01)
	None bPauseable; // 0x2a8(0x01)
	None MatchState; // 0x2c0(0x08)
	None bDelayedStart; // 0x2c8(0x01)
	None NumSpectators; // 0x2cc(0x04)
	None NumPlayers; // 0x2d0(0x04)
	None NumBots; // 0x2d4(0x04)
	None MinRespawnDelay; // 0x2d8(0x04)
	None NumTravellingPlayers; // 0x2dc(0x04)
	None EngineMessageClass; // 0x2e0(0x08)
	None InactivePlayerArray; // 0x2e8(0x10)
	None InactivePlayerStateLifeSpan; // 0x2f8(0x04)
	None MaxInactivePlayers; // 0x2fc(0x04)
	None bHandleDedicatedServerReplays; // 0x300(0x01)
	None GameModeClass; // 0x220(0x08)
	None AuthorityGameMode; // 0x228(0x08)
	None SpectatorClass; // 0x230(0x08)
	None PlayerArray; // 0x238(0x10)
	None bReplicatedHasBegunPlay; // 0x248(0x01)
	None ReplicatedWorldTimeSeconds; // 0x24c(0x04)
	None ServerWorldTimeSecondsDelta; // 0x250(0x04)
	None ServerWorldTimeSecondsUpdateFrequency; // 0x254(0x04)
	None MatchState; // 0x270(0x08)
	None PreviousMatchState; // 0x278(0x08)
	None ElapsedTime; // 0x280(0x04)
	None PlayerState; // 0x228(0x08)
	None OnInstigatedAnyDamage; // 0x238(0x10)
	None StateName; // 0x248(0x08)
	None Pawn; // 0x250(0x08)
	None Character; // 0x260(0x08)
	None TransformComponent; // 0x268(0x08)
	None ControlRotation; // 0x288(0x0c)
	None bAttachToPawn; // 0x294(0x01)
	None Player; // 0x298(0x08)
	None AcknowledgedPawn; // 0x2a0(0x08)
	None ControllingDirTrackInst; // 0x2a8(0x08)
	None MyHud; // 0x2b0(0x08)
	None PlayerCameraManager; // 0x2b8(0x08)
	None PlayerCameraManagerClass; // 0x2c0(0x08)
	None bAutoManageActiveCameraTarget; // 0x2c8(0x01)
	None TargetViewRotation; // 0x2cc(0x0c)
	None SmoothTargetViewRotationSpeed; // 0x2e4(0x04)
	None HiddenActors; // 0x2f0(0x10)
	None HiddenPrimitiveComponents; // 0x300(0x10)
	None LastSpectatorStateSynchTime; // 0x314(0x04)
	None LastSpectatorSyncLocation; // 0x318(0x0c)
	None LastSpectatorSyncRotation; // 0x324(0x0c)
	None ClientCap; // 0x330(0x04)
	None CheatManager; // 0x338(0x08)
	None CheatClass; // 0x340(0x08)
	None PlayerInputClass; // 0x348(0x08)
	None PlayerInput; // 0x350(0x08)
	None ActiveForceFeedbackEffects; // 0x358(0x10)
	None bPlayerIsWaiting; // 0x3d8(0x01)
	None NetPlayerIndex; // 0x3dc(0x01)
	None PendingSwapConnection; // 0x418(0x08)
	None NetConnection; // 0x420(0x08)
	None InputYawScale; // 0x440(0x04)
	None InputPitchScale; // 0x444(0x04)
	None InputRollScale; // 0x448(0x04)
	None bShowMouseCursor; // 0x44c(0x01)
	None bEnableClickEvents; // 0x44c(0x01)
	None bEnableTouchEvents; // 0x44c(0x01)
	None bEnableMouseOverEvents; // 0x44c(0x01)
	None bEnableTouchOverEvents; // 0x44c(0x01)
	None bForceFeedbackEnabled; // 0x44c(0x01)
	None ForceFeedbackScale; // 0x450(0x04)
	None ClickEventKeys; // 0x458(0x10)
	None DefaultMouseCursor; // 0x468(0x01)
	None CurrentMouseCursor; // 0x469(0x01)
	None DefaultClickTraceChannel; // 0x46a(0x01)
	None CurrentClickTraceChannel; // 0x46b(0x01)
	None HitResultTraceDistance; // 0x46c(0x04)
	None SeamlessTravelCount; // 0x470(0x02)
	None LastCompletedSeamlessTravelCount; // 0x472(0x02)
	None InactiveStateInputComponent; // 0x4e8(0x08)
	None bShouldPerformFullTickWhenPaused; // 0x4f0(0x01)
	None CurrentTouchInterface; // 0x508(0x08)
	None SpectatorPawn; // 0x560(0x08)
	None bIsLocalPlayerController; // 0x56c(0x01)
	None SpawnLocation; // 0x570(0x0c)
	None DebugExecBindings; // 0x120(0x10)
	None InvertedAxis; // 0x160(0x10)
	None TouchRegionStates; // 0x12a0(0x10)
	None CachedKeyToActionInfo; // 0x120(0x10)
	None Score; // 0x220(0x04)
	None PlayerId; // 0x224(0x04)
	None Ping; // 0x228(0x01)
	None bShouldUpdateReplicatedPing; // 0x22a(0x01)
	None bIsSpectator; // 0x22a(0x01)
	None bOnlySpectator; // 0x22a(0x01)
	None bIsABot; // 0x22a(0x01)
	None bIsInactive; // 0x22a(0x01)
	None bFromPreviousLevel; // 0x22a(0x01)
	None StartTime; // 0x22c(0x04)
	None EngineMessageClass; // 0x230(0x08)
	None SavedNetworkAddress; // 0x240(0x10)
	None UniqueId; // 0x250(0x28)
	None PawnPrivate; // 0x280(0x08)
	None PlayerNamePrivate; // 0x300(0x10)
	None ViewportConsole; // 0x40(0x08)
	None DebugProperties; // 0x48(0x10)
	None MaxSplitscreenPlayers; // 0x68(0x04)
	None World; // 0x78(0x08)
	None GameInstance; // 0x80(0x08)
	None ConsoleTargetPlayer; // 0x38(0x08)
	None DefaultTexture_Black; // 0x40(0x08)
	None DefaultTexture_White; // 0x48(0x08)
	None HistoryBuffer; // 0x68(0x10)
	None DefaultHeight; // 0x130(0x04)
	None VisibilityCellSize; // 0x228(0x04)
	None VisibilityAggressiveness; // 0x22c(0x01)
	None bPrecomputeVisibility; // 0x22d(0x01)
	None bPlaceCellsOnlyAlongCameraTracks; // 0x22d(0x01)
	None bEnableWorldBoundsChecks; // 0x22d(0x01)
	None bEnableNavigationSystem; // 0x22d(0x01)
	None bEnableAISystem; // 0x22d(0x01)
	None bEnableWorldComposition; // 0x22d(0x01)
	None bUseClientSideLevelStreamingVolumes; // 0x22d(0x01)
	None bEnableWorldOriginRebasing; // 0x22d(0x01)
	None bWorldGravitySet; // 0x22e(0x01)
	None bGlobalGravitySet; // 0x22e(0x01)
	None bMinimizeBSPSections; // 0x22e(0x01)
	None bForceNoPrecomputedLighting; // 0x22e(0x01)
	None bHighPriorityLoading; // 0x22e(0x01)
	None bHighPriorityLoadingLocal; // 0x22e(0x01)
	None bOverrideDefaultBroadphaseSettings; // 0x22e(0x01)
	None NavigationSystemConfig; // 0x230(0x08)
	None NavigationSystemConfigOverride; // 0x238(0x08)
	None WorldToMeters; // 0x240(0x04)
	None KillZ; // 0x244(0x04)
	None KillZDamageType; // 0x248(0x08)
	None WorldGravityZ; // 0x250(0x04)
	None GlobalGravityZ; // 0x254(0x04)
	None DefaultPhysicsVolumeClass; // 0x258(0x08)
	None PhysicsCollisionHandlerClass; // 0x260(0x08)
	None DefaultGameMode; // 0x268(0x08)
	None GameNetworkManagerClass; // 0x270(0x08)
	None PackedLightAndShadowMapTextureSize; // 0x278(0x04)
	None DefaultColorScale; // 0x27c(0x0c)
	None DefaultMaxDistanceFieldOcclusionDistance; // 0x288(0x04)
	None GlobalDistanceFieldViewDistance; // 0x28c(0x04)
	None DynamicIndirectShadowsSelfShadowingIntensity; // 0x290(0x04)
	None DefaultReverbSettings; // 0x298(0x20)
	None DefaultAmbientZoneSettings; // 0x2b8(0x24)
	None MonoCullingDistance; // 0x2dc(0x04)
	None DefaultBaseSoundMix; // 0x2e0(0x08)
	None TimeDilation; // 0x2e8(0x04)
	None MatineeTimeDilation; // 0x2ec(0x04)
	None DemoPlayTimeDilation; // 0x2f0(0x04)
	None MinGlobalTimeDilation; // 0x2f4(0x04)
	None MaxGlobalTimeDilation; // 0x2f8(0x04)
	None MinUndilatedFrameTime; // 0x2fc(0x04)
	None MaxUndilatedFrameTime; // 0x300(0x04)
	None BroadphaseSettings; // 0x304(0x40)
	None Pauser; // 0x348(0x08)
	None ReplicationViewers; // 0x350(0x10)
	None AssetUserData; // 0x360(0x10)
	None PauserPlayerState; // 0x370(0x08)
	None MaxNumberOfBookmarks; // 0x378(0x04)
	None DefaultBookmarkClass; // 0x380(0x08)
	None BookmarkArray; // 0x388(0x10)
	None LastBookmarkClass; // 0x398(0x08)
	None NativeClass; // 0x28(0x08)
	None ObjectReferenceList; // 0x2c0(0x10)
	None bIsGlobalAsyncScanEnvironment; // 0x2d0(0x01)
	None bShouldGuessTypeAndName; // 0x2d1(0x01)
	None bShouldUseSynchronousLoad; // 0x2d2(0x01)
	None bIsLoadingFromPakFiles; // 0x2d3(0x01)
	None bShouldAcquireMissingChunksOnLoad; // 0x2d4(0x01)
	None bOnlyCookProductionAssets; // 0x2d5(0x01)
	None bIsBulkScanning; // 0x2d6(0x01)
	None bIsPrimaryAssetDirectoryCurrent; // 0x2d7(0x01)
	None bIsManagementDatabaseCurrent; // 0x2d8(0x01)
	None bUpdateManagementDatabaseAfterScan; // 0x2d9(0x01)
	None bIncludeOnlyOnDiskAssets; // 0x2da(0x01)
	None NumberOfSpawnedNotifications; // 0x2dc(0x04)
	None bForceUseAllBundlesDuringLoadRecursive; // 0x3d0(0x01)
	None PlayerOwner; // 0x220(0x08)
	None bLostFocusPaused; // 0x228(0x01)
	None bShowHUD; // 0x228(0x01)
	None bShowDebugInfo; // 0x228(0x01)
	None CurrentTargetIndex; // 0x22c(0x04)
	None bShowHitBoxDebugInfo; // 0x230(0x01)
	None bShowOverlays; // 0x230(0x01)
	None bEnableDebugTextShadow; // 0x230(0x01)
	None PostRenderedActors; // 0x238(0x10)
	None DebugDisplay; // 0x250(0x10)
	None ToggledDebugCategories; // 0x260(0x10)
	None Canvas; // 0x270(0x08)
	None DebugCanvas; // 0x278(0x08)
	None DebugTextList; // 0x280(0x10)
	None ShowDebugTargetDesiredClass; // 0x290(0x08)
	None ShowDebugTargetActor; // 0x298(0x08)
	None BrushType; // 0x220(0x01)
	None BrushColor; // 0x224(0x04)
	None PolyFlags; // 0x228(0x04)
	None bColored; // 0x22c(0x01)
	None bSolidWhenSelected; // 0x22c(0x01)
	None bPlaceableFromClassBrowser; // 0x22c(0x01)
	None bNotForClientOrServer; // 0x22c(0x01)
	None Brush; // 0x230(0x08)
	None BrushComponent; // 0x238(0x08)
	None bInManipulation; // 0x240(0x01)
	None SavedSelections; // 0x248(0x10)
	None PersistentLevel; // 0x30(0x08)
	None NetDriver; // 0x38(0x08)
	None LineBatcher; // 0x40(0x08)
	None PersistentLineBatcher; // 0x48(0x08)
	None ForegroundLineBatcher; // 0x50(0x08)
	None NetworkManager; // 0x58(0x08)
	None PhysicsCollisionHandler; // 0x60(0x08)
	None ExtraReferencedObjects; // 0x68(0x10)
	None PerModuleDataObjects; // 0x78(0x10)
	None LevelSequenceActors; // 0x88(0x10)
	None StreamingLevels; // 0x98(0x10)
	None StreamingLevelsToConsider; // 0xa8(0x28)
	None StreamingLevelsPrefix; // 0xd0(0x10)
	None CurrentLevelPendingVisibility; // 0xe0(0x08)
	None CurrentLevelPendingInvisibility; // 0xe8(0x08)
	None DemoNetDriver; // 0xf0(0x08)
	None MyParticleEventManager; // 0xf8(0x08)
	None DefaultPhysicsVolume; // 0x100(0x08)
	None bAreConstraintsDirty; // 0x11e(0x01)
	None NavigationSystem; // 0x120(0x08)
	None AuthorityGameMode; // 0x128(0x08)
	None GameState; // 0x130(0x08)
	None AISystem; // 0x138(0x08)
	None AvoidanceManager; // 0x140(0x08)
	None Levels; // 0x148(0x10)
	None LevelCollections; // 0x158(0x10)
	None OwningGameInstance; // 0x188(0x08)
	None ParameterCollectionInstances; // 0x190(0x10)
	None CanvasForRenderingToTarget; // 0x1a0(0x08)
	None CanvasForDrawMaterialToRenderTarget; // 0x1a8(0x08)
	None ComponentsThatNeedEndOfFrameUpdate; // 0x200(0x10)
	None ComponentsThatNeedEndOfFrameUpdate_OnGameThread; // 0x210(0x10)
	None WorldComposition; // 0x560(0x08)
	None PSCPool; // 0x5f0(0x58)
	None HirezObjectPool; // 0x710(0x68)
	None SubTracks; // 0x38(0x10)
	None TrackInstClass; // 0x48(0x08)
	None ActiveCondition; // 0x50(0x01)
	None TrackTitle; // 0x58(0x10)
	None bOnePerGroup; // 0x68(0x01)
	None bDirGroupOnly; // 0x68(0x01)
	None bDisableTrack; // 0x68(0x01)
	None bIsSelected; // 0x68(0x01)
	None bIsAnimControlTrack; // 0x68(0x01)
	None bSubTrackOnly; // 0x68(0x01)
	None bVisible; // 0x68(0x01)
	None bIsRecording; // 0x68(0x01)
	None VectorTrack; // 0x70(0x18)
	None CurveTension; // 0x88(0x04)
	None FloatTrack; // 0x70(0x18)
	None CurveTension; // 0x88(0x04)
	None AnimBlueprintGeneratedClass; // 0x670(0x08)
	None AnimClass; // 0x678(0x08)
	None AnimScriptInstance; // 0x680(0x08)
	None PostProcessAnimInstance; // 0x688(0x08)
	None AnimationData; // 0x690(0x18)
	None RootBoneTranslation; // 0x6b8(0x0c)
	None LineCheckBoundsScale; // 0x6c4(0x0c)
	None LinkedInstances; // 0x710(0x10)
	None CachedBoneSpaceTransforms; // 0x720(0x10)
	None CachedComponentSpaceTransforms; // 0x730(0x10)
	None GlobalAnimRateScale; // 0x760(0x04)
	None KinematicBonesUpdateType; // 0x764(0x01)
	None PhysicsTransformUpdateMode; // 0x765(0x01)
	None AnimationMode; // 0x767(0x01)
	None bDisablePostProcessBlueprint; // 0x769(0x01)
	None bUpdateOverlapsOnAnimationFinalize; // 0x769(0x01)
	None bHasValidBodies; // 0x769(0x01)
	None bBlendPhysics; // 0x769(0x01)
	None bEnablePhysicsOnDedicatedServer; // 0x769(0x01)
	None bUpdateJointsFromAnimation; // 0x76a(0x01)
	None bDisableClothSimulation; // 0x76a(0x01)
	None bDisableRigidBodyAnimNode; // 0x76a(0x01)
	None bAllowAnimCurveEvaluation; // 0x76a(0x01)
	None bDisableAnimCurves; // 0x76a(0x01)
	None bCollideWithEnvironment; // 0x76b(0x01)
	None bCollideWithAttachedChildren; // 0x76b(0x01)
	None bLocalSpaceSimulation; // 0x76b(0x01)
	None bResetAfterTeleport; // 0x76b(0x01)
	None bDeferKinematicBoneUpdate; // 0x76b(0x01)
	None bNoSkeletonUpdate; // 0x76b(0x01)
	None bPauseAnims; // 0x76b(0x01)
	None bUseRefPoseOnInitAnim; // 0x76c(0x01)
	None bEnablePerPolyCollision; // 0x76c(0x01)
	None bForceRefpose; // 0x76c(0x01)
	None bOnlyAllowAutonomousTickPose; // 0x76c(0x01)
	None bIsAutonomousTickPose; // 0x76c(0x01)
	None bOldForceRefPose; // 0x76c(0x01)
	None bShowPrePhysBones; // 0x76c(0x01)
	None bRequiredBonesUpToDate; // 0x76c(0x01)
	None bAnimTreeInitialised; // 0x76d(0x01)
	None bIncludeComponentLocationIntoBounds; // 0x76d(0x01)
	None bEnableLineCheckWithBounds; // 0x76d(0x01)
	None bUseBendingElements; // 0x76d(0x01)
	None bUseTetrahedralConstraints; // 0x76d(0x01)
	None bUseThinShellVolumeConstraints; // 0x76d(0x01)
	None bUseSelfCollisions; // 0x76d(0x01)
	None bUseContinuousCollisionDetection; // 0x76d(0x01)
	None bPropagateCurvesToSlaves; // 0x76e(0x01)
	None bSkipKinematicUpdateWhenInterpolating; // 0x76e(0x01)
	None bSkipBoundsUpdateWhenInterpolating; // 0x76e(0x01)
	None bNeedsQueuedAnimEventsDispatched; // 0x76e(0x01)
	None CachedAnimCurveUidVersion; // 0x770(0x02)
	None MassMode; // 0x772(0x01)
	None UniformMass; // 0x774(0x04)
	None TotalMass; // 0x778(0x04)
	None Density; // 0x77c(0x04)
	None MinPerParticleMass; // 0x780(0x04)
	None ClothBlendWeight; // 0x784(0x04)
	None EdgeStiffness; // 0x788(0x04)
	None BendingStiffness; // 0x78c(0x04)
	None AreaStiffness; // 0x790(0x04)
	None VolumeStiffness; // 0x794(0x04)
	None StrainLimitingStiffness; // 0x798(0x04)
	None ShapeTargetStiffness; // 0x79c(0x04)
	None DisallowedAnimCurves; // 0x7a0(0x10)
	None BodySetup; // 0x7b0(0x08)
	None OnConstraintBroken; // 0x7c0(0x10)
	None ClothingSimulationFactory; // 0x7d0(0x08)
	None TeleportDistanceThreshold; // 0x8a8(0x04)
	None TeleportRotationThreshold; // 0x8ac(0x04)
	None LastPoseTickFrame; // 0x8b8(0x04)
	None bDelayedAnimTaskValid; // 0x8c8(0x01)
	None bDisableDelayedAnimTask; // 0x8c9(0x01)
	None ClothingInteractor; // 0x920(0x08)
	None OnAnimInitialized; // 0xa50(0x10)
	None StaticMeshGuid; // 0x458(0x10)
	None ForcedLodModel; // 0x468(0x04)
	None PreviousLODLevel; // 0x46c(0x04)
	None MinLOD; // 0x470(0x04)
	None SubDivisionStepSize; // 0x474(0x04)
	None StaticMesh; // 0x478(0x08)
	None WireframeColorOverride; // 0x480(0x04)
	None bEvaluateWorldPositionOffset; // 0x484(0x01)
	None bOverrideWireframeColor; // 0x484(0x01)
	None bOverrideMinLod; // 0x484(0x01)
	None bOverrideNavigationExport; // 0x484(0x01)
	None bForceNavigationObstacle; // 0x484(0x01)
	None bDisallowMeshPaintPerInstance; // 0x484(0x01)
	None bIgnoreInstanceForTextureStreaming; // 0x484(0x01)
	None bOverrideLightMapRes; // 0x484(0x01)
	None bCastDistanceFieldIndirectShadow; // 0x485(0x01)
	None bOverrideDistanceFieldSelfShadowBias; // 0x485(0x01)
	None bUseSubDivisions; // 0x485(0x01)
	None bUseDefaultCollision; // 0x485(0x01)
	None bReverseCulling; // 0x485(0x01)
	None bHasReflectionCaptureOverrideLocation; // 0x485(0x01)
	None ReflectionCaptureOverrideLocation; // 0x488(0x0c)
	None OverriddenLightMapRes; // 0x494(0x04)
	None DistanceFieldIndirectShadowMinVisibility; // 0x498(0x04)
	None DistanceFieldSelfShadowBias; // 0x49c(0x04)
	None StreamingDistanceMultiplier; // 0x4a0(0x04)
	None LODData; // 0x4a8(0x10)
	None StreamingTextureData; // 0x4b8(0x10)
	None LightmassSettings; // 0x4c8(0x1c)
	None PSTemplate; // 0x38(0x08)
	None LocationOffset; // 0x40(0x0c)
	None RotationOffset; // 0x4c(0x0c)
	None Scale; // 0x58(0x0c)
	None Attached; // 0x80(0x01)
	None SocketName; // 0x84(0x08)
	None CurrentSkeleton; // 0x28(0x08)
	None RootMotionMode; // 0x30(0x01)
	None bUseMultiThreadedAnimationUpdate; // 0x31(0x01)
	None bUsingCopyPoseFromMesh; // 0x31(0x01)
	None bReceiveNotifiesFromLinkedInstances; // 0x31(0x01)
	None bPropagateNotifiesToLinkedInstances; // 0x31(0x01)
	None bQueueMontageEvents; // 0x31(0x01)
	None OnMontageBlendingOut; // 0x38(0x10)
	None OnMontageStarted; // 0x48(0x10)
	None OnMontageEnded; // 0x58(0x10)
	None OnAllMontageInstancesEnded; // 0x68(0x10)
	None NotifyQueue; // 0x100(0x70)
	None ActiveAnimNotifyState; // 0x170(0x10)
	None SubAnimInstanceWeight; // 0x180(0x04)
	None DecalMaterial; // 0x208(0x08)
	None SortOrder; // 0x210(0x04)
	None FadeScreenSize; // 0x214(0x04)
	None FadeStartDelay; // 0x218(0x04)
	None FadeDuration; // 0x21c(0x04)
	None FadeInDuration; // 0x220(0x04)
	None FadeInStartDelay; // 0x224(0x04)
	None bDestroyOwnerAfterFade; // 0x228(0x01)
	None DecalSize; // 0x22c(0x0c)
	None MaxPoolSize; // 0x28(0x04)
	None HelpDescription; // 0x28(0x10)
	None HelpUsage; // 0x38(0x10)
	None HelpWebLink; // 0x48(0x10)
	None HelpParamNames; // 0x58(0x10)
	None HelpParamDescriptions; // 0x68(0x10)
	None IsServer; // 0x78(0x01)
	None IsClient; // 0x78(0x01)
	None IsEditor; // 0x78(0x01)
	None LogToConsole; // 0x78(0x01)
	None ShowErrorCount; // 0x78(0x01)
	None ShowProgress; // 0x78(0x01)
	None Description; // 0x28(0x10)
	None Sound; // 0x208(0x08)
	None InstanceParameters; // 0x210(0x10)
	None SoundClassOverride; // 0x220(0x08)
	None bAutoDestroy; // 0x228(0x01)
	None bStopWhenOwnerDestroyed; // 0x228(0x01)
	None bShouldRemainActiveIfDropped; // 0x228(0x01)
	None bAllowSpatialization; // 0x228(0x01)
	None bOverrideAttenuation; // 0x228(0x01)
	None bOverrideSubtitlePriority; // 0x228(0x01)
	None bIsUISound; // 0x228(0x01)
	None bEnableLowPassFilter; // 0x228(0x01)
	None bOverridePriority; // 0x229(0x01)
	None bSuppressSubtitles; // 0x229(0x01)
	None bAutoManageAttachment; // 0x22a(0x01)
	None AudioComponentUserID; // 0x230(0x08)
	None PitchModulationMin; // 0x238(0x04)
	None PitchModulationMax; // 0x23c(0x04)
	None VolumeModulationMin; // 0x240(0x04)
	None VolumeModulationMax; // 0x244(0x04)
	None VolumeMultiplier; // 0x248(0x04)
	None EnvelopeFollowerAttackTime; // 0x24c(0x04)
	None EnvelopeFollowerReleaseTime; // 0x250(0x04)
	None Priority; // 0x254(0x04)
	None SubtitlePriority; // 0x258(0x04)
	None SourceEffectChain; // 0x260(0x08)
	None PitchMultiplier; // 0x268(0x04)
	None LowPassFilterFrequency; // 0x26c(0x04)
	None AttenuationSettings; // 0x278(0x08)
	None AttenuationOverrides; // 0x280(0x3a0)
	None ConcurrencySettings; // 0x620(0x08)
	None ConcurrencySet; // 0x628(0x50)
	None AutoAttachLocationRule; // 0x684(0x01)
	None AutoAttachRotationRule; // 0x685(0x01)
	None AutoAttachScaleRule; // 0x686(0x01)
	None OnAudioFinished; // 0x688(0x10)
	None OnAudioPlaybackPercent; // 0x6b0(0x10)
	None OnAudioSingleEnvelopeValue; // 0x6d8(0x10)
	None OnAudioMultiEnvelopeValue; // 0x700(0x10)
	None Modulation; // 0x728(0x10)
	None OnQueueSubtitles; // 0x738(0x10)
	None AutoAttachParent; // 0x748(0x08)
	None AutoAttachSocketName; // 0x750(0x08)
	None ShapeBodySetup; // 0x430(0x08)
	None AreaClass; // 0x438(0x08)
	None ShapeColor; // 0x440(0x04)
	None bDrawOnlyIfSelected; // 0x444(0x01)
	None bShouldCollideWhenPlacing; // 0x444(0x01)
	None bDynamicObstacle; // 0x444(0x01)
	None SphereRadius; // 0x448(0x04)
	None PSTemplate; // 0x30(0x08)
	None FirstSocketName; // 0x38(0x08)
	None SecondSocketName; // 0x40(0x08)
	None WidthScaleMode; // 0x48(0x01)
	None WidthScaleCurve; // 0x4c(0x08)
	None bRecycleSpawnedSystems; // 0x54(0x01)
	None bDebug; // 0x28(0x01)
	None bExclusive; // 0x28(0x01)
	None Priority; // 0x2c(0x01)
	None CameraOwner; // 0x30(0x08)
	None AlphaInTime; // 0x38(0x04)
	None AlphaOutTime; // 0x3c(0x04)
	None Alpha; // 0x40(0x04)
	None bSingleInstance; // 0x28(0x01)
	None OscillationDuration; // 0x2c(0x04)
	None OscillationBlendInTime; // 0x30(0x04)
	None OscillationBlendOutTime; // 0x34(0x04)
	None RotOscillation; // 0x38(0x24)
	None LocOscillation; // 0x5c(0x24)
	None FOVOscillation; // 0x80(0x0c)
	None AnimPlayRate; // 0x8c(0x04)
	None AnimScale; // 0x90(0x04)
	None AnimBlendInTime; // 0x94(0x04)
	None AnimBlendOutTime; // 0x98(0x04)
	None RandomAnimSegmentDuration; // 0x9c(0x04)
	None Anim; // 0xa0(0x08)
	None bRandomAnimSegment; // 0xa8(0x01)
	None CameraOwner; // 0xc0(0x08)
	None ShakeScale; // 0x148(0x04)
	None OscillatorTimeRemaining; // 0x14c(0x04)
	None AnimInst; // 0x150(0x08)
	None CapsuleHalfHeight; // 0x448(0x04)
	None CapsuleRadius; // 0x44c(0x04)
	None bCausedByWorld; // 0x28(0x01)
	None bScaleMomentumByMass; // 0x28(0x01)
	None bRadialDamageVelChange; // 0x28(0x01)
	None DamageImpulse; // 0x2c(0x04)
	None DestructibleImpulse; // 0x30(0x04)
	None DestructibleDamageSpreadScale; // 0x34(0x04)
	None DamageFalloff; // 0x38(0x04)
	None TerminalVelocity; // 0x258(0x04)
	None Priority; // 0x25c(0x04)
	None FluidFriction; // 0x260(0x04)
	None bWaterVolume; // 0x264(0x01)
	None bPhysicsOnContact; // 0x264(0x01)
	None bUseVSync; // 0x28(0x01)
	None bUseDynamicResolution; // 0x29(0x01)
	None ResolutionSizeX; // 0x80(0x04)
	None ResolutionSizeY; // 0x84(0x04)
	None LastUserConfirmedResolutionSizeX; // 0x88(0x04)
	None LastUserConfirmedResolutionSizeY; // 0x8c(0x04)
	None WindowPosX; // 0x90(0x04)
	None WindowPosY; // 0x94(0x04)
	None FullscreenMode; // 0x98(0x04)
	None LastConfirmedFullscreenMode; // 0x9c(0x04)
	None PreferredFullscreenMode; // 0xa0(0x04)
	None Version; // 0xa4(0x04)
	None AudioQualityLevel; // 0xa8(0x04)
	None LastConfirmedAudioQualityLevel; // 0xac(0x04)
	None FrameRateLimit; // 0xb0(0x04)
	None DesiredScreenWidth; // 0xb8(0x04)
	None bUseDesiredScreenHeight; // 0xbc(0x01)
	None DesiredScreenHeight; // 0xc0(0x04)
	None LastUserConfirmedDesiredScreenWidth; // 0xc4(0x04)
	None LastUserConfirmedDesiredScreenHeight; // 0xc8(0x04)
	None LastRecommendedScreenWidth; // 0xcc(0x04)
	None LastRecommendedScreenHeight; // 0xd0(0x04)
	None LastCPUBenchmarkResult; // 0xd4(0x04)
	None LastGPUBenchmarkResult; // 0xd8(0x04)
	None LastCPUBenchmarkSteps; // 0xe0(0x10)
	None LastGPUBenchmarkSteps; // 0xf0(0x10)
	None LastGPUBenchmarkMultiplier; // 0x100(0x04)
	None bUseHDRDisplayOutput; // 0x104(0x01)
	None HDRDisplayOutputNits; // 0x108(0x04)
	None OnGameUserSettingsUINeedsUpdate; // 0x110(0x10)
	None RowStruct; // 0x28(0x08)
	None bStripFromClientBuilds; // 0x80(0x01)
	None bIgnoreExtraFields; // 0x80(0x01)
	None bIgnoreMissingFields; // 0x80(0x01)
	None ImportKeyField; // 0x88(0x10)
	None AutoActivateForPlayer; // 0x220(0x01)
	None CameraComponent; // 0x228(0x08)
	None SceneComponent; // 0x230(0x08)
	None bConstrainAspectRatio; // 0x240(0x01)
	None AspectRatio; // 0x244(0x04)
	None FOVAngle; // 0x248(0x04)
	None PostProcessBlendWeight; // 0x24c(0x04)
	None PostProcessSettings; // 0x250(0x550)
	None Rules; // 0x30(0x0c)
	None bLabelAssetsInMyDirectory; // 0x3c(0x01)
	None bIsRuntimeLabel; // 0x3c(0x01)
	None ExplicitAssets; // 0x40(0x10)
	None ExplicitBlueprints; // 0x50(0x10)
	None AssetCollection; // 0x60(0x08)
	None CapsuleComponent; // 0x228(0x08)
	None GoodSprite; // 0x230(0x08)
	None BadSprite; // 0x238(0x08)
	None bIsPIEPlayerStart; // 0x240(0x01)
	None bSpawnModule; // 0x28(0x01)
	None bUpdateModule; // 0x28(0x01)
	None bFinalUpdateModule; // 0x28(0x01)
	None bUpdateForGPUEmitter; // 0x28(0x01)
	None bCurvesAsColor; // 0x28(0x01)
	None b3DDrawMode; // 0x28(0x01)
	None bSupported3DDrawMode; // 0x28(0x01)
	None bEnabled; // 0x28(0x01)
	None bEditable; // 0x29(0x01)
	None LODDuplicate; // 0x29(0x01)
	None bSupportsRandomSeed; // 0x29(0x01)
	None bRequiresLoopingNotification; // 0x29(0x01)
	None LODValidity; // 0x2a(0x01)
	None SourceType; // 0x30(0x01)
	None UniversalOffset; // 0x34(0x0c)
	None bUpdatePositionEachFrame; // 0x40(0x01)
	None bOrientMeshEmitters; // 0x40(0x01)
	None bInheritBoneVelocity; // 0x40(0x01)
	None InheritVelocityScale; // 0x44(0x04)
	None SkelMeshActorParamName; // 0x48(0x08)
	None ValidAssociatedBones; // 0x50(0x10)
	None bEnforceNormalCheck; // 0x60(0x01)
	None NormalToCompare; // 0x64(0x0c)
	None NormalCheckToleranceDegrees; // 0x70(0x04)
	None NormalCheckTolerance; // 0x74(0x04)
	None ValidMaterialIndices; // 0x78(0x10)
	None bInheritVertexColor; // 0x88(0x01)
	None bInheritUV; // 0x88(0x01)
	None InheritUVChannel; // 0x8c(0x04)
	None PCOwner; // 0x220(0x08)
	None TransformComponent; // 0x228(0x08)
	None DefaultFOV; // 0x238(0x04)
	None DefaultOrthoWidth; // 0x240(0x04)
	None DefaultAspectRatio; // 0x248(0x04)
	None CameraCache; // 0x290(0x5f0)
	None LastFrameCameraCache; // 0x880(0x5f0)
	None ViewTarget; // 0xe70(0x600)
	None PendingViewTarget; // 0x1470(0x600)
	None CameraCachePrivate; // 0x1aa0(0x5f0)
	None LastFrameCameraCachePrivate; // 0x2090(0x5f0)
	None ModifierList; // 0x2680(0x10)
	None DefaultModifiers; // 0x2690(0x10)
	None FreeCamDistance; // 0x26a0(0x04)
	None FreeCamOffset; // 0x26a4(0x0c)
	None ViewTargetOffset; // 0x26b0(0x0c)
	None CameraLensEffects; // 0x26d0(0x10)
	None CachedCameraShakeMod; // 0x26e0(0x08)
	None AnimInstPool; // 0x26e8(0x40)
	None PostProcessBlendCache; // 0x2728(0x10)
	None ActiveAnims; // 0x2748(0x10)
	None FreeAnims; // 0x2758(0x10)
	None AnimCameraActor; // 0x2768(0x08)
	None bIsOrthographic; // 0x2770(0x01)
	None bDefaultConstrainAspectRatio; // 0x2770(0x01)
	None bClientSimulatingViewTarget; // 0x2770(0x01)
	None bUseClientSideCameraUpdates; // 0x2770(0x01)
	None bGameCameraCutThisFrame; // 0x2771(0x01)
	None bForceLocalSpaceForInterpolatedRendering; // 0x2771(0x01)
	None ViewPitchMin; // 0x2774(0x04)
	None ViewPitchMax; // 0x2778(0x04)
	None ViewYawMin; // 0x277c(0x04)
	None ViewYawMax; // 0x2780(0x04)
	None ViewRollMin; // 0x2784(0x04)
	None ViewRollMax; // 0x2788(0x04)
	None ServerUpdateCameraTimeout; // 0x2790(0x04)
	None PlayerStartTag; // 0x248(0x08)
	None InitialSpeed; // 0xf0(0x04)
	None MaxSpeed; // 0xf4(0x04)
	None bRotationFollowsVelocity; // 0xf8(0x01)
	None bRotationRemainsVertical; // 0xf8(0x01)
	None bShouldBounce; // 0xf8(0x01)
	None bInitialVelocityInLocalSpace; // 0xf8(0x01)
	None bForceSubStepping; // 0xf8(0x01)
	None bSimulationEnabled; // 0xf8(0x01)
	None bSweepCollision; // 0xf8(0x01)
	None bIsHomingProjectile; // 0xf8(0x01)
	None bBounceAngleAffectsFriction; // 0xf9(0x01)
	None bIsSliding; // 0xf9(0x01)
	None bInterpMovement; // 0xf9(0x01)
	None bInterpRotation; // 0xf9(0x01)
	None PreviousHitTime; // 0xfc(0x04)
	None PreviousHitNormal; // 0x100(0x0c)
	None ProjectileGravityScale; // 0x10c(0x04)
	None Buoyancy; // 0x110(0x04)
	None Bounciness; // 0x114(0x04)
	None Friction; // 0x118(0x04)
	None BounceVelocityStopSimulatingThreshold; // 0x11c(0x04)
	None MinFrictionFraction; // 0x120(0x04)
	None OnProjectileBounce; // 0x128(0x10)
	None OnProjectileStop; // 0x138(0x10)
	None HomingAccelerationMagnitude; // 0x148(0x04)
	None HomingTargetComponent; // 0x14c(0x08)
	None MaxSimulationTimeStep; // 0x154(0x04)
	None MaxSimulationIterations; // 0x158(0x04)
	None BounceAdditionalIterations; // 0x15c(0x04)
	None InterpLocationTime; // 0x160(0x04)
	None InterpRotationTime; // 0x164(0x04)
	None InterpLocationMaxLagDistance; // 0x168(0x04)
	None InterpLocationSnapToTargetDistance; // 0x16c(0x04)
	None BaseTurnRate; // 0x280(0x04)
	None BaseLookUpRate; // 0x284(0x04)
	None MovementComponent; // 0x288(0x08)
	None CollisionComponent; // 0x290(0x08)
	None MeshComponent; // 0x298(0x08)
	None bAddDefaultMovementBindings; // 0x2a0(0x01)
	None Text; // 0x430(0x18)
	None TextMaterial; // 0x448(0x08)
	None Font; // 0x450(0x08)
	None HorizontalAlignment; // 0x458(0x01)
	None VerticalAlignment; // 0x459(0x01)
	None TextRenderColor; // 0x45c(0x04)
	None XScale; // 0x460(0x04)
	None YScale; // 0x464(0x04)
	None WorldSize; // 0x468(0x04)
	None InvDefaultSize; // 0x46c(0x04)
	None HorizSpacingAdjust; // 0x470(0x04)
	None VertSpacingAdjust; // 0x474(0x04)
	None bAlwaysRenderAsText; // 0x478(0x01)
	None TargetArmLength; // 0x208(0x04)
	None SocketOffset; // 0x20c(0x0c)
	None TargetOffset; // 0x218(0x0c)
	None ProbeSize; // 0x224(0x04)
	None ProbeChannel; // 0x228(0x01)
	None bDoCollisionTest; // 0x22c(0x01)
	None bUsePawnControlRotation; // 0x22c(0x01)
	None bInheritPitch; // 0x22c(0x01)
	None bInheritYaw; // 0x22c(0x01)
	None bInheritRoll; // 0x22c(0x01)
	None bEnableCameraLag; // 0x22c(0x01)
	None bEnableCameraRotationLag; // 0x22c(0x01)
	None bUseCameraLagSubstepping; // 0x22c(0x01)
	None bDrawDebugLagMarkers; // 0x22d(0x01)
	None CameraLagSpeed; // 0x230(0x04)
	None CameraRotationLagSpeed; // 0x234(0x04)
	None CameraLagMaxTimeStep; // 0x238(0x04)
	None CameraLagMaxDistance; // 0x23c(0x04)
	None Template; // 0x430(0x08)
	None EmitterMaterials; // 0x438(0x10)
	None SkelMeshComponents; // 0x448(0x10)
	None bRenderAfterDLSS; // 0x459(0x01)
	None bResetOnDetach; // 0x459(0x01)
	None bUpdateOnDedicatedServer; // 0x459(0x01)
	None bAllowRecycling; // 0x459(0x01)
	None bAutoManageAttachment; // 0x459(0x01)
	None bAutoAttachWeldSimulatedBodies; // 0x459(0x01)
	None bWarmingUp; // 0x45a(0x01)
	None bOverrideLODMethod; // 0x45a(0x01)
	None bSkipUpdateDynamicDataDuringTick; // 0x45a(0x01)
	None LODMethod; // 0x465(0x01)
	None RequiredSignificance; // 0x466(0x01)
	None InstanceParameters; // 0x468(0x10)
	None OnParticleSpawn; // 0x478(0x10)
	None OnParticleBurst; // 0x488(0x10)
	None OnParticleDeath; // 0x498(0x10)
	None OnParticleCollide; // 0x4a8(0x10)
	None OnParticleCollidePacked; // 0x4b8(0x10)
	None m_ParticleChannels; // 0x4c8(0x04)
	None bOldPositionValid; // 0x4cc(0x01)
	None OldPosition; // 0x4d0(0x0c)
	None PartSysVelocity; // 0x4dc(0x0c)
	None WarmupTime; // 0x4e8(0x04)
	None WarmupTickRate; // 0x4ec(0x04)
	None SecondsBeforeInactive; // 0x4f4(0x04)
	None MaxTimeBeforeForceUpdateTransform; // 0x4fc(0x04)
	None ReplayClips; // 0x520(0x10)
	None CustomTimeDilation; // 0x538(0x04)
	None AutoAttachParent; // 0x590(0x08)
	None AutoAttachSocketName; // 0x598(0x08)
	None AutoAttachLocationRule; // 0x5a0(0x01)
	None AutoAttachRotationRule; // 0x5a1(0x01)
	None AutoAttachScaleRule; // 0x5a2(0x01)
	None OnSystemFinished; // 0x5d0(0x10)
	None LightComponent; // 0x220(0x08)
	None bEnabled; // 0x228(0x01)
	None LightingGuid; // 0x48(0x10)
	None LODBias; // 0x58(0x04)
	None CompressionSettings; // 0x5c(0x01)
	None Filter; // 0x5d(0x01)
	None MipLoadOptions; // 0x5e(0x01)
	None LODGroup; // 0x5f(0x01)
	None SRGB; // 0x60(0x01)
	None bNoTiling; // 0x60(0x01)
	None VirtualTextureStreaming; // 0x60(0x01)
	None CompressionYCoCg; // 0x60(0x01)
	None bAsyncResourceReleaseHasBeenStarted; // 0x60(0x01)
	None AssetUserData; // 0x68(0x10)
	None PerInstanceSMData; // 0x4e8(0x10)
	None NumCustomDataFloats; // 0x4f8(0x04)
	None PerInstanceSMCustomData; // 0x500(0x10)
	None InstancingRandomSeed; // 0x510(0x04)
	None InstanceStartCullDistance; // 0x514(0x04)
	None InstanceEndCullDistance; // 0x518(0x04)
	None InstanceReorderTable; // 0x520(0x10)
	None NumPendingLightmaps; // 0x578(0x04)
	None CachedMappings; // 0x580(0x10)
	None SortedInstances; // 0x5a0(0x10)
	None NumBuiltInstances; // 0x5b0(0x04)
	None BuiltInstanceBounds; // 0x5b8(0x1c)
	None UnbuiltInstanceBounds; // 0x5d4(0x1c)
	None UnbuiltInstanceBoundsList; // 0x5f0(0x10)
	None bEnableDensityScaling; // 0x600(0x01)
	None OcclusionLayerNumNodes; // 0x608(0x04)
	None CacheMeshExtendedBounds; // 0x60c(0x1c)
	None bDisableCollision; // 0x628(0x01)
	None InstanceCountToRender; // 0x62c(0x04)
	None StaticMeshComponent; // 0x220(0x08)
	None bStaticMeshReplicateMovement; // 0x228(0x01)
	None NavigationGeometryGatheringMode; // 0x229(0x01)
	None SubsurfaceProfile; // 0x38(0x08)
	None LightmassSettings; // 0x50(0x10)
	None TextureStreamingData; // 0x60(0x10)
	None AssetUserData; // 0x70(0x10)
	None PhysMaterial; // 0x88(0x08)
	None PhysicalMaterialMap; // 0x90(0x40)
	None Parent; // 0xd0(0x08)
	None bHasStaticPermutationResource; // 0xd8(0x01)
	None bOverrideSubsurfaceProfile; // 0xd8(0x01)
	None ScalarParameterValues; // 0xe0(0x10)
	None VectorParameterValues; // 0xf0(0x10)
	None TextureParameterValues; // 0x100(0x10)
	None RuntimeVirtualTextureParameterValues; // 0x110(0x10)
	None FontParameterValues; // 0x120(0x10)
	None BasePropertyOverrides; // 0x130(0x08)
	None StaticParameters; // 0x148(0x40)
	None CachedLayerParameters; // 0x188(0x1a0)
	None CachedReferencedTextures; // 0x328(0x10)
	None PhysMaterialMask; // 0x408(0x08)
	None Material; // 0x28(0x08)
	None Function; // 0x30(0x08)
	None bIsParameterExpression; // 0x38(0x01)
	None NumReplicatedProperties; // 0x230(0x04)
	None bHasNativizedParent; // 0x234(0x01)
	None bHasCookedComponentInstancingData; // 0x234(0x01)
	None DynamicBindingObjects; // 0x238(0x10)
	None ComponentTemplates; // 0x248(0x10)
	None Timelines; // 0x258(0x10)
	None ComponentClassOverrides; // 0x268(0x10)
	None SimpleConstructionScript; // 0x278(0x08)
	None InheritableComponentHandler; // 0x280(0x08)
	None UberGraphFramePointerProperty; // 0x288(0x08)
	None UberGraphFunction; // 0x298(0x08)
	None CookedComponentInstancingData; // 0x2a0(0x50)
	None FieldOfView; // 0x208(0x04)
	None OrthoWidth; // 0x20c(0x04)
	None OrthoNearClipPlane; // 0x210(0x04)
	None OrthoFarClipPlane; // 0x214(0x04)
	None AspectRatio; // 0x218(0x04)
	None MaxAspectRatio; // 0x21c(0x04)
	None bConstrainAspectRatio; // 0x220(0x01)
	None bUseFieldOfViewForLOD; // 0x220(0x01)
	None bLockToHmd; // 0x220(0x01)
	None bUsePawnControlRotation; // 0x220(0x01)
	None ProjectionMode; // 0x221(0x01)
	None PostProcessBlendWeight; // 0x260(0x04)
	None PostProcessSettings; // 0x290(0x550)
	None SoundClassObject; // 0x28(0x08)
	None bDebug; // 0x30(0x01)
	None bOverrideConcurrency; // 0x30(0x01)
	None bOutputToBusOnly; // 0x30(0x01)
	None bHasDelayNode; // 0x30(0x01)
	None bHasConcatenatorNode; // 0x30(0x01)
	None bBypassVolumeScaleForPriority; // 0x30(0x01)
	None VirtualizationMode; // 0x31(0x01)
	None ConcurrencySet; // 0x88(0x50)
	None ConcurrencyOverrides; // 0xd8(0x20)
	None Duration; // 0xf8(0x04)
	None MaxDistance; // 0xfc(0x04)
	None TotalSamples; // 0x100(0x04)
	None Priority; // 0x104(0x04)
	None AttenuationSettings; // 0x108(0x08)
	None Modulation; // 0x110(0x10)
	None SoundSubmixObject; // 0x120(0x08)
	None SoundSubmixSends; // 0x128(0x10)
	None SourceEffectChain; // 0x138(0x08)
	None BusSends; // 0x140(0x10)
	None PreEffectBusSends; // 0x150(0x10)
	None CompressionQuality; // 0x160(0x04)
	None StreamingPriority; // 0x164(0x04)
	None SampleRateQuality; // 0x168(0x01)
	None SoundGroup; // 0x16a(0x01)
	None bLooping; // 0x16b(0x01)
	None bStreaming; // 0x16b(0x01)
	None bSeekableStreaming; // 0x16b(0x01)
	None LoadingBehavior; // 0x16c(0x01)
	None bMature; // 0x16d(0x01)
	None bManualWordWrap; // 0x16d(0x01)
	None bSingleLine; // 0x16d(0x01)
	None bIsAmbisonics; // 0x16e(0x01)
	None FrequenciesToAnalyze; // 0x170(0x10)
	None CookedSpectralTimeData; // 0x180(0x10)
	None CookedEnvelopeTimeData; // 0x190(0x10)
	None InitialChunkSize; // 0x1a0(0x04)
	None SpokenText; // 0x1e8(0x10)
	None SubtitlePriority; // 0x1f8(0x04)
	None Volume; // 0x1fc(0x04)
	None Pitch; // 0x200(0x04)
	None NumChannels; // 0x204(0x04)
	None SampleRate; // 0x208(0x04)
	None Subtitles; // 0x218(0x10)
	None Curves; // 0x228(0x08)
	None InternalCurves; // 0x230(0x08)
	None SkeletonGeneratedClass; // 0x28(0x08)
	None GeneratedClass; // 0x30(0x08)
	None bLegacyNeedToPurgeSkelRefs; // 0x38(0x01)
	None BlueprintGuid; // 0x3c(0x10)
	None ParentClass; // 0x50(0x08)
	None BlueprintType; // 0x58(0x01)
	None bRecompileOnLoad; // 0x59(0x01)
	None bHasBeenRegenerated; // 0x59(0x01)
	None bIsRegeneratingOnLoad; // 0x59(0x01)
	None BlueprintSystemVersion; // 0x5c(0x04)
	None SimpleConstructionScript; // 0x60(0x08)
	None ComponentTemplates; // 0x68(0x10)
	None Timelines; // 0x78(0x10)
	None ComponentClassOverrides; // 0x88(0x10)
	None InheritableComponentHandler; // 0x98(0x08)
	None Connection; // 0x28(0x08)
	None Actor; // 0x70(0x08)
	None CreateSubObjects; // 0x168(0x10)
	None Skeleton; // 0x38(0x08)
	None MetaData; // 0x60(0x10)
	None AssetUserData; // 0x70(0x10)
	None bRotationBlendInMeshSpace; // 0x88(0x01)
	None AnimLength; // 0x8c(0x04)
	None InterpolationParam; // 0x90(0x18)
	None TargetWeightInterpolationSpeedPerSec; // 0xa8(0x04)
	None NotifyTriggerMode; // 0xac(0x01)
	None PerBoneBlend; // 0xb0(0x10)
	None SampleIndexWithMarkers; // 0xc0(0x04)
	None SampleData; // 0xc8(0x10)
	None GridSamples; // 0xd8(0x10)
	None BlendParameters; // 0xe8(0x60)
	None AxisToScaleAnimation; // 0x148(0x01)
	None bScaleAnimation; // 0x148(0x01)
	None AISystemClassName; // 0x28(0x18)
	None AISystemModuleName; // 0x40(0x08)
	None bInstantiateAISystemOnClient; // 0x50(0x01)
	None AudioComponent; // 0x220(0x08)
	None CompressCommandletVersion; // 0x38(0x04)
	None KeyEndEffectorsMatchNameArray; // 0x40(0x10)
	None ForceRecompression; // 0x50(0x01)
	None bOnlyCheckForMissingSkeletalMeshes; // 0x51(0x01)
	None bForceBelowThreshold; // 0x52(0x01)
	None bFirstRecompressUsingCurrentOrDefault; // 0x53(0x01)
	None bRaiseMaxErrorToExisting; // 0x54(0x01)
	None bEnablePerformanceLog; // 0x55(0x01)
	None bStripAnimationDataOnDedicatedServer; // 0x56(0x01)
	None bTickAnimationOnSkeletalMeshInit; // 0x57(0x01)
	None TargetSkeleton; // 0xa8(0x08)
	None Groups; // 0xb0(0x10)
	None bUseMultiThreadedAnimationUpdate; // 0xc0(0x01)
	None bWarnAboutBlueprintUsage; // 0xc1(0x01)
	None BakedStateMachines; // 0x330(0x10)
	None TargetSkeleton; // 0x340(0x08)
	None AnimNotifies; // 0x348(0x10)
	None OrderedSavedPoseIndicesMap; // 0x358(0x50)
	None SyncGroupNames; // 0x428(0x10)
	None EvaluateGraphExposedInputs; // 0x438(0x10)
	None GraphAssetPlayerInformation; // 0x448(0x50)
	None GraphBlendOptions; // 0x498(0x50)
	None Codecs; // 0x28(0x10)
	None BakedStateMachines; // 0x30(0x10)
	None TargetSkeleton; // 0x40(0x08)
	None AnimNotifies; // 0x48(0x10)
	None OrderedSavedPoseIndicesMap; // 0x58(0x50)
	None AnimBlueprintFunctions; // 0xa8(0x10)
	None AnimBlueprintFunctionData; // 0xb8(0x10)
	None AnimNodeProperties; // 0xc8(0x10)
	None LinkedAnimGraphNodeProperties; // 0xe8(0x10)
	None LinkedAnimLayerNodeProperties; // 0x108(0x10)
	None PreUpdateNodeProperties; // 0x128(0x10)
	None DynamicResetNodeProperties; // 0x148(0x10)
	None StateMachineNodeProperties; // 0x168(0x10)
	None InitializationNodeProperties; // 0x188(0x10)
	None GraphNameAssetPlayers; // 0x1a8(0x50)
	None SyncGroupNames; // 0x1f8(0x10)
	None EvaluateGraphExposedInputs; // 0x208(0x10)
	None GraphBlendOptions; // 0x218(0x50)
	None Notifies; // 0x80(0x10)
	None SequenceLength; // 0x90(0x04)
	None RateScale; // 0x94(0x04)
	None RawCurveData; // 0x98(0x10)
	None AnimationTrack; // 0xa8(0x10)
	None bNeedsSkeleton; // 0x38(0x01)
	None TranslationCompressionFormat; // 0x3c(0x01)
	None RotationCompressionFormat; // 0x3d(0x01)
	None ScaleCompressionFormat; // 0x3e(0x01)
	None MaxPosDiff; // 0x40(0x04)
	None MaxAngleDiff; // 0x44(0x04)
	None MaxScaleDiff; // 0x48(0x04)
	None MaxEffectorDiff; // 0x4c(0x04)
	None MinEffectorDiff; // 0x50(0x04)
	None EffectorDiffSocket; // 0x54(0x04)
	None ParentKeyScale; // 0x58(0x04)
	None bRetarget; // 0x5c(0x01)
	None bActuallyFilterLinearKeys; // 0x5c(0x01)
	None MaxZeroingThreshold; // 0x60(0x04)
	None MaxPosDiffBitwise; // 0x64(0x04)
	None MaxAngleDiffBitwise; // 0x68(0x04)
	None MaxScaleDiffBitwise; // 0x6c(0x04)
	None AllowedRotationFormats; // 0x70(0x10)
	None AllowedTranslationFormats; // 0x80(0x10)
	None AllowedScaleFormats; // 0x90(0x10)
	None bResampleAnimation; // 0xa0(0x01)
	None ResampledFramerate; // 0xa4(0x04)
	None MinKeysForResampling; // 0xa8(0x04)
	None bUseAdaptiveError; // 0xac(0x01)
	None bUseOverrideForEndEffectors; // 0xac(0x01)
	None TrackHeightBias; // 0xb0(0x04)
	None ParentingDivisor; // 0xb4(0x04)
	None ParentingDivisorExponent; // 0xb8(0x04)
	None bUseAdaptiveError2; // 0xbc(0x01)
	None RotationErrorSourceRatio; // 0xc0(0x04)
	None TranslationErrorSourceRatio; // 0xc4(0x04)
	None ScaleErrorSourceRatio; // 0xc8(0x04)
	None MaxErrorPerTrackRatio; // 0xcc(0x04)
	None PerturbationProbeSize; // 0xd0(0x04)
	None MinKeys; // 0x40(0x04)
	None bStartAtSecondKey; // 0x44(0x01)
	None MaxPosDiff; // 0x40(0x04)
	None MaxAngleDiff; // 0x44(0x04)
	None MaxScaleDiff; // 0x48(0x04)
	None Codec; // 0x28(0x08)
	None BlendIn; // 0xa8(0x30)
	None BlendInTime; // 0xd8(0x04)
	None BlendOut; // 0xe0(0x30)
	None BlendOutTime; // 0x110(0x04)
	None BlendOutTriggerTime; // 0x114(0x04)
	None SyncGroup; // 0x118(0x08)
	None SyncSlotIndex; // 0x120(0x04)
	None MarkerData; // 0x128(0x20)
	None CompositeSections; // 0x148(0x10)
	None SlotAnimTracks; // 0x158(0x10)
	None BranchingPoints; // 0x168(0x10)
	None bEnableRootMotionTranslation; // 0x178(0x01)
	None bEnableRootMotionRotation; // 0x179(0x01)
	None bEnableAutoBlendOut; // 0x17a(0x01)
	None RootMotionRootLock; // 0x17b(0x01)
	None BranchingPointMarkers; // 0x180(0x10)
	None BranchingPointStateNotifyIndices; // 0x190(0x10)
	None TimeStretchCurve; // 0x1a0(0x28)
	None TimeStretchCurveName; // 0x1c8(0x08)
	None Sound; // 0x38(0x08)
	None VolumeMultiplier; // 0x40(0x04)
	None PitchMultiplier; // 0x44(0x04)
	None bFollow; // 0x48(0x01)
	None AttachName; // 0x4c(0x08)
	None PSTemplate; // 0x30(0x08)
	None SocketName; // 0x38(0x08)
	None LocationOffset; // 0x40(0x0c)
	None RotationOffset; // 0x4c(0x0c)
	None bDestroyAtEnd; // 0x58(0x01)
	None NumFrames; // 0xa8(0x04)
	None TrackToSkeletonMapTable; // 0xb0(0x10)
	None BoneCompressionSettings; // 0xd0(0x08)
	None CurveCompressionSettings; // 0xd8(0x08)
	None AdditiveAnimType; // 0x150(0x01)
	None RefPoseType; // 0x151(0x01)
	None RefPoseSeq; // 0x158(0x08)
	None RefFrameIndex; // 0x160(0x04)
	None RetargetSource; // 0x164(0x08)
	None Interpolation; // 0x16c(0x01)
	None bEnableRootMotion; // 0x16d(0x01)
	None RootMotionRootLock; // 0x16e(0x01)
	None bForceRootLock; // 0x16f(0x01)
	None bUseNormalizedRootMotionScale; // 0x170(0x01)
	None bRootMotionSettingsCopiedFromMontage; // 0x171(0x01)
	None AuthoredSyncMarkers; // 0x178(0x10)
	None bAnimRotationOnly; // 0x28(0x01)
	None TrackBoneNames; // 0x30(0x10)
	None LinkupCache; // 0x40(0x10)
	None BoneUseAnimTranslation; // 0x50(0x10)
	None ForceUseMeshTranslation; // 0x60(0x10)
	None UseTranslationBoneNames; // 0x70(0x10)
	None ForceMeshTranslationBoneNames; // 0x80(0x10)
	None PreviewSkelMeshName; // 0x90(0x08)
	None BestRatioSkelMeshName; // 0x98(0x08)
	None CurrentAsset; // 0x268(0x08)
	None PostEvaluateAnimEvent; // 0x270(0x10)
	None NumFrames; // 0xa8(0x04)
	None Interpolation; // 0xac(0x01)
	None RetargetSource; // 0xb0(0x08)
	None BoneCompressionSettings; // 0xc8(0x08)
	None CurveCompressionSettings; // 0xd0(0x08)
	None bEnableRootMotion; // 0xd8(0x01)
	None RootMotionRootLock; // 0xd9(0x01)
	None bForceRootLock; // 0xda(0x01)
	None bUseNormalizedRootMotionScale; // 0xdb(0x01)
	None ApplicationWillDeactivateDelegate; // 0xb0(0x10)
	None ApplicationHasReactivatedDelegate; // 0xc0(0x10)
	None ApplicationWillEnterBackgroundDelegate; // 0xd0(0x10)
	None ApplicationHasEnteredForegroundDelegate; // 0xe0(0x10)
	None ApplicationWillTerminateDelegate; // 0xf0(0x10)
	None ApplicationShouldUnloadResourcesDelegate; // 0x100(0x10)
	None ApplicationReceivedStartupArgumentsDelegate; // 0x110(0x10)
	None OnTemperatureChangeDelegate; // 0x120(0x10)
	None OnLowPowerModeDelegate; // 0x130(0x10)
	None ArrowColor; // 0x430(0x04)
	None ArrowSize; // 0x434(0x04)
	None ScreenSize; // 0x438(0x04)
	None bIsScreenSizeScaled; // 0x43c(0x01)
	None bTreatAsASprite; // 0x43c(0x01)
	None Object; // 0x28(0x08)
	None Exporter; // 0x30(0x08)
	None Filename; // 0x38(0x10)
	None bSelected; // 0x48(0x01)
	None bReplaceIdentical; // 0x49(0x01)
	None bPrompt; // 0x4a(0x01)
	None bAutomated; // 0x4b(0x01)
	None bUseFileArchive; // 0x4c(0x01)
	None bWriteEmptyFiles; // 0x4d(0x01)
	None IgnoreObjectList; // 0x50(0x10)
	None Options; // 0x60(0x08)
	None Errors; // 0x68(0x10)
	None PrimaryAssetTypesToScan; // 0x38(0x10)
	None DirectoriesToExclude; // 0x48(0x10)
	None PrimaryAssetRules; // 0x58(0x10)
	None CustomPrimaryAssetRules; // 0x68(0x10)
	None bOnlyCookProductionAssets; // 0x78(0x01)
	None bShouldManagerDetermineTypeAndName; // 0x79(0x01)
	None bShouldGuessTypeAndNameInEditor; // 0x7a(0x01)
	None bShouldAcquireMissingChunksOnLoad; // 0x7b(0x01)
	None PrimaryAssetIdRedirects; // 0x80(0x10)
	None PrimaryAssetTypeRedirects; // 0x90(0x10)
	None AssetPathRedirects; // 0xa0(0x10)
	None MetaDataTagsForAssetRegistry; // 0xb0(0x50)
	None PrimaryAssetTypeWrangleWhitelist; // 0x100(0x10)
	None bForceUseAllBundlesDuringLoadRecursive; // 0x110(0x01)
	None MappedAssets; // 0x28(0x10)
	None Completed; // 0x30(0x10)
	None SaveGameObject; // 0x60(0x08)
	None Completed; // 0x78(0x10)
	None Completed; // 0x78(0x10)
	None Completed; // 0x78(0x10)
	None Completed; // 0x78(0x10)
	None Completed; // 0x78(0x10)
	None AtmosphericFogComponent; // 0x220(0x08)
	None SunMultiplier; // 0x208(0x04)
	None FogMultiplier; // 0x20c(0x04)
	None DensityMultiplier; // 0x210(0x04)
	None DensityOffset; // 0x214(0x04)
	None DistanceScale; // 0x218(0x04)
	None AltitudeScale; // 0x21c(0x04)
	None DistanceOffset; // 0x220(0x04)
	None GroundOffset; // 0x224(0x04)
	None StartDistance; // 0x228(0x04)
	None SunDiscScale; // 0x22c(0x04)
	None DefaultBrightness; // 0x230(0x04)
	None DefaultLightColor; // 0x234(0x04)
	None bDisableSunDisk; // 0x238(0x01)
	None bAtmosphereAffectsSunIlluminance; // 0x238(0x01)
	None bDisableGroundScattering; // 0x238(0x01)
	None PrecomputeParams; // 0x23c(0x2c)
	None TransmittanceTexture; // 0x268(0x08)
	None IrradianceTexture; // 0x270(0x08)
	None DefaultSoundClassName; // 0x38(0x18)
	None DefaultMediaSoundClassName; // 0x50(0x18)
	None DefaultSoundConcurrencyName; // 0x68(0x18)
	None DefaultBaseSoundMix; // 0x80(0x18)
	None VoiPSoundClass; // 0x98(0x18)
	None MasterSubmix; // 0xb0(0x18)
	None ReverbSubmix; // 0xc8(0x18)
	None EQSubmix; // 0xe0(0x18)
	None VoiPSampleRate; // 0xf8(0x04)
	None DefaultReverbSendLevel; // 0xfc(0x04)
	None MaximumConcurrentStreams; // 0x100(0x04)
	None GlobalMinPitchScale; // 0x104(0x04)
	None GlobalMaxPitchScale; // 0x108(0x04)
	None QualityLevels; // 0x110(0x10)
	None bAllowPlayWhenSilent; // 0x120(0x01)
	None bDisableMasterEQ; // 0x120(0x01)
	None bAllowCenterChannel3DPanning; // 0x120(0x01)
	None NumStoppingSources; // 0x124(0x04)
	None PanningMethod; // 0x128(0x01)
	None MonoChannelUpmixMethod; // 0x129(0x01)
	None DialogueFilenameFormat; // 0x130(0x10)
	None Priority; // 0x258(0x04)
	None bEnabled; // 0x25c(0x01)
	None Settings; // 0x260(0x20)
	None AmbientZoneSettings; // 0x280(0x24)
	None ActorsToPoll; // 0x38(0x10)
	None EngineTestModules; // 0x28(0x10)
	None EditorTestModules; // 0x38(0x10)
	None AutomationTestmap; // 0x48(0x18)
	None EditorPerformanceTestMaps; // 0x60(0x10)
	None AssetsToOpen; // 0x70(0x10)
	None BuildPromotionTest; // 0x80(0x1f0)
	None MaterialEditorPromotionTest; // 0x270(0x30)
	None ParticleEditorPromotionTest; // 0x2a0(0x10)
	None BlueprintEditorPromotionTest; // 0x2b0(0x30)
	None TestLevelFolders; // 0x2e0(0x10)
	None ExternalTools; // 0x2f0(0x10)
	None ImportExportTestDefinitions; // 0x300(0x10)
	None LaunchOnSettings; // 0x310(0x10)
	None DefaultScreenshotResolution; // 0x320(0x08)
	None DefaultTimeToLive; // 0x30(0x04)
	None LockTimeAfterAvoid; // 0x34(0x04)
	None LockTimeAfterClean; // 0x38(0x04)
	None DeltaTimeToPredict; // 0x3c(0x04)
	None ArtificialRadiusExpansion; // 0x40(0x04)
	None TestHeightDifference; // 0x44(0x04)
	None HeightCheckMargin; // 0x48(0x04)
	None BandwidthGenerator; // 0x220(0x20)
	None Sprite; // 0x430(0x08)
	None bIsScreenSizeScaled; // 0x438(0x01)
	None ScreenSize; // 0x43c(0x04)
	None U; // 0x440(0x04)
	None UL; // 0x444(0x04)
	None V; // 0x448(0x04)
	None VL; // 0x44c(0x04)
	None BoneTree; // 0x38(0x10)
	None RefLocalPoses; // 0x48(0x10)
	None VirtualBoneGuid; // 0x170(0x10)
	None VirtualBones; // 0x180(0x10)
	None Sockets; // 0x190(0x10)
	None SmartNames; // 0x1f0(0x50)
	None BlendProfiles; // 0x270(0x10)
	None SlotGroups; // 0x280(0x10)
	None AssetUserData; // 0x358(0x10)
	None OwningSkeleton; // 0x30(0x08)
	None ProfileEntries; // 0x38(0x10)
	None ApplicationWillDeactivateDelegate; // 0x198(0x10)
	None ApplicationHasReactivatedDelegate; // 0x1a8(0x10)
	None ApplicationWillEnterBackgroundDelegate; // 0x1b8(0x10)
	None ApplicationHasEnteredForegroundDelegate; // 0x1c8(0x10)
	None ApplicationWillTerminateDelegate; // 0x1d8(0x10)
	None ApplicationShouldUnloadResourcesDelegate; // 0x1e8(0x10)
	None ApplicationReceivedStartupArgumentsDelegate; // 0x1f8(0x10)
	None ApplicationRegisteredForRemoteNotificationsDelegate; // 0x208(0x10)
	None ApplicationRegisteredForUserNotificationsDelegate; // 0x218(0x10)
	None ApplicationFailedToRegisterForRemoteNotificationsDelegate; // 0x228(0x10)
	None ApplicationReceivedRemoteNotificationDelegate; // 0x238(0x10)
	None ApplicationReceivedLocalNotificationDelegate; // 0x248(0x10)
	None ApplicationReceivedScreenOrientationChangedNotificationDelegate; // 0x258(0x10)
	None AggGeom; // 0x28(0x58)
	None BoneName; // 0x80(0x08)
	None PhysicsType; // 0x88(0x01)
	None bAlwaysFullAnimWeight; // 0x89(0x01)
	None bConsiderForBounds; // 0x89(0x01)
	None bMeshCollideAll; // 0x89(0x01)
	None bDoubleSidedGeometry; // 0x89(0x01)
	None bGenerateNonMirroredCollision; // 0x89(0x01)
	None bSharedCookedData; // 0x89(0x01)
	None bGenerateMirroredCollision; // 0x89(0x01)
	None bSupportUVsAndFaceRemap; // 0x89(0x01)
	None CollisionReponse; // 0x8b(0x01)
	None CollisionTraceFlag; // 0x8c(0x01)
	None PhysMaterial; // 0x90(0x08)
	None WalkableSlopeOverride; // 0x98(0x10)
	None DefaultInstance; // 0x120(0x110)
	None BuildScale3D; // 0x238(0x0c)
	None BlendPoses; // 0x28(0x10)
	None Location; // 0x28(0x0c)
	None Rotation; // 0x34(0x0c)
	None HiddenLevels; // 0x40(0x10)
	None Zoom2D; // 0x28(0x04)
	None Location; // 0x2c(0x08)
	None BoxExtent; // 0x448(0x0c)
	None LineThickness; // 0x454(0x04)
	None CaptureComponent; // 0x220(0x08)
	None CaptureOffsetComponent; // 0x208(0x08)
	None ReflectionSourceType; // 0x210(0x01)
	None Cubemap; // 0x218(0x08)
	None SourceCubemapAngle; // 0x220(0x04)
	None Brightness; // 0x224(0x04)
	None CaptureOffset; // 0x228(0x0c)
	None MapBuildDataId; // 0x234(0x10)
	None BoxTransitionDistance; // 0x280(0x04)
	None PreviewInfluenceBox; // 0x288(0x08)
	None PreviewCaptureBox; // 0x290(0x08)
	None bEnabled; // 0x28(0x01)
	None Node; // 0x30(0x08)
	None bStepOnce; // 0x38(0x01)
	None bStepOnce_WasPreviouslyDisabled; // 0x38(0x01)
	None bStepOnce_RemoveAfterHit; // 0x38(0x01)
	None BitmapFilename; // 0x28(0x10)
	None Tooltip; // 0x38(0x10)
	None NotifyBadParams; // 0x48(0x01)
	None Vertices; // 0x50(0x10)
	None Polys; // 0x60(0x10)
	None Layer; // 0x70(0x08)
	None MergeCoplanars; // 0x78(0x01)
	None Brush; // 0x430(0x08)
	None BrushBodySetup; // 0x438(0x08)
	None ButtonStyle; // 0x28(0x278)
	None CameraInterpGroup; // 0x28(0x08)
	None AnimLength; // 0x30(0x04)
	None BoundingBox; // 0x34(0x1c)
	None bRelativeToInitialTransform; // 0x50(0x01)
	None bRelativeToInitialFOV; // 0x50(0x01)
	None BaseFOV; // 0x54(0x04)
	None BasePostProcessSettings; // 0x60(0x550)
	None BasePostProcessBlendWeight; // 0x5b0(0x04)
	None CamAnim; // 0x28(0x08)
	None InterpGroupInst; // 0x30(0x08)
	None PlayRate; // 0x50(0x04)
	None MoveTrack; // 0x68(0x08)
	None MoveInst; // 0x70(0x08)
	None PlaySpace; // 0x78(0x01)
	None ActiveShakes; // 0x48(0x10)
	None ExpiredPooledShakesMap; // 0x58(0x50)
	None SplitScreenShakeScale; // 0xa8(0x04)
	None CameraShakeSourceComponent; // 0x220(0x08)
	None Attenuation; // 0x208(0x01)
	None InnerAttenuationRadius; // 0x20c(0x04)
	None OuterAttenuationRadius; // 0x210(0x04)
	None CameraShake; // 0x218(0x08)
	None bAutoPlay; // 0x220(0x01)
	None OrgX; // 0x28(0x04)
	None OrgY; // 0x2c(0x04)
	None ClipX; // 0x30(0x04)
	None ClipY; // 0x34(0x04)
	None DrawColor; // 0x38(0x04)
	None bCenterX; // 0x3c(0x01)
	None bCenterY; // 0x3c(0x01)
	None bNoSmooth; // 0x3c(0x01)
	None SizeX; // 0x40(0x04)
	None SizeY; // 0x44(0x04)
	None ColorModulate; // 0x50(0x10)
	None DefaultTexture; // 0x60(0x08)
	None GradientTexture0; // 0x68(0x08)
	None ReporterGraph; // 0x70(0x08)
	None TargetGamma; // 0xb8(0x04)
	None SizeX; // 0xc0(0x04)
	None SizeY; // 0xc4(0x04)
	None ClearColor; // 0xc8(0x10)
	None AddressX; // 0xd8(0x01)
	None AddressY; // 0xd9(0x01)
	None bForceLinearGamma; // 0xda(0x01)
	None bHDR; // 0xda(0x01)
	None bGPUSharedFlag; // 0xda(0x01)
	None RenderTargetFormat; // 0xdb(0x01)
	None bAutoGenerateMips; // 0xdc(0x01)
	None MipsSamplerFilter; // 0xdd(0x01)
	None MipsAddressU; // 0xde(0x01)
	None MipsAddressV; // 0xdf(0x01)
	None OverrideFormat; // 0xe0(0x01)
	None OnCanvasRenderTargetUpdate; // 0xe8(0x10)
	None World; // 0xf8(0x08)
	None bShouldClearRenderTargetOnReceiveUpdate; // 0x100(0x01)
	None Friction; // 0x28(0x04)
	None StaticFriction; // 0x2c(0x04)
	None Restitution; // 0x30(0x04)
	None LinearEtherDrag; // 0x34(0x04)
	None AngularEtherDrag; // 0x38(0x04)
	None SleepingLinearVelocityThreshold; // 0x3c(0x04)
	None SleepingAngularVelocityThreshold; // 0x40(0x04)
	None DebugCameraControllerRef; // 0x28(0x08)
	None DebugCameraControllerClass; // 0x30(0x08)
	None CheckBoxStyle; // 0x28(0x580)
	None ChildActorClass; // 0x208(0x08)
	None ChildActor; // 0x210(0x08)
	None ChildActorTemplate; // 0x218(0x08)
	None Parent; // 0x1a80(0x08)
	None AllDelegates; // 0x28(0x10)
	None LocalCloudFiles; // 0x38(0x10)
	None bSuppressDelegateCalls; // 0x48(0x01)
	None Profiles; // 0x38(0x10)
	None DefaultChannelResponses; // 0x48(0x10)
	None EditProfiles; // 0x58(0x10)
	None ProfileRedirects; // 0x68(0x10)
	None CollisionChannelRedirects; // 0x78(0x10)
	None ComponentDelegateBindings; // 0x28(0x10)
	None ParentTables; // 0xa0(0x10)
	None OldParentTables; // 0xb0(0x10)
	None ParentTables; // 0xc8(0x10)
	None OldParentTables; // 0xd8(0x10)
	None AsyncLoadingThreadEnabled; // 0x38(0x01)
	None WarnIfTimeLimitExceeded; // 0x38(0x01)
	None TimeLimitExceededMultiplier; // 0x3c(0x04)
	None TimeLimitExceededMinTime; // 0x40(0x04)
	None MinBulkDataSizeForAsyncLoading; // 0x44(0x04)
	None UseBackgroundLevelStreaming; // 0x48(0x01)
	None AsyncLoadingUseFullTimeLimit; // 0x48(0x01)
	None AsyncLoadingTimeLimit; // 0x4c(0x04)
	None PriorityAsyncLoadingExtraTime; // 0x50(0x04)
	None LevelStreamingActorsUpdateTimeLimit; // 0x54(0x04)
	None PriorityLevelStreamingActorsUpdateExtraTime; // 0x58(0x04)
	None LevelStreamingComponentsRegistrationGranularity; // 0x5c(0x04)
	None LevelStreamingUnregisterComponentsTimeLimit; // 0x60(0x04)
	None LevelStreamingComponentsUnregistrationGranularity; // 0x64(0x04)
	None FlushStreamingOnExit; // 0x68(0x01)
	None EventDrivenLoaderEnabled; // 0x68(0x01)
	None TimeBetweenPurgingPendingKillObjects; // 0x38(0x04)
	None FlushStreamingOnGC; // 0x3c(0x01)
	None AllowParallelGC; // 0x3c(0x01)
	None IncrementalBeginDestroyEnabled; // 0x3c(0x01)
	None MultithreadedDestructionEnabled; // 0x3c(0x01)
	None CreateGCClusters; // 0x3c(0x01)
	None AssetClusteringEnabled; // 0x3c(0x01)
	None ActorClusteringEnabled; // 0x3c(0x01)
	None BlueprintClusteringEnabled; // 0x3c(0x01)
	None UseDisregardForGCOnDedicatedServers; // 0x3d(0x01)
	None MinGCClusterSize; // 0x40(0x04)
	None NumRetriesBeforeForcingGC; // 0x44(0x04)
	None MaxObjectsNotConsideredByGC; // 0x48(0x04)
	None SizeOfPermanentObjectPool; // 0x4c(0x04)
	None MaxObjectsInGame; // 0x50(0x04)
	None MaxObjectsInEditor; // 0x54(0x04)
	None CullDistances; // 0x258(0x10)
	None bEnabled; // 0x268(0x01)
	None FloatCurve; // 0x30(0x80)
	None bIsEventCurve; // 0xb0(0x01)
	None FloatCurves; // 0x30(0x200)
	None AdjustHue; // 0x230(0x04)
	None AdjustSaturation; // 0x234(0x04)
	None AdjustBrightness; // 0x238(0x04)
	None AdjustBrightnessCurve; // 0x23c(0x04)
	None AdjustVibrance; // 0x240(0x04)
	None AdjustMinAlpha; // 0x244(0x04)
	None AdjustMaxAlpha; // 0x248(0x04)
	None LevelIndex; // 0xb8(0x04)
	None FirstResourceMemMip; // 0xbc(0x04)
	None bTemporarilyDisableStreaming; // 0xc0(0x01)
	None AddressX; // 0xc1(0x01)
	None AddressY; // 0xc2(0x01)
	None ImportedSize; // 0xc4(0x08)
	None TextureSize; // 0xe8(0x04)
	None GradientCurves; // 0xf0(0x10)
	None FloatCurves; // 0x30(0x180)
	None bShowSelectedInfo; // 0x588(0x01)
	None bIsFrozenRendering; // 0x588(0x01)
	None bIsOrbitingSelectedActor; // 0x588(0x01)
	None bOrbitPivotUseCenter; // 0x588(0x01)
	None bEnableBufferVisualization; // 0x588(0x01)
	None bEnableBufferVisualizationFullMode; // 0x588(0x01)
	None bIsBufferVisualizationInputSetup; // 0x588(0x01)
	None bLastDisplayEnabled; // 0x588(0x01)
	None DrawFrustum; // 0x590(0x08)
	None SelectedActor; // 0x598(0x08)
	None SelectedComponent; // 0x5a0(0x08)
	None SelectedHitPoint; // 0x5a8(0x88)
	None OriginalControllerRef; // 0x630(0x08)
	None OriginalPlayer; // 0x638(0x08)
	None SpeedScale; // 0x640(0x04)
	None InitialMaxSpeed; // 0x644(0x04)
	None InitialAccel; // 0x648(0x04)
	None InitialDecel; // 0x64c(0x04)
	None CycleViewModes; // 0x38(0x10)
	None Decal; // 0x220(0x08)
	None RollbackNetStartupActors; // 0x870(0x50)
	None CheckpointSaveMaxMSPerFrame; // 0xc84(0x04)
	None MulticastRecordOptions; // 0xcb8(0x10)
	None bIsLocalReplay; // 0xd18(0x01)
	None SpectatorControllers; // 0xd20(0x10)
	None NetDriver; // 0x30(0x08)
	None DemoNetDriver; // 0x38(0x08)
	None TextureLODGroups; // 0x28(0x10)
	None DeviceType; // 0x38(0x10)
	None BaseProfileName; // 0x48(0x10)
	None Parent; // 0x58(0x08)
	None CVars; // 0x78(0x10)
	None Profiles; // 0x28(0x10)
	None Gender; // 0x28(0x01)
	None Plurality; // 0x29(0x01)
	None LocalizationGUID; // 0x2c(0x10)
	None bMature; // 0x28(0x01)
	None bOverride_SubtitleOverride; // 0x28(0x01)
	None SpokenText; // 0x30(0x10)
	None SubtitleOverride; // 0x40(0x10)
	None ContextMappings; // 0x50(0x10)
	None LocalizationGUID; // 0x60(0x10)
	None LightComponent; // 0x220(0x08)
	None bEnabled; // 0x228(0x01)
	None LightGuid; // 0x208(0x10)
	None Brightness; // 0x218(0x04)
	None Intensity; // 0x21c(0x04)
	None LightColor; // 0x220(0x04)
	None bAffectsWorld; // 0x224(0x01)
	None CastShadows; // 0x224(0x01)
	None CastStaticShadows; // 0x224(0x01)
	None CastDynamicShadows; // 0x224(0x01)
	None bAffectTranslucentLighting; // 0x224(0x01)
	None bTransmission; // 0x224(0x01)
	None bCastVolumetricShadow; // 0x224(0x01)
	None bCastDeepShadow; // 0x224(0x01)
	None bCastRaytracedShadow; // 0x225(0x01)
	None bAffectReflection; // 0x225(0x01)
	None bAffectGlobalIllumination; // 0x225(0x01)
	None IndirectLightingIntensity; // 0x228(0x04)
	None VolumetricScatteringIntensity; // 0x22c(0x04)
	None SamplesPerPixel; // 0x230(0x04)
	None Temperature; // 0x238(0x04)
	None MaxDrawDistance; // 0x23c(0x04)
	None MaxDistanceFadeRange; // 0x240(0x04)
	None bUseTemperature; // 0x244(0x01)
	None ShadowMapChannel; // 0x248(0x04)
	None MinRoughness; // 0x250(0x04)
	None SpecularScale; // 0x254(0x04)
	None ShadowResolutionScale; // 0x258(0x04)
	None ShadowBias; // 0x25c(0x04)
	None ShadowSlopeBias; // 0x260(0x04)
	None ShadowSharpen; // 0x264(0x04)
	None ContactShadowLength; // 0x268(0x04)
	None ContactShadowLengthInWS; // 0x26c(0x01)
	None InverseSquaredFalloff; // 0x26c(0x01)
	None CastTranslucentShadows; // 0x26c(0x01)
	None bCastShadowsFromCinematicObjectsOnly; // 0x26c(0x01)
	None bAffectDynamicIndirectLighting; // 0x26c(0x01)
	None bForceCachedShadowsForMovablePrimitives; // 0x26c(0x01)
	None LightingChannels; // 0x270(0x01)
	None LightFunctionMaterial; // 0x278(0x08)
	None LightFunctionScale; // 0x280(0x0c)
	None IESTexture; // 0x290(0x08)
	None bUseIESBrightness; // 0x298(0x01)
	None IESBrightnessScale; // 0x29c(0x04)
	None LightFunctionFadeDistance; // 0x2a0(0x04)
	None DisabledBrightness; // 0x2a4(0x04)
	None bEnableLightShaftBloom; // 0x2a8(0x01)
	None BloomScale; // 0x2ac(0x04)
	None BloomThreshold; // 0x2b0(0x04)
	None BloomMaxBrightness; // 0x2b4(0x04)
	None BloomTint; // 0x2b8(0x04)
	None bUseRayTracedDistanceFieldShadows; // 0x2bc(0x01)
	None RayStartOffsetDepthScale; // 0x2c0(0x04)
	None ShadowCascadeBiasDistribution; // 0x338(0x04)
	None bEnableLightShaftOcclusion; // 0x33c(0x01)
	None OcclusionMaskDarkness; // 0x340(0x04)
	None OcclusionDepthRange; // 0x344(0x04)
	None LightShaftOverrideDirection; // 0x348(0x0c)
	None WholeSceneDynamicShadowRadius; // 0x354(0x04)
	None DynamicShadowDistanceMovableLight; // 0x358(0x04)
	None DynamicShadowDistanceStationaryLight; // 0x35c(0x04)
	None DynamicShadowCascades; // 0x360(0x04)
	None CascadeDistributionExponent; // 0x364(0x04)
	None CascadeTransitionFraction; // 0x368(0x04)
	None ShadowDistanceFadeoutFraction; // 0x36c(0x04)
	None bOnlyMovableObjectsInCascades; // 0x370(0x01)
	None bUseInsetShadowsForMovableObjects; // 0x370(0x01)
	None FarShadowCascadeCount; // 0x374(0x04)
	None FarShadowDistance; // 0x378(0x04)
	None DistanceFieldShadowDistance; // 0x37c(0x04)
	None LightSourceAngle; // 0x380(0x04)
	None LightSourceSoftAngle; // 0x384(0x04)
	None TraceDistance; // 0x388(0x04)
	None LightmassSettings; // 0x38c(0x10)
	None bCastModulatedShadows; // 0x39c(0x01)
	None ModulatedShadowColor; // 0x3a0(0x04)
	None ShadowAmount; // 0x3a4(0x04)
	None bUsedAsAtmosphereSunLight; // 0x3a8(0x01)
	None AtmosphereSunLightIndex; // 0x3ac(0x04)
	None bCanBeBaked; // 0x30(0x01)
	None bBakedDataSuccesfully; // 0x30(0x01)
	None Constant; // 0x38(0x04)
	None ConstantCurve; // 0x38(0x18)
	None ParameterName; // 0x40(0x08)
	None MinInput; // 0x48(0x04)
	None MaxInput; // 0x4c(0x04)
	None MinOutput; // 0x50(0x04)
	None MaxOutput; // 0x54(0x04)
	None ParamMode; // 0x58(0x01)
	None Min; // 0x38(0x04)
	None Max; // 0x3c(0x04)
	None ConstantCurve; // 0x38(0x18)
	None Constant; // 0x38(0x0c)
	None bLockAxes; // 0x44(0x01)
	None LockedAxes; // 0x48(0x01)
	None ConstantCurve; // 0x38(0x18)
	None bLockAxes; // 0x50(0x01)
	None LockedAxes; // 0x54(0x01)
	None ParameterName; // 0x50(0x08)
	None MinInput; // 0x58(0x0c)
	None MaxInput; // 0x64(0x0c)
	None MinOutput; // 0x70(0x0c)
	None MaxOutput; // 0x7c(0x0c)
	None ParamModes; // 0x88(0x03)
	None Max; // 0x38(0x0c)
	None Min; // 0x44(0x0c)
	None bLockAxes; // 0x50(0x01)
	None LockedAxes; // 0x54(0x01)
	None MirrorFlags; // 0x55(0x03)
	None bUseExtremes; // 0x58(0x01)
	None ConstantCurve; // 0x38(0x18)
	None bLockAxes1; // 0x50(0x01)
	None bLockAxes2; // 0x50(0x01)
	None LockedAxes; // 0x54(0x02)
	None MirrorFlags; // 0x56(0x03)
	None bUseExtremes; // 0x5c(0x01)
	None FrustumColor; // 0x430(0x04)
	None FrustumAngle; // 0x434(0x04)
	None FrustumAspectRatio; // 0x438(0x04)
	None FrustumStartDist; // 0x43c(0x04)
	None FrustumEndDist; // 0x440(0x04)
	None Texture; // 0x448(0x08)
	None Schema; // 0x28(0x08)
	None Nodes; // 0x30(0x10)
	None bEditable; // 0x40(0x01)
	None bAllowDeletion; // 0x40(0x01)
	None bAllowRenaming; // 0x40(0x01)
	None Blueprint; // 0x28(0x08)
	None Graph; // 0x30(0x08)
	None Node; // 0x38(0x08)
	None bIsDebugging; // 0x48(0x01)
	None DeprecatedPins; // 0x38(0x10)
	None NodePosX; // 0x48(0x04)
	None NodePosY; // 0x4c(0x04)
	None NodeWidth; // 0x50(0x04)
	None NodeHeight; // 0x54(0x04)
	None AdvancedPinDisplay; // 0x58(0x01)
	None EnabledState; // 0x59(0x01)
	None bDisplayAsDisabled; // 0x5b(0x01)
	None bUserSetEnabledState; // 0x5b(0x01)
	None bIsNodeEnabled; // 0x5b(0x01)
	None bHasCompilerMessage; // 0x5b(0x01)
	None NodeComment; // 0x60(0x10)
	None ErrorType; // 0x70(0x04)
	None ErrorMsg; // 0x78(0x10)
	None NodeGuid; // 0x88(0x10)
	None Link; // 0x98(0x10)
	None Excerpt; // 0xa8(0x10)
	None PinName; // 0x28(0x10)
	None PinToolTip; // 0x38(0x10)
	None Direction; // 0x48(0x01)
	None PinType; // 0x50(0x58)
	None DefaultValue; // 0xa8(0x10)
	None AutogeneratedDefaultValue; // 0xb8(0x10)
	None DefaultObject; // 0xc8(0x08)
	None DefaultTextValue; // 0xd0(0x18)
	None LinkedTo; // 0xe8(0x10)
	None SubPins; // 0xf8(0x10)
	None ParentPin; // 0x108(0x08)
	None ReferencePassThroughConnection; // 0x110(0x08)
	None ParticleSystemComponent; // 0x220(0x08)
	None bDestroyOnSystemFinish; // 0x228(0x01)
	None bPostUpdateTickGroup; // 0x228(0x01)
	None bCurrentlyActive; // 0x228(0x01)
	None OnParticleSpawn; // 0x230(0x10)
	None OnParticleBurst; // 0x240(0x10)
	None OnParticleDeath; // 0x250(0x10)
	None OnParticleCollide; // 0x260(0x10)
	None PS_CameraEffect; // 0x270(0x08)
	None PS_CameraEffectNonExtremeContent; // 0x278(0x08)
	None BaseCamera; // 0x280(0x08)
	None RelativeTransform; // 0x290(0x30)
	None BaseFOV; // 0x2c0(0x04)
	None bAllowMultipleInstances; // 0x2c4(0x01)
	None bResetWhenRetriggered; // 0x2c4(0x01)
	None EmittersToTreatAsSame; // 0x2c8(0x10)
	None DistFromCamera; // 0x2d8(0x04)
	None FailedPlaceMessage; // 0x28(0x10)
	None MaxedOutMessage; // 0x38(0x10)
	None EnteredMessage; // 0x48(0x10)
	None LeftMessage; // 0x58(0x10)
	None GlobalNameChange; // 0x68(0x10)
	None SpecEnteredMessage; // 0x78(0x10)
	None NewPlayerMessage; // 0x88(0x10)
	None NewSpecMessage; // 0x98(0x10)
	None Component; // 0x220(0x08)
	None bEnabled; // 0x228(0x01)
	None FogDensity; // 0x208(0x04)
	None FogHeightFalloff; // 0x20c(0x04)
	None SecondFogData; // 0x210(0x0c)
	None FogInscatteringColor; // 0x21c(0x10)
	None InscatteringColorCubemap; // 0x230(0x08)
	None InscatteringColorCubemapAngle; // 0x238(0x04)
	None InscatteringTextureTint; // 0x23c(0x10)
	None FullyDirectionalInscatteringColorDistance; // 0x24c(0x04)
	None NonDirectionalInscatteringColorDistance; // 0x250(0x04)
	None DirectionalInscatteringExponent; // 0x254(0x04)
	None DirectionalInscatteringStartDistance; // 0x258(0x04)
	None DirectionalInscatteringColor; // 0x25c(0x10)
	None FogMaxOpacity; // 0x26c(0x04)
	None StartDistance; // 0x270(0x04)
	None StartDistancePerPlatformScale; // 0x274(0x04)
	None FogCutoffDistance; // 0x278(0x04)
	None bEnableVolumetricFog; // 0x27c(0x01)
	None VolumetricFogScatteringDistribution; // 0x280(0x04)
	None VolumetricFogAlbedo; // 0x284(0x04)
	None VolumetricFogEmissive; // 0x288(0x10)
	None VolumetricFogExtinctionScale; // 0x298(0x04)
	None VolumetricFogDistance; // 0x29c(0x04)
	None VolumetricFogStaticLightingScatteringIntensity; // 0x2a0(0x04)
	None bOverrideLightColorsWithFogInscatteringColors; // 0x2a4(0x01)
	None SupportedClass; // 0x28(0x08)
	None ExportRootScope; // 0x30(0x08)
	None FormatExtension; // 0x38(0x10)
	None FormatDescription; // 0x48(0x10)
	None PreferredFormatIndex; // 0x58(0x04)
	None TextIndent; // 0x5c(0x04)
	None bText; // 0x60(0x01)
	None bSelectedOnly; // 0x60(0x01)
	None bForceFileOperations; // 0x60(0x01)
	None ExportTask; // 0x68(0x08)
	None MaxSpeed; // 0x138(0x04)
	None Acceleration; // 0x13c(0x04)
	None Deceleration; // 0x140(0x04)
	None TurningBoost; // 0x144(0x04)
	None bPositionCorrected; // 0x148(0x01)
	None FontCacheType; // 0x30(0x01)
	None Characters; // 0x38(0x10)
	None Textures; // 0x48(0x10)
	None IsRemapped; // 0x58(0x04)
	None EmScale; // 0x5c(0x04)
	None Ascent; // 0x60(0x04)
	None Descent; // 0x64(0x04)
	None Leading; // 0x68(0x04)
	None Kerning; // 0x6c(0x04)
	None ImportOptions; // 0x70(0xb0)
	None NumCharacters; // 0x120(0x04)
	None MaxCharHeight; // 0x128(0x10)
	None ScalingFactor; // 0x138(0x04)
	None LegacyFontSize; // 0x13c(0x04)
	None LegacyFontName; // 0x140(0x08)
	None CompositeFont; // 0x148(0x38)
	None SourceFilename; // 0x30(0x10)
	None Hinting; // 0x40(0x01)
	None LoadingPolicy; // 0x41(0x01)
	None LayoutMethod; // 0x42(0x01)
	None Data; // 0x28(0xb0)
	None Attenuation; // 0x28(0xb0)
	None ForceFeedbackEffect; // 0x208(0x08)
	None bAutoDestroy; // 0x210(0x01)
	None bStopWhenOwnerDestroyed; // 0x210(0x01)
	None bLooping; // 0x210(0x01)
	None bIgnoreTimeDilation; // 0x210(0x01)
	None bOverrideAttenuation; // 0x210(0x01)
	None IntensityMultiplier; // 0x214(0x04)
	None AttenuationSettings; // 0x218(0x08)
	None AttenuationOverrides; // 0x220(0xb0)
	None OnForceFeedbackFinished; // 0x2d0(0x10)
	None ChannelDetails; // 0x28(0x10)
	None Duration; // 0x38(0x04)
	None BadPacketLossThreshold; // 0x220(0x04)
	None SeverePacketLossThreshold; // 0x224(0x04)
	None BadPingThreshold; // 0x228(0x04)
	None SeverePingThreshold; // 0x22c(0x04)
	None AdjustedNetSpeed; // 0x230(0x04)
	None LastNetSpeedUpdateTime; // 0x234(0x04)
	None TotalNetBandwidth; // 0x238(0x04)
	None MinDynamicBandwidth; // 0x23c(0x04)
	None MaxDynamicBandwidth; // 0x240(0x04)
	None bIsStandbyCheckingEnabled; // 0x244(0x01)
	None bHasStandbyCheatTriggered; // 0x244(0x01)
	None StandbyRxCheatTime; // 0x248(0x04)
	None StandbyTxCheatTime; // 0x24c(0x04)
	None PercentMissingForRxStandby; // 0x250(0x04)
	None PercentMissingForTxStandby; // 0x254(0x04)
	None PercentForBadPing; // 0x258(0x04)
	None JoinInProgressStandbyWaitTime; // 0x25c(0x04)
	None MoveRepSize; // 0x260(0x04)
	None MAXPOSITIONERRORSQUARED; // 0x264(0x04)
	None MAXNEARZEROVELOCITYSQUARED; // 0x268(0x04)
	None CLIENTADJUSTUPDATECOST; // 0x26c(0x04)
	None MAXCLIENTUPDATEINTERVAL; // 0x270(0x04)
	None MaxClientForcedUpdateDuration; // 0x274(0x04)
	None ServerForcedUpdateHitchThreshold; // 0x278(0x04)
	None ServerForcedUpdateHitchCooldown; // 0x27c(0x04)
	None MaxMoveDeltaTime; // 0x280(0x04)
	None MaxClientSmoothingDeltaTime; // 0x284(0x04)
	None ClientNetSendMoveDeltaTime; // 0x288(0x04)
	None ClientNetSendMoveDeltaTimeThrottled; // 0x28c(0x04)
	None ClientNetSendMoveDeltaTimeStationary; // 0x290(0x04)
	None ClientNetSendMoveThrottleAtNetSpeed; // 0x294(0x04)
	None ClientNetSendMoveThrottleOverPlayerCount; // 0x298(0x04)
	None ClientAuthorativePosition; // 0x29c(0x01)
	None ClientErrorUpdateRateLimit; // 0x2a0(0x04)
	None ClientNetCamUpdateDeltaTime; // 0x2a4(0x04)
	None ClientNetCamUpdatePositionLimit; // 0x2a8(0x04)
	None bMovementTimeDiscrepancyDetection; // 0x2ac(0x01)
	None bMovementTimeDiscrepancyResolution; // 0x2ad(0x01)
	None MovementTimeDiscrepancyMaxTimeMargin; // 0x2b0(0x04)
	None MovementTimeDiscrepancyMinTimeMargin; // 0x2b4(0x04)
	None MovementTimeDiscrepancyResolutionRate; // 0x2b8(0x04)
	None MovementTimeDiscrepancyDriftAllowance; // 0x2bc(0x04)
	None bMovementTimeDiscrepancyForceCorrectionsDuringResolution; // 0x2c0(0x01)
	None bUseDistanceBasedRelevancy; // 0x2c1(0x01)
	None MaxSpectators; // 0x220(0x04)
	None MaxPlayers; // 0x224(0x04)
	None MaxPartySize; // 0x228(0x04)
	None MaxSplitscreensPerConnection; // 0x22c(0x01)
	None bRequiresPushToTalk; // 0x22d(0x01)
	None SessionName; // 0x230(0x08)
	None SpotLightComponent; // 0x230(0x08)
	None Amplitudes; // 0x28(0x10)
	None SampleRate; // 0x38(0x04)
	None HapticDetails; // 0x28(0x110)
	None SoundWave; // 0x28(0x08)
	None ProxyMeshes; // 0x28(0x10)
	None bShouldPauseWhileAdOpen; // 0x38(0x01)
	None ClickedBannerDelegates; // 0x40(0x10)
	None ClosedAdDelegates; // 0x50(0x10)
	None Records; // 0x28(0x10)
	None UnnecessaryComponents; // 0x38(0x10)
	None InputActionDelegateBindings; // 0x28(0x10)
	None InputAxisDelegateBindings; // 0x28(0x10)
	None InputAxisKeyDelegateBindings; // 0x28(0x10)
	None InputKeyDelegateBindings; // 0x28(0x10)
	None AxisConfig; // 0x28(0x10)
	None bAltEnterTogglesFullscreen; // 0x38(0x01)
	None bF11TogglesFullscreen; // 0x38(0x01)
	None bUseMouseForTouch; // 0x38(0x01)
	None bEnableMouseSmoothing; // 0x38(0x01)
	None bEnableFOVScaling; // 0x38(0x01)
	None bCaptureMouseOnLaunch; // 0x38(0x01)
	None bDefaultViewportMouseLock; // 0x38(0x01)
	None bAlwaysShowTouchInterface; // 0x38(0x01)
	None bShowConsoleOnFourFingerTap; // 0x39(0x01)
	None bEnableGestureRecognizer; // 0x39(0x01)
	None bUseAutocorrect; // 0x3a(0x01)
	None ExcludedAutocorrectOS; // 0x40(0x10)
	None ExcludedAutocorrectCultures; // 0x50(0x10)
	None ExcludedAutocorrectDeviceModels; // 0x60(0x10)
	None DefaultViewportMouseCaptureMode; // 0x70(0x01)
	None DefaultViewportMouseLockMode; // 0x71(0x01)
	None FOVScale; // 0x74(0x04)
	None DoubleClickTime; // 0x78(0x04)
	None ActionMappings; // 0x80(0x10)
	None AxisMappings; // 0x90(0x10)
	None SpeechMappings; // 0xa0(0x10)
	None DefaultTouchInterface; // 0xb0(0x18)
	None ConsoleKey; // 0xc8(0x18)
	None ConsoleKeys; // 0xe0(0x10)
	None InputTouchDelegateBindings; // 0x28(0x10)
	None Tabs; // 0x28(0x10)
	None ActiveTab; // 0x38(0x04)
	None InterpLength; // 0x28(0x04)
	None PathBuildTime; // 0x2c(0x04)
	None InterpGroups; // 0x30(0x10)
	None CurveEdSetup; // 0x40(0x08)
	None EdSectionStart; // 0x48(0x04)
	None EdSectionEnd; // 0x4c(0x04)
	None bShouldBakeAndPrune; // 0x50(0x01)
	None CachedDirectorGroup; // 0x58(0x08)
	None AllEventNames; // 0x60(0x10)
	None Caption; // 0x28(0x10)
	None InterpTracks; // 0x30(0x10)
	None GroupName; // 0x40(0x08)
	None GroupColor; // 0x48(0x04)
	None bCollapsed; // 0x4c(0x01)
	None bVisible; // 0x4c(0x01)
	None bIsFolder; // 0x4c(0x01)
	None bIsParented; // 0x4c(0x01)
	None bIsSelected; // 0x4c(0x01)
	None CameraAnimInst; // 0x50(0x08)
	None CompressTolerance; // 0x58(0x04)
	None Group; // 0x28(0x08)
	None GroupActor; // 0x30(0x08)
	None TrackInst; // 0x38(0x10)
	None Duration; // 0xf0(0x04)
	None bPauseOnImpact; // 0xf4(0x01)
	None bSweep; // 0xf8(0x01)
	None TeleportType; // 0xf9(0x01)
	None BehaviourType; // 0xfa(0x01)
	None bCheckIfStillInWorld; // 0xfb(0x01)
	None bForceSubStepping; // 0xfc(0x01)
	None OnInterpToReverse; // 0x100(0x10)
	None OnInterpToStop; // 0x110(0x10)
	None OnWaitBeginDelegate; // 0x120(0x10)
	None OnWaitEndDelegate; // 0x130(0x10)
	None OnResetDelegate; // 0x140(0x10)
	None MaxSimulationTimeStep; // 0x150(0x04)
	None MaxSimulationIterations; // 0x154(0x04)
	None ControlPoints; // 0x158(0x10)
	None SlotName; // 0x90(0x08)
	None AnimSeqs; // 0x98(0x10)
	None bSkipAnimNotifiers; // 0xa8(0x01)
	None BoolTrack; // 0x70(0x10)
	None PropertyName; // 0x80(0x08)
	None PropertyName; // 0x90(0x08)
	None CutTrack; // 0x70(0x10)
	None bSimulateCameraCutsOnClients; // 0x80(0x01)
	None EventTrack; // 0x70(0x10)
	None bFireEventsWhenForwards; // 0x80(0x01)
	None bFireEventsWhenBackwards; // 0x80(0x01)
	None bFireEventsWhenJumpingForwards; // 0x80(0x01)
	None bUseCustomEventName; // 0x80(0x01)
	None bPersistFade; // 0x90(0x01)
	None bFadeAudio; // 0x90(0x01)
	None FadeColor; // 0x94(0x10)
	None AnimBlueprintClass; // 0x90(0x08)
	None AnimClass; // 0x98(0x08)
	None ParamName; // 0xa0(0x08)
	None TargetMaterials; // 0x90(0x10)
	None ParamName; // 0xa0(0x08)
	None ParamName; // 0x90(0x08)
	None PropertyName; // 0x90(0x08)
	None LastUpdatePosition; // 0x28(0x04)
	None InterpProperty; // 0x28(0x28)
	None PropertyOuterObjectInst; // 0x50(0x08)
	None ResetBool; // 0x68(0x01)
	None ResetColor; // 0x60(0x04)
	None OldViewTarget; // 0x28(0x08)
	None LastUpdatePosition; // 0x28(0x04)
	None AnimScriptInstance; // 0x28(0x08)
	None ResetFloat; // 0x30(0x04)
	None MaterialInstances; // 0x28(0x10)
	None ResetFloats; // 0x38(0x10)
	None PrimitiveMaterialRefs; // 0x48(0x10)
	None InstancedTrack; // 0x58(0x08)
	None ResetFloat; // 0x28(0x04)
	None ResetFloat; // 0x60(0x04)
	None ResetColor; // 0x60(0x10)
	None ResetLocation; // 0x28(0x0c)
	None ResetRotation; // 0x34(0x0c)
	None LastUpdatePosition; // 0x28(0x04)
	None OldTimeDilation; // 0x28(0x04)
	None LastUpdatePosition; // 0x28(0x04)
	None PlayAudioComp; // 0x30(0x08)
	None Action; // 0x28(0x01)
	None LastUpdatePosition; // 0x2c(0x04)
	None bSavedActiveState; // 0x30(0x01)
	None MaterialInstances; // 0x28(0x10)
	None ResetVectors; // 0x38(0x10)
	None PrimitiveMaterialRefs; // 0x48(0x10)
	None InstancedTrack; // 0x58(0x08)
	None ResetVector; // 0x60(0x0c)
	None Action; // 0x28(0x01)
	None LastUpdatePosition; // 0x2c(0x04)
	None LinearColorTrack; // 0x70(0x18)
	None CurveTension; // 0x88(0x04)
	None PropertyName; // 0x90(0x08)
	None PosTrack; // 0x70(0x18)
	None EulerTrack; // 0x88(0x18)
	None LookupTrack; // 0xa0(0x10)
	None LookAtGroupName; // 0xb0(0x08)
	None LinCurveTension; // 0xb8(0x04)
	None AngCurveTension; // 0xbc(0x04)
	None bUseQuatInterpolation; // 0xc0(0x01)
	None bShowArrowAtKeys; // 0xc0(0x01)
	None bDisableMovement; // 0xc0(0x01)
	None bShowTranslationOnCurveEd; // 0xc0(0x01)
	None bShowRotationOnCurveEd; // 0xc0(0x01)
	None bHide3DTrack; // 0xc0(0x01)
	None RotMode; // 0xc4(0x01)
	None MoveAxis; // 0x90(0x01)
	None LookupTrack; // 0x98(0x10)
	None TrackKeys; // 0x70(0x10)
	None Sounds; // 0x90(0x10)
	None bPlayOnReverse; // 0xa0(0x01)
	None bContinueSoundOnMatineeEnd; // 0xa0(0x01)
	None bSuppressSubtitles; // 0xa0(0x01)
	None bTreatAsDialogue; // 0xa0(0x01)
	None bAttach; // 0xa0(0x01)
	None ToggleTrack; // 0x70(0x10)
	None bActivateSystemEachUpdate; // 0x80(0x01)
	None bActivateWithJustAttachedFlag; // 0x80(0x01)
	None bFireEventsWhenForwards; // 0x80(0x01)
	None bFireEventsWhenBackwards; // 0x80(0x01)
	None bFireEventsWhenJumpingForwards; // 0x80(0x01)
	None TargetMaterials; // 0x90(0x10)
	None ParamName; // 0xa0(0x08)
	None PropertyName; // 0x90(0x08)
	None VisibilityTrack; // 0x70(0x10)
	None bFireEventsWhenForwards; // 0x80(0x01)
	None bFireEventsWhenBackwards; // 0x80(0x01)
	None bFireEventsWhenJumpingForwards; // 0x80(0x01)
	None UnsignedInt16Variable; // 0x28(0x02)
	None UnsignedInt32Variable; // 0x2c(0x04)
	None UnsignedInt64Variable; // 0x30(0x08)
	None SignedInt8Variable; // 0x38(0x01)
	None SignedInt16Variable; // 0x3a(0x02)
	None SignedInt64Variable; // 0x40(0x08)
	None UnsignedInt8Variable; // 0x48(0x01)
	None SignedInt32Variable; // 0x4c(0x04)
	None LayerName; // 0x28(0x08)
	None bIsVisible; // 0x30(0x01)
	None ActorStats; // 0x38(0x10)
	None OwningWorld; // 0xb8(0x08)
	None Model; // 0xc0(0x08)
	None ModelComponents; // 0xc8(0x10)
	None ActorCluster; // 0xd8(0x08)
	None NumTextureStreamingUnbuiltComponents; // 0xe0(0x04)
	None NumTextureStreamingDirtyResources; // 0xe4(0x04)
	None LevelScriptActor; // 0xe8(0x08)
	None NavListStart; // 0xf0(0x08)
	None NavListEnd; // 0xf8(0x08)
	None NavDataChunks; // 0x100(0x10)
	None LightmapTotalSize; // 0x110(0x04)
	None ShadowmapTotalSize; // 0x114(0x04)
	None StaticNavigableGeometry; // 0x118(0x10)
	None StreamingTextureGuids; // 0x128(0x10)
	None LevelBuildDataId; // 0x1d0(0x10)
	None MapBuildData; // 0x1e0(0x08)
	None LightBuildLevelOffset; // 0x1e8(0x0c)
	None LightingScenarioQuality; // 0x1f4(0x01)
	None bIsLightingScenario; // 0x1f5(0x01)
	None bTextureStreamingRotationChanged; // 0x1f5(0x01)
	None bStaticComponentsRegisteredInStreamingManager; // 0x1f5(0x01)
	None bIsVisible; // 0x1f5(0x01)
	None WorldSettings; // 0x248(0x08)
	None AssetUserData; // 0x258(0x10)
	None DestroyedReplicatedStaticActors; // 0x278(0x10)
	None Actors; // 0x28(0x10)
	None BoxComponent; // 0x220(0x08)
	None bAutoUpdateBounds; // 0x228(0x01)
	None bInputEnabled; // 0x220(0x01)
	None WorldAsset; // 0x28(0x28)
	None PackageNameToLoad; // 0x50(0x08)
	None LODPackageNames; // 0x58(0x10)
	None LevelTransform; // 0x80(0x30)
	None LevelLODIndex; // 0xb4(0x04)
	None StreamingPriority; // 0xb8(0x04)
	None bShouldBeVisible; // 0xbe(0x01)
	None bShouldBeLoaded; // 0xbe(0x01)
	None bLocked; // 0xbe(0x01)
	None bIsStatic; // 0xbe(0x01)
	None bShouldBlockOnLoad; // 0xbe(0x01)
	None bShouldBlockOnUnload; // 0xbf(0x01)
	None bDisableDistanceStreaming; // 0xbf(0x01)
	None bDrawOnLevelStatusMap; // 0xbf(0x01)
	None LevelColor; // 0xc0(0x10)
	None EditorStreamingVolumes; // 0xd0(0x10)
	None MinTimeBetweenVolumeUnloadRequests; // 0xe0(0x04)
	None bExcludeFromAutomatedLightBake; // 0xe8(0x01)
	None OnLevelLoaded; // 0xf0(0x10)
	None OnLevelUnloaded; // 0x100(0x10)
	None OnLevelShown; // 0x110(0x10)
	None OnLevelHidden; // 0x120(0x10)
	None LoadedLevel; // 0x130(0x08)
	None PendingUnloadLevel; // 0x138(0x08)
	None bInitiallyLoaded; // 0x150(0x01)
	None bInitiallyVisible; // 0x150(0x01)
	None LightingScenarioQuality; // 0x150(0x01)
	None bDataIsStripped; // 0x151(0x01)
	None StreamingLevelNames; // 0x258(0x10)
	None bEditorPreVisOnly; // 0x268(0x01)
	None bDisabled; // 0x268(0x01)
	None StreamingUsage; // 0x26c(0x01)
	None SourceModel; // 0x28(0x08)
	None Surfaces; // 0x30(0x10)
	None PortalComponent; // 0x220(0x08)
	None PreviewBox; // 0x208(0x08)
	None LightmassSettings; // 0x28(0x1c)
	None IntensityUnits; // 0x338(0x01)
	None Radius; // 0x33c(0x04)
	None AttenuationRadius; // 0x340(0x04)
	None LightmassSettings; // 0x344(0x0c)
	None StaticMeshComponent; // 0x220(0x08)
	None ImpostersStaticMeshComponents; // 0x228(0x50)
	None Proxy; // 0x278(0x08)
	None Key; // 0x280(0x08)
	None LODDrawDistance; // 0x288(0x04)
	None LODLevel; // 0x28c(0x04)
	None SubActors; // 0x290(0x10)
	None CachedNumHLODLevels; // 0x2a0(0x01)
	None LevelLightingQuality; // 0x28(0x01)
	None LightingScenarioQuality; // 0x29(0x01)
	None bIsDataStripped; // 0x2a(0x01)
	None PhysMaterial; // 0x88(0x08)
	None PhysMaterialMask; // 0x90(0x08)
	None PhysicalMaterialMap; // 0x98(0x40)
	None Metallic; // 0xd8(0x0c)
	None Specular; // 0xec(0x0c)
	None Anisotropy; // 0x100(0x0c)
	None Normal; // 0x114(0x0c)
	None Tangent; // 0x128(0x0c)
	None EmissiveColor; // 0x13c(0x0c)
	None MaterialDomain; // 0x150(0x01)
	None BlendMode; // 0x151(0x01)
	None DecalBlendMode; // 0x152(0x01)
	None MaterialDecalResponse; // 0x153(0x01)
	None ShadingModel; // 0x154(0x01)
	None bCastDynamicShadowAsMasked; // 0x155(0x01)
	None ShadingModels; // 0x156(0x02)
	None OpacityMaskClipValue; // 0x158(0x04)
	None WorldPositionOffset; // 0x15c(0x0c)
	None Refraction; // 0x170(0x0c)
	None MaterialAttributes; // 0x184(0x10)
	None PixelDepthOffset; // 0x19c(0x0c)
	None ShadingModelFromMaterialExpression; // 0x1b0(0x0c)
	None bEnableTranslucencyAfterRefraction; // 0x1c4(0x01)
	None bEnableSeparateTranslucency; // 0x1c8(0x01)
	None bEnableResponsiveAA; // 0x1c8(0x01)
	None bScreenSpaceReflections; // 0x1c8(0x01)
	None bContactShadows; // 0x1c8(0x01)
	None TwoSided; // 0x1c8(0x01)
	None DitheredLODTransition; // 0x1c8(0x01)
	None DitherOpacityMask; // 0x1c8(0x01)
	None bAllowNegativeEmissiveColor; // 0x1c8(0x01)
	None TranslucencyLightingMode; // 0x1c9(0x01)
	None bEnableMobileSeparateTranslucency; // 0x1ca(0x01)
	None NumCustomizedUVs; // 0x1cc(0x04)
	None TranslucencyDirectionalLightingIntensity; // 0x1d0(0x04)
	None TranslucentShadowDensityScale; // 0x1d4(0x04)
	None TranslucentSelfShadowDensityScale; // 0x1d8(0x04)
	None TranslucentSelfShadowSecondDensityScale; // 0x1dc(0x04)
	None TranslucentSelfShadowSecondOpacity; // 0x1e0(0x04)
	None TranslucentBackscatteringExponent; // 0x1e4(0x04)
	None TranslucentMultipleScatteringExtinction; // 0x1e8(0x10)
	None TranslucentShadowStartOffset; // 0x1f8(0x04)
	None bDisableDepthTest; // 0x1fc(0x01)
	None bShouldRenderTranslucentOutline; // 0x1fc(0x01)
	None bWriteOnlyAlpha; // 0x1fc(0x01)
	None bGenerateSphericalParticleNormals; // 0x1fc(0x01)
	None bTangentSpaceNormal; // 0x1fc(0x01)
	None bUseEmissiveForDynamicAreaLighting; // 0x1fc(0x01)
	None bBlockGI; // 0x1fc(0x01)
	None bUsedAsSpecialEngineMaterial; // 0x1fc(0x01)
	None bUsedWithSkeletalMesh; // 0x1fd(0x01)
	None bUsedWithVertexCurvature; // 0x1fd(0x01)
	None bUsedWithBlurredNormals; // 0x1fd(0x01)
	None bUsedWithEditorCompositing; // 0x1fd(0x01)
	None bUsedWithParticleSprites; // 0x1fd(0x01)
	None bUsedWithBeamTrails; // 0x1fd(0x01)
	None bUsedWithMeshParticles; // 0x1fd(0x01)
	None bUsedWithNiagaraSprites; // 0x1fd(0x01)
	None bUsedWithNiagaraRibbons; // 0x1fe(0x01)
	None bUsedWithNiagaraMeshParticles; // 0x1fe(0x01)
	None bUsedWithGeometryCache; // 0x1fe(0x01)
	None bUsedWithStaticLighting; // 0x1fe(0x01)
	None bUsedWithMorphTargets; // 0x1fe(0x01)
	None bUsedWithSplineMeshes; // 0x1fe(0x01)
	None bUsedWithInstancedStaticMeshes; // 0x1fe(0x01)
	None bUsedWithGeometryCollections; // 0x1fe(0x01)
	None bUsesDistortion; // 0x1ff(0x01)
	None bUsedWithClothing; // 0x1ff(0x01)
	None bUsedWithWater; // 0x200(0x01)
	None bUsedWithHairStrands; // 0x200(0x01)
	None bUsedWithLidarPointCloud; // 0x200(0x01)
	None bUsedWithUI; // 0x204(0x01)
	None bAutomaticallySetUsageInEditor; // 0x204(0x01)
	None bFullyRough; // 0x204(0x01)
	None bUseFullPrecision; // 0x204(0x01)
	None bUseLightmapDirectionality; // 0x204(0x01)
	None bForwardRenderUsePreintegratedGFForSimpleIBL; // 0x208(0x01)
	None bUseHalfRateCheckerboardRendering; // 0x208(0x01)
	None bOnlyDirectionalLighting; // 0x208(0x01)
	None bUseHQForwardReflections; // 0x20c(0x01)
	None bUseHQForwardReflectionsOnLowEnd; // 0x210(0x01)
	None bUsePlanarForwardReflections; // 0x214(0x01)
	None bNormalCurvatureToRoughness; // 0x214(0x01)
	None D3D11TessellationMode; // 0x215(0x01)
	None bEnableCrackFreeDisplacement; // 0x216(0x01)
	None bEnableAdaptiveTessellation; // 0x216(0x01)
	None AllowTranslucentCustomDepthWrites; // 0x216(0x01)
	None Wireframe; // 0x216(0x01)
	None ShadingRate; // 0x217(0x01)
	None bCanMaskedBeAssumedOpaque; // 0x218(0x01)
	None bIsMasked; // 0x218(0x01)
	None bIsPreviewMaterial; // 0x218(0x01)
	None bIsFunctionPreviewMaterial; // 0x218(0x01)
	None bUseMaterialAttributes; // 0x218(0x01)
	None bCastRayTracedShadows; // 0x218(0x01)
	None bUseTranslucencyVertexFog; // 0x218(0x01)
	None bIsSky; // 0x218(0x01)
	None bComputeFogPerPixel; // 0x219(0x01)
	None bOutputTranslucentVelocity; // 0x219(0x01)
	None bAllowDevelopmentShaderCompile; // 0x219(0x01)
	None bIsMaterialEditorStatsMaterial; // 0x219(0x01)
	None BlendableLocation; // 0x21a(0x01)
	None BlendableOutputAlpha; // 0x21b(0x01)
	None bEnableStencilTest; // 0x21b(0x01)
	None StencilCompare; // 0x21c(0x01)
	None StencilRefValue; // 0x21d(0x01)
	None RefractionMode; // 0x21e(0x01)
	None BlendablePriority; // 0x220(0x04)
	None bIsBlendable; // 0x224(0x01)
	None UsageFlagWarnings; // 0x228(0x04)
	None RefractionDepthBias; // 0x22c(0x04)
	None StateId; // 0x230(0x10)
	None MaxDisplacement; // 0x240(0x04)
	None CachedExpressionData; // 0x2d0(0x228)
	None Elements; // 0x430(0x10)
	None Input; // 0x40(0x0c)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None ConstA; // 0x68(0x04)
	None ConstB; // 0x6c(0x04)
	None Texture; // 0x40(0x08)
	None SamplerType; // 0x48(0x01)
	None IsDefaultMeshpaintTexture; // 0x49(0x01)
	None Coordinates; // 0x50(0x0c)
	None TextureObject; // 0x64(0x0c)
	None MipValue; // 0x78(0x0c)
	None CoordinatesDX; // 0x8c(0x0c)
	None CoordinatesDY; // 0xa0(0x0c)
	None AutomaticViewMipBiasValue; // 0xb4(0x0c)
	None MipValueMode; // 0xc8(0x01)
	None SamplerSource; // 0xc9(0x01)
	None AutomaticViewMipBias; // 0xca(0x01)
	None ConstCoordinate; // 0xcb(0x01)
	None ConstMipValue; // 0xcc(0x04)
	None ParameterName; // 0xd0(0x08)
	None ExpressionGUID; // 0xd8(0x10)
	None Group; // 0xe8(0x08)
	None Threshold; // 0xf0(0x04)
	None Channel; // 0xf4(0x01)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None Input; // 0x40(0x0c)
	None Input; // 0x40(0x0c)
	None Input; // 0x40(0x0c)
	None Input; // 0x40(0x0c)
	None Input; // 0x40(0x0c)
	None Y; // 0x40(0x0c)
	None X; // 0x54(0x0c)
	None Y; // 0x40(0x0c)
	None X; // 0x54(0x0c)
	None Input; // 0x40(0x0c)
	None WorldPosition; // 0x40(0x0c)
	None Input; // 0x40(0x0c)
	None Temp; // 0x40(0x0c)
	None A; // 0x40(0x10)
	None B; // 0x58(0x10)
	None Alpha; // 0x70(0x0c)
	None PixelAttributeBlendType; // 0x84(0x01)
	None VertexAttributeBlendType; // 0x85(0x01)
	None Input; // 0x40(0x0c)
	None MaterialAttributes; // 0x40(0x10)
	None Coordinate; // 0x40(0x0c)
	None Height; // 0x54(0x0c)
	None HeightRatioInput; // 0x68(0x0c)
	None HeightRatio; // 0x7c(0x04)
	None ReferencePlane; // 0x80(0x04)
	None ConstCoordinate; // 0x84(0x04)
	None Input; // 0x40(0x0c)
	None ParameterName; // 0x40(0x08)
	None ExpressionGUID; // 0x48(0x10)
	None DefaultValue; // 0x58(0x10)
	None bUseCustomPrimitiveData; // 0x68(0x01)
	None PrimitiveDataIndex; // 0x69(0x01)
	None MaskChannel; // 0x70(0x01)
	None Input; // 0x74(0x0c)
	None Input; // 0x40(0x0c)
	None Min; // 0x54(0x0c)
	None Max; // 0x68(0x0c)
	None ClampMode; // 0x7c(0x01)
	None MinDefault; // 0x80(0x04)
	None MaxDefault; // 0x84(0x04)
	None Input; // 0x40(0x0c)
	None Collection; // 0x40(0x08)
	None ParameterName; // 0x48(0x08)
	None ParameterId; // 0x50(0x10)
	None SizeX; // 0x40(0x04)
	None SizeY; // 0x44(0x04)
	None Text; // 0x48(0x10)
	None CommentColor; // 0x58(0x10)
	None FontSize; // 0x68(0x04)
	None Input; // 0x40(0x0c)
	None R; // 0x54(0x01)
	None G; // 0x54(0x01)
	None B; // 0x54(0x01)
	None A; // 0x54(0x01)
	None R; // 0x40(0x04)
	None R; // 0x40(0x04)
	None G; // 0x44(0x04)
	None Constant; // 0x40(0x10)
	None Constant; // 0x40(0x10)
	None Input; // 0x40(0x0c)
	None Bias; // 0x54(0x04)
	None Scale; // 0x58(0x04)
	None Input; // 0x40(0x0c)
	None Period; // 0x54(0x04)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None DefaultValue; // 0x58(0x04)
	None bUseCustomPrimitiveData; // 0x5c(0x01)
	None PrimitiveDataIndex; // 0x5d(0x01)
	None Curve; // 0x60(0x08)
	None Atlas; // 0x68(0x08)
	None InputTime; // 0x70(0x0c)
	None Code; // 0x40(0x10)
	None OutputType; // 0x50(0x01)
	None Description; // 0x58(0x10)
	None Inputs; // 0x68(0x10)
	None AdditionalDefines; // 0x78(0x10)
	None IncludeFilePaths; // 0x88(0x10)
	None Value; // 0x40(0x0c)
	None Value; // 0x40(0x0c)
	None TextureSize; // 0x40(0x0c)
	None ConstWidth; // 0x54(0x04)
	None ConstHeight; // 0x58(0x04)
	None InOpacity; // 0x40(0x0c)
	None FadeDistance; // 0x54(0x0c)
	None OpacityDefault; // 0x68(0x04)
	None FadeDistanceDefault; // 0x6c(0x04)
	None FunctionValue; // 0x40(0x01)
	None Depth; // 0x44(0x0c)
	None InXY; // 0x40(0x0c)
	None Input; // 0x40(0x0c)
	None Fraction; // 0x54(0x0c)
	None LuminanceFactors; // 0x68(0x10)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None Position; // 0x40(0x0c)
	None Position; // 0x40(0x0c)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None ConstA; // 0x68(0x04)
	None ConstB; // 0x6c(0x04)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None ParamNames; // 0x40(0x10)
	None DefaultValue; // 0x50(0x10)
	None ParameterIndex; // 0x60(0x04)
	None Default; // 0x40(0x0c)
	None Inputs; // 0x54(0x30)
	None Input; // 0x40(0x0c)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None Font; // 0x40(0x08)
	None FontTexturePage; // 0x48(0x04)
	None ParameterName; // 0x50(0x08)
	None ExpressionGUID; // 0x58(0x10)
	None Group; // 0x68(0x08)
	None Input; // 0x40(0x0c)
	None ExponentIn; // 0x40(0x0c)
	None Exponent; // 0x54(0x04)
	None BaseReflectFractionIn; // 0x58(0x0c)
	None BaseReflectFraction; // 0x6c(0x04)
	None Normal; // 0x70(0x0c)
	None Preview; // 0x40(0x0c)
	None InputName; // 0x54(0x08)
	None Description; // 0x60(0x10)
	None ID; // 0x70(0x10)
	None InputType; // 0x80(0x01)
	None PreviewValue; // 0x90(0x10)
	None bUsePreviewValueAsDefault; // 0xa0(0x01)
	None SortPriority; // 0xa4(0x04)
	None bCompilingFunctionPreview; // 0xa8(0x01)
	None OutputName; // 0x40(0x08)
	None Description; // 0x48(0x10)
	None SortPriority; // 0x58(0x04)
	None A; // 0x5c(0x0c)
	None bLastPreviewed; // 0x70(0x01)
	None ID; // 0x74(0x10)
	None MaterialAttributes; // 0x40(0x10)
	None AttributeGetTypes; // 0x58(0x10)
	None Default; // 0x40(0x0c)
	None StaticIndirect; // 0x54(0x0c)
	None DynamicIndirect; // 0x68(0x0c)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None AGreaterThanB; // 0x68(0x0c)
	None AEqualsB; // 0x7c(0x0c)
	None ALessThanB; // 0x90(0x0c)
	None EqualsThreshold; // 0xa4(0x04)
	None ConstB; // 0xa8(0x04)
	None ConstAEqualsB; // 0xac(0x04)
	None Realtime; // 0x40(0x0c)
	None Lightmass; // 0x54(0x0c)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None Alpha; // 0x68(0x0c)
	None ConstA; // 0x7c(0x04)
	None ConstB; // 0x80(0x04)
	None ConstAlpha; // 0x84(0x04)
	None X; // 0x40(0x0c)
	None X; // 0x40(0x0c)
	None BaseColor; // 0x40(0x0c)
	None Metallic; // 0x54(0x0c)
	None Specular; // 0x68(0x0c)
	None Roughness; // 0x7c(0x0c)
	None Anisotropy; // 0x90(0x0c)
	None EmissiveColor; // 0xa4(0x0c)
	None Opacity; // 0xb8(0x0c)
	None OpacityMask; // 0xcc(0x0c)
	None Normal; // 0xe0(0x0c)
	None Tangent; // 0xf4(0x0c)
	None WorldPositionOffset; // 0x108(0x0c)
	None WorldDisplacement; // 0x11c(0x0c)
	None TessellationMultiplier; // 0x130(0x0c)
	None SubsurfaceColor; // 0x144(0x0c)
	None ClearCoat; // 0x158(0x0c)
	None ClearCoatRoughness; // 0x16c(0x0c)
	None AmbientOcclusion; // 0x180(0x0c)
	None Refraction; // 0x194(0x0c)
	None CustomizedUVs; // 0x1a8(0x60)
	None PixelDepthOffset; // 0x248(0x0c)
	None ShadingModel; // 0x25c(0x0c)
	None Coordinates; // 0x40(0x0c)
	None ParameterName; // 0x40(0x08)
	None ExpressionGUID; // 0x48(0x10)
	None Input; // 0x58(0x10)
	None DefaultLayers; // 0x70(0x40)
	None LayerCallers; // 0xb0(0x10)
	None NumActiveLayerCallers; // 0xc0(0x04)
	None BlendCallers; // 0xc8(0x10)
	None NumActiveBlendCallers; // 0xd8(0x04)
	None bIsLayerGraphBuilt; // 0xdc(0x01)
	None MaterialFunction; // 0x40(0x08)
	None FunctionParameterInfo; // 0x48(0x10)
	None Realtime; // 0x40(0x0c)
	None MaterialProxy; // 0x54(0x0c)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None ConstA; // 0x68(0x04)
	None ConstB; // 0x6c(0x04)
	None Input; // 0x40(0x0c)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None ConstA; // 0x68(0x04)
	None ConstB; // 0x6c(0x04)
	None Input; // 0x40(0x0c)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None ConstA; // 0x68(0x04)
	None ConstB; // 0x6c(0x04)
	None Position; // 0x40(0x0c)
	None FilterWidth; // 0x54(0x0c)
	None Scale; // 0x68(0x04)
	None Quality; // 0x6c(0x04)
	None NoiseFunction; // 0x70(0x01)
	None bTurbulence; // 0x74(0x01)
	None Levels; // 0x78(0x04)
	None OutputMin; // 0x7c(0x04)
	None OutputMax; // 0x80(0x04)
	None LevelScale; // 0x84(0x04)
	None bTiling; // 0x88(0x01)
	None RepeatSize; // 0x8c(0x04)
	None VectorInput; // 0x40(0x0c)
	None Input; // 0x40(0x0c)
	None Coordinate; // 0x40(0x0c)
	None Time; // 0x54(0x0c)
	None Speed; // 0x68(0x0c)
	None SpeedX; // 0x7c(0x04)
	None SpeedY; // 0x80(0x04)
	None ConstCoordinate; // 0x84(0x04)
	None bFractionalPart; // 0x88(0x01)
	None bBlend; // 0xd0(0x01)
	None DefaultValue; // 0x40(0x0c)
	None ConstDefaultValue; // 0x54(0x04)
	None DataIndex; // 0x58(0x04)
	None Base; // 0x40(0x0c)
	None Exponent; // 0x54(0x0c)
	None ConstExponent; // 0x68(0x04)
	None CurrentFrame; // 0x40(0x0c)
	None PreviousFrame; // 0x54(0x0c)
	None Default; // 0x40(0x0c)
	None Inputs; // 0x54(0x24)
	None BlurDist; // 0x40(0x0c)
	None ScreenUV; // 0x54(0x0c)
	None SceneTextureId; // 0x68(0x01)
	None Normal; // 0x40(0x0c)
	None RayTraced; // 0x54(0x0c)
	None CustomWorldNormal; // 0x40(0x0c)
	None bNormalizeCustomWorldNormal; // 0x54(0x01)
	None Input; // 0x40(0x0c)
	None NormalizedRotationAxis; // 0x40(0x0c)
	None RotationAngle; // 0x54(0x0c)
	None PivotPoint; // 0x68(0x0c)
	None Position; // 0x7c(0x0c)
	None Period; // 0x90(0x04)
	None Coordinate; // 0x40(0x0c)
	None Time; // 0x54(0x0c)
	None CenterX; // 0x68(0x04)
	None CenterY; // 0x6c(0x04)
	None Speed; // 0x70(0x04)
	None ConstCoordinate; // 0x74(0x04)
	None Input; // 0x40(0x0c)
	None BaseColor; // 0x40(0x0c)
	None Specular; // 0x54(0x0c)
	None Roughness; // 0x68(0x0c)
	None Normal; // 0x7c(0x0c)
	None WorldHeight; // 0x90(0x0c)
	None Opacity; // 0xa4(0x0c)
	None Mask; // 0xb8(0x0c)
	None Default; // 0x40(0x0c)
	None VirtualTextureOutput; // 0x54(0x0c)
	None Coordinates; // 0x40(0x0c)
	None WorldPosition; // 0x54(0x0c)
	None MipValue; // 0x68(0x0c)
	None VirtualTexture; // 0x80(0x08)
	None MaterialType; // 0x88(0x01)
	None bSinglePhysicalSpace; // 0x89(0x01)
	None MipValueMode; // 0x8a(0x01)
	None ParameterName; // 0x90(0x08)
	None ExpressionGUID; // 0x98(0x10)
	None Group; // 0xa8(0x08)
	None Input; // 0x40(0x0c)
	None InputMode; // 0x40(0x01)
	None Input; // 0x44(0x0c)
	None OffsetFraction; // 0x58(0x0c)
	None ConstInput; // 0x6c(0x08)
	None InputMode; // 0x40(0x01)
	None Input; // 0x44(0x0c)
	None Coordinates; // 0x58(0x0c)
	None ConstInput; // 0x6c(0x08)
	None Coordinates; // 0x40(0x0c)
	None SceneTextureId; // 0x54(0x01)
	None bFiltered; // 0x55(0x01)
	None Inputs; // 0x40(0x10)
	None AttributeSetTypes; // 0x50(0x10)
	None PixelShader; // 0x40(0x0c)
	None VertexShader; // 0x54(0x0c)
	None ShadingModel; // 0x40(0x01)
	None Default; // 0x40(0x0c)
	None Inputs; // 0x54(0x24)
	None Default; // 0x40(0x0c)
	None Shadow; // 0x54(0x0c)
	None Input; // 0x40(0x0c)
	None Input; // 0x40(0x0c)
	None Period; // 0x54(0x04)
	None ScatteringCoefficients; // 0x40(0x0c)
	None AbsorptionCoefficients; // 0x54(0x0c)
	None PhaseG; // 0x68(0x0c)
	None LightIndex; // 0x40(0x04)
	None LightIndex; // 0x40(0x04)
	None WorldPosition; // 0x44(0x0c)
	None LightIndex; // 0x40(0x04)
	None WorldPosition; // 0x40(0x0c)
	None Cell; // 0x40(0x0c)
	None Index; // 0x54(0x0c)
	None Seed; // 0x68(0x0c)
	None ConstIndex; // 0x7c(0x04)
	None ConstSeed; // 0x80(0x08)
	None GeometryInput; // 0x40(0x0c)
	None WindInput; // 0x54(0x0c)
	None LODInput; // 0x68(0x0c)
	None ExtraBendWS; // 0x7c(0x0c)
	None GeometryType; // 0x90(0x01)
	None WindType; // 0x91(0x01)
	None LODType; // 0x92(0x01)
	None BillboardThreshold; // 0x94(0x04)
	None bAccurateWindVelocities; // 0x98(0x01)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None Radius; // 0x68(0x0c)
	None Hardness; // 0x7c(0x0c)
	None AttenuationRadius; // 0x90(0x04)
	None HardnessPercent; // 0x94(0x04)
	None Density; // 0x40(0x0c)
	None ConstantDensity; // 0x54(0x04)
	None Input; // 0x40(0x0c)
	None Value; // 0x40(0x01)
	None DefaultValue; // 0x58(0x01)
	None Input; // 0x58(0x0c)
	None DefaultR; // 0x6c(0x01)
	None DefaultG; // 0x6c(0x01)
	None DefaultB; // 0x6c(0x01)
	None DefaultA; // 0x6c(0x01)
	None DefaultValue; // 0x40(0x01)
	None A; // 0x44(0x0c)
	None B; // 0x58(0x0c)
	None Value; // 0x6c(0x0c)
	None A; // 0x60(0x0c)
	None B; // 0x74(0x0c)
	None Input; // 0x40(0x0c)
	None Input; // 0x40(0x0c)
	None A; // 0x40(0x0c)
	None B; // 0x54(0x0c)
	None ConstA; // 0x68(0x04)
	None ConstB; // 0x6c(0x04)
	None Input; // 0x40(0x0c)
	None Period; // 0x54(0x04)
	None Input; // 0x40(0x0c)
	None Index; // 0x40(0x0c)
	None Seed; // 0x54(0x0c)
	None ConstIndex; // 0x68(0x04)
	None ConstSeed; // 0x6c(0x08)
	None CoordinateIndex; // 0x40(0x04)
	None UTiling; // 0x44(0x04)
	None VTiling; // 0x48(0x04)
	None UnMirrorU; // 0x4c(0x01)
	None UnMirrorV; // 0x4c(0x01)
	None Coordinates; // 0x50(0x0c)
	None TextureObject; // 0x64(0x0c)
	None SamplerSource; // 0x78(0x01)
	None ConstCoordinate; // 0x79(0x01)
	None TextureObject; // 0x50(0x0c)
	None TextureObject; // 0x40(0x0c)
	None Property; // 0x54(0x01)
	None bBlend; // 0xf0(0x01)
	None TransmittanceColor; // 0x40(0x0c)
	None bIgnorePause; // 0x40(0x01)
	None bOverride_Period; // 0x40(0x01)
	None Period; // 0x44(0x04)
	None Input; // 0x40(0x0c)
	None TransformSourceType; // 0x54(0x01)
	None TransformType; // 0x55(0x01)
	None Input; // 0x40(0x0c)
	None TransformSourceType; // 0x54(0x01)
	None TransformType; // 0x55(0x01)
	None Input; // 0x40(0x0c)
	None Position; // 0x40(0x0c)
	None NoiseFunction; // 0x54(0x01)
	None Quality; // 0x58(0x04)
	None bTiling; // 0x5c(0x01)
	None TileSize; // 0x60(0x04)
	None Input; // 0x40(0x0c)
	None Property; // 0x40(0x01)
	None No; // 0x40(0x0c)
	None Yes; // 0x54(0x0c)
	None WorldPositionShaderOffset; // 0x40(0x01)
	None StateId; // 0x28(0x10)
	None MaterialFunctionUsage; // 0x38(0x01)
	None Description; // 0x40(0x10)
	None bExposeToLibrary; // 0x50(0x01)
	None bPrefixParameterNames; // 0x50(0x01)
	None bReentrantFlag; // 0x50(0x01)
	None Parent; // 0x40(0x08)
	None Base; // 0x48(0x08)
	None ScalarParameterValues; // 0x50(0x10)
	None VectorParameterValues; // 0x60(0x10)
	None TextureParameterValues; // 0x70(0x10)
	None FontParameterValues; // 0x80(0x10)
	None StaticSwitchParameterValues; // 0x90(0x10)
	None StaticComponentMaskParameterValues; // 0xa0(0x10)
	None RuntimeVirtualTextureParameterValues; // 0xb0(0x10)
	None TargetActors; // 0x220(0x10)
	None StateId; // 0x28(0x10)
	None ScalarParameters; // 0x38(0x10)
	None VectorParameters; // 0x48(0x10)
	None Collection; // 0x30(0x08)
	None MatineeData; // 0x220(0x08)
	None MatineeControllerName; // 0x228(0x08)
	None PlayRate; // 0x230(0x04)
	None bPlayOnLevelLoad; // 0x234(0x01)
	None bForceStartPos; // 0x234(0x01)
	None ForceStartPosition; // 0x238(0x04)
	None bLooping; // 0x23c(0x01)
	None bRewindOnPlay; // 0x23c(0x01)
	None bNoResetOnRewind; // 0x23c(0x01)
	None bRewindIfAlreadyPlaying; // 0x23c(0x01)
	None bDisableRadioFilter; // 0x23c(0x01)
	None bClientSideOnly; // 0x23c(0x01)
	None bSkipUpdateIfNotVisible; // 0x23c(0x01)
	None bIsSkippable; // 0x23c(0x01)
	None PreferredSplitScreenNum; // 0x240(0x04)
	None bDisableMovementInput; // 0x244(0x01)
	None bDisableLookAtInput; // 0x244(0x01)
	None bHidePlayer; // 0x244(0x01)
	None bHideHud; // 0x244(0x01)
	None GroupActorInfos; // 0x248(0x10)
	None bShouldShowGore; // 0x258(0x01)
	None GroupInst; // 0x260(0x10)
	None CameraCuts; // 0x270(0x10)
	None bIsPlaying; // 0x280(0x01)
	None bReversePlayback; // 0x280(0x01)
	None bPaused; // 0x280(0x01)
	None bPendingStop; // 0x280(0x01)
	None InterpPosition; // 0x284(0x04)
	None ReplicationForceIsPlaying; // 0x28c(0x01)
	None OnPlay; // 0x290(0x10)
	None OnStop; // 0x2a0(0x10)
	None OnPause; // 0x2b0(0x10)
	None CameraAnim; // 0x2c8(0x08)
	None MeshReductionModuleName; // 0x38(0x08)
	None AvailableProducts; // 0x38(0x10)
	None LastError; // 0x48(0x10)
	None LastErrorSolution; // 0x58(0x10)
	None ModelBodySetup; // 0x448(0x08)
	None BaseSkelMesh; // 0x28(0x08)
	None bIsDynamicObstacle; // 0x28(0x01)
	None NavigationDataName; // 0x28(0x08)
	None NavigationSystemClass; // 0x28(0x18)
	None SupportedAgentsMask; // 0x40(0x04)
	None DefaultAgentName; // 0x44(0x08)
	None bIsOverriden; // 0x4c(0x01)
	None Links; // 0x28(0x10)
	None SegmentLinks; // 0x38(0x10)
	None bVerifyPeer; // 0x38(0x01)
	None bEnableMultiplayerWorldOriginRebasing; // 0x38(0x01)
	None MaxRepArraySize; // 0x3c(0x04)
	None MaxRepArrayMemory; // 0x40(0x04)
	None NetworkEmulationProfiles; // 0x48(0x10)
	None SourceItems; // 0x28(0x50)
	None TargetItems; // 0x78(0x50)
	None SourceToTarget; // 0xc8(0x50)
	None SourceAsset; // 0x118(0x28)
	None TargetAsset; // 0x140(0x28)
	None ObjectBaseClass; // 0x28(0x08)
	None bHasBlueprintClasses; // 0x30(0x01)
	None Objects; // 0x38(0x10)
	None WeakObjects; // 0x48(0x10)
	None bUseWeakReferences; // 0x58(0x01)
	None bIsFullyLoaded; // 0x59(0x01)
	None ReferencedObjects; // 0x28(0x10)
	None bPainCausing; // 0x268(0x01)
	None DamagePerSec; // 0x26c(0x04)
	None DamageType; // 0x270(0x08)
	None PainInterval; // 0x278(0x04)
	None bEntryPain; // 0x27c(0x01)
	None BACKUP_bPainCausing; // 0x27c(0x01)
	None DamageInstigator; // 0x280(0x08)
	None Channels; // 0x28(0x04)
	None EmitterName; // 0x28(0x08)
	None SubUVDataOffset; // 0x30(0x04)
	None EmitterRenderMode; // 0x34(0x01)
	None SignificanceLevel; // 0x35(0x01)
	None bUseLegacySpawningBehavior; // 0x37(0x01)
	None ConvertedModules; // 0x37(0x01)
	None bIsSoloing; // 0x37(0x01)
	None bCookedOut; // 0x37(0x01)
	None bDisabledLODsKeepEmitterAlive; // 0x37(0x01)
	None bDisableWhenInsignficant; // 0x38(0x01)
	None LODLevels; // 0x40(0x10)
	None PeakActiveParticles; // 0x50(0x04)
	None InitialAllocationCount; // 0x54(0x04)
	None QualityLevelSpawnRateScale; // 0x58(0x04)
	None DetailModeBitmask; // 0x5c(0x04)
	None m_ParticleChannels; // 0x1b8(0x04)
	None Level; // 0x28(0x04)
	None bEnabled; // 0x2c(0x01)
	None RequiredModule; // 0x30(0x08)
	None Modules; // 0x38(0x10)
	None TypeDataModule; // 0x48(0x08)
	None SpawnModule; // 0x50(0x08)
	None EventGenerator; // 0x58(0x08)
	None SpawningModules; // 0x60(0x10)
	None SpawnModules; // 0x70(0x10)
	None UpdateModules; // 0x80(0x10)
	None OrbitModules; // 0x90(0x10)
	None EventReceiverModules; // 0xa0(0x10)
	None ConvertedModules; // 0xb0(0x01)
	None PeakActiveParticles; // 0xb4(0x04)
	None bAlwaysInWorldSpace; // 0x30(0x01)
	None Acceleration; // 0x38(0x48)
	None bApplyOwnerScale; // 0x80(0x01)
	None Acceleration; // 0x38(0x0c)
	None DragCoefficient; // 0x38(0x08)
	None DragCoefficientRaw; // 0x40(0x30)
	None DragScale; // 0x38(0x08)
	None DragScaleRaw; // 0x40(0x30)
	None AccelOverLife; // 0x38(0x48)
	None EndPoint0; // 0x30(0x0c)
	None EndPoint1; // 0x3c(0x0c)
	None Range; // 0x48(0x30)
	None Strength; // 0x78(0x30)
	None EmitterName; // 0x30(0x08)
	None Range; // 0x38(0x30)
	None bStrengthByDistance; // 0x68(0x01)
	None Strength; // 0x70(0x30)
	None bAffectBaseVelocity; // 0xa0(0x01)
	None SelectionMethod; // 0xa4(0x01)
	None bRenewSource; // 0xa8(0x01)
	None bInheritSourceVel; // 0xa8(0x01)
	None LastSelIndex; // 0xac(0x04)
	None Position; // 0x30(0x48)
	None Range; // 0x78(0x30)
	None Strength; // 0xa8(0x30)
	None StrengthByDistance; // 0xd8(0x01)
	None bAffectBaseVelocity; // 0xd8(0x01)
	None bOverrideVelocity; // 0xd8(0x01)
	None bUseWorldSpacePosition; // 0xd8(0x01)
	None Positive_X; // 0xd8(0x01)
	None Positive_Y; // 0xd8(0x01)
	None Positive_Z; // 0xd8(0x01)
	None Negative_X; // 0xd8(0x01)
	None Negative_Y; // 0xd9(0x01)
	None Negative_Z; // 0xd9(0x01)
	None Position; // 0x30(0x0c)
	None Radius; // 0x3c(0x04)
	None Strength; // 0x40(0x08)
	None StrengthRaw; // 0x48(0x30)
	None ModifierType; // 0x30(0x01)
	None PositionOptions; // 0x34(0x04)
	None Position; // 0x38(0x48)
	None TangentOptions; // 0x80(0x04)
	None Tangent; // 0x88(0x48)
	None bAbsoluteTangent; // 0xd0(0x01)
	None StrengthOptions; // 0xd4(0x04)
	None Strength; // 0xd8(0x30)
	None bLowFreq_Enabled; // 0x30(0x01)
	None Frequency; // 0x34(0x04)
	None Frequency_LowRange; // 0x38(0x04)
	None NoiseRange; // 0x40(0x48)
	None NoiseRangeScale; // 0x88(0x30)
	None bNRScaleEmitterTime; // 0xb8(0x01)
	None NoiseSpeed; // 0xc0(0x48)
	None bSmooth; // 0x108(0x01)
	None NoiseLockRadius; // 0x10c(0x04)
	None bNoiseLock; // 0x110(0x01)
	None bOscillate; // 0x110(0x01)
	None NoiseLockTime; // 0x114(0x04)
	None NoiseTension; // 0x118(0x04)
	None bUseNoiseTangents; // 0x11c(0x01)
	None NoiseTangentStrength; // 0x120(0x30)
	None NoiseTessellation; // 0x150(0x04)
	None bTargetNoise; // 0x154(0x01)
	None FrequencyDistance; // 0x158(0x04)
	None bApplyNoiseScale; // 0x15c(0x01)
	None NoiseScale; // 0x160(0x30)
	None SourceMethod; // 0x30(0x01)
	None SourceName; // 0x34(0x08)
	None bSourceAbsolute; // 0x3c(0x01)
	None Source; // 0x40(0x48)
	None bLockSource; // 0x88(0x01)
	None SourceTangentMethod; // 0x8c(0x01)
	None SourceTangent; // 0x90(0x48)
	None bLockSourceTangent; // 0xd8(0x01)
	None SourceStrength; // 0xe0(0x30)
	None bLockSourceStength; // 0x110(0x01)
	None TargetMethod; // 0x30(0x01)
	None TargetName; // 0x34(0x08)
	None Target; // 0x40(0x48)
	None bTargetAbsolute; // 0x88(0x01)
	None bLockTarget; // 0x88(0x01)
	None TargetTangentMethod; // 0x8c(0x01)
	None TargetTangent; // 0x90(0x48)
	None bLockTargetTangent; // 0xd8(0x01)
	None TargetStrength; // 0xe0(0x30)
	None bLockTargetStength; // 0x110(0x01)
	None LockRadius; // 0x114(0x04)
	None CameraOffset; // 0x30(0x30)
	None bSpawnTimeOnly; // 0x60(0x01)
	None UpdateMethod; // 0x64(0x01)
	None DampingFactor; // 0x30(0x48)
	None DampingFactorRotation; // 0x78(0x48)
	None MaxCollisions; // 0xc0(0x30)
	None CollisionCompletionOption; // 0xf0(0x01)
	None CollisionTypes; // 0xf8(0x10)
	None bApplyPhysics; // 0x110(0x01)
	None bIgnoreTriggerVolumes; // 0x110(0x01)
	None ParticleMass; // 0x118(0x30)
	None DirScalar; // 0x148(0x04)
	None bPawnsDoNotDecrementCount; // 0x14c(0x01)
	None bOnlyVerticalNormalsDecrementCount; // 0x14c(0x01)
	None VerticalFudgeFactor; // 0x150(0x04)
	None DelayAmount; // 0x158(0x30)
	None bDropDetail; // 0x188(0x01)
	None bCollideOnlyIfVisible; // 0x188(0x01)
	None bIgnoreSourceActor; // 0x188(0x01)
	None MaxCollisionDistance; // 0x18c(0x04)
	None Resilience; // 0x30(0x30)
	None ResilienceScaleOverLife; // 0x60(0x30)
	None Friction; // 0x90(0x04)
	None RandomSpread; // 0x94(0x04)
	None RandomDistribution; // 0x98(0x04)
	None RadiusScale; // 0x9c(0x04)
	None RadiusBias; // 0xa0(0x04)
	None Response; // 0xa4(0x01)
	None CollisionMode; // 0xa5(0x01)
	None StartColor; // 0x30(0x48)
	None StartAlpha; // 0x78(0x30)
	None bClampAlpha; // 0xa8(0x01)
	None RandomSeedInfo; // 0xb0(0x20)
	None ColorOverLife; // 0x30(0x48)
	None AlphaOverLife; // 0x78(0x30)
	None bClampAlpha; // 0xa8(0x01)
	None ColorScaleOverLife; // 0x30(0x48)
	None AlphaScaleOverLife; // 0x78(0x30)
	None bEmitterTime; // 0xa8(0x01)
	None Events; // 0x30(0x10)
	None EventGeneratorType; // 0x30(0x01)
	None EventName; // 0x34(0x08)
	None bStopSpawning; // 0x40(0x01)
	None SpawnCount; // 0x40(0x30)
	None bUseParticleTime; // 0x70(0x01)
	None bUsePSysLocation; // 0x70(0x01)
	None bInheritVelocity; // 0x70(0x01)
	None InheritVelocityScale; // 0x78(0x48)
	None PhysicalMaterials; // 0xc0(0x10)
	None bBanPhysicalMaterials; // 0xd0(0x01)
	None LowerLeftCorner; // 0x30(0x48)
	None UpperRightCorner; // 0x78(0x48)
	None bAbsolute; // 0xc0(0x01)
	None bKillInside; // 0xc0(0x01)
	None bAxisAlignedAndFixedSize; // 0xc0(0x01)
	None Height; // 0x30(0x30)
	None bAbsolute; // 0x60(0x01)
	None bFloor; // 0x60(0x01)
	None bApplyPSysScale; // 0x60(0x01)
	None Lifetime; // 0x30(0x30)
	None RandomSeedInfo; // 0x60(0x20)
	None bUseInverseSquaredFalloff; // 0x30(0x01)
	None bAffectsTranslucency; // 0x31(0x01)
	None bPreviewLightRadius; // 0x32(0x01)
	None SpawnFraction; // 0x34(0x04)
	None ColorScaleOverLife; // 0x38(0x48)
	None BrightnessOverLife; // 0x80(0x30)
	None RadiusScale; // 0xb0(0x30)
	None LightExponent; // 0xe0(0x30)
	None LightingChannels; // 0x110(0x01)
	None VolumetricScatteringIntensity; // 0x114(0x04)
	None bHighQualityLights; // 0x118(0x01)
	None bShadowCastingLights; // 0x119(0x01)
	None RandomSeedInfo; // 0x120(0x20)
	None StartLocation; // 0x30(0x48)
	None DistributeOverNPoints; // 0x78(0x04)
	None DistributeThreshold; // 0x7c(0x04)
	None RandomSeedInfo; // 0x80(0x20)
	None SourceType; // 0x30(0x01)
	None UniversalOffset; // 0x34(0x0c)
	None SourceLocations; // 0x40(0x10)
	None SelectionMethod; // 0x50(0x01)
	None bUpdatePositionEachFrame; // 0x54(0x01)
	None bOrientMeshEmitters; // 0x54(0x01)
	None bInheritBoneVelocity; // 0x54(0x01)
	None InheritVelocityScale; // 0x58(0x04)
	None SkelMeshActorParamName; // 0x5c(0x08)
	None NumPreSelectedIndices; // 0x64(0x04)
	None Location; // 0x30(0x48)
	None LocationOffset; // 0x78(0x48)
	None ScaleFactor; // 0xc0(0x48)
	None Direction; // 0x108(0x48)
	None EmitterName; // 0x30(0x08)
	None SelectionMethod; // 0x38(0x01)
	None InheritSourceVelocity; // 0x3c(0x01)
	None InheritSourceVelocityScale; // 0x40(0x04)
	None bInheritSourceRotation; // 0x44(0x01)
	None InheritSourceRotationScale; // 0x48(0x04)
	None EmitterName; // 0x30(0x08)
	None Positive_X; // 0x30(0x01)
	None Positive_Y; // 0x30(0x01)
	None Positive_Z; // 0x30(0x01)
	None Negative_X; // 0x30(0x01)
	None Negative_Y; // 0x30(0x01)
	None Negative_Z; // 0x30(0x01)
	None SurfaceOnly; // 0x30(0x01)
	None Velocity; // 0x30(0x01)
	None VelocityScale; // 0x38(0x30)
	None StartLocation; // 0x68(0x48)
	None RadialVelocity; // 0xb0(0x01)
	None StartRadius; // 0xb8(0x30)
	None StartHeight; // 0xe8(0x30)
	None HeightAxis; // 0x118(0x01)
	None RandomSeedInfo; // 0x120(0x20)
	None StartRadius; // 0xb0(0x30)
	None RandomSeedInfo; // 0xe0(0x20)
	None StartOffset; // 0x30(0x48)
	None Height; // 0x78(0x30)
	None Angle; // 0xa8(0x30)
	None Thickness; // 0xd8(0x30)
	None RandomSeedInfo; // 0x80(0x20)
	None MeshMaterials; // 0x30(0x10)
	None StartRotation; // 0x30(0x48)
	None bInheritParent; // 0x78(0x01)
	None RandomSeedInfo; // 0x80(0x20)
	None StartRotationRate; // 0x30(0x48)
	None RandomSeedInfo; // 0x78(0x20)
	None LifeMultiplier; // 0x30(0x48)
	None RotRate; // 0x30(0x48)
	None bScaleRotRate; // 0x78(0x01)
	None bUseEmitterTime; // 0x30(0x01)
	None ChainMode; // 0x38(0x01)
	None OffsetAmount; // 0x40(0x48)
	None OffsetOptions; // 0x88(0x04)
	None RotationAmount; // 0x90(0x48)
	None RotationOptions; // 0xd8(0x04)
	None RotationRateAmount; // 0xe0(0x48)
	None RotationRateOptions; // 0x128(0x04)
	None LockAxisFlags; // 0x30(0x01)
	None DynamicParams; // 0x30(0x10)
	None UpdateFlags; // 0x40(0x04)
	None bUsesVelocity; // 0x44(0x01)
	None RandomSeedInfo; // 0x48(0x20)
	None PivotOffset; // 0x30(0x08)
	None Material; // 0x30(0x08)
	None MinFacingCameraBlendDistance; // 0x38(0x04)
	None MaxFacingCameraBlendDistance; // 0x3c(0x04)
	None EmitterOrigin; // 0x40(0x0c)
	None EmitterRotation; // 0x4c(0x0c)
	None ScreenAlignment; // 0x58(0x01)
	None bUseLocalSpace; // 0x59(0x01)
	None bKillOnDeactivate; // 0x59(0x01)
	None bKillOnCompleted; // 0x59(0x01)
	None SortMode; // 0x5a(0x01)
	None bUseLegacyEmitterTime; // 0x5b(0x01)
	None bRemoveHMDRoll; // 0x5b(0x01)
	None bEmitterDurationUseRange; // 0x5b(0x01)
	None EmitterDuration; // 0x5c(0x04)
	None SpawnRate; // 0x60(0x30)
	None BurstList; // 0x90(0x10)
	None EmitterDelay; // 0xa0(0x04)
	None EmitterDelayLow; // 0xa4(0x04)
	None bDelayFirstLoopOnly; // 0xa8(0x01)
	None InterpolationMethod; // 0xa9(0x01)
	None bScaleUV; // 0xaa(0x01)
	None bEmitterDelayUseRange; // 0xaa(0x01)
	None ParticleBurstMethod; // 0xab(0x01)
	None bOverrideSystemMacroUV; // 0xac(0x01)
	None bUseMaxDrawCount; // 0xac(0x01)
	None OpacitySourceMode; // 0xad(0x01)
	None EmitterNormalsMode; // 0xae(0x01)
	None bOrbitModuleAffectsVelocityAlignment; // 0xaf(0x01)
	None SubImages_Horizontal; // 0xb0(0x04)
	None SubImages_Vertical; // 0xb4(0x04)
	None RandomImageTime; // 0xb8(0x04)
	None RandomImageChanges; // 0xbc(0x04)
	None MacroUVPosition; // 0xc0(0x0c)
	None MacroUVRadius; // 0xcc(0x04)
	None UVFlippingMode; // 0xd0(0x01)
	None BoundingMode; // 0xd1(0x01)
	None bDurationRecalcEachLoop; // 0xd2(0x01)
	None NormalsSphereCenter; // 0xd4(0x0c)
	None AlphaThreshold; // 0xe0(0x04)
	None EmitterLoops; // 0xe4(0x04)
	None CutoutTexture; // 0xe8(0x08)
	None MaxDrawCount; // 0xf0(0x04)
	None EmitterDurationLow; // 0xf4(0x04)
	None NormalsCylinderDirection; // 0xf8(0x0c)
	None NamedMaterialOverrides; // 0x108(0x10)
	None StartRotation; // 0x30(0x30)
	None RandomSeedInfo; // 0x60(0x20)
	None RotationOverLife; // 0x30(0x30)
	None Scale; // 0x60(0x01)
	None StartRotationRate; // 0x30(0x30)
	None RandomSeedInfo; // 0x60(0x20)
	None LifeMultiplier; // 0x30(0x30)
	None StartSize; // 0x30(0x48)
	None RandomSeedInfo; // 0x78(0x20)
	None SizeScaleByTime; // 0x30(0x48)
	None bEnableX; // 0x78(0x01)
	None bEnableY; // 0x78(0x01)
	None bEnableZ; // 0x78(0x01)
	None LifeMultiplier; // 0x30(0x48)
	None MultiplyX; // 0x78(0x01)
	None MultiplyY; // 0x78(0x01)
	None MultiplyZ; // 0x78(0x01)
	None SizeScale; // 0x30(0x48)
	None EnableX; // 0x78(0x01)
	None EnableY; // 0x78(0x01)
	None EnableZ; // 0x78(0x01)
	None SpeedScale; // 0x30(0x08)
	None MaxScale; // 0x38(0x08)
	None SourceMovementScale; // 0x30(0x48)
	None bProcessSpawnRate; // 0x30(0x01)
	None bProcessBurstList; // 0x30(0x01)
	None Rate; // 0x38(0x30)
	None RateScale; // 0x68(0x30)
	None ParticleBurstMethod; // 0x98(0x01)
	None BurstList; // 0xa0(0x10)
	None BurstScale; // 0xb0(0x30)
	None bApplyGlobalSpawnRateScale; // 0xe0(0x01)
	None UnitScalar; // 0x38(0x04)
	None MovementTolerance; // 0x3c(0x04)
	None SpawnPerUnit; // 0x40(0x30)
	None MaxFrameDistance; // 0x70(0x04)
	None bIgnoreSpawnRateWhenMoving; // 0x74(0x01)
	None bIgnoreMovementAlongX; // 0x74(0x01)
	None bIgnoreMovementAlongY; // 0x74(0x01)
	None bIgnoreMovementAlongZ; // 0x74(0x01)
	None Animation; // 0x30(0x08)
	None SubImageIndex; // 0x38(0x30)
	None bUseRealTime; // 0x68(0x01)
	None bUseEmitterTime; // 0x70(0x01)
	None FrameRate; // 0x78(0x30)
	None StartingFrame; // 0xa8(0x04)
	None SourceMethod; // 0x30(0x01)
	None SourceName; // 0x34(0x08)
	None SourceStrength; // 0x40(0x30)
	None bLockSourceStength; // 0x70(0x01)
	None SourceOffsetCount; // 0x74(0x04)
	None SourceOffsetDefaults; // 0x78(0x10)
	None SelectionMethod; // 0x88(0x01)
	None bInheritRotation; // 0x8c(0x01)
	None bDeadTrailsOnDeactivate; // 0x30(0x01)
	None bEnablePreviousTangentRecalculation; // 0x30(0x01)
	None bTangentRecalculationEveryFrame; // 0x30(0x01)
	None TilingDistance; // 0x34(0x04)
	None DistanceTessellationStepSize; // 0x38(0x04)
	None TangentTessellationStepSize; // 0x3c(0x04)
	None WidthTessellationStepSize; // 0x40(0x04)
	None BeamMethod; // 0x30(0x01)
	None TextureTile; // 0x34(0x04)
	None TextureTileDistance; // 0x38(0x04)
	None Sheets; // 0x3c(0x04)
	None MaxBeamCount; // 0x40(0x04)
	None Speed; // 0x44(0x04)
	None InterpolationPoints; // 0x48(0x04)
	None bAlwaysOn; // 0x4c(0x01)
	None UpVectorStepSize; // 0x50(0x04)
	None BranchParentName; // 0x54(0x08)
	None Distance; // 0x60(0x30)
	None TaperMethod; // 0x90(0x01)
	None TaperFactor; // 0x98(0x30)
	None TaperScale; // 0xc8(0x30)
	None RenderGeometry; // 0xf8(0x01)
	None RenderDirectLine; // 0xf8(0x01)
	None RenderLines; // 0xf8(0x01)
	None RenderTessellation; // 0xf8(0x01)
	None EmitterInfo; // 0x30(0x280)
	None ResourceData; // 0x2b0(0x160)
	None CameraMotionBlurAmount; // 0x410(0x04)
	None bClearExistingParticlesOnInit; // 0x414(0x01)
	None Mesh; // 0x30(0x08)
	None LODSizeScale; // 0x40(0x04)
	None bUseStaticMeshLODs; // 0x44(0x01)
	None CastShadows; // 0x44(0x01)
	None DoCollisions; // 0x44(0x01)
	None MeshAlignment; // 0x45(0x01)
	None bOverrideMaterial; // 0x46(0x01)
	None bOverrideDefaultMotionBlurSettings; // 0x46(0x01)
	None bEnableMotionBlur; // 0x46(0x01)
	None RollPitchYawRange; // 0x48(0x48)
	None AxisLockOption; // 0x90(0x01)
	None bCameraFacing; // 0x91(0x01)
	None CameraFacingUpAxisOption; // 0x92(0x01)
	None CameraFacingOption; // 0x93(0x01)
	None bApplyParticleRotationAsSpin; // 0x94(0x01)
	None bFaceCameraDirectionRatherThanPosition; // 0x94(0x01)
	None bCollisionsConsiderPartilceSize; // 0x94(0x01)
	None MaxTessellationBetweenParticles; // 0x30(0x04)
	None SheetsPerTrail; // 0x34(0x04)
	None MaxTrailCount; // 0x38(0x04)
	None MaxParticleInTrailCount; // 0x3c(0x04)
	None bDeadTrailsOnDeactivate; // 0x40(0x01)
	None bDeadTrailsOnSourceLoss; // 0x40(0x01)
	None bClipSourceSegement; // 0x40(0x01)
	None bEnablePreviousTangentRecalculation; // 0x40(0x01)
	None bTangentRecalculationEveryFrame; // 0x40(0x01)
	None bSpawnInitialParticle; // 0x40(0x01)
	None RenderAxis; // 0x44(0x01)
	None TangentSpawningScalar; // 0x48(0x04)
	None bRenderGeometry; // 0x4c(0x01)
	None bRenderSpawnPoints; // 0x4c(0x01)
	None bRenderTangents; // 0x4c(0x01)
	None bRenderTessellation; // 0x4c(0x01)
	None TilingDistance; // 0x50(0x04)
	None DistanceTessellationStepSize; // 0x54(0x04)
	None bEnableTangentDiffInterpScale; // 0x58(0x01)
	None TangentTessellationScalar; // 0x5c(0x04)
	None bOverrideGlobalVectorFieldTightness; // 0x30(0x01)
	None GlobalVectorFieldScale; // 0x34(0x04)
	None GlobalVectorFieldTightness; // 0x38(0x04)
	None VectorField; // 0x30(0x08)
	None RelativeTranslation; // 0x38(0x0c)
	None RelativeRotation; // 0x44(0x0c)
	None RelativeScale3D; // 0x50(0x0c)
	None Intensity; // 0x5c(0x04)
	None Tightness; // 0x60(0x04)
	None bIgnoreComponentTransform; // 0x64(0x01)
	None bTileX; // 0x64(0x01)
	None bTileY; // 0x64(0x01)
	None bTileZ; // 0x64(0x01)
	None bUseFixDT; // 0x64(0x01)
	None MinInitialRotation; // 0x30(0x0c)
	None MaxInitialRotation; // 0x3c(0x0c)
	None RotationRate; // 0x30(0x0c)
	None VectorFieldScale; // 0x30(0x08)
	None VectorFieldScaleRaw; // 0x38(0x30)
	None VectorFieldScaleOverLife; // 0x30(0x08)
	None VectorFieldScaleOverLifeRaw; // 0x38(0x30)
	None bInWorldSpace; // 0x30(0x01)
	None bApplyOwnerScale; // 0x30(0x01)
	None StartVelocity; // 0x38(0x48)
	None StartVelocityRadial; // 0x80(0x30)
	None RandomSeedInfo; // 0xb0(0x20)
	None Angle; // 0x38(0x30)
	None Velocity; // 0x68(0x30)
	None Direction; // 0x98(0x0c)
	None Scale; // 0x38(0x48)
	None VelOverLife; // 0x38(0x48)
	None Absolute; // 0x80(0x01)
	None UpdateTime_FPS; // 0x30(0x04)
	None UpdateTime_Delta; // 0x34(0x04)
	None WarmupTime; // 0x38(0x04)
	None WarmupTickRate; // 0x3c(0x04)
	None Emitters; // 0x40(0x10)
	None PreviewComponent; // 0x50(0x08)
	None CurveEdSetup; // 0x58(0x08)
	None LODDistanceCheckTime; // 0x60(0x04)
	None MacroUVRadius; // 0x64(0x04)
	None LODDistances; // 0x68(0x10)
	None LODSettings; // 0x78(0x10)
	None FixedRelativeBoundingBox; // 0x88(0x1c)
	None SecondsBeforeInactive; // 0xa4(0x04)
	None Delay; // 0xa8(0x04)
	None DelayLow; // 0xac(0x04)
	None bOrientZAxisTowardCamera; // 0xb0(0x01)
	None bUseFixedRelativeBoundingBox; // 0xb0(0x01)
	None bShouldResetPeakCounts; // 0xb0(0x01)
	None bHasPhysics; // 0xb0(0x01)
	None bUseRealtimeThumbnail; // 0xb0(0x01)
	None ThumbnailImageOutOfDate; // 0xb0(0x01)
	None bUseDelayRange; // 0xb1(0x01)
	None bAllowManagedTicking; // 0xb1(0x01)
	None bAutoDeactivate; // 0xb1(0x01)
	None bRegenerateLODDuplicate; // 0xb1(0x01)
	None SystemUpdateMode; // 0xb2(0x01)
	None LODMethod; // 0xb3(0x01)
	None InsignificantReaction; // 0xb4(0x01)
	None OcclusionBoundsMethod; // 0xb5(0x01)
	None MaxSignificanceLevel; // 0xb7(0x01)
	None MinTimeBetweenTicks; // 0xb8(0x04)
	None InsignificanceDelay; // 0xbc(0x04)
	None MacroUVPosition; // 0xc0(0x0c)
	None CustomOcclusionBounds; // 0xcc(0x1c)
	None SoloTracking; // 0xe8(0x10)
	None NamedMaterialSlots; // 0xf8(0x10)
	None ClipIDNumber; // 0x28(0x04)
	None bAIPerceptionSystemCompatibilityMode; // 0xb0(0x01)
	None LastRemoteNoisePosition; // 0xb4(0x0c)
	None NoiseLifetime; // 0xc0(0x04)
	None LastRemoteNoiseVolume; // 0xc4(0x04)
	None LastRemoteNoiseTime; // 0xc8(0x04)
	None LastLocalNoiseVolume; // 0xcc(0x04)
	None LastLocalNoiseTime; // 0xd0(0x04)
	None StrengthMultiplyer; // 0xb0(0x04)
	None SkeletalMeshComponent; // 0xb8(0x08)
	None Friction; // 0x28(0x04)
	None FrictionCombineMode; // 0x2c(0x01)
	None bOverrideFrictionCombineMode; // 0x2d(0x01)
	None Restitution; // 0x30(0x04)
	None RestitutionCombineMode; // 0x34(0x01)
	None bOverrideRestitutionCombineMode; // 0x35(0x01)
	None Density; // 0x38(0x04)
	None RaiseMassToPower; // 0x3c(0x04)
	None DestructibleDamageThresholdScale; // 0x40(0x04)
	None PhysicalMaterialProperty; // 0x48(0x08)
	None SurfaceType; // 0x50(0x01)
	None TireFrictionScale; // 0x54(0x04)
	None TireFrictionScales; // 0x58(0x10)
	None UVChannelIndex; // 0x28(0x04)
	None AddressX; // 0x2c(0x01)
	None AddressY; // 0x2d(0x01)
	None BoundsBodies; // 0x30(0x10)
	None SkeletalBodySetups; // 0x40(0x10)
	None ConstraintSetup; // 0x50(0x10)
	None SolverIterations; // 0x60(0x18)
	None bNotForDedicatedServer; // 0x78(0x01)
	None ThumbnailInfo; // 0x120(0x08)
	None BodySetup; // 0x128(0x10)
	None bSkipScaleFromAnimation; // 0x250(0x01)
	None PhysicalAnimationData; // 0x258(0x10)
	None ImpactThreshold; // 0x28(0x04)
	None ImpactReFireDelay; // 0x2c(0x04)
	None DefaultImpactSound; // 0x30(0x08)
	None LastImpactSoundTime; // 0x38(0x04)
	None ConstraintComp; // 0x220(0x08)
	None ConstraintActor1; // 0x228(0x08)
	None ConstraintActor2; // 0x230(0x08)
	None bDisableCollision; // 0x238(0x01)
	None ConstraintActor1; // 0x208(0x08)
	None ComponentName1; // 0x210(0x08)
	None ConstraintActor2; // 0x218(0x08)
	None ComponentName2; // 0x220(0x08)
	None ConstraintSetup; // 0x238(0x08)
	None OnConstraintBroken; // 0x240(0x10)
	None ConstraintInstance; // 0x250(0x1b8)
	None DefaultInstance; // 0x28(0x1b8)
	None ProfileHandles; // 0x1e0(0x10)
	None DefaultProfile; // 0x1f0(0x104)
	None GrabbedComponent; // 0xb0(0x08)
	None bSoftAngularConstraint; // 0xc0(0x01)
	None bSoftLinearConstraint; // 0xc0(0x01)
	None bInterpolateTarget; // 0xc0(0x01)
	None LinearDamping; // 0xc4(0x04)
	None LinearStiffness; // 0xc8(0x04)
	None AngularDamping; // 0xcc(0x04)
	None AngularStiffness; // 0xd0(0x04)
	None InterpolationSpeed; // 0x140(0x04)
	None DefaultGravityZ; // 0x38(0x04)
	None DefaultTerminalVelocity; // 0x3c(0x04)
	None DefaultFluidFriction; // 0x40(0x04)
	None SimulateScratchMemorySize; // 0x44(0x04)
	None RagdollAggregateThreshold; // 0x48(0x04)
	None TriangleMeshTriangleMinAreaThreshold; // 0x4c(0x04)
	None bEnableShapeSharing; // 0x50(0x01)
	None bEnablePCM; // 0x51(0x01)
	None bEnableStabilization; // 0x52(0x01)
	None bWarnMissingLocks; // 0x53(0x01)
	None bEnable2DPhysics; // 0x54(0x01)
	None PhysicErrorCorrection; // 0x58(0x34)
	None LockedAxis; // 0x8c(0x01)
	None DefaultDegreesOfFreedom; // 0x8d(0x01)
	None BounceThresholdVelocity; // 0x90(0x04)
	None FrictionCombineMode; // 0x94(0x01)
	None RestitutionCombineMode; // 0x95(0x01)
	None MaxAngularVelocity; // 0x98(0x04)
	None MaxDepenetrationVelocity; // 0x9c(0x04)
	None ContactOffsetMultiplier; // 0xa0(0x04)
	None MinContactOffset; // 0xa4(0x04)
	None MaxContactOffset; // 0xa8(0x04)
	None bSimulateSkeletalMeshOnDedicatedServer; // 0xac(0x01)
	None DefaultShapeComplexity; // 0xad(0x01)
	None bDefaultHasComplexCollision; // 0xae(0x01)
	None bSuppressFaceRemapTable; // 0xaf(0x01)
	None bSupportUVFromHitResults; // 0xb0(0x01)
	None bDisableActiveActors; // 0xb1(0x01)
	None bDisableKinematicStaticPairs; // 0xb2(0x01)
	None bDisableKinematicKinematicPairs; // 0xb3(0x01)
	None bDisableCCD; // 0xb4(0x01)
	None bEnableEnhancedDeterminism; // 0xb5(0x01)
	None AnimPhysicsMinDeltaTime; // 0xb8(0x04)
	None bSimulateAnimPhysicsAfterReset; // 0xbc(0x01)
	None MaxPhysicsDeltaTime; // 0xc0(0x04)
	None bSubstepping; // 0xc4(0x01)
	None bSubsteppingAsync; // 0xc5(0x01)
	None MaxSubstepDeltaTime; // 0xc8(0x04)
	None MaxSubsteps; // 0xcc(0x04)
	None SyncSceneSmoothingFactor; // 0xd0(0x04)
	None InitialAverageFrameRate; // 0xd4(0x04)
	None PhysXTreeRebuildRate; // 0xd8(0x04)
	None PhysicalSurfaces; // 0xe0(0x10)
	None DefaultBroadphaseSettings; // 0xf0(0x40)
	None ChaosSettings; // 0x130(0x03)
	None SpringStiffness; // 0x208(0x04)
	None SpringDamping; // 0x20c(0x04)
	None SpringLengthAtRest; // 0x210(0x04)
	None SpringRadius; // 0x214(0x04)
	None SpringChannel; // 0x218(0x01)
	None bIgnoreSelf; // 0x219(0x01)
	None SpringCompression; // 0x21c(0x04)
	None ThrusterComponent; // 0x220(0x08)
	None ThrustStrength; // 0x208(0x04)
	None MeshComp; // 0x220(0x08)
	None SceneComponent; // 0x228(0x08)
	None PlanarReflectionComponent; // 0x230(0x08)
	None bShowPreviewPlane; // 0x238(0x01)
	None PrimitiveRenderMode; // 0x208(0x01)
	None CaptureSource; // 0x209(0x01)
	None bCaptureEveryFrame; // 0x20a(0x01)
	None bCaptureOnMovement; // 0x20a(0x01)
	None bAlwaysPersistRenderingState; // 0x20b(0x01)
	None HiddenComponents; // 0x210(0x10)
	None HiddenActors; // 0x220(0x10)
	None ShowOnlyComponents; // 0x230(0x10)
	None ShowOnlyActors; // 0x240(0x10)
	None LODDistanceFactor; // 0x250(0x04)
	None MaxViewDistanceOverride; // 0x254(0x04)
	None CaptureSortPriority; // 0x258(0x04)
	None bUseRayTracingIfEnabled; // 0x25c(0x01)
	None ShowFlagSettings; // 0x260(0x10)
	None ProfilingEventName; // 0x280(0x10)
	None PreviewBox; // 0x2a0(0x08)
	None NormalDistortionStrength; // 0x2a8(0x04)
	None PrefilterRoughness; // 0x2ac(0x04)
	None PrefilterRoughnessDistance; // 0x2b0(0x04)
	None ScreenPercentage; // 0x2b4(0x04)
	None ExtraFOV; // 0x2b8(0x04)
	None DistanceFromPlaneFadeStart; // 0x2bc(0x04)
	None DistanceFromPlaneFadeEnd; // 0x2c0(0x04)
	None DistanceFromPlaneFadeoutStart; // 0x2c4(0x04)
	None DistanceFromPlaneFadeoutEnd; // 0x2c8(0x04)
	None AngleFromPlaneFadeStart; // 0x2cc(0x04)
	None AngleFromPlaneFadeEnd; // 0x2d0(0x04)
	None bShowPreviewPlane; // 0x2d4(0x01)
	None bRenderSceneTwoSided; // 0x2d5(0x01)
	None InfluenceRadiusScale; // 0x280(0x04)
	None PreviewInfluenceRadius; // 0x288(0x08)
	None PreviewCaptureBox; // 0x290(0x08)
	None PlatformChangedToLaptopModeDelegate; // 0xb0(0x10)
	None PlatformChangedToTabletModeDelegate; // 0xc0(0x10)
	None OriginalURL; // 0x28(0x10)
	None ResponseCode; // 0x38(0x04)
	None Tag; // 0x3c(0x04)
	None StringResponse; // 0x40(0x10)
	None BinaryResponse; // 0x50(0x10)
	None MaxFullAxisLength; // 0x28(0x04)
	None MaxFullAxisDeadZoneLength; // 0x2c(0x04)
	None MaxDeltaAxisLength; // 0x30(0x04)
	None SwipeMaxDuration; // 0x34(0x04)
	None SwipeMinLength; // 0x38(0x04)
	None SwipeDirectionAngleThreshold; // 0x3c(0x04)
	None TapMaxDuration; // 0x40(0x04)
	None TapMaxLength; // 0x44(0x04)
	None DoubleTapMaxLength; // 0x48(0x04)
	None DoubleTapMaxDuration; // 0x4c(0x04)
	None TouchRegions; // 0x50(0x10)
	None PointLightComponent; // 0x230(0x08)
	None bUseInverseSquaredFalloff; // 0x350(0x01)
	None LightFalloffExponent; // 0x354(0x04)
	None SourceRadius; // 0x358(0x04)
	None SoftSourceRadius; // 0x35c(0x04)
	None SourceLength; // 0x360(0x04)
	None PoseContainer; // 0x80(0x90)
	None bAdditivePose; // 0x110(0x01)
	None BasePoseIndex; // 0x114(0x04)
	None RetargetSource; // 0x118(0x08)
	None Node; // 0x28(0x08)
	None PoseWatchColour; // 0x30(0x04)
	None Settings; // 0x210(0x550)
	None Priority; // 0x760(0x04)
	None BlendRadius; // 0x764(0x04)
	None BlendWeight; // 0x768(0x04)
	None bEnabled; // 0x76c(0x01)
	None bUnbound; // 0x76c(0x01)
	None Settings; // 0x260(0x550)
	None Priority; // 0x7b0(0x04)
	None BlendRadius; // 0x7b4(0x04)
	None BlendWeight; // 0x7b8(0x04)
	None bEnabled; // 0x7bc(0x01)
	None bUnbound; // 0x7bc(0x01)
	None OverrideVisibleActors; // 0x258(0x10)
	None OverrideInvisibleActors; // 0x268(0x10)
	None OverrideInvisibleLevels; // 0x278(0x10)
	None Skeleton; // 0x38(0x08)
	None SkeletalMeshes; // 0x40(0x10)
	None ProxyLODMeshReductionModuleName; // 0x38(0x08)
	None ForceComponent; // 0x220(0x08)
	None Radius; // 0x208(0x04)
	None Falloff; // 0x20c(0x01)
	None ImpulseStrength; // 0x210(0x04)
	None bImpulseVelChange; // 0x214(0x01)
	None bIgnoreOwningActor; // 0x214(0x01)
	None ForceStrength; // 0x218(0x04)
	None DestructibleDamage; // 0x21c(0x04)
	None ObjectTypesToAffect; // 0x220(0x10)
	None RectLightComponent; // 0x230(0x08)
	None SourceWidth; // 0x350(0x04)
	None SourceHeight; // 0x354(0x04)
	None BarnDoorAngle; // 0x358(0x04)
	None BarnDoorLength; // 0x35c(0x04)
	None SourceTexture; // 0x360(0x08)
	None bMobileDisableVertexFog; // 0x38(0x01)
	None MaxMobileCascades; // 0x3c(0x04)
	None MobileMSAASampleCount; // 0x40(0x01)
	None bMobileUseLegacyShadingModel; // 0x44(0x01)
	None bMobileAllowDitheredLODTransition; // 0x44(0x01)
	None bMobileAllowSoftwareOcclusionCulling; // 0x44(0x01)
	None bMobileVirtualTextures; // 0x44(0x01)
	None bDiscardUnusedQualityLevels; // 0x44(0x01)
	None bOcclusionCulling; // 0x44(0x01)
	None MinScreenRadiusForLights; // 0x48(0x04)
	None MinScreenRadiusForEarlyZPass; // 0x4c(0x04)
	None MinScreenRadiusForCSMdepth; // 0x50(0x04)
	None bPrecomputedVisibilityWarning; // 0x54(0x01)
	None bTextureStreaming; // 0x54(0x01)
	None bUseDXT5NormalMaps; // 0x54(0x01)
	None bVirtualTextures; // 0x54(0x01)
	None bVirtualTexturedLightmaps; // 0x54(0x01)
	None VirtualTextureTileSize; // 0x58(0x04)
	None VirtualTextureTileBorderSize; // 0x5c(0x04)
	None VirtualTextureFeedbackFactor; // 0x60(0x04)
	None bVirtualTextureEnableCompressZlib; // 0x64(0x01)
	None bVirtualTextureEnableCompressCrunch; // 0x64(0x01)
	None bClearCoatEnableSecondNormal; // 0x64(0x01)
	None bAnisotropicBRDF; // 0x64(0x01)
	None ReflectionCaptureResolution; // 0x68(0x04)
	None ReflectionEnvironmentLightmapMixBasedOnRoughness; // 0x6c(0x01)
	None bForwardShading; // 0x6c(0x01)
	None bVertexFoggingForOpaque; // 0x6c(0x01)
	None bAllowStaticLighting; // 0x6c(0x01)
	None bUseNormalMapsForStaticLighting; // 0x6c(0x01)
	None bGenerateMeshDistanceFields; // 0x6c(0x01)
	None bEightBitMeshDistanceFields; // 0x6c(0x01)
	None bGenerateLandscapeGIData; // 0x6c(0x01)
	None bCompressMeshDistanceFields; // 0x6d(0x01)
	None TessellationAdaptivePixelsPerTriangle; // 0x70(0x04)
	None bSeparateTranslucency; // 0x74(0x01)
	None TranslucentSortPolicy; // 0x78(0x01)
	None TranslucentSortAxis; // 0x7c(0x0c)
	None CustomDepthStencil; // 0x88(0x01)
	None bCustomDepthTaaJitter; // 0x8c(0x01)
	None bEnableAlphaChannelInPostProcessing; // 0x90(0x01)
	None NGXAppId; // 0x98(0x10)
	None bDefaultFeatureBloom; // 0xa8(0x01)
	None bDefaultFeatureAmbientOcclusion; // 0xa8(0x01)
	None bDefaultFeatureAmbientOcclusionStaticFraction; // 0xa8(0x01)
	None bDefaultFeatureAutoExposure; // 0xa8(0x01)
	None DefaultFeatureAutoExposure; // 0xac(0x01)
	None DefaultFeatureAutoExposureBias; // 0xb0(0x04)
	None bExtendDefaultLuminanceRangeInAutoExposureSettings; // 0xb4(0x01)
	None bUsePreExposure; // 0xb4(0x01)
	None bEnablePreExposureOnlyInTheEditor; // 0xb4(0x01)
	None bDefaultFeatureMotionBlur; // 0xb4(0x01)
	None bDefaultFeatureLensFlare; // 0xb4(0x01)
	None bTemporalUpsampling; // 0xb4(0x01)
	None bSSGI; // 0xb4(0x01)
	None DefaultFeatureAntiAliasing; // 0xb8(0x01)
	None DefaultLightUnits; // 0xb9(0x01)
	None DefaultBackBufferPixelFormat; // 0xba(0x01)
	None bRenderUnbuiltPreviewShadowsInGame; // 0xbc(0x01)
	None bStencilForLODDither; // 0xbc(0x01)
	None EarlyZPass; // 0xc0(0x01)
	None bEarlyZPassOnlyMaterialMasking; // 0xc4(0x01)
	None bDBuffer; // 0xc4(0x01)
	None ClearSceneMethod; // 0xc8(0x01)
	None bBasePassOutputsVelocity; // 0xcc(0x01)
	None bVertexDeformationOutputsVelocity; // 0xcc(0x01)
	None bSelectiveBasePassOutputs; // 0xcc(0x01)
	None bDefaultParticleCutouts; // 0xcc(0x01)
	None GPUSimulationTextureSizeX; // 0xd0(0x04)
	None GPUSimulationTextureSizeY; // 0xd4(0x04)
	None bGlobalClipPlane; // 0xd8(0x01)
	None GBufferFormat; // 0xdc(0x01)
	None bUseGPUMorphTargets; // 0xe0(0x01)
	None bNvidiaAftermathEnabled; // 0xe0(0x01)
	None bMultiView; // 0xe0(0x01)
	None bMobilePostProcessing; // 0xe0(0x01)
	None bMobileMultiView; // 0xe0(0x01)
	None bMobileUseHWsRGBEncoding; // 0xe0(0x01)
	None bRoundRobinOcclusion; // 0xe0(0x01)
	None bODSCapture; // 0xe0(0x01)
	None bMeshStreaming; // 0xe1(0x01)
	None WireframeCullThreshold; // 0xe4(0x04)
	None bEnableRayTracing; // 0xe8(0x01)
	None bEnableRayTracingTextureLOD; // 0xe8(0x01)
	None bSupportStationarySkylight; // 0xe8(0x01)
	None bSupportLowQualityLightmaps; // 0xe8(0x01)
	None bSupportPointLightWholeSceneShadows; // 0xe8(0x01)
	None bSupportAtmosphericFog; // 0xe8(0x01)
	None bSupportSkyAtmosphere; // 0xe8(0x01)
	None bSupportSkyAtmosphereAffectsHeightFog; // 0xe8(0x01)
	None bSupportSkinCacheShaders; // 0xe9(0x01)
	None DefaultSkinCacheBehavior; // 0xec(0x01)
	None SkinCacheSceneMemoryLimitInMB; // 0xf0(0x04)
	None bMobileEnableStaticAndCSMShadowReceivers; // 0xf4(0x01)
	None bMobileEnableMovableLightCSMShaderCulling; // 0xf4(0x01)
	None bMobileAllowDistanceFieldShadows; // 0xf4(0x01)
	None bMobileAllowMovableDirectionalLights; // 0xf4(0x01)
	None MobileNumDynamicPointLights; // 0xf8(0x04)
	None bMobileDynamicPointLightsUseStaticBranch; // 0xfc(0x01)
	None bMobileAllowMovableSpotlights; // 0xfc(0x01)
	None bSupport16BitBoneIndex; // 0xfc(0x01)
	None bGPUSkinLimit2BoneInfluences; // 0xfc(0x01)
	None bSupportDepthOnlyIndexBuffers; // 0xfc(0x01)
	None bSupportReversedIndexBuffers; // 0xfc(0x01)
	None bSupportMaterialLayers; // 0xfc(0x01)
	None bLPV; // 0xfc(0x01)
	None bSupportAllShaderPermutations; // 0x38(0x01)
	None bForceRecomputeTangents; // 0x38(0x01)
	None Density; // 0x28(0x04)
	None Diffusion; // 0x2c(0x04)
	None Gain; // 0x30(0x04)
	None GainHF; // 0x34(0x04)
	None DecayTime; // 0x38(0x04)
	None DecayHFRatio; // 0x3c(0x04)
	None ReflectionsGain; // 0x40(0x04)
	None ReflectionsDelay; // 0x44(0x04)
	None LateGain; // 0x48(0x04)
	None LateDelay; // 0x4c(0x04)
	None AirAbsorptionGainHF; // 0x50(0x04)
	None RoomRolloffFactor; // 0x54(0x04)
	None TransformBases; // 0x30(0x10)
	None Nodes; // 0x40(0x10)
	None RotationRate; // 0xf0(0x0c)
	None PivotTranslation; // 0xfc(0x0c)
	None bRotationInLocalSpace; // 0x108(0x01)
	None MaterialType; // 0x28(0x01)
	None bCompressTextures; // 0x29(0x01)
	None bEnable; // 0x2a(0x01)
	None bClearTextures; // 0x2b(0x01)
	None bSinglePhysicalSpace; // 0x2c(0x01)
	None bPrivateSpace; // 0x2d(0x01)
	None bEnableScalability; // 0x2e(0x01)
	None Size; // 0x30(0x04)
	None TileCount; // 0x34(0x04)
	None TileSize; // 0x38(0x04)
	None TileBorderSize; // 0x3c(0x04)
	None StreamLowMips; // 0x40(0x04)
	None StreamingTexture; // 0x48(0x08)
	None bEnableCompressCrunch; // 0x50(0x01)
	None RemoveLowMips; // 0x54(0x04)
	None VirtualTexture; // 0x208(0x08)
	None bUseStreamingLowMipsInEditor; // 0x210(0x01)
	None BoundsSourceActor; // 0x218(0x08)
	None Settings; // 0xe8(0x0c)
	None bSinglePhysicalSpace; // 0xf4(0x01)
	None BuildHash; // 0xf8(0x04)
	None VirtualTextureComponent; // 0x220(0x08)
	None CaptureComponent2D; // 0x230(0x08)
	None ProjectionType; // 0x2a0(0x01)
	None FOVAngle; // 0x2a4(0x04)
	None OrthoWidth; // 0x2a8(0x04)
	None TextureTarget; // 0x2b0(0x08)
	None CompositeMode; // 0x2b8(0x01)
	None PostProcessSettings; // 0x2c0(0x550)
	None PostProcessBlendWeight; // 0x810(0x04)
	None bOverride_CustomNearClippingPlane; // 0x814(0x01)
	None CustomNearClippingPlane; // 0x818(0x04)
	None bUseCustomProjectionMatrix; // 0x81c(0x01)
	None CustomProjectionMatrix; // 0x820(0x40)
	None bEnableClipPlane; // 0x860(0x01)
	None ClipPlaneBase; // 0x864(0x0c)
	None ClipPlaneNormal; // 0x870(0x0c)
	None bCameraCutThisFrame; // 0x87c(0x01)
	None bConsiderUnrenderedOpaquePixelAsFullyTranslucent; // 0x87c(0x01)
	None bDisableFlipCopyGLES; // 0x880(0x01)
	None TextureTarget; // 0x2a0(0x08)
	None bCaptureRotation; // 0x2a8(0x01)
	None TextureTargetLeft; // 0x2b0(0x08)
	None TextureTargetRight; // 0x2b8(0x08)
	None TextureTargetODS; // 0x2c0(0x08)
	None IPD; // 0x2c8(0x04)
	None CaptureComponentCube; // 0x230(0x08)
	None ComponentClass; // 0x28(0x08)
	None ComponentTemplate; // 0x30(0x08)
	None CookedComponentInstancingData; // 0x38(0x48)
	None AttachToName; // 0x80(0x08)
	None ParentComponentOrVariableName; // 0x88(0x08)
	None ParentComponentOwnerClassName; // 0x90(0x08)
	None bIsParentComponentNative; // 0x98(0x01)
	None ChildNodes; // 0xa0(0x10)
	None MetaDataArray; // 0xb0(0x10)
	None VariableGuid; // 0xc0(0x10)
	None InternalVariableName; // 0xd0(0x08)
	None bUpdateStatNet; // 0x220(0x01)
	None bOverwriteClientStats; // 0x221(0x01)
	None Channels; // 0x224(0x04)
	None InRate; // 0x228(0x04)
	None OutRate; // 0x22c(0x04)
	None MaxPacketOverhead; // 0x234(0x04)
	None InRateClientMax; // 0x238(0x04)
	None InRateClientMin; // 0x23c(0x04)
	None InRateClientAvg; // 0x240(0x04)
	None InPacketsClientMax; // 0x244(0x04)
	None InPacketsClientMin; // 0x248(0x04)
	None InPacketsClientAvg; // 0x24c(0x04)
	None OutRateClientMax; // 0x250(0x04)
	None OutRateClientMin; // 0x254(0x04)
	None OutRateClientAvg; // 0x258(0x04)
	None OutPacketsClientMax; // 0x25c(0x04)
	None OutPacketsClientMin; // 0x260(0x04)
	None OutPacketsClientAvg; // 0x264(0x04)
	None NetNumClients; // 0x268(0x04)
	None InPackets; // 0x26c(0x04)
	None OutPackets; // 0x270(0x04)
	None InBunches; // 0x274(0x04)
	None OutBunches; // 0x278(0x04)
	None OutLoss; // 0x27c(0x04)
	None InLoss; // 0x280(0x04)
	None VoiceBytesSent; // 0x284(0x04)
	None VoiceBytesRecv; // 0x288(0x04)
	None VoicePacketsSent; // 0x28c(0x04)
	None VoicePacketsRecv; // 0x290(0x04)
	None PercentInVoice; // 0x294(0x04)
	None PercentOutVoice; // 0x298(0x04)
	None NumActorChannels; // 0x29c(0x04)
	None NumConsideredActors; // 0x2a0(0x04)
	None PrioritizedActors; // 0x2a4(0x04)
	None NumRelevantActors; // 0x2a8(0x04)
	None NumRelevantDeletedActors; // 0x2ac(0x04)
	None NumReplicatedActorAttempts; // 0x2b0(0x04)
	None NumReplicatedActors; // 0x2b4(0x04)
	None NumActors; // 0x2b8(0x04)
	None NumNetActors; // 0x2bc(0x04)
	None NumDormantActors; // 0x2c0(0x04)
	None NumInitiallyDormantActors; // 0x2c4(0x04)
	None NumNetGUIDsAckd; // 0x2c8(0x04)
	None NumNetGUIDsPending; // 0x2cc(0x04)
	None NumNetGUIDsUnAckd; // 0x2d0(0x04)
	None ObjPathBytes; // 0x2d4(0x04)
	None NetGUIDOutRate; // 0x2d8(0x04)
	None NetGUIDInRate; // 0x2dc(0x04)
	None NetSaturated; // 0x2e0(0x04)
	None ShadowmapFlags; // 0xe8(0x01)
	None RootNodes; // 0x28(0x10)
	None AllNodes; // 0x38(0x10)
	None DefaultSceneRootNode; // 0x48(0x08)
	None bShouldDoAnimNotifies; // 0x228(0x01)
	None bWakeOnLevelStart; // 0x228(0x01)
	None SkeletalMeshComponent; // 0x230(0x08)
	None ReplicatedMesh; // 0x238(0x08)
	None ReplicatedPhysAsset; // 0x240(0x08)
	None ReplicatedMaterial0; // 0x248(0x08)
	None ReplicatedMaterial1; // 0x250(0x08)
	None MinLOD; // 0x30(0x04)
	None MaxLod; // 0x34(0x04)
	None DisableBelowMinLodStripping; // 0x38(0x01)
	None bSupportLODStreaming; // 0x39(0x01)
	None MaxNumStreamedLODs; // 0x3c(0x04)
	None MaxNumOptionalLODs; // 0x40(0x04)
	None LODGroups; // 0x48(0x10)
	None bOverrideWillNeverMergeMesh; // 0x58(0x01)
	None bWillNeverMergeMesh; // 0x58(0x01)
	None SkeletalMeshReductionModuleName; // 0x38(0x08)
	None SocketName; // 0x28(0x08)
	None BoneName; // 0x30(0x08)
	None RelativeLocation; // 0x38(0x0c)
	None RelativeRotation; // 0x44(0x0c)
	None RelativeScale; // 0x50(0x0c)
	None bForceAlwaysAnimated; // 0x5c(0x01)
	None TransformMode; // 0x208(0x01)
	None BottomRadius; // 0x20c(0x04)
	None GroundAlbedo; // 0x210(0x04)
	None AtmosphereHeight; // 0x214(0x04)
	None MultiScatteringFactor; // 0x218(0x04)
	None RayleighScatteringScale; // 0x21c(0x04)
	None RayleighScattering; // 0x220(0x10)
	None RayleighExponentialDistribution; // 0x230(0x04)
	None MieScatteringScale; // 0x234(0x04)
	None MieScattering; // 0x238(0x10)
	None MieAbsorptionScale; // 0x248(0x04)
	None MieAbsorption; // 0x24c(0x10)
	None MieAnisotropy; // 0x25c(0x04)
	None MieExponentialDistribution; // 0x260(0x04)
	None OtherAbsorptionScale; // 0x264(0x04)
	None OtherAbsorption; // 0x268(0x10)
	None OtherTentDistribution; // 0x278(0x0c)
	None SkyLuminanceFactor; // 0x284(0x10)
	None AerialPespectiveViewDistanceScale; // 0x294(0x04)
	None HeightFogContribution; // 0x298(0x04)
	None TransmittanceMinLightElevationAngle; // 0x29c(0x04)
	None bStaticLightingBuiltGUID; // 0x2c4(0x10)
	None SkyAtmosphereComponent; // 0x220(0x08)
	None SourceType; // 0x238(0x01)
	None Cubemap; // 0x240(0x08)
	None SourceCubemapAngle; // 0x248(0x04)
	None CubemapResolution; // 0x24c(0x04)
	None SkyDistanceThreshold; // 0x250(0x04)
	None bCaptureEmissiveOnly; // 0x254(0x01)
	None bLowerHemisphereIsBlack; // 0x255(0x01)
	None LowerHemisphereColor; // 0x258(0x10)
	None OcclusionMaxDistance; // 0x268(0x04)
	None Contrast; // 0x26c(0x04)
	None OcclusionExponent; // 0x270(0x04)
	None MinOcclusion; // 0x274(0x04)
	None OcclusionTint; // 0x278(0x04)
	None OcclusionCombineMode; // 0x27c(0x01)
	None BlendDestinationCubemap; // 0x328(0x08)
	None Brush; // 0x28(0x88)
	None Attenuation; // 0x28(0x3a0)
	None Properties; // 0x28(0x60)
	None ChildClasses; // 0x88(0x10)
	None PassiveSoundMixModifiers; // 0x98(0x10)
	None Modulation; // 0xa8(0x10)
	None ParentClass; // 0xb8(0x08)
	None Concurrency; // 0x28(0x20)
	None bPrimeOnLoad; // 0x160(0x01)
	None FirstNode; // 0x168(0x08)
	None VolumeMultiplier; // 0x170(0x04)
	None PitchMultiplier; // 0x174(0x04)
	None AttenuationOverrides; // 0x178(0x3a0)
	None SubtitlePriority; // 0x518(0x04)
	None bOverrideAttenuation; // 0x520(0x01)
	None bExcludeFromRandomNodeBranchCulling; // 0x520(0x01)
	None CookedQualityIndex; // 0x524(0x04)
	None bHasPlayWhenSilent; // 0x528(0x01)
	None Chain; // 0x28(0x10)
	None bPlayEffectChainTails; // 0x38(0x01)
	None SoundGroupProfiles; // 0x28(0x10)
	None bApplyEQ; // 0x28(0x01)
	None EQPriority; // 0x2c(0x04)
	None EQSettings; // 0x30(0x40)
	None SoundClassEffects; // 0x70(0x10)
	None InitialDelay; // 0x80(0x04)
	None FadeInTime; // 0x84(0x04)
	None Duration; // 0x88(0x04)
	None FadeOutTime; // 0x8c(0x04)
	None ChildNodes; // 0x28(0x10)
	None AttenuationSettings; // 0x48(0x08)
	None AttenuationOverrides; // 0x50(0x3a0)
	None bOverrideAttenuation; // 0x3f0(0x01)
	None BoolParameterName; // 0x48(0x08)
	None InputVolume; // 0x48(0x10)
	None DelayMin; // 0x48(0x04)
	None DelayMax; // 0x4c(0x04)
	None DialogueWaveParameter; // 0x48(0x20)
	None bLooping; // 0x68(0x01)
	None CrossFadeInput; // 0x48(0x10)
	None DopplerIntensity; // 0x48(0x04)
	None bUseSmoothing; // 0x4c(0x01)
	None SmoothingInterpSpeed; // 0x50(0x04)
	None LoopStart; // 0x48(0x04)
	None LoopEnd; // 0x4c(0x04)
	None DurationAfterLoop; // 0x50(0x04)
	None LoopCount; // 0x54(0x04)
	None bLoopIndefinitely; // 0x58(0x01)
	None bLoop; // 0x58(0x01)
	None VolumeInterpCurve; // 0x60(0x08)
	None PitchInterpCurve; // 0x68(0x08)
	None VolumeCurve; // 0x70(0x88)
	None PitchCurve; // 0xf8(0x88)
	None PitchMin; // 0x180(0x04)
	None PitchMax; // 0x184(0x04)
	None VolumeMin; // 0x188(0x04)
	None VolumeMax; // 0x18c(0x04)
	None GroupSizes; // 0x48(0x10)
	None LoopCount; // 0x48(0x04)
	None bLoopIndefinitely; // 0x4c(0x01)
	None InputVolume; // 0x48(0x10)
	None PitchMin; // 0x48(0x04)
	None PitchMax; // 0x4c(0x04)
	None VolumeMin; // 0x50(0x04)
	None VolumeMax; // 0x54(0x04)
	None PitchModulationParams; // 0x48(0x20)
	None VolumeModulationParams; // 0x68(0x20)
	None bModulateVolume; // 0x48(0x01)
	None bModulatePitch; // 0x48(0x01)
	None AmplitudeMin; // 0x4c(0x04)
	None AmplitudeMax; // 0x50(0x04)
	None FrequencyMin; // 0x54(0x04)
	None FrequencyMax; // 0x58(0x04)
	None OffsetMin; // 0x5c(0x04)
	None OffsetMax; // 0x60(0x04)
	None CenterMin; // 0x64(0x04)
	None CenterMax; // 0x68(0x04)
	None ParamName; // 0x58(0x08)
	None Weights; // 0x48(0x10)
	None HasBeenUsed; // 0x58(0x10)
	None NumRandomUsed; // 0x68(0x04)
	None PreselectAtLevelLoad; // 0x6c(0x04)
	None bShouldExcludeFromBranchCulling; // 0x70(0x01)
	None bSoundCueExcludedFromBranchCulling; // 0x70(0x01)
	None bRandomizeWithoutReplacement; // 0x70(0x01)
	None SoundClassOverride; // 0x48(0x08)
	None IntParameterName; // 0x48(0x08)
	None WaveParameterName; // 0x48(0x08)
	None SoundWaveAssetPtr; // 0x48(0x28)
	None SoundWave; // 0x70(0x08)
	None bLooping; // 0x78(0x01)
	None SourceBusChannels; // 0x310(0x01)
	None SourceBusDuration; // 0x314(0x04)
	None bAutoDeactivateWhenSilent; // 0x318(0x01)
	None ChildSubmixes; // 0x28(0x10)
	None ParentSubmix; // 0x38(0x08)
	None bMuteWhenBackgrounded; // 0x40(0x01)
	None SubmixEffectChain; // 0x48(0x10)
	None AmbisonicsPluginSettings; // 0x58(0x08)
	None EnvelopeFollowerAttackTime; // 0x60(0x04)
	None EnvelopeFollowerReleaseTime; // 0x64(0x04)
	None OutputVolume; // 0x68(0x04)
	None OnSubmixRecordedFileDone; // 0x70(0x10)
	None SoundfieldEncodingFormat; // 0x40(0x08)
	None EncodingSettings; // 0x48(0x08)
	None SoundfieldEffectChain; // 0x50(0x10)
	None EncodingSettingsClass; // 0x60(0x08)
	None EndpointType; // 0x38(0x08)
	None EndpointSettingsClass; // 0x40(0x08)
	None EndpointSettings; // 0x48(0x08)
	None SoundfieldEndpointType; // 0x38(0x08)
	None EndpointSettingsClass; // 0x40(0x08)
	None EndpointSettings; // 0x48(0x08)
	None EncodingSettingsClass; // 0x50(0x08)
	None EncodingSettings; // 0x58(0x08)
	None SoundfieldEffectChain; // 0x60(0x10)
	None bIgnoreTimeDilation; // 0x150(0x01)
	None DrawCaptureRadius; // 0x228(0x08)
	None InfluenceRadius; // 0x280(0x04)
	None CaptureDistanceScale; // 0x284(0x04)
	None PreviewInfluenceRadius; // 0x288(0x08)
	None SplineCurves; // 0x430(0x68)
	None SplineInfo; // 0x498(0x18)
	None SplineRotInfo; // 0x4b0(0x18)
	None SplineScaleInfo; // 0x4c8(0x18)
	None SplineReparamTable; // 0x4e0(0x18)
	None bAllowSplineEditingPerInstance; // 0x4f8(0x01)
	None ReparamStepsPerSegment; // 0x4fc(0x04)
	None Duration; // 0x500(0x04)
	None bStationaryEndpoints; // 0x504(0x01)
	None bSplineHasBeenEdited; // 0x505(0x01)
	None bModifiedByConstructionScript; // 0x506(0x01)
	None bInputSplinePointsToConstructionScript; // 0x507(0x01)
	None bDrawDebug; // 0x508(0x01)
	None bClosedLoop; // 0x509(0x01)
	None bLoopPositionOverride; // 0x50a(0x01)
	None LoopPosition; // 0x50c(0x04)
	None DefaultUpVector; // 0x510(0x0c)
	None SplineMeshComponent; // 0x220(0x08)
	None SplineParams; // 0x4f0(0x58)
	None SplineUpDir; // 0x548(0x0c)
	None SplineBoundaryMin; // 0x554(0x04)
	None CachedMeshBodySetupGuid; // 0x558(0x10)
	None BodySetup; // 0x568(0x08)
	None SplineBoundaryMax; // 0x570(0x04)
	None bAllowSplineEditingPerInstance; // 0x574(0x01)
	None bSmoothInterpRollScale; // 0x574(0x01)
	None bMeshDirty; // 0x574(0x01)
	None ForwardAxis; // 0x575(0x01)
	None VirtualTextureMainPassMaxDrawDistance; // 0x578(0x04)
	None InnerConeAngle; // 0x368(0x04)
	None OuterConeAngle; // 0x36c(0x04)
	None LightShaftConeAngle; // 0x370(0x04)
	None bCastShadowsOnLowEnd; // 0x374(0x01)
	None MinLOD; // 0x60(0x04)
	None LpvBiasMultiplier; // 0x64(0x04)
	None StaticMaterials; // 0x68(0x10)
	None LightmapUVDensity; // 0x78(0x04)
	None LightMapResolution; // 0x7c(0x04)
	None LightMapCoordinateIndex; // 0x80(0x04)
	None DistanceFieldSelfShadowBias; // 0x84(0x04)
	None BodySetup; // 0x88(0x08)
	None DefaultCreationCollisionProfileName; // 0x90(0x08)
	None LODForCollision; // 0x98(0x04)
	None bGenerateMeshDistanceField; // 0x9c(0x01)
	None bStripComplexCollisionForConsole; // 0x9c(0x01)
	None bHasNavigationData; // 0x9c(0x01)
	None bSupportUniformlyDistributedSampling; // 0x9c(0x01)
	None bSupportPhysicalMaterialMasks; // 0x9c(0x01)
	None bIsBuiltAtRuntime; // 0x9c(0x01)
	None bAllowCPUAccess; // 0x9c(0x01)
	None bSupportGpuUniformlyDistributedSampling; // 0x9d(0x01)
	None Sockets; // 0xc0(0x10)
	None PositiveBoundsExtension; // 0xe0(0x0c)
	None NegativeBoundsExtension; // 0xec(0x0c)
	None ExtendedBounds; // 0xf8(0x1c)
	None ElementToIgnoreForTexFactor; // 0x114(0x04)
	None AssetUserData; // 0x118(0x10)
	None EditableMesh; // 0x130(0x08)
	None NavCollision; // 0x138(0x08)
	None SocketName; // 0x28(0x08)
	None RelativeLocation; // 0x30(0x0c)
	None RelativeRotation; // 0x3c(0x0c)
	None RelativeScale; // 0x48(0x0c)
	None Tag; // 0x58(0x10)
	None bLiveTexture; // 0x208(0x01)
	None bSupportsDepth; // 0x208(0x01)
	None bNoAlphaChannel; // 0x208(0x01)
	None Texture; // 0x210(0x08)
	None LeftTexture; // 0x218(0x08)
	None bQuadPreserveTextureRatio; // 0x220(0x01)
	None QuadSize; // 0x224(0x08)
	None UVRect; // 0x22c(0x14)
	None CylinderRadius; // 0x240(0x04)
	None CylinderOverlayArc; // 0x244(0x04)
	None CylinderHeight; // 0x248(0x04)
	None EquirectProps; // 0x24c(0x48)
	None StereoLayerType; // 0x294(0x01)
	None StereoLayerShape; // 0x295(0x01)
	None Shape; // 0x298(0x08)
	None Priority; // 0x2a0(0x04)
	None Radius; // 0x28(0x04)
	None OverlayArc; // 0x2c(0x04)
	None Height; // 0x30(0x04)
	None LeftUVRect; // 0x28(0x14)
	None RightUVRect; // 0x3c(0x14)
	None LeftScale; // 0x50(0x08)
	None RightScale; // 0x58(0x08)
	None LeftBias; // 0x60(0x08)
	None RightBias; // 0x68(0x08)
	None Settings; // 0x28(0x8c)
	None SubUVTexture; // 0x28(0x08)
	None SubImages_Horizontal; // 0x30(0x04)
	None SubImages_Vertical; // 0x34(0x04)
	None BoundingMode; // 0x38(0x01)
	None OpacitySourceMode; // 0x39(0x01)
	None AlphaThreshold; // 0x3c(0x04)
	None FrameRate; // 0x30(0x08)
	None bGenerateFullFrame; // 0x38(0x01)
	None bUseHighPerformanceClock; // 0x39(0x01)
	None DefaultedText; // 0x28(0x18)
	None UndefaultedText; // 0x40(0x18)
	None TransientText; // 0x58(0x18)
	None TextRender; // 0x220(0x08)
	None Format; // 0xc0(0x01)
	None Brightness; // 0xe8(0x04)
	None TextureMultiplier; // 0xec(0x04)
	None SizeX; // 0xc0(0x04)
	None ClearColor; // 0xc4(0x10)
	None OverrideFormat; // 0xd4(0x01)
	None bHDR; // 0xd5(0x01)
	None bForceLinearGamma; // 0xd5(0x01)
	None TheTimeline; // 0xb0(0x98)
	None bIgnoreTimeDilation; // 0x148(0x01)
	None TimelineLength; // 0x28(0x04)
	None LengthMode; // 0x2c(0x01)
	None bAutoPlay; // 0x2d(0x01)
	None bLoop; // 0x2d(0x01)
	None bReplicated; // 0x2d(0x01)
	None bIgnoreTimeDilation; // 0x2d(0x01)
	None EventTracks; // 0x30(0x10)
	None FloatTracks; // 0x40(0x10)
	None VectorTracks; // 0x50(0x10)
	None LinearColorTracks; // 0x60(0x10)
	None MetaDataArray; // 0x70(0x10)
	None TimelineGuid; // 0x80(0x10)
	None VariableName; // 0x90(0x08)
	None DirectionPropertyName; // 0x98(0x08)
	None UpdateFunctionName; // 0xa0(0x08)
	None FinishedFunctionName; // 0xa8(0x08)
	None FrictionScale; // 0x30(0x04)
	None Controls; // 0x28(0x10)
	None ActiveOpacity; // 0x38(0x04)
	None InactiveOpacity; // 0x3c(0x04)
	None TimeUntilDeactive; // 0x40(0x04)
	None TimeUntilReset; // 0x44(0x04)
	None ActivationDelay; // 0x48(0x04)
	None bPreventRecenter; // 0x4c(0x01)
	None StartupDelay; // 0x50(0x04)
	None CollisionComponent; // 0x220(0x08)
	None DisplayNameMap; // 0x60(0x50)
	None Status; // 0xc0(0x01)
	None Guid; // 0xc4(0x10)
	None RenderFocusRule; // 0x38(0x01)
	None HardwareCursors; // 0x40(0x50)
	None SoftwareCursors; // 0x90(0x50)
	None DefaultCursor; // 0xe0(0x18)
	None TextEditBeamCursor; // 0xf8(0x18)
	None CrosshairsCursor; // 0x110(0x18)
	None HandCursor; // 0x128(0x18)
	None GrabHandCursor; // 0x140(0x18)
	None GrabHandClosedCursor; // 0x158(0x18)
	None SlashedCircleCursor; // 0x170(0x18)
	None ApplicationScale; // 0x188(0x04)
	None UIScaleRule; // 0x18c(0x01)
	None CustomScalingRuleClass; // 0x190(0x18)
	None UIScaleCurve; // 0x1a8(0x88)
	None bAllowHighDPIInGameMode; // 0x230(0x01)
	None bLoadWidgetsOnDedicatedServer; // 0x231(0x01)
	None CursorClasses; // 0x238(0x10)
	None CustomScalingRuleClassInstance; // 0x248(0x08)
	None CustomScalingRule; // 0x250(0x08)
	None Bounds; // 0x28(0x1c)
	None Intensity; // 0x44(0x04)
	None Texture; // 0x48(0x08)
	None ConstructionOp; // 0x50(0x01)
	None VolumeSizeX; // 0x54(0x04)
	None VolumeSizeY; // 0x58(0x04)
	None VolumeSizeZ; // 0x5c(0x04)
	None SubImagesX; // 0x60(0x04)
	None SubImagesY; // 0x64(0x04)
	None FrameCount; // 0x68(0x04)
	None FramesPerSecond; // 0x6c(0x04)
	None bLoop; // 0x70(0x01)
	None NoiseField; // 0x78(0x08)
	None NoiseScale; // 0x80(0x04)
	None NoiseMax; // 0x84(0x04)
	None VectorField; // 0x430(0x08)
	None Intensity; // 0x438(0x04)
	None Tightness; // 0x43c(0x04)
	None bPreviewVectorField; // 0x440(0x01)
	None SizeX; // 0x48(0x04)
	None SizeY; // 0x4c(0x04)
	None SizeZ; // 0x50(0x04)
	None bAllowCPUAccess; // 0x54(0x01)
	None CPUData; // 0x88(0x10)
	None VectorFieldComponent; // 0x220(0x08)
	None TypeToLayer; // 0xe8(0x10)
	None DefaultSizeInMegabyte; // 0x28(0x04)
	None Pools; // 0x30(0x10)
	None Settings; // 0xb0(0x18)
	None AllowedMipLevelRange; // 0x258(0x08)
	None Component; // 0x220(0x08)
	None Strength; // 0x208(0x04)
	None Speed; // 0x20c(0x04)
	None MinGustAmount; // 0x210(0x04)
	None MaxGustAmount; // 0x214(0x04)
	None Radius; // 0x218(0x04)
	None bPointWind; // 0x21c(0x01)
	None TilesStreaming; // 0x48(0x10)
	None TilesStreamingTimeThreshold; // 0x58(0x08)
	None bLoadAllTilesDuringCinematic; // 0x60(0x01)
	None bRebaseOriginIn3DSpace; // 0x61(0x01)
	None RebaseOriginDistance; // 0x64(0x04)
	None HierarchicalLODSetup; // 0x28(0x10)
	None OverrideBaseMaterial; // 0x38(0x28)
	None UberGraphFrame; // 0x630(0x08)
	None PopulateMaps; // 0x638(0x08)
	None Image_112; // 0x640(0x08)
	None MapScrollBox; // 0x648(0x08)
	None MapSelectionPanel; // 0x650(0x08)
	None WBP_CustomGameConfirmation; // 0x658(0x08)
	None WBP_GameModeInfoPanel; // 0x660(0x08)
	None WBP_Header1; // 0x668(0x08)
	None WBP_NavBar; // 0x670(0x08)
	None CustomQueues; // 0x678(0x10)
	None CurrentTabIndex; // 0x688(0x04)
	None MapButtons; // 0x690(0x10)
	None TabCount; // 0x6a0(0x04)
	None QueueDataFactory; // 0x6a8(0x08)
	None DTCustomQueues; // 0x6b0(0x08)
	None Slot; // 0x28(0x08)
	None bIsEnabledDelegate; // 0x30(0x10)
	None ToolTipText; // 0x40(0x18)
	None ToolTipTextDelegate; // 0x58(0x10)
	None ToolTipWidget; // 0x68(0x08)
	None ToolTipWidgetDelegate; // 0x70(0x10)
	None VisibilityDelegate; // 0x80(0x10)
	None RenderTransform; // 0x90(0x1c)
	None RenderTransformPivot; // 0xac(0x08)
	None bIsVariable; // 0xb4(0x01)
	None bCreatedByConstructionScript; // 0xb4(0x01)
	None bIsEnabled; // 0xb4(0x01)
	None bOverride_Cursor; // 0xb4(0x01)
	None AccessibleWidgetData; // 0xb8(0x08)
	None bIsVolatile; // 0xc0(0x01)
	None bAllowRenderInterpolation; // 0xc0(0x01)
	None bIssueGlobalInvalidateOnVisible; // 0xc0(0x01)
	None DebugWidgetIndex; // 0xc1(0x01)
	None Cursor; // 0xc2(0x01)
	None Clipping; // 0xc3(0x01)
	None Visibility; // 0xc4(0x01)
	None RenderOpacity; // 0xc8(0x04)
	None Navigation; // 0xd0(0x08)
	None FlowDirectionPreference; // 0xd8(0x01)
	None NativeBindings; // 0x100(0x10)
	None Brush; // 0x110(0x88)
	None BrushDelegate; // 0x198(0x10)
	None ColorAndOpacity; // 0x1a8(0x10)
	None ColorAndOpacityDelegate; // 0x1b8(0x10)
	None bFlipForRightToLeftFlowDirection; // 0x1c8(0x01)
	None OnMouseButtonDownEvent; // 0x1cc(0x10)
	None Slots; // 0x110(0x10)
	None ColorAndOpacity; // 0x118(0x10)
	None ColorAndOpacityDelegate; // 0x128(0x10)
	None ForegroundColor; // 0x138(0x28)
	None ForegroundColorDelegate; // 0x160(0x10)
	None Padding; // 0x170(0x10)
	None ActiveSequencePlayers; // 0x180(0x10)
	None StoppedSequencePlayers; // 0x190(0x10)
	None NamedSlotBindings; // 0x1a0(0x10)
	None WidgetTree; // 0x1b0(0x08)
	None Priority; // 0x1b8(0x04)
	None bSupportsKeyboardFocus; // 0x1bc(0x01)
	None bIsFocusable; // 0x1bc(0x01)
	None bStopAction; // 0x1bc(0x01)
	None bHasScriptImplementedTick; // 0x1bc(0x01)
	None bHasScriptImplementedPaint; // 0x1bc(0x01)
	None bCookedWidgetTree; // 0x1bc(0x01)
	None TickFrequency; // 0x1c8(0x01)
	None InputComponent; // 0x1d0(0x08)
	None AnimationCallbacks; // 0x1d8(0x10)
	None Animation; // 0x408(0x08)
	None PadLeft; // 0x128(0x01)
	None PadRight; // 0x129(0x01)
	None PadTop; // 0x12a(0x01)
	None PadBottom; // 0x12b(0x01)
	None Text; // 0x110(0x18)
	None TextDelegate; // 0x128(0x10)
	None WidgetStyle; // 0x138(0x7f0)
	None Style; // 0x928(0x08)
	None HintText; // 0x930(0x18)
	None HintTextDelegate; // 0x948(0x10)
	None Font; // 0x958(0x50)
	None ForegroundColor; // 0x9a8(0x10)
	None BackgroundColor; // 0x9b8(0x10)
	None ReadOnlyForegroundColor; // 0x9c8(0x10)
	None IsReadOnly; // 0x9d8(0x01)
	None IsPassword; // 0x9d9(0x01)
	None MinimumDesiredWidth; // 0x9dc(0x04)
	None Padding; // 0x9e0(0x10)
	None IsCaretMovedWhenGainFocus; // 0x9f0(0x01)
	None SelectAllTextWhenFocused; // 0x9f1(0x01)
	None RevertTextOnEscape; // 0x9f2(0x01)
	None ClearKeyboardFocusOnCommit; // 0x9f3(0x01)
	None SelectAllTextOnCommit; // 0x9f4(0x01)
	None AllowContextMenu; // 0x9f5(0x01)
	None KeyboardType; // 0x9f6(0x01)
	None VirtualKeyboardOptions; // 0x9f7(0x01)
	None VirtualKeyboardTrigger; // 0x9f8(0x01)
	None VirtualKeyboardDismissAction; // 0x9f9(0x01)
	None Justification; // 0x9fa(0x01)
	None ShapedTextOptions; // 0x9fb(0x03)
	None OnTextChanged; // 0xa00(0x10)
	None OnTextCommitted; // 0xa10(0x10)
	None HorizontalAlignment; // 0x128(0x01)
	None VerticalAlignment; // 0x129(0x01)
	None bShowEffectWhenDisabled; // 0x12a(0x01)
	None ContentColorAndOpacity; // 0x12c(0x10)
	None ContentColorAndOpacityDelegate; // 0x13c(0x10)
	None Padding; // 0x14c(0x10)
	None background; // 0x160(0x88)
	None BackgroundDelegate; // 0x1e8(0x10)
	None BrushColor; // 0x1f8(0x10)
	None BrushColorDelegate; // 0x208(0x10)
	None DesiredSizeScale; // 0x218(0x08)
	None bFlipForRightToLeftFlowDirection; // 0x220(0x01)
	None OnMouseButtonDownEvent; // 0x224(0x10)
	None OnMouseButtonUpEvent; // 0x234(0x10)
	None OnMouseMoveEvent; // 0x244(0x10)
	None OnMouseDoubleClickEvent; // 0x254(0x10)
	None WidgetStyle; // 0x128(0x228)
	None WidgetBarStyle; // 0x350(0x4d0)
	None Style; // 0x820(0x08)
	None BarStyle; // 0x828(0x08)
	None Orientation; // 0x830(0x01)
	None ScrollBarVisibility; // 0x831(0x01)
	None ConsumeMouseWheel; // 0x832(0x01)
	None ScrollbarThickness; // 0x834(0x08)
	None ScrollbarPadding; // 0x83c(0x10)
	None AlwaysShowScrollbar; // 0x84c(0x01)
	None AlwaysShowScrollbarTrack; // 0x84d(0x01)
	None AllowOverscroll; // 0x84e(0x01)
	None bAnimateWheelScrolling; // 0x84f(0x01)
	None NavigationDestination; // 0x850(0x01)
	None NavigationScrollPadding; // 0x854(0x04)
	None ScrollWhenFocusChanges; // 0x858(0x01)
	None bAllowRightClickDragScrolling; // 0x859(0x01)
	None WheelScrollMultiplier; // 0x85c(0x04)
	None OnUserScrolled; // 0x860(0x10)
	None ColumnFill; // 0x128(0x10)
	None RowFill; // 0x138(0x10)
	None EntryWidgetClass; // 0x110(0x08)
	None WheelScrollMultiplier; // 0x118(0x04)
	None bEnableScrollAnimation; // 0x11c(0x01)
	None bEnableFixedLineOffset; // 0x11d(0x01)
	None FixedLineScrollOffset; // 0x120(0x04)
	None BP_OnEntryGenerated; // 0x128(0x10)
	None BP_OnEntryReleased; // 0x138(0x10)
	None EntryWidgetPool; // 0x148(0x80)
	None Orientation; // 0x2e0(0x01)
	None SelectionMode; // 0x2e1(0x01)
	None ConsumeMouseWheel; // 0x2e2(0x01)
	None bClearSelectionOnClick; // 0x2e3(0x01)
	None bIsFocusable; // 0x2e4(0x01)
	None EntrySpacing; // 0x2e8(0x04)
	None bReturnFocusToSelection; // 0x2ec(0x01)
	None ListItems; // 0x2f0(0x10)
	None BP_OnEntryInitialized; // 0x310(0x10)
	None BP_OnItemClicked; // 0x320(0x10)
	None BP_OnItemDoubleClicked; // 0x330(0x10)
	None BP_OnItemIsHoveredChanged; // 0x340(0x10)
	None BP_OnItemSelectionChanged; // 0x350(0x10)
	None BP_OnItemScrolledIntoView; // 0x360(0x10)
	None BP_OnListViewScrolled; // 0x370(0x10)
	None BP_OnGetItemChildren; // 0x390(0x10)
	None BP_OnItemExpansionChanged; // 0x3a0(0x10)
	None OnSuccess; // 0x30(0x10)
	None OnFail; // 0x40(0x10)
	None Padding; // 0x128(0x10)
	None HorizontalAlignment; // 0x138(0x01)
	None VerticalAlignment; // 0x139(0x01)
	None bApplyAlphaToBlur; // 0x13a(0x01)
	None BlurStrength; // 0x13c(0x04)
	None bOverrideAutoRadiusCalculation; // 0x140(0x01)
	None BlurRadius; // 0x144(0x04)
	None LowQualityFallbackBrush; // 0x148(0x88)
	None Parent; // 0x28(0x08)
	None Content; // 0x30(0x08)
	None Padding; // 0x38(0x10)
	None HorizontalAlignment; // 0x48(0x01)
	None VerticalAlignment; // 0x49(0x01)
	None SourceObject; // 0x28(0x08)
	None SourcePath; // 0x30(0x28)
	None DestinationProperty; // 0x58(0x08)
	None Padding; // 0x38(0x10)
	None HorizontalAlignment; // 0x48(0x01)
	None VerticalAlignment; // 0x49(0x01)
	None Style; // 0x128(0x08)
	None WidgetStyle; // 0x130(0x278)
	None ColorAndOpacity; // 0x3a8(0x10)
	None BackgroundColor; // 0x3b8(0x10)
	None ClickMethod; // 0x3c8(0x01)
	None TouchMethod; // 0x3c9(0x01)
	None PressMethod; // 0x3ca(0x01)
	None IsFocusable; // 0x3cb(0x01)
	None bAllowTouchFallthrough; // 0x3cc(0x01)
	None OnClicked; // 0x3d0(0x10)
	None OnPressed; // 0x3e0(0x10)
	None OnReleased; // 0x3f0(0x10)
	None OnHovered; // 0x400(0x10)
	None OnUnhovered; // 0x410(0x10)
	None Padding; // 0x38(0x10)
	None HorizontalAlignment; // 0x48(0x01)
	None VerticalAlignment; // 0x49(0x01)
	None LayoutData; // 0x38(0x28)
	None bAutoSize; // 0x60(0x01)
	None ZOrder; // 0x64(0x04)
	None CheckedState; // 0x128(0x01)
	None CheckedStateDelegate; // 0x12c(0x10)
	None WidgetStyle; // 0x140(0x580)
	None Style; // 0x6c0(0x08)
	None UncheckedImage; // 0x6c8(0x08)
	None UncheckedHoveredImage; // 0x6d0(0x08)
	None UncheckedPressedImage; // 0x6d8(0x08)
	None CheckedImage; // 0x6e0(0x08)
	None CheckedHoveredImage; // 0x6e8(0x08)
	None CheckedPressedImage; // 0x6f0(0x08)
	None UndeterminedImage; // 0x6f8(0x08)
	None UndeterminedHoveredImage; // 0x700(0x08)
	None UndeterminedPressedImage; // 0x708(0x08)
	None HorizontalAlignment; // 0x710(0x01)
	None Padding; // 0x714(0x10)
	None BorderBackgroundColor; // 0x728(0x28)
	None IsFocusable; // 0x750(0x01)
	None OnCheckStateChanged; // 0x758(0x10)
	None NumberOfPieces; // 0x110(0x04)
	None Period; // 0x114(0x04)
	None Radius; // 0x118(0x04)
	None PieceImage; // 0x120(0x08)
	None Image; // 0x128(0x88)
	None bEnableRadius; // 0x1b0(0x01)
	None Items; // 0x110(0x10)
	None OnGenerateWidgetEvent; // 0x120(0x10)
	None bIsFocusable; // 0x130(0x01)
	None DefaultOptions; // 0x110(0x10)
	None SelectedOption; // 0x120(0x10)
	None WidgetStyle; // 0x130(0x3f0)
	None ItemStyle; // 0x520(0x7c8)
	None ContentPadding; // 0xce8(0x10)
	None MaxListHeight; // 0xcf8(0x04)
	None HasDownArrow; // 0xcfc(0x01)
	None EnableGamepadNavigationMode; // 0xcfd(0x01)
	None Font; // 0xd00(0x50)
	None ForegroundColor; // 0xd50(0x28)
	None bIsFocusable; // 0xd78(0x01)
	None OnGenerateWidgetEvent; // 0xd7c(0x10)
	None OnSelectionChanged; // 0xd90(0x10)
	None OnOpening; // 0xda0(0x10)
	None OnClosing; // 0xdb0(0x10)
	None Tag; // 0x28(0x10)
	None Payload; // 0x38(0x08)
	None DefaultDragVisual; // 0x40(0x08)
	None Pivot; // 0x48(0x01)
	None Offset; // 0x4c(0x08)
	None OnDrop; // 0x58(0x10)
	None OnDragCancelled; // 0x68(0x10)
	None OnDragged; // 0x78(0x10)
	None EntryBoxType; // 0x110(0x01)
	None EntrySpacing; // 0x114(0x08)
	None SpacingPattern; // 0x120(0x10)
	None EntrySizeRule; // 0x130(0x08)
	None EntryHorizontalAlignment; // 0x138(0x01)
	None EntryVerticalAlignment; // 0x139(0x01)
	None MaxElementSize; // 0x13c(0x04)
	None EntryWidgetPool; // 0x150(0x80)
	None EntryWidgetClass; // 0x1d0(0x08)
	None Text; // 0x110(0x18)
	None TextDelegate; // 0x128(0x10)
	None HintText; // 0x138(0x18)
	None HintTextDelegate; // 0x150(0x10)
	None WidgetStyle; // 0x160(0x218)
	None Style; // 0x378(0x08)
	None BackgroundImageSelected; // 0x380(0x08)
	None BackgroundImageComposing; // 0x388(0x08)
	None CaretImage; // 0x390(0x08)
	None Font; // 0x398(0x50)
	None ColorAndOpacity; // 0x3e8(0x28)
	None IsReadOnly; // 0x410(0x01)
	None IsPassword; // 0x411(0x01)
	None MinimumDesiredWidth; // 0x414(0x04)
	None IsCaretMovedWhenGainFocus; // 0x418(0x01)
	None SelectAllTextWhenFocused; // 0x419(0x01)
	None RevertTextOnEscape; // 0x41a(0x01)
	None ClearKeyboardFocusOnCommit; // 0x41b(0x01)
	None SelectAllTextOnCommit; // 0x41c(0x01)
	None AllowContextMenu; // 0x41d(0x01)
	None KeyboardType; // 0x41e(0x01)
	None VirtualKeyboardOptions; // 0x41f(0x01)
	None VirtualKeyboardTrigger; // 0x420(0x01)
	None VirtualKeyboardDismissAction; // 0x421(0x01)
	None Justification; // 0x422(0x01)
	None ShapedTextOptions; // 0x423(0x03)
	None OnTextChanged; // 0x428(0x10)
	None OnTextCommitted; // 0x438(0x10)
	None Style; // 0x118(0x120)
	None BorderBrush; // 0x238(0x88)
	None BorderColor; // 0x2c0(0x28)
	None bIsExpanded; // 0x2e8(0x01)
	None MaxHeight; // 0x2ec(0x04)
	None HeaderPadding; // 0x2f0(0x10)
	None AreaPadding; // 0x300(0x10)
	None OnExpansionChanged; // 0x310(0x10)
	None HeaderContent; // 0x320(0x08)
	None BodyContent; // 0x328(0x08)
	None Padding; // 0x38(0x10)
	None HorizontalAlignment; // 0x48(0x01)
	None VerticalAlignment; // 0x49(0x01)
	None Row; // 0x4c(0x04)
	None RowSpan; // 0x50(0x04)
	None column; // 0x54(0x04)
	None ColumnSpan; // 0x58(0x04)
	None Layer; // 0x5c(0x04)
	None Nudge; // 0x60(0x08)
	None Padding; // 0x40(0x10)
	None Size; // 0x50(0x08)
	None HorizontalAlignment; // 0x58(0x01)
	None VerticalAlignment; // 0x59(0x01)
	None WidgetStyle; // 0x110(0x278)
	None TextStyle; // 0x388(0x268)
	None SelectedKey; // 0x5f0(0x20)
	None Font; // 0x610(0x50)
	None Margin; // 0x660(0x10)
	None ColorAndOpacity; // 0x670(0x10)
	None KeySelectionText; // 0x680(0x18)
	None NoKeySpecifiedText; // 0x698(0x18)
	None bAllowModifierKeys; // 0x6b0(0x01)
	None bAllowGamepadKeys; // 0x6b1(0x01)
	None EscapeKeys; // 0x6b8(0x10)
	None OnKeySelected; // 0x6c8(0x10)
	None OnIsSelectingKeyChanged; // 0x6d8(0x10)
	None bCanCache; // 0x128(0x01)
	None CacheRelativeTransforms; // 0x129(0x01)
	None MenuClass; // 0x128(0x08)
	None OnGetMenuContentEvent; // 0x130(0x10)
	None Placement; // 0x140(0x01)
	None bFitInWindow; // 0x141(0x01)
	None ShouldDeferPaintingAfterWindowContent; // 0x142(0x01)
	None UseApplicationMenuStack; // 0x143(0x01)
	None OnMenuOpenChanged; // 0x148(0x10)
	None TransformMask; // 0xe0(0x04)
	None Translation; // 0xe8(0x140)
	None Rotation; // 0x228(0xa0)
	None Scale; // 0x2c8(0x140)
	None Shear; // 0x408(0x140)
	None TopCurve; // 0xe0(0xa0)
	None LeftCurve; // 0x180(0xa0)
	None RightCurve; // 0x220(0xa0)
	None BottomCurve; // 0x2c0(0xa0)
	None BrushPropertyNamePath; // 0x68(0x10)
	None TrackName; // 0x78(0x08)
	None ShapedTextOptions; // 0x110(0x03)
	None Justification; // 0x113(0x01)
	None WrappingPolicy; // 0x114(0x01)
	None AutoWrapText; // 0x115(0x01)
	None WrapTextAt; // 0x118(0x04)
	None Margin; // 0x11c(0x10)
	None LineHeightPercentage; // 0x12c(0x04)
	None Text; // 0x130(0x18)
	None HintText; // 0x148(0x18)
	None HintTextDelegate; // 0x160(0x10)
	None WidgetStyle; // 0x170(0x268)
	None bIsReadOnly; // 0x3d8(0x01)
	None Font; // 0x3e0(0x50)
	None SelectAllTextWhenFocused; // 0x430(0x01)
	None ClearTextSelectionOnFocusLoss; // 0x431(0x01)
	None RevertTextOnEscape; // 0x432(0x01)
	None ClearKeyboardFocusOnCommit; // 0x433(0x01)
	None AllowContextMenu; // 0x434(0x01)
	None VirtualKeyboardOptions; // 0x435(0x01)
	None VirtualKeyboardDismissAction; // 0x436(0x01)
	None OnTextChanged; // 0x438(0x10)
	None OnTextCommitted; // 0x448(0x10)
	None Text; // 0x130(0x18)
	None HintText; // 0x148(0x18)
	None HintTextDelegate; // 0x160(0x10)
	None WidgetStyle; // 0x170(0x7f0)
	None TextStyle; // 0x960(0x268)
	None bIsReadOnly; // 0xbc8(0x01)
	None AllowContextMenu; // 0xbc9(0x01)
	None VirtualKeyboardOptions; // 0xbca(0x01)
	None VirtualKeyboardDismissAction; // 0xbcb(0x01)
	None Style; // 0xbd0(0x08)
	None Font; // 0xbd8(0x50)
	None ForegroundColor; // 0xc28(0x10)
	None BackgroundColor; // 0xc38(0x10)
	None ReadOnlyForegroundColor; // 0xc48(0x10)
	None OnTextChanged; // 0xc58(0x10)
	None OnTextCommitted; // 0xc68(0x10)
	None Padding; // 0x40(0x10)
	None HorizontalAlignment; // 0x50(0x01)
	None VerticalAlignment; // 0x51(0x01)
	None WidgetStyle; // 0x110(0x1a0)
	None Style; // 0x2b0(0x08)
	None BackgroundImage; // 0x2b8(0x08)
	None FillImage; // 0x2c0(0x08)
	None MarqueeImage; // 0x2c8(0x08)
	None Percent; // 0x2d0(0x04)
	None BarFillType; // 0x2d4(0x01)
	None bIsMarquee; // 0x2d5(0x01)
	None BorderPadding; // 0x2d8(0x08)
	None PercentDelegate; // 0x2e0(0x10)
	None FillColorAndOpacity; // 0x2f0(0x10)
	None FillColorAndOpacityDelegate; // 0x300(0x10)
	None RenderOnInvalidation; // 0x128(0x01)
	None RenderOnPhase; // 0x129(0x01)
	None Phase; // 0x12c(0x04)
	None PhaseCount; // 0x130(0x04)
	None bEnableRetainedRendering; // 0x134(0x01)
	None EffectMaterial; // 0x138(0x08)
	None TextureParameter; // 0x140(0x08)
	None Text; // 0x130(0x18)
	None TextStyleSet; // 0x148(0x08)
	None DecoratorClasses; // 0x150(0x10)
	None bOverrideDefaultStyle; // 0x160(0x01)
	None DefaultTextStyleOverride; // 0x168(0x268)
	None MinDesiredWidth; // 0x3d0(0x04)
	None InstanceDecorators; // 0x640(0x10)
	None ImageSet; // 0x28(0x08)
	None bIsTitleSafe; // 0x38(0x01)
	None SafeAreaScale; // 0x3c(0x10)
	None HAlign; // 0x4c(0x01)
	None VAlign; // 0x4d(0x01)
	None Padding; // 0x50(0x10)
	None Stretch; // 0x128(0x01)
	None StretchDirection; // 0x129(0x01)
	None UserSpecifiedScale; // 0x12c(0x04)
	None IgnoreInheritedScale; // 0x130(0x01)
	None Padding; // 0x38(0x10)
	None HorizontalAlignment; // 0x48(0x01)
	None VerticalAlignment; // 0x49(0x01)
	None WidgetStyle; // 0x110(0x4d0)
	None Style; // 0x5e0(0x08)
	None bAlwaysShowScrollbar; // 0x5e8(0x01)
	None bAlwaysShowScrollbarTrack; // 0x5e9(0x01)
	None Orientation; // 0x5ea(0x01)
	None Thickness; // 0x5ec(0x08)
	None Padding; // 0x5f4(0x10)
	None Padding; // 0x38(0x10)
	None HorizontalAlignment; // 0x48(0x01)
	None VerticalAlignment; // 0x49(0x01)
	None WidthOverride; // 0x138(0x04)
	None HeightOverride; // 0x13c(0x04)
	None MinDesiredWidth; // 0x140(0x04)
	None MinDesiredHeight; // 0x144(0x04)
	None MaxDesiredWidth; // 0x148(0x04)
	None MaxDesiredHeight; // 0x14c(0x04)
	None MinAspectRatio; // 0x150(0x04)
	None MaxAspectRatio; // 0x154(0x04)
	None bOverride_WidthOverride; // 0x158(0x01)
	None bOverride_HeightOverride; // 0x158(0x01)
	None bOverride_MinDesiredWidth; // 0x158(0x01)
	None bOverride_MinDesiredHeight; // 0x158(0x01)
	None bOverride_MaxDesiredWidth; // 0x158(0x01)
	None bOverride_MaxDesiredHeight; // 0x158(0x01)
	None bOverride_MinAspectRatio; // 0x158(0x01)
	None bOverride_MaxAspectRatio; // 0x158(0x01)
	None Padding; // 0x38(0x10)
	None HorizontalAlignment; // 0x58(0x01)
	None VerticalAlignment; // 0x59(0x01)
	None VertexData; // 0x28(0x10)
	None IndexData; // 0x38(0x10)
	None Material; // 0x48(0x08)
	None ExtentMin; // 0x50(0x08)
	None ExtentMax; // 0x58(0x08)
	None bCanChildrenBeAccessible; // 0x28(0x01)
	None AccessibleBehavior; // 0x29(0x01)
	None AccessibleSummaryBehavior; // 0x2a(0x01)
	None AccessibleText; // 0x30(0x18)
	None AccessibleTextDelegate; // 0x48(0x10)
	None AccessibleSummaryText; // 0x58(0x18)
	None AccessibleSummaryTextDelegate; // 0x70(0x10)
	None Value; // 0x110(0x04)
	None ValueDelegate; // 0x114(0x10)
	None MinValue; // 0x124(0x04)
	None MaxValue; // 0x128(0x04)
	None WidgetStyle; // 0x130(0x340)
	None Orientation; // 0x470(0x01)
	None SliderBarColor; // 0x474(0x10)
	None SliderHandleColor; // 0x484(0x10)
	None IndentHandle; // 0x494(0x01)
	None Locked; // 0x495(0x01)
	None MouseUsesStep; // 0x496(0x01)
	None RequiresControllerLock; // 0x497(0x01)
	None StepSize; // 0x498(0x04)
	None IsFocusable; // 0x49c(0x01)
	None OnMouseCaptureBegin; // 0x4a0(0x10)
	None OnMouseCaptureEnd; // 0x4b0(0x10)
	None OnControllerCaptureBegin; // 0x4c0(0x10)
	None OnControllerCaptureEnd; // 0x4d0(0x10)
	None OnValueChanged; // 0x4e0(0x10)
	None Size; // 0x110(0x08)
	None Value; // 0x110(0x04)
	None ValueDelegate; // 0x114(0x10)
	None WidgetStyle; // 0x128(0x2e8)
	None Style; // 0x410(0x08)
	None MinFractionalDigits; // 0x418(0x04)
	None MaxFractionalDigits; // 0x41c(0x04)
	None bAlwaysUsesDeltaSnap; // 0x420(0x01)
	None Delta; // 0x424(0x04)
	None SliderExponent; // 0x428(0x04)
	None Font; // 0x430(0x50)
	None Justification; // 0x480(0x01)
	None MinDesiredWidth; // 0x484(0x04)
	None ClearKeyboardFocusOnCommit; // 0x488(0x01)
	None SelectAllTextOnCommit; // 0x489(0x01)
	None ForegroundColor; // 0x490(0x28)
	None OnValueChanged; // 0x4b8(0x10)
	None OnValueCommitted; // 0x4c8(0x10)
	None OnBeginSliderMovement; // 0x4d8(0x10)
	None OnEndSliderMovement; // 0x4e8(0x10)
	None bOverride_MinValue; // 0x4f8(0x01)
	None bOverride_MaxValue; // 0x4f8(0x01)
	None bOverride_MinSliderValue; // 0x4f8(0x01)
	None bOverride_MaxSliderValue; // 0x4f8(0x01)
	None MinValue; // 0x4fc(0x04)
	None MaxValue; // 0x500(0x04)
	None MinSliderValue; // 0x504(0x04)
	None MaxSliderValue; // 0x508(0x04)
	None Text; // 0x130(0x18)
	None TextDelegate; // 0x148(0x10)
	None ColorAndOpacity; // 0x158(0x28)
	None ColorAndOpacityDelegate; // 0x180(0x10)
	None Font; // 0x190(0x50)
	None StrikeBrush; // 0x1e0(0x88)
	None ShadowOffset; // 0x268(0x08)
	None ShadowColorAndOpacity; // 0x270(0x10)
	None ShadowColorAndOpacityDelegate; // 0x280(0x10)
	None MinDesiredWidth; // 0x290(0x04)
	None bWrapWithInvalidationPanel; // 0x294(0x01)
	None bAutoWrapText; // 0x295(0x01)
	None bSimpleTextMode; // 0x296(0x01)
	None NumberOfPieces; // 0x110(0x04)
	None bAnimateHorizontally; // 0x114(0x01)
	None bAnimateVertically; // 0x115(0x01)
	None bAnimateOpacity; // 0x116(0x01)
	None PieceImage; // 0x118(0x08)
	None Image; // 0x120(0x88)
	None EntryHeight; // 0x380(0x04)
	None EntryWidth; // 0x384(0x04)
	None TileAlignment; // 0x388(0x01)
	None bWrapHorizontalNavigation; // 0x389(0x01)
	None SlotPadding; // 0x128(0x10)
	None MinDesiredSlotWidth; // 0x138(0x04)
	None MinDesiredSlotHeight; // 0x13c(0x04)
	None HorizontalAlignment; // 0x38(0x01)
	None VerticalAlignment; // 0x39(0x01)
	None Row; // 0x3c(0x04)
	None column; // 0x40(0x04)
	None Size; // 0x38(0x08)
	None Padding; // 0x40(0x10)
	None HorizontalAlignment; // 0x58(0x01)
	None VerticalAlignment; // 0x59(0x01)
	None BackgroundColor; // 0x128(0x10)
	None MovieScene; // 0x348(0x08)
	None AnimationBindings; // 0x350(0x10)
	None bLegacyFinishOnStop; // 0x360(0x01)
	None DisplayLabel; // 0x368(0x10)
	None WidgetAnimationDelegateBindings; // 0x28(0x10)
	None Finished; // 0x28(0x10)
	None WidgetTree; // 0x328(0x08)
	None bAllowTemplate; // 0x330(0x01)
	None bAllowDynamicCreation; // 0x330(0x01)
	None bValidTemplate; // 0x330(0x01)
	None bTemplateInitialized; // 0x330(0x01)
	None bCookedTemplate; // 0x330(0x01)
	None bClassRequiresNativeTick; // 0x330(0x01)
	None Bindings; // 0x338(0x10)
	None Animations; // 0x348(0x10)
	None NamedSlots; // 0x358(0x10)
	None TemplateAsset; // 0x368(0x28)
	None Template; // 0x390(0x08)
	None bUseWidgetPool; // 0x458(0x01)
	None bPrimePoolOnFirstUse; // 0x459(0x01)
	None MaxPoolSize; // 0x45c(0x04)
	None Space; // 0x460(0x01)
	None TimingPolicy; // 0x461(0x01)
	None WidgetClass; // 0x468(0x08)
	None DrawSize; // 0x470(0x08)
	None bManuallyRedraw; // 0x478(0x01)
	None bRedrawRequested; // 0x479(0x01)
	None RedrawTime; // 0x47c(0x04)
	None CurrentDrawSize; // 0x488(0x08)
	None bDrawAtDesiredSize; // 0x490(0x01)
	None Pivot; // 0x494(0x08)
	None bReceiveHardwareInput; // 0x49c(0x01)
	None bWindowFocusable; // 0x49d(0x01)
	None WindowVisibility; // 0x49e(0x01)
	None bApplyGammaCorrection; // 0x49f(0x01)
	None bApplyColorDeficiencyCorrection; // 0x4a0(0x01)
	None OwnerPlayer; // 0x4a8(0x08)
	None BackgroundColor; // 0x4b0(0x10)
	None TintColorAndOpacity; // 0x4c0(0x10)
	None OpacityFromTexture; // 0x4d0(0x04)
	None BlendMode; // 0x4d4(0x01)
	None bIsTwoSided; // 0x4d5(0x01)
	None TickWhenOffscreen; // 0x4d6(0x01)
	None Widget; // 0x4d8(0x08)
	None BodySetup; // 0x500(0x08)
	None TranslucentMaterial; // 0x508(0x08)
	None TranslucentMaterial_OneSided; // 0x510(0x08)
	None OpaqueMaterial; // 0x518(0x08)
	None OpaqueMaterial_OneSided; // 0x520(0x08)
	None MaskedMaterial; // 0x528(0x08)
	None MaskedMaterial_OneSided; // 0x530(0x08)
	None RenderTarget; // 0x538(0x08)
	None MaterialInstance; // 0x540(0x08)
	None bAddedToScreen; // 0x548(0x01)
	None bEditTimeUsable; // 0x549(0x01)
	None SharedLayerName; // 0x54c(0x08)
	None LayerZOrder; // 0x554(0x04)
	None GeometryMode; // 0x558(0x01)
	None CylinderArcAngle; // 0x55c(0x04)
	None OnHoveredWidgetChanged; // 0x208(0x10)
	None VirtualUserIndex; // 0x228(0x04)
	None PointerIndex; // 0x22c(0x04)
	None TraceChannel; // 0x230(0x01)
	None InteractionDistance; // 0x234(0x04)
	None InteractionSource; // 0x238(0x01)
	None bEnableHitTesting; // 0x239(0x01)
	None bShowDebug; // 0x23a(0x01)
	None DebugColor; // 0x23c(0x10)
	None CustomHitResult; // 0x2c8(0x88)
	None LocalHitLocation; // 0x350(0x08)
	None LastLocalHitLocation; // 0x358(0x08)
	None HoveredWidgetComponent; // 0x360(0x08)
	None LastHitResult; // 0x368(0x88)
	None bIsHoveredWidgetInteractable; // 0x3f0(0x01)
	None bIsHoveredWidgetFocusable; // 0x3f1(0x01)
	None bIsHoveredWidgetHitTestVisible; // 0x3f2(0x01)
	None Up; // 0x28(0x24)
	None Down; // 0x4c(0x24)
	None Left; // 0x70(0x24)
	None Right; // 0x94(0x24)
	None Next; // 0xb8(0x24)
	None Previous; // 0xdc(0x24)
	None ActiveWidgetIndex; // 0x128(0x04)
	None Padding; // 0x40(0x10)
	None HorizontalAlignment; // 0x50(0x01)
	None VerticalAlignment; // 0x51(0x01)
	None RootWidget; // 0x28(0x08)
	None bWindowButtonsEnabled; // 0x128(0x01)
	None bDoubleClickTogglesFullscreen; // 0x129(0x01)
	None Padding; // 0x38(0x10)
	None HorizontalAlignment; // 0x48(0x01)
	None VerticalAlignment; // 0x49(0x01)
	None InnerSlotPadding; // 0x128(0x08)
	None WrapWidth; // 0x130(0x04)
	None bExplicitWrapWidth; // 0x134(0x01)
	None Padding; // 0x38(0x10)
	None bFillEmptySpace; // 0x48(0x01)
	None FillSpanWhenLessThan; // 0x4c(0x04)
	None HorizontalAlignment; // 0x50(0x01)
	None VerticalAlignment; // 0x51(0x01)
	None UberGraphFrame; // 0x560(0x08)
	None BattlepassGradientPulse; // 0x568(0x08)
	None Unhover; // 0x570(0x08)
	None Selected; // 0x578(0x08)
	None Hovered; // 0x580(0x08)
	None BackFill; // 0x588(0x08)
	None BackFill_Free; // 0x590(0x08)
	None BackFill_Premium; // 0x598(0x08)
	None BottomEdge; // 0x5a0(0x08)
	None BottomEdge_Free; // 0x5a8(0x08)
	None BottomEdge_Premium; // 0x5b0(0x08)
	None Container; // 0x5b8(0x08)
	None LockIcon; // 0x5c0(0x08)
	None LockIcon_2; // 0x5c8(0x08)
	None LockIcon_3; // 0x5d0(0x08)
	None SelectedGradient; // 0x5d8(0x08)
	None SelectedGradient_Free; // 0x5e0(0x08)
	None SelectedGradient_Premium; // 0x5e8(0x08)
	None TabButton; // 0x5f0(0x08)
	None TabColorSwitcher; // 0x5f8(0x08)
	None text_TabFree; // 0x600(0x08)
	None text_TabPremium; // 0x608(0x08)
	None text_TabStandard; // 0x610(0x08)
	None CalloutClass; // 0x618(0x28)
	None CalloutWidget; // 0x640(0x08)
	None CalloutWidget_HorizontalAlignment; // 0x648(0x01)
	None CalloutWidget_VerticalAlignment; // 0x649(0x01)
	None CalloutWidget_Padding; // 0x64c(0x10)
	None HoverSubscreenNavTabSFX; // 0x660(0x08)
	None ClickSubscreenNavTabSFX; // 0x668(0x08)
	None UsesBattlePassColoring; // 0x670(0x01)
	None NamedInterfaces; // 0x28(0x10)
	None NamedInterfaceDefs; // 0x38(0x10)
	None OnAcquisitionSuccess; // 0x28(0x10)
	None OnAcquisitionFailed; // 0x38(0x10)
	None StoreItemHelper; // 0x48(0x08)
	None WaitingWidget; // 0x218(0x08)
	None OnAsyncImageLoadStarted; // 0x220(0x10)
	None OnAsyncImageLoadComplete; // 0x230(0x10)
	None OnAsyncImageLoadCanceled; // 0x240(0x10)
	None OnAsyncImageBrushChanged; // 0x250(0x10)
	None MyHud; // 0x28(0x08)
	None OnChatMessageReceived; // 0x38(0x10)
	None OnChatMessageRead; // 0x48(0x10)
	None OnChatChannelJoined; // 0x58(0x10)
	None OnChatChannelLeft; // 0x68(0x10)
	None ChatMessageIds; // 0x78(0x10)
	None PendingChatMessageIds; // 0x88(0x10)
	None ChatMessagesById; // 0x98(0x50)
	None LastCreatedMessageId; // 0xe8(0x04)
	None m_FilteredPlayerIds; // 0xf0(0x10)
	None ChatCommands; // 0x100(0x10)
	None OnCollectionAvatarsUpdated; // 0x38(0x10)
	None OnCollectionAvatarAcquisition; // 0x48(0x10)
	None CollectionAvatars; // 0x58(0x10)
	None OnGamepadHovered; // 0x238(0x10)
	None OnMouseEntered; // 0x248(0x10)
	None OnNavigateBack; // 0x258(0x10)
	None OnTextureLoadComplete; // 0x268(0x10)
	None OnNavigateUpFailed; // 0x278(0x10)
	None OnNavigateDownFailed; // 0x288(0x10)
	None OnNavigateLeftFailed; // 0x298(0x10)
	None OnNavigateRightFailed; // 0x2a8(0x10)
	None OnFocusGroupNavigateUpFailed; // 0x2b8(0x10)
	None OnFocusGroupNavigateDownFailed; // 0x2c8(0x10)
	None OnFocusGroupNavigateLeftFailed; // 0x2d8(0x10)
	None OnFocusGroupNavigateRightFailed; // 0x2e8(0x10)
	None OnHideSequenceFinished; // 0x2f8(0x10)
	None OnShowSequenceFinished; // 0x308(0x10)
	None MyHud; // 0x318(0x08)
	None MyRouteName; // 0x320(0x08)
	None CloseOnLogout; // 0x328(0x01)
	None IsComponent; // 0x329(0x01)
	None StartsHidden; // 0x32a(0x01)
	None UsesBlocker; // 0x32b(0x01)
	None BlockerClickToClose; // 0x32c(0x01)
	None EnableGameStateSetNotify; // 0x32d(0x01)
	None LoadedTexture; // 0x330(0x28)
	None MobileLayoutSequencePlayer; // 0x4a8(0x08)
	None MobileLayoutAnim; // 0x4b0(0x08)
	None bMobileLayoutActive; // 0x4b8(0x01)
	None PromptWidgetClass; // 0x4c0(0x08)
	None LeftPromptMargin; // 0x4c8(0x10)
	None CenterPromptMargin; // 0x4d8(0x10)
	None RightPromptMargin; // 0x4e8(0x10)
	None LeftContainer; // 0x4f8(0x08)
	None CenterContainer; // 0x500(0x08)
	None RightContainer; // 0x508(0x08)
	None PromptPool; // 0x510(0x10)
	None ContextActionData; // 0x4c0(0x08)
	None IsPoolable; // 0x4c8(0x01)
	None OnFriendDataUpdated; // 0x38(0x10)
	None OnFriendAddSuccess; // 0x48(0x10)
	None OnFriendAddError; // 0x58(0x10)
	None FriendInviteReceived; // 0x68(0x10)
	None OnFriendAdded; // 0x78(0x10)
	None OnFriendRejected; // 0x88(0x10)
	None OnlineFriends; // 0x98(0x04)
	None TotalFriends; // 0x9c(0x04)
	None CachedFriends; // 0xa0(0x10)
	None CachedPendingFriends; // 0xb0(0x10)
	None CachedFriendRequests; // 0xc0(0x10)
	None FriendsListUpdatePollInterval; // 0x100(0x04)
	None FriendsListUpdatePollingTimerHandle; // 0x108(0x08)
	None IsFriendsListUpdatePollingEnabled; // 0x110(0x01)
	None OnInputStateChanged; // 0x310(0x10)
	None PlayerDataUpdated; // 0x320(0x50)
	None InputManager; // 0x370(0x08)
	None ViewManager; // 0x378(0x08)
	None InputManagerClass; // 0x380(0x08)
	None SoundTheme; // 0x388(0x08)
	None RowName; // 0x30(0x08)
	None FormatAdditive; // 0x38(0x18)
	None RowData; // 0x50(0x50)
	None OnContextAction; // 0xa0(0x10)
	None OnCycleAction; // 0xb0(0x10)
	None OnHoldActionUpdate; // 0xc0(0x10)
	None OnHoldReleaseAction; // 0xd0(0x10)
	None InputFocusData; // 0x28(0x50)
	None InputComponent; // 0xa0(0x08)
	None GlobalRouteName; // 0xe4(0x08)
	None ContextActionInputComponent; // 0xf0(0x08)
	None ContextActionDataTableClassName; // 0xf8(0x18)
	None ContextActionDT; // 0x110(0x08)
	None RouteContextInfoMap; // 0x118(0x50)
	None ActiveRoute; // 0x168(0x08)
	None OverrideRouteStack; // 0x170(0x10)
	None OnRenamed; // 0x28(0x10)
	None OnNumberChanged; // 0x38(0x10)
	None OnTypeChanged; // 0x48(0x10)
	None OnServerUpdate; // 0x58(0x10)
	None OnLocalUpdate; // 0x68(0x10)
	None OnLoadoutsInitialized; // 0x30(0x10)
	None OnLoadoutsUpdatedFromServer; // 0x40(0x10)
	None OnLoadoutFactoryReadyNoLoadouts; // 0x50(0x10)
	None OnLoadoutChanged; // 0x60(0x10)
	None OnLoadoutAdded; // 0x70(0x10)
	None OnLoadoutDeleted; // 0x80(0x10)
	None Loadouts; // 0x98(0x10)
	None OnLoginUserChanged; // 0x38(0x10)
	None OnLoginStateChanged; // 0x48(0x10)
	None OnLoginError; // 0x58(0x10)
	None OnControllerDisconnected; // 0x70(0x10)
	None bAllowLoginDuringPartialInstall; // 0x80(0x01)
	None ErrorMsgsDT; // 0x88(0x08)
	None bAttemptedDeferredInviteAutoLogin; // 0x90(0x01)
	None OnLoginWaitQueueMessage; // 0x108(0x10)
	None OnPartyDataUpdated; // 0x38(0x10)
	None OnPartyLocalPlayerLeft; // 0x48(0x10)
	None OnPartyLocalPlayerPromoted; // 0x58(0x10)
	None OnPartyMemberPromoted; // 0x68(0x10)
	None OnPartyMemberDataUpdated; // 0x78(0x10)
	None OnPendingPartyMemberDataAdded; // 0x88(0x10)
	None OnPendingPartyMemberAccepted; // 0x98(0x10)
	None OnPartyMemberRemoved; // 0xa8(0x10)
	None OnPartyMemberLeft; // 0xb8(0x10)
	None OnPartyDisbanded; // 0xc8(0x10)
	None OnPartyInvitationError; // 0xd8(0x10)
	None OnPartyInvitationSent; // 0xe8(0x10)
	None OnPartyInvitationReceived; // 0xf8(0x10)
	None OnPartyMessageReceived; // 0x108(0x10)
	None OnPartyInvitationAccepted; // 0x118(0x10)
	None OnPartyInvitationRejected; // 0x128(0x10)
	None OnPartyInvitationExpired; // 0x138(0x10)
	None OnPartyInfoUpdated; // 0x148(0x10)
	None PartyMembers; // 0x158(0x10)
	None PartyInviter; // 0x168(0x08)
	None LastInviteSentErrorMessage; // 0x170(0x10)
	None OnPlayerDataChanged; // 0x38(0x10)
	None OnPlayerRankChanged; // 0x48(0x10)
	None OnCrossplayChanged; // 0x58(0x10)
	None PlayerId; // 0x68(0x08)
	None PlayerName; // 0x70(0x10)
	None Level; // 0x80(0x04)
	None AvatarId; // 0x84(0x04)
	None LastMMR; // 0x88(0x04)
	None CurrentMMR; // 0x8c(0x04)
	None BestMMR; // 0x90(0x04)
	None CurrentWinRank; // 0x94(0x04)
	None PreviousWinRank; // 0x98(0x04)
	None CurrentWinPeak; // 0x9c(0x04)
	None PreviousWinPeak; // 0xa0(0x04)
	None CurrentWinStreak; // 0xa4(0x04)
	None PreviousWinStreak; // 0xa8(0x04)
	None OnFilteredNameSetDel; // 0x28(0x10)
	None OnSearchByNameResultsUpdated; // 0x38(0x10)
	None CachedSearchByNameResults; // 0x48(0x10)
	None PopupQueue; // 0x4d0(0x10)
	None m_nPopupId; // 0x4e0(0x04)
	None CommittedText; // 0x5c8(0x18)
	None OnQueueJoined; // 0x38(0x10)
	None OnQueueLeft; // 0x48(0x10)
	None OnQueueStatusChange; // 0x58(0x10)
	None OnQueueDataUpdated; // 0x68(0x10)
	None OnMatchStatusUpdatedError; // 0x78(0x10)
	None OnCustomMatchJoined; // 0x88(0x10)
	None OnCustomQueueMemberAdded; // 0x98(0x10)
	None OnCustomQueueMemberRemoved; // 0xa8(0x10)
	None OnCustomQueueMemberUpdated; // 0xb8(0x10)
	None OnCustomQueueChanged; // 0xc8(0x10)
	None OnCustomInviteErrorRecieved; // 0xd8(0x10)
	None PendingCustomMatchMapId; // 0xe8(0x04)
	None ActivityQueuePairs; // 0xf0(0x10)
	None ActivityToJoin; // 0x100(0x10)
	None bActivityToJoinIsMultiplayer; // 0x110(0x01)
	None QueueIds; // 0x118(0x10)
	None QueueUpdatePollInterval; // 0x188(0x04)
	None QueueUpdateTimerHandle; // 0x190(0x08)
	None CustomMatchMembers; // 0x198(0x10)
	None CustomMatchSpectateTeamId; // 0x218(0x04)
	None RepeatMapGameIds; // 0x220(0x10)
	None RepeatMapOdds; // 0x230(0x04)
	None bBorderLeft; // 0x140(0x01)
	None bBorderRight; // 0x141(0x01)
	None bBorderTop; // 0x142(0x01)
	None bBorderBottom; // 0x143(0x01)
	None bForceDrawBorders; // 0x144(0x01)
	None OnPopulateUserSettings; // 0x38(0x10)
	None OnPopulateUserBindings; // 0x48(0x10)
	None OnPopulateUserGPBindings; // 0x58(0x10)
	None OnPostLogin; // 0x68(0x10)
	None OnPostLogoff; // 0x78(0x10)
	None OnSettingValueChanged; // 0x88(0x10)
	None LootTableItemId; // 0x28(0x04)
	None VendorId; // 0x2c(0x04)
	None PriceInUI; // 0x30(0x04)
	None CurrencyType; // 0x38(0x08)
	None Quantity; // 0x40(0x04)
	None LocationId; // 0x44(0x04)
	None ExternalTransactionId; // 0x48(0x10)
	None CouponId; // 0x58(0x04)
	None GiftPlayerId; // 0x5c(0x04)
	None GiftMsgIndex; // 0x60(0x04)
	None AnonymousGift; // 0x64(0x01)
	None SkipCurrencyAmountValidation; // 0x65(0x01)
	None pItemHelper; // 0x68(0x08)
	None SKU; // 0x28(0x10)
	None PreSaleCost; // 0x38(0x04)
	None DisplayPreSaleCost; // 0x40(0x18)
	None cost; // 0x58(0x04)
	None DisplayCost; // 0x60(0x18)
	None CurrencyCode; // 0x78(0x18)
	None Name; // 0x90(0x18)
	None Desc; // 0xa8(0x18)
	None ShortDesc; // 0xc0(0x18)
	None TaxMessage; // 0xd8(0x18)
	None PreSalePrice; // 0x28(0x04)
	None Price; // 0x2c(0x04)
	None CurrencyType; // 0x30(0x28)
	None pItemHelper; // 0x58(0x08)
	None OnPriceSetDirty; // 0x28(0x10)
	None pItemHelper; // 0x48(0x08)
	None InventoryItem; // 0x50(0x28)
	None PortalOffer; // 0x78(0x08)
	None OnPurchaseItem; // 0x28(0x10)
	None OnPurchasePortalItem; // 0x38(0x10)
	None OnNotEnoughCurrency; // 0x48(0x10)
	None OnReceiveVendor; // 0x58(0x10)
	None OnReceiveXpTables; // 0x68(0x10)
	None OnReceivePricePoints; // 0x78(0x10)
	None OnPortalOffersReceived; // 0x88(0x10)
	None OnPendingPurchaseReceived; // 0x98(0x10)
	None OnPurchaseSubmitted; // 0xa8(0x10)
	None SkuToStoreItem; // 0xe0(0x50)
	None StoreItems; // 0x130(0x50)
	None XpTables; // 0x1e0(0x50)
	None XpTablesLoaded; // 0x280(0x01)
	None PricePointsLoaded; // 0x281(0x01)
	None PortalOffersLoaded; // 0x282(0x01)
	None GameInstance; // 0x288(0x08)
	None SoundEventBindings; // 0x28(0x50)
	None StringValue; // 0x28(0x10)
	None IntValue; // 0x38(0x04)
	None NameValue; // 0x3c(0x08)
	None DisplayTarget; // 0x28(0x08)
	None MyManager; // 0x30(0x08)
	None CurrentTransitionState; // 0x38(0x01)
	None CurrentRouteStack; // 0x40(0x10)
	None CurrentTransitionRouteStack; // 0x50(0x10)
	None RouteWidgetMap; // 0x60(0x50)
	None DefaultRoute; // 0xb0(0x08)
	None PendingRouteData; // 0xc0(0x50)
	None Routes; // 0x110(0x08)
	None ViewLayers; // 0x28(0x10)
	None StickyWidgetMap; // 0x38(0x50)
	None OnViewStateChanged; // 0x88(0x10)
	None OnViewStateChangeStarted; // 0x98(0x10)
	None HudRef; // 0xa8(0x08)
	None CanvasPanels; // 0xb0(0x10)
	None StickyWidgets; // 0xc0(0x10)
	None Routes; // 0xd0(0x08)
	None AlwaysCheckRouteData; // 0xd8(0x10)
	None bPendingPartyVoipJoin; // 0x28(0x01)
	None bPendingMatchVoipJoin; // 0x29(0x01)
	None CurrentPartyVoiceChatChannel; // 0x30(0x10)
	None CurrentPartyId; // 0x40(0x04)
	None CurrentMatchVoiceChatChannel; // 0x48(0x10)
	None CurrentMatchStatus; // 0x58(0x01)
	None CurrentMatchId; // 0x60(0x10)
	None bCurrentIsTokenForTaskForce; // 0x70(0x01)
	None PartyDataFactory; // 0x78(0x08)
	None QueueDataFactory; // 0x80(0x08)
	None bRedirectLogsToConsole; // 0xeb8(0x01)
	None bAllowReloadingDefaultLevel; // 0xeb9(0x01)
	None FrameRate; // 0x30(0x08)
	None UberGraphFrame; // 0x520(0x08)
	None hoveranim; // 0x528(0x08)
	None Button; // 0x530(0x08)
	None HoverImage; // 0x538(0x08)
	None Image_1; // 0x540(0x08)
	None PreferredSiteIcon; // 0x548(0x08)
	None RegionName; // 0x550(0x08)
	None SiteId; // 0x558(0x04)
	None SiteName; // 0x560(0x18)
	None OnRegionSelected; // 0x578(0x10)
	None HoverRegionSelectEntrySFX; // 0x588(0x08)
	None ClickRegionSelectEntrySFX; // 0x590(0x08)
	None OnInstanceTakePointDamage; // 0x680(0x10)
	None OnInstanceTakeRadialDamage; // 0x690(0x10)
	None GenerationGuid; // 0x6a0(0x10)
	None UpdateGuid; // 0x28(0x10)
	None Density; // 0x38(0x04)
	None DensityAdjustmentFactor; // 0x3c(0x04)
	None Radius; // 0x40(0x04)
	None bSingleInstanceModeOverrideRadius; // 0x44(0x01)
	None SingleInstanceModeRadius; // 0x48(0x04)
	None Scaling; // 0x4c(0x01)
	None ScaleX; // 0x50(0x08)
	None ScaleY; // 0x58(0x08)
	None ScaleZ; // 0x60(0x08)
	None VertexColorMaskByChannel; // 0x68(0x30)
	None VertexColorMask; // 0x98(0x01)
	None VertexColorMaskThreshold; // 0x9c(0x04)
	None VertexColorMaskInvert; // 0xa0(0x01)
	None ZOffset; // 0xa4(0x08)
	None AlignToNormal; // 0xac(0x01)
	None AlignMaxAngle; // 0xb0(0x04)
	None RandomYaw; // 0xb4(0x01)
	None RandomPitchAngle; // 0xb8(0x04)
	None GroundSlopeAngle; // 0xbc(0x08)
	None Height; // 0xc4(0x08)
	None LandscapeLayers; // 0xd0(0x10)
	None MinimumLayerWeight; // 0xe0(0x04)
	None ExclusionLandscapeLayers; // 0xe8(0x10)
	None MinimumExclusionLayerWeight; // 0xf8(0x04)
	None LandscapeLayer; // 0xfc(0x08)
	None CollisionWithWorld; // 0x104(0x01)
	None CollisionScale; // 0x108(0x0c)
	None MeshBounds; // 0x114(0x1c)
	None LowBoundOriginRadius; // 0x130(0x0c)
	None Mobility; // 0x13c(0x01)
	None CullDistance; // 0x140(0x08)
	None bEnableStaticLighting; // 0x148(0x01)
	None CastShadow; // 0x148(0x01)
	None bAffectDynamicIndirectLighting; // 0x148(0x01)
	None bAffectDistanceFieldLighting; // 0x148(0x01)
	None bCastDynamicShadow; // 0x148(0x01)
	None bCastStaticShadow; // 0x148(0x01)
	None bCastShadowAsTwoSided; // 0x148(0x01)
	None bReceivesDecals; // 0x148(0x01)
	None bOverrideLightMapRes; // 0x149(0x01)
	None OverriddenLightMapRes; // 0x14c(0x04)
	None LightmapType; // 0x150(0x01)
	None bUseAsOccluder; // 0x154(0x01)
	None BodyInstance; // 0x158(0x110)
	None CustomNavigableGeometry; // 0x268(0x01)
	None LightingChannels; // 0x269(0x01)
	None bRenderCustomDepth; // 0x26c(0x01)
	None CustomDepthStencilValue; // 0x270(0x04)
	None TranslucencySortPriority; // 0x274(0x04)
	None CollisionRadius; // 0x278(0x04)
	None ShadeRadius; // 0x27c(0x04)
	None NumSteps; // 0x280(0x04)
	None InitialSeedDensity; // 0x284(0x04)
	None AverageSpreadDistance; // 0x288(0x04)
	None SpreadVariance; // 0x28c(0x04)
	None SeedsPerStep; // 0x290(0x04)
	None DistributionSeed; // 0x294(0x04)
	None MaxInitialSeedOffset; // 0x298(0x04)
	None bCanGrowInShade; // 0x29c(0x01)
	None bSpawnsInShade; // 0x29d(0x01)
	None MaxInitialAge; // 0x2a0(0x04)
	None MaxAge; // 0x2a4(0x04)
	None OverlapPriority; // 0x2a8(0x04)
	None ProceduralScale; // 0x2ac(0x08)
	None ScaleCurve; // 0x2b8(0x88)
	None ChangeCount; // 0x340(0x04)
	None ReapplyDensity; // 0x344(0x01)
	None ReapplyRadius; // 0x344(0x01)
	None ReapplyAlignToNormal; // 0x344(0x01)
	None ReapplyRandomYaw; // 0x344(0x01)
	None ReapplyScaling; // 0x344(0x01)
	None ReapplyScaleX; // 0x344(0x01)
	None ReapplyScaleY; // 0x344(0x01)
	None ReapplyScaleZ; // 0x344(0x01)
	None ReapplyRandomPitchAngle; // 0x345(0x01)
	None ReapplyGroundSlope; // 0x345(0x01)
	None ReapplyHeight; // 0x345(0x01)
	None ReapplyLandscapeLayers; // 0x345(0x01)
	None ReapplyZOffset; // 0x345(0x01)
	None ReapplyCollisionWithWorld; // 0x345(0x01)
	None ReapplyVertexColorMask; // 0x345(0x01)
	None bEnableDensityScaling; // 0x345(0x01)
	None RuntimeVirtualTextures; // 0x348(0x10)
	None VirtualTextureCullMips; // 0x358(0x04)
	None VirtualTextureRenderPassType; // 0x35c(0x01)
	None ActorClass; // 0x360(0x08)
	None bShouldAttachToBaseComponent; // 0x368(0x01)
	None Mesh; // 0x360(0x08)
	None OverrideMaterials; // 0x368(0x10)
	None ComponentClass; // 0x378(0x08)
	None CapsuleComponent; // 0x230(0x08)
	None TouchingActorEntryPosition; // 0x238(0x0c)
	None FoliageVelocity; // 0x244(0x0c)
	None FoliageForce; // 0x250(0x0c)
	None FoliagePosition; // 0x25c(0x0c)
	None FoliageDamageImpulseScale; // 0x268(0x04)
	None FoliageTouchImpulseScale; // 0x26c(0x04)
	None FoliageStiffness; // 0x270(0x04)
	None FoliageStiffnessQuadratic; // 0x274(0x04)
	None FoliageDamping; // 0x278(0x04)
	None MaxDamageImpulse; // 0x27c(0x04)
	None MaxTouchImpulse; // 0x280(0x04)
	None MaxForce; // 0x284(0x04)
	None Mass; // 0x288(0x04)
	None ProceduralFoliageVolume; // 0x258(0x08)
	None FoliageSpawner; // 0xb0(0x08)
	None TileOverlap; // 0xb8(0x04)
	None SpawningVolume; // 0xc0(0x08)
	None ProceduralGuid; // 0xc8(0x10)
	None RandomSeed; // 0x28(0x04)
	None TileSize; // 0x2c(0x04)
	None NumUniqueTiles; // 0x30(0x04)
	None MinimumQuadTreeSize; // 0x34(0x04)
	None FoliageTypes; // 0x40(0x10)
	None FoliageSpawner; // 0x28(0x08)
	None InstancesArray; // 0xd0(0x10)
	None ProceduralComponent; // 0x258(0x08)
	None Rules; // 0x30(0x0c)
	None CollectionQuery; // 0x40(0x48)
	None PrimaryAssetType; // 0x88(0x08)
	None bHasCompletedInitialAssetScan; // 0x4e0(0x01)
	None ItemId; // 0x30(0x04)
	None ItemDisplayName; // 0x38(0x18)
	None ItemDescription; // 0x50(0x18)
	None FriendlySearchName; // 0x68(0x10)
	None IsOwnableInventoryItem; // 0x78(0x01)
	None DisplayableLootIds; // 0x80(0x10)
	None ItemIcon; // 0x90(0x28)
	None ItemIconPath; // 0xb8(0x18)
	None LegacyItemIconTexture; // 0xd0(0x28)
	None Icons; // 0xf8(0x10)
	None CollectionContainer; // 0x108(0x20)
	None ExternalProductSkus; // 0x128(0x50)
	None OnlyDisplayAcqusitionIfWhitelisted; // 0x178(0x01)
	None BlackListedLootIds; // 0x180(0x10)
	None LootId; // 0x1b8(0x04)
	None Rules; // 0x1bc(0x0c)
	None SocketErrorDisconnectDelay; // 0x1ad0(0x04)
	None OnSuccess; // 0x30(0x10)
	None OnFailure; // 0x40(0x10)
	None OnSuccess; // 0x30(0x10)
	None OnFailure; // 0x40(0x10)
	None OnSuccess; // 0x30(0x10)
	None OnFailure; // 0x40(0x10)
	None OnSuccess; // 0x30(0x10)
	None OnFailure; // 0x40(0x10)
	None OnSuccess; // 0x30(0x10)
	None OnFailure; // 0x40(0x10)
	None OnSuccess; // 0x30(0x10)
	None OnFailure; // 0x40(0x10)
	None OnSuccess; // 0x30(0x10)
	None OnFailure; // 0x40(0x10)
	None OnSuccess; // 0x30(0x10)
	None OnFailure; // 0x40(0x10)
	None OnSuccess; // 0x30(0x10)
	None OnFailure; // 0x40(0x10)
	None OnSuccess; // 0x28(0x10)
	None OnFailure; // 0x38(0x10)
	None OnSuccess; // 0x28(0x10)
	None OnFailure; // 0x38(0x10)
	None OnSuccess; // 0x28(0x10)
	None OnFailure; // 0x38(0x10)
	None OnSuccess; // 0x28(0x10)
	None OnFailure; // 0x38(0x10)
	None OnSuccess; // 0x28(0x10)
	None OnFailure; // 0x38(0x10)
	None OnSuccess; // 0x28(0x10)
	None OnFailure; // 0x38(0x10)
	None LogPortUnreach; // 0x778(0x01)
	None AllowPlayerPortUnreach; // 0x778(0x01)
	None MaxPortCountToTry; // 0x77c(0x04)
	None ServerDesiredSocketReceiveBufferBytes; // 0x78c(0x04)
	None ServerDesiredSocketSendBufferBytes; // 0x790(0x04)
	None ClientDesiredSocketReceiveBufferBytes; // 0x794(0x04)
	None ClientDesiredSocketSendBufferBytes; // 0x798(0x04)
	None MaxSecondsInReceive; // 0x7a0(0x08)
	None NbPacketsBetweenReceiveTimeTest; // 0x7a8(0x04)
	None ResolutionConnectionTimeout; // 0x7ac(0x04)
	None OnSuccess; // 0x30(0x10)
	None OnFailure; // 0x40(0x10)
	None OnSuccess; // 0x28(0x10)
	None OnFailure; // 0x38(0x10)
	None OnSuccess; // 0x28(0x10)
	None OnFailure; // 0x38(0x10)
	None OnSuccess; // 0x30(0x10)
	None OnFailure; // 0x40(0x10)
	None BeaconConnectionInitialTimeout; // 0x228(0x04)
	None BeaconConnectionTimeout; // 0x22c(0x04)
	None NetDriver; // 0x230(0x08)
	None BeaconOwner; // 0x250(0x08)
	None BeaconConnection; // 0x258(0x08)
	None ConnectionState; // 0x260(0x01)
	None ListenPort; // 0x250(0x04)
	None ClientActors; // 0x258(0x10)
	None BeaconTypeName; // 0x220(0x10)
	None ClientBeaconActorClass; // 0x230(0x08)
	None ClientActors; // 0x238(0x10)
	None VoiceSubsystemNameOverride; // 0x28(0x08)
	None bOnlinePIEEnabled; // 0x38(0x01)
	None Logins; // 0x40(0x10)
	None bIsFromInvite; // 0x1d8(0x01)
	None bHandlingDisconnect; // 0x1d9(0x01)
	None DestSessionId; // 0x2e0(0x10)
	None PendingReservation; // 0x2f0(0x50)
	None RequestType; // 0x340(0x01)
	None bPendingReservationSent; // 0x341(0x01)
	None bCancelReservation; // 0x342(0x01)
	None State; // 0x248(0x08)
	None bLogoutOnSessionTimeout; // 0x2b0(0x01)
	None SessionTimeoutSecs; // 0x2b4(0x04)
	None TravelSessionTimeoutSecs; // 0x2b8(0x04)
	None SessionName; // 0x28(0x08)
	None NumConsumedReservations; // 0x30(0x04)
	None MaxReservations; // 0x34(0x04)
	None NumTeams; // 0x38(0x04)
	None NumPlayersPerTeam; // 0x3c(0x04)
	None TeamAssignmentMethod; // 0x40(0x08)
	None ReservedHostTeamNum; // 0x48(0x04)
	None ForceTeamNum; // 0x4c(0x04)
	None bRestrictCrossConsole; // 0x50(0x01)
	None bEnableRemovalRequests; // 0x51(0x01)
	None Reservations; // 0x58(0x10)
	None OnSuccess; // 0x30(0x10)
	None OnFailure; // 0x40(0x10)
	None OnSuccess; // 0x30(0x10)
	None OnFailure; // 0x40(0x10)
	None DestSessionId; // 0x2e0(0x10)
	None PendingReservation; // 0x2f0(0x78)
	None RequestType; // 0x368(0x01)
	None bPendingReservationSent; // 0x369(0x01)
	None bCancelReservation; // 0x36a(0x01)
	None State; // 0x248(0x08)
	None bLogoutOnSessionTimeout; // 0x2b0(0x01)
	None SessionTimeoutSecs; // 0x2b4(0x04)
	None TravelSessionTimeoutSecs; // 0x2b8(0x04)
	None SessionName; // 0x28(0x08)
	None NumConsumedReservations; // 0x30(0x04)
	None MaxReservations; // 0x34(0x04)
	None bRestrictCrossConsole; // 0x38(0x01)
	None Reservations; // 0x40(0x10)
	None bAutoDestroy; // 0x208(0x01)
	None bStopWhenOwnerDestroyed; // 0x208(0x01)
	None bAllowSpatialization; // 0x208(0x01)
	None bOverrideAttenuation; // 0x208(0x01)
	None bOutputToBusOnly; // 0x20c(0x01)
	None AttenuationSettings; // 0x210(0x08)
	None AttenuationOverrides; // 0x218(0x3a0)
	None ConcurrencySettings; // 0x5b8(0x08)
	None ConcurrencySet; // 0x5c0(0x50)
	None SoundClass; // 0x610(0x08)
	None SourceEffectChain; // 0x618(0x08)
	None SoundSubmix; // 0x620(0x08)
	None SoundSubmixSends; // 0x628(0x10)
	None BusSends; // 0x638(0x10)
	None Modulation; // 0x648(0x10)
	None PreEffectBusSends; // 0x658(0x10)
	None bIsUISound; // 0x668(0x01)
	None bIsPreviewSound; // 0x668(0x01)
	None EnvelopeFollowerAttackTime; // 0x66c(0x04)
	None EnvelopeFollowerReleaseTime; // 0x670(0x04)
	None OnAudioEnvelopeValue; // 0x678(0x10)
	None Synth; // 0x6a8(0x08)
	None AudioComponent; // 0x6b0(0x08)
	None Settings; // 0xb8(0x50)
	None Settings; // 0x78(0x10)
	None Settings; // 0x9c(0x34)
	None Settings; // 0xa0(0x38)
	None OwningSynthComponent; // 0x360(0x08)
	None UberGraphFrame; // 0x130(0x08)
	None UberGraphFrame; // 0x238(0x08)
	None LevelText; // 0x240(0x08)
	None Mastered; // 0x248(0x08)
	None MasteryMax; // 0x250(0x08)
	None Unmastered; // 0x258(0x08)
	None WidgetSwitcher_88; // 0x260(0x08)
	None Components; // 0x28(0x10)
	None Signature; // 0x28(0x10)
	None EvalOptions; // 0x50(0x02)
	None Easing; // 0x58(0x38)
	None SectionRange; // 0x90(0x10)
	None PreRollFrames; // 0xa0(0x04)
	None PostRollFrames; // 0xa4(0x04)
	None RowIndex; // 0xa8(0x04)
	None OverlapPriority; // 0xac(0x04)
	None bIsActive; // 0xb0(0x01)
	None bIsLocked; // 0xb0(0x01)
	None StartTime; // 0xb4(0x04)
	None EndTime; // 0xb8(0x04)
	None PrerollTime; // 0xbc(0x04)
	None PostrollTime; // 0xc0(0x04)
	None bIsInfinite; // 0xc4(0x01)
	None bSupportsInfiniteRange; // 0xc8(0x01)
	None BlendType; // 0xc9(0x02)
	None EvalOptions; // 0x50(0x04)
	None bIsEvalDisabled; // 0x55(0x01)
	None PrecompiledEvaluationTemplate; // 0x50(0x2f0)
	None DefaultCompletionMode; // 0x340(0x01)
	None bParentContextsAreSignificant; // 0x341(0x01)
	None bPlayableDirectly; // 0x342(0x01)
	None OnPlay; // 0x408(0x10)
	None OnPlayReverse; // 0x418(0x10)
	None OnStop; // 0x428(0x10)
	None OnPause; // 0x438(0x10)
	None OnFinished; // 0x448(0x10)
	None Status; // 0x458(0x01)
	None bReversePlayback; // 0x45c(0x01)
	None Sequence; // 0x460(0x08)
	None StartTime; // 0x468(0x04)
	None DurationFrames; // 0x46c(0x04)
	None CurrentNumLoops; // 0x470(0x04)
	None PlaybackSettings; // 0x488(0x14)
	None RootTemplateInstance; // 0x4a0(0x320)
	None NetSyncProps; // 0x828(0x10)
	None PlaybackClient; // 0x838(0x10)
	None Parameters; // 0xe0(0x24)
	None StartOffset; // 0x104(0x04)
	None TimeScale; // 0x108(0x04)
	None PrerollTime; // 0x10c(0x04)
	None SubSequence; // 0x110(0x08)
	None ActorToRecord; // 0x118(0x1c)
	None TargetSequenceName; // 0x138(0x10)
	None TargetPathToRecordTo; // 0x148(0x10)
	None Sections; // 0x58(0x10)
	None Spawnables; // 0x50(0x10)
	None Possessables; // 0x60(0x10)
	None ObjectBindings; // 0x70(0x10)
	None BindingGroups; // 0x80(0x50)
	None MasterTracks; // 0xd0(0x10)
	None CameraCutTrack; // 0xe0(0x08)
	None SelectionRange; // 0xe8(0x10)
	None PlaybackRange; // 0xf8(0x10)
	None TickResolution; // 0x108(0x08)
	None DisplayRate; // 0x110(0x08)
	None EvaluationType; // 0x118(0x01)
	None ClockSource; // 0x119(0x01)
	None CustomClockSourcePath; // 0x120(0x18)
	None MarkedFrames; // 0x138(0x10)
	None BindingData; // 0x28(0x10)
	None Type; // 0x30(0x01)
	None Curve; // 0x30(0x08)
	None FolderName; // 0x28(0x08)
	None ChildFolders; // 0x30(0x10)
	None ChildMasterTracks; // 0x40(0x10)
	None ChildObjectBindingStrings; // 0x50(0x10)
	None bHighPassFilter; // 0x58(0x01)
	None SectionArray; // 0x60(0x10)
	None MovieScene; // 0x348(0x08)
	None SectionArray; // 0x68(0x10)
	None MaxParamName; // 0x38(0x08)
	None MinParamName; // 0x40(0x08)
	None DefaultMaxValue; // 0x48(0x0c)
	None DefaultMinValue; // 0x54(0x0c)
	None m_EffectManager; // 0x4c8(0x08)
	None r_TweenInfo; // 0x4d0(0x14)
	None r_ChargeInfo; // 0x4e4(0x1c)
	None bUseTweenWalkingPhysics; // 0x6a0(0x01)
	None r_ChargeInfo; // 0x6a8(0x1c)
	None r_TweenInfo; // 0x6c4(0x14)
	None LogFileName; // 0x220(0x10)
	None r_ReplicatedEffectData; // 0xd8(0x120)
	None r_ReplicatedProperties; // 0x1f8(0x170)
	None m_EffectGroupTypes; // 0x28(0x20)
	None m_BehaviorCategories; // 0x48(0x20)
	None m_Effects; // 0x68(0x10)
	None m_AttachmentClass; // 0x78(0x08)
	None m_StackingCategory; // 0x80(0x08)
	None m_ApplicationRule; // 0x88(0x04)
	None m_nMaxStackCount; // 0x8c(0x01)
	None m_bApplyInstantOnInterval; // 0x8d(0x01)
	None m_bApplyStackOnInterval; // 0x8e(0x01)
	None m_fStartDuration; // 0x90(0x04)
	None m_fDuration; // 0x94(0x04)
	None m_fIntervalDuration; // 0x98(0x04)
	None m_fApplicationStrength; // 0x9c(0x04)
	None m_Property; // 0x28(0x24)
	None m_bApplyOnInternal; // 0x4c(0x01)
	None bLogoffOnAppSuspend; // 0x1e8(0x01)
	None bLogoffOnAppResume; // 0x1e9(0x01)
	None LastSonyMatchId; // 0x1f0(0x10)
	None bStartHotfixProcessingOnUpdateAppSettings; // 0x240(0x01)
	None PersistentMapSuffix; // 0x388(0x10)
	None SublevelSuffixes; // 0x398(0x10)
	None HighMemorySublevelSuffixes; // 0x3a8(0x10)
	None LowMemorySublevelSuffixes; // 0x3b8(0x10)
	None bAutoEnableCombatLog; // 0x3e8(0x01)
	None bUploadCombatLogOverride; // 0x3e9(0x01)
	None bFubarForCPUFramerate; // 0x438(0x01)
	None bFubarForPacketLoss; // 0x439(0x01)
	None FubarShutdownWaitTimeoutTime; // 0x43c(0x04)
	None bDeferWelcomeUntilAllPlayersConnect; // 0x440(0x01)
	None bReadyForWelcome; // 0x441(0x01)
	None SonyActivityId; // 0x4a0(0x10)
	None SonyMatchOwnerNetTimeout; // 0x4b0(0x04)
	None SonyMatchData; // 0x4b8(0x18)
	None SonyIneligibleMatchOwners; // 0x4d0(0x10)
	None PGame_InactivePlayerArray; // 0x4f0(0x10)
	None r_SonyMatchIdForPlayerFeedback; // 0x290(0x10)
	None OnHandlerObjectReady; // 0x28(0x10)
	None OnJsonDownloaded; // 0x38(0x10)
	None OnJsonReady; // 0x48(0x10)
	None OnImagesDownloaded; // 0x58(0x10)
	None mapFilePathToTexture; // 0x120(0x50)

	void SwimNotifyTransitionStateLock(None bpp__bShouldLock__pf); // SwimNotifyTransitionStateLock Sub_Hero_ABP_Swimming.Sub_Hero_ABP_Swimming_C.SwimNotifyTransitionStateLock // (Native|Event|Public|BlueprintCallable) // <Game+0x195dfa0>
	void SetFillPercentage(None Percentage); // SetFillPercentage WBP_ProgressBar.WBP_ProgressBar_C.SetFillPercentage // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x260f470>
	void HandleInitialSpawn(); // HandleInitialSpawn WBP_TextChat_ChatEntry.WBP_TextChat_ChatEntry_C.HandleInitialSpawn // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x260f470>
	void ServerSetPartyOwner(None InUniqueId, None InPartyOwnerId); // ServerSetPartyOwner Lobby.LobbyBeaconClient.ServerSetPartyOwner // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // <Game+0xb3cad0>
