// AnimBlueprintGeneratedClass Pis.AB
struct UAB : UBravoHotelAnimInstanceWeapon {
	struct Unknown UberGraphFrame; //  0x330 Size(8)
	struct Unknown AnimGraphNode_Root; //  0x338 Size(30)
	struct Unknown AnimGraphNode_Slot_3; //  0x368 Size(48)
	struct Unknown AnimGraphNode_TwoWayBlend; //  0x3b0 Size(c8)
	struct Unknown AnimGraphNode_LocalRefPose_3; //  0x478 Size(18)
	struct Unknown AnimGraphNode_Slot_2; //  0x490 Size(48)
	struct Unknown AnimGraphNode_LocalRefPose_2; //  0x4d8 Size(18)
	struct Unknown AnimGraphNode_BlendListByBool; //  0x4f0 Size(a0)
	struct Unknown AnimGraphNode_Slot; //  0x590 Size(48)
	struct Unknown AnimGraphNode_LocalRefPose; //  0x5d8 Size(18)

	void AnimGraph(struct Unknown& AnimGraph); // Function Pis.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// AnimBlueprintGeneratedClass Pis.AB
struct UAB : UBravoHotelAnimInstanceWeapon {
	struct Unknown UberGraphFrame; //  0x330 Size(8)
	struct Unknown AnimGraphNode_Root; //  0x338 Size(30)
	struct Unknown AnimGraphNode_BlendListByEnum; //  0x368 Size(b0)
	struct Unknown AnimGraphNode_SequencePlayer_3; //  0x418 Size(78)
	struct Unknown AnimGraphNode_SequencePlayer_2; //  0x490 Size(78)
	struct Unknown AnimGraphNode_SequencePlayer; //  0x508 Size(78)
	struct Unknown AnimGraphNode_Slot_4; //  0x580 Size(48)
	struct Unknown AnimGraphNode_TwoWayBlend; //  0x5c8 Size(c8)
	struct Unknown AnimGraphNode_LayeredBoneBlend; //  0x690 Size(c0)
	struct Unknown AnimGraphNode_LocalRefPose_3; //  0x750 Size(18)
	struct Unknown AnimGraphNode_Slot_3; //  0x768 Size(48)
	struct Unknown AnimGraphNode_Slot_2; //  0x7b0 Size(48)
	struct Unknown AnimGraphNode_LocalRefPose_2; //  0x7f8 Size(18)
	struct Unknown AnimGraphNode_BlendListByBool; //  0x810 Size(a0)
	struct Unknown AnimGraphNode_Slot; //  0x8b0 Size(48)
	struct Unknown AnimGraphNode_LocalRefPose; //  0x8f8 Size(18)

	void AnimGraph(struct Unknown& AnimGraph); // Function Pisrj.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// AnimBlueprintGeneratedClass Pis.AB
struct UAB : UBravoHotelAnimInstanceWeapon {
	struct Unknown UberGraphFrame; //  0x330 Size(8)
	struct Unknown AnimGraphNode_Root; //  0x338 Size(30)
	struct Unknown AnimGraphNode_Slot_3; //  0x368 Size(48)
	struct Unknown AnimGraphNode_TwoWayBlend; //  0x3b0 Size(c8)
	struct Unknown AnimGraphNode_LocalRefPose_3; //  0x478 Size(18)
	struct Unknown AnimGraphNode_Slot_2; //  0x490 Size(48)
	struct Unknown AnimGraphNode_LocalRefPose_2; //  0x4d8 Size(18)
	struct Unknown AnimGraphNode_BlendListByBool; //  0x4f0 Size(a0)
	struct Unknown AnimGraphNode_Slot; //  0x590 Size(48)
	struct Unknown AnimGraphNode_LocalRefPose; //  0x5d8 Size(18)

	void AnimGraph(struct Unknown& AnimGraph); // Function Pis.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

