// AnimBlueprintGeneratedClass Pis.AB
struct UAB : UBravoHotelAnimInstanceWeapon {
	struct Unknown UberGraphFrame; //  0x330 Size(8)
	struct Unknown AnimGraphNode_Root; //  0x338 Size(30)
	struct Unknown AnimGraphNode_Slot_3; //  0x368 Size(48)
	struct Unknown AnimGraphNode_TwoWayBlend; //  0x3b0 Size(c8)
	struct Unknown AnimGraphNode_LocalRefPose_3; //  0x478 Size(18)
	struct Unknown AnimGraphNode_Slot_2; //  0x490 Size(48)
	struct Unknown AnimGraphNode_LocalRefPose_2; //  0x4d8 Size(18)
	struct Unknown AnimGraphNode_BlendListByBool; //  0x4f0 Size(a0)
	struct Unknown AnimGraphNode_Slot; //  0x590 Size(48)
	struct Unknown AnimGraphNode_LocalRefPose; //  0x5d8 Size(18)

	void AnimGraph(struct Unknown& AnimGraph); // Function Pisss.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

