// AnimBlueprintGeneratedClass PPSh.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_BlendListByEnum; //  0x368 Size(b0)
	Unknown AnimGraphNode_SequencePlayer_3; //  0x418 Size(78)
	Unknown AnimGraphNode_SequencePlayer_2; //  0x490 Size(78)
	Unknown AnimGraphNode_SequencePlayer; //  0x508 Size(78)
	Unknown AnimGraphNode_Slot_4; //  0x580 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x5c8 Size(c8)
	Unknown AnimGraphNode_LayeredBoneBlend; //  0x690 Size(c0)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x750 Size(18)
	Unknown AnimGraphNode_Slot_3; //  0x768 Size(48)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x7b0 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x7c8 Size(48)
	Unknown AnimGraphNode_Slot; //  0x810 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x858 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x870 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function PPSh.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

