// BlueprintGeneratedClass ProjectileTrajectoryComponent.ProjectileTrajectoryComponent_C
struct UProjectileTrajectoryComponent_C : UActorComponent {
	struct Unknown UberGraphFrame; //  0xb0 Size(8)
	struct TArray<Unknown> BeamsArray; //  0xb8 Size(10)
	struct Unknown Decal; //  0xc8 Size(8)
	struct Unknown StartLocation; //  0xd0 Size(c)
	struct Unknown InitialVelocity; //  0xdc Size(c)
	float PathLifeTime; //  0xe8 Size(4)
	float TimeInterval; //  0xec Size(4)
	char DrawingType; //  0xf0 Size(1)
	struct Unknown DesiredStartLocation; //  0xf4 Size(c)
	struct Unknown InitialLocalVelocity; //  0x100 Size(c)
	struct Unknown BeamParticle; //  0x110 Size(8)
	struct Unknown DebugColor; //  0x118 Size(10)
	float DebugThickness; //  0x128 Size(4)
	struct Unknown ParticleColor; //  0x12c Size(10)
	float ParticleColorMultipler; //  0x13c Size(4)
	struct Unknown DecalMaterial; //  0x140 Size(8)
	struct Unknown DecalColor; //  0x148 Size(10)
	struct Unknown DecalScale; //  0x158 Size(c)
	char ConstantScale; //  0x164 Size(1)
	struct Unknown ResizerTimer; //  0x168 Size(8)
	struct Unknown DecalScaleMin; //  0x170 Size(c)
	struct Unknown DecalScaleMax; //  0x17c Size(c)
	float ScaleTime; //  0x188 Size(4)
	char ScaleStart; //  0x18c Size(1)
	struct Unknown Gravity; //  0x190 Size(c)
	float InitXAxisValue; //  0x19c Size(4)
	char CreateBeam; //  0x1a0 Size(1)
	int32_t HitBeamIndex; //  0x1a4 Size(4)
	struct Unknown SplineStaticMesh; //  0x1a8 Size(8)
	struct TArray<Unknown> SplineMeshArray; //  0x1b0 Size(10)
	struct Unknown S; //  0x1c0 Size(c)
	struct Unknown S; //  0x1d0 Size(8)
	char Hit; //  0x1d8 Size(1)
	char bForceStop; //  0x1d9 Size(1)
	char FPSMode; //  0x1da Size(1)

	void InterpProjectileTrajectoryJumpState(char Jump, struct Unknown Location, struct Unknown Rotation, struct Unknown& StartLocation, struct Unknown& Velocity); // Function ProjectileTrajectoryComponent.ProjectileTrajectoryComponent_C.InterpProjectileTrajectoryJumpState(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

