// AnimBlueprintGeneratedClass PSR.AB
struct UAB : UBravoHotelAnimInstanceWeapot {
	Unknown UberGraphFrame; //  0x330 Size(8)
	Unknown AnimGraphNode_Root; //  0x338 Size(30)
	Unknown AnimGraphNode_Slot_3; //  0x368 Size(48)
	Unknown AnimGraphNode_TwoWayBlend; //  0x3b0 Size(c8)
	Unknown AnimGraphNode_LocalRefPose_3; //  0x478 Size(18)
	Unknown AnimGraphNode_LocalRefPose_2; //  0x490 Size(18)
	Unknown AnimGraphNode_Slot_2; //  0x4a8 Size(48)
	Unknown AnimGraphNode_Slot; //  0x4f0 Size(48)
	Unknown AnimGraphNode_LocalRefPose; //  0x538 Size(18)
	Unknown AnimGraphNode_BlendListByBo; //  0x550 Size(a0)

	void AnimGraph(Unknown& AnimGraph); // Function PSR.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

