// AnimBlueprintGeneratedClass Riveri.AB
struct UAB : UBravoHotelVehicleAnimInstance {
	struct Unknown UberGraphFrame; //  0xa20 Size(8)
	struct Unknown AnimGraphNode_Root; //  0xa28 Size(30)
	struct Unknown AnimGraphNode_MeshRefPose_2; //  0xa58 Size(10)
	struct Unknown AnimGraphNode_ComponentToLocalSpace_2; //  0xa68 Size(20)
	struct Unknown AnimGraphNode_ModifyBone; //  0xa88 Size(108)
	struct Unknown AnimGraphNode_BlendListByBool; //  0xb90 Size(a0)
	struct Unknown AnimGraphNode_MeshRefPose; //  0xc30 Size(10)
	struct Unknown AnimGraphNode_ComponentToLocalSpace; //  0xc40 Size(20)

	void AnimGraph(struct Unknown& AnimGraph); // Function Riveri.AB.AnimGraph(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// BlueprintGeneratedClass Riveri.B
struct AB : AB {
	struct Unknown B; //  0xd18 Size(8)
	struct Unknown B; //  0xd20 Size(8)
	struct Unknown B; //  0xd28 Size(8)
	struct Unknown BravoHotelVehicleSeat05; //  0xd30 Size(8)
	struct Unknown BravoHotelVehicleSeat04; //  0xd38 Size(8)
	struct Unknown BravoHotelVehicleSeat03; //  0xd40 Size(8)
	struct Unknown BravoHotelVehicleSeat02; //  0xd48 Size(8)
};

