// SceneComponent Engine.SceneComponent
 struct USceneComponent : UActorComponent {
	Unknown UberGraphFrame; // 0x248(0x08)
	Unknown BlockMouse; // 0x250(0x08)
	Unknown Button_Accept; // 0x258(0x08)
	Unknown Button_Cancel; // 0x260(0x08)
	Unknown Button_Close; // 0x268(0x08)
	Unknown Button_Max; // 0x270(0x08)
	Unknown Button_Min; // 0x278(0x08)
	Unknown Image_9; // 0x280(0x08)
	Unknown Slider_137; // 0x288(0x08)
	Unknown TextBlock_Accept; // 0x290(0x08)
	Unknown TextBlock_MaxCount; // 0x298(0x08)
	Unknown TextBlock_MinCount; // 0x2a0(0x08)
	Unknown TextBlock_Title; // 0x2a8(0x08)
	Unknown TextBox_DropCount; // 0x2b0(0x08)
	int32_t CurrentCount; // 0x2b8(0x04)
	int32_t MaxCount; // 0x2bc(0x04)
	struct FText LastEnteredText; // 0x2c0(0x18)
	Unknown ItemInfo; // 0x2d8(0x98)
	Unknown ItemDetailInfo; // 0x370(0x490)
	Unknown PickupRef; // 0x800(0x08)
	Unknown DropBoxRef; // 0x808(0x08)
	Unknown InventoryWidget; // 0x810(0x08)
	Unknown bClosing; // 0x818(0x01)
	Unknown MaterialSlot; // 0x820(0x08)
	Unknown DefaultSceneRoot; // 0x638(0x08)
	Unknown MassMode; // 0x28(0x01)
	float UniformMass; // 0x2c(0x04)
	float TotalMass; // 0x30(0x04)
	float Density; // 0x34(0x04)
	float MinPerParticleMass; // 0x38(0x04)
	float EdgeStiffness; // 0x3c(0x04)
	float BendingStiffness; // 0x40(0x04)
	float AreaStiffness; // 0x44(0x04)
	float VolumeStiffness; // 0x48(0x04)
	float StrainLimitingStiffness; // 0x4c(0x04)
	float LimitScale; // 0x50(0x04)
	Unknown bUseGeodesicDistance; // 0x54(0x01)
	float ShapeTargetStiffness; // 0x58(0x04)
	float CollisionThickness; // 0x5c(0x04)
	float FrictionCoefficient; // 0x60(0x04)
	float DampingCoefficient; // 0x64(0x04)
	float DragCoefficient; // 0x68(0x04)
	float AnimDriveSpringStiffness; // 0x6c(0x04)
	Unknown bUseBendingElements; // 0x70(0x01)
	Unknown bUseTetrahedralConstraints; // 0x71(0x01)
	Unknown bUseThinShellVolumeConstraints; // 0x72(0x01)
	Unknown bUseSelfCollisions; // 0x73(0x01)
	Unknown bUseContinuousCollisionDetection; // 0x74(0x01)
	Unknown LinearVelocityScale; // 0x78(0x0c)
	float AngularVelocityScale; // 0x84(0x04)
	int32_t IterationCount; // 0x28(0x04)
	int32_t SubdivisionCount; // 0x2c(0x04)
	float SelfCollisionThickness; // 0x30(0x04)
	float CollisionThickness; // 0x34(0x04)
	Unknown bUseDampingOverride; // 0x38(0x01)
	float Damping; // 0x3c(0x04)
	Unknown bUseGravityOverride; // 0x40(0x01)
	float GravityScale; // 0x44(0x04)
	Unknown Gravity; // 0x48(0x0c)
	Unknown bUseLocalSpaceSimulation; // 0x54(0x01)
	Unknown bUseXPBDConstraints; // 0x55(0x01)
	Unknown Type; // 0x28(0x01)
	Unknown ByteValue; // 0x29(0x01)
	int32_t IntegerValue; // 0x2c(0x04)
	Unknown LongBytesValue; // 0x30(0x08)
	float FloatValue; // 0x38(0x04)
	Unknown DoubleBytesValue; // 0x40(0x08)
	Unknown BooleanValue; // 0x48(0x01)
	struct FString StringUtf8Value; // 0x50(0x10)
	Unknown ByteArrayValue; // 0x60(0x10)
	Unknown IntegerArrayValue; // 0x70(0x10)
	Unknown LongBytesArrayValue; // 0x80(0x10)
	Unknown FloatArrayValue; // 0x90(0x10)
	Unknown DoubleBytesArrayValue; // 0xa0(0x10)
	Unknown BooleanArrayValue; // 0xb0(0x10)
	Unknown StringUtf8ArrayValue; // 0xc0(0x10)
	Unknown Bytes; // 0x28(0x10)
	int32_t Position; // 0x38(0x04)
	Unknown CurrentByte; // 0x3c(0x01)
	int32_t CurrentBytePosition; // 0x40(0x04)
	Unknown Bytes; // 0x28(0x10)
	Unknown CurrentByte; // 0x38(0x01)
	int32_t CurrentBytePosition; // 0x3c(0x04)
	Unknown ByteArray; // 0x28(0x10)
	Unknown Type; // 0x28(0x01)
	Unknown ByteValue; // 0x29(0x01)
	int32_t IntegerValue; // 0x2c(0x04)
	Unknown LongBytesValue; // 0x30(0x08)
	float FloatValue; // 0x38(0x04)
	Unknown DoubleBytesValue; // 0x40(0x08)
	Unknown BooleanValue; // 0x48(0x01)
	struct FString StringUtf8Value; // 0x50(0x10)
	Unknown ByteArrayValue; // 0x60(0x10)
	Unknown IntegerArrayValue; // 0x70(0x10)
	Unknown LongBytesArrayValue; // 0x80(0x10)
	Unknown FloatArrayValue; // 0x90(0x10)
	Unknown DoubleBytesArrayValue; // 0xa0(0x10)
	Unknown BooleanArrayValue; // 0xb0(0x10)
	Unknown StringUtf8ArrayValue; // 0xc0(0x10)
	Unknown Bytes; // 0x28(0x10)
	int32_t Position; // 0x38(0x04)
	Unknown Bytes; // 0x28(0x10)
	Unknown Bytes; // 0x28(0x10)
	int32_t Count; // 0x28(0x04)
	Unknown Next; // 0x2c(0x01)
	Unknown Finished; // 0x28(0x01)
	Unknown Result; // 0x29(0x01)
	int32_t KeepAliveCount; // 0x2c(0x04)
	Unknown Finished; // 0x28(0x01)
	float Result; // 0x2c(0x04)
	int32_t KeepAliveCount; // 0x30(0x04)
	Unknown Finished; // 0x28(0x01)
	int32_t Result; // 0x2c(0x04)
	int32_t KeepAliveCount; // 0x30(0x04)
	Unknown Finished; // 0x28(0x01)
	int32_t KeepAliveCount; // 0x2c(0x04)
	Unknown Finished; // 0x28(0x01)
	Unknown Result; // 0x30(0x08)
	int32_t KeepAliveCount; // 0x38(0x04)
	Unknown Finished; // 0x28(0x01)
	struct FString Result; // 0x30(0x10)
	int32_t KeepAliveCount; // 0x40(0x04)
	Unknown Bytes; // 0x28(0x10)
	Unknown Valid; // 0x28(0x01)
	struct FString Resource; // 0x30(0x10)
	Unknown Date; // 0x40(0x08)
	int32_t Bits; // 0x48(0x04)
	Unknown GeometryCollection; // 0x28(0x08)
	Unknown OriginalGeometryCollection; // 0x30(0x08)
	int32_t GeometryCollectionLODIndex; // 0x38(0x04)
	Unknown Adapters; // 0x3b8(0x10)
	int32_t TextureCoordinateCount; // 0x3d0(0x04)
	int32_t PendingCompactCounter; // 0x51c(0x04)
	int32_t SubdivisionCount; // 0x520(0x04)
	Unknown StaticMesh; // 0x28(0x08)
	Unknown OriginalStaticMesh; // 0x30(0x08)
	int32_t StaticMeshLODIndex; // 0x38(0x04)
	Unknown UberGraphFrame; // 0x248(0x08)
	Unknown CanvasPanel_1; // 0x250(0x08)
	Unknown Image; // 0x258(0x08)
	Unknown Image_2; // 0x260(0x08)
	Unknown Image_3; // 0x268(0x08)
	Unknown Image_4; // 0x270(0x08)
	Unknown Image_5; // 0x278(0x08)
	Unknown Image_6; // 0x280(0x08)
	Unknown Image_7; // 0x288(0x08)
	Unknown Image_8; // 0x290(0x08)
	Unknown Image_9; // 0x298(0x08)
	Unknown Image_10; // 0x2a0(0x08)
	Unknown Image_11; // 0x2a8(0x08)
	Unknown Image_12; // 0x2b0(0x08)
	Unknown Image_13; // 0x2b8(0x08)
	Unknown Image_14; // 0x2c0(0x08)
	Unknown Image_15; // 0x2c8(0x08)
	Unknown Image_16; // 0x2d0(0x08)
	Unknown Image_17; // 0x2d8(0x08)
	Unknown Image_18; // 0x2e0(0x08)
	Unknown Image_47; // 0x2e8(0x08)
	Unknown ScaleBox4X_5mm; // 0x2f0(0x08)
	Unknown ScaleBox4X_7mm; // 0x2f8(0x08)
	Unknown ScaleBox4X_SR; // 0x300(0x08)
	Unknown WidgetSwitcher_167; // 0x308(0x08)
	Unknown NewVar_1; // 0x310(0x08)
	Unknown UberGraphFrame; // 0x128(0x08)
	struct FMulticastInlineDelegate RequestOnServer; // 0x130(0x10)
	Unknown SelectionMode; // 0x140(0x01)
	float TimeoutBetweenPings; // 0x144(0x04)
	Unknown PingTimeouts; // 0x148(0x10)
	Unknown ExecutingMenuIconIDs; // 0x158(0x10)
	Unknown ExecutingMenuIconSettings; // 0x168(0x10)
	Unknown OwningPawn; // 0x178(0x08)
	Unknown SelectionMenu; // 0x180(0x08)
	struct FMulticastInlineDelegate ExecuteOwningClient; // 0x188(0x10)
	Unknown TraceMethod; // 0x198(0x01)
	float TraceLength; // 0x19c(0x04)
	float TraceRadius; // 0x1a0(0x04)
	Unknown TraceChannel; // 0x1a4(0x01)
	Unknown TraceComplex; // 0x1a5(0x01)
	struct FMulticastInlineDelegate MenuActivated; // 0x1a8(0x10)
	struct FMulticastInlineDelegate MenuDeactivated; // 0x1b8(0x10)
	struct FMulticastInlineDelegate PingReceivedOnServer; // 0x1c8(0x10)
	Unknown ExecutingPingInfo2; // 0x1d8(0x38)
	Unknown NoneHitActor; // 0x210(0x01)
	Unknown IgnorInput; // 0x211(0x01)
	struct FName TempItemPingTableIndex; // 0x214(0x08)
	Unknown Enable; // 0x21c(0x01)
	struct FName NewVar_1; // 0x220(0x08)
	Unknown MainWidget; // 0x228(0x08)
	Unknown EnableEndPingType; // 0x230(0x01)
	Unknown IsSelectionMenuOnMap; // 0x231(0x01)
	Unknown TmpLocation; // 0x234(0x0c)
	Unknown TmpMousePosition; // 0x240(0x08)
	Unknown IsVisibleSelectionMenu; // 0x248(0x01)
	Unknown IsPressedCtrl; // 0x249(0x01)
	Unknown FindPickUpItem; // 0x24a(0x01)
	Unknown UberGraphFrame; // 0x310(0x08)
	Unknown DefaultSceneRoot; // 0x318(0x08)
	Unknown Muted; // 0x320(0x10)
	Unknown Two; // 0x330(0x01)
	struct FString Player; // 0x338(0x10)
	Unknown Players; // 0x348(0x10)
	Unknown Game; // 0x358(0x08)
	Unknown Joined; // 0x360(0x10)
	Unknown Banned; // 0x370(0x10)
	Unknown Owned; // 0x380(0x10)
	Unknown Chat; // 0x390(0x08)
	Unknown HU; // 0x398(0x08)
	Unknown PrimaryComponentTick; // 0x30(0x30)
	Unknown ComponentTags; // 0x60(0x10)
	Unknown AssetUserData; // 0x70(0x10)
	int32_t UCSSerializationIndex; // 0x84(0x04)
	Unknown bNetAddressable; // 0x88(0x01)
	Unknown bReplicates; // 0x88(0x01)
	Unknown bAutoActivate; // 0x89(0x01)
	Unknown bIsActive; // 0x8a(0x01)
	Unknown bEditableWhenInherited; // 0x8a(0x01)
	Unknown bCanEverAffectNavigation; // 0x8a(0x01)
	Unknown bIsEditorOnly; // 0x8a(0x01)
	Unknown CreationMethod; // 0x8c(0x01)
	struct FMulticastSparseDelegate OnComponentActivated; // 0x8d(0x01)
	struct FMulticastSparseDelegate OnComponentDeactivated; // 0x8e(0x01)
	Unknown UCSModifiedProperties; // 0x90(0x10)
	Unknown PhysicsVolume; // 0x144(0x08)
	Unknown AttachParent; // 0x1d0(0x08)
	struct FName AttachSocketName; // 0x1dc(0x08)
	Unknown AttachChildren; // 0xb8(0x10)
	Unknown ClientAttachedChildren; // 0x190(0x10)
	Unknown RelativeLocation; // 0x224(0x0c)
	Unknown RelativeRotation; // 0x1b4(0x0c)
	Unknown RelativeScale3D; // 0x1c4(0x0c)
	Unknown ComponentVelocity; // 0x164(0x0c)
	Unknown bComponentToWorldUpdated; // 0x140(0x01)
	Unknown bAbsoluteLocation; // 0x220(0x01)
	Unknown bAbsoluteRotation; // 0x1d8(0x01)
	Unknown bAbsoluteScale; // 0x188(0x01)
	Unknown bVisible; // 0xc8(0x01)
	Unknown bShouldBeAttached; // 0x220(0x01)
	Unknown bShouldSnapLocationWhenAttached; // 0x1b0(0x01)
	Unknown bShouldSnapRotationWhenAttached; // 0x188(0x01)
	Unknown bShouldUpdatePhysicsVolume; // 0x1a0(0x01)
	Unknown bHiddenInGame; // 0x220(0x01)
	Unknown bBoundsChangeTriggersStreamingDataRebuild; // 0xc8(0x01)
	Unknown bUseAttachParentBound; // 0x1d8(0x01)
	Unknown Mobility; // 0x221(0x01)
	Unknown DetailMode; // 0x160(0x01)
	struct FMulticastSparseDelegate PhysicsVolumeChangedDelegate; // 0xb0(0x01)

	void CheckNumeric(struct FString CheckString, Unknown& CheckResult); // CheckNumeric U.U.CheckNumeric // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
	void SetPosition(int32_t Position_); // SetPosition LowEntryExtendedStandar.LowEntryBitDataReader.SetPosition // (Final|Native|Public|BlueprintCallable) // <Game+0x1060c70>
	void AddStringUtf8Array(Unknown& Value); // AddStringUtf8Array LowEntryExtendedStandar.LowEntryBitDataWriter.AddStringUtf8Array // (Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x105fe00>
	void SetPosition(int32_t Position_); // SetPosition LowEntryExtendedStandar.LowEntryByteDataReader.SetPosition // (Final|Native|Public|BlueprintCallable) // <Game+0x10764e0>
	void AddStringUtf8Array(Unknown& Value); // AddStringUtf8Array LowEntryExtendedStandar.LowEntryByteDataWriter.AddStringUtf8Array // (Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x1066820>
	void SetBytes(Unknown& ByteArray, int32_t Index, int32_t Length); // SetBytes LowEntryExtendedStandar.LowEntryDouble.SetBytes // (Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x1076130>
	Unknown XboxOnePlatform(); // XboxOnePlatform LowEntryExtendedStandar.LowEntryExtendedStandardLibrary.XboxOnePlatform // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // <Game+0x10668f0>
	void WaitTillDone(Unknown WorldContextObject, Unknown LatentInfo, Unknown& Result_); // WaitTillDone LowEntryExtendedStandar.LowEntryLatentActionBoolean.WaitTillDone // (Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x107afb0>
	void WaitTillDone(Unknown WorldContextObject, Unknown LatentInfo, float& Result_); // WaitTillDone LowEntryExtendedStandar.LowEntryLatentActionFloat.WaitTillDone // (Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x107b0f0>
	void WaitTillDone(Unknown WorldContextObject, Unknown LatentInfo, int32_t& Result_); // WaitTillDone LowEntryExtendedStandar.LowEntryLatentActionInteger.WaitTillDone // (Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x107b230>
	void WaitTillDone(Unknown WorldContextObject, Unknown LatentInfo); // WaitTillDone LowEntryExtendedStandar.LowEntryLatentActionNone.WaitTillDone // (Final|Native|Public|BlueprintCallable) // <Game+0x107b370>
	void WaitTillDone(Unknown WorldContextObject, Unknown LatentInfo, Unknown& Result_); // WaitTillDone LowEntryExtendedStandar.LowEntryLatentActionObject.WaitTillDone // (Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x107b460>
	void WaitTillDone(Unknown WorldContextObject, Unknown LatentInfo, struct FString& Result_); // WaitTillDone LowEntryExtendedStandar.LowEntryLatentActionString.WaitTillDone // (Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x107b5a0>
	void SetBytes(Unknown& ByteArray, int32_t Index, int32_t Length); // SetBytes LowEntryExtendedStandar.LowEntryLong.SetBytes // (Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x1076130>
	struct FString ToString(); // ToString LowEntryExtendedStandar.LowEntryParsedHashcash.ToString // (Final|Native|Public|BlueprintCallable|BlueprintPure) // <Game+0x107af30>
	void WeldVertices(Unknown& VertexIDs, Unknown& OutNewVertexID); // WeldVertices EditableMesh.EditableMesh.WeldVertices // (Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x176f9f0>
	Unknown MakeEditableMesh(Unknown PrimitiveComponent, int32_t LODIndex); // MakeEditableMesh EditableMesh.EditableMeshFactory.MakeEditableMesh // (Final|Native|Static|Public|BlueprintCallable) // <Game+0x1775ee0>
	void SetScopeImageAngle(float NewAngle); // SetScopeImageAngle U.U.SetScopeImageAngle // (BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
	void Set(Unknown IsPingType); // Set SmartPingSystem.SmartPingSystem_C.Set // (Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
	void Get(struct FString& Group); // Get BP.Chat_System_C.Get // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
	void ToggleActive(); // ToggleActive Engine.ActorComponent.ToggleActive // (Native|Public|BlueprintCallable) // <Game+0x337f170>
	void ToggleVisibility(Unknown bPropagateToChildren); // ToggleVisibility Engine.SceneComponent.ToggleVisibility // (Final|Native|Public|BlueprintCallable) // <Game+0x3ddb810>
};

