// SetProperty CoreUObject.SetProperty
// Size: 0x00 (Inherited: 0x70)
struct USetProperty : UProperty {
	None GeometryCollection; // 0x28(0x08)
	None OriginalGeometryCollection; // 0x30(0x08)
	None GeometryCollectionLODIndex; // 0x38(0x04)
	None Adapters; // 0x3b8(0x10)
	None TextureCoordinateCount; // 0x3d0(0x04)
	None PendingCompactCounter; // 0x51c(0x04)
	None SubdivisionCount; // 0x520(0x04)
	None StaticMesh; // 0x28(0x08)
	None OriginalStaticMesh; // 0x30(0x08)
	None StaticMeshLODIndex; // 0x38(0x04)
	None GeneratedMaterials; // 0x30(0x10)
	None GeneratedMeshes; // 0x40(0x10)
	None GeneratedTextures; // 0x50(0x10)
	None ParameterDecorations; // 0xe8(0x10)
	None TextureReuseCache; // 0x108(0x50)
	None ReferencedMaterials; // 0x320(0x10)
	None PhysicsAssetsToMerge; // 0x3d0(0x10)
	None Materials; // 0x28(0x50)
	None Textures; // 0x78(0x50)
	None ReferenceSkeletalMesh; // 0x28(0x08)
	None ReferenceStaticMesh; // 0x30(0x08)
	None Relevancy; // 0x38(0x01)
	None bDisableTextureLayoutManagement; // 0x39(0x01)
	None ReferencedMaterials; // 0x40(0x10)
	None ImageProperties; // 0x50(0x10)
	None GroupNodeMap; // 0x60(0x50)
	None ContributingMorphTargets; // 0xb0(0x10)
	None MorphTargetReconstructionInfo; // 0xc0(0x10)
	None VersionId; // 0xd0(0x10)
	None ParameterProperties; // 0xe0(0x10)
	None ParameterUIDataMap; // 0x140(0x50)
	None StateUIDataMap; // 0x190(0x50)
	None PhysicsAssetsMap; // 0x1e0(0x50)
	None MaskOutCache; // 0x230(0x28)
	None bIsChildObject; // 0x258(0x01)
	None MaskOutCache_HardRef; // 0x260(0x08)
	None CustomizableObject; // 0x28(0x08)
	None SkeletalMesh; // 0x30(0x08)
	None BoolParameters; // 0x38(0x10)
	None IntParameters; // 0x48(0x10)
	None FloatParameters; // 0x58(0x10)
	None TextureParameters; // 0x68(0x10)
	None VectorParameters; // 0x78(0x10)
	None ProjectorParameters; // 0x88(0x10)
	None bBuildParameterDecorations; // 0x98(0x01)
	None UpdatedDelegate; // 0xa0(0x10)
	None SkeletalMeshStatus; // 0x110(0x10)
	None MaterialTags; // 0x140(0x10)
	None PrivateData; // 0x1d0(0x08)
	None Textures; // 0x28(0x10)
	None PendingReleaseSkeletalMesh; // 0x28(0x10)
	None PreviewExternalImageProvider; // 0x48(0x08)
	None ProtectedCachedTextures; // 0x150(0x10)
	None DefaultInstanceLODManagement; // 0x170(0x08)
	None CurrentInstanceLODManagement; // 0x178(0x08)
	None SkippedLastRenderTime; // 0x23c(0x04)
	None CustomizableObjectInstance; // 0x240(0x08)
	None CustomizableSkeletalComponent; // 0x398(0x08)
	None UberGraphFrame; // 0x248(0x08)
	None HorizontalBox_Rarity; // 0x250(0x08)
	None HorizontalBox_Rarity_NotOwn; // 0x258(0x08)
	None Img_BG; // 0x260(0x08)
	None Img_Icon; // 0x268(0x08)
	None RetainerBox_2; // 0x270(0x08)
	None T_CurrentCount; // 0x278(0x08)
	None T_MaxCount; // 0x280(0x08)
	None T_RecipeNum; // 0x288(0x08)
	None WidgetSwitcher_Rarity; // 0x290(0x08)
	None MaterialInfo; // 0x298(0xd0)
	None ItemId; // 0x368(0x04)
	None MaxCount; // 0x36c(0x04)
	None CurrentCount; // 0x370(0x04)
	None UberGraphFrame; // 0x268(0x08)
	None BT_UserName; // 0x270(0x08)
	None CP_Main; // 0x278(0x08)
	None HB_ItemInfo; // 0x280(0x08)
	None Image_264; // 0x288(0x08)
	None Image_265; // 0x290(0x08)
	None Image_1163; // 0x298(0x08)
	None IMG_Frontbar; // 0x2a0(0x08)
	None IMG_Item; // 0x2a8(0x08)
	None Img_TeamColor; // 0x2b0(0x08)
	None PB_HP; // 0x2b8(0x08)
	None PB_ItemCasting; // 0x2c0(0x08)
	None PB_Message; // 0x2c8(0x08)
	None SizeBox_Message; // 0x2d0(0x08)
	None Switcher_Casting; // 0x2d8(0x08)
	None T_Item; // 0x2e0(0x08)
	None T_Message; // 0x2e8(0x08)
	None T_Quantity; // 0x2f0(0x08)
	None T_TeamNum; // 0x2f8(0x08)
	None T_UserName; // 0x300(0x08)
	None PlayerState; // 0x308(0x08)
	None ReplayController; // 0x310(0x08)
	None TargetCharacter; // 0x318(0x08)
	None MaxViewportSize; // 0x320(0x08)
	None LocalScreenPosition; // 0x328(0x08)
	None IsPositionUpdated; // 0x330(0x01)
	None DefaultCharacterZLocation; // 0x334(0x04)
	None TargetPawn; // 0x338(0x08)
	None Params; // 0xe0(0x30)
	None AnimationSections; // 0x58(0x10)

	void SetStaticGestureConfidenceThreshold(None Gesture, None Confidence); // SetStaticGestureConfidenceThreshold MagicLeapHandTracking.MagicLeapHandTrackingFunctionLibrary.SetStaticGestureConfidenceThreshold // (Final|Native|Static|Public|BlueprintCallable) // <Game+0x17e7cb0>
	void WeldVertices(None& VertexIDs, None& OutNewVertexID); // WeldVertices EditableMesh.EditableMesh.WeldVertices // (Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x1770a30>
	None MakeEditableMesh(None PrimitiveComponent, None LODIndex); // MakeEditableMesh EditableMesh.EditableMeshFactory.MakeEditableMesh // (Final|Native|Static|Public|BlueprintCallable) // <Game+0x1776fd0>
	void UnloadMaskOutCache(); // UnloadMaskOutCache CustomizableObject.CustomizableObject.UnloadMaskOutCache // (Final|Native|Public|BlueprintCallable) // <Game+0x10384d0>
	void UpdateSkeletalMeshAsync(None bIgnoreCloseDist, None bForceHighPriority); // UpdateSkeletalMeshAsync CustomizableObject.CustomizableObjectInstance.UpdateSkeletalMeshAsync // (Final|Native|Public|BlueprintCallable) // <Game+0x10384f0>
	void SetReleaseMutableTexturesImmediately(None bReleaseTextures); // SetReleaseMutableTexturesImmediately CustomizableObject.CustomizableObjectSystem.SetReleaseMutableTexturesImmediately // (Final|Native|Public|BlueprintCallable) // <Game+0x103cb50>
	void UpdateSkeletalMeshAsync(None bNeverSkipUpdate); // UpdateSkeletalMeshAsync CustomizableObject.CustomizableSkeletalComponent.UpdateSkeletalMeshAsync // (Final|Native|Public|BlueprintCallable) // <Game+0x103cbe0>
	void DelegatedCallback(None Instance); // DelegatedCallback CustomizableObject.InstanceUpdatedHelper.DelegatedCallback // (Final|Native|Public) // <Game+0x103c930>
	void SetNotOwnRarityVisibility(None Rarity); // SetNotOwnRarityVisibility UW-Lobby_Craft_Recipe_Item.UW-Lobby_Craft_Recipe_Item_C.SetNotOwnRarityVisibility // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23ad490>
	void SetEquippedWeapon(None& SUCCESS); // SetEquippedWeapon UW_ReplayUserNameTooltip.UW_ReplayUserNameTooltip_C.SetEquippedWeapon // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23ad490>
	void ExecuteUbergraph(None EntryPoint); // ExecuteUbergraph CoreUObject.Object.ExecuteUbergraph // (Event|Public|BlueprintEvent) // <Game+0x23ad490>
};

