// WidgetBlueprintGeneratedClass SettingMainWidget.SettingMainWidget_C
struct USettingMainWidget_C : UBravoHotelSettingWidget {
	struct Unknown UberGraphFrame; //  0x3d8 Size(8)
	struct Unknown ; //  0x3e0 Size(8)
	struct Unknown ; //  0x3e8 Size(8)
	struct Unknown ; //  0x3f0 Size(8)
	struct Unknown ApplyButton; //  0x3f8 Size(8)
	struct Unknown Audio; //  0x400 Size(8)
	struct Unknown CanvasPanel_61; //  0x408 Size(8)
	struct Unknown CanvasPanel_279; //  0x410 Size(8)
	struct Unknown ChangeLock; //  0x418 Size(8)
	struct Unknown Control; //  0x420 Size(8)
	struct Unknown CrossHair; //  0x428 Size(8)
	struct Unknown CrossHairDetailInfo; //  0x430 Size(8)
	struct Unknown CrossHairDetailInfo_2; //  0x438 Size(8)
	struct Unknown CrossHairDetailInfo_3; //  0x440 Size(8)
	struct Unknown CrossHairDetailInfo_4; //  0x448 Size(8)
	struct Unknown CurDesc; //  0x450 Size(8)
	struct Unknown CurDesc2; //  0x458 Size(8)
	struct Unknown CurTitle; //  0x460 Size(8)
	struct Unknown DefaultButton; //  0x468 Size(8)
	struct Unknown Dev; //  0x470 Size(8)
	struct Unknown GamePlay; //  0x478 Size(8)
	struct Unknown GoBackButton; //  0x480 Size(8)
	struct Unknown Graphic; //  0x488 Size(8)
	struct Unknown Image; //  0x490 Size(8)
	struct Unknown Image_2; //  0x498 Size(8)
	struct Unknown Image_3; //  0x4a0 Size(8)
	struct Unknown Image_4; //  0x4a8 Size(8)
	struct Unknown Image_109; //  0x4b0 Size(8)
	struct Unknown Image_128; //  0x4b8 Size(8)
	struct Unknown Image_129; //  0x4c0 Size(8)
	struct Unknown Image_154; //  0x4c8 Size(8)
	struct Unknown Image_323; //  0x4d0 Size(8)
	struct Unknown Image_417; //  0x4d8 Size(8)
	struct Unknown Image_951; //  0x4e0 Size(8)
	struct Unknown Image_953; //  0x4e8 Size(8)
	struct Unknown Key; //  0x4f0 Size(8)
	struct Unknown KeyImageMain; //  0x4f8 Size(8)
	struct Unknown ProgressBar_317; //  0x500 Size(8)
	struct Unknown Slider_299; //  0x508 Size(8)
	struct Unknown TextBlock; //  0x510 Size(8)
	struct Unknown TextBlock_1; //  0x518 Size(8)
	struct Unknown TextBlock_2; //  0x520 Size(8)
	struct Unknown TextBlock_3; //  0x528 Size(8)
	struct Unknown TextBlock_5; //  0x530 Size(8)
	struct Unknown TextBlock_7; //  0x538 Size(8)
	struct Unknown VerticalBox_149; //  0x540 Size(8)
	struct Unknown WidgetSwitcher_113; //  0x548 Size(8)
	struct FMulticastInlineDelegate EnableButtonEventDispatcher; //  0x550 Size(10)
	struct Unknown Game; //  0x560 Size(8)
	struct TMap<{}, {}>Unknown SlotList_1; //  0x568 Size(50)
	struct Unknown GraphicWidget; //  0x5b8 Size(8)
	struct Unknown AudioWidget; //  0x5c0 Size(8)
	struct Unknown ControlWidget; //  0x5c8 Size(8)
	struct Unknown KeyWidget; //  0x5d0 Size(8)
	struct Unknown GamePlayWidget; //  0x5d8 Size(8)
	struct Unknown SettingDevWidget; //  0x5e0 Size(8)
	int32_t GraphicSwitcherIndex; //  0x5e8 Size(4)
	int32_t AudioSwitcherIndex; //  0x5ec Size(4)
	int32_t ControlSwitcherIndex; //  0x5f0 Size(4)
	int32_t KeySwitcherIndex; //  0x5f4 Size(4)
	int32_t SettingDevSwitcherIndex; //  0x5f8 Size(4)
	int32_t GamePlaySwitcherIndex; //  0x5fc Size(4)
	struct Unknown KeyNotiTimer; //  0x600 Size(8)
	float KeyNotiMessageShowTime; //  0x608 Size(4)
	struct TSoftObjectPtr<Unknown> TempImg; //  0x610 Size(28)
	struct Unknown SavedDescData; //  0x638 Size(8)

	void CreateWidgetImpl(struct Unknown* WidgetClass, struct Unknown& OutWidget, int32_t& OutSwitcherIndex, int32_t& RealIndex); // Function SettingMainWidget.SettingMainWidget_C.CreateWidgetImpl(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

