// UserDefinedEnum Setting.ConfirmPopupType
enum class ConfirmPopupType : uint8_t {
	ConfirmPopupType = 0,
	ConfirmPopupType = 1,
	ConfirmPopupType = 2,
	ConfirmPopupType = 3,
	ConfirmPopupType = 4,
	ConfirmPopupType = 5,
};

// WidgetBlueprintGeneratedClass Setting.SubTitleSlotWidget_C
class USubTitleSlotWidget_C : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Image; // 0x250 (8)
	struct Unknown Image_2; // 0x258 (8)
	struct Unknown Image_4; // 0x260 (8)
	struct Unknown Image_5; // 0x268 (8)
	struct Unknown Image_6; // 0x270 (8)
	struct Unknown Image_473; // 0x278 (8)
	struct Unknown TextBlock_1; // 0x280 (8)
	struct FText Title; // 0x288 (24)

	void Construct(); // Function Setting.SubTitleSlotWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Set(enum class Unknow SubType); // Function Setting.SubTitleSlotWidget_C.Set(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_SubTitleSlotWidget(int32_t EntryPoint); // Function Setting.SubTitleSlotWidget_C.ExecuteUbergraph_SubTitleSlotWidget(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Setting.selectTypeBtn_C
class UselectTypeBtn_C : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Button_43; // 0x250 (8)
	struct Unknown Image_43; // 0x258 (8)
	struct FMulticastInlineDelegate SelectEventDispatcher; // 0x260 (16)
	int32_t Index; // 0x270 (4)

	void BndEvt__Button_42_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignatu(); // Function Setting.selectTypeBtn_C.BndEvt__Button_42_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignatu(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SelectIndex(int32_t Index); // Function Setting.selectTypeBtn_C.SelectIndex(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_selectTypeBtn(int32_t EntryPoint); // Function Setting.selectTypeBtn_C.ExecuteUbergraph_selectTypeBtn(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SelectEventDispatcher__DelegateSignature(int32_t Index); // Function Setting.selectTypeBtn_C.SelectEventDispatcher__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Setting.KeyImageWidget_C
class UKeyImageWidget_C : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Alt; // 0x250 (8)
	struct Unknown Alt; // 0x258 (8)
	struct Unknown Ctrl; // 0x260 (8)
	struct Unknown Ctrl; // 0x268 (8)
	struct Unknown HorizontalBox_169; // 0x270 (8)
	struct Unknown Key; // 0x278 (8)
	struct Unknown ScaleBox_1; // 0x280 (8)
	struct Unknown Shift; // 0x288 (8)
	struct Unknown Shift; // 0x290 (8)
	char Horizontal; // 0x298 (1)
	char vertical; // 0x299 (1)
	char UsingAlphaBg : 0; // 0x29A (1)
	enum class Unknow PreKeyType; // 0x29B (1)
	struct Unknown PreKeyMappingData; // 0x2A0 (40)
	char UsingKeyMappingData : 0; // 0x2C8 (1)
	float DefaultScale; // 0x2CC (4)
	char OverrideFontSize : 0; // 0x2D0 (1)
	int32_t FontSize; // 0x2D4 (4)

	void SetFontSize(char Override); // Function Setting.KeyImageWidget_C.SetFontSize(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetKeyNameFromKey(struct Unknown Key, struct FString& Name, char& bRet); // Function Setting.KeyImageWidget_C.GetKeyNameFromKey(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Set(struct Unknown Key); // Function Setting.KeyImageWidget_C.Set(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Set(struct Unknown AxisKey); // Function Settinge.KeyImageWidget_C.Set(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetInfo(struct Unknown Key, char Shift, char Alt, char Ctrl); // Function Setting.KeyImageWidget_C.SetInfo(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetEmpty(); // Function Setting.KeyImageWidget_C.SetEmpty(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function Setting.KeyImageWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetInfoFromActionKeyMap(struct Unknown ActionKeyMap); // Function Setting.KeyImageWidget_C.SetInfoFromActionKeyMap(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetKeyType(enum class Unknow KeyType); // Function Setting.KeyImageWidget_C.SetKeyType(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PreConstruct(char IsDesignTime); // Function Setting.KeyImageWidget_C.PreConstruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RefreshKey(); // Function Setting.KeyImageWidget_C.RefreshKey(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_KeyImageWidget(int32_t EntryPoint); // Function Setting.KeyImageWidget_C.ExecuteUbergraph_KeyImageWidget(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Setting.ComboBoxText_C
class UComboBoxText_C : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Button_43; // 0x250 (8)
	struct Unknown Image_269; // 0x258 (8)
	struct Unknown TextBlock_67; // 0x260 (8)
	struct FText Text; // 0x268 (24)

	struct Unknown NewFunction_1(); // Function Setting.ComboBoxText_C.NewFunction_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_42_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // Function Setting.ComboBoxText_C.BndEvt__Button_42_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetColor(struct Unknown Color); // Function Setting.ComboBoxText_C.SetColor(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_ComboBoxText(int32_t EntryPoint); // Function Setting.ComboBoxText_C.ExecuteUbergraph_ComboBoxText(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Setting.WB_ClassicSettingsText_C
class UWB_ClassicSettingsText_C : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown TextField; // 0x250 (8)
	struct FText Text; // 0x258 (24)

	void Construct(); // Function Setting.WB_ClassicSettingsText_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Update(struct FText Text); // Function Setting.WB_ClassicSettingsText_C.Update(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_WB_ClassicSettingsText(int32_t EntryPoint); // Function Setting.WB_ClassicSettingsText_C.ExecuteUbergraph_WB_ClassicSettingsText(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Setting.ArrowBtn_C
class UArrowBtn_C : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Button_68; // 0x250 (8)
	struct Unknown Normal; // 0x258 (8)
	struct Unknown Over; // 0x260 (8)
	struct Unknown Overlay_113; // 0x268 (8)
	struct Unknown Press; // 0x270 (8)
	struct FMulticastInlineDelegate CilckBtn; // 0x278 (16)
	char IsLeft : 0; // 0x288 (1)

	void Construct(); // Function Settingure.ArrowBtn_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_67_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignatu(); // Function Setting.ArrowBtn_C.BndEvt__Button_67_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignatu(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_67_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignatu(); // Function Setting.ArrowBtn_C.BndEvt__Button_67_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignatu(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_67_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(); // Function Setting.ArrowBtn_C.BndEvt__Button_67_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_67_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(); // Function Setting.ArrowBtn_C.BndEvt__Button_67_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_67_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature(); // Function Setting.ArrowBtn_C.BndEvt__Button_67_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_ArrowBtn(int32_t EntryPoint); // Function Setting.ArrowBtn_C.ExecuteUbergraph_ArrowBtn(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CilckBtn__DelegateSignature(); // Function Setting.ArrowBtn_C.CilckBtn__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Setting.ButtomButtonWidget_C
class UButtomButtonWidget_C : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown ApplyBtn; // 0x250 (8)
	struct Unknown ApplyDisable; // 0x258 (8)
	struct Unknown ApplyNormalBg; // 0x260 (8)
	struct Unknown ApplyOverBg; // 0x268 (8)
	struct Unknown ApplyPressBg; // 0x270 (8)
	struct Unknown Button_31; // 0x278 (8)
	struct Unknown Lock; // 0x280 (8)
	struct Unknown NormalBg; // 0x288 (8)
	struct Unknown NormalBtn; // 0x290 (8)
	struct Unknown OverBG; // 0x298 (8)
	struct Unknown PressBg; // 0x2A0 (8)
	struct Unknown Title_Text; // 0x2A8 (8)
	struct FText Title; // 0x2B0 (24)
	struct FMulticastInlineDelegate OnClickEventDispatcher; // 0x2C8 (16)
	char IsDisableBnt : 0; // 0x2D8 (1)
	int32_t CurType; // 0x2DC (4)
	char ColorType : 0; // 0x2E0 (1)
	char Applytype : 0; // 0x2E1 (1)
	char NewVar_1 : 0; // 0x2E2 (1)

	void Set(char IsDisable); // Function Setting.ButtomButtonWidget_C.Set(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_30_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature(); // Function Setting.ButtomButtonWidget_C.BndEvt__Button_30_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_30_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignatu(); // Function Setting.ButtomButtonWidget_C.BndEvt__Button_30_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignatuur(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_30_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // Function Setting.ButtomButtonWidget_C.BndEvt__Button_30_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_30_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Function Setting.ButtomButtonWidget_C.BndEvt__Button_30_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_30_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignatu(); // Function Setting.ButtomButtonWidget_C.BndEvt__Button_30_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignatu(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetState(int32_t Type, int32_t Selection); // Function Setting.ButtomButtonWidget_C.SetState(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetColortype(char ColorType); // Function Setting.ButtomButtonWidget_C.SetColortype(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function Setting.ButtomButtonWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_ButtomButtonWidget(int32_t EntryPoint); // Function Setting.ButtomButtonWidget_C.ExecuteUbergraph_ButtomButtonWidget(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnClickEventDispatcher__DelegateSignature(struct Unknown Widget); // Function Setting.ButtomButtonWidget_C.OnClickEventDispatcher__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass SettingonLibrary.WB_ToolTipDesign_C
class UWB_ToolTipDesign_C : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct FText My; // 0x250 (24)

	void Set(struct FText Tool, char& ); // Function Setting.WB_ToolTipDesign_C.Set(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function Setting.WB_ToolTipDesign_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_WB_ToolTipDesign(int32_t EntryPoint); // Function Setting.WB_ToolTipDesign_C.ExecuteUbergraph_WB_ToolTipDesign(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Setting.WB_ClassicComboBoxItem_C
class UWB_ClassicComboBoxItem_C : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown TextComboBoxItem; // 0x250 (8)
	struct Unknown WB_ClassicComboBoxButton; // 0x258 (8)
	struct FString ItemOption; // 0x260 (16)
	struct Unknown Resolution; // 0x270 (8)

	void Construct(); // Function Setting.WB_ClassicComboBoxItem_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_WB_ClassicComboBoxItem(int32_t EntryPoint); // Function Setting.WB_ClassicComboBoxItem_C.ExecuteUbergraph_WB_ClassicComboBoxItem(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Settingm.SettingDevWidget_C
class USettingDevWidget_C : public UBravoHotelSettingSubWidget {

public:

	struct Unknown UberGraphFrame; // 0x298 (8)
	struct Unknown ButtonGod; // 0x2A0 (8)
	struct Unknown Dev; // 0x2A8 (8)
	struct Unknown ScrollBox_55; // 0x2B0 (8)

	void Construct(); // Function Setting.SettingDevWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ButtonOpenCheat_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function Setting.SettingDevWidget_C.BndEvt__ButtonOpenCheat_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_SettingDevWidget(int32_t EntryPoint); // Function Setting.SettingDevWidget_C.ExecuteUbergraph_SettingDevWidget(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Setting.SettingSubButtonWidget_C
class USettingSubButtonWidget_C : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Border; // 0x250 (8)
	struct Unknown Button_222; // 0x258 (8)
	struct Unknown Image_192; // 0x260 (8)
	struct Unknown Title_Text; // 0x268 (8)
	int32_t Index; // 0x270 (4)
	struct Unknown DeActive; // 0x274 (16)
	struct Unknown Active; // 0x284 (16)
	struct FMulticastInlineDelegate ClickEventDispatcher; // 0x298 (16)
	struct FText Title; // 0x2A8 (24)
	enum class Unknow Type; // 0x2C0 (1)
	char IsActive : 0; // 0x2C1 (1)
	struct Unknown Over; // 0x2C4 (16)

	void Click(int32_t Index, enum class Unknow Type); // Function Setting.SettingSubButtonWidget_C.Click(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function Setting.SettingSubButtonWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_221_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function Setting.SettingSubButtonWidget_C.BndEvt__Button_221_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_221_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Function Setting.SettingSubButtonWidget_C.BndEvt__Button_221_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_221_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(); // Function Setting.SettingSubButtonWidget_C.BndEvt__Button_221_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateText(); // Function Setting.SettingSubButtonWidget_C.UpdateText(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_SettingSubButtonWidget(int32_t EntryPoint); // Function Setting.SettingSubButtonWidget_C.ExecuteUbergraph_SettingSubButtonWidget(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ClickEventDispatcher__DelegateSignature(int32_t Index, enum class Unknow Type); // Function Setting.SettingSubButtonWidget_C.ClickEventDispatcher__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Setting.GraphicWidget_C
class UGraphicWidget_C : public UBravoHotelSettingSubWidget {

public:

	struct Unknown UberGraphFrame; // 0x298 (8)
	struct Unknown Anti; // 0x2A0 (8)
	struct Unknown display; // 0x2A8 (8)
	struct Unknown DisplayMode; // 0x2B0 (8)
	struct Unknown DLSS; // 0x2B8 (8)
	struct Unknown DOF; // 0x2C0 (8)
	struct Unknown Effect; // 0x2C8 (8)
	struct Unknown Foliage; // 0x2D0 (8)
	struct Unknown FOV; // 0x2D8 (8)
	struct Unknown FSR; // 0x2E0 (8)
	struct Unknown LanguageSetting; // 0x2E8 (8)
	struct Unknown MaxFrameRate; // 0x2F0 (8)
	struct Unknown MaxLobbyFrameRate; // 0x2F8 (8)
	struct Unknown PP; // 0x300 (8)
	struct Unknown Reflex; // 0x308 (8)
	struct Unknown Resolution; // 0x310 (8)
	struct Unknown ResolutionScaling; // 0x318 (8)
	struct Unknown ScrollBox_55; // 0x320 (8)
	struct Unknown Shading; // 0x328 (8)
	struct Unknown Shadow; // 0x330 (8)
	struct Unknown Sharpen; // 0x338 (8)
	struct Unknown SlotItemWidget_C_1; // 0x340 (8)
	struct Unknown Smooth; // 0x348 (8)
	struct Unknown SubTitleSlotWidget; // 0x350 (8)
	struct Unknown Texture; // 0x358 (8)
	struct Unknown v; // 0x360 (8)
	struct Unknown ViewDistance; // 0x368 (8)
	struct Unknown ; // 0x370 (8)
	struct Unknown ; // 0x378 (8)
	float OldDisplayModeValue; // 0x380 (4)
	float OldDisplayResolutionValue; // 0x384 (4)
	struct Unknown ScrollBarTimer; // 0x388 (8)

	void CustomEvent_1(struct Unknown Value); // Function Setting.GraphicWidget_C.CustomEvent_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function SettingF1.GraphicWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ScrollBox_54_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature(float CurrentOffset); // Function Setting.GraphicWidget_C.BndEvt__ScrollBox_54_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent(); // Function Setting.GraphicWidget_C.CustomEvent(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_GraphicWidget(int32_t EntryPoint); // Function Setting.GraphicWidget_C.ExecuteUbergraph_GraphicWidget(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Setting.WB_ClassicComboBoxButton_C
class UWB_ClassicComboBoxButton_C : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown VisualNoninteractButton; // 0x250 (8)
	struct Unknown Original; // 0x258 (632)

	struct Unknown OnMouseButtonUp(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Setting.WB_ClassicComboBoxButton_C.OnMouseButtonUp(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnMouseButtonDown(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Setting42926D5g.WB_ClassicComboBoxButton_C.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function Setting.WB_ClassicComboBoxButton_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Setting.WB_ClassicComboBoxButton_C.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function Setting.WB_ClassicComboBoxButton_C.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_WB_ClassicComboBoxButton(int32_t EntryPoint); // Function Setting.WB_ClassicComboBoxButton_C.ExecuteUbergraph_WB_ClassicComboBoxButton(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Setting.WB_ClassicToolTipDesign_C
class UWB_ClassicToolTipDesign_C : public UWB_ToolTipDesign_C {

public:

	struct Unknown UberGraphFrame; // 0x268 (8)
	struct Unknown ToolTipVerticalList; // 0x270 (8)

	void Set(struct FText Tool, char& ); // Function Setting.WB_ClassicToolTipDesign_C.Set(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function Setting.WB_ClassicToolTipDesign_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_WB_ClassicToolTipDesign(int32_t EntryPoint); // Function Setting.WB_ClassicToolTipDesign_C.ExecuteUbergraph_WB_ClassicToolTipDesign(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Setting.SlotItemWidget_C
class USlotItemWidget_C : public UBravoHotelSettingSlotWidget {

public:

	struct Unknown UberGraphFrame; // 0x4E8 (8)
	struct Unknown Over; // 0x4F0 (8)
	struct Unknown Button_107; // 0x4F8 (8)
	struct Unknown Button_441; // 0x500 (8)
	struct Unknown Button_Type; // 0x508 (8)
	struct Unknown ButtonType; // 0x510 (8)
	struct Unknown ComboBoxString_237; // 0x518 (8)
	struct Unknown ComboBoxType; // 0x520 (8)
	struct Unknown Down; // 0x528 (8)
	struct Unknown EditableText_80; // 0x530 (8)
	struct Unknown HorizontalBox_191; // 0x538 (8)
	struct Unknown Image_153; // 0x540 (8)
	struct Unknown Image_204; // 0x548 (8)
	struct Unknown Image_414; // 0x550 (8)
	struct Unknown Key; // 0x558 (8)
	struct Unknown KeyImageMain; // 0x560 (8)
	struct Unknown KeyImageSub; // 0x568 (8)
	struct Unknown KeyLock; // 0x570 (8)
	struct Unknown LeftA; // 0x578 (8)
	struct Unknown LeftA_2; // 0x580 (8)
	struct Unknown LockMain; // 0x588 (8)
	struct Unknown LockSub; // 0x590 (8)
	struct Unknown MainBG; // 0x598 (8)
	struct Unknown MainKeyInput; // 0x5A0 (8)
	struct Unknown Overlay_215; // 0x5A8 (8)
	struct Unknown ProgressBar_150; // 0x5B0 (8)
	struct Unknown RightA; // 0x5B8 (8)
	struct Unknown RightA_2; // 0x5C0 (8)
	struct Unknown SelectBtn1; // 0x5C8 (8)
	struct Unknown SelectBtn2; // 0x5D0 (8)
	struct Unknown SelectBtn3; // 0x5D8 (8)
	struct Unknown SelectBtn4; // 0x5E0 (8)
	struct Unknown SelectBtn5; // 0x5E8 (8)
	struct Unknown SelectBtn6; // 0x5F0 (8)
	struct Unknown SelectType; // 0x5F8 (8)
	struct Unknown SelectValue; // 0x600 (8)
	struct Unknown Slider_139; // 0x608 (8)
	struct Unknown SliderType; // 0x610 (8)
	struct Unknown SubBG; // 0x618 (8)
	struct Unknown SubKeyInput; // 0x620 (8)
	struct Unknown T_Button; // 0x628 (8)
	struct Unknown Title_Text; // 0x630 (8)
	struct Unknown Up; // 0x638 (8)
	struct Unknown Value; // 0x640 (8)
	struct Unknown Value_2; // 0x648 (8)
	struct Unknown WidgetSwitcher_1; // 0x650 (8)
	struct Unknown WidgetSwitcher_281; // 0x658 (8)
	char Lock : 0; // 0x660 (1)
	int32_t Selected; // 0x664 (4)
	int32_t TotalListSize; // 0x668 (4)
	struct TArray<Unknown> Empty; // 0x670 (16)
	struct Unknown ButtonStyle; // 0x680 (632)
	struct Unknown NewVar_1; // 0x8F8 (112)
	char SliderIsInit : 0; // 0x968 (1)
	struct FText EmptyText; // 0x970 (24)
	int32_t TempSaveComboBoxIndex; // 0x988 (4)
	struct Unknown Temp; // 0x990 (32)
	float TempValue; // 0x9B0 (4)
	struct FText PreSliderText; // 0x9B8 (24)
	struct FString LResultString; // 0x9D0 (16)
	char have : 0; // 0x9E0 (1)
	char IsOnEditableText : 0; // 0x9E1 (1)
	char CompletSettingData : 0; // 0x9E2 (1)
	struct Unknown CompleteSettingInfo; // 0x9E8 (136)
	struct Unknown TempSetting; // 0xA70 (136)
	char ReMarkComboBox : 0; // 0xAF8 (1)

	void GetOrgKey(char IsSubKey, struct Unknown& Key); // Function Setting.SlotItemWidget_C.GetOrgKey(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetCurKey(char IsSubKey, struct Unknown& Key); // Function Setting.SlotItemWidget_C.GetCurKey(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnKeyUp(struct Unknown MyGeometry, struct Unknown InKeyEvent); // Function Setting.SlotItemWidget_C.OnKeyUp(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckMinMaxValue(float CheckValue, struct FString& RetString); // Function Setting.SlotItemWidget_C.CheckMinMaxValue(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckConvertFloatToString(float Value, struct FString& Ret); // Function Setting.SlotItemWidget_C.CheckConvertFloatToString(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetEnable(char State); // Function Setting.SlotItemWidget_C.SetEnable(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetSliderValue(float InputValue, float& OutValue); // Function Setting.SlotItemWidget_C.SetSliderValue(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetKeyNameFromKey(struct Unknown Key, struct FString& Name); // Function Setting.SlotItemWidget_C.GetKeyNameFromKey(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnGenerateWidget_1(struct FString Item); // Function Setting.SlotItemWidget_C.OnGenerateWidget_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function Setting.SlotItemWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_106_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // Function Setting.SlotItemWidget_C.BndEvt__Button_106_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_106_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Function Setting.SlotItemWidget_C.BndEvt__Button_106_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Slider_138_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature(float Value); // Function Setting.SlotItemWidget_C.BndEvt__Slider_138_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetValue(float Value); // Function Setting.SlotItemWidget_C.SetValue(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ComboBoxString_236_K2Node_ComponentBoundEvent_3_OnOpeningEvent__Delegate(); // Function Setting.SlotItemWidget_C.BndEvt__ComboBoxString_236_K2Node_ComponentBoundEvent_3_OnOpeningEvent__Delegate(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ComboBoxString_236_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature(struct FString SelectedItem, char SelectionType); // Function Setting.SlotItemWidget_C.BndEvt__ComboBoxString_236_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Slider_138_K2Node_ComponentBoundEvent_5_OnMouseCaptureBeginEvent__DelegateSignature(); // Function Setting.SlotItemWidget_C.BndEvt__Slider_138_K2Node_ComponentBoundEvent_5_OnMouseCaptureBeginEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Slider_138_K2Node_ComponentBoundEvent_7_OnMouseCaptureEndEvent__Delegate(); // Function Setting.SlotItemWidget_C.BndEvt__Slider_138_K2Node_ComponentBoundEvent_7_OnMouseCaptureEndEvent__Delegate(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Broadcast(float ValueIndex); // Function Setting.SlotItemWidget_C.Broadcast(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void InitDataByKeyInfo(char IsSub, struct Unknown& Index, char IsInit); // Function Setting.SlotItemWidget_C.InitDataByKeyInfo(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__MainKeyInput_K2Node_ComponentBoundEvent_19_O(struct Unknown SelectedKey); // Function Setting.SlotItemWidget_C.BndEvt__MainKeyInput_K2Node_ComponentBoundEvent_19_(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__SubKeyInput_K2Node_ComponentBoundEvent_20_OnKeySelected__DelegateSignature(struct Unknown SelectedKey); // Function Setting.SlotItemWidget_C.BndEvt__SubKeyInput_K2Node_ComponentBoundEvent_20_OnKeySelected__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__MainKeyInput_K2Node_ComponentBoundEvent_10_Ot(); // Function Setting.SlotItemWidget_C.BndEvt__MainKeyInput_K2Node_ComponentBoundEvent_10_Ot(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__SubKeyInput_K2Node_ComponentBoundEvent_12_OnIsSelectingKeyChanged__DelegateSignature(); // Function Setting.SlotItemWidget_C.BndEvt__SubKeyInput_K2Node_ComponentBoundEvent_12_OnIsSelectingKeyChanged__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPercentValue(float Value); // Function Setting.SlotItemWidget_C.SetPercentValue(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetSelectIndexComboBox(int32_t Index, char BroadcastChange); // Function Setting.SlotItemWidget_C.SetSelectIndexComboBox(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetSelectIndexSelectBox(int32_t Index, char BroadcastChange); // Function Setting.SlotItemWidget_C.SetSelectIndexSelectBox(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void InitDataByAxisKeyInfo(char IsSub, struct Unknown& Index, char IsInit); // Function Setting.SlotItemWidget_C.InitDataByAxisKeyInfo(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SubSelectingKeyChanged(char IsSelectingKey); // Function Setting.SlotItemWidget_C.SubSelectingKeyChanged(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void MainSelectingKeyChanged(char IsSelectingKey); // Function Setting.SlotItemWidget_C.MainSelectingKeyChanged(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__RightA_K2Node_ComponentBoundEvent_11_CilckBtn__DelegateSignature(); // Function Setting.SlotItemWidget_C.BndEvt__RightA_K2Node_ComponentBoundEvent_11_CilckBtn__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__LeftA_K2Node_ComponentBoundEvent_13_CilckBtn__DelegateSignature(); // Function Setting.SlotItemWidget_C.BndEvt__LeftA_K2Node_ComponentBoundEvent_13_CilckBtn__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Type_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(); // Function Setting.SlotItemWidget_C.BndEvt__Button_Type_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResolutionSelected(int32_t Index, int32_t ResolutionX, int32_t ResolutionY); // Function Setting.SlotItemWidget_C.ResolutionSelected(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetDisplayMode(char WindowMode); // Function Setting.SlotItemWidget_C.SetDisplayMode(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ReMakeComboBox(); // Function Setting.SlotItemWidget_C.ReMakeComboBox(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_82_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignatu(); // Function Setting.SlotItemWidget_C.BndEvt__Button_82_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignatu(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (int32_t LanguageIndex); // Function Setting.SlotItemWidget_C.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function Setting.SlotItemWidget_C.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__LeftA_1_K2Node_ComponentBoundEvent_9_CilckBtn__DelegateSignature(); // Function Setting.SlotItemWidget_C.BndEvt__LeftA_1_K2Node_ComponentBoundEvent_9_CilckBtn__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__RightA_1_K2Node_ComponentBoundEvent_14_CilckBtn__DelegateSignature(); // Function Setting.SlotItemWidget_C.BndEvt__RightA_1_K2Node_ComponentBoundEvent_14_CilckBtn__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__EditableText_79_K2Node_ComponentBoundEvent_15_OnEditableTextChangedEvent__DelegateSignature(struct FText& Text); // Function Setting.SlotItemWidget_C.BndEvt__EditableText_79_K2Node_ComponentBoundEvent_15_OnEditableTextChangedEvent__DelegateSignature(HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__EditableText_79_K2Node_ComponentBoundEvent_16_OnEditableTextCommittedEve(struct FText& Text, char CommitMethod); // Function Setting.SlotItemWidget_C.BndEvt__EditableText_79_K2Node_ComponentBoundEvent_16_OnEditableTextCommittedEve(HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_440_K2Node_ComponentBoundEvent_17_OnButtonClickedEvent__DelegateSignature(); // Function Setting.SlotItemWidget_C.BndEvt__Button_440_K2Node_ComponentBoundEvent_17_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (int32_t Index); // Function Setting.SlotItemWidget_C.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetKeyLock(char IsLock); // Function Setting.SlotItemWidget_C.SetKeyLock(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (int32_t LanguageIndex); // Function Setting.SlotItemWidget_C.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetData(); // Function Setting.SlotItemWidget_C.SetData(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_SlotItemWidget(int32_t EntryPoint); // Function Setting.SlotItemWidget_C.ExecuteUbergraph_SlotItemWidget(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Setting.Dev
class UDev : public UBravoHotelSettingSubWidget {

public:

	struct Unknown UberGraphFrame; // 0x298 (8)
	struct Unknown ButtonClearStats; // 0x2A0 (8)
	struct Unknown ButtonDebugVehicle; // 0x2A8 (8)
	struct Unknown ButtonEngine; // 0x2B0 (8)
	struct Unknown ButtonFPS; // 0x2B8 (8)
	struct Unknown ButtonGameplayTick; // 0x2C0 (8)
	struct Unknown ButtonMemory; // 0x2C8 (8)
	struct Unknown ButtonNetwork; // 0x2D0 (8)
	struct Unknown ButtonParticles; // 0x2D8 (8)
	struct Unknown ButtonSceneRendering; // 0x2E0 (8)
	struct Unknown ButtonStatSlow; // 0x2E8 (8)
	struct Unknown ButtonUnitGraph; // 0x2F0 (8)
	struct Unknown ComboBoxViewModes; // 0x2F8 (8)
	struct Unknown ComboBoxViewModes1; // 0x300 (8)
	struct Unknown DeleteSettingsSaveFile; // 0x308 (8)
	struct Unknown GameSpeed; // 0x310 (8)
	struct Unknown GameSpeedEdit; // 0x318 (8)
	struct Unknown HorizontalBox_8; // 0x320 (8)
	struct Unknown HorizontalBox_9; // 0x328 (8)
	struct Unknown HorizontalBox_10; // 0x330 (8)
	struct Unknown HorizontalBox_11; // 0x338 (8)
	struct Unknown HorizontalBox_12; // 0x340 (8)
	struct Unknown HorizontalBox_13; // 0x348 (8)
	struct Unknown PauseGame; // 0x350 (8)
	struct Unknown TemporalAACatmullRomCheck; // 0x358 (8)
	struct Unknown TemporalAACurrentFrameWeightEdit; // 0x360 (8)
	struct Unknown TemporalAAFilterSizeEdit; // 0x368 (8)
	struct Unknown TemporalAAPauseCorrectChek; // 0x370 (8)
	struct Unknown TemporalAASamplesEdit; // 0x378 (8)
	struct Unknown TonemapperSharpenEdit; // 0x380 (8)
	struct Unknown ToolTip_DeleteSettings; // 0x388 (8)
	struct Unknown ToolTip_GameSpeed; // 0x390 (8)
	struct Unknown ToolTip_PauseGame; // 0x398 (8)
	struct Unknown ToolTip_StatCommands; // 0x3A0 (8)
	struct Unknown ToolTip_ViewModes; // 0x3A8 (8)
	struct Unknown ToolTip_ViewModes_2; // 0x3B0 (8)
	struct Unknown Game; // 0x3B8 (8)
	float Time; // 0x3C0 (4)
	struct FText Time; // 0x3C8 (24)
	struct FMulticastInlineDelegate Settings; // 0x3E0 (16)
	struct FMulticastInlineDelegate Pause; // 0x3F0 (16)
	struct FText TemporalAAFilterSizeTextBinding; // 0x400 (24)
	struct FText TemporalAACurrentFrameWeightTextBinding; // 0x418 (24)
	struct FText TemporalAASamplesTextBinding; // 0x430 (24)
	struct FText TonemapperSharpenTextBinding; // 0x448 (24)
	float TemporalAAFilterSizeValue; // 0x460 (4)
	float TemporalAACurrentFrameWeightValue; // 0x464 (4)
	int32_t TemporalAASamplesValue; // 0x468 (4)
	float TonemapperSharpenValue; // 0x46C (4)
	struct FName TempKey; // 0x470 (8)
	struct TMap<Unknown, Unknown> Temp; // 0x478 (80)
	enum class Unknow Type; // 0x4C8 (1)
	float TempValue2; // 0x4CC (4)
	char IsOnDebugVehicle : 0; // 0x4D0 (1)

	struct Unknown Generate(struct FString Item); // Function Setting.Dev.Generate(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Refresh(float Value); // Function Setting.Dev.Refresh(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Refresh(char InIsChecked); // Function Setting.Dev.Refresh(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function Setting.Dev.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__My(float Value); // Function Setting.Dev.BndEvt__My(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__My(char bIsChecked); // Function Setting.Dev.BndEvt__My(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__My(); // Function Setting.Dev.BndEvt__My(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__My(struct FText& Text, char CommitMethod); // Function Setting.Dev.BndEvt__My(HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_248_OnButtonClickedEvent__DelegateSignature(); // Function Setting.Dev.BndEvt__Button_0_K2Node_ComponentBoundEvent_248_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ButtonMemory_K2Node_ComponentBoundEvent_395_OnButtonClickedEvent__DelegateSignature(); // Function Setting.Dev.BndEvt__ButtonMemory_K2Node_ComponentBoundEvent_395_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ButtonNetwork_K2Node_ComponentBoundEvent_0_(); // Function Setting.Dev.BndEvt__ButtonNetwork_K2Node_ComponentBoundEvent_0_(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ButtonParticles_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function Setting.Dev.BndEvt__ButtonParticles_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ButtonStatTick_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function Setting.Dev.BndEvt__ButtonStatTick_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ButtonSceneRendering_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__Delegate(); // Function Setting.Dev.BndEvt__ButtonSceneRendering_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__Delegate(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ButtonInitViews_K2Node_ComponentBoundEvent_591_OnButtonClickedEvent__DelegateSignature(); // Function Setting.Dev.BndEvt__ButtonInitViews_K2Node_ComponentBoundEvent_591_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ButtonEngine_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__Delegate(); // Function Setting.Dev.BndEvt__ButtonEngine_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__Delegate(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__MyComboBox_K2Node_ComponentBoundEvent_128_OnSelectionChangedEvent__DelegateSignature(struct FString SelectedItem, char SelectionType); // Function Setting.Dev.BndEvt__MyComboBox_K2Node_ComponentBoundEvent_128_OnSelectionChangedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ButtonStatSlow_K2Node_ComponentBoundEvent_712_OnButtonClickedEvent__Dele(); // Function Setting.Dev.BndEvt__ButtonStatSlow_K2Node_ComponentBoundEvent_712_OnButtonClickedEvent__Dele(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ButtonClearStats_K2Node_ComponentBoundEvent_739_OnButtonClickedEvent__De(); // Function Setting.Dev.BndEvt__ButtonClearStats_K2Node_ComponentBoundEvent_739_OnButtonClickedEvent__De(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__TemporalAAFilterSizeEdit_K2Node_ComponentBoundEvent_881_OnEditableTextCommittedEvent__De(struct FText& Text, char CommitMethod); // Function Setting.Dev.BndEvt__TemporalAAFilterSizeEdit_K2Node_ComponentBoundEvent_881_OnEditableTextCommittedEvent__De(HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__TemporalAACurrentFrameWeightEdit_K2Node_ComponentBoundEvent_1061_OnEditableTextCommittedEvent__DelegateSignature(struct FText& Text, char CommitMethod); // Function Setting.Dev.BndEvt__TemporalAACurrentFrameWeightEdit_K2Node_ComponentBoundEvent_1061_OnEditableTextCommittedEvent__DelegateSignature(HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__TemporalAASamplesEdit_K2Node_ComponentBoundEvent_1099_OnEditableTextCommittedEvevent__De(struct FText& Text, char CommitMethod); // Function Setting.Dev.BndEvt__TemporalAASamplesEdit_K2Node_ComponentBoundEvent_1099_OnEditableTextCommittedEve(HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__TonemapperSharpenEdit_K2Node_ComponentBoundEvent_1141_OnEditableTextCommittedEve(struct FText& Text, char CommitMethod); // Function Setting.Dev.BndEvt__TonemapperSharpenEdit_K2Node_ComponentBoundEvent_1141_OnEditableTextCommittedEve(HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__TemporalAACatmullRomCheck_K2Node_ComponentBoundEvent_1217_OnCheckBoxComponentStateChangeg(char bIsChecked); // Function Setting.Dev.BndEvt__TemporalAACatmullRomCheck_K2Node_ComponentBoundEvent_1217_OnCheckBoxComponentStateChangeg(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__TemporalAAPauseCorrectChek_K2Node_ComponentBoundEvent_1237_OnCheckBoxComponentStateChanged__DelegateSignature(char bIsChecked); // Function Setting.Dev.BndEvt__TemporalAAPauseCorrectChek_K2Node_ComponentBoundEvent_1237_OnCheckBoxComponentStateChanged__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature(); // Function Setting.Dev.BndEvt__Button_0_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ComboBoxViewModes1_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature(struct FString SelectedItem, char SelectionType); // Function Setting.Dev.BndEvt__ComboBoxViewModes1_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void InitDefault(); // Function Setting.Dev.InitDefault(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_DevWidget(int32_t EntryPoint); // Function Setting.Dev.ExecuteUbergraph_DevWidget(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Pause(char Pause); // Function Setting.Dev.Pause(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Settings(); // Function Setting.Dev.Settings(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Setting.GamePlayWidget_C
class UGamePlayWidget_C : public UBravoHotelSettingSubWidget {

public:

	struct Unknown UberGraphFrame; // 0x298 (8)
	struct Unknown AmmoEffect; // 0x2A0 (8)
	struct Unknown AR; // 0x2A8 (8)
	struct Unknown AutoLadder; // 0x2B0 (8)
	struct Unknown autoReload; // 0x2B8 (8)
	struct Unknown AutoUseMedicalLv1; // 0x2C0 (8)
	struct Unknown AutoUseMedicalLv2; // 0x2C8 (8)
	struct Unknown AutoUseMedicalLv3; // 0x2D0 (8)
	struct Unknown BlueBoostEffect; // 0x2D8 (8)
	struct Unknown CrossHair; // 0x2E0 (8)
	struct Unknown CustsomUseItem; // 0x2E8 (8)
	struct Unknown DMR; // 0x2F0 (8)
	struct Unknown GreenBoostEffect; // 0x2F8 (8)
	struct Unknown ImmediateAttachment; // 0x300 (8)
	struct Unknown InheritAttachment; // 0x308 (8)
	struct Unknown MedicalLv1Effect; // 0x310 (8)
	struct Unknown MedicalLv2Effect; // 0x318 (8)
	struct Unknown MedicalLv3Effect; // 0x320 (8)
	struct Unknown NetworkDebug; // 0x328 (8)
	struct Unknown Pistol; // 0x330 (8)
	struct Unknown RedBoostEffect; // 0x338 (8)
	struct Unknown ScrollBox_55; // 0x340 (8)
	struct Unknown SearchExpertWeaponMaterialItem; // 0x348 (8)
	struct Unknown SearchMaterialItem; // 0x350 (8)
	struct Unknown ShowAircraftUI; // 0x358 (8)
	struct Unknown ShowGuideWidget; // 0x360 (8)
	struct Unknown ShowPerkSlot; // 0x368 (8)
	struct Unknown ShowSmartPing; // 0x370 (8)
	struct Unknown ShowSmartPingLightPole; // 0x378 (8)
	struct Unknown ShowSmartPingSupplyBox; // 0x380 (8)
	struct Unknown ShowUseaableItemEffect; // 0x388 (8)
	struct Unknown SMG; // 0x390 (8)
	struct Unknown SR; // 0x398 (8)
	struct Unknown Tutorial; // 0x3A0 (8)
	struct Unknown Tutorial_RePlay; // 0x3A8 (8)
	struct Unknown UseItem1; // 0x3B0 (8)
	struct Unknown UseItem2; // 0x3B8 (8)
	struct Unknown UseItem3; // 0x3C0 (8)
	struct Unknown UseItem4; // 0x3C8 (8)
	struct Unknown UseItem5; // 0x3D0 (8)
	struct Unknown UseItem6; // 0x3D8 (8)
	struct Unknown UseItem7; // 0x3E0 (8)
	struct Unknown UseItem8; // 0x3E8 (8)
	struct Unknown VerticalBox_154; // 0x3F0 (8)
	struct Unknown ; // 0x3F8 (8)
	struct Unknown ; // 0x400 (8)
	struct Unknown ; // 0x408 (8)
	struct Unknown ScrollBarTimer; // 0x410 (8)

	void (enum class Unknow Type); // Function Setting.GamePlayWidget_C.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DelegateChangeValue_Event_1(struct Unknown Value); // Function Setting.GamePlayWidget_C.DelegateChangeValue_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function Setting.GamePlayWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ScrollBox_54_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature(float CurrentOffset); // Function Setting.GamePlayWidget_C.BndEvt__ScrollBox_54_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent(); // Function Setting.GamePlayWidget_C.CustomEvent(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_GamePlayWidget(int32_t EntryPoint); // Function Setting.GamePlayWidget_C.ExecuteUbergraph_GamePlayWidget(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Setting.Key
class UKey : public UBravoHotelSettingSubWidget {

public:

	struct Unknown UberGraphFrame; // 0x298 (8)
	struct Unknown ButtomButtonWidget; // 0x2A0 (8)
	struct Unknown Image_154; // 0x2A8 (8)
	struct Unknown Overlay_1; // 0x2B0 (8)
	struct Unknown ScrollBox_55; // 0x2B8 (8)
	struct Unknown UniformGridPanel_119; // 0x2C0 (8)
	enum class Unknow Begin; // 0x2C8 (1)
	enum class Unknow End; // 0x2C9 (1)
	enum class Unknow PreSubType; // 0x2CA (1)
	struct FMulticastInlineDelegate EventDispatcher_KeyNotiMessage; // 0x2D0 (16)
	struct Unknown ScrollBarTimer; // 0x2E0 (8)
	struct TMap<Unknown, Unknown> List; // 0x2E8 (80)
	struct TArray<Unknown> SubTypeSort; // 0x338 (16)
	int32_t TempCount; // 0x348 (4)
	struct TMap<Unknown, Unknown> Hot; // 0x350 (80)
	float Size; // 0x3A0 (4)
	struct TMap<Unknown, Unknown> Offset; // 0x3A8 (80)

	void EnableShowReplayType(char& bRet); // Function Setting.Key.EnableShowReplayType(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function Setting.Key.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CreateSlotList(); // Function Setting.Key.CreateSlotList(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetScrollLock(char Lock); // Function Setting.Key.SetScrollLock(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function Setting.Key.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (struct Unknown InKey, struct Unknown Slot); // Function Setting.Key.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (char bIsDuplicate, struct Unknown InKey, struct FText KeyName); // Function Setting.Key.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ScrollBox_54_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature(float CurrentOffset); // Function Setting.Key.BndEvt__ScrollBox_54_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function Setting.Key.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (struct Unknown Widget); // Function Setting.Key.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ButtomButtonWidget_K2Node_ComponentBoundEvent_2_OnClickEventDispatcher__Delegate(struct Unknown Widget); // Function Setting.Key.BndEvt__ButtomButtonWidget_K2Node_ComponentBoundEvent_2_OnClickEventDispatcher__Delegate(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_KeyWidget(int32_t EntryPoint); // Function Setting.Key.ExecuteUbergraph_KeyWidget(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EventDispatcher_KeyNotiMessage__DelegateSignature(char IsDuplicate, struct Unknown Key, struct FText KeyName); // Function Setting.Key.EventDispatcher_KeyNotiMessage__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Setting.CrossHairDetailInfo_C
class UCrossHairDetailInfo_C : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown ; // 0x250 (8)
	struct Unknown CurDesc; // 0x258 (8)

	void SetData(struct FText Title, struct Unknown Image); // Function Setting.CrossHairDetailInfo_C.SetData(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_CrossHairDetailInfo(int32_t EntryPoint); // Function Setting.CrossHairDetailInfo_C.ExecuteUbergraph_CrossHairDetailInfo(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Setting.ControlWidget_C
class UControlWidget_C : public UBravoHotelSettingSubWidget {

public:

	struct Unknown UberGraphFrame; // 0x298 (8)
	struct Unknown 15XSensitivity; // 0x2A0 (8)
	struct Unknown 2XSensitivity; // 0x2A8 (8)
	struct Unknown 4XSensitivity; // 0x2B0 (8)
	struct Unknown 6XSensitivity; // 0x2B8 (8)
	struct Unknown 8XSensitivity; // 0x2C0 (8)
	struct Unknown ADSSensitivity; // 0x2C8 (8)
	struct Unknown GeneralSensitivity; // 0x2D0 (8)
	struct Unknown ReverseLeftAndRight; // 0x2D8 (8)
	struct Unknown ReverseUpAndDown; // 0x2E0 (8)
	struct Unknown ScrollBox_55; // 0x2E8 (8)
	struct Unknown TargetingSensitivity; // 0x2F0 (8)
	struct Unknown ToggleADS; // 0x2F8 (8)
	struct Unknown ToggleAOS; // 0x300 (8)
	struct Unknown ToggleCrouch; // 0x308 (8)
	struct Unknown ToggleExLean; // 0x310 (8)
	struct Unknown ToggleFreeLook; // 0x318 (8)
	struct Unknown ToggleSprint; // 0x320 (8)
	struct Unknown ToggleSteadyAim; // 0x328 (8)
	struct Unknown ToggleWalk; // 0x330 (8)
	struct Unknown TotalSensitivity; // 0x338 (8)
	struct Unknown UsingDetailSensitivy; // 0x340 (8)
	struct Unknown VehicleDriverSensitivity; // 0x348 (8)
	struct Unknown VerticalBox_1; // 0x350 (8)
	struct Unknown VerticlaModifier; // 0x358 (8)
	struct Unknown ; // 0x360 (8)
	struct Unknown ; // 0x368 (8)
	struct Unknown ; // 0x370 (8)
	struct Unknown ScrollBarTimer; // 0x378 (8)

	void Construct(); // Function Setting.ControlWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DelegateChangeValue_Event_1(struct Unknown Value); // Function Setting.ControlWidget_C.DelegateChangeValue_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ScrollBox_54_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature(float CurrentOffset); // Function Setting.ControlWidget_C.BndEvt__ScrollBox_54_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function Setting.ControlWidget_C.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_ControlWidget(int32_t EntryPoint); // Function Setting.ControlWidget_C.ExecuteUbergraph_ControlWidget(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Setting.AudioWidget_C
class UAudioWidget_C : public UBravoHotelSettingSubWidget {

public:

	struct Unknown UberGraphFrame; // 0x298 (8)
	struct Unknown Effect; // 0x2A0 (8)
	struct Unknown Master; // 0x2A8 (8)
	struct Unknown MasterOnOff; // 0x2B0 (8)
	struct Unknown Music; // 0x2B8 (8)
	struct Unknown ScrollBox_55; // 0x2C0 (8)
	struct Unknown UI; // 0x2C8 (8)
	struct Unknown VoiceChanel; // 0x2D0 (8)
	struct Unknown VoiceInput; // 0x2D8 (8)
	struct Unknown VoiceInputMode; // 0x2E0 (8)
	struct Unknown VoiceOutput; // 0x2E8 (8)
	struct Unknown ; // 0x2F0 (8)
	struct Unknown ; // 0x2F8 (8)
	struct Unknown ScrollBarTimer; // 0x300 (8)

	void Construct(); // Function Setting.AudioWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (struct Unknown Value); // Function SettingB1.AudioWidget_C.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ScrollBox_54_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature(float CurrentOffset); // Function SettingB1.AudioWidget_C.BndEvt__ScrollBox_54_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent(); // Function SettingWidget_.AudioWidget_C.CustomEvent(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_AudioWidget(int32_t EntryPoint); // Function Setting.AudioWidget_C.ExecuteUbergraph_AudioWidget(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Setting.ConfirmPopupWidget_C
class UConfirmPopupWidget_C : public UBravoHotelConfirmPopupWidget {

public:

	struct Unknown UberGraphFrame; // 0x250 (8)
	struct Unknown Bg; // 0x258 (8)
	struct Unknown btn_Cancel; // 0x260 (8)
	struct Unknown btn_OK; // 0x268 (8)
	struct Unknown Image_2; // 0x270 (8)
	struct Unknown Overlay_2; // 0x278 (8)
	struct Unknown TextBlock_1; // 0x280 (8)
	struct Unknown TextBlock_17; // 0x288 (8)
	struct Unknown TextBlock_18; // 0x290 (8)
	struct Unknown TextBlock_19; // 0x298 (8)
	char PopupType; // 0x2A0 (1)
	struct Unknown SettingWidget; // 0x2A8 (8)
	int32_t CurrentSelectIndex; // 0x2B0 (4)
	enum class Unknow CurrentSelectType; // 0x2B4 (1)
	struct TArray<Unknown> BackupSlots; // 0x2B8 (16)
	struct Unknown Timer; // 0x2C8 (8)
	int32_t TimerCount; // 0x2D0 (4)

	void SetTimerCount(); // Function Setting.ConfirmPopupWidget_C.SetTimerCount(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Init(struct Unknown SettingWidget, int32_t Index, enum class Unknow SelectType, char PopupType); // Function Setting.ConfirmPopupWidget_C.Init(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnMouseWheel(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Setting.ConfirmPopupWidget_C.OnMouseWheel(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnMouseButtonDown(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function Setting.ConfirmPopupWidget_C.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function Setting.ConfirmPopupWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_OK_K2Node_ComponentBoundEvent_35_OnButtonClickedEvent__DelegateSignature(); // Function Setting.ConfirmPopupWidget_C.BndEvt__btn_OK_K2Node_ComponentBoundEvent_35_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_Cancel_K2Node_ComponentBoundEvent_53_OnButtonClickedEvent__DelegateSignature(); // Function Setting.ConfirmPopupWidget_C.BndEvt__btn_Cancel_K2Node_ComponentBoundEvent_53_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_OK_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(); // Function Setting.ConfirmPopupWidget_C.BndEvt__btn_OK_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_Cancel_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignatu(); // Function Setting.ConfirmPopupWidget_C.BndEvt__btn_Cancel_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignatu(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CancelImpl(); // Function Setting.ConfirmPopupWidget_C.CancelImpl(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function Setting.ConfirmPopupWidget_C.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_ConfirmPopupWidget(int32_t EntryPoint); // Function Setting.ConfirmPopupWidget_C.ExecuteUbergraph_ConfirmPopupWidget(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass Settingget_Webg.SettingMainWidget_C
class USettingMainWidget_C : public UBravoHotelSettingWidget {

public:

	struct Unknown UberGraphFrame; // 0x3D8 (8)
	struct Unknown ; // 0x3E0 (8)
	struct Unknown ; // 0x3E8 (8)
	struct Unknown ; // 0x3F0 (8)
	struct Unknown ApplyButton; // 0x3F8 (8)
	struct Unknown Audio; // 0x400 (8)
	struct Unknown CanvasPanel_61; // 0x408 (8)
	struct Unknown CanvasPanel_279; // 0x410 (8)
	struct Unknown ChangeLock; // 0x418 (8)
	struct Unknown Control; // 0x420 (8)
	struct Unknown CrossHair; // 0x428 (8)
	struct Unknown CrossHairDetailInfo; // 0x430 (8)
	struct Unknown CrossHairDetailInfo_2; // 0x438 (8)
	struct Unknown CrossHairDetailInfo_3; // 0x440 (8)
	struct Unknown CrossHairDetailInfo_4; // 0x448 (8)
	struct Unknown CurDesc; // 0x450 (8)
	struct Unknown CurDesc2; // 0x458 (8)
	struct Unknown CurTitle; // 0x460 (8)
	struct Unknown DefaultButton; // 0x468 (8)
	struct Unknown Dev; // 0x470 (8)
	struct Unknown GamePlay; // 0x478 (8)
	struct Unknown GoBackButton; // 0x480 (8)
	struct Unknown Graphic; // 0x488 (8)
	struct Unknown Image; // 0x490 (8)
	struct Unknown Image_2; // 0x498 (8)
	struct Unknown Image_3; // 0x4A0 (8)
	struct Unknown Image_4; // 0x4A8 (8)
	struct Unknown Image_109; // 0x4B0 (8)
	struct Unknown Image_128; // 0x4B8 (8)
	struct Unknown Image_129; // 0x4C0 (8)
	struct Unknown Image_154; // 0x4C8 (8)
	struct Unknown Image_323; // 0x4D0 (8)
	struct Unknown Image_417; // 0x4D8 (8)
	struct Unknown Image_951; // 0x4E0 (8)
	struct Unknown Image_953; // 0x4E8 (8)
	struct Unknown Key; // 0x4F0 (8)
	struct Unknown KeyImageMain; // 0x4F8 (8)
	struct Unknown ProgressBar_317; // 0x500 (8)
	struct Unknown Slider_299; // 0x508 (8)
	struct Unknown TextBlock; // 0x510 (8)
	struct Unknown TextBlock_1; // 0x518 (8)
	struct Unknown TextBlock_2; // 0x520 (8)
	struct Unknown TextBlock_3; // 0x528 (8)
	struct Unknown TextBlock_5; // 0x530 (8)
	struct Unknown TextBlock_7; // 0x538 (8)
	struct Unknown VerticalBox_149; // 0x540 (8)
	struct Unknown WidgetSwitcher_113; // 0x548 (8)
	struct FMulticastInlineDelegate EnableButtonEventDispatcher; // 0x550 (16)
	struct Unknown Game; // 0x560 (8)
	struct TMap<Unknown, Unknown> SlotList_1; // 0x568 (80)
	struct Unknown GraphicWidget; // 0x5B8 (8)
	struct Unknown AudioWidget; // 0x5C0 (8)
	struct Unknown ControlWidget; // 0x5C8 (8)
	struct Unknown Key; // 0x5D0 (8)
	struct Unknown GamePlayWidget; // 0x5D8 (8)
	struct Unknown SettingDevWidget; // 0x5E0 (8)
	int32_t GraphicSwitcherIndex; // 0x5E8 (4)
	int32_t AudioSwitcherIndex; // 0x5EC (4)
	int32_t ControlSwitcherIndex; // 0x5F0 (4)
	int32_t KeySwitcherIndex; // 0x5F4 (4)
	int32_t SettingDevSwitcherIndex; // 0x5F8 (4)
	int32_t GamePlaySwitcherIndex; // 0x5FC (4)
	struct Unknown KeyNotiTimer; // 0x600 (8)
	float KeyNotiMessageShowTime; // 0x608 (4)
	struct Unknown TempImg; // 0x610 (40)
	struct Unknown SavedDescData; // 0x638 (8)

	void CreateWidgetImpl(struct Unknown* WidgetClass, struct Unknown& Out, int32_t& OutSwitcherIndex, int32_t& RealIndex); // Function Setting.SettingMainWidget_C.CreateWidgetImpl(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckConfirmPopup(int32_t Index, enum class Unknow Type); // Function Setting.SettingMainWidget_C.CheckConfirmPopup(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct TArray<Unknown> GetSubList(); // Function Setting.SettingMainWidget_C.GetSubList(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
