// WidgetBlueprintGeneratedClass SettingSubButtonWidget.SettingSubButtonWidget_C
struct USettingSubButtonWidget_C : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Border; //  0x250 Size(8)
	Unknown Button_222; //  0x258 Size(8)
	Unknown Image_192; //  0x260 Size(8)
	Unknown Title_Text; //  0x268 Size(8)
	int32_t Index; //  0x270 Size(4)
	Unknown DeActive; //  0x274 Size(10)
	Unknown Active; //  0x284 Size(10)
	struct FMulticastInlineDelegate ClickEventDispatcher; //  0x298 Size(10)
	struct FText Title; //  0x2a8 Size(18)
	Unknown Type; //  0x2c0 Size(1)
	char IsActive; //  0x2c1 Size(1)
	Unknown Over; //  0x2c4 Size(10)

	void Click(int32_t Index, Unknown Type); // Function SettingSubButtonWidget.SettingSubButtonWidget_C.Click(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

