// WidgetBlueprintGeneratedClass SettingSubButtonWidget.SettingSubButtonWidget_C
struct USettingSubButtonWidget_C : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Border; //  0x250 Size(8)
	struct Unknown Button_222; //  0x258 Size(8)
	struct Unknown Image_192; //  0x260 Size(8)
	struct Unknown Title_Text; //  0x268 Size(8)
	int32_t Index; //  0x270 Size(4)
	struct Unknown DeActive; //  0x274 Size(10)
	struct Unknown Active; //  0x284 Size(10)
	struct FMulticastInlineDelegate ClickEventDispatcher; //  0x298 Size(10)
	struct FText Title; //  0x2a8 Size(18)
	enum class Unknow Type; //  0x2c0 Size(1)
	char IsActive; //  0x2c1 Size(1)
	struct Unknown Over; //  0x2c4 Size(10)

	void Click(int32_t Index, enum class Unknow Type); // Function SettingSubButtonWidget.SettingSubButtonWidget_C.Click(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

