// WidgetBlueprintGeneratedClass SettingMainWidget.SettingMainWidget_C
struct USettingMainWidget_C : UBravoHotelSettingWidget {
	Unknown UberGraphFrame; //  0x3d8 Size(8)
	Unknown ; //  0x3e0 Size(8)
	Unknown ; //  0x3e8 Size(8)
	Unknown ; //  0x3f0 Size(8)
	Unknown ApplyButton; //  0x3f8 Size(8)
	Unknown Audio; //  0x400 Size(8)
	Unknown CanvasPanel_61; //  0x408 Size(8)
	Unknown CanvasPanel_279; //  0x410 Size(8)
	Unknown ChangeLock; //  0x418 Size(8)
	Unknown Control; //  0x420 Size(8)
	Unknown CrossHair; //  0x428 Size(8)
	Unknown CrossHairDetailInfo; //  0x430 Size(8)
	Unknown CrossHairDetailInfo_2; //  0x438 Size(8)
	Unknown CrossHairDetailInfo_3; //  0x440 Size(8)
	Unknown CrossHairDetailInfo_4; //  0x448 Size(8)
	Unknown CurDesc; //  0x450 Size(8)
	Unknown CurDesc2; //  0x458 Size(8)
	Unknown CurTitle; //  0x460 Size(8)
	Unknown DefaultButton; //  0x468 Size(8)
	Unknown Dev; //  0x470 Size(8)
	Unknown GamePlay; //  0x478 Size(8)
	Unknown GoBackButton; //  0x480 Size(8)
	Unknown Graphic; //  0x488 Size(8)
	Unknown Image; //  0x490 Size(8)
	Unknown Image_2; //  0x498 Size(8)
	Unknown Image_3; //  0x4a0 Size(8)
	Unknown Image_4; //  0x4a8 Size(8)
	Unknown Image_109; //  0x4b0 Size(8)
	Unknown Image_128; //  0x4b8 Size(8)
	Unknown Image_129; //  0x4c0 Size(8)
	Unknown Image_154; //  0x4c8 Size(8)
	Unknown Image_323; //  0x4d0 Size(8)
	Unknown Image_417; //  0x4d8 Size(8)
	Unknown Image_951; //  0x4e0 Size(8)
	Unknown Image_953; //  0x4e8 Size(8)
	Unknown Key; //  0x4f0 Size(8)
	Unknown KeyImageMain; //  0x4f8 Size(8)
	Unknown ProgressBar_317; //  0x500 Size(8)
	Unknown Slider_299; //  0x508 Size(8)
	Unknown TextBlock; //  0x510 Size(8)
	Unknown TextBlock_1; //  0x518 Size(8)
	Unknown TextBlock_2; //  0x520 Size(8)
	Unknown TextBlock_3; //  0x528 Size(8)
	Unknown TextBlock_5; //  0x530 Size(8)
	Unknown TextBlock_7; //  0x538 Size(8)
	Unknown VerticalBox_149; //  0x540 Size(8)
	Unknown WidgetSwitcher_113; //  0x548 Size(8)
	struct FMulticastInlineDelegate Enab; //  0x550 Size(10)
	Unknown Game; //  0x560 Size(8)
	Unknown SlotList_1; //  0x568 Size(50)
	Unknown GraphicWidget; //  0x5b8 Size(8)
	Unknown AudioWidget; //  0x5c0 Size(8)
	Unknown ControlWidget; //  0x5c8 Size(8)
	Unknown KeyWidget; //  0x5d0 Size(8)
	Unknown GamePlayWidget; //  0x5d8 Size(8)
	Unknown SettingDevWidget; //  0x5e0 Size(8)
	int32_t GraphicSwitcherIndex; //  0x5e8 Size(4)
	int32_t AudioSwitcherIndex; //  0x5ec Size(4)
	int32_t ControlSwitcherIndex; //  0x5f0 Size(4)
	int32_t KeySwitcherIndex; //  0x5f4 Size(4)
	int32_t SettingDevSwitcherIndex; //  0x5f8 Size(4)
	int32_t GamePlaySwitcherIndex; //  0x5fc Size(4)
	Unknown KeyNotiTimer; //  0x600 Size(8)
	float KeyNotiMessageShowTime; //  0x608 Size(4)
	Unknown TempImg; //  0x610 Size(28)
	Unknown SavedDescData; //  0x638 Size(8)

	void CreateWidgetImpl(Unknown WidgetClass, Unknown& OutWidget, int32_t& OutSwitcherIndex, int32_t& RealIndex); // Function SettingMainWidget.SettingMainWidget_C.CreateWidgetImpl(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

