// UserDefinedStruct SKeyActionSave.SKeyActionSave
struct FSKeyActionSave {
	struct FString ActionName_27_5885F13F40BEDA6C8B8F749EAEC64BBA; // 0x0 (16)
	struct FString Category_10_6A9C009143C58E50DF299AA2409B06BD; // 0x10 (16)
	struct FString Name_12_284B813542040EB40314D6A629BCF640; // 0x20 (16)
	float Scale_25_55DAC9F048835ECFBB2123B59FBB6835; // 0x30 (4)
	char Primary_15_7375BAE94E1228E31B871684158CC790 : 0; // 0x34 (1)
	struct FKey KeyInput_26_669892994CD4745AD57CF4BDF708E2A0; // 0x38 (24)
	char NegativeAxis_22_17736552415A5EA125B225BE5B8415AE : 0; // 0x50 (1)
	char EmptyCombination_29_A96B2E8F49C8DDD0067652A02233A112 : 0; // 0x51 (1)
};

