// Enum SlateCore.EUINavigation
enum class EUINavigation : uint8 {
	EUINavigation = 0
	EUINavigation = 1
	EUINavigation = 2
	EUINavigation = 3
	EUINavigation = 4
	EUINavigation = 5
	EUINavigation = 6
	EUINavigation = 7
	EUINavigation = 8
};

// Enum SlateCore.ECheckBoxState
enum class ECheckBoxState : uint8 {
	ECheckBoxState = 0
	ECheckBoxState = 1
	ECheckBoxState = 2
	ECheckBoxState = 3
};

// Enum SlateCore.EWidgetClipping
enum class EWidgetClipping : uint8 {
	EWidgetClipping = 0
	EWidgetClipping = 1
	EWidgetClipping = 2
	EWidgetClipping = 3
	EWidgetClipping = 4
	EWidgetClipping = 5
};

// Enum SlateCore.ESlateBrushImageType
enum class ESlateBrushImageType : uint8 {
	ESlateBrushImageType = 0
	ESlateBrushImageType = 1
	ESlateBrushImageType = 2
	ESlateBrushImageType = 3
};

// Enum SlateCore.ESlateBrushMirrorType
enum class ESlateBrushMirrorType : uint8 {
	ESlateBrushMirrorType = 0
	ESlateBrushMirrorType = 1
	ESlateBrushMirrorType = 2
	ESlateBrushMirrorType = 3
	ESlateBrushMirrorType = 4
};

// Enum SlateCore.ESlateBrushTileType
enum class ESlateBrushTileType : uint8 {
	ESlateBrushTileType = 0
	ESlateBrushTileType = 1
	ESlateBrushTileType = 2
	ESlateBrushTileType = 3
	ESlateBrushTileType = 4
};

// Enum SlateCore.ESlateBrushDrawType
enum class ESlateBrushDrawType : uint8 {
	ESlateBrushDrawType = 0
	ESlateBrushDrawType = 1
	ESlateBrushDrawType = 2
	ESlateBrushDrawType = 3
	ESlateBrushDrawType = 4
};

// Enum SlateCore.ESlateColorStylingMode
enum class ESlateColorStylingMode : uint8 {
	ESlateColorStylingMode = 0
	ESlateColorStylingMode = 1
	ESlateColorStylingMode = 2
	ESlateColorStylingMode = 3
	ESlateColorStylingMode = 4
};

// Enum SlateCore.EUINavigationRule
enum class EUINavigationRule : uint8 {
	EUINavigationRule = 0
	EUINavigationRule = 1
	EUINavigationRule = 2
	EUINavigationRule = 3
	EUINavigationRule = 4
	EUINavigationRule = 5
	EUINavigationRule = 6
	EUINavigationRule = 7
};

// Enum SlateCore.EFlowDirectionPreference
enum class EFlowDirectionPreference : uint8 {
	EFlowDirectionPreference = 0
	EFlowDirectionPreference = 1
	EFlowDirectionPreference = 2
	EFlowDirectionPreference = 3
	EFlowDirectionPreference = 4
};

// Enum SlateCore.EColorVisionDeficiency
enum class EColorVisionDeficiency : uint8 {
	EColorVisionDeficiency = 0
	EColorVisionDeficiency = 1
	EColorVisionDeficiency = 2
	EColorVisionDeficiency = 3
	EColorVisionDeficiency = 4
};

// Enum SlateCore.ESelectInfo
enum class ESelectInfo : uint8 {
	ESelectInfo = 0
	ESelectInfo = 1
	ESelectInfo = 2
	ESelectInfo = 3
	ESelectInfo = 4
};

// Enum SlateCore.ETextCommit
enum class ETextCommit : uint8 {
	ETextCommit = 0
	ETextCommit = 1
	ETextCommit = 2
	ETextCommit = 3
	ETextCommit = 4
};

// Enum SlateCore.ETextShapingMethod
enum class ETextShapingMethod : uint8 {
	ETextShapingMethod = 0
	ETextShapingMethod = 1
	ETextShapingMethod = 2
	ETextShapingMethod = 3
};

// Enum SlateCore.EFontLayoutMethod
enum class EFontLayoutMethod : uint8 {
	EFontLayoutMethod = 0
	EFontLayoutMethod = 1
	EFontLayoutMethod = 2
};

// Enum SlateCore.EFontLoadingPolicy
enum class EFontLoadingPolicy : uint8 {
	EFontLoadingPolicy = 0
	EFontLoadingPolicy = 1
	EFontLoadingPolicy = 2
	EFontLoadingPolicy = 3
};

// Enum SlateCore.EFontHinting
enum class EFontHinting : uint8 {
	EFontHinting = 0
	EFontHinting = 1
	EFontHinting = 2
	EFontHinting = 3
	EFontHinting = 4
	EFontHinting = 5
};

// Enum SlateCore.EFocusCause
enum class EFocusCause : uint8 {
	EFocusCause = 0
	EFocusCause = 1
	EFocusCause = 2
	EFocusCause = 3
	EFocusCause = 4
	EFocusCause = 5
	EFocusCause = 6
};

// Enum SlateCore.ESlateDebuggingFocusEvent
enum class ESlateDebuggingFocusEvent : uint8 {
	ESlateDebuggingFocusEvent = 0
	ESlateDebuggingFocusEvent = 1
	ESlateDebuggingFocusEvent = 2
	ESlateDebuggingFocusEvent = 3
};

// Enum SlateCore.ESlateDebuggingNavigationMethod
enum class ESlateDebuggingNavigationMethod : uint8 {
	ESlateDebuggingNavigationMethod = 0
	ESlateDebuggingNavigationMethod = 1
	ESlateDebuggingNavigationMethod = 2
	ESlateDebuggingNavigationMethod = 3
	ESlateDebuggingNavigationMethod = 4
	ESlateDebuggingNavigationMethod = 5
	ESlateDebuggingNavigationMethod = 6
};

// Enum SlateCore.ESlateDebuggingStateChangeEvent
enum class ESlateDebuggingStateChangeEvent : uint8 {
	ESlateDebuggingStateChangeEvent = 0
	ESlateDebuggingStateChangeEvent = 1
	ESlateDebuggingStateChangeEvent = 2
};

// Enum SlateCore.ESlateDebuggingInputEvent
enum class ESlateDebuggingInputEvent : uint8 {
	ESlateDebuggingInputEvent = 0
	ESlateDebuggingInputEvent = 1
	ESlateDebuggingInputEvent = 2
	ESlateDebuggingInputEvent = 3
	ESlateDebuggingInputEvent = 4
	ESlateDebuggingInputEvent = 5
	ESlateDebuggingInputEvent = 6
	ESlateDebuggingInputEvent = 7
	ESlateDebuggingInputEvent = 8
	ESlateDebuggingInputEvent = 9
	ESlateDebuggingInputEvent = 10
	ESlateDebuggingInputEvent = 11
	ESlateDebuggingInputEvent = 12
	ESlateDebuggingInputEvent = 13
	ESlateDebuggingInputEvent = 14
	ESlateDebuggingInputEvent = 15
	ESlateDebuggingInputEvent = 16
	ESlateDebuggingInputEvent = 17
	ESlateDebuggingInputEvent = 18
	ESlateDebuggingInputEvent = 19
	ESlateDebuggingInputEvent = 20
	ESlateDebuggingInputEvent = 21
};

// Enum SlateCore.EScrollDirection
enum class EScrollDirection : uint8 {
	Scroll_Down = 0
	Scroll_Up = 1
	Scroll_MAX = 2
};

// Enum SlateCore.EOrientation
enum class EOrientation : uint8 {
	Orient_Horizontal = 0
	Orient_Vertical = 1
	Orient_MAX = 2
};

// Enum SlateCore.EMenuPlacement
enum class EMenuPlacement : uint8 {
	MenuPlacement_BelowAnchor = 0
	MenuPlacement_CenteredBelowAnchor = 1
	MenuPlacement_BelowRightAnchor = 2
	MenuPlacement_ComboBox = 3
	MenuPlacement_ComboBoxRight = 4
	MenuPlacement_MenuRight = 5
	MenuPlacement_AboveAnchor = 6
	MenuPlacement_CenteredAboveAnchor = 7
	MenuPlacement_AboveRightAnchor = 8
	MenuPlacement_MenuLeft = 9
	MenuPlacement_Center = 10
	MenuPlacement_RightLeftCenter = 11
	MenuPlacement_MatchBottomLeft = 12
	MenuPlacement_MAX = 13
};

// Enum SlateCore.EVerticalAlignment
enum class EVerticalAlignment : uint8 {
	VAlign_Fill = 0
	VAlign_Top = 1
	VAlign_Center = 2
	VAlign_Bottom = 3
	VAlign_MAX = 4
};

// Enum SlateCore.EHorizontalAlignment
enum class EHorizontalAlignment : uint8 {
	HAlign_Fill = 0
	HAlign_Left = 1
	HAlign_Center = 2
	HAlign_Right = 3
	HAlign_MAX = 4
};

// Enum SlateCore.ENavigationGenesis
enum class ENavigationGenesis : uint8 {
	ENavigationGenesis = 0
	ENavigationGenesis = 1
	ENavigationGenesis = 2
	ENavigationGenesis = 3
};

// Enum SlateCore.ENavigationSource
enum class ENavigationSource : uint8 {
	ENavigationSource = 0
	ENavigationSource = 1
	ENavigationSource = 2
};

// Enum SlateCore.EUINavigationAction
enum class EUINavigationAction : uint8 {
	EUINavigationAction = 0
	EUINavigationAction = 1
	EUINavigationAction = 2
	EUINavigationAction = 3
	EUINavigationAction = 4
};

// Enum SlateCore.EButtonPressMethod
enum class EButtonPressMethod : uint8 {
	EButtonPressMethod = 0
	EButtonPressMethod = 1
	EButtonPressMethod = 2
	EButtonPressMethod = 3
};

// Enum SlateCore.EButtonTouchMethod
enum class EButtonTouchMethod : uint8 {
	EButtonTouchMethod = 0
	EButtonTouchMethod = 1
	EButtonTouchMethod = 2
	EButtonTouchMethod = 3
};

// Enum SlateCore.EButtonClickMethod
enum class EButtonClickMethod : uint8 {
	EButtonClickMethod = 0
	EButtonClickMethod = 1
	EButtonClickMethod = 2
	EButtonClickMethod = 3
	EButtonClickMethod = 4
};

// Enum SlateCore.ESlateCheckBoxType
enum class ESlateCheckBoxType : uint8 {
	ESlateCheckBoxType = 0
	ESlateCheckBoxType = 1
	ESlateCheckBoxType = 2
};

// Enum SlateCore.ESlateParentWindowSearchMethod
enum class ESlateParentWindowSearchMethod : uint8 {
	ESlateParentWindowSearchMethod = 0
	ESlateParentWindowSearchMethod = 1
	ESlateParentWindowSearchMethod = 2
};

// Enum SlateCore.EConsumeMouseWheel
enum class EConsumeMouseWheel : uint8 {
	EConsumeMouseWheel = 0
	EConsumeMouseWheel = 1
	EConsumeMouseWheel = 2
	EConsumeMouseWheel = 3
};

// Class SlateCore.SlateWidgetStyleAsset
class USlateWidgetStyleAsset : Object {
	struct Unknown CustomStyle; // 0x28 (8)
};

// ScriptStruct SlateCore.SlateBrush
struct FSlateBrush {
	struct Unknown ImageSize; // 0x8 (8)
	struct Unknown Margin; // 0x10 (16)
	struct Unknown TintColor; // 0x20 (40)
	struct Unknown ResourceObject; // 0x48 (8)
	struct FName ResourceName; // 0x50 (8)
	struct Unknown UVRegion; // 0x58 (20)
	char DrawAs; // 0x6C (1)
	enum class Unknown tiling; // 0x6D (1)
	char Mirroring; // 0x6E (1)
	char ImageType; // 0x6F (1)
	char bIsDynamicallyLoaded : 0; // 0x80 (1)
	char bHasUObject : 0; // 0x80 (1)
};

// ScriptStruct SlateCore.SlateColor
struct FSlateColor {
	struct Unknown SpecifiedColor; // 0x0 (16)
	char ColorUseRule; // 0x10 (1)
};

// ScriptStruct SlateCore.Margin
struct FMargin {
	float Left; // 0x0 (4)
	float Top; // 0x4 (4)
	float Right; // 0x8 (4)
	float Bottom; // 0xC (4)
};

// ScriptStruct SlateCore.SlateFontInfo
struct FSlateFontInfo {
	struct Unknown FontObject; // 0x0 (8)
	struct Unknown FontMaterial; // 0x8 (8)
	struct Unknown OutlineSettings; // 0x10 (32)
	struct FName TypefaceFontName; // 0x40 (8)
	int32_t Size; // 0x48 (4)
};

// ScriptStruct SlateCore.FontOutlineSettings
struct FFontOutlineSettings {
	int32_t OutlineSize; // 0x0 (4)
	char bSeparateFillAlpha : 0; // 0x4 (1)
	char bApplyOutlineToDropShadows : 0; // 0x5 (1)
	struct Unknown OutlineMaterial; // 0x8 (8)
	struct Unknown OutlineColor; // 0x10 (16)
};

// ScriptStruct SlateCore.TableRowStyle
struct FTableRowStyle : FSlateWidgetStyle {
	struct Unknown SelectorFocusedBrush; // 0x8 (136)
	struct Unknown ActiveHoveredBrush; // 0x90 (136)
	struct Unknown ActiveBrush; // 0x118 (136)
	struct Unknown InactiveHoveredBrush; // 0x1A0 (136)
	struct Unknown InactiveBrush; // 0x228 (136)
	struct Unknown EvenRowBackgroundHoveredBrush; // 0x2B0 (136)
	struct Unknown EvenRowBackgroundBrush; // 0x338 (136)
	struct Unknown OddRowBackgroundHov; // 0x3C0 (136)
	struct Unknown OddRowBackgroundBrush; // 0x448 (136)
	struct Unknown TextColor; // 0x4D0 (40)
	struct Unknown SelectedTextColor; // 0x4F8 (40)
	struct Unknown DropIndicator_Above; // 0x520 (136)
	struct Unknown DropIndicator_Onto; // 0x5A8 (136)
	struct Unknown DropIndicator_Below; // 0x630 (136)
	struct Unknown ActiveHighlightedBrush; // 0x6B8 (136)
	struct Unknown InactiveHighlightedBrush; // 0x740 (136)
};

// ScriptStruct SlateCore.ComboBoxStyle
struct FComboBoxStyle : FSlateWidgetStyle {
	struct Unknown ComboButtonStyle; // 0x8 (952)
	struct Unknown PressedSlateSound; // 0x3C0 (24)
	struct Unknown SelectionChangeSlateSound; // 0x3D8 (24)
};

// ScriptStruct SlateCore.SlateSound
struct FSlateSound {
	struct Unknown ResourceObject; // 0x0 (8)
};

// ScriptStruct SlateCore.ComboButtonStyle
struct FComboButtonStyle : FSlateWidgetStyle {
	struct Unknown ButtonStyle; // 0x8 (632)
	struct Unknown DownArrowImage; // 0x280 (136)
	struct Unknown ShadowOffset; // 0x308 (8)
	struct Unknown ShadowColorAndOpacity; // 0x310 (16)
	struct Unknown MenuBorderBrush; // 0x320 (136)
	struct Unknown MenuBorderPadding; // 0x3A8 (16)
};

// ScriptStruct SlateCore.ButtonStyle
struct FButtonStyle : FSlateWidgetStyle {
	struct Unknown Normal; // 0x8 (136)
	struct Unknown Hovered; // 0x90 (136)
	struct Unknown Pressed; // 0x118 (136)
	struct Unknown Disabled; // 0x1A0 (136)
	struct Unknown NormalPadding; // 0x228 (16)
	struct Unknown PressedPadding; // 0x238 (16)
	struct Unknown PressedSlateSound; // 0x248 (24)
	struct Unknown HoveredSlateSound; // 0x260 (24)
};

// ScriptStruct SlateCore.EditableTextStyle
struct FEditableTextStyle : FSlateWidgetStyle {
	struct Unknown Font; // 0x8 (80)
	struct Unknown ColorAndOpacity; // 0x58 (40)
	struct Unknown BackgroundImageSelected; // 0x80 (136)
	struct Unknown BackgroundImageComposing; // 0x108 (136)
	struct Unknown CaretImage; // 0x190 (136)
};

// ScriptStruct SlateCore.EditableTextBoxStyle
struct FEditableTextBoxStyle : FSlateWidgetStyle {
	struct Unknown BackgroundImageNormal; // 0x8 (136)
	struct Unknown BackgroundImageHovered; // 0x90 (136)
	struct Unknown BackgroundImageFocused; // 0x118 (136)
	struct Unknown BackgroundImageReadOnly; // 0x1A0 (136)
	struct Unknown Padding; // 0x228 (16)
	struct Unknown Font; // 0x238 (80)
	struct Unknown ForegroundColor; // 0x288 (40)
	struct Unknown BackgroundColor; // 0x2B0 (40)
	struct Unknown ReadOnlyForegroundColor; // 0x2D8 (40)
	struct Unknown HScrollBarPadding; // 0x300 (16)
	struct Unknown VScrollBarPadding; // 0x310 (16)
	struct Unknown ScrollBarStyle; // 0x320 (1232)
};

// ScriptStruct SlateCore.ScrollBarStyle
struct FScrollBarStyle : FSlateWidgetStyle {
	struct Unknown HorizontalBackgroundImage; // 0x8 (136)
	struct Unknown VerticalBackgroundImage; // 0x90 (136)
	struct Unknown VerticalTopSlotImage; // 0x118 (136)
	struct Unknown HorizontalTopSlotImage; // 0x1A0 (136)
	struct Unknown VerticalBottomSlotImage; // 0x228 (136)
	struct Unknown HorizontalBottomSlotImage; // 0x2B0 (136)
	struct Unknown NormalThumbImage; // 0x338 (136)
	struct Unknown HoveredThumbImage; // 0x3C0 (136)
	struct Unknown DraggedThumbImage; // 0x448 (136)
};

// ScriptStruct SlateCore.TextBlockStyle
struct FTextBlockStyle : FSlateWidgetStyle {
	struct Unknown Font; // 0x8 (80)
	struct Unknown ColorAndOpacity; // 0x58 (40)
	struct Unknown ShadowOffset; // 0x80 (8)
	struct Unknown ShadowColorAndOpacity; // 0x88 (16)
	struct Unknown SelectedBackgroundColor; // 0x98 (40)
	struct Unknown HighlightColor; // 0xC0 (16)
	struct Unknown HighlightShape; // 0xD0 (136)
	struct Unknown StrikeBrush; // 0x158 (136)
	struct Unknown UnderlineBrush; // 0x1E0 (136)
};

// ScriptStruct SlateCore.SpinBoxStyle
struct FSpinBoxStyle : FSlateWidgetStyle {
	struct Unknown BackgroundBrush; // 0x8 (136)
	struct Unknown HoveredBackgroundBrush; // 0x90 (136)
	struct Unknown ActiveFillBrush; // 0x118 (136)
	struct Unknown InactiveFillBrush; // 0x1A0 (136)
	struct Unknown ArrowsImage; // 0x228 (136)
	struct Unknown ForegroundColor; // 0x2B0 (40)
	struct Unknown TextPadding; // 0x2D8 (16)
};

// ScriptStruct SlateCore.CompositeFont
struct FCompositeFont {
	struct Unknown DefaultTypeface; // 0x0 (16)
	struct Unknown FallbackTypeface; // 0x10 (24)
	struct TArray<Unknown> SubTypefaces; // 0x28 (16)
};

// ScriptStruct SlateCore.CompositeFallbackFont
struct FCompositeFallbackFont {
	struct Unknown Typeface; // 0x0 (16)
	float ScalingFactor; // 0x10 (4)
};

// ScriptStruct SlateCore.Typeface
struct FTypeface {
	struct TArray<Unknown> Fonts; // 0x0 (16)
};

// ScriptStruct SlateCore.TypefaceEntry
struct FTypefaceEntry {
	struct FName Name; // 0x0 (8)
	struct Unknown Font; // 0x8 (32)
};

// ScriptStruct SlateCore.FontData
struct FFontData {
	struct FString FontFilename; // 0x0 (16)
	enum class Unknow Hinting; // 0x10 (1)
	enum class Unknow LoadingPolicy; // 0x11 (1)
	int32_t SubFaceIndex; // 0x14 (4)
	struct Unknown FontFaceAsset; // 0x18 (8)
};

// ScriptStruct SlateCore.CompositeSubFont
struct FCompositeSubFont : FCompositeFallbackFont {
	struct TArray<Unknown> CharacterRanges; // 0x18 (16)
	struct FString Cultures; // 0x28 (16)
};

// ScriptStruct SlateCore.WindowStyle
struct FWindowStyle : FSlateWidgetStyle {
	struct Unknown MinimizeButtonStyle; // 0x8 (632)
	struct Unknown MaximizeButtonStyle; // 0x280 (632)
	struct Unknown RestoreButtonStyle; // 0x4F8 (632)
	struct Unknown CloseButtonStyle; // 0x770 (632)
	struct Unknown TitleTextStyle; // 0x9E8 (616)
	struct Unknown ActiveTitleBrush; // 0xC50 (136)
	struct Unknown InactiveTitleBrush; // 0xCD8 (136)
	struct Unknown FlashTitleBrush; // 0xD60 (136)
	struct Unknown BackgroundColor; // 0xDE8 (40)
	struct Unknown OutlineBrush; // 0xE10 (136)
	struct Unknown OutlineColor; // 0xE98 (40)
	struct Unknown BorderBrush; // 0xEC0 (136)
	struct Unknown BackgroundBrush; // 0xF48 (136)
	struct Unknown ChildBackgroundBrush; // 0xFD0 (136)
};

// ScriptStruct SlateCore.ScrollBorderStyle
struct FScrollBorderStyle : FSlateWidgetStyle {
	struct Unknown TopShadowBrush; // 0x8 (136)
	struct Unknown BottomShadowBrush; // 0x90 (136)
};

// ScriptStruct SlateCore.ScrollBoxStyle
struct FScrollBoxStyle : FSlateWidgetStyle {
	struct Unknown TopShadowBrush; // 0x8 (136)
	struct Unknown BottomShadowBrush; // 0x90 (136)
	struct Unknown LeftShadowBrush; // 0x118 (136)
	struct Unknown RightShadowBrush; // 0x1A0 (136)
};

// ScriptStruct SlateCore.DockTabStyle
struct FDockTabStyle : FSlateWidgetStyle {
	struct Unknown CloseButtonStyle; // 0x8 (632)
	struct Unknown NormalBrush; // 0x280 (136)
	struct Unknown ActiveBrush; // 0x308 (136)
	struct Unknown ColorOverlayTabBrush; // 0x390 (136)
	struct Unknown ColorOverlayIconBrush; // 0x418 (136)
	struct Unknown ForegroundBrush; // 0x4A0 (136)
	struct Unknown HoveredBrush; // 0x528 (136)
	struct Unknown ContentAreaBrush; // 0x5B0 (136)
	struct Unknown TabWellBrush; // 0x638 (136)
	struct Unknown TabPadding; // 0x6C0 (16)
	float OverlapWidth; // 0x6D0 (4)
	struct Unknown FlashColor; // 0x6D8 (40)
};

// ScriptStruct SlateCore.HeaderRowStyle
struct FHeaderRowStyle : FSlateWidgetStyle {
	struct Unknown ColumnStyle; // 0x8 (1232)
	struct Unknown LastColumnStyle; // 0x4D8 (1232)
	struct Unknown ColumnSplitterStyle; // 0x9A8 (280)
	struct Unknown BackgroundBrush; // 0xAC0 (136)
	struct Unknown ForegroundColor; // 0xB48 (40)
};

// ScriptStruct SlateCore.SplitterStyle
struct FSplitterStyle : FSlateWidgetStyle {
	struct Unknown HandleNormalBrush; // 0x8 (136)
	struct Unknown HandleHighlightBrush; // 0x90 (136)
};

// ScriptStruct SlateCore.TableColumnHeaderStyle
struct FTableColumnHeaderStyle : FSlateWidgetStyle {
	struct Unknown SortPrimaryAscendingImage; // 0x8 (136)
	struct Unknown SortPrimaryDescendingImage; // 0x90 (136)
	struct Unknown SortSecondaryAscendingImage; // 0x118 (136)
	struct Unknown SortSecondaryDescendingImage; // 0x1A0 (136)
	struct Unknown NormalBrush; // 0x228 (136)
	struct Unknown HoveredBrush; // 0x2B0 (136)
	struct Unknown MenuDropdownImage; // 0x338 (136)
	struct Unknown MenuDropdownNormalBorderBrush; // 0x3C0 (136)
	struct Unknown MenuDropdownHoveredBorderBrush; // 0x448 (136)
};

// ScriptStruct SlateCore.InlineTextImageStyle
struct FInlineTextImageStyle : FSlateWidgetStyle {
	struct Unknown Image; // 0x8 (136)
	int16_t Baseline; // 0x90 (2)
};

// ScriptStruct SlateCore.VolumeControlStyle
struct FVolumeControlStyle : FSlateWidgetStyle {
	struct Unknown SliderStyle; // 0x8 (832)
	struct Unknown HighVolumeImage; // 0x348 (136)
	struct Unknown MidVolumeImage; // 0x3D0 (136)
	struct Unknown LowVolumeImage; // 0x458 (136)
	struct Unknown NoVolumeImage; // 0x4E0 (136)
	struct Unknown MutedImage; // 0x568 (136)
};

// ScriptStruct SlateCore.SliderStyle
struct FSliderStyle : FSlateWidgetStyle {
	struct Unknown NormalBarImage; // 0x8 (136)
	struct Unknown HoveredBarImage; // 0x90 (136)
	struct Unknown DisabledBarImage; // 0x118 (136)
	struct Unknown NormalThumbImage; // 0x1A0 (136)
	struct Unknown HoveredThumbImage; // 0x228 (136)
	struct Unknown DisabledThumbImage; // 0x2B0 (136)
	float BarThickness; // 0x338 (4)
};

// ScriptStruct SlateCore.SearchBoxStyle
struct FSearchBoxStyle : FSlateWidgetStyle {
	struct Unknown TextBoxStyle; // 0x8 (2032)
	struct Unknown ActiveFontInfo; // 0x7F8 (80)
	struct Unknown UpArrowImage; // 0x848 (136)
	struct Unknown DownArrowImage; // 0x8D0 (136)
	struct Unknown GlassImage; // 0x958 (136)
	struct Unknown ClearImage; // 0x9E0 (136)
	struct Unknown ImagePadding; // 0xA68 (16)
	char bLeftAlignButtons : 0; // 0xA78 (1)
};

// ScriptStruct SlateCore.ExpandableAreaStyle
struct FExpandableAreaStyle : FSlateWidgetStyle {
	struct Unknown CollapsedImage; // 0x8 (136)
	struct Unknown ExpandedImage; // 0x90 (136)
	float RolloutAnimationSeconds; // 0x118 (4)
};

// ScriptStruct SlateCore.ProgressBarStyle
struct FProgressBarStyle : FSlateWidgetStyle {
	struct Unknown BackgroundImage; // 0x8 (136)
	struct Unknown FillImage; // 0x90 (136)
	struct Unknown MarqueeImage; // 0x118 (136)
};

// ScriptStruct SlateCore.InlineEditableTextBlockStyle
struct FInlineEditableTextBlockStyle : FSlateWidgetStyle {
	struct Unknown EditableTextBoxStyle; // 0x8 (2032)
	struct Unknown TextStyle; // 0x7F8 (616)
};

// ScriptStruct SlateCore.HyperlinkStyle
struct FHyperlinkStyle : FSlateWidgetStyle {
	struct Unknown UnderlineStyle; // 0x8 (632)
	struct Unknown TextStyle; // 0x280 (616)
	struct Unknown Padding; // 0x4E8 (16)
};

// ScriptStruct SlateCore.CheckBoxStyle
struct FCheckBoxStyle : FSlateWidgetStyle {
	char CheckBoxType; // 0x8 (1)
	struct Unknown UncheckedImage; // 0x10 (136)
	struct Unknown UncheckedHoveredImage; // 0x98 (136)
	struct Unknown UncheckedPressedImage; // 0x120 (136)
	struct Unknown CheckedImage; // 0x1A8 (136)
	struct Unknown CheckedHoveredImage; // 0x230 (136)
	struct Unknown CheckedPressedImage; // 0x2B8 (136)
	struct Unknown UndeterminedImage; // 0x340 (136)
	struct Unknown UndeterminedHoveredImage; // 0x3C8 (136)
	struct Unknown UndeterminedPressedImage; // 0x450 (136)
	struct Unknown Padding; // 0x4D8 (16)
	struct Unknown ForegroundColor; // 0x4E8 (40)
	struct Unknown BorderBackgroundColor; // 0x510 (40)
	struct Unknown CheckedSlateSound; // 0x538 (24)
	struct Unknown UncheckedSlateSound; // 0x550 (24)
	struct Unknown HoveredSlateSound; // 0x568 (24)
};

