// WidgetBlueprintGeneratedClass SlotItemWidget.SlotItemWidget_C
struct USlotItemWidget_C : UBravoHotelSettingSlotWidget {
	struct Unknown UberGraphFrame; //  0x4e8 Size(8)
	struct Unknown Over; //  0x4f0 Size(8)
	struct Unknown Button_107; //  0x4f8 Size(8)
	struct Unknown Button_441; //  0x500 Size(8)
	struct Unknown Button_Type; //  0x508 Size(8)
	struct Unknown ButtonType; //  0x510 Size(8)
	struct Unknown ComboBoxString_237; //  0x518 Size(8)
	struct Unknown ComboBoxType; //  0x520 Size(8)
	struct Unknown Down; //  0x528 Size(8)
	struct Unknown EditableText_80; //  0x530 Size(8)
	struct Unknown HorizontalBox_191; //  0x538 Size(8)
	struct Unknown Image_153; //  0x540 Size(8)
	struct Unknown Image_204; //  0x548 Size(8)
	struct Unknown Image_414; //  0x550 Size(8)
	struct Unknown Key; //  0x558 Size(8)
	struct Unknown KeyImageMain; //  0x560 Size(8)
	struct Unknown KeyImageSub; //  0x568 Size(8)
	struct Unknown KeyLock; //  0x570 Size(8)
	struct Unknown LeftA; //  0x578 Size(8)
	struct Unknown LeftA_2; //  0x580 Size(8)
	struct Unknown LockMain; //  0x588 Size(8)
	struct Unknown LockSub; //  0x590 Size(8)
	struct Unknown MainBG; //  0x598 Size(8)
	struct Unknown MainKeyInput; //  0x5a0 Size(8)
	struct Unknown Overlay_215; //  0x5a8 Size(8)
	struct Unknown ProgressBar_150; //  0x5b0 Size(8)
	struct Unknown RightA; //  0x5b8 Size(8)
	struct Unknown RightA_2; //  0x5c0 Size(8)
	struct Unknown SelectBtn1; //  0x5c8 Size(8)
	struct Unknown SelectBtn2; //  0x5d0 Size(8)
	struct Unknown SelectBtn3; //  0x5d8 Size(8)
	struct Unknown SelectBtn4; //  0x5e0 Size(8)
	struct Unknown SelectBtn5; //  0x5e8 Size(8)
	struct Unknown SelectBtn6; //  0x5f0 Size(8)
	struct Unknown SelectType; //  0x5f8 Size(8)
	struct Unknown SelectValue; //  0x600 Size(8)
	struct Unknown Slider_139; //  0x608 Size(8)
	struct Unknown SliderType; //  0x610 Size(8)
	struct Unknown SubBG; //  0x618 Size(8)
	struct Unknown SubKeyInput; //  0x620 Size(8)
	struct Unknown T_Button; //  0x628 Size(8)
	struct Unknown Title_Text; //  0x630 Size(8)
	struct Unknown Up; //  0x638 Size(8)
	struct Unknown Value; //  0x640 Size(8)
	struct Unknown Value_2; //  0x648 Size(8)
	struct Unknown WidgetSwitcher_1; //  0x650 Size(8)
	struct Unknown WidgetSwitcher_281; //  0x658 Size(8)
	char Lock; //  0x660 Size(1)
	int32_t Selected; //  0x664 Size(4)
	int32_t TotalListSize; //  0x668 Size(4)
	struct TArray<Unknown> Empty; //  0x670 Size(10)
	struct Unknown ButtonStyle; //  0x680 Size(278)
	struct Unknown NewVar_1; //  0x8f8 Size(70)
	char SliderIsInit; //  0x968 Size(1)
	struct FText EmptyText; //  0x970 Size(18)
	int32_t TempSaveComboBoxIndex; //  0x988 Size(4)
	struct Unknown Temp; //  0x990 Size(20)
	float TempValue; //  0x9b0 Size(4)
	struct FText PreSliderText; //  0x9b8 Size(18)
	struct FString LResultString; //  0x9d0 Size(10)
	char have; //  0x9e0 Size(1)
	char IsOnEditableText; //  0x9e1 Size(1)
	char CompletSettingData; //  0x9e2 Size(1)
	struct Unknown CompleteSettingInfo; //  0x9e8 Size(88)
	struct Unknown TempSetting; //  0xa70 Size(88)
	char ReMarkComboBox; //  0xaf8 Size(1)

	void GetOrgKey(char IsSubKey, struct Unknown& Key); // Function SlotItemWidget.SlotItemWidget_C.GetOrgKey(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

