// WidgetBlueprintGeneratedClass SlotItemWidget.SlotItemWidget_C
class USlotItemWidget_C : public UBravoHotelSettingSlotWidget {

public:

	struct Unknown UberGraphFrame; // 0x4E8 (8)
	struct Unknown Over; // 0x4F0 (8)
	struct Unknown Button_107; // 0x4F8 (8)
	struct Unknown Button_441; // 0x500 (8)
	struct Unknown Button_Type; // 0x508 (8)
	struct Unknown ButtonType; // 0x510 (8)
	struct Unknown ComboBoxString_237; // 0x518 (8)
	struct Unknown ComboBoxType; // 0x520 (8)
	struct Unknown Down; // 0x528 (8)
	struct Unknown EditableText_80; // 0x530 (8)
	struct Unknown HorizontalBox_191; // 0x538 (8)
	struct Unknown Image_153; // 0x540 (8)
	struct Unknown Image_204; // 0x548 (8)
	struct Unknown Image_414; // 0x550 (8)
	struct Unknown Key; // 0x558 (8)
	struct Unknown KeyImageMain; // 0x560 (8)
	struct Unknown KeyImageSub; // 0x568 (8)
	struct Unknown KeyLock; // 0x570 (8)
	struct Unknown LeftA; // 0x578 (8)
	struct Unknown LeftA_2; // 0x580 (8)
	struct Unknown LockMain; // 0x588 (8)
	struct Unknown LockSub; // 0x590 (8)
	struct Unknown MainBG; // 0x598 (8)
	struct Unknown MainKeyInput; // 0x5A0 (8)
	struct Unknown Overlay_215; // 0x5A8 (8)
	struct Unknown ProgressBar_150; // 0x5B0 (8)
	struct Unknown RightA; // 0x5B8 (8)
	struct Unknown RightA_2; // 0x5C0 (8)
	struct Unknown SelectBtn1; // 0x5C8 (8)
	struct Unknown SelectBtn2; // 0x5D0 (8)
	struct Unknown SelectBtn3; // 0x5D8 (8)
	struct Unknown SelectBtn4; // 0x5E0 (8)
	struct Unknown SelectBtn5; // 0x5E8 (8)
	struct Unknown SelectBtn6; // 0x5F0 (8)
	struct Unknown SelectType; // 0x5F8 (8)
	struct Unknown SelectValue; // 0x600 (8)
	struct Unknown Slider_139; // 0x608 (8)
	struct Unknown SliderType; // 0x610 (8)
	struct Unknown SubBG; // 0x618 (8)
	struct Unknown SubKeyInput; // 0x620 (8)
	struct Unknown T_Button; // 0x628 (8)
	struct Unknown Title_Text; // 0x630 (8)
	struct Unknown Up; // 0x638 (8)
	struct Unknown Value; // 0x640 (8)
	struct Unknown Value_2; // 0x648 (8)
	struct Unknown WidgetSwitcher_1; // 0x650 (8)
	struct Unknown WidgetSwitcher_281; // 0x658 (8)
	char Lock : 0; // 0x660 (1)
	int32_t Selected SeleteValue; // 0x664 (4)
	int32_t TotalListSize; // 0x668 (4)
	struct TArray<Unknown> Empty; // 0x670 (16)
	struct Unknown ButtonStyle; // 0x680 (632)
	struct Unknown NewVar_1; // 0x8F8 (112)
	char SliderIsInit : 0; // 0x968 (1)
	struct FText EmptyText; // 0x970 (24)
	int32_t TempSaveComboBoxIndex; // 0x988 (4)
	struct Unknown Temp; // 0x990 (32)
	float TempValue; // 0x9B0 (4)
	struct FText PreSliderText; // 0x9B8 (24)
	struct FString LResultString; // 0x9D0 (16)
	char have. : 0; // 0x9E0 (1)
	char IsOnEditableText : 0; // 0x9E1 (1)
	char CompletSettingData : 0; // 0x9E2 (1)
	struct Unknown CompleteSettingInfo; // 0x9E8 (136)
	struct Unknown TempSetting; // 0xA70 (136)
	char ReMarkComboBox : 0; // 0xAF8 (1)

	void GetOrgKey(char IsSubKey, struct Unknown& Key); // Function SlotItemWidget.SlotItemWidget_C.GetOrgKey(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6E050>
	void GetCurKey(char IsSubKey, struct Unknown& Key); // Function SlotItemWidget.SlotItemWidget_C.GetCurKey(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6E050>
	struct Unknown OnKeyUp(struct Unknown MyGeometry, struct Unknown InKeyEvent); // Function SlotItemWidget.SlotItemWidget_C.OnKeyUp(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6E050>
