// BlueprintGeneratedClass SmartPingSystem.SmartPingSystem_C
class USmartPingSystem_C : public UBravoHotelSmartPingSystem {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x128 (8)
	struct FMulticastInlineDelegate RequestOnServer; // 0x130 (16)
	char SelectionMode; // 0x140 (1)
	float TimeoutBetweenPings; // 0x144 (4)
	struct TArray<float> PingTimeouts; // 0x148 (16)
	struct TArray<struct FName> ExecutingMenuIconIDs; // 0x158 (16)
	struct TArray<struct FBravoHotelSmartPingIconSettings> ExecutingMenuIconSettings; // 0x168 (16)
	struct APawn OwningPawn; // 0x178 (8)
	struct UWBP_SPS_SelectionMenu_C SelectionMenu; // 0x180 (8)
	struct FMulticastInlineDelegate ExecuteOwningClient; // 0x188 (16)
	char TraceMethod; // 0x198 (1)
	float TraceLength; // 0x19C (4)
	float TraceRadius; // 0x1A0 (4)
	char TraceChannel; // 0x1A4 (1)
	char TraceComplex : 0; // 0x1A5 (1)
	struct FMulticastInlineDelegate MenuActivated; // 0x1A8 (16)
	struct FMulticastInlineDelegate MenuDeactivated; // 0x1B8 (16)
	struct FMulticastInlineDelegate PingReceivedOnServer; // 0x1C8 (16)
	struct FBravoHotelPingInfo ExecutingPingInfo2; // 0x1D8 (56)
	char NoneHitActor : 0; // 0x210 (1)
	char IgnorInput : 0; // 0x211 (1)
	struct FName TempItemPingTableIndex; // 0x214 (8)
	char Enable Show : 0; // 0x21C (1)
	struct FName NewVar_1; // 0x220 (8)
	struct UBravoHotelMainWidget MainWidget; // 0x228 (8)
	enum class EPingType EnableEndPingType; // 0x230 (1)
	char IsSelectionMenuOnMap : 0; // 0x231 (1)
	struct FVector TmpLocationByMap; // 0x234 (12)
	struct FVector2D TmpMousePosition; // 0x240 (8)
	char IsVisibleSelectionMenu : 0; // 0x248 (1)
	char IsPressedCtrl : 0; // 0x249 (1)
	char FindPickUpItem : 0; // 0x24A (1)

	void Set Ping Tye(char IsPingType); // Function SmartPingSystem.SmartPingSystem_C.Set Ping Tye(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	void GetPingInfoByIndex(int32_t Index, struct FBravoHotelPingInfo& PingInfo); // Function SmartPingSystem.SmartPingSystem_C.GetPingInfoByIndex(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	void OnMapRightClick(struct FVector ServerLocation, int32_t PingTypeIndex, char IsAgree); // Function SmartPingSystem.SmartPingSystem_C.OnMapRightClick(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
