// WidgetBlueprintGeneratedClass SubTitleSlotWidget.SubTitleSlotWidget_C
class USubTitleSlotWidget_C : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Image; // 0x250 (8)
	struct Unknown Image_2; // 0x258 (8)
	struct Unknown Image_4; // 0x260 (8)
	struct Unknown Image_5; // 0x268 (8)
	struct Unknown Image_6; // 0x270 (8)
	struct Unknown Image_473; // 0x278 (8)
	struct Unknown TextBlock_1; // 0x280 (8)
	struct FText Title; // 0x288 (24)

	void Construct(); // Function SubTitleSlotWidget.SubTitleSlotWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Set(enum class Unknow SubType); // Function SubTitleSlotWidget.SubTitleSlotWidget_C.Set(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_SubTitleSlotWidget(int32_t EntryPoint); // Function SubTitleSlotWidget.SubTitleSlotWidget_C.ExecuteUbergraph_SubTitleSlotWidget(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

