// WidgetBlueprintGeneratedClass SubTitleSlotWidget.SubTitleSlotWidget_C
struct USubTitleSlotWidget_C : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Image; //  0x250 Size(8)
	struct Unknown Image_2; //  0x258 Size(8)
	struct Unknown Image_4; //  0x260 Size(8)
	struct Unknown Image_5; //  0x268 Size(8)
	struct Unknown Image_6; //  0x270 Size(8)
	struct Unknown Image_473; //  0x278 Size(8)
	struct Unknown TextBlock_1; //  0x280 Size(8)
	struct FText Title; //  0x288 Size(18)

	void Construct(); // Function SubTitleSlotWidget.SubTitleSlotWidget_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

