// Enum Synthesis.ESynth1Patch
enum class ESynth1Patch : uint8 {
	ESynth1Patch = 0,
	ESynth1Patch = 1,
	ESynth1Patch = 2,
	ESynth1Patch = 3,
	ESynth1Patch = 4,
	ESynth1Patch = 5,
	ESynth1Patch = 6,
	ESynth1Patch = 7,
	ESynth1Patch = 8,
	ESynth1Patch = 9,
	ESynth1Patch = 10,
	ESynth1Patch = 11,
	ESynth1Patch = 12,
	ESynth1Patch = 13,
	ESynth1Patch = 14,
	ESynth1Patch = 15
};

// Enum Synthesis.ESynth1PatchSource
enum class ESynth1PatchSource : uint8 {
	ESynth1PatchSource = 0,
	ESynth1PatchSource = 1,
	ESynth1PatchSource = 2,
	ESynth1PatchSource = 3,
	ESynth1PatchSource = 4,
	ESynth1PatchSource = 5
};

// Enum Synthesis.ESynthStereo
enum class ESynthStereo : uint8 {
	ESynthStereo = 0,
	ESynthStereo = 1,
	ESynthStereo = 2,
	ESynthStereo = 3,
	ESynthStereo = 4
};

// Enum Synthesis.ESynthFilterAlgorithm
enum class ESynthFilterAlgorithm : uint8 {
	ESynthFilterAlgorithm = 0,
	ESynthFilterAlgorithm = 1,
	ESynthFilterAlgorithm = 2,
	ESynthFilterAlgorithm = 3,
	ESynthFilterAlgorithm = 4
};

// Enum Synthesis.ESynthFilterType
enum class ESynthFilterType : uint8 {
	ESynthFilterType = 0,
	ESynthFilterType = 1,
	ESynthFilterType = 2,
	ESynthFilterType = 3,
	ESynthFilterType = 4,
	ESynthFilterType = 5
};

// Enum Synthesis.ESynthModEnvBiasPatch
enum class ESynthModEnvBiasPatch : uint8 {
	ESynthModEnvBiasPatch = 0,
	ESynthModEnvBiasPatch = 1,
	ESynthModEnvBiasPatch = 2,
	ESynthModEnvBiasPatch = 3,
	ESynthModEnvBiasPatch = 4,
	ESynthModEnvBiasPatch = 5,
	ESynthModEnvBiasPatch = 6,
	ESynthModEnvBiasPatch = 7,
	ESynthModEnvBiasPatch = 8,
	ESynthModEnvBiasPatch = 9
};

// Enum Synthesis.ESynthModEnvPatch
enum class ESynthModEnvPatch : uint8 {
	ESynthModEnvPatch = 0,
	ESynthModEnvPatch = 1,
	ESynthModEnvPatch = 2,
	ESynthModEnvPatch = 3,
	ESynthModEnvPatch = 4,
	ESynthModEnvPatch = 5,
	ESynthModEnvPatch = 6,
	ESynthModEnvPatch = 7,
	ESynthModEnvPatch = 8,
	ESynthModEnvPatch = 9
};

// Enum Synthesis.ESynthLFOPatchType
enum class ESynthLFOPatchType : uint8 {
	ESynthLFOPatchType = 0,
	ESynthLFOPatchType = 1,
	ESynthLFOPatchType = 2,
	ESynthLFOPatchType = 3,
	ESynthLFOPatchType = 4,
	ESynthLFOPatchType = 5,
	ESynthLFOPatchType = 6,
	ESynthLFOPatchType = 7,
	ESynthLFOPatchType = 8,
	ESynthLFOPatchType = 9,
	ESynthLFOPatchType = 10
};

// Enum Synthesis.ESynthLFOMode
enum class ESynthLFOMode : uint8 {
	ESynthLFOMode = 0,
	ESynthLFOMode = 1,
	ESynthLFOMode = 2,
	ESynthLFOMode = 3,
	ESynthLFOMode = 4
};

// Enum Synthesis.ESynthLFOType
enum class ESynthLFOType : uint8 {
	ESynthLFOType = 0,
	ESynthLFOType = 1,
	ESynthLFOType = 2,
	ESynthLFOType = 3,
	ESynthLFOType = 4,
	ESynthLFOType = 5,
	ESynthLFOType = 6,
	ESynthLFOType = 7,
	ESynthLFOType = 8
};

// Enum Synthesis.ESynth1OscType
enum class ESynth1OscType : uint8 {
	ESynth1OscType = 0,
	ESynth1OscType = 1,
	ESynth1OscType = 2,
	ESynth1OscType = 3,
	ESynth1OscType = 4,
	ESynth1OscType = 5,
	ESynth1OscType = 6
};

// Enum Synthesis.ESourceEffectDynamicsPeakMode
enum class ESourceEffectDynamicsPeakMode : uint8 {
	ESourceEffectDynamicsPeakMode = 0,
	ESourceEffectDynamicsPeakMode = 1,
	ESourceEffectDynamicsPeakMode = 2,
	ESourceEffectDynamicsPeakMode = 3,
	ESourceEffectDynamicsPeakMode = 4
};

// Enum Synthesis.ESourceEffectDynamicsProcesde
enum class ESourceEffectDynamicsProces : uint8 {
	ESourceEffectDynamicsProcesde = 0,
	ESourceEffectDynamicsProces = 1,
	ESourceEffectDynamicsProces = 2,
	ESourceEffectDynamicsProces = 3,
	ESourceEffectDynamicsProces = 4,
	ESourceEffectDynamicsProces = 5
};

// Enum Synthesis.EEnvelopeFollowerPeakMode
enum class EEnvelopeFollowerPeakMode : uint8 {
	EEnvelopeFollowerPeakMode = 0,
	EEnvelopeFollowerPeakMode = 1,
	EEnvelopeFollowerPeakMode = 2,
	EEnvelopeFollowerPeakMode = 3,
	EEnvelopeFollowerPeakMode = 4
};

// Enum Synthesis.ESourceEffectFilterType
enum class ESourceEffectFilterType : uint8 {
	ESourceEffectFilterType = 0,
	ESourceEffectFilterType = 1,
	ESourceEffectFilterType = 2,
	ESourceEffectFilterType = 3,
	ESourceEffectFilterType = 4,
	ESourceEffectFilterType = 5
};

// Enum Synthesis.ESourceEffectFilterCircuit
enum class ESourceEffectFilterCircuit : uint8 {
	ESourceEffectFilterCircuit = 0,
	ESourceEffectFilterCircuit = 1,
	ESourceEffectFilterCircuit = 2,
	ESourceEffectFilterCircuit = 3,
	ESourceEffectFilterCircuit = 4
};

// Enum Synthesis.EStereoChannelMode
enum class EStereoChannelMode : uint8 {
	EStereoChannelMode = 0,
	EStereoChannelMode = 1,
	EStereoChannelMode = 2,
	EStereoChannelMode = 3
};

// Enum Synthesis.EPhaserLFOType
enum class EPhaserLFOType : uint8 {
	EPhaserLFOType = 0,
	EPhaserLFOType = 1,
	EPhaserLFOType = 2,
	EPhaserLFOType = 3,
	EPhaserLFOType = 4,
	EPhaserLFOType = 5,
	EPhaserLFOType = 6,
	EPhaserLFOType = 7,
	EPhaserLFOType = 8
};

// Enum Synthesis.ERingModulatorTypeSourceEffect
enum class ERingModulatorTypeSourceEffect : uint8 {
	ERingModulatorTypeSourceEffect = 0,
	ERingModulatorTypeSourceEffect = 1,
	ERingModulatorTypeSourceEffect = 2,
	ERingModulatorTypeSourceEffect = 3,
	ERingModulatorTypeSourceEffect = 4,
	ERingModulatorTypeSourceEffect = 5
};

// Enum Synthesis.EStereoDelaySourceEffect
enum class EStereoDelaySourceEffect : uint8 {
	EStereoDelaySourceEffect = 0,
	EStereoDelaySourceEffect = 1,
	EStereoDelaySourceEffect = 2,
	EStereoDelaySourceEffect = 3,
	EStereoDelaySourceEffect = 4
};

// Enum Synthesis.ESubmixEffectConvolutionReverbBlockSize
enum class ESubmixEffectConvolutionReverbBlockSize : uint8 {
	ESubmixEffectConvolutionReverbBlockSize = 0,
	ESubmixEffectConvolutionReverbBlockSize = 1,
	ESubmixEffectConvolutionReverbBlockSize = 2,
	ESubmixEffectConvolutionReverbBlockSize = 3
};

// Enum Synthesis.ESubmixFilterAlgorithm
enum class ESubmixFilterAlgorithm : uint8 {
	ESubmixFilterAlgorithm = 0,
	ESubmixFilterAlgorithm = 1,
	ESubmixFilterAlgorithm = 2,
	ESubmixFilterAlgorithm = 3,
	ESubmixFilterAlgorithm = 4
};

// Enum Synthesis.ESubmixFilterType
enum class ESubmixFilterType : uint8 {
	ESubmixFilterType = 0,
	ESubmixFilterType = 1,
	ESubmixFilterType = 2,
	ESubmixFilterType = 3,
	ESubmixFilterType = 4,
	ESubmixFilterType = 5
};

// Enum Synthesis.ETapLineMode
enum class ETapLineMode : uint8 {
	ETapLineMode = 0,
	ETapLineMode = 1,
	ETapLineMode = 2,
	ETapLineMode = 3
};

// Enum Synthesis.EGranularSynthSeekType
enum class EGranularSynthSeekType : uint8 {
	EGranularSynthSeekType = 0,
	EGranularSynthSeekType = 1,
	EGranularSynthSeekType = 2,
	EGranularSynthSeekType = 3
};

// Enum Synthesis.EGranularSynthEnvelopeType
enum class EGranularSynthEnvelopeType : uint8 {
	EGranularSynthEnvelopeType = 0,
	EGranularSynthEnvelopeType = 1,
	EGranularSynthEnvelopeType = 2,
	EGranularSynthEnvelopeType = 3,
	EGranularSynthEnvelopeType = 4,
	EGranularSynthEnvelopeType = 5,
	EGranularSynthEnvelopeType = 6,
	EGranularSynthEnvelopeType = 7,
	EGranularSynthEnvelopeType = 8,
	EGranularSynthEnvelopeType = 9,
	EGranularSynthEnvelopeType = 10,
	EGranularSynthEnvelopeType = 11,
	EGranularSynthEnvelopeType = 12,
	EGranularSynthEnvelopeType = 13,
	EGranularSynthEnvelopeType = 14,
	EGranularSynthEnvelopeType = 15
};

// Enum Synthesis.CurveInterpolationType
enum class CurveInterpolationType : uint8 {
	CurveInterpolationType = 0,
	CurveInterpolationType = 1,
	CurveInterpolationType = 2,
	CurveInterpolationType = 3
};

// Enum Synthesis.ESamplePlayerSeekType
enum class ESamplePlayerSeekType : uint8 {
	ESamplePlayerSeekType = 0,
	ESamplePlayerSeekType = 1,
	ESamplePlayerSeekType = 2,
	ESamplePlayerSeekType = 3,
	ESamplePlayerSeekType = 4
};

// Enum Synthesis.ESynthKnobSize
enum class ESynthKnobSize : uint8 {
	ESynthKnobSize = 0,
	ESynthKnobSize = 1,
	ESynthKnobSize = 2,
	ESynthKnobSize = 3
};

// Enum Synthesis.ESynthSlateColorStyle
enum class ESynthSlateColorStyle : uint8 {
	ESynthSlateColorStyle = 0,
	ESynthSlateColorStyle = 1,
	ESynthSlateColorStyle = 2,
	ESynthSlateColorStyle = 3
};

// Enum Synthesis.ESynthSlateSizeType
enum class ESynthSlateSizeType : uint8 {
	ESynthSlateSizeType = 0,
	ESynthSlateSizeType = 1,
	ESynthSlateSizeType = 2,
	ESynthSlateSizeType = 3,
	ESynthSlateSizeType = 4
};

// Class Synthesis.ModularSynthPresetBank
struct UModularSynthPresetBank : Object {
	struct TArray<Unknown> Presets; //  0x28 Size(10)
};

// Class Synthesis.ModularSynthComponent
struct UModularSynthComponent : USynthComponent {
	int32_t VoiceCount; //  0x710 Size(4)

	void SetSynthPreset(struct Unknown& SynthPreset); // Function Synthesis.ModularSynthComponent.SetSynthPreset(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x18d8510>
};

// Class Synthesis.SourceEffectBitCrusherPreset
struct USourceEffectBitCrusherPreset : USoundEffectSourcePreset {
	struct Unknown Settings; //  0x70 Size(8)

	void SetSettings(struct Unknown& InSettings); // Function Synthesis.SourceEffectBitCrusherPreset.SetSettings(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x18e0120>
};

// Class Synthesis.SourceEffectChorusPreset
struct USourceEffectChorusPreset : USoundEffectSourcePreset {
	struct Unknown Settings; //  0x80 Size(18)

	void SetSettings(struct Unknown& InSettings); // Function Synthesis.SourceEffectChorusPreset.SetSettings(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x18e01d0>
};

// Class Synthesis.SourceEffect
struct USourceEffect : USoundEffectSourcePreset {
	struct Unknown Settings; //  0x90 Size(28)

	void SetSettings(struct Unknown& InSettings); // Function Synthesis.SourceEffect.SetSettings(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x18e0280>
};

// Class Synthesis.EnvelopeFollowerListener
struct UEnvelopeFollowerListener : UActorComponent {
	struct FMulticastInlineDelegate OnEnvelopeFollowerUpdate; //  0xb0 Size(10)
};

// Class Synthesis.SourceEffectEnvelopeFollowerPreset
struct USourceEffectEnvelopeFollowerPreset : USoundEffectSourcePreset {
	struct Unknown Settings; //  0x74 Size(c)

	void UnregisterEnvelopeFollowerListener(struct Unknown EnvelopeFollowerListener); // Function Synthesis.SourceEffectEnvelopeFollowerPreset.UnregisterEnvelopeFollowerListener(Final|Native|Public|BlueprintCallable) // <Game+0x18e0a00>
};

// Class Synthesis.SourceEffectEQPreset
struct USourceEffectEQPreset : USoundEffectSourcePreset {
	struct Unknown Settings; //  0x78 Size(10)

	void SetSettings(struct Unknown& InSettings); // Function Synthesis.SourceEffectEQPreset.SetSettings(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x18e0330>
};

// Class Synthesis.SourceEffectFilterPreset
struct USourceEffectFilterPreset : USoundEffectSourcePreset {
	struct Unknown Settings; //  0x74 Size(c)

	void SetSettings(struct Unknown& InSettings); // Function Synthesis.SourceEffectFilterPreset.SetSettings(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x18e0490>
};

// Class Synthesis.SourceEffectFoldback
struct USourceEffectFoldback : USoundEffectSourcePreset {
	struct Unknown Settings; //  0x74 Size(c)

	void SetSettings(struct Unknown& InSettings); // Function Synthesis.SourceEffectFoldbackDset.SetSettings(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x18e0540>
};

// Class Synthesis.SourceEffectMidSideSpreaderPreset
struct USourceEffectMidSideSpreaderPreset : USoundEffectSourcePreset {
	struct Unknown Settings; //  0x74 Size(c)

	void SetSettings(struct Unknown& InSettings); // Function Synthesis.SourceEffectMidSideSpreaderPreset.SetSettings(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x18e05f0>
};

// Class Synthesis.SourceEffectPannerPreset
struct USourceEffectPannerPreset : USoundEffectSourcePreset {
	struct Unknown Settings; //  0x70 Size(8)

	void SetSettings(struct Unknown& InSettings); // Function Synthesis.SourceEffectPannerPreset.SetSettings(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x18e06a0>
};

// Class Synthesis.SourceEffectPhaserPreset
struct USourceEffectPhaserPreset : USoundEffectSourcePreset {
	struct Unknown Settings; //  0x78 Size(10)

	void SetSettings(struct Unknown& InSettings); // Function Synthesis.SourceEffectPhaserPreset.SetSettings(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x18e0750>
};

// Class Synthesis.SourceEffectRingModulationPreset
struct USourceEffectRingModulationPreset : USoundEffectSourcePreset {
	struct Unknown Settings; //  0x7c Size(14)

	void SetSettings(struct Unknown& InSettings); // Function Synthesis.SourceEffectRingModulationPreset.SetSettings(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x18e0810>
};

// Class Synthesis.SourceEffectSimpleDelayPres
struct USourceEffectSimpleDelayPres : USoundEffectSourcePreset {
	struct Unknown Settings; //  0x80 Size(18)

	void SetSettings(struct Unknown& InSettings); // Function Synthesis.SourceEffectSimpleDelayPres.SetSettings(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x18e08b0>
};

// Class Synthesis.SourceEffectStereoDelayPres
struct USourceEffectStereoDelayPres : USoundEffectSourcePreset {
	struct Unknown Settings; //  0x7c Size(14)

	void SetSettings(struct Unknown& InSettings); // Function Synthesis.SourceEffectStereoDelayPres.SetSettings(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x18e0960>
};

// Class Synthesis.SourceEffectWaveShaperPreset
struct USourceEffectWaveShaperPreset : USoundEffectSourcePreset {
	struct Unknown Settings; //  0x70 Size(8)

	void SetSettings(struct Unknown& InSettings); // Function Synthesis.SourceEffectWaveShaperPreset.SetSettings(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x18e06a0>
};

// Class Synthesis.AudioImpulseResponse
struct UAudioImpulseResponse : Object {
	struct TArray<Unknown> ImpulseResponse; //  0x28 Size(10)
	int32_t NumChannels; //  0x38 Size(4)
	int32_t SampleRate; //  0x3c Size(4)
	float NormalizationVolumeDb; //  0x40 Size(4)
	struct TArray<Unknown> IRData; //  0x48 Size(10)
};

// Class Synthesis.SubmixEffectConvolutionReverbPreset
struct USubmixEffectConvolutionReverbPreset : USoundEffectSubmixPreset {
	struct Unknown Settings; //  0x40 Size(20)
	struct Unknown ImpulseResponse; //  0x60 Size(8)
	enum class Unknow BlockSize; //  0x68 Size(1)
	char bEnableHardwareAcceleration; //  0x69 Size(1)

	void SetSettings(struct Unknown& InSettings); // Function Synthesis.SubmixEffectConvolutionReverbPreset.SetSettings(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x18e5b50>
};

// Class Synthesis.SubmixEffect
struct USubmixEffect : USoundEffectSubmixPreset {
	struct Unknown Settings; //  0x74 Size(c)
	struct Unknown DynamicSettings; //  0x80 Size(c)

	void SetSettings(struct Unknown& InSettings); // Function Synthesis.SubmixEffect.SetSettings(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x18e5bf0>
};

// Class Synthesis.SubmixEffectFilterPreset
struct USubmixEffectFilterPreset : USoundEffectSubmixPreset {
	struct Unknown Settings; //  0x74 Size(c)

	void SetSettings(struct Unknown& InSettings); // Function Synthesis.SubmixEffectFilterPreset.SetSettings(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x18e5cb0>
};

// Class Synthesis.SubmixEffectFlexiverbPreset
struct USubmixEffectFlexiverbPreset : USoundEffectSubmixPreset {
	struct Unknown Settings; //  0x78 Size(10)

	void SetSettings(struct Unknown& InSettings); // Function Synthesis.SubmixEffectFlexiverbPreset.SetSettings(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x18e5d60>
};

// Class Synthesis.SubmixEffectTapDelayPreset
struct USubmixEffectTapDelayPreset : USoundEffectSubmixPreset {
	struct Unknown Settings; //  0x80 Size(18)

	void SetTap(int32_t TapId, struct Unknown& TapInfo); // Function Synthesis.SubmixEffectTapDelayPreset.SetTap(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game+0x18e60e0>
};

// Class Synthesis.Synth2DSlider
struct USynth2DSlider : UWidget {
	float ValueX; //  0x108 Size(4)
	float ValueY; //  0x10c Size(4)
	struct FDelegate ValueXDelegate; //  0x110 Size(10)
	struct FDelegate ValueYDelegate; //  0x120 Size(10)
	struct Unknown WidgetStyle; //  0x130 Size(2b8)
	struct Unknown SliderHandleColor; //  0x3e8 Size(10)
	char IndentHandle; //  0x3f8 Size(1)
	char Locked; //  0x3f9 Size(1)
	float StepSize; //  0x3fc Size(4)
	char IsFocusable; //  0x400 Size(1)
	struct FMulticastInlineDelegate OnMouseCaptureBegin; //  0x408 Size(10)
	struct FMulticastInlineDelegate OnMouseCaptureEnd; //  0x418 Size(10)
	struct FMulticastInlineDelegate OnControllerCaptureBegin; //  0x428 Size(10)
	struct FMulticastInlineDelegate OnControllerCaptureEnd; //  0x438 Size(10)
	struct FMulticastInlineDelegate OnValueChangedX; //  0x448 Size(10)
	struct FMulticastInlineDelegate OnValueChangedY; //  0x458 Size(10)

	void SetValue(struct Unknown InValue); // Function Synthesis.Synth2DSlider.SetValue(Final|Native|Public|HasDefaults|BlueprintCallable) // <Game+0x18e61c0>
};

// Class Synthesis.GranularSynth
struct UGranularSynth : USynthComponent {
	struct Unknown GranulatedSoundWave; //  0x710 Size(8)

	void SetSustainGain(float SustainGain); // Function Synthesis.GranularSynth.SetSustainGain(Final|Native|Public|BlueprintCallable) // <Game+0x18e6060>
};

// Class Synthesis.MonoWaveTableSynthPreset
struct UMonoWaveTableSynthPreset : Object {
	struct FString PresetName; //  0x28 Size(10)
	char bLockKeyframesToGridBool; //  0x38 Size(1)
	int32_t LockKeyframesToGrid; //  0x3c Size(4)
	int32_t WaveTableResolution; //  0x40 Size(4)
	struct TArray<Unknown> WaveTable; //  0x48 Size(10)
	char bNormalizeWaveTables; //  0x58 Size(1)
};

// Class Synthesis.SynthComponentMonoWaveTable
struct USynthComponentMonoWaveTable : USynthComponent {
	struct FMulticastInlineDelegate OnTableAltered; //  0x710 Size(10)
	struct FMulticastInlineDelegate OnNumTablesChanged; //  0x720 Size(10)
	struct Unknown CurrentPreset; //  0x730 Size(8)

	void SetWaveTablePosition(float InPosition); // Function Synthesis.SynthComponentMonoWaveTable.SetWaveTablePosition(Final|Native|Public|BlueprintCallable) // <Game+0x18e9840>
};

// Class Synthesis.SynthSamplePlayer
struct USynthSamplePlayer : USynthComponent {
	struct Unknown SoundWave; //  0x710 Size(8)
	struct FMulticastInlineDelegate OnSampleLoaded; //  0x718 Size(10)
	struct FMulticastInlineDelegate OnSamplePlaybackProgress; //  0x728 Size(10)

	void SetSoundWave(struct Unknown InSoundWave); // Function Synthesis.SynthSamplePlayer.SetSoundWave(Final|Native|Public|BlueprintCallable) // <Game+0x18e9630>
};

// Class Synthesis.SynthKnob
struct USynthKnob : UWidget {
	float Value; //  0x108 Size(4)
	float StepSize; //  0x10c Size(4)
	float MouseSpeed; //  0x110 Size(4)
	float MouseFineTuneSpeed; //  0x114 Size(4)
	char ShowTooltipInfo; //  0x118 Size(1)
	struct FText ParameterName; //  0x120 Size(18)
	struct FText ParameterUnits; //  0x138 Size(18)
	struct FDelegate ValueDelegate; //  0x150 Size(10)
	struct Unknown WidgetStyle; //  0x160 Size(238)
	char Locked; //  0x398 Size(1)
	char IsFocusable; //  0x399 Size(1)
	struct FMulticastInlineDelegate OnMouseCaptureBegin; //  0x3a0 Size(10)
	struct FMulticastInlineDelegate OnMouseCaptureEnd; //  0x3b0 Size(10)
	struct FMulticastInlineDelegate OnControllerCaptureBegin; //  0x3c0 Size(10)
	struct FMulticastInlineDelegate OnControllerCaptureEnd; //  0x3d0 Size(10)
	struct FMulticastInlineDelegate OnValueChanged; //  0x3e0 Size(10)

	void SetValue(float InValue); // Function Synthesis.SynthKnob.SetValue(Final|Native|Public|BlueprintCallable) // <Game+0x18e97c0>
};

