// WidgetBlueprintGeneratedClass Temp.Temp_C
struct UTemp_C : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Image_66; //  0x250 Size(8)
	struct Unknown Image_113; //  0x258 Size(8)
	struct Unknown Image_181; //  0x260 Size(8)
	struct Unknown Image_246; //  0x268 Size(8)
	struct Unknown Image_312; //  0x270 Size(8)
	struct Unknown Image_314; //  0x278 Size(8)
	struct Unknown Image_315; //  0x280 Size(8)
	struct Unknown Image_316; //  0x288 Size(8)
	struct Unknown Image_317; //  0x290 Size(8)
	struct Unknown Image_318; //  0x298 Size(8)
	struct Unknown Image_319; //  0x2a0 Size(8)

	void GetImage(int32_t Index, struct Unknown& Image); // Function Temp.Temp_C.GetImage(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

