// WidgetBlueprintGeneratedClass Temp.Temp_C
class UTemp_C : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Image_66; // 0x250 (8)
	struct Unknown Image_113; // 0x258 (8)
	struct Unknown Image_181; // 0x260 (8)
	struct Unknown Image_246; // 0x268 (8)
	struct Unknown Image_312; // 0x270 (8)
	struct Unknown Image_314; // 0x278 (8)
	struct Unknown Image_315; // 0x280 (8)
	struct Unknown Image_316; // 0x288 (8)
	struct Unknown Image_317; // 0x290 (8)
	struct Unknown Image_318; // 0x298 (8)
	struct Unknown Image_319; // 0x2A0 (8)

	void GetImage(int32_t Index, struct Unknown& Image); // Function Temp.Temp_C.GetImage(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Set(struct TArray<Unknown>& List); // Function Temp.Temp_C.Set(HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_Temp(int32_t EntryPoint); // Function Temp.Temp_C.ExecuteUbergraph_Temp(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

