// WidgetBlueprintGeneratedClass U.U
class UU : public UU {

public:

	struct Unknown UberGraphFrame; // 0x1360 (8)
	struct Unknown Ani_Tutorial_Glow; // 0x1368 (8)
	struct Unknown P_Upgrade_Arrow; // 0x1370 (8)
	struct Unknown C_SlotHover_ItemState_Hide; // 0x1378 (8)
	struct Unknown C_SlotHover_ItemState_Show; // 0x1380 (8)
	struct Unknown Hover_Gold; // 0x1388 (8)
	struct Unknown P_SlotHover; // 0x1390 (8)
	struct Unknown BGImage; // 0x1398 (8)
	struct Unknown CanvasPanel_ITemState; // 0x13A0 (8)
	struct Unknown Count; // 0x13A8 (8)
	struct Unknown Effect_Craft; // 0x13B0 (8)
	struct Unknown HorizontalBox_Rarity; // 0x13B8 (8)
	struct Unknown HoverImage; // 0x13C0 (8)
	struct Unknown HoverImage_Gold; // 0x13C8 (8)
	struct Unknown IconRepair; // 0x13D0 (8)
	struct Unknown Image_1; // 0x13D8 (8)
	struct Unknown Image_2; // 0x13E0 (8)
	struct Unknown Image_222; // 0x13E8 (8)
	struct Unknown ItemImage; // 0x13F0 (8)
	struct Unknown ItemNameName; // 0x13F8 (8)
	struct Unknown ItemState_Text; // 0x1400 (8)
	struct Unknown NeedMaterial; // 0x1408 (8)
	struct Unknown Overlay_Key; // 0x1410 (8)
	struct Unknown ProgressBar_475; // 0x1418 (8)
	struct Unknown SizeBox_1; // 0x1420 (8)
	struct Unknown TextBlock_ShortCut; // 0x1428 (8)
	struct Unknown Tutorial_Glow; // 0x1430 (8)
	struct Unknown U; // 0x1438 (8)
	struct Unknown U; // 0x1440 (8)
	struct Unknown WeaponItemImage; // 0x1448 (8)
	char bGold : 0; // 0x1450 (1)
	struct Unknown SelectedHoverImage; // 0x1458 (8)
	struct Unknown MedicalBGColor; // 0x1460 (16)
	struct FMulticastInlineDelegate SetSlotInfo; // 0x1470 (16)
	int32_t SlotIndex; // 0x1480 (4)
	struct FName RecipeKey; // 0x1484 (8)
	struct Unknown RecipeData; // 0x1490 (56)
	char bLeftClicked : 0; // 0x14C8 (1)
	char CanCraft : 0; // 0x14C9 (1)

	void Get(char& bResult, struct Unknown& WeaponInfo); // Function U.U.Get(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetKeyNameFromKey(struct Unknown& Key, struct FString& Name, char& bRet); // Function U.U.GetKeyNameFromKey(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetKeyText(); // Function U.U.SetKeyText(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRightClickBig(); // Function U.U.SetRightClickBig(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRightClickSmall(char IsVisible); // Function U.U.SetRightClickSmall(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnMouseButtonDown(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnMouseButtonUp(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonUp(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetInfo(struct FName RecipeKey, int32_t SlotIndex); // Function U.U.SetInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetItemRarityColor(enum class Unknow CurrentSlot, struct Unknown ImageWidget); // Function U.U.SetItemRarityColor(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void MouseEnterImpl(); // Function U.U.MouseEnterImpl(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetWeaponImage_Internal(struct Unknown IconTexture); // Function U.U.SetWeaponImage_Internal(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown Set(struct Unknown IconTexture); // Function U.U.Set(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsDraging(char& bResult); // Function U.U.IsDraging(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	char OnDrop(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.OnDrop(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnDragDetected(struct Unknown MyGeometry, struct Unknown& PointerEvent, struct Unknown& Operation); // Function U.U.OnDragDetected(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnRButtonClick(char& bResult); // Function U.U.OnRButtonClick(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown Set_BGImage_Brush_1(); // Function U.U.Set_BGImage_Brush_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown SetItemImage(); // Function U.U.SetItemImage(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_DABF06DE406801A7910E4CB19855F653(struct Unknown Loaded); // Function U.U.OnLoaded_DABF06DE406801A7910E4CB19855F653(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function U.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadIconTexture(struct Unknown IconTexture); // Function U.U.AsyncLoadIconTexture(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnUpdateCastingDelegateEvent(struct Unknown& CastingInfo, float CastingPercent); // Function U.U.OnUpdateCastingDelegateEvent(HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetSlotInfo__DelegateSignature(struct Unknown TargetActor, struct Unknown ItemInfo); // Function U.U.SetSlotInfo__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown Image_112; // 0x248 (8)
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown TextBlock_Gold; // 0x248 (8)
	struct Unknown TextBlock_Title; // 0x250 (8)
	struct Unknown ColorType1; // 0x258 (40)
	struct Unknown ColorType2; // 0x280 (40)

	void Init(struct FText Title, int32_t Value); // Function U.U.Init(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown U; // 0x250 (8)
	struct Unknown HoverWidget; // 0x258 (8)

	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown EnemySkull; // 0x250 (8)
	struct Unknown Image_436; // 0x258 (8)
	struct Unknown Pawn; // 0x260 (8)

	void SetDiedPawnInfo(struct Unknown BroadCastInfo); // Function U.U.SetDiedPawnInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartAnim(); // Function U.U.StartAnim(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartSetPosition(); // Function U.U.StartSetPosition(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Button_Main; // 0x250 (8)
	struct Unknown Image_ClassIcon; // 0x258 (8)
	struct Unknown Image_ComingSoonBg; // 0x260 (8)
	struct Unknown Image_Disabled; // 0x268 (8)
	struct Unknown Image_Outline; // 0x270 (8)
	struct Unknown Image_Push; // 0x278 (8)
	struct Unknown Overlay_Main; // 0x280 (8)
	struct Unknown T_ComingSoon; // 0x288 (8)
	struct Unknown U; // 0x290 (8)
	struct Unknown U_2; // 0x298 (8)
	struct Unknown U_3; // 0x2A0 (8)
	struct Unknown U; // 0x2A8 (8)
	struct Unknown VerticalBox_Selected; // 0x2B0 (8)
	struct Unknown PerkDeckClassInfo; // 0x2B8 (40)
	int32_t SelectedNum; // 0x2E0 (4)
	int32_t SelectedMinIndex; // 0x2E4 (4)
	struct FMulticastInlineDelegate ChooseClass; // 0x2E8 (16)
	int32_t ClassIndex; // 0x2F8 (4)
	struct FMulticastInlineDelegate HoverClass; // 0x300 (16)
	char bIsLocalSelected : 0; // 0x310 (1)
	char bIsSelected : 0; // 0x311 (1)
	struct Unknown CurrentPerkDeckData; // 0x318 (1200)
	char bIsDuplicateSelectPossible : 0; // 0x7C8 (1)
	char bButtonDisabled : 0; // 0x7C9 (1)
	char bNoUpdatedDisabled : 0; // 0x7CA (1)
	char bIsBlocked : 0; // 0x7CB (1)

	void SetBlocked(char IsBlocked, char ComingSoon); // Function U.U.SetBlocked(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DisableWithoutSelected(); // Function U.U.DisableWithoutSelected(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateButtonDisabled(); // Function U.U.UpdateButtonDisabled(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateOutLine(); // Function U.U.UpdateOutLine(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetSelectedInfo(struct Unknown& PlayerState); // Function U.U.SetSelectedInfo(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetSelected(); // Function U.U.ResetSelected(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkDeckClassInfoByRowName(struct FName RowName); // Function U.U.SetPerkDeckClassInfoByRowName(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkDeckClassInfo(struct Unknown& PerkDeckClassInfo, int32_t ClassIndex); // Function U.U.SetPerkDeckClassInfo(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_4ECB692A48B41C9343CA15BDA4F3DA1C(struct Unknown Loaded); // Function U.U.OnLoaded_4ECB692A48B41C9343CA15BDA4F3DA1C(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_101_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_101_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_101_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_101_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Main_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Main_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadingClassSelectIcon(struct Unknown Texture); // Function U.U.AsyncLoadingClassSelectIcon(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverClass__DelegateSignature(int32_t ClassIndex, char IsHoverd); // Function U.U.HoverClass__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ChooseClass__DelegateSignature(int32_t ClassIndex); // Function U.U.ChooseClass__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelVoiceTalkWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Image; // 0x250 (8)
	struct Unknown ScrollBox_99; // 0x258 (8)
	struct Unknown U; // 0x260 (8)
	struct Unknown U_135; // 0x268 (8)
	struct Unknown U_196; // 0x270 (8)
	struct TArray<Unknown> TempTeamPlayers; // 0x278 (16)

	void CheckCreateSlot(char& bRet); // Function U.U.CheckCreateSlot(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ChangeVolumeState(struct Unknown VoiceTalkState); // Function U.U.ChangeVolumeState(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown GoldImage; // 0x250 (8)
	struct Unknown Image_362; // 0x258 (8)
	struct Unknown Message; // 0x260 (8)
	struct Unknown PriceValue; // 0x268 (8)
	struct Unknown SizeBox_2; // 0x270 (8)

	void SetPriceData(struct FText ItemName, int32_t Price); // Function U.U.SetPriceData(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetData(struct FText Msg); // Function U.U.SetData(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelNetworkDelayWidget {

public:

	struct Unknown Image_350; // 0x260 (8)
	struct Unknown Image_409; // 0x268 (8)
	struct Unknown Image_479; // 0x270 (8)
	struct Unknown Image_564; // 0x278 (8)
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelScopeWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Idle; // 0x250 (8)
	struct Unknown Scope_In; // 0x258 (8)
	struct Unknown CanvasPanel_1; // 0x260 (8)
	struct Unknown Scope_Center; // 0x268 (8)
	struct Unknown Scope_Center_Dot; // 0x270 (8)

	void SetScopeImageAngle(float NewAngle); // Function U.U.SetScopeImageAngle(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_OnEnterADS(); // Function U.U.K2_OnEnterADS(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_OnExitADS(); // Function U.U.K2_OnExitADS(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelReplayPlayerListGroup {

public:

	struct Unknown UberGraphFrame; // 0x260 (8)
	struct Unknown Img_TeamColor; // 0x268 (8)
	struct Unknown T_TeamNum; // 0x270 (8)
	struct Unknown VB_PlayerList; // 0x278 (8)

	void CheckEmptyGroup(); // Function U.U.CheckEmptyGroup(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetTeamColor(); // Function U.U.SetTeamColor(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetTeamNumText(); // Function U.U.SetTeamNumText(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Init(struct Unknown PlayerState); // Function U.U.Init(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdatePlayerInfo(enum class Unknow PlayerListSortType); // Function U.U.UpdatePlayerInfo(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown IMG_PerkLevelUpFx; // 0x250 (8)
	enum class Unknow PerkSlot; // 0x258 (1)
	struct Unknown PerkFxTexture; // 0x260 (8)
	char PlayAnimation_1 : 0; // 0x268 (1)
	float CurrentAnimationTime; // 0x26C (4)
	float AnimLastTime; // 0x270 (4)
	struct Unknown PerkFxMaterialInstance; // 0x278 (8)
	struct Unknown UltimatePerkFxTexture; // 0x280 (8)

	void InitFxInfo(); // Function U.U.InitFxInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelInventoryPerkSlotWidget {

public:

	struct Unknown UberGraphFrame; // 0x2A0 (8)
	struct Unknown LevelUp; // 0x2A8 (8)
	struct Unknown Blank_SkillBG; // 0x2B0 (8)
	struct Unknown Get_SkillBG; // 0x2B8 (8)
	struct Unknown IMG_CoolTime; // 0x2C0 (8)
	struct Unknown IMG_PerkIcon; // 0x2C8 (8)
	struct Unknown KeyImageWidget; // 0x2D0 (8)
	struct Unknown Lv1; // 0x2D8 (8)
	struct Unknown Lv2; // 0x2E0 (8)
	struct Unknown Lv3; // 0x2E8 (8)
	struct Unknown Over_CoolTime; // 0x2F0 (8)
	struct Unknown T_CoolTime; // 0x2F8 (8)
	struct Unknown T_PerkName; // 0x300 (8)
	struct Unknown WidgetSwitcher_Icon; // 0x308 (8)
	char bHover : 0; // 0x310 (1)
	float CurrentExpPercent; // 0x314 (4)
	int32_t CurrentLevel; // 0x318 (4)
	int32_t LastLevel; // 0x31C (4)
	float TargetExpPercent; // 0x320 (4)
	float ExpSpeed; // 0x324 (4)
	struct Unknown PerkData; // 0x328 (224)
	float CurrentLevelPercent; // 0x408 (4)
	int32_t MaxLevel; // 0x40C (4)
	struct Unknown HoverWidget; // 0x410 (8)
	struct TArray<Unknown> LvArray; // 0x418 (16)

	void SetForVisual(); // Function U.U.SetForVisual(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkName(); // Function U.U.SetPerkName(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void InitActiveColor(); // Function U.U.InitActiveColor(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Init(struct TArray<Unknown>& List); // Function U.U.Init(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void InitLevelWidget(); // Function U.U.InitLevelWidget(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateForInit(); // Function U.U.UpdateForInit(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateLevelWidget(); // Function U.U.UpdateLevelWidget(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void InitSkillBGImg(); // Function U.U.InitSkillBGImg(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown GetSlotColor(); // Function U.U.GetSlotColor(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetLevelUp(int32_t TargetLevel, int32_t TargetExp); // Function U.U.SetLevelUp(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	float GetExpPercent(); // Function U.U.GetExpPercent(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerk(struct Unknown HoverWidget, struct Unknown PerkInfo, char JustVisual); // Function U.U.SetPerk(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_40E2F69B49645C79FC493E8F13CDBE28(struct Unknown Loaded); // Function U.U.OnLoaded_40E2F69B49645C79FC493E8F13CDBE28(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_D7551D6C4C375F77D2FAE6B8B3229914(struct Unknown Loaded); // Function U.U.OnLoaded_D7551D6C4C375F77D2FAE6B8B3229914(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_66A872FA4BD6D4BAE1E1DBAA7A175011(struct Unknown Loaded); // Function U.U.OnLoaded_66A872FA4BD6D4BAE1E1DBAA7A175011(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadIcon(struct Unknown Image); // Function U.U.AsyncLoadIcon(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadBG(struct Unknown Image); // Function U.U.AsyncLoadBG(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadBlank(struct Unknown Image); // Function U.U.AsyncLoadBlank(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelPlayerInfoProgressWidget {

public:

	struct Unknown UberGraphFrame; // 0x2E8 (8)
	struct Unknown Anim_Healing; // 0x2F0 (8)
	struct Unknown HorizontalBox_Health; // 0x2F8 (8)
	struct Unknown Image_eager; // 0x300 (8)
	struct Unknown SizeBox_main; // 0x308 (8)
	struct Unknown Curve_ProgressMaxSizeRatio; // 0x310 (8)
	float DefaultSlotSize; // 0x318 (4)
	float MaxHealthSize; // 0x31C (4)
	float CurrentHealthSize; // 0x320 (4)
	float CurrentMaxHealth; // 0x324 (4)

	void GetHealthPosition(float InHealth, float& PositionX); // Function U.U.GetHealthPosition(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HiddenAllSlots(); // Function U.U.HiddenAllSlots(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnSetSlotWidgets(int32_t InNewMaxHealth); // Function U.U.OnSetSlotWidgets(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetSlotWidgets(int32_t InNewMaxHealth); // Function U.U.SetSlotWidgets(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayIncreaseMaxHealthAnim(int32_t InLastHealth, int32_t InNewHealth); // Function U.U.PlayIncreaseMaxHealthAnim(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowDecreaseCurrentHealthAnim(int32_t InNewHealth); // Function U.U.ShowDecreaseCurrentHealthAnim(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateOverHealing(int32_t InNewHealth, char bFlag); // Function U.U.UpdateOverHealing(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Button; // 0x250 (8)
	struct Unknown Button_Text; // 0x258 (8)
	struct Unknown Overlay_Button; // 0x260 (8)
	struct FText ButtonText; // 0x268 (24)
	struct FMulticastInlineDelegate OnClicked; // 0x280 (16)
	struct FMulticastInlineDelegate OnPressed; // 0x290 (16)
	struct FMulticastInlineDelegate OnReleased; // 0x2A0 (16)
	struct FMulticastInlineDelegate OnHovered; // 0x2B0 (16)

	void BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PreConstruct(char IsDesignTime); // Function U.U.PreConstruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSign(); // Function U.U.BndEvt__Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSign(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnInitialized(); // Function U.U.OnInitialized(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnHovered__DelegateSignature(); // Function U.U.OnHovered__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnReleased__DelegateSignature(); // Function U.U.OnReleased__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnPressed__DelegateSignature(); // Function U.U.OnPressed__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnClicked__DelegateSignature(); // Function U.U.OnClicked__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelItemUseWidget {

public:

	struct Unknown UberGraphFrame; // 0x268 (8)
	struct Unknown Flicker; // 0x270 (8)
	struct Unknown BaseGuage; // 0x278 (8)
	struct Unknown Guage; // 0x280 (8)
	struct Unknown HB_CancelMessage; // 0x288 (8)
	struct Unknown Image_921; // 0x290 (8)
	struct Unknown Percent; // 0x298 (8)
	struct Unknown ProgressBar_Item; // 0x2A0 (8)
	struct Unknown RichT_Message; // 0x2A8 (8)
	struct Unknown TextBlock_1; // 0x2B0 (8)
	struct Unknown TextBlock_Time; // 0x2B8 (8)
	struct Unknown UseMessage; // 0x2C0 (8)
	struct Unknown VerticalBox_2; // 0x2C8 (8)
	float PercentValue; // 0x2D0 (4)
	char KnockState : 0; // 0x2D4 (1)
	float HideTimer; // 0x2D8 (4)
	struct Unknown ProgressStyle; // 0x2E0 (416)
	char IsShowRevive : 0; // 0x480 (1)
	struct Unknown CastingInfo; // 0x488 (24)
	float CurrentTime; // 0x4A0 (4)
	int32_t KeyFontSize; // 0x4A4 (4)
	float KeySizeScale; // 0x4A8 (4)
	int32_t CurrentLanguage; // 0x4AC (4)

	void CheckLanguage(); // Function U.U.CheckLanguage(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsTarget(struct Unknown Target, char& IsTarget); // Function U.U.IsTarget(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RefreshCastingUI(); // Function U.U.RefreshCastingUI(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateProgress(); // Function U.U.UpdateProgress(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideCastingUI(); // Function U.U.HideCastingUI(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowCastingUI(struct Unknown CastingInfo); // Function U.U.ShowCastingUI(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCancelMessage(struct FText Desc); // Function U.U.SetCancelMessage(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PreConstruct(char IsDesignTime); // Function U.U.PreConstruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelAircraftRouteWidget {

public:

	struct Unknown UberGraphFrame; // 0x2B0 (8)
	struct Unknown Propeller1; // 0x2B8 (8)
	struct Unknown Aircraft; // 0x2C0 (8)
	struct Unknown Image_156; // 0x2C8 (8)
	struct Unknown Image_236; // 0x2D0 (8)
	struct Unknown Image_237; // 0x2D8 (8)
	struct Unknown MapCompRef; // 0x2E0 (8)

	void StopAirCraftAnimation(); // Function U.U.StopAirCraftAnimation(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateAirCraftScaleByMouseWheel(float Delta); // Function U.U.UpdateAirCraftScaleByMouseWheel(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartAirCraftAnimation(); // Function U.U.StartAirCraftAnimation(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateAircraftAngle(float Angle); // Function U.U.UpdateAircraftAngle(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Image_94; // 0x250 (8)
	struct Unknown Image_224; // 0x258 (8)
	struct Unknown RichTextBlock_321; // 0x260 (8)
	struct Unknown InventoryRef; // 0x268 (8)

	struct Unknown OnMouseButtonDown_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonDown_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideInfo(); // Function U.U.HideInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowInfo(struct Unknown InvenRef); // Function U.U.ShowInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function U.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ForceCloseInfo(); // Function U.U.ForceCloseInfo(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelTeamInfoWidget {

public:

	struct Unknown UberGraphFrame; // 0x258 (8)
	struct Unknown U; // 0x260 (8)
	struct Unknown U_2; // 0x268 (8)
	struct Unknown VerticalBox_InfoList; // 0x270 (8)

	struct Unknown CreateSlot(); // Function U.U.CreateSlot(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateInvalidationbox(); // Function U.U.UpdateInvalidationbox(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UU {

public:

	struct Unknown UberGraphFrame; // 0x2A0 (8)
	struct Unknown VisualBorder; // 0x2A8 (8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown HorizontalBox_Rarity; // 0x248 (8)
	struct Unknown T_WeaponName; // 0x250 (8)

	void SetNameByID(int32_t ItemId); // Function U.U.SetNameByID(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetName(struct FText Name, int32_t Rarity); // Function U.U.SetName(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelRoutePingWidget {

public:

	struct Unknown Anim_OnShow; // 0x248 (8)
	struct Unknown BackColor; // 0x250 (8)
	struct Unknown T_Num; // 0x258 (8)
	struct FMulticastInlineDelegate OnMarkerClicked; // 0x260 (16)

	void SetPointAngle(float Angle); // Function U.U.SetPointAngle(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SelectPointIcon(int32_t Index, char IsLastPoint, char IsUpdate); // Function U.U.SelectPointIcon(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetTeamColor(struct Unknown LinearColor); // Function U.U.SetTeamColor(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMarkerClicked__DelegateSignature(struct Unknown Button, char mapObjectID); // Function U.U.OnMarkerClicked__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown ArmorSlot; // 0x248 (8)
	struct Unknown BagSlot; // 0x250 (8)
	struct Unknown BottomSlot; // 0x258 (8)
	struct Unknown EyeWearSlot; // 0x260 (8)
	struct Unknown GhillieSlot; // 0x268 (8)
	struct Unknown GlovesSlot; // 0x270 (8)
	struct Unknown HatSlot; // 0x278 (8)
	struct Unknown HelmetSlot; // 0x280 (8)
	struct Unknown MaskSlot; // 0x288 (8)
	struct Unknown OuterSlot; // 0x290 (8)
	struct Unknown ShoesSlot; // 0x298 (8)
	struct Unknown TopSlot; // 0x2A0 (8)
	struct Unknown U; // 0x2A8 (8)
	struct Unknown Timer_UpdateItemList; // 0x2B0 (8)

	void SetEquippedSlot(struct Unknown InventoryItemInfo); // Function U.U.SetEquippedSlot(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetEquippedList(); // Function U.U.ResetEquippedList(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetEquippedItems(); // Function U.U.SetEquippedItems(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetWeaponItems(); // Function U.U.SetWeaponItems(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateItemList(); // Function U.U.UpdateItemList(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideItemList(); // Function U.U.HideItemList(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowItemList(); // Function U.U.ShowItemList(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelInventoryWidget {

public:

	struct Unknown UberGraphFrame; // 0x278 (8)
	struct Unknown FadeIn; // 0x280 (8)
	struct Unknown BackgroundBlur_1; // 0x288 (8)
	struct Unknown BackPackBound_begin; // 0x290 (8)
	struct Unknown BackPackBound_end; // 0x298 (8)
	struct Unknown BlackMarketOverlay; // 0x2A0 (8)
	struct Unknown BT; // 0x2A8 (8)
	struct Unknown Button_SortByTime; // 0x2B0 (8)
	struct Unknown Button_SortByType; // 0x2B8 (8)
	struct Unknown CanvasPanel_1; // 0x2C0 (8)
	struct Unknown CanvasPanel_7; // 0x2C8 (8)
	struct Unknown CanvasPanel_16; // 0x2D0 (8)
	struct Unknown Carried_Area; // 0x2D8 (8)
	struct Unknown CarriedBound_begin; // 0x2E0 (8)
	struct Unknown CarriedBound_end; // 0x2E8 (8)
	struct Unknown CarriedList; // 0x2F0 (8)
	struct Unknown CarriedList_StrongBox; // 0x2F8 (8)
	struct Unknown CheckBox; // 0x300 (8)
	struct Unknown CheckBox_1; // 0x308 (8)
	struct Unknown CheckBox_2; // 0x310 (8)
	struct Unknown CombineRecipe; // 0x318 (8)
	struct Unknown EquippedList; // 0x320 (8)
	struct Unknown HorizontalBox; // 0x328 (8)
	struct Unknown HorizontalBox_7; // 0x330 (8)
	struct Unknown HorizontalBox_WeightMax; // 0x338 (8)
	struct Unknown Image; // 0x340 (8)
	struct Unknown Image_2; // 0x348 (8)
	struct Unknown Image_3; // 0x350 (8)
	struct Unknown Image_5; // 0x358 (8)
	struct Unknown Image_6; // 0x360 (8)
	struct Unknown Image_7; // 0x368 (8)
	struct Unknown Image_8; // 0x370 (8)
	struct Unknown Image_9; // 0x378 (8)
	struct Unknown Image_10; // 0x380 (8)
	struct Unknown Image_223; // 0x388 (8)
	struct Unknown Image_227; // 0x390 (8)
	struct Unknown Image_271; // 0x398 (8)
	struct Unknown Image_324; // 0x3A0 (8)
	struct Unknown Image_489; // 0x3A8 (8)
	struct Unknown Image_556; // 0x3B0 (8)
	struct Unknown Image_Guess; // 0x3B8 (8)
	struct Unknown Image_ItemInfo; // 0x3C0 (8)
	struct Unknown IM; // 0x3C8 (8)
	struct Unknown IM; // 0x3D0 (8)
	struct Unknown InputMaskImage; // 0x3D8 (8)
	struct Unknown Material_Area; // 0x3E0 (8)
	struct Unknown MaterialBound_begin; // 0x3E8 (8)
	struct Unknown MaterialBound_end; // 0x3F0 (8)
	struct Unknown ProgressBar_MaxWeight; // 0x3F8 (8)
	struct Unknown ProgressBar_Weight; // 0x400 (8)
	struct Unknown ProgressBar_WeightBag; // 0x408 (8)
	struct Unknown ProximityBound; // 0x410 (8)
	struct Unknown ProximityList; // 0x418 (8)
	struct Unknown StrongBox_Area; // 0x420 (8)
	struct Unknown T_AdditionalMaxWeight; // 0x428 (8)
	struct Unknown T_AdditionalMaxWeightSymbol; // 0x430 (8)
	struct Unknown T_AdditionalWeight; // 0x438 (8)
	struct Unknown T_AdditionalWeightSymbol; // 0x440 (8)
	struct Unknown T_MaxWeight; // 0x448 (8)
	struct Unknown T_StrongboxCount; // 0x450 (8)
	struct Unknown T_Weight; // 0x458 (8)
	struct Unknown T_WeightSlash; // 0x460 (8)
	struct Unknown TextBlock_11; // 0x468 (8)
	struct Unknown TextBlock_CurrentGold; // 0x470 (8)
	struct Unknown TextBlock_SortByTime; // 0x478 (8)
	struct Unknown TextBlock_SortByType; // 0x480 (8)
	struct Unknown U; // 0x488 (8)
	struct Unknown U; // 0x490 (8)
	struct Unknown U; // 0x498 (8)
	struct Unknown U; // 0x4A0 (8)
	struct Unknown U; // 0x4A8 (8)
	struct Unknown U; // 0x4B0 (8)
	struct Unknown WeaponBound; // 0x4B8 (8)
	struct Unknown WeaponList; // 0x4C0 (8)
	struct Unknown WeightPerCent; // 0x4C8 (8)
	struct Unknown PlayerController; // 0x4D0 (8)
	char bItemDrag : 0; // 0x4D8 (1)
	struct Unknown DropPopup; // 0x4E0 (8)
	float MaximumWeight; // 0x4E8 (4)
	int32_t OldProximityItemCount; // 0x4EC (4)
	struct Unknown ProximityGround; // 0x4F0 (8)
	struct Unknown DefaultPawnRef; // 0x4F8 (8)
	struct TArray<Unknown> ProximityGroundPool; // 0x500 (16)
	struct Unknown OldDefaultPawnRef; // 0x510 (8)
	struct Unknown CharacterTimerHandle; // 0x518 (8)
	struct TArray<Unknown> DropBoxWidgetList; // 0x520 (16)
	struct Unknown DropBoxParentWidget; // 0x530 (8)
	struct Unknown SavedInventorySettings; // 0x538 (8)
	struct Unknown EquipedWeapon; // 0x540 (8)
	struct TArray<Unknown> OldWeaponList; // 0x548 (16)
	char ChangeAttachments : 0; // 0x558 (1)
	struct Unknown ItemHoverWidget; // 0x560 (8)
	struct Unknown MainWidget; // 0x568 (8)
	struct FMulticastInlineDelegate EventDispatcher_OnCloseInventory; // 0x570 (16)
	struct TArray<Unknown> StealableWidgetList; // 0x580 (16)
	char bItemInfoHovered : 0; // 0x590 (1)
	char bFirstTimeNotifyItemInfo : 0; // 0x591 (1)
	struct Unknown Timer_ItemInfoTooltip; // 0x598 (8)
	char IsShowingItemInfoTooltip : 0; // 0x5A0 (1)
	int32_t FirstTimeCapsuleItem; // 0x5A4 (4)
	int32_t FirstTimeCraft; // 0x5A8 (4)
	char bGoldWarning : 0; // 0x5AC (1)
	struct Unknown DefaultWeightColor; // 0x5B0 (40)
	struct Unknown MinusWeightColor; // 0x5D8 (40)
	struct Unknown PlusWeightColor; // 0x600 (40)

	void AllHiddenMaterialWidget(); // Function U.U.AllHiddenMaterialWidget(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetAllSlotScrollToStart(); // Function U.U.ResetAllSlotScrollToStart(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetWeightText(struct Unknown& WeightTextRef, struct Unknown& SymbolTextRef, float Weight); // Function U.U.SetWeightText(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetAllHoverEffect(); // Function U.U.ResetAllHoverEffect(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverRecipeByItem(struct FName ItemKey); // Function U.U.HoverRecipeByItem(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckEndFirstTimeValues(); // Function U.U.CheckEndFirstTimeValues(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckFirstTimeCraft(char& Return); // Function U.U.CheckFirstTimeCraft(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckFirstTimeCapsuleItem(char& Return); // Function U.U.CheckFirstTimeCapsuleItem(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckAnyEquippableAttachmentEmptySlot(struct Unknown& NewAttachmentItemInfo, char& IsEmpty); // Function U.U.CheckAnyEquippableAttachmentEmptySlot(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideItemArea(); // Function U.U.HideItemArea(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowItemArea(struct Unknown& ItemInfo, char CanEquip); // Function U.U.ShowItemArea(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckItemInfoHovered(); // Function U.U.CheckItemInfoHovered(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetCarriedSlotItems(struct TArray<Unknown>& Items); // Function U.U.GetCarriedSlotItems(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsInCarriedBound(char& State); // Function U.U.IsInCarriedBound(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsInBound(struct Unknown Begin, struct Unknown End, char& State); // Function U.U.IsInBound(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsInMaterialBound(char& State); // Function U.U.IsInMaterialBound(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsInBackPackBound(char& State); // Function U.U.IsInBackPackBound(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckCompleteItems(); // Function U.U.CheckCompleteItems(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverResetMaterial(); // Function U.U.HoverResetMaterial(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverRecipe(struct FName RecipeKey); // Function U.U.HoverRecipe(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AllHiddenRecipeWidget(); // Function U.U.AllHiddenRecipeWidget(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsMaterialItem(struct Unknown InventoryItemInfo, char& out_Result); // Function U.U.IsMaterialItem(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowItemDorpPopup(struct Unknown BaseSlot, struct Unknown MaterialSlot, char& State); // Function U.U.ShowItemDorpPopup(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	char CheckMaterialBound(struct Unknown DropPos, struct Unknown Operation); // Function U.U.CheckMaterialBound(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRecipeItem(); // Function U.U.SetRecipeItem(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetMaterialItem(); // Function U.U.SetMaterialItem(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	enum class Unknow Get_CombineRecipe_Visibility_1(); // Function U.U.Get_CombineRecipe_Visibility_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetVisibleInventoryCharacter(char bVisible); // Function U.U.SetVisibleInventoryCharacter(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetStealable(); // Function U.U.SetStealable(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	enum class Unknow Get_IM_1(); // Function U.U.Get_IM_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverResetKeepedSlot(); // Function U.U.HoverResetKeepedSlot(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverKeepedSlot(struct Unknown InventoryItemInfo); // Function U.U.HoverKeepedSlot(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetKeepedItem(); // Function U.U.SetKeepedItem(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetMainWidget(struct Unknown& MainWidget); // Function U.U.GetMainWidget(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckPreViewWeapon(char& State); // Function U.U.CheckPreViewWeapon(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DropBoxCompareQuantity(struct TArray<Unknown>& InventoryItemInfo, struct Unknown DropBoxInfo, char& SlotUpdate); // Function U.U.DropBoxCompareQuantity(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckBoxState(char State, struct Unknown CheckBox); // Function U.U.CheckBoxState(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct FText Get_TextBlock_CurrentGold_Text_1(); // Function U.U.Get_TextBlock_CurrentGold_Text_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RemoveDropBoxItem(struct Unknown Actor, struct Unknown Slot); // Function U.U.RemoveDropBoxItem(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AddDropBoxItem(struct Unknown SlotInfo, struct Unknown Actor); // Function U.U.AddDropBoxItem(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void FindDropBox(struct Unknown Actor, struct Unknown& DropBox, char& State); // Function U.U.FindDropBox(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateDropBoxItem(struct Unknown Actor); // Function U.U.UpdateDropBoxItem(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkBoxIcon(); // Function U.U.SetPerkBoxIcon(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	char IsShowingDropPopup(); // Function U.U.IsShowingDropPopup(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckDefaultPawn(char& NewDefaultPawn); // Function U.U.CheckDefaultPawn(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateCarriedSlotInfo(); // Function U.U.UpdateCarriedSlotInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AllHiddenCarriedWidget(); // Function U.U.AllHiddenCarriedWidget(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateProximityGroundSlotInfo(); // Function U.U.UpdateProximityGroundSlotInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateProximityGroundWidget(); // Function U.U.UpdateProximityGroundWidget(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AddProximityGroundPool(); // Function U.U.AddProximityGroundPool(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void InitProximityGroundPool(); // Function U.U.InitProximityGroundPool(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetChracterVisible(char State); // Function U.U.SetChracterVisible(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	char OnDragOver(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.OnDragOver(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckWeaponBound(struct Unknown DropPos, struct Unknown Operation); // Function U.U.CheckWeaponBound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	char CheckCarriedBound(struct Unknown DropPos, struct Unknown Operation); // Function U.U.CheckCarriedBound(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckProximityBound(struct Unknown DropPos, struct Unknown Operation); // Function U.U.CheckProximityBound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	enum class Unknow ShowBlackMarketButton(); // Function U.U.ShowBlackMarketButton(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateWeaponMesh(struct Unknown NewWeapon, int32_t SlotIndex); // Function U.U.UpdateWeaponMesh(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetWearbleItemInfo(enum class Unknow WearableType, char& bHas, struct Unknown& ItemInfo, struct Unknown& ItemDetailInfo); // Function U.U.GetWearbleItemInfo(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CalcItemWeight(char IsAddOrRemove, struct Unknown ItemInfo); // Function U.U.CalcItemWeight(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetWeightPlus(float WeightPlus, float MaxWeightPlus); // Function U.U.SetWeightPlus(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetWeightProgress(); // Function U.U.SetWeightProgress(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetDragWeaponAttachmentItemFromCarriedSlot(); // Function U.U.ResetDragWeaponAttachmentItemFromCarriedSlot(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetDragWeaponAttachmentItemFrom(struct Unknown InventoryItemInfo); // Function U.U.SetDragWeaponAttachmentItemFrom(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetDragWeaponAttachmentSlot(struct Unknown InventoryItemInfo); // Function U.U.SetDragWeaponAttachmentSlot(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetInventoryItemDetailInfo(struct Unknown InventoryItemInfo, struct Unknown& InventoryItemDetailInfo, char& bResult); // Function U.U.GetInventoryItemDetailInfo(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetDragCarriedSlot(struct Unknown InventoryItemInfo); // Function U.U.SetDragCarriedSlot(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetDragWeaponSlot(struct Unknown WeaponInfo); // Function U.U.SetDragWeaponSlot(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetDragWeaponItemFromCarriedSlot(); // Function U.U.ResetDragWeaponItemFromCarriedSlot(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetDragWeaponItemFromCarriedSlot(struct Unknown InventoryItemInfo); // Function U.U.SetDragWeaponItemFromCarriedSlot(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetDragWeaponItemFromEquippedSlot(); // Function U.U.ResetDragWeaponItemFromEquippedSlot(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetDragWeaponItemFromEquippedSlot(struct Unknown InventoryItemInfo); // Function U.U.SetDragWeaponItemFromEquippedSlot(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetDragProximitySlot(struct Unknown InventoryItemInfo); // Function U.U.SetDragProximitySlot(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverResetCarriedSlotList(); // Function U.U.HoverResetCarriedSlotList(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverResetEquipSlot(); // Function U.U.HoverResetEquipSlot(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverResetAttachItemSlotList(); // Function U.U.HoverResetAttachItemSlotList(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverResetWeaponSlotList(); // Function U.U.HoverResetWeaponSlotList(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverAttachItemSlot(struct Unknown InventoryItemInfo); // Function U.U.HoverAttachItemSlot(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverWeaponSlot(struct Unknown InventoryItemInfo); // Function U.U.HoverWeaponSlot(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetItemDrag(char bDrag); // Function U.U.SetItemDrag(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsItemDrag(char& bResult); // Function U.U.IsItemDrag(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetDrag(); // Function U.U.ResetDrag(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnMouseButtonDown(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	enum class Unknow Get_InputMaskImage_Visibility_1(); // Function U.U.Get_InputMaskImage_Visibility_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EnableInventory(); // Function U.U.EnableInventory(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DisableInventory(); // Function U.U.DisableInventory(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EnableCarriedSlotList(); // Function U.U.EnableCarriedSlotList(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DisableCarriedSlotList(); // Function U.U.DisableCarriedSlotList(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverCarriedSlotList(struct Unknown InventoryItemInfo); // Function U.U.HoverCarriedSlotList(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetCharacter(char& Result, struct Unknown& CharacterRef); // Function U.U.GetCharacter(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetInventoryComponent(char& Result, struct Unknown& InventoryComponent); // Function U.U.GetInventoryComponent(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverEquipSlot(struct Unknown InventoryItemInfo); // Function U.U.HoverEquipSlot(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	float Get_WeightProgess_Percent_1(); // Function U.U.Get_WeightProgess_Percent_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct FText Get_WeightPerCent_Text_1(); // Function U.U.Get_WeightPerCent_Text_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetHover(struct Unknown InventoryItemInfo, char& bResult); // Function U.U.ResetHover(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsCarriable(struct Unknown InventoryItemInfo, char& out_Result, char& InStrongbox); // Function U.U.IsCarriable(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	char OnDrop(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.OnDrop(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCarriedItems(); // Function U.U.SetCarriedItems(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetProximityItems(char bResetDrag); // Function U.U.SetProximityItems(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetEquippedItems(); // Function U.U.SetEquippedItems(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetWeaponItems(); // Function U.U.SetWeaponItems(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPreview(); // Function U.U.SetPreview(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_SortByTime_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_SortByTime_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_SortByType_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_SortByType_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__CheckBox_0_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChan(char bIsChecked); // Function U.U.BndEvt__CheckBox_0_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChan(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CharacterVisible_Event(); // Function U.U.CharacterVisible_Ev(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Open(); // Function U.U.Open(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Close(); // Function U.U.Close(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CloseDropPopup(); // Function U.U.CloseDropPopup(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AcceptDropPopup(); // Function U.U.AcceptDropPopup(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void WeaponAmmoDelegate_Event_1(int32_t SlotIdx, int32_t CurAmmo, int32_t MaxAmmo); // Function U.U.WeaponAmmoDelegate_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void NotifyNewWeapon(); // Function U.U.NotifyNewWeapon(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowInventoryCharacter(char IsShow); // Function U.U.ShowInventoryCharacter(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__CheckBox_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature(char bIsChecked); // Function U.U.BndEvt__CheckBox_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DelayCheckCompleteItems(); // Function U.U.DelayCheckCompleteItems(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowFirstTimeItemInfoTooltip(); // Function U.U.ShowFirstTimeItemInfoTooltip(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__CheckBox_1_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChan(char bIsChecked); // Function U.U.BndEvt__CheckBox_1_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChan(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowStatupAnim(struct Unknown& StatupParameters, enum class Unknow StatupType); // Function U.U.ShowStatupAnim(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateSearchMaterialItem(); // Function U.U.UpdateSearchMaterialItem(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateSearchExpertWeapon(); // Function U.U.UpdateSearchExpertWeapon(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void NotEnoughSpaceDelegate_Event_1(); // Function U.U.NotEnoughSpaceDelegate_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnRefreshWeightProgress(); // Function U.U.OnRefreshWeightProgress(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangeMaterial(); // Function U.U.OnChangeMaterial(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangeWeapon(); // Function U.U.OnChangeWeapon(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangeDetectedItems(); // Function U.U.OnChangeDetectedItems(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangeWeaponAttachment(); // Function U.U.OnChangeWeaponAttachment(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangeWearableItem(); // Function U.U.OnChangeWearableItem(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangeBagpackItem(); // Function U.U.OnChangeBagpackItem(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EventDispatcher_OnCloseInventory__DelegateSignature(); // Function U.U.EventDispatcher_OnCloseInventory__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Bg; // 0x250 (8)
	struct Unknown Button_Cancle; // 0x258 (8)
	struct Unknown Button_OK; // 0x260 (8)
	struct Unknown Image; // 0x268 (8)
	struct Unknown Image_168; // 0x270 (8)
	struct Unknown Image_423; // 0x278 (8)
	struct Unknown Image_853; // 0x280 (8)
	struct Unknown Image_1449; // 0x288 (8)
	struct Unknown Image_1451; // 0x290 (8)
	struct Unknown Image_1452; // 0x298 (8)
	struct Unknown Image_1453; // 0x2A0 (8)
	struct Unknown Image_1454; // 0x2A8 (8)
	struct Unknown Image_1965; // 0x2B0 (8)
	struct Unknown Image_1967; // 0x2B8 (8)
	struct Unknown Image_1968; // 0x2C0 (8)
	struct Unknown Image_1969; // 0x2C8 (8)
	struct Unknown Image_1970; // 0x2D0 (8)
	struct Unknown Image_1971; // 0x2D8 (8)
	struct Unknown Image_1972; // 0x2E0 (8)
	struct Unknown Image_1973; // 0x2E8 (8)
	struct Unknown Image_1974; // 0x2F0 (8)
	struct Unknown Image_1975; // 0x2F8 (8)
	struct Unknown Image_1976; // 0x300 (8)
	struct Unknown Image_1977; // 0x308 (8)
	struct Unknown Image_1978; // 0x310 (8)
	struct Unknown Image_2324; // 0x318 (8)
	struct Unknown TextBlock_CurrentGold; // 0x320 (8)
	struct Unknown TextBlock_Price; // 0x328 (8)
	struct Unknown TargetCharacter; // 0x330 (8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_159_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_159_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Cancle_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Cancle_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown HorizontalBox_Rarity; // 0x250 (8)
	struct Unknown Image_bg; // 0x258 (8)
	struct Unknown Image_Icon; // 0x260 (8)
	struct Unknown T_Name; // 0x268 (8)
	struct Unknown T_WeaponType; // 0x270 (8)
	struct Unknown TextBlock_186; // 0x278 (8)
	struct Unknown Tooltip; // 0x280 (8)
	struct Unknown ItemInfo; // 0x288 (8)
	struct Unknown ItemDetailInfo; // 0x290 (1168)

	void SetRarity(); // Function U.U.SetRarity(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetHoverPosition(struct Unknown ViewportSize, struct Unknown MousePosition, struct Unknown HoverSize, struct Unknown& Out); // Function U.U.GetHoverPosition(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Init(struct Unknown ItemInfo); // Function U.U.Init(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_476BD37943992650800406AA289D7379(struct Unknown Loaded); // Function U.U.OnLoaded_476BD37943992650800406AA289D7379(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function U.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadIcon(struct Unknown Icon); // Function U.U.AsyncLoadIcon(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelKillInfoWidget {

public:

	struct Unknown UberGraphFrame; // 0x2C0 (8)
	struct Unknown KillMessageList; // 0x2C8 (8)
	struct Unknown U; // 0x2D0 (8)
	struct Unknown U_2; // 0x2D8 (8)
	struct Unknown U_3; // 0x2E0 (8)
	struct Unknown U_4; // 0x2E8 (8)
	struct Unknown U_5; // 0x2F0 (8)
	struct Unknown U_6; // 0x2F8 (8)
	struct Unknown U_7; // 0x300 (8)
	struct Unknown U_8; // 0x308 (8)
	struct Unknown U_9; // 0x310 (8)
	struct Unknown U_10; // 0x318 (8)
	struct TArray<Unknown> TmpInfoList; // 0x320 (16)

	void AddKillMessage(struct Unknown& BroadCastInfo); // Function U.U.AddKillMessage(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UU {

public:

	struct Unknown UberGraphFrame; // 0x268 (8)
	struct Unknown SeatIcons; // 0x270 (8)
	struct Unknown WheelIcons; // 0x278 (8)

	void Setup(struct Unknown VehicleInstance); // Function U.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelScopeWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown CanvasPanel_1; // 0x250 (8)
	struct Unknown Image_19; // 0x258 (8)
	struct Unknown Image_20; // 0x260 (8)
	struct Unknown Image_21; // 0x268 (8)
	struct Unknown Image_22; // 0x270 (8)
	struct Unknown Image_23; // 0x278 (8)
	struct Unknown Image_24; // 0x280 (8)
	struct Unknown WidgetSwitcher_167; // 0x288 (8)
	struct Unknown NewVar_1; // 0x290 (8)

	void SetScopeImageAngle(float NewAngle); // Function U.U.SetScopeImageAngle(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelPopupWidget {

public:

	struct Unknown UberGraphFrame; // 0x268 (8)
	struct Unknown Bg; // 0x270 (8)
	struct Unknown btn_Cancel; // 0x278 (8)
	struct Unknown btn_OK; // 0x280 (8)
	struct Unknown Desc; // 0x288 (8)
	struct Unknown Image_2; // 0x290 (8)
	struct Unknown Overlay; // 0x298 (8)
	struct Unknown Overlay_1; // 0x2A0 (8)
	struct Unknown Overlay_2; // 0x2A8 (8)
	struct Unknown RichTextBlock_244; // 0x2B0 (8)
	struct Unknown TextBlock_17; // 0x2B8 (8)
	struct Unknown Throbber_159; // 0x2C0 (8)
	struct Unknown Title; // 0x2C8 (8)
	struct Unknown WidgetSwitcher_1; // 0x2D0 (8)
	struct FName MapNameToExit; // 0x2D8 (8)
	char IsExitGame : 0; // 0x2E0 (1)
	struct Unknown ControllerRef; // 0x2E8 (8)
	char IsTutorial : 0; // 0x2F0 (1)
	char IsDeathCam : 0; // 0x2F1 (1)
	struct FMulticastInlineDelegate EventDispatcher_Mov; // 0x2F8 (16)
	char ErrorType : 0; // 0x308 (1)
	char IsPerkDeckSelectMode : 0; // 0x309 (1)
	struct FMulticastInlineDelegate EventDispatcher_TrySelectMode; // 0x310 (16)
	char OkayType : 0; // 0x320 (1)

	void SetOptionChangedFromBenchmark(); // Function U.U.SetOptionChangedFromBenchmark(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PerkDeckSelectMode(); // Function U.U.PerkDeckSelectMode(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsStartedGame(char& bRet); // Function U.U.IsStartedGame(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsSoloPlay(char& bRet); // Function U.U.IsSoloPlay(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetMessage(int32_t ErrorCode, struct FString ErrorID, struct FString Param, struct FString& Title, struct FString& Desc); // Function U.U.GetMessage(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EnterDeathCam(char IsWinningCam, char IsTargetCameraKiller); // Function U.U.EnterDeathCam(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EnterWindow(); // Function U.U.EnterWindow(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetMyTeamAlive(char& ALIVE); // Function U.U.GetMyTeamAlive(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EnterLobby(); // Function U.U.EnterLobby(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnMouseWheel(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseWheel(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnMouseButtonDown(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_OK_K2Node_ComponentBoundEvent_35_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__btn_OK_K2Node_ComponentBoundEvent_35_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_Cancel_K2Node_ComponentBoundEvent_53_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__btn_Cancel_K2Node_ComponentBoundEvent_53_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_OK_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSign(); // Function U.U.BndEvt__btn_OK_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSign(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_Cancel_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__btn_Cancel_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayerLogout(); // Function U.U.PlayerLogout(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void LeaveGame(); // Function U.U.LeaveGame(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangedFinalRankDelegate_Event(); // Function U.U.OnChangedFinalRankDelegate_Event(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void FinalResult_Internal(); // Function U.U.FinalResult_Internal(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void MoveLobby(); // Function U.U.MoveLobby(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Show_2(); // Function U.U.Show_2(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Hide_2(); // Function U.U.Hide_2(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetMessageEx(int32_t ErrorIdx, struct FString ErrorID, struct FString Parameter, char bConfirm, char bCancel, char bWaiting, struct Unknown& evt); // Function U.U.SetMessageEx(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void QuitGame(float DelayTime); // Function U.U.QuitGame(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function U.U.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EventDispatcher_TrySelectMode__DelegateSignature(); // Function U.U.EventDispatcher_TrySelectMode__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EventDispatcher_Mov(); // Function U.U.EventDispatcher_Movl(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Character_BG_Motion; // 0x250 (8)
	struct Unknown Image_308; // 0x258 (8)
	struct Unknown ScrollBox_KeepedList; // 0x260 (8)
	struct Unknown TextBlock_Count; // 0x268 (8)
	struct Unknown PlayerController; // 0x270 (8)

	void HoverRecipeItems(struct TArray<Unknown>& ItemKeys); // Function U.U.HoverRecipeItems(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverRecipeTree(struct FName ItemKey); // Function U.U.HoverRecipeTree(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CompleteItems(struct TArray<Unknown>& ItemKeys); // Function U.U.CompleteItems(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DisableCarriedListHover(); // Function U.U.DisableCarriedListHover(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	char DropItem(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.DropItem(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetInventoryComponent(char& Result, struct Unknown& InventoryComponentRef); // Function U.U.GetInventoryComponent(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Reset(); // Function U.U.Reset(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverItems(struct TArray<Unknown>& ItemKeys); // Function U.U.HoverItems(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverReset(); // Function U.U.HoverReset(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	char OnDrop(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.OnDrop(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnDragEnter(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.OnDragEnter(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnDragLeave(struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.OnDragLeave(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelAliveInfoWidget {

public:

	struct Unknown UberGraphFrame; // 0x288 (8)
	struct Unknown GoldDesc_Hide; // 0x290 (8)
	struct Unknown GoldDesc_Show; // 0x298 (8)
	struct Unknown Revival_Add; // 0x2A0 (8)
	struct Unknown AliveCount_Text; // 0x2A8 (8)
	struct Unknown AliveCount_Text_2; // 0x2B0 (8)
	struct Unknown HorizontalBox_8; // 0x2B8 (8)
	struct Unknown HorizontalBox_16; // 0x2C0 (8)
	struct Unknown HorizontalBox_89; // 0x2C8 (8)
	struct Unknown HorizontalBox_Alive; // 0x2D0 (8)
	struct Unknown HorizontalBox_Assist; // 0x2D8 (8)
	struct Unknown HorizontalBox_CurrentGold; // 0x2E0 (8)
	struct Unknown HorizontalBox_Kill; // 0x2E8 (8)
	struct Unknown HorizontalBox_Team; // 0x2F0 (8)
	struct Unknown Image; // 0x2F8 (8)
	struct Unknown Image_1; // 0x300 (8)
	struct Unknown Image_2; // 0x308 (8)
	struct Unknown Image_6; // 0x310 (8)
	struct Unknown Image_102; // 0x318 (8)
	struct Unknown Image_271; // 0x320 (8)
	struct Unknown Image_376; // 0x328 (8)
	struct Unknown Image_378; // 0x330 (8)
	struct Unknown Image_1584; // 0x338 (8)
	struct Unknown KillAliveBG; // 0x340 (8)
	struct Unknown KillAliveBG_2; // 0x348 (8)
	struct Unknown KillAliveBG_3; // 0x350 (8)
	struct Unknown KillAliveBG_4; // 0x358 (8)
	struct Unknown KillCount_Text; // 0x360 (8)
	struct Unknown KillCount_Text_2; // 0x368 (8)
	struct Unknown RichTextBlock_275; // 0x370 (8)
	struct Unknown SizeBox_1; // 0x378 (8)
	struct Unknown SizeBox_3; // 0x380 (8)
	struct Unknown Spacer_2; // 0x388 (8)
	struct Unknown T_AliveCount; // 0x390 (8)
	struct Unknown T_AssistCount; // 0x398 (8)
	struct Unknown T_KillCount; // 0x3A0 (8)
	struct Unknown T_TeamCount; // 0x3A8 (8)
	struct Unknown TextBlock_1; // 0x3B0 (8)
	struct Unknown TextBlock_CurrentGold; // 0x3B8 (8)
	char ShowKillCountUI : 0; // 0x3C0 (1)
	int32_t CurrentKillCount; // 0x3C4 (4)
	int32_t NewVar_1; // 0x3C8 (4)
	struct Unknown ShowGoldDescHandle; // 0x3D0 (8)
	struct Unknown AliveCount_Text_1_1; // 0x3D8 (8)
	struct Unknown KillCount_Text_1_1; // 0x3E0 (8)

	enum class Unknow Get_HorizontalBox_CurrentGold_Visibility_1(); // Function U.U.Get_HorizontalBox_CurrentGold_Visibility_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetBGImageMarginValue(int32_t AliveCount); // Function U.U.SetBGImageMarginValue(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetAliveCount(int32_t AliveCount); // Function U.U.SetAliveCount(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetKillCount(int32_t KillCount); // Function U.U.SetKillCount(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideKillCount(); // Function U.U.HideKillCount(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowKillCount(); // Function U.U.ShowKillCount(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetKillCount_BP(int32_t NewKillCount); // Function U.U.SetKillCount_BP(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetAliveTeamCount_BP(int32_t NewAliveTeamCount, int32_t TeamSize); // Function U.U.SetAliveTeamCount_BP(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowResuscitation(); // Function U.U.ShowResuscitation(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Show_GoldDesc(); // Function U.U.Show_GoldDesc(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Hide_GoldDesc(); // Function U.U.Hide_GoldDesc(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetAssistCount_BP(int32_t NewKillCount); // Function U.U.SetAssistCount_BP(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetAliveCount_BP(int32_t NewAliveCount); // Function U.U.SetAliveCount_BP(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelReplayPlayerListWidget {

public:

	struct Unknown UberGraphFrame; // 0x2E0 (8)
	struct Unknown Bt_ListNext; // 0x2E8 (8)
	struct Unknown BT_ListPrev; // 0x2F0 (8)
	struct Unknown ScrollBox_PlayerItem; // 0x2F8 (8)
	struct Unknown T_SortType; // 0x300 (8)
	struct Unknown VB_ListMain; // 0x308 (8)

	struct Unknown CreatePlayerListGroup(struct Unknown PlayerState); // Function U.U.CreatePlayerListGroup(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetSortTypeText(); // Function U.U.SetSortTypeText(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown CreatePlayerButton(struct Unknown PlayerState); // Function U.U.CreatePlayerButton(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT_ListPrev(); // Function U.U.BndEvt__BT_ListPrevracks(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Bt_ListNext_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Bt_ListNext_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Button_306; // 0x250 (8)
	struct Unknown CanvasPanel_Line; // 0x258 (8)
	struct Unknown CanvasPanel_Position; // 0x260 (8)
	struct Unknown Image_Leader; // 0x268 (8)
	struct Unknown Image_Rank; // 0x270 (8)
	struct Unknown Img_Cut; // 0x278 (8)
	struct Unknown Img_MS; // 0x280 (8)
	struct Unknown Img_MS_2; // 0x288 (8)
	struct Unknown Img_MS_3; // 0x290 (8)
	struct Unknown Img_PlayerLine; // 0x298 (8)
	struct Unknown Img_PlayerPoint; // 0x2A0 (8)
	struct Unknown Img_Voice; // 0x2A8 (8)
	struct Unknown Img_VoiceElimination; // 0x2B0 (8)
	struct Unknown Overlay_OnReady; // 0x2B8 (8)
	struct Unknown Overlay_Position; // 0x2C0 (8)
	struct Unknown Overlay_TeamOnReady; // 0x2C8 (8)
	struct Unknown T_PlayerName; // 0x2D0 (8)
	struct Unknown T_PlayerName_2; // 0x2D8 (8)
	struct Unknown WidgetSwitcher_3; // 0x2E0 (8)
	struct Unknown WidgetSwitcher_IsTeam; // 0x2E8 (8)
	struct Unknown WidgetSwitcher_State; // 0x2F0 (8)
	int32_t LastSeaponTierId; // 0x2F8 (4)
	float WidgetHalfSizeX; // 0x2FC (4)

	void Set(char IsLeft, char IsSoloMode, struct Unknown CharacterRef, struct Unknown MemberInfo); // Function U.U.Set(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Init(struct Unknown PartyInfo, char bIsSoloMode); // Function U.U.Init(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_53B5B77C4172B8F96BC2979B2702DE82(struct Unknown Loaded); // Function U.U.OnLoaded_53B5B77C4172B8F96BC2979B2702DE82(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncIcon(struct Unknown Asset); // Function U.U.AsyncIcon(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Button_98; // 0x250 (8)
	struct Unknown Time_2; // 0x258 (8)
	struct Unknown SavedEvent; // 0x260 (40)
	struct FString SavedReplayFileName; // 0x288 (16)
	struct Unknown ReplayListWidget; // 0x298 (8)

	void Init(struct Unknown Event, struct FString ReplayFileName, struct Unknown ReplayListWidget); // Function U.U.Init(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_97_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_97_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelWorldMapWidget {

public:

	struct Unknown UberGraphFrame; // 0x2B8 (8)
	struct Unknown FadeIn; // 0x2C0 (8)
	struct Unknown NewAnimation_2; // 0x2C8 (8)
	struct Unknown Bg; // 0x2D0 (8)
	struct Unknown B; // 0x2D8 (8)
	struct Unknown B; // 0x2E0 (8)
	struct Unknown CloseButton; // 0x2E8 (8)
	struct Unknown ShowHelBoxButton; // 0x2F0 (8)
	struct Unknown U; // 0x2F8 (8)
	struct Unknown WidgetSwitcher_1; // 0x300 (8)
	int32_t MAX_ZOOM_LEVEL; // 0x308 (4)
	int32_t ZoomLevel; // 0x30C (4)
	float MAX_SCALE_FACTOR; // 0x310 (4)
	int32_t InitializeCount; // 0x314 (4)
	struct Unknown PosOnViewport; // 0x318 (8)
	float CurrentScaleFactor; // 0x320 (4)
	struct Unknown MouseButtonDownPos; // 0x324 (8)
	struct Unknown SelectPingMenuTimer; // 0x330 (8)
	struct Unknown SelectionMenu; // 0x338 (8)
	char IsRoutePing : 0; // 0x340 (1)
	int32_t MaxRoutePointCount; // 0x344 (4)
	struct TArray<Unknown> RoutePointArray; // 0x348 (16)

	void SetClassInfoBoardVisibilityByZoomLevel(int32_t LastZoomLevel, int32_t NewZoomLevel); // Function U.U.SetClassInfoBoardVisibilityByZoomLevel(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetZoomLevel(int32_t& ZoomLevel); // Function U.U.GetZoomLevel(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StopRoutePing(); // Function U.U.StopRoutePing(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateRoutePing(); // Function U.U.UpdateRoutePing(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsFullRoutePing(char& NewParam); // Function U.U.IsFullRoutePing(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckRoutePing(); // Function U.U.CheckRoutePing(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetRoutePing(); // Function U.U.ResetRoutePing(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AddRoutePing(); // Function U.U.AddRoutePing(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRoutePing(); // Function U.U.SetRoutePing(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetVisiblePingMenu(char Visible); // Function U.U.SetVisiblePingMenu(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DebugStringOnMap(struct FString DebugString, struct Unknown WorldPosition, float RemainTime, float FontSize); // Function U.U.DebugStringOnMap(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMapDragging(struct Unknown deltaOnViewport); // Function U.U.OnMapDragging(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RemoveMarker(); // Function U.U.RemoveMarker(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMapRightClick(struct Unknown PosOnViewport, char IsAgree, struct Unknown ForceLocation); // Function U.U.OnMapRightClick(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetZoom(int32_t NewZoomLevel); // Function U.U.SetZoom(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMapZoomOut(); // Function U.U.OnMapZoomOut(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMapZoomIn(); // Function U.U.OnMapZoomIn(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CalcScaleFactorByZoom(int32_t ZoomLevel, float& ScaleFactor); // Function U.U.CalcScaleFactorByZoom(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsZoomLevelInRange(int32_t ZoomLevel, char& ret); // Function U.U.IsZoomLevelInRange(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_91_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_0_K2Node_ComponentBoundEvent_91_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ShowHelBoxButton_K2Node_ComponentBoundEvent_452_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__ShowHelBoxButton_K2Node_ComponentBoundEvent_452_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AddAreaWidget(enum class Unknow WorldMapAreaWidgetType, struct Unknown& AreaWidgetInfo); // Function U.U.AddAreaWidget(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void NotifyNeedRefreshToMap(); // Function U.U.NotifyNeedRefreshToMap(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnAttackedWidget(int32_t UniquePlayerId); // Function U.U.OnAttackedWidget(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnFireWidget(int32_t UniquePlayerId, struct Unknown Rotation, float Length); // Function U.U.OnFireWidget(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetMapPlayers(); // Function U.U.ResetMapPlayers(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnViewportSized(); // Function U.U.OnViewportSized(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void NotifyTargetPawnPos(); // Function U.U.NotifyTargetPawnPos(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RemoveAreaWidget(enum class Unknow WorldMapAreaWidgetType, struct Unknown& AreaWidgetInfo); // Function U.U.RemoveAreaWidget(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateWorldMapClassInfo(); // Function U.U.UpdateWorldMapClassInfo(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnInputSmartPingAgreeWorldMap(); // Function U.U.OnInputSmartPingAgreeWorldMap(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnInputStopSmartPingWorldMap(); // Function U.U.OnInputStopSmartPingWorldMap(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnInputSmartPingMenuWorldMap(); // Function U.U.OnInputSmartPingMenuWorldMap(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnInputSmartPingWorldMap(); // Function U.U.OnInputSmartPingWorldMap(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (char IsShow); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowPingMenu(); // Function U.U.ShowPingMenu(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseButtonDownOnMap(struct Unknown Button, struct Unknown PosOnViewport); // Function U.U.OnMouseButtonDownOnMap(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseButtonUpOnMap(struct Unknown Button, struct Unknown PosOnViewport); // Function U.U.OnMouseButtonUpOnMap(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnDraggingOnMap(struct Unknown Delta); // Function U.U.OnDraggingOnMap(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnWheelOnMap(float Delta, struct Unknown PosOnViewport); // Function U.U.OnWheelOnMap(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnObjectClickOnMap(struct Unknown Button, char mapObjectID); // Function U.U.OnObjectClickOnMap(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown NewAnimation; // 0x248 (8)
	struct Unknown Icon; // 0x250 (8)
	struct Unknown ImageLine; // 0x258 (8)
	struct Unknown Img_Color; // 0x260 (8)

	void InitIcon(struct Unknown PlayerState); // Function U.U.InitIcon(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelInteractionWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown UpArrow; // 0x250 (8)
	struct Unknown InteractivePopup_motion; // 0x258 (8)
	struct Unknown AmmoCnt; // 0x260 (8)
	struct Unknown AmmoDown; // 0x268 (8)
	struct Unknown AmmoUp; // 0x270 (8)
	struct Unknown Attack; // 0x278 (8)
	struct Unknown AttackDown; // 0x280 (8)
	struct Unknown AttackUp; // 0x288 (8)
	struct Unknown BuffListWithText; // 0x290 (8)
	struct Unknown CanvasPanel_17; // 0x298 (8)
	struct Unknown CP_Key; // 0x2A0 (8)
	struct Unknown CustomWidgetSwitcher; // 0x2A8 (8)
	struct Unknown fill; // 0x2B0 (8)
	struct Unknown Firingrate; // 0x2B8 (8)
	struct Unknown FiringrateDown; // 0x2C0 (8)
	struct Unknown FiringrateUp; // 0x2C8 (8)
	struct Unknown HB_BuffList; // 0x2D0 (8)
	struct Unknown HorizontalBox_Rarity; // 0x2D8 (8)
	struct Unknown HorizontalBox_WeaponRarity; // 0x2E0 (8)
	struct Unknown Image; // 0x2E8 (8)
	struct Unknown Image_4; // 0x2F0 (8)
	struct Unknown Image_10; // 0x2F8 (8)
	struct Unknown Image_152; // 0x300 (8)
	struct Unknown Image_ItemIcon; // 0x308 (8)
	struct Unknown Image_WeaponLock; // 0x310 (8)
	struct Unknown Interactive; // 0x318 (8)
	struct Unknown ItemBg_01; // 0x320 (8)
	struct Unknown Key_Bomb; // 0x328 (8)
	struct Unknown KeyImageWidget_C_1; // 0x330 (8)
	struct Unknown NeedItem; // 0x338 (8)
	struct Unknown PickUpBg; // 0x340 (8)
	struct Unknown PickupItem; // 0x348 (8)
	struct Unknown Range; // 0x350 (8)
	struct Unknown RangeDown; // 0x358 (8)
	struct Unknown RangeUp; // 0x360 (8)
	struct Unknown RichT_Action; // 0x368 (8)
	struct Unknown RichT_ActionDescription; // 0x370 (8)
	struct Unknown SizeBox_WeaponOwner; // 0x378 (8)
	struct Unknown Stability; // 0x380 (8)
	struct Unknown StabilityDown; // 0x388 (8)
	struct Unknown StabilityUp; // 0x390 (8)
	struct Unknown Switcher_Item; // 0x398 (8)
	struct Unknown T_BombCancel; // 0x3A0 (8)
	struct Unknown T_ComparingWeaponName; // 0x3A8 (8)
	struct Unknown T_PickupItemName; // 0x3B0 (8)
	struct Unknown T_WeaponName; // 0x3B8 (8)
	struct Unknown Text_CombineTarget; // 0x3C0 (8)
	struct Unknown TextBlock_5; // 0x3C8 (8)
	struct Unknown U; // 0x3D0 (8)
	struct Unknown U_2; // 0x3D8 (8)
	struct Unknown U_3; // 0x3E0 (8)
	struct Unknown U; // 0x3E8 (8)
	struct Unknown U_2; // 0x3F0 (8)
	struct Unknown U_3; // 0x3F8 (8)
	struct Unknown VerticalBox_CombineTarget; // 0x400 (8)
	struct Unknown VerticalBox_StatUp; // 0x408 (8)
	struct Unknown WeaponDesc; // 0x410 (8)
	struct Unknown WeaponItemImage; // 0x418 (8)
	struct Unknown WeaponItemSlot; // 0x420 (8)
	struct Unknown WeaponItemSlot_2; // 0x428 (8)
	struct Unknown WeaponItemSlotHover; // 0x430 (8)
	struct Unknown WidgetSwitcher_123; // 0x438 (8)
	struct Unknown DisableTextColor; // 0x440 (40)
	struct Unknown EnableTextColor; // 0x468 (40)
	char IsDisable : 0; // 0x490 (1)
	struct Unknown PickupItemInfo_1; // 0x498 (152)
	struct Unknown UpLinearColor; // 0x530 (16)
	struct Unknown DownLinearColor; // 0x540 (16)
	struct Unknown NormalSlateColor; // 0x550 (40)
	struct Unknown UpSlateColor; // 0x578 (40)
	struct Unknown DownSlateColor; // 0x5A0 (40)
	char bAction : 0; // 0x5C8 (1)
	char bCompare : 0; // 0x5C9 (1)
	struct Unknown CompareWeaponInfo; // 0x5D0 (2864)
	char IsNoHide : 0; // 0x1100 (1)
	char bWeapon : 0; // 0x1101 (1)
	char bPlayAnimation_WeaponCompare : 0; // 0x1102 (1)
	struct Unknown VisibleTextColor; // 0x1108 (40)
	struct Unknown BrushActionKeyWhite; // 0x1130 (136)
	struct Unknown BrushActionKeyRed; // 0x11B8 (136)
	struct FName TempName; // 0x1240 (8)
	struct FText AvailableAmmoQuantity; // 0x1248 (24)

	void SetCompareFloatArrow(struct Unknown UpImgae, struct Unknown DownImgae, struct Unknown Text, struct Unknown CompareInfo); // Function U.U.SetCompareFloatArrow(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetWeaponBuff(struct Unknown InventoryItemInfo); // Function U.U.SetWeaponBuff(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCustomizedWidget(); // Function U.U.SetCustomizedWidget(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRarityPickUp(enum class Unknow Rarity); // Function U.U.SetRarityPickUp(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCompareArrow(struct Unknown UpImgae, struct Unknown DownImgae, struct Unknown Text, struct Unknown CompareInfo); // Function U.U.SetCompareArrow(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Set(enum class Unknow Rarity); // Function U.U.Set(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Reset(); // Function U.U.Reset(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Hide(); // Function U.U.Hide(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_2385A39542FE4E4DC3D8DA9A1DC61138(struct Unknown Loaded); // Function U.U.OnLoaded_2385A39542FE4E4DC3D8DA9A1DC61138(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_5F4D13BB46FAD58EF9E7D9B1EC284B61(struct Unknown Loaded); // Function U.U.OnLoaded_5F4D13BB46FAD58EF9E7D9B1EC284B61(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_AD9F8D574EE55C633D4CEBA11FC6FB36(struct Unknown Loaded); // Function U.U.OnLoaded_AD9F8D574EE55C633D4CEBA11FC6FB36(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_F76113C9404D07E2AAB61F936BF0F1DA(struct Unknown Loaded); // Function U.U.OnLoaded_F76113C9404D07E2AAB61F936BF0F1DA(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_2D7AC27D4A9340E37F63BDA517074AED(struct Unknown Loaded); // Function U.U.OnLoaded_2D7AC27D4A9340E37F63BDA517074AED(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPickItem(struct Unknown& InteractionInfo, struct Unknown& NewPickItem); // Function U.U.SetPickItem(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetWeapon(struct Unknown& InteractionInfo, struct Unknown& NewWeaponItem, struct Unknown& ItemInfo); // Function U.U.SetWeapon(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCompareWeapon(struct Unknown& InteractionInfo, struct Unknown& NewWeaponItem, struct Unknown& ItemInfo); // Function U.U.SetCompareWeapon(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadIconTexture(struct Unknown IconTexture); // Function U.U.AsyncLoadIconTexture(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PreConstruct(char IsDesignTime); // Function U.U.PreConstruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetAction(struct Unknown& InteractionInfo); // Function U.U.SetAction(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Set(struct Unknown IconTexture, struct Unknown TargetImage); // Function U.U.Set(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetHide(); // Function U.U.SetHide(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCustomMode(int32_t ModeNum); // Function U.U.SetCustomMode(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetNoHide(char NoHide); // Function U.U.SetNoHide(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetInteractionInfo(struct Unknown InteractionInfo); // Function U.U.SetInteractionInfo(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown HorizontalBox_Next; // 0x250 (8)
	struct Unknown ProgressBar_Current; // 0x258 (8)
	struct Unknown ProgressBar_Down; // 0x260 (8)
	struct Unknown ProgressBar_Up; // 0x268 (8)
	struct Unknown TextBlock_Current; // 0x270 (8)
	struct Unknown TextBlock_Max; // 0x278 (8)
	struct Unknown TextBlock_Next; // 0x280 (8)
	char EnableUpdate : 0; // 0x288 (1)
	float CurTime; // 0x28C (4)
	float ShowTime; // 0x290 (4)
	float EndPoint; // 0x294 (4)
	float ChangeValue; // 0x298 (4)
	float StartPoint; // 0x29C (4)
	float Min; // 0x2A0 (4)
	float MAX; // 0x2A4 (4)
	char IsUPState : 0; // 0x2A8 (1)
	struct FMulticastInlineDelegate Dispatcher_ProgressBarDone; // 0x2B0 (16)

	void SetData(float StartPoint, float EndPoint, float Min, float MAX, float ShowTime, char Play); // Function U.U.SetData(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Dispatcher_ProgressBarDone__DelegateSignature(); // Function U.U.Dispatcher_ProgressBarDone__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Hide; // 0x250 (8)
	struct Unknown Show; // 0x258 (8)
	struct Unknown Bg; // 0x260 (8)
	struct Unknown Button_OK; // 0x268 (8)
	struct Unknown Image_168; // 0x270 (8)
	struct Unknown Image_669; // 0x278 (8)
	struct Unknown Message; // 0x280 (8)
	struct Unknown TextBlock_Title; // 0x288 (8)
	struct Unknown U; // 0x290 (8)
	struct Unknown Timer; // 0x298 (8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_159_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_159_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetItemKey(struct FName ItemKey, struct FName HaveItemKey); // Function U.U.SetItemKey(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function U.U.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (struct FText Message); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown Ani_MouseRight; // 0x248 (8)
	struct Unknown Image; // 0x250 (8)
	struct Unknown Image_2; // 0x258 (8)
	struct Unknown Image_292; // 0x260 (8)
	struct Unknown Image_503; // 0x268 (8)

	void HideMouse(); // Function U.U.HideMouse(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowMouse(); // Function U.U.ShowMouse(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelGamePopupWidget {

public:

	struct Unknown UberGraphFrame; // 0x250 (8)
	struct Unknown BT; // 0x258 (8)
	struct Unknown BT; // 0x260 (8)
	struct Unknown BT; // 0x268 (8)
	struct Unknown BT; // 0x270 (8)
	struct Unknown Button_1; // 0x278 (8)
	struct Unknown Button_2; // 0x280 (8)
	struct Unknown Button_4; // 0x288 (8)
	struct Unknown Image_2; // 0x290 (8)
	struct Unknown IM; // 0x298 (8)
	struct Unknown Overlay_Exit; // 0x2A0 (8)
	struct Unknown TextBlock_2; // 0x2A8 (8)
	struct Unknown U; // 0x2B0 (8)
	struct Unknown VerticalBox_InGame; // 0x2B8 (8)
	struct Unknown VerticalBox_Lobby; // 0x2C0 (8)
	struct FName MapNameToExit; // 0x2C8 (8)
	char IsLobby : 0; // 0x2D0 (1)

	struct Unknown OnMouseButtonDown(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnMouseWheel(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseWheel(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Show(); // Function U.U.Show(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Hide(); // Function U.U.Hide(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_1_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_1_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_1_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_1_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_3_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_3_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_3_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_3_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function U.U.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Fade_in_Black_Bg; // 0x250 (8)
	struct Unknown Anim_ShowPerk; // 0x258 (8)
	struct Unknown Image_319; // 0x260 (8)
	struct Unknown Img_Opened; // 0x268 (8)
	struct Unknown T_Desc; // 0x270 (8)
	struct Unknown T_Name; // 0x278 (8)
	struct Unknown U; // 0x280 (8)
	struct Unknown RarityBGMaterialInstance; // 0x288 (8)
	float CurrentAnim; // 0x290 (4)

	void SetItemOption(struct Unknown& ItemOption); // Function U.U.SetItemOption(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown T_Desc; // 0x248 (8)
	struct Unknown U; // 0x250 (8)
	struct Unknown U_2; // 0x258 (8)
	struct Unknown U_3; // 0x260 (8)
	struct Unknown U_4; // 0x268 (8)
	struct Unknown U_5; // 0x270 (8)
	struct Unknown U_6; // 0x278 (8)
	struct Unknown U_7; // 0x280 (8)
	struct Unknown U_8; // 0x288 (8)
	struct Unknown U_9; // 0x290 (8)
	struct Unknown U_10; // 0x298 (8)
	struct Unknown WrapBox_Options; // 0x2A0 (8)

	void SetRandomOptionDesc(struct FText Desc); // Function U.U.SetRandomOptionDesc(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetOptions(struct TArray<Unknown>& OptionIDList); // Function U.U.SetOptions(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown MySeatColor; // 0x248 (16)
	struct Unknown WheelGroup; // 0x258 (8)
	struct Unknown SeatGroup; // 0x260 (8)

	void Setup(struct Unknown VehicleInstance); // Function U.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowSeatIcon(int32_t SeatIndex, char bShow, char bIsMine); // Function U.U.ShowSeatIcon(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowWreckedWheelIcon(int32_t WheelIndex, char bShow); // Function U.U.ShowWreckedWheelIcon(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Image_350; // 0x250 (8)
	struct Unknown Image_585; // 0x258 (8)
	struct Unknown Image_Grade_Color_Line; // 0x260 (8)

	void SetBuffInfo(struct FText BuffName, struct FText Desc, struct Unknown Icon, int32_t Rarity); // Function U.U.SetBuffInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_F9A8A8FB4318139B3972C6ACB5BBA1D9(struct Unknown Loaded); // Function U.U.OnLoaded_F9A8A8FB4318139B3972C6ACB5BBA1D9(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadIconTexture(struct Unknown IconTexture); // Function U.U.AsyncLoadIconTexture(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelReportUserCompletedWidget {

public:

	struct Unknown UberGraphFrame; // 0x250 (8)
	struct Unknown btn_confirm; // 0x258 (8)
	struct Unknown popup; // 0x260 (8)
	struct Unknown txt_description; // 0x268 (8)
	struct Unknown uw; // 0x270 (8)
	struct FText DescriptionText; // 0x278 (24)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PreConstruct(char IsDesignTime); // Function U.U.PreConstruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Button_ItemSlotHover_4; // 0x250 (8)
	struct Unknown U_4; // 0x258 (8)
	struct Unknown ItemWeaponInfo; // 0x260 (136)
	struct Unknown ParentWidget; // 0x2E8 (8)

	void SetButtonEnabled(char InIsEnabled); // Function U.U.SetButtonEnabled(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetWeaponInfo(struct Unknown& ItemWeaponInfo, struct Unknown ParentWidget); // Function U.U.SetWeaponInfo(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_ItemSlotHover_3_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_ItemSlotHover_3_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetButton(); // Function U.U.ResetButton(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SelectButton(); // Function U.U.SelectButton(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelPerkDeckWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Msg_open; // 0x250 (8)
	struct Unknown POPUP_OPEN; // 0x258 (8)
	struct Unknown Idle; // 0x260 (8)
	struct Unknown btn_Choose; // 0x268 (8)
	struct Unknown btn_OK; // 0x270 (8)
	struct Unknown btn_OK_6; // 0x278 (8)
	struct Unknown btn_PerkDeck; // 0x280 (8)
	struct Unknown Button_CloseMovie; // 0x288 (8)
	struct Unknown Button_PlayMovie; // 0x290 (8)
	struct Unknown Button_Refresh; // 0x298 (8)
	struct Unknown Button_Reselect; // 0x2A0 (8)
	struct Unknown Button_SelectMode; // 0x2A8 (8)
	struct Unknown Canvas_CantSelectMessage; // 0x2B0 (8)
	struct Unknown Canvas_MovieScreen; // 0x2B8 (8)
	struct Unknown CanvasPanel_ClassList; // 0x2C0 (8)
	struct Unknown CanvasPanel_NewbieAdvantage; // 0x2C8 (8)
	struct Unknown CheckBox_PerkDeckNotReOpen; // 0x2D0 (8)
	struct Unknown GoldLack; // 0x2D8 (8)
	struct Unknown HorizontalBox_ClassList; // 0x2E0 (8)
	struct Unknown HorizontalBox_PerkDeckReOpen; // 0x2E8 (8)
	struct Unknown Image_1; // 0x2F0 (8)
	struct Unknown Image_2; // 0x2F8 (8)
	struct Unknown Image_5; // 0x300 (8)
	struct Unknown Image_10; // 0x308 (8)
	struct Unknown Image_11; // 0x310 (8)
	struct Unknown Image_13; // 0x318 (8)
	struct Unknown Image_134; // 0x320 (8)
	struct Unknown Image_213; // 0x328 (8)
	struct Unknown Image_247; // 0x330 (8)
	struct Unknown Image_271; // 0x338 (8)
	struct Unknown Image_276; // 0x340 (8)
	struct Unknown Image_335; // 0x348 (8)
	struct Unknown Image_342; // 0x350 (8)
	struct Unknown Image_484; // 0x358 (8)
	struct Unknown Image_566; // 0x360 (8)
	struct Unknown Image_1200; // 0x368 (8)
	struct Unknown Image_1511; // 0x370 (8)
	struct Unknown Image_Class; // 0x378 (8)
	struct Unknown Image_ClassIcon; // 0x380 (8)
	struct Unknown Image_Cycle; // 0x388 (8)
	struct Unknown Image_Cycle_2; // 0x390 (8)
	struct Unknown Image_Cycle_4; // 0x398 (8)
	struct Unknown Image_Weapon; // 0x3A0 (8)
	struct Unknown Img_Movie; // 0x3A8 (8)
	struct Unknown ReseletTextGroup1; // 0x3B0 (8)
	struct Unknown ReseletTextGroup1_2; // 0x3B8 (8)
	struct Unknown ReseletTextGroup2; // 0x3C0 (8)
	struct Unknown ReseletTextGroup2_2; // 0x3C8 (8)
	struct Unknown ReseletTextGroup2_4; // 0x3D0 (8)
	struct Unknown ScaleBox_ClassList; // 0x3D8 (8)
	struct Unknown ScaleBox_SelectNotifyMessage; // 0x3E0 (8)
	struct Unknown SizeBox_Choose; // 0x3E8 (8)
	struct Unknown SizeBox_Ok; // 0x3F0 (8)
	struct Unknown SizeBox_Ok2; // 0x3F8 (8)
	struct Unknown SizeBox_Random; // 0x400 (8)
	struct Unknown SizeBox_Refrest; // 0x408 (8)
	struct Unknown SizeBox_Select; // 0x410 (8)
	struct Unknown T_AmmoName; // 0x418 (8)
	struct Unknown T_ClassDeckName; // 0x420 (8)
	struct Unknown T_ClassDesc; // 0x428 (8)
	struct Unknown T_CurrentGold; // 0x430 (8)
	struct Unknown T_WeaponDesc; // 0x438 (8)
	struct Unknown T_WeaponName; // 0x440 (8)
	struct Unknown TextBlock_Close; // 0x448 (8)
	struct Unknown TextBlock_Close_2; // 0x450 (8)
	struct Unknown TextBlock_Close_7; // 0x458 (8)
	struct Unknown TextBlock_MaxReset; // 0x460 (8)
	struct Unknown TextBlock_MaxReset_2; // 0x468 (8)
	struct Unknown TextBlock_Price_ChangeDeck; // 0x470 (8)
	struct Unknown TextBlock_Price_Random; // 0x478 (8)
	struct Unknown TextBlock_Price_Select; // 0x480 (8)
	struct Unknown TextBlock_RandomRemainCount; // 0x488 (8)
	struct Unknown TextBlock_RefreshRemainCount; // 0x490 (8)
	struct Unknown TextBlock_Reselect; // 0x498 (8)
	struct Unknown TextBlock_Reselect_2; // 0x4A0 (8)
	struct Unknown TextBlock_Reselect_4; // 0x4A8 (8)
	struct Unknown U; // 0x4B0 (8)
	struct Unknown U; // 0x4B8 (8)
	struct Unknown WidgetSwitcher_ChangeDeck; // 0x4C0 (8)
	struct Unknown WidgetSwitcher_ChangeDeck_2; // 0x4C8 (8)
	struct Unknown WidgetSwitcher_Reselect; // 0x4D0 (8)
	struct Unknown WidgetSwitcher_Reselect_2; // 0x4D8 (8)
	struct Unknown WidgetSwitcher_Reselect_4; // 0x4E0 (8)
	struct Unknown InventoryWidget; // 0x4E8 (8)
	struct TArray<Unknown> Slots; // 0x4F0 (16)
	struct Unknown IconBrush; // 0x500 (136)
	struct Unknown HoverWidget; // 0x588 (8)
	struct Unknown HoverTimerHandle; // 0x590 (8)
	int64_t LocalTemp; // 0x598 (8)
	struct Unknown MediaPlayer; // 0x5A0 (8)
	struct TMap<Unknown, Unknown> ClassVideo_Map; // 0x5A8 (80)
	char bBlockButton : 0; // 0x5F8 (1)
	char bButtonEnabled : 0; // 0x5F9 (1)
	char bCanRemainCount : 0; // 0x5FA (1)
	char bCanCurrentGold : 0; // 0x5FB (1)
	char bWaitingResponse : 0; // 0x5FC (1)
	int64_t CurrentGold; // 0x600 (8)
	int32_t ChangeDeckCount; // 0x608 (4)
	int32_t ChangeDeckListCount; // 0x60C (4)
	int32_t PerkDeckID; // 0x610 (4)
	int32_t DisableTime; // 0x614 (4)
	struct TMap<Unknown, Unknown> ClassInfoWidgetMap; // 0x618 (80)
	struct Unknown CurrentPerkDeckSelectInfo; // 0x668 (24)
	int32_t LocalPerkMode; // 0x680 (4)
	float ClassListPadding; // 0x684 (4)
	struct Unknown Handle_PlayMovie; // 0x688 (8)
	struct Unknown CurrentClassVideo; // 0x690 (8)
	struct Unknown Handle_SetPerkInfoByHoverClassButton; // 0x698 (8)
	char LastClassButtonHovered : 0; // 0x6A0 (1)
	int32_t LastClassIndex; // 0x6A4 (4)

	void SequenceEvent__ENTRYPOINTU_3(); // Function U.U.SequenceEvent__ENTRYPOINTU_3(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_2(); // Function U.U.SequenceEvent__ENTRYPOINTU_2(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_1(); // Function U.U.SequenceEvent__ENTRYPOINTU_1(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkDeckReOpenCheck(); // Function U.U.SetPerkDeckReOpenCheck(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetComingSoonClass(); // Function U.U.SetComingSoonClass(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetComingSoonClass(struct FName& ClassRow); // Function U.U.GetComingSoonClass(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateNewbieAdvantage(struct Unknown& PerkDeckData); // Function U.U.UpdateNewbieAdvantage(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DisableClassButtonWithoutSelected(); // Function U.U.DisableClassButtonWithoutSelected(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkInfoByHoverClassButton(); // Function U.U.SetPerkInfoByHoverClassButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayChangeDeckSound(); // Function U.U.PlayChangeDeckSound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayChooseSound(); // Function U.U.PlayChooseSound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayClickSound(); // Function U.U.PlayClickSound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayHoverSound(); // Function U.U.PlayHoverSound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HasPerkDeckClassInfo(char& NewParam); // Function U.U.HasPerkDeckClassInfo(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetButtonInfo(struct Unknown Button, struct Unknown TextPrice, int32_t Price, struct Unknown TextRemainCount, int32_t RemainCount); // Function U.U.SetButtonInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateButtonInfos(); // Function U.U.UpdateButtonInfos(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CanUseButton(char& Enabled); // Function U.U.CanUseButton(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetButtonEnabled(char IsEnabled); // Function U.U.SetButtonEnabled(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkDeckSelectInfo(); // Function U.U.SetPerkDeckSelectInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ChooseClassButton(int32_t ClassIndex); // Function U.U.ChooseClassButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverClassButton(int32_t ClassIndex, char IsHoverd); // Function U.U.HoverClassButton(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetSelectedClassInfo(); // Function U.U.ResetSelectedClassInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RefreshSelectedClassInfo(); // Function U.U.RefreshSelectedClassInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetClassList(); // Function U.U.SetClassList(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkModeInfo(int32_t PerkMode); // Function U.U.SetPerkModeInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnMouseButtonDown(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetClassVideoSource(int32_t PerkDeckID, struct Unknown& VideoSource); // Function U.U.GetClassVideoSource(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ReadyMovie(int32_t PerkDeckID); // Function U.U.ReadyMovie(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CloseMovie(); // Function U.U.CloseMovie(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	enum class Unknow GetVisibility_RemainTime(); // Function U.U.GetVisibility_RemainTime(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetInventoryItemDetailInfo(struct FName Name, struct Unknown& Info); // Function U.U.GetInventoryItemDetailInfo(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct FText Get_TextBlock_RemailTime_Text_1(); // Function U.U.Get_TextBlock_RemailTime_Text_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetServerWaiting(char bWait); // Function U.U.SetServerWaiting(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetGoldInfo(); // Function U.U.SetGoldInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkInfo(char UseLocalPlayerInfo, struct Unknown PerkDeckClassInfo); // Function U.U.SetPerkInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckInfos(char ForceUpdate); // Function U.U.CheckInfos(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void InitInfos(); // Function U.U.InitInfos(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnMouseWheel(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseWheel(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Hide(); // Function U.U.Hide(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Show(); // Function U.U.Show(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_A83B5F164320A0E753E9088699009EB0(struct Unknown Loaded); // Function U.U.OnLoaded_A83B5F164320A0E753E9088699009EB0(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Finished_68D0074544AABC70455E90A37E1ED67B(); // Function U.U.Finished_68D0074544AABC70455E90A37E1ED67B(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_C916107845AEFBC703CB8F9D00DAC0F0(struct Unknown Loaded); // Function U.U.OnLoaded_C916107845AEFBC703CB8F9D00DAC0F0(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_19FB202A430BEE3458DBA2B7F1362CC8(struct Unknown Loaded); // Function U.U.OnLoaded_19FB202A430BEE3458DBA2B7F1362CC8(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadingWeapon(struct Unknown IconTexture); // Function U.U.AsyncLoadingWeapon(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadingClass(struct Unknown Texture); // Function U.U.AsyncLoadingClass(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnDelegatePayGoldOnChangeDeck(char bSuccess); // Function U.U.OnDelegatePayGoldOnChangeDeck(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnAnimationFinished(struct Unknown Animation); // Function U.U.OnAnimationFinished(BlueprintCosmetic|Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Movie_K2Node_Com(); // Function U.U.BndEvt__Button_Movie_K2Node_Com(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_CloseMovie_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_CloseMovie_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function U.U.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnBattleRoyalStateChanged(enum class Unknow PrevState, enum class Unknow CurrentState); // Function U.U.OnBattleRoyalStateChanged(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Reselect_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Reselect_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ClosePopup(); // Function U.U.ClosePopup(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Reselect_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Reselect_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_PerkDeck_K2Node_Com(); // Function U.U.BndEvt__btn_PerkDeck_K2Node_Com(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent_1(); // Function U.U.CustomEvent_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ChangeClassOnScenario(int32_t DeckIndex); // Function U.U.ChangeClassOnScenario(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_OK_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSign(); // Function U.U.BndEvt__btn_OK_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSign(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadingClassIcon(struct Unknown Texture); // Function U.U.AsyncLoadingClassIcon(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideAnim(); // Function U.U.HideAnim(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowAnim(); // Function U.U.ShowAnim(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangePerkModeDelegate_Event_1(int32_t PerkMode); // Function U.U.OnChangePerkModeDelegate_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OpenPopup(); // Function U.U.OpenPopup(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_SelectMode_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_SelectMode_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_Choose_1_K2Node_Com(); // Function U.U.BndEvt__btn_Choose_1_K2Node_Com(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_OK_5_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__btn_OK_5_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DelegatePayGoldOnSelectDeck_Event_1(char bSuccess); // Function U.U.DelegatePayGoldOnSelectDeck_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangedTeamPlayerClass(); // Function U.U.OnChangedTeamPlayerClass(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkInfoImpl(char bUseLocalPlayerInfo, struct Unknown& PerkDeckClassInfo); // Function U.U.SetPerkInfoImpl(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangedCurrentPerkDeckSelectInfo(); // Function U.U.OnChangedCurrentPerkDeckSelectInfo(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckSelectMode(); // Function U.U.CheckSelectMode(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DelegateChoosePerkDeck_Event_1(char bSuccess); // Function U.U.DelegateChoosePerkDeck_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayMovie(); // Function U.U.PlayMovie(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Refresh_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Refresh_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DelegatePayGoldOnChangeDeckList_Event_1(char bSuccess); // Function U.U.DelegatePayGoldOnChangeDeckList_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_SelectMode_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_SelectMode_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Refresh_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Refresh_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_OK_5_K2Node_ComponentBoundEvent_13_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__btn_OK_5_K2Node_ComponentBoundEvent_13_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void TryChangeSelectDeck(); // Function U.U.TryChangeSelectDeck(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__CheckBox_PerkDeckReOpen_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature(char bIsChecked); // Function U.U.BndEvt__CheckBox_PerkDeckReOpen_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelGameMatchEndWidget {

public:

	struct Unknown UberGraphFrame; // 0x360 (8)
	struct Unknown U; // 0x368 (8)
	struct Unknown U; // 0x370 (8)
	struct Unknown UW_SimpleResult; // 0x378 (8)
	struct Unknown MainWidgetRef; // 0x380 (8)
	struct Unknown PlayerHUDRef; // 0x388 (8)
	struct Unknown UW_FinalResult; // 0x390 (8)
	struct Unknown UW_Animation; // 0x398 (8)
	struct Unknown PlayerControllerRef; // 0x3A0 (8)
	char NewResult : 0; // 0x3A8 (1)
	struct Unknown ResultData; // 0x3A9 (4)
	char IsGiveUp : 0; // 0x3AD (1)
	float WinMatchEndResultShowTime; // 0x3B0 (4)
	struct Unknown ResultMatchEndAnimation; // 0x3B4 (2)

	char IsVisibleMatchEndWidget(); // Function U.U.IsVisibleMatchEndWidget(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetPlayerState(struct Unknown& PlayerState); // Function U.U.GetPlayerState(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_ShowSimpleResult(struct Unknown& SimpleResult); // Function U.U.K2_ShowSimpleResult(Event|Protected|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_HideSimpleResult(); // Function U.U.K2_HideSimpleResult(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_ShowFinalResult(struct Unknown& FinalResult); // Function U.U.K2_ShowFinalResult(Event|Protected|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_HideFinalResult(); // Function U.U.K2_HideFinalResult(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_ShowMatchEndAnimation(struct Unknown& MatchEndAnimation, struct Unknown& SimpleResult); // Function U.U.K2_ShowMatchEndAnimation(Event|Protected|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_HideMatchEndAnimation(); // Function U.U.K2_HideMatchEndAnimation(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Init(); // Function U.U.Init(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Hide; // 0x250 (8)
	struct Unknown RankDown; // 0x258 (8)
	struct Unknown RankUp; // 0x260 (8)
	struct Unknown Anim_Reward; // 0x268 (8)
	struct Unknown Arrow_3; // 0x270 (8)
	struct Unknown ArrowLine_3; // 0x278 (8)
	struct Unknown BottomLine_3; // 0x280 (8)
	struct Unknown BrightSpot_01; // 0x288 (8)
	struct Unknown BrightSpot_02; // 0x290 (8)
	struct Unknown BrightSpot_03; // 0x298 (8)
	struct Unknown BrightSpot_04; // 0x2A0 (8)
	struct Unknown BrightSpot_05; // 0x2A8 (8)
	struct Unknown Button_DeathCam_2; // 0x2B0 (8)
	struct Unknown Button_Exit; // 0x2B8 (8)
	struct Unknown Button_KillCam; // 0x2C0 (8)
	struct Unknown Button_Report; // 0x2C8 (8)
	struct Unknown Button_Spectate; // 0x2D0 (8)
	struct Unknown CanvasPanel_3; // 0x2D8 (8)
	struct Unknown CanvasPanel_9; // 0x2E0 (8)
	struct Unknown CanvasPanel_1174; // 0x2E8 (8)
	struct Unknown CanvasPanel_1384; // 0x2F0 (8)
	struct Unknown Glow1; // 0x2F8 (8)
	struct Unknown Glow2; // 0x300 (8)
	struct Unknown Glow3; // 0x308 (8)
	struct Unknown Glow_01; // 0x310 (8)
	struct Unknown GlowLine; // 0x318 (8)
	struct Unknown Gold; // 0x320 (8)
	struct Unknown Image_26; // 0x328 (8)
	struct Unknown Image_27; // 0x330 (8)
	struct Unknown Image_28; // 0x338 (8)
	struct Unknown Image_29; // 0x340 (8)
	struct Unknown Image_216; // 0x348 (8)
	struct Unknown Image_223; // 0x350 (8)
	struct Unknown Image_458; // 0x358 (8)
	struct Unknown Image_559; // 0x360 (8)
	struct Unknown Image_CurrentRANK; // 0x368 (8)
	struct Unknown Image_DownRANK; // 0x370 (8)
	struct Unknown Image_UpRANK; // 0x378 (8)
	struct Unknown L_Wing01; // 0x380 (8)
	struct Unknown L_Wing01_2; // 0x388 (8)
	struct Unknown L_Wing01_5; // 0x390 (8)
	struct Unknown L_Wing02; // 0x398 (8)
	struct Unknown L_Wing02_2; // 0x3A0 (8)
	struct Unknown L_Wing02_5; // 0x3A8 (8)
	struct Unknown L_Wing03; // 0x3B0 (8)
	struct Unknown L_Wing03_2; // 0x3B8 (8)
	struct Unknown L_Wing03_5; // 0x3C0 (8)
	struct Unknown L_WingLine; // 0x3C8 (8)
	struct Unknown L_WingLine_3; // 0x3D0 (8)
	struct Unknown Light_2; // 0x3D8 (8)
	struct Unknown Light_01; // 0x3E0 (8)
	struct Unknown Light_02; // 0x3E8 (8)
	struct Unknown Light_03; // 0x3F0 (8)
	struct Unknown Light_04; // 0x3F8 (8)
	struct Unknown Light_05; // 0x400 (8)
	struct Unknown Light_06; // 0x408 (8)
	struct Unknown Overlay; // 0x410 (8)
	struct Unknown Overlay_2; // 0x418 (8)
	struct Unknown Overlay_264; // 0x420 (8)
	struct Unknown Overlay_Report; // 0x428 (8)
	struct Unknown Overlay_Spectate; // 0x430 (8)
	struct Unknown R_Wing01; // 0x438 (8)
	struct Unknown R_Wing01_2; // 0x440 (8)
	struct Unknown R_Wing01_5; // 0x448 (8)
	struct Unknown R_Wing01_6; // 0x450 (8)
	struct Unknown R_Wing02; // 0x458 (8)
	struct Unknown R_Wing02_2; // 0x460 (8)
	struct Unknown R_Wing02_5; // 0x468 (8)
	struct Unknown R_Wing02_6; // 0x470 (8)
	struct Unknown R_Wing03; // 0x478 (8)
	struct Unknown R_Wing03_2; // 0x480 (8)
	struct Unknown R_Wing03_5; // 0x488 (8)
	struct Unknown R_Wing03_6; // 0x490 (8)
	struct Unknown R_WingLine; // 0x498 (8)
	struct Unknown R_WingLine_3; // 0x4A0 (8)
	struct Unknown Ribbon; // 0x4A8 (8)
	struct Unknown Ring; // 0x4B0 (8)
	struct Unknown RIng_Glow_01; // 0x4B8 (8)
	struct Unknown ScrollBox_2; // 0x4C0 (8)
	struct Unknown ScrollBox_199; // 0x4C8 (8)
	struct Unknown SizeBox_8; // 0x4D0 (8)
	struct Unknown Spacer_6018; // 0x4D8 (8)
	struct Unknown Spacer_6217; // 0x4E0 (8)
	struct Unknown Spacer_Center; // 0x4E8 (8)
	struct Unknown Spacer_Center_2; // 0x4F0 (8)
	struct Unknown T_RemainTime_2; // 0x4F8 (8)
	struct Unknown Text_Report; // 0x500 (8)
	struct Unknown TextBlock_3; // 0x508 (8)
	struct Unknown TextBlock_12; // 0x510 (8)
	struct Unknown TextBlock_13; // 0x518 (8)
	struct Unknown TextBlock_14; // 0x520 (8)
	struct Unknown TextBlock_25; // 0x528 (8)
	struct Unknown TextBlock_27; // 0x530 (8)
	struct Unknown TextBlock_1425; // 0x538 (8)
	struct Unknown TextBlock_2242; // 0x540 (8)
	struct Unknown TextBlock_2769; // 0x548 (8)
	struct Unknown TextBlock_3056; // 0x550 (8)
	struct Unknown TextBlock_LocalMatchRP; // 0x558 (8)
	struct Unknown TextGlow01; // 0x560 (8)
	struct Unknown TextGlow02; // 0x568 (8)
	struct Unknown TextGlow03; // 0x570 (8)
	struct Unknown TopLine_3; // 0x578 (8)
	struct Unknown U; // 0x580 (8)
	struct Unknown U_2; // 0x588 (8)
	struct Unknown U_3; // 0x590 (8)
	struct Unknown U_4; // 0x598 (8)
	struct Unknown U_5; // 0x5A0 (8)
	struct Unknown U_369; // 0x5A8 (8)
	struct Unknown U; // 0x5B0 (8)
	struct Unknown U; // 0x5B8 (8)
	struct Unknown VerticalBox_191; // 0x5C0 (8)
	struct Unknown WidgetSwitcher_2; // 0x5C8 (8)
	char MatchEnd : 0; // 0x5D0 (1)
	struct Unknown AnimationData; // 0x5D1 (2)
	struct Unknown MatchEndWidgetRef; // 0x5D8 (8)
	struct Unknown SimpleResult; // 0x5E0 (168)
	struct Unknown SimpleTimer; // 0x688 (8)
	char IsWinningCam : 0; // 0x690 (1)
	struct Unknown StartSound; // 0x694 (4)
	struct Unknown GainGoldHandle; // 0x698 (8)
	struct Unknown GoldHandle; // 0x6A0 (8)
	struct Unknown FinalResultData; // 0x6A8 (4)
	int32_t RandomGold; // 0x6AC (4)
	int32_t GainGoldValue; // 0x6B0 (4)
	struct Unknown LocalWidget; // 0x6B8 (8)
	struct Unknown PlayerState; // 0x6C0 (8)
	struct Unknown Timehandle_Rank; // 0x6C8 (8)
	char Increase : 0; // 0x6D0 (1)
	char bMaxPrograssbar : 0; // 0x6D1 (1)
	int32_t CurrentRP; // 0x6D4 (4)
	int32_t PlayerOriRP; // 0x6D8 (4)
	int32_t TargetRP; // 0x6DC (4)
	int32_t NextTireRP; // 0x6E0 (4)
	int32_t CurrentTierID; // 0x6E4 (4)
	char IsGiveUp : 0; // 0x6E8 (1)
	int32_t TempRank; // 0x6EC (4)
	int32_t TempKill; // 0x6F0 (4)
	int32_t TempHit; // 0x6F4 (4)
	int32_t TempSuvival; // 0x6F8 (4)
	int32_t SeasonRP; // 0x6FC (4)
	int32_t GainedRP; // 0x700 (4)
	int32_t AminRPText; // 0x704 (4)
	int32_t StartRP; // 0x708 (4)
	int32_t EndRP; // 0x70C (4)
	float ShowTime; // 0x710 (4)
	char IsTargetCameraKiller : 0; // 0x714 (1)

	void SequenceEvent__ENTRYPOINTU_2(); // Function U.U.SequenceEvent__ENTRYPOINTU_2(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_1(); // Function U.U.SequenceEvent__ENTRYPOINTU_1(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowMAXRPText(); // Function U.U.ShowMAXRPText(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RankerDown(); // Function U.U.RankerDown(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RankPointSetData(); // Function U.U.RankPointSetData(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetupRankDown(); // Function U.U.SetupRankDown(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetupRankUp(); // Function U.U.SetupRankUp(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetTierRP(int32_t& NextRP, char& Next, int32_t& NowRP, int32_t& PreviousRP, char& Previous); // Function U.U.GetTierRP(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetItem(); // Function U.U.SetItem(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRank(); // Function U.U.SetRank(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPlayInfo(); // Function U.U.SetPlayInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Init(); // Function U.U.Init(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRankImage(int32_t IDD, struct Unknown Widgett); // Function U.U.SetRankImage(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateInputMode(); // Function U.U.UpdateInputMode(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideSimpleWidget(); // Function U.U.HideSimpleWidget(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Check(); // Function U.U.Check(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Check(); // Function U.U.Check(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ReportSended(); // Function U.U.ReportSended(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetColorTextWidget(struct Unknown Widgett, int32_t Valuee, struct Unknown Colorr); // Function U.U.SetColorTextWidget(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetGold(); // Function U.U.SetGold(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_DeathCam_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_DeathCam_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Spectate_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Spectate_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Exit_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Exit_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_DeathCam_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_DeathCam_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Spectate_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Spectate_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Exit_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Exit_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Report_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Report_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowDeathCam(); // Function U.U.ShowDeathCam(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Close(); // Function U.U.Close(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Report_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Report_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function U.U.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowGold(); // Function U.U.ShowGold(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetInfo(struct Unknown PS, struct Unknown ResultData, struct Unknown MatchEndWidget); // Function U.U.SetInfo(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EventRankAnimation(); // Function U.U.EventRankAnimation(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadTexture(struct Unknown Imge, struct Unknown Widget); // Function U.U.AsyncLoadTexture(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RankUpDown(); // Function U.U.RankUpDown(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_DeathCam_1_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_DeathCam_1_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_DeathCam_1_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_DeathCam_1_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelAttackUserWidget {

public:

	struct Unknown Enemy_Lv_Motion_FadeOut_Inert; // 0x2A0 (8)
	struct Unknown Enemy_Lv_Motion_FadeIn_Inert; // 0x2A8 (8)
	struct Unknown FadeOut; // 0x2B0 (8)
	struct Unknown Enemy_Inert; // 0x2B8 (8)
	struct Unknown HorizontalBox_1; // 0x2C0 (8)
	struct Unknown HorizontalBox_2; // 0x2C8 (8)
	struct Unknown Image_2; // 0x2D0 (8)
	struct Unknown Image_145; // 0x2D8 (8)
	struct Unknown Overlay_2; // 0x2E0 (8)
	struct Unknown Overlay_98; // 0x2E8 (8)
	struct Unknown Pawn; // 0x2F0 (8)
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Anim_Show_classinfo; // 0x250 (8)
	struct Unknown Button_SpreadList; // 0x258 (8)
	struct Unknown Image_323; // 0x260 (8)
	struct Unknown U; // 0x268 (8)
	struct Unknown U_2; // 0x270 (8)
	struct Unknown U_3; // 0x278 (8)
	struct Unknown U_4; // 0x280 (8)
	struct Unknown U_5; // 0x288 (8)
	struct Unknown U_6; // 0x290 (8)
	struct Unknown U_7; // 0x298 (8)
	struct Unknown U_8; // 0x2A0 (8)
	struct Unknown U_9; // 0x2A8 (8)
	struct Unknown U_10; // 0x2B0 (8)
	struct Unknown U_11; // 0x2B8 (8)
	struct Unknown U_12; // 0x2C0 (8)
	struct Unknown VerticalBox_ClassBox; // 0x2C8 (8)
	struct Unknown VerticalBox_ClassList; // 0x2D0 (8)
	struct Unknown VerticalBox_Description; // 0x2D8 (8)
	struct Unknown VerticalBox_Main; // 0x2E0 (8)
	int32_t LastTableRow; // 0x2E8 (4)
	struct TMap<Unknown, Unknown> ClassInfoItemMap; // 0x2F0 (80)
	char ListVisibility : 0; // 0x340 (1)

	void UpdateClassCount(); // Function U.U.UpdateClassCount(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HiddenAllClassLists(); // Function U.U.HiddenAllClassLists(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetClassList(); // Function U.U.SetClassList(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_SpreadList_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_SpreadList_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OpenList(); // Function U.U.OpenList(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CloseList(); // Function U.U.CloseList(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateList(); // Function U.U.UpdateList(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnBattleRoyalStateChanged_Event_1(enum class Unknow PrevState, enum class Unknow CurrentState); // Function U.U.OnBattleRoyalStateChanged_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnUpdateClassCount_Event_1(); // Function U.U.OnUpdateClassCount_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown FadeIn3; // 0x250 (8)
	struct Unknown FadeIn2; // 0x258 (8)
	struct Unknown RankDown; // 0x260 (8)
	struct Unknown RankUp; // 0x268 (8)
	struct Unknown FadeOut; // 0x270 (8)
	struct Unknown FadeIn; // 0x278 (8)
	struct Unknown Button_DeathCam; // 0x280 (8)
	struct Unknown Button_Exit; // 0x288 (8)
	struct Unknown Button_Report; // 0x290 (8)
	struct Unknown Button_Spectate; // 0x298 (8)
	struct Unknown Image; // 0x2A0 (8)
	struct Unknown Image_2; // 0x2A8 (8)
	struct Unknown Image_3; // 0x2B0 (8)
	struct Unknown Image_4; // 0x2B8 (8)
	struct Unknown Image_5; // 0x2C0 (8)
	struct Unknown Image_6; // 0x2C8 (8)
	struct Unknown Image_7; // 0x2D0 (8)
	struct Unknown Image_8; // 0x2D8 (8)
	struct Unknown Image_135; // 0x2E0 (8)
	struct Unknown Image_149; // 0x2E8 (8)
	struct Unknown Image_239; // 0x2F0 (8)
	struct Unknown Image_314; // 0x2F8 (8)
	struct Unknown Image_377; // 0x300 (8)
	struct Unknown Image_444; // 0x308 (8)
	struct Unknown Image_477; // 0x310 (8)
	struct Unknown Image_518; // 0x318 (8)
	struct Unknown Image_531; // 0x320 (8)
	struct Unknown Image_745; // 0x328 (8)
	struct Unknown Image_992; // 0x330 (8)
	struct Unknown Image_1373; // 0x338 (8)
	struct Unknown Image_1459; // 0x340 (8)
	struct Unknown Image_1506; // 0x348 (8)
	struct Unknown Image_1508; // 0x350 (8)
	struct Unknown Image_1925; // 0x358 (8)
	struct Unknown Image_NextTireIcon; // 0x360 (8)
	struct Unknown Light_01; // 0x368 (8)
	struct Unknown Light_02; // 0x370 (8)
	struct Unknown Light_03; // 0x378 (8)
	struct Unknown Light_04; // 0x380 (8)
	struct Unknown Light_05; // 0x388 (8)
	struct Unknown Light_06; // 0x390 (8)
	struct Unknown Light_07; // 0x398 (8)
	struct Unknown Light_08; // 0x3A0 (8)
	struct Unknown Overlay_Rank; // 0x3A8 (8)
	struct Unknown Overlay_Report; // 0x3B0 (8)
	struct Unknown Overlay_Spectate; // 0x3B8 (8)
	struct Unknown ProgressBar_Current; // 0x3C0 (8)
	struct Unknown ProgressBar_Down; // 0x3C8 (8)
	struct Unknown ProgressBar_Up; // 0x3D0 (8)
	struct Unknown ScrollBox_GoldList; // 0x3D8 (8)
	struct Unknown ScrollBox_ItemList; // 0x3E0 (8)
	struct Unknown SizeBox_8; // 0x3E8 (8)
	struct Unknown Spacer_6018; // 0x3F0 (8)
	struct Unknown Spacer_6217; // 0x3F8 (8)
	struct Unknown Spacer_Center; // 0x400 (8)
	struct Unknown T_RemainTime; // 0x408 (8)
	struct Unknown team_kill; // 0x410 (8)
	struct Unknown Team_Revives; // 0x418 (8)
	struct Unknown Text_Report; // 0x420 (8)
	struct Unknown TextBlock_1425; // 0x428 (8)
	struct Unknown TextBlock_CurrentRP; // 0x430 (8)
	struct Unknown TextBlock_ItemCount; // 0x438 (8)
	struct Unknown TextBlock_Kill; // 0x440 (8)
	struct Unknown TextBlock_MatchRP; // 0x448 (8)
	struct Unknown TextBlock_NextRP; // 0x450 (8)
	struct Unknown TextBlock_Rank; // 0x458 (8)
	struct Unknown TextBlock_Resuscitates; // 0x460 (8)
	struct Unknown TextBlock_Title; // 0x468 (8)
	struct Unknown TextBlock_TotalGold; // 0x470 (8)
	struct Unknown TextBlock_TotalTeamCount; // 0x478 (8)
	struct Unknown U; // 0x480 (8)
	struct Unknown U; // 0x488 (8)
	struct Unknown U_1; // 0x490 (8)
	struct Unknown U_2; // 0x498 (8)
	struct Unknown U; // 0x4A0 (8)
	struct Unknown VerticalBox_188; // 0x4A8 (8)
	struct Unknown FinalResultData; // 0x4B0 (4)
	struct Unknown PlayerState; // 0x4B8 (8)
	struct Unknown Timehandle_Rank; // 0x4C0 (8)
	int32_t PlayerOriRP; // 0x4C8 (4)
	int32_t TargetRP; // 0x4CC (4)
	int32_t CurrentRP; // 0x4D0 (4)
	int32_t NextTireRP; // 0x4D4 (4)
	char Increase : 0; // 0x4D8 (1)
	int32_t CurrentTierID; // 0x4DC (4)
	char bMaxPrograssbar : 0; // 0x4E0 (1)
	struct Unknown MatchEndWidgetRef; // 0x4E8 (8)
	int32_t RandomGold; // 0x4F0 (4)
	struct Unknown GoldHandle; // 0x4F8 (8)
	char IsWinningCam : 0; // 0x500 (1)
	int32_t GainGoldValue; // 0x504 (4)
	struct Unknown GainGoldHandle; // 0x508 (8)
	struct Unknown StartSound; // 0x510 (4)

	void SequenceEvent__ENTRYPOINTU_4(); // Function U.U.SequenceEvent__ENTRYPOINTU_4(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_3(); // Function U.U.SequenceEvent__ENTRYPOINTU_3(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_2(); // Function U.U.SequenceEvent__ENTRYPOINTU_2(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_1(); // Function U.U.SequenceEvent__ENTRYPOINTU_1(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateInputMode(); // Function U.U.UpdateInputMode(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Check(); // Function U.U.Check(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Check(); // Function U.U.Check(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ReportSended(); // Function U.U.ReportSended(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetAllWidgetVisiblility(char IsShow); // Function U.U.SetAllWidgetVisiblility(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideSimpleWidget(); // Function U.U.HideSimpleWidget(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideSimpleWidgetSlowly(); // Function U.U.HideSimpleWidgetSlowly(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRankImage(int32_t ID, struct Unknown Widget); // Function U.U.SetRankImage(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetNextRank(int32_t TierID); // Function U.U.SetNextRank(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayRankDown(); // Function U.U.PlayRankDown(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayRankUp(); // Function U.U.PlayRankUp(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Init(); // Function U.U.Init(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayRankAnimation(int32_t StartRP, int32_t MatchRP, int32_t MaxRP); // Function U.U.PlayRankAnimation(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateRank(); // Function U.U.UpdateRank(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetColorTextWidget(struct Unknown Widget, int32_t Value, struct Unknown Color); // Function U.U.SetColorTextWidget(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPlayInfo(); // Function U.U.SetPlayInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetItem(); // Function U.U.SetItem(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRank(); // Function U.U.SetRank(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetGold(); // Function U.U.SetGold(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_5C9A4A6341FF221002168F953DF28124(struct Unknown Loaded); // Function U.U.OnLoaded_5C9A4A6341FF221002168F953DF28124(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_161_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_161_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Spectate_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Spectate_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Exit_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Exit_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_DeathCam_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_DeathCam_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Spectate_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Spectate_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Exit_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Exit_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EventRankAnimation(); // Function U.U.EventRankAnimation(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent_1(); // Function U.U.CustomEvent_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadTexture(struct Unknown Imge, struct Unknown Widget); // Function U.U.AsyncLoadTexture(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Report_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Report_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Report_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Report_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Close(); // Function U.U.Close(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowDeathCam(); // Function U.U.ShowDeathCam(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowGold(); // Function U.U.ShowGold(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function U.U.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelReplayTimelineEventMarker {

public:

	struct Unknown UberGraphFrame; // 0x290 (8)
	struct Unknown MarkerBorder; // 0x298 (8)

	void K2_SetKillEvent(char IsMyInfo); // Function U.U.K2_SetKillEvent(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown DropBoxPanel; // 0x250 (8)
	struct Unknown Image_1; // 0x258 (8)
	struct Unknown Image_2; // 0x260 (8)
	struct Unknown Image_3; // 0x268 (8)
	struct Unknown Image_4; // 0x270 (8)
	struct Unknown Image_5; // 0x278 (8)
	struct Unknown Image_9; // 0x280 (8)
	struct Unknown Image_10; // 0x288 (8)
	struct Unknown Image_11; // 0x290 (8)
	struct Unknown Image_12; // 0x298 (8)
	struct Unknown Image_13; // 0x2A0 (8)
	struct Unknown Image_14; // 0x2A8 (8)
	struct Unknown Image_15; // 0x2B0 (8)
	struct Unknown Image_16; // 0x2B8 (8)
	struct Unknown Image_17; // 0x2C0 (8)
	struct Unknown Image_18; // 0x2C8 (8)
	struct Unknown Image_19; // 0x2D0 (8)
	struct Unknown Image_20; // 0x2D8 (8)
	struct Unknown Image_21; // 0x2E0 (8)
	struct Unknown ScrollBox_2; // 0x2E8 (8)
	struct Unknown SizeBox_1; // 0x2F0 (8)
	struct Unknown W; // 0x2F8 (8)
	struct Unknown WrapBox_1; // 0x300 (8)

	char DropItem(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.DropItem(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	char OnDrop(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.OnDrop(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CloseHover(); // Function U.U.CloseHover(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnDragLeave(struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.OnDragLeave(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnDragEnter(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.OnDragEnter(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown Image_2; // 0x248 (8)
	struct Unknown InvalidationBox_1; // 0x250 (8)
	struct Unknown Switcher; // 0x258 (8)
	float OwnDirection; // 0x260 (4)

	void Initialize(float Direction); // Function U.U.Initialize(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Anim_KillMessage; // 0x250 (8)
	struct Unknown Anim_RemoveCoreInfo; // 0x258 (8)
	struct Unknown Anim_AddCoreInfo; // 0x260 (8)
	struct Unknown HB_Smartping; // 0x268 (8)
	struct Unknown Img_Back; // 0x270 (8)
	struct Unknown Img_Back_2; // 0x278 (8)
	struct Unknown Img_MarkerIcon; // 0x280 (8)
	struct Unknown IMG_PerkDeckIcon; // 0x288 (8)
	struct Unknown NewRichText; // 0x290 (8)
	struct Unknown T_Damage; // 0x298 (8)
	struct Unknown T_DamageCauser; // 0x2A0 (8)
	struct Unknown T_DamageResult; // 0x2A8 (8)
	struct Unknown T_HeadShot; // 0x2B0 (8)
	struct Unknown T_HitCount; // 0x2B8 (8)
	struct Unknown T_HitType; // 0x2C0 (8)
	struct Unknown T_Message; // 0x2C8 (8)
	struct Unknown T_PingType; // 0x2D0 (8)
	struct Unknown T_PlayerName; // 0x2D8 (8)
	struct Unknown T_TargetClass; // 0x2E0 (8)
	struct Unknown T_TargetLevel; // 0x2E8 (8)
	struct Unknown T_TargetName; // 0x2F0 (8)
	struct Unknown T_TargetWeapon; // 0x2F8 (8)
	struct Unknown T_WeaponLevel; // 0x300 (8)
	struct Unknown WidgetSwitcher_194; // 0x308 (8)
	struct Unknown WidgetSwitcher_Main; // 0x310 (8)
	struct Unknown ParentWidgetRef; // 0x318 (8)
	struct Unknown Timer_StartRemove; // 0x320 (8)
	struct Unknown DamageLogInfo; // 0x328 (2904)
	float LogTime; // 0xE80 (4)
	float LogStackValidTime; // 0xE84 (4)

	void DamageResultText(struct FText& Result); // Function U.U.DamageResultText(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DamageText(struct FText& Result); // Function U.U.DamageText(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void WeaponText(struct FText& Result); // Function U.U.WeaponText(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void TargetText(struct FText& Result); // Function U.U.TargetText(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StackDamageLog(struct Unknown& DamageLogInfo); // Function U.U.StackDamageLog(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckCanStackDamage(struct Unknown& DamageLogInfo, char& CanStack); // Function U.U.CheckCanStackDamage(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetHitDamageLogInfo(struct Unknown& DamageLogInfo); // Function U.U.SetHitDamageLogInfo(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCoreInfoKillMessage(struct FText Message); // Function U.U.SetCoreInfoKillMessage(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCoreInfoMessageType(struct FString Type); // Function U.U.SetCoreInfoMessageType(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetResuscitationPingInfo(); // Function U.U.SetResuscitationPingInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCoreInfoResuscitation(struct Unknown PlayerState); // Function U.U.SetCoreInfoResuscitation(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRequestMessageInfo(struct Unknown PlayerState, struct FText Message); // Function U.U.SetRequestMessageInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRequestMessage(struct Unknown Player, struct FText Message); // Function U.U.SetRequestMessage(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRoutePingInfo(); // Function U.U.SetRoutePingInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCoreInfoRoutePing(struct Unknown PlayerState); // Function U.U.SetCoreInfoRoutePing(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCoreInfoMessage(struct FText Message, struct FString Type); // Function U.U.SetCoreInfoMessage(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRemoveTimer(float RemainTime); // Function U.U.SetRemoveTimer(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPlayerInfo(struct Unknown PlayerState); // Function U.U.SetPlayerInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPingType(struct Unknown PingInfo); // Function U.U.SetPingType(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCoreInfoSmartping(struct Unknown PlayerState); // Function U.U.SetCoreInfoSmartping(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnAnimationFinished(struct Unknown Animation); // Function U.U.OnAnimationFinished(BlueprintCosmetic|Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayAddCoreInfoAnim(); // Function U.U.PlayAddCoreInfoAnim(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayKillMessageAnim(); // Function U.U.PlayKillMessageAnim(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartRemove(); // Function U.U.StartRemove(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelRoutePingWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Canvas; // 0x250 (8)
	struct FMulticastInlineDelegate OnMarkerClicked; // 0x258 (16)
	struct Unknown PlayerState; // 0x268 (8)
	struct TArray<Unknown> PointsArray; // 0x270 (16)
	struct Unknown StartPosition; // 0x280 (8)
	struct TArray<Unknown> PointWidgets; // 0x288 (16)
	struct TArray<Unknown> LineWidgets; // 0x298 (16)
	struct Unknown U; // 0x2A8 (8)
	char IsDrawing : 0; // 0x2B0 (1)
	struct Unknown GuideLineWidgetRef; // 0x2B8 (8)
	struct Unknown GuideLinePos; // 0x2C0 (8)
	char IsUpdate : 0; // 0x2C8 (1)

	void InitGuideLine(); // Function U.U.InitGuideLine(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetGuideLine(); // Function U.U.ResetGuideLine(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateGuideLine(); // Function U.U.UpdateGuideLine(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsValidGuideLine(char& Valid); // Function U.U.IsValidGuideLine(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetLineInfo(struct Unknown LineRef, struct Unknown CurrentPos, struct Unknown NextPos); // Function U.U.SetLineInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetAngleCurrentToNext(struct Unknown CurrentPos, struct Unknown NextPos, float& Angle); // Function U.U.GetAngleCurrentToNext(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRouteWidgets(); // Function U.U.SetRouteWidgets(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetTeamColor(); // Function U.U.SetTeamColor(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void MakeWidgets(); // Function U.U.MakeWidgets(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Initialize(struct Unknown PlayerState); // Function U.U.Initialize(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateRoutePing(struct Unknown MapCompWidget, struct TArray<Unknown>& Positions, char IsUpdate); // Function U.U.UpdateRoutePing(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMarkerClicked__DelegateSignature(struct Unknown Button, char mapObjectID); // Function U.U.OnMarkerClicked__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown TextBlock; // 0x250 (8)
	struct FText SetText; // 0x258 (24)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelScopeWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Image_1; // 0x250 (8)

	void SetScopeImageAngle(float NewAngle); // Function U.U.SetScopeImageAngle(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelMiniMapWidget {

public:

	struct Unknown UberGraphFrame; // 0x260 (8)
	struct Unknown PlayerIconOnDamagingAnimation; // 0x268 (8)
	struct Unknown ShirinkingAnimation; // 0x270 (8)
	struct Unknown AlertIcon; // 0x278 (8)
	struct Unknown B; // 0x280 (8)
	struct Unknown B; // 0x288 (8)
	struct Unknown CircleInfoGroup; // 0x290 (8)
	struct Unknown C; // 0x298 (8)
	struct Unknown CurrentProgressBar; // 0x2A0 (8)
	struct Unknown Image_174; // 0x2A8 (8)
	struct Unknown Image_766; // 0x2B0 (8)
	struct Unknown InvalidationBox_2; // 0x2B8 (8)
	struct Unknown LulledGroup; // 0x2C0 (8)
	struct Unknown PhaseText; // 0x2C8 (8)
	struct Unknown PlayerIconGroup; // 0x2D0 (8)
	struct Unknown S; // 0x2D8 (8)
	struct Unknown SB_CircleInfo; // 0x2E0 (8)
	struct Unknown ShrinkingGroup; // 0x2E8 (8)
	struct Unknown Switcher; // 0x2F0 (8)
	struct Unknown U; // 0x2F8 (8)
	struct Unknown U; // 0x300 (8)
	int32_t State; // 0x308 (4)
	struct Unknown MapSize_Default; // 0x30C (8)
	struct Unknown MapSize_Extend; // 0x314 (8)
	int32_t InitializeCount; // 0x31C (4)
	char bExtendMode : 0; // 0x320 (1)
	int32_t RecipeCount; // 0x324 (4)
	struct Unknown TargetCharacter; // 0x328 (8)

	void SetRecipeList(); // Function U.U.SetRecipeList(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	enum class Unknow Get(); // Function U.U.Get(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnBlueZoneStateChanged(enum class Unknow Pre, enum class Unknow Cur); // Function U.U.OnBlueZoneStateChanged(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnSurvivalCirclePhaseChanged(int32_t PrevPhase, int32_t CurrentPhase); // Function U.U.OnSurvivalCirclePhaseChanged(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetWidget(); // Function U.U.ResetWidget(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ToggleMapSize(struct Unknown WidgetSize); // Function U.U.ToggleMapSize(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown GetVectorCurrentTo(struct Unknown Position); // Function U.U.GetVectorCurrentTo(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	float CalcLengthOnWave(float Distance); // Function U.U.CalcLengthOnWave(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	float CalcDistanceRelatedToTarget(struct Unknown Vector, float Distance); // Function U.U.CalcDistanceRelatedToTarget(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown GetTargetTo(struct Unknown Position); // Function U.U.GetTargetTo(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown GetTargetToPlayer(); // Function U.U.GetTargetToPlayer(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateCircleInfoGroup(float DeltaSeconds); // Function U.U.UpdateCircleInfoGroup(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateOnShrinking(float DeltaSeconds); // Function U.U.UpdateOnShrinking(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateActiveIcon(); // Function U.U.UpdateActiveIcon(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateTimeToActivate(); // Function U.U.UpdateTimeToActivate(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdatePlayerIcon(float DeltaSeconds); // Function U.U.UpdatePlayerIcon(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnBattleRoyaleStateChanged(enum class Unknow Previous, enum class Unknow Current); // Function U.U.OnBattleRoyaleStateChanged(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AddAreaWidget(enum class Unknow WorldMapAreaWidgetType, struct Unknown& AreaWidgetInfo); // Function U.U.AddAreaWidget(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void NotifyNeedRefreshToMap(); // Function U.U.NotifyNeedRefreshToMap(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetToggleMinimap(char bToggle); // Function U.U.SetToggleMinimap(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnAttackedWidget(int32_t UniquePlayerId); // Function U.U.OnAttackedWidget(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnFireWidget(int32_t UniquePlayerId, struct Unknown Rotation, float Length); // Function U.U.OnFireWidget(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetMapPlayers(); // Function U.U.ResetMapPlayers(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ChangeRecipeList(); // Function U.U.ChangeRecipeList(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RemoveAreaWidget(enum class Unknow WorldMapAreaWidgetType, struct Unknown& AreaWidgetInfo); // Function U.U.RemoveAreaWidget(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (char IsShow); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelTeamInfoSlotWidget {

public:

	struct Unknown UberGraphFrame; // 0x308 (8)
	struct Unknown Anim_IconBouncing; // 0x310 (8)
	struct Unknown Progress_Stroke; // 0x318 (8)
	struct Unknown Shoot_ani; // 0x320 (8)
	struct Unknown CanvasPanel_Main; // 0x328 (8)
	struct Unknown death; // 0x330 (8)
	struct Unknown Image_126; // 0x338 (8)
	struct Unknown Image_168; // 0x340 (8)
	struct Unknown Image_280; // 0x348 (8)
	struct Unknown Image_623; // 0x350 (8)
	struct Unknown Image_624; // 0x358 (8)
	struct Unknown Image_1058; // 0x360 (8)
	struct Unknown Image_Firing; // 0x368 (8)
	struct Unknown Image_Heart; // 0x370 (8)
	struct Unknown Image_Outline; // 0x378 (8)
	struct Unknown Image_TeamInfoClassIcon; // 0x380 (8)
	struct Unknown Img_LogOut; // 0x388 (8)
	struct Unknown Img_Voice; // 0x390 (8)
	struct Unknown Img_VoiceMute; // 0x398 (8)
	struct Unknown InvalidationBox_1; // 0x3A0 (8)
	struct Unknown Overlay_447; // 0x3A8 (8)
	struct Unknown Overlay_Death; // 0x3B0 (8)
	struct Unknown Overlay_RemainGoldenTimeSelf; // 0x3B8 (8)
	struct Unknown Overlay_RequestResus; // 0x3C0 (8)
	struct Unknown ProgressBar_440; // 0x3C8 (8)
	struct Unknown ProgressBar_443; // 0x3D0 (8)
	struct Unknown SizeBox_132; // 0x3D8 (8)
	struct Unknown StateGoldenTime; // 0x3E0 (8)
	struct Unknown StateKnockdown; // 0x3E8 (8)
	struct Unknown T_ClassName; // 0x3F0 (8)
	struct Unknown T_ClassWeapon; // 0x3F8 (8)
	struct Unknown T_PlayerIndex; // 0x400 (8)
	struct Unknown T_PlayerName; // 0x408 (8)
	struct Unknown TeamColor; // 0x410 (8)
	struct Unknown TextBlock_4; // 0x418 (8)
	struct Unknown TextBlock_297; // 0x420 (8)
	struct Unknown TextBlock_590; // 0x428 (8)
	struct Unknown TextBlock_591; // 0x430 (8)
	struct Unknown TextBlock_1016; // 0x438 (8)
	struct Unknown TextBlock_RemainGoldenTimeSelf; // 0x440 (8)
	struct Unknown TextBlock_RequestResus; // 0x448 (8)
	struct Unknown TextBlock_Resuscitating; // 0x450 (8)
	struct Unknown U; // 0x458 (8)
	struct Unknown WidgetSwitcher_LogOut; // 0x460 (8)
	struct Unknown WidgetSwitcher_Resuscitate; // 0x468 (8)
	int32_t Index; // 0x470 (4)
	enum class Unknow Behavior; // 0x474 (1)
	float hp; // 0x478 (4)
	struct FText Name; // 0x480 (24)
	struct TArray<Unknown> ColorList; // 0x498 (16)
	char bPin : 0; // 0x4A8 (1)
	float PrevHP; // 0x4AC (4)
	char bReduceHP : 0; // 0x4B0 (1)
	struct Unknown TimerHandleReduceHP; // 0x4B8 (8)
	char bIncreaseHP : 0; // 0x4C0 (1)
	struct Unknown HealthChangeCurve; // 0x4C8 (8)
	struct Unknown HealthDangerCurve; // 0x4D0 (8)
	struct Unknown HealTimer; // 0x4D8 (8)
	struct Unknown FaintTimer; // 0x4E0 (8)
	float BaseHealth; // 0x4E8 (4)
	float TargetHealth; // 0x4EC (4)
	float HealthWeight; // 0x4F0 (4)
	float TargetFaint; // 0x4F4 (4)
	float BaseFaint; // 0x4F8 (4)
	float FaintWeight; // 0x4FC (4)
	float CurrentHPPercent; // 0x500 (4)
	float HealHPPercent; // 0x504 (4)
	float FaintPercent; // 0x508 (4)
	float CurrentAlpha; // 0x50C (4)
	float AlphaTimer; // 0x510 (4)
	struct Unknown AlphaCurve; // 0x518 (8)
	char KnockDown : 0; // 0x520 (1)
	float HeartBeat; // 0x524 (4)
	struct Unknown DisConnectSprite; // 0x528 (8)
	struct Unknown KnockDownSprite; // 0x530 (8)
	struct Unknown DeathSprite; // 0x538 (8)
	struct Unknown VehicleSprite; // 0x540 (8)
	struct Unknown HpTimer; // 0x548 (8)
	float EndTime; // 0x550 (4)
	float StartTime; // 0x554 (4)
	float TotalTime; // 0x558 (4)
	float ResultValue; // 0x55C (4)
	float AddTme; // 0x560 (4)
	float PreStart; // 0x564 (4)

	void OnLoaded_27D2D12149E3EA31998D6D88C1D08B2F(struct Unknown Loaded); // Function U.U.OnLoaded_27D2D12149E3EA31998D6D88C1D08B2F(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetNickName(struct FString NewNickName); // Function U.U.SetNickName(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetIndex(int32_t NewIndex); // Function U.U.SetIndex(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkLevel(int32_t NewPerkLevel); // Function U.U.SetPerkLevel(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkName(struct FName& NewPerkName); // Function U.U.SetPerkName(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetKillCount(int32_t NewKillCount); // Function U.U.SetKillCount(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetHp(int32_t NewCur, int32_t NewMax); // Function U.U.SetHp(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPing(struct Unknown& NewPingInfo); // Function U.U.SetPing(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetTalking(char NewTalking, char bIsMute); // Function U.U.SetTalking(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetFiring(char NewIsFiring); // Function U.U.SetFiring(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AnimationHP(float Start, float End, float Time); // Function U.U.AnimationHP(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Hp_Ani(); // Function U.U.Hp_Ani(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetGoldenTime(struct Unknown NewRemainTime, float NewPercent); // Function U.U.SetGoldenTime(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetExpertWeaponName(struct FText& NewWeaponName); // Function U.U.SetExpertWeaponName(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCharacterState(enum class Unknow NewState, char IsDisconnect); // Function U.U.SetCharacterState(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRequestResuscitation(char bNewFlag); // Function U.U.SetRequestResuscitation(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetResuscitating(char bNewFlag); // Function U.U.SetResuscitating(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateInvalidationbox(); // Function U.U.UpdateInvalidationbox(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Button_Request; // 0x250 (8)
	struct Unknown Image_955; // 0x258 (8)
	struct Unknown Image_1208; // 0x260 (8)
	struct Unknown SizeBox_77; // 0x268 (8)
	struct Unknown SizeBox_78; // 0x270 (8)
	struct Unknown Text_Price; // 0x278 (8)
	struct Unknown TextBlock_767; // 0x280 (8)
	struct Unknown WidgetSwitcher_Price; // 0x288 (8)
	struct Unknown PlayerControllerRef; // 0x290 (8)
	char bCanRequest : 0; // 0x298 (1)
	char bRequest : 0; // 0x299 (1)
	struct FText RequstingResuscitationText; // 0x2A0 (24)
	float RequestingSizeBoxWidth; // 0x2B8 (4)
	struct Unknown RequestTextColor; // 0x2C0 (40)
	struct Unknown RequestingTextColor; // 0x2E8 (40)
	float RequestingSizeBoxInitWidth; // 0x310 (4)
	struct FText RequstingResuscitationInitText; // 0x318 (24)
	struct Unknown InitButtonStyle; // 0x330 (632)
	struct Unknown RequestingButtonStyle; // 0x5A8 (632)
	struct Unknown CanRequestButtonStyle; // 0x820 (632)

	void Init(); // Function U.U.Init(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRequestState(char bOnRequest); // Function U.U.SetRequestState(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetPlayerController(struct Unknown& PC); // Function U.U.GetPlayerController(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	char Get_Button_Request_bIsEnabled_1(); // Function U.U.Get_Button_Request_bIsEnabled_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_307_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_307_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPrice(int32_t Price); // Function U.U.SetPrice(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelPlayerInfoWidget {

public:

	struct Unknown UberGraphFrame; // 0x2C0 (8)
	struct Unknown Lung_Red; // 0x2C8 (8)
	struct Unknown Weaving_Stand; // 0x2D0 (8)
	struct Unknown Weaving_Sit; // 0x2D8 (8)
	struct Unknown HorizontalBox_Backpack_Star; // 0x2E0 (8)
	struct Unknown HorizontalBox_Chest_Star; // 0x2E8 (8)
	struct Unknown HorizontalBox_Damage; // 0x2F0 (8)
	struct Unknown HorizontalBox_Helmet_Star; // 0x2F8 (8)
	struct Unknown HorizontalBox_Levels; // 0x300 (8)
	struct Unknown Image_BackPack_Star; // 0x308 (8)
	struct Unknown Image_C4; // 0x310 (8)
	struct Unknown Image_Chest_Star; // 0x318 (8)
	struct Unknown Image_DamageBg; // 0x320 (8)
	struct Unknown Image_FireMode; // 0x328 (8)
	struct Unknown Image_Helmet_Star; // 0x330 (8)
	struct Unknown Image_Time; // 0x338 (8)
	struct Unknown Image_Timer; // 0x340 (8)
	struct Unknown Image_Weapon; // 0x348 (8)
	struct Unknown Overlay_Tab; // 0x350 (8)
	struct Unknown ProgressBar_Backpack; // 0x358 (8)
	struct Unknown ProgressBar_Chest; // 0x360 (8)
	struct Unknown ProgressBar_Helmet; // 0x368 (8)
	struct Unknown SizeBox_Backpack; // 0x370 (8)
	struct Unknown SizeBox_Chest; // 0x378 (8)
	struct Unknown SizeBox_Helmet; // 0x380 (8)
	struct Unknown T_C4Time; // 0x388 (8)
	struct Unknown T_Damage; // 0x390 (8)
	struct Unknown T_PerkWeaponAmmo; // 0x398 (8)
	struct Unknown T_SlotIndex; // 0x3A0 (8)
	struct Unknown T_WeaponName; // 0x3A8 (8)
	struct Unknown TextBlock_bulletCount; // 0x3B0 (8)
	struct Unknown TextBlock_bulletMaxCount; // 0x3B8 (8)
	struct Unknown U; // 0x3C0 (8)
	struct Unknown U_2; // 0x3C8 (8)
	struct Unknown U_3; // 0x3D0 (8)
	struct Unknown U_4; // 0x3D8 (8)
	struct Unknown U_5; // 0x3E0 (8)
	struct Unknown U_6; // 0x3E8 (8)
	struct Unknown U; // 0x3F0 (8)
	struct Unknown U; // 0x3F8 (8)
	struct Unknown WidgetSwitcher_Bullet; // 0x400 (8)
	struct Unknown WidgetSwitcher_C4; // 0x408 (8)
	struct Unknown WidgetSwitcher_Stance; // 0x410 (8)
	struct Unknown Anim_LastHeadbanging; // 0x418 (8)
	struct Unknown Timer_UpdateInfos; // 0x420 (8)
	char bIsCoolTimeWeapon : 0; // 0x428 (1)
	struct Unknown CurrentWeapon; // 0x430 (8)
	struct Unknown TargetPawnRef; // 0x438 (8)
	struct Unknown CoolTimeMaterial; // 0x440 (8)
	struct Unknown WeaponInfo; // 0x448 (168)
	int32_t SlotIndex; // 0x4F0 (4)

	void IsNoDamageWeapon(char& Weapon); // Function U.U.IsNoDamageWeapon(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetFistMode(); // Function U.U.SetFistMode(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsMeleeWeapon(char& bTrue); // Function U.U.IsMeleeWeapon(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnAddBuffs(struct Unknown& AddBuffs); // Function U.U.OnAddBuffs(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HiddenAllBuffs(); // Function U.U.HiddenAllBuffs(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetStar(int32_t Level, struct Unknown Tint, struct Unknown Image); // Function U.U.SetStar(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetArmorInfo(char HasHelmet, float HelmetGauge, char HasChest, float ChestGauge, char HasBackpack, float BackpackGauge, int32_t HelmetLevel, int32_t ArmorLevel, int32_t BagLevel); // Function U.U.SetArmorInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsPerkWeapon(char& Weapon); // Function U.U.IsPerkWeapon(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ChangePawn(); // Function U.U.ChangePawn(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetBulletCount(struct FString BulletCount, struct FString BulletMaxCount); // Function U.U.SetBulletCount(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetWeaponFireMode(enum class Unknow FireMode); // Function U.U.SetWeaponFireMode(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateDamage(); // Function U.U.UpdateDamage(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateTimer(); // Function U.U.UpdateTimer(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateInfos(); // Function U.U.UpdateInfos(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetUpdateTimer(); // Function U.U.SetUpdateTimer(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetLungRed(char Flag); // Function U.U.SetLungRed(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnSetStance(char IsFirstPerson, int32_t Stance, char IsHeadbanging); // Function U.U.OnSetStance(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetWeaponInfo(); // Function U.U.ResetWeaponInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetWeaponInfo(struct Unknown& WeaponInfo); // Function U.U.SetWeaponInfo(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Init(); // Function U.U.Init(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_97B8B47B466730860C4DE6A59E985E90(struct Unknown Loaded); // Function U.U.OnLoaded_97B8B47B466730860C4DE6A59E985E90(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AddBuff(struct Unknown AddBuffs); // Function U.U.AddBuff(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StopLastHeadbangingAnim(); // Function U.U.StopLastHeadbangingAnim(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetStance(char bIsFirstPerson, int32_t Stance, char bIsHeadbanging); // Function U.U.SetStance(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetBackpackPercent(float Percent); // Function U.U.SetBackpackPercent(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Set(struct Unknown IconTexture, struct Unknown TargetImage); // Function U.U.Set(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRedLungAnim(char bIsRed); // Function U.U.SetRedLungAnim(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetCurrentWeaponInfo(int32_t SlotIndex); // Function U.U.ResetCurrentWeaponInfo(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCurrentWeaponInfo(struct Unknown SetWeaponInfo); // Function U.U.SetCurrentWeaponInfo(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetFireMode(enum class Unknow SetFireMode); // Function U.U.SetFireMode(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetWeaponBulletCount(int32_t CurrentAmmo, int32_t TotalAmmo); // Function U.U.SetWeaponBulletCount(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelKillInfoSlotWidget {

public:

	struct Unknown UberGraphFrame; // 0x258 (8)
	struct Unknown Anim_Hide; // 0x260 (8)
	struct Unknown Anim_Down; // 0x268 (8)
	struct Unknown CanvasPanel_Main; // 0x270 (8)
	struct Unknown Img_Back; // 0x278 (8)
	struct Unknown Img_BroadType; // 0x280 (8)
	struct Unknown Img_DamegeType; // 0x288 (8)
	struct Unknown Img_Weapon; // 0x290 (8)
	struct Unknown ScaleBox_Weapon; // 0x298 (8)
	struct Unknown SizeBox_BroadType; // 0x2A0 (8)
	struct Unknown SizeBox_DamageType; // 0x2A8 (8)
	struct Unknown SizeBox_HeadShot; // 0x2B0 (8)
	struct Unknown T_Context; // 0x2B8 (8)
	struct Unknown U; // 0x2C0 (8)
	struct Unknown U; // 0x2C8 (8)
	struct FMulticastInlineDelegate OnTimeOut; // 0x2D0 (16)
	struct TMap<Unknown, Unknown> BroadcastDamageType; // 0x2E0 (80)
	struct Unknown MyTeamColor; // 0x330 (40)
	struct Unknown MyTeamKnockOutColor; // 0x358 (40)
	struct Unknown EnermyTeamColor; // 0x380 (40)
	struct Unknown EnermyTeamKnockOutColor; // 0x3A8 (40)
	struct Unknown DefaultColor; // 0x3D0 (40)
	struct Unknown DefaultKnockColor; // 0x3F8 (40)
	struct Unknown ResuscatedColor; // 0x420 (40)
	struct Unknown ParentWidgetRef; // 0x448 (8)
	struct Unknown Timer_StartHideAnim; // 0x450 (8)
	struct Unknown CurrentInfoColor; // 0x458 (40)

	void ResetInfos(); // Function U.U.ResetInfos(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetBroadcastTypeIcon(enum class Unknow MessageType); // Function U.U.SetBroadcastTypeIcon(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetTeamType(struct Unknown PlayerState, enum class Unknow& TeamType); // Function U.U.GetTeamType(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetInfoColor(struct Unknown Killer, struct Unknown Died, enum class Unknow MessageType, struct Unknown& OutTeamColor); // Function U.U.GetInfoColor(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetBGColor(enum class Unknow MessageType); // Function U.U.SetBGColor(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayDownAnim(); // Function U.U.PlayDownAnim(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartHideAnim(); // Function U.U.StartHideAnim(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartShow(); // Function U.U.StartShow(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_E905D98740C8E2F4A90B4C89D663ACAA(struct Unknown Loaded); // Function U.U.OnLoaded_E905D98740C8E2F4A90B4C89D663ACAA(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_342F68DF4CB26590AC0C9EA8C343CCF1(struct Unknown Loaded); // Function U.U.OnLoaded_342F68DF4CB26590AC0C9EA8C343CCF1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetKillMessageInfo(struct Unknown& Info); // Function U.U.SetKillMessageInfo(HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnTimeOut__DelegateSignature(int32_t ArrayIndex, struct Unknown Slot); // Function U.U.OnTimeOut__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelKillInfoSlotWidget {

public:

	struct Unknown UberGraphFrame; // 0x258 (8)
	struct Unknown Anim_Hide; // 0x260 (8)
	struct Unknown Anim_Down; // 0x268 (8)
	struct Unknown HorizontalBox_Killer; // 0x270 (8)
	struct Unknown ScaleBox_KillerIcon; // 0x278 (8)
	struct Unknown T_ClassIcon; // 0x280 (8)
	struct Unknown T_Level; // 0x288 (8)
	struct Unknown T_LV; // 0x290 (8)
	struct Unknown T_Name; // 0x298 (8)
	struct FMulticastInlineDelegate OnTimeOut; // 0x2A0 (16)
	struct Unknown LocalPlayerState; // 0x2B0 (8)

	void OnLoaded_9DF86FA64782B378E42DBB813545BD34(struct Unknown Loaded); // Function U.U.OnLoaded_9DF86FA64782B378E42DBB813545BD34(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPlayerInfo(struct Unknown PlayerState, struct Unknown InfoColor); // Function U.U.SetPlayerInfo(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnTimeOut__DelegateSignature(int32_t ArrayIndex, struct Unknown Slot); // Function U.U.OnTimeOut__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelGameBuffSlot {

public:

	struct Unknown UberGraphFrame; // 0x2F8 (8)
	struct Unknown Anim_Boost_Off; // 0x300 (8)
	struct Unknown Anim_Boost_On; // 0x308 (8)
	struct Unknown CanvasPanel_BoostInfo; // 0x310 (8)
	struct Unknown Image_Active; // 0x318 (8)
	struct Unknown IMG_CoolTime; // 0x320 (8)
	struct Unknown T_CoolTime; // 0x328 (8)
	struct Unknown MI_CoolTimeDynamicInstance; // 0x330 (8)
	struct Unknown MI_BuffActive; // 0x338 (8)
	float BoostOffAnimTime; // 0x340 (4)
	char IsActive : 0; // 0x344 (1)
	struct Unknown BoostBuffInfo; // 0x348 (392)

	void SetIsActive(char bActive); // Function U.U.SetIsActive(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void InitBuffInfo(); // Function U.U.InitBuffInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateCoolTime(float Timer, float MaxTime); // Function U.U.UpdateCoolTime(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_541BBAAD4C8A218716460DAC5837CB3E(struct Unknown Loaded); // Function U.U.OnLoaded_541BBAAD4C8A218716460DAC5837CB3E(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_UpdateBuff(float Timer, float MaxTime); // Function U.U.K2_UpdateBuff(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_OnNewBuff(); // Function U.U.K2_OnNewBuff(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnAnimationFinished(struct Unknown Animation); // Function U.U.OnAnimationFinished(BlueprintCosmetic|Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_OnRenewBuff(); // Function U.U.K2_OnRenewBuff(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayAnimBoostOn(); // Function U.U.PlayAnimBoostOn(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncloadImage(struct Unknown Image); // Function U.U.AsyncloadImage(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelGameBuffSlot {

public:

	struct Unknown Image_1294; // 0x2F8 (8)
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelFallingWidget {

public:

	struct Unknown UberGraphFrame; // 0x270 (8)
	struct Unknown Parachute_Loop; // 0x278 (8)
	struct Unknown Parachute_Open; // 0x280 (8)
	struct Unknown Canvas; // 0x288 (8)
	struct Unknown HorizontalBox_Ground; // 0x290 (8)
	struct Unknown HorizontalBox_Parachute; // 0x298 (8)
	struct Unknown HorizontalBox_Sea; // 0x2A0 (8)
	struct Unknown Image_797; // 0x2A8 (8)
	struct Unknown Image_798; // 0x2B0 (8)
	struct Unknown Overlay_Speed; // 0x2B8 (8)
	struct Unknown Parachute; // 0x2C0 (8)
	struct Unknown Player; // 0x2C8 (8)
	struct Unknown PlayerGroup; // 0x2D0 (8)
	struct Unknown SeaHeight; // 0x2D8 (8)
	struct Unknown Speed; // 0x2E0 (8)
	struct Unknown TerrainHeight; // 0x2E8 (8)
	char IsParachute : 0; // 0x2F0 (1)

	void SetParachuteInfo(struct Unknown SetParachuteInfo); // Function U.U.SetParachuteInfo(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown Image_47; // 0x248 (8)

	void UpdateCursorVisibility(); // Function U.U.UpdateCursorVisibility(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Image_ClassIcon; // 0x250 (8)
	struct Unknown TextBlock_ClassName; // 0x258 (8)
	struct Unknown TextBlock_Count; // 0x260 (8)

	void SetClassCount(int32_t Count); // Function U.U.SetClassCount(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetClassInfo(struct Unknown& PerkDeckData); // Function U.U.SetClassInfo(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_5B4CA9324370B6EF1C483DB3B88E6511(struct Unknown Loaded); // Function U.U.OnLoaded_5B4CA9324370B6EF1C483DB3B88E6511(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadingClassIcon(struct Unknown Texture); // Function U.U.AsyncLoadingClassIcon(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Disappear; // 0x250 (8)
	struct Unknown Finish; // 0x258 (8)
	struct Unknown Spin; // 0x260 (8)
	struct Unknown Idle; // 0x268 (8)
	struct Unknown Image_180; // 0x270 (8)
	struct Unknown ItemImage_bg; // 0x278 (8)
	struct Unknown ItemImage_Dummy1; // 0x280 (8)
	struct Unknown ItemImage_Main; // 0x288 (8)
	struct Unknown TextBlock_1; // 0x290 (8)
	struct Unknown TextBlock_3; // 0x298 (8)
	struct Unknown TextMountablewea; // 0x2A0 (8)
	struct Unknown TextMountableweaLV1; // 0x2A8 (8)
	struct Unknown PerkInfo; // 0x2B0 (40)
	struct Unknown PerkData; // 0x2D8 (224)
	char bLevelUp : 0; // 0x3B8 (1)
	char bFinishing : 0; // 0x3B9 (1)
	float FinishTime; // 0x3BC (4)
	enum class Unknow PerkSlot; // 0x3C0 (1)

	struct FText Get_TextBlock_1_Text_1(); // Function U.U.Get_TextBlock_1_Text_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown Get_ItemImage_bg_Brush_1(); // Function U.U.Get_ItemImage_bg_Brush_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown Get_ItemImage_Main_Brush_1(); // Function U.U.Get_ItemImage_Main_Brush_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct FText Get_TextMountablewea_Text_1(); // Function U.U.Get_TextMountablewea_Text_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	enum class Unknow Get_TextBlock_2_Visibility_1(); // Function U.U.Get_TextBlock_2_Visibility_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	enum class Unknow Get_TextBlock_0_Visibility_1(); // Function U.U.Get_TextBlock_0_Visibility_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartFinish(); // Function U.U.StartFinish(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartSpin(); // Function U.U.StartSpin(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EndFinish(); // Function U.U.EndFinish(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkInfo(struct Unknown PerkInfo); // Function U.U.SetPerkInfo(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RemoveSelf(); // Function U.U.RemoveSelf(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Character_BG_Motion; // 0x250 (8)
	struct Unknown Image_130; // 0x258 (8)
	struct Unknown Image_308; // 0x260 (8)
	struct Unknown ScrollBox_KeepedList; // 0x268 (8)
	struct Unknown U; // 0x270 (8)
	struct Unknown U_74; // 0x278 (8)
	struct Unknown PlayerController; // 0x280 (8)

	void DisableCarriedListHover(); // Function U.U.DisableCarriedListHover(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	char DropItem(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.DropItem(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetInventoryComponent(char& Result, struct Unknown& InventoryComponentRef); // Function U.U.GetInventoryComponent(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Reset(); // Function U.U.Reset(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverEquipSlotList(enum class Unknow WearableItemType); // Function U.U.HoverEquipSlotList(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverResetEquipSlotList(); // Function U.U.HoverResetEquipSlotList(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	char OnDrop(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.OnDrop(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnDragLeave(struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.OnDragLeave(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnDragEnter(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.OnDragEnter(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Button_Focus; // 0x250 (8)
	struct Unknown HorizontalBox_1; // 0x258 (8)
	struct Unknown Image_223; // 0x260 (8)
	struct Unknown Img_Movie; // 0x268 (8)
	struct Unknown MediaPlayer; // 0x270 (8)
	char bPopup : 0; // 0x278 (1)
	struct Unknown Media; // 0x280 (8)
	struct Unknown MediaSoundComp; // 0x288 (8)
	struct Unknown Game; // 0x290 (8)
	float GammaIntensity; // 0x298 (4)
	struct Unknown SkipNoticeTimer; // 0x2A0 (8)
	struct Unknown MediaTexture; // 0x2A8 (8)
	struct FName OpeningFileName; // 0x2B0 (8)
	char End : 0; // 0x2B8 (1)
	char NextScene : 0; // 0x2B9 (1)

	void MoveNextScene(); // Function U.U.MoveNextScene(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnKeyDown(struct Unknown MyGeometry, struct Unknown InKeyEvent); // Function U.U.OnKeyDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent_1(); // Function U.U.CustomEvent_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent_2(); // Function U.U.CustomEvent_2(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Focus_K2Node_Com(); // Function U.U.BndEvt__Button_Focus_K2Node_Com(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelReplayPlayerListItem {

public:

	struct Unknown UberGraphFrame; // 0x270 (8)
	struct Unknown BT_PlayerName; // 0x278 (8)
	struct Unknown PB_HP; // 0x280 (8)
	struct Unknown T_PlayerName; // 0x288 (8)
	struct Unknown T_PlayerNameHighlight; // 0x290 (8)
	struct Unknown T_SortInfo; // 0x298 (8)
	char bIsTargetPawn : 0; // 0x2A0 (1)
	char bIsAlive : 0; // 0x2A1 (1)

	void UpdateHighlightNameColor(); // Function U.U.UpdateHighlightNameColor(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateSortInfo(enum class Unknow PlayerListSortType); // Function U.U.UpdateSortInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckAlive(enum class Unknow PlayerListSortType); // Function U.U.CheckAlive(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateButton(); // Function U.U.UpdateButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateHP(); // Function U.U.UpdateHP(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateDisable(); // Function U.U.UpdateDisable(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateInfos(); // Function U.U.UpdateInfos(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Init(struct Unknown PlayerState); // Function U.U.Init(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT_PlayerName_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__BT_PlayerName_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdatePlayerInfo(enum class Unknow PlayerListSortType); // Function U.U.UpdatePlayerInfo(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UU {

public:

	struct Unknown UberGraphFrame; // 0x1360 (8)
	struct Unknown Complete_ani; // 0x1368 (8)
	struct Unknown Serching_ani; // 0x1370 (8)
	struct Unknown Button; // 0x1378 (8)
	struct Unknown IconBox; // 0x1380 (8)
	struct Unknown Image; // 0x1388 (8)
	struct Unknown Image_2; // 0x1390 (8)
	struct Unknown Image_3; // 0x1398 (8)
	struct Unknown Image_4; // 0x13A0 (8)
	struct Unknown Image_5; // 0x13A8 (8)
	struct Unknown Image_6; // 0x13B0 (8)
	struct Unknown Image_7; // 0x13B8 (8)
	struct Unknown Image_8; // 0x13C0 (8)
	struct Unknown Image_9; // 0x13C8 (8)
	struct Unknown Image_10; // 0x13D0 (8)
	struct Unknown Image_149; // 0x13D8 (8)
	struct Unknown Image_170; // 0x13E0 (8)
	struct Unknown Image_253; // 0x13E8 (8)
	struct Unknown Image_305; // 0x13F0 (8)
	struct Unknown Image_Full; // 0x13F8 (8)
	struct Unknown IMG_ItemIcon; // 0x1400 (8)
	struct Unknown MaterialIcon; // 0x1408 (8)
	struct Unknown MouseHover_2; // 0x1410 (8)
	struct Unknown MouseHover_; // 0x1418 (8)
	struct Unknown MousePress_2; // 0x1420 (8)
	struct Unknown MousePress_; // 0x1428 (8)
	struct Unknown Searching_; // 0x1430 (8)
	struct Unknown Stroke; // 0x1438 (8)
	struct Unknown Stroke_2; // 0x1440 (8)
	struct Unknown Stroke_3; // 0x1448 (8)
	struct Unknown Stroke_4; // 0x1450 (8)
	struct Unknown PreHoveredWidget; // 0x1458 (8)
	enum class Unknow PreDragType; // 0x1460 (1)
	char Selected : 0; // 0x1461 (1)
	int32_t NeedCount; // 0x1464 (4)
	struct FName ItemKey; // 0x1468 (8)
	struct Unknown SelectItem; // 0x1470 (16)
	char BindSelectSearch : 0; // 0x1480 (1)
	char EnableSearch : 0; // 0x1481 (1)

	enum class Unknow Get_Image_Full_Visibility_1(); // Function U.U.Get_Image_Full_Visibility_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void MouseEnterImpl(); // Function U.U.MouseEnterImpl(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetMaterialInfo(struct FName ItemKey, int32_t Count, struct FName TopKey); // Function U.U.SetMaterialInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSign(); // Function U.U.BndEvt__Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSign(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSign(); // Function U.U.BndEvt__Button_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSign(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function U.U.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (struct Unknown MaterialItemKey, char IsSelect); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Set(char Select); // Function U.U.Set(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function U.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (char EnableMaterialSearch); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UU {

public:

	struct Unknown UberGraphFrame; // 0x2A0 (8)
	struct Unknown EventInform; // 0x2A8 (8)
	struct Unknown VisualBorder; // 0x2B0 (8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_SetKillEvent(char IsMyInfo); // Function U.U.K2_SetKillEvent(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UU {

public:

	struct Unknown UberGraphFrame; // 0x2A0 (8)
	struct Unknown VisualBorder; // 0x2A8 (8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown CurrentAccel; // 0x250 (12)
	struct Unknown TargetAccel; // 0x25C (12)
	struct Unknown CurrentCameraActor; // 0x268 (8)
	struct Unknown OldCameraLocation; // 0x270 (12)
	struct Unknown CurrentCameraLocation; // 0x27C (12)
	struct Unknown OriginCameraLocation; // 0x288 (12)
	struct Unknown TargetCameraLocation; // 0x294 (12)
	struct Unknown DataAsset; // 0x2A0 (8)
	char ResetOriginTransform : 0; // 0x2A8 (1)
	float BeginFocusDist; // 0x2AC (4)
	float EndFocusDist; // 0x2B0 (4)
	float CurrentFocusDist; // 0x2B4 (4)

	void UpdateMouseWheel(float Delta); // Function U.U.UpdateMouseWheel(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateMouseY(float Delta); // Function U.U.UpdateMouseY(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateMouseX(float Delta); // Function U.U.UpdateMouseX(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateCharacter(float DeltaTime); // Function U.U.UpdateCharacter(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateCamera(float DeltaTime); // Function U.U.UpdateCamera(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PercentDist(float CurDist, float& Percent); // Function U.U.PercentDist(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void MouseWheel(float Delta); // Function U.U.MouseWheel(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Reset(char ForceSnap); // Function U.U.Reset(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCameraActor(struct Unknown CurrentCamera, struct Unknown TargetCamera, float BeginFocusDist, float EndFocusDist); // Function U.U.SetCameraActor(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetLobbyWidget(struct Unknown& Widget); // Function U.U.GetLobbyWidget(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Hide(); // Function U.U.Hide(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Show(); // Function U.U.Show(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UU {

public:

	struct Unknown UberGraphFrame; // 0x2A0 (8)
	struct Unknown VisualBorder; // 0x2A8 (8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelReportUserProgramWidget {

public:

	struct Unknown UberGraphFrame; // 0x278 (8)
	struct Unknown btn_Cancel; // 0x280 (8)
	struct Unknown btn_report; // 0x288 (8)
	struct Unknown Button_2; // 0x290 (8)
	struct Unknown Button_3; // 0x298 (8)
	struct Unknown Button_4; // 0x2A0 (8)
	struct Unknown Button_5; // 0x2A8 (8)
	struct Unknown CheckBox_2; // 0x2B0 (8)
	struct Unknown CheckBox_3; // 0x2B8 (8)
	struct Unknown CheckBox_4; // 0x2C0 (8)
	struct Unknown CheckBox_5; // 0x2C8 (8)
	struct Unknown combobox_button_overlay; // 0x2D0 (8)
	struct Unknown combobox_string; // 0x2D8 (8)
	struct Unknown Image; // 0x2E0 (8)
	struct Unknown Image_2; // 0x2E8 (8)
	struct Unknown Image_545; // 0x2F0 (8)
	struct Unknown NormalArrow; // 0x2F8 (8)
	struct Unknown OpeningArrow; // 0x300 (8)
	struct Unknown popup; // 0x308 (8)
	struct Unknown txt_description; // 0x310 (8)
	struct Unknown txt_nickname; // 0x318 (8)
	struct Unknown uw; // 0x320 (8)
	struct FText DescriptionText; // 0x328 (24)
	struct TArray<Unknown> ReportIndexText; // 0x340 (16)
	struct FText DefaultComboString; // 0x350 (24)
	int32_t CurrentSelectIndex; // 0x368 (4)
	char CheckCloseComboArrow : 0; // 0x36C (1)

	void CheckSelectProgramIndex(); // Function U.U.CheckSelectProgramIndex(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetOpeningArrow(char InOpening); // Function U.U.SetOpeningArrow(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetDefaultComboString(); // Function U.U.SetDefaultComboString(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Set(); // Function U.U.Set(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetDescriptionText(); // Function U.U.SetDescriptionText(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetNativeValues(); // Function U.U.SetNativeValues(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PreConstruct(char IsDesignTime); // Function U.U.PreConstruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__combobox_string_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature(struct FString SelectedItem, char SelectionType); // Function U.U.BndEvt__combobox_string_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__combobox_string_K2Node_ComponentBoundEvent_1_OnOpeningEvent__DelegateSignature(); // Function U.U.BndEvt__combobox_string_K2Node_ComponentBoundEvent_1_OnOpeningEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_1_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_1_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_2_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_2_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_3_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_3_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_4_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_4_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnReportConfirm(); // Function U.U.OnReportConfirm(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelReportUserConfirmWidget {

public:

	struct Unknown UberGraphFrame; // 0x258 (8)
	struct Unknown btn_Cancel; // 0x260 (8)
	struct Unknown btn_confirm; // 0x268 (8)
	struct Unknown popup; // 0x270 (8)
	struct Unknown txt_description; // 0x278 (8)
	struct Unknown uw; // 0x280 (8)

	void PreConstruct(char IsDesignTime); // Function U.U.PreConstruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnReportSended(enum class Unknow InWidgetType); // Function U.U.OnReportSended(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Ani_Gold; // 0x250 (8)
	struct Unknown 1; // 0x258 (8)
	struct Unknown 10; // 0x260 (8)
	struct Unknown 100; // 0x268 (8)
	struct Unknown 1000; // 0x270 (8)
	struct Unknown BonusBG; // 0x278 (8)
	struct Unknown BrightSpot_01; // 0x280 (8)
	struct Unknown BrightSpot_02; // 0x288 (8)
	struct Unknown BrightSpot_03; // 0x290 (8)
	struct Unknown BrightSpot_04; // 0x298 (8)
	struct Unknown BrightSpot_05; // 0x2A0 (8)
	struct Unknown Empty; // 0x2A8 (8)
	struct Unknown Glow_01; // 0x2B0 (8)
	struct Unknown Gold; // 0x2B8 (8)
	struct Unknown Image_7; // 0x2C0 (8)
	struct Unknown Image_11; // 0x2C8 (8)
	struct Unknown Image_14; // 0x2D0 (8)
	struct Unknown Image_15; // 0x2D8 (8)
	struct Unknown Image_16; // 0x2E0 (8)
	struct Unknown Image_17; // 0x2E8 (8)
	struct Unknown Image_18; // 0x2F0 (8)
	struct Unknown Image_20; // 0x2F8 (8)
	struct Unknown Image_21; // 0x300 (8)
	struct Unknown Image_22; // 0x308 (8)
	struct Unknown Image_23; // 0x310 (8)
	struct Unknown Image_335; // 0x318 (8)
	struct Unknown Image_1473; // 0x320 (8)
	struct Unknown Light; // 0x328 (8)
	struct Unknown Light_01; // 0x330 (8)
	struct Unknown Light_02; // 0x338 (8)
	struct Unknown Light_03; // 0x340 (8)
	struct Unknown Light_04; // 0x348 (8)
	struct Unknown Light_05; // 0x350 (8)
	struct Unknown Light_06; // 0x358 (8)
	struct Unknown PickUpGold; // 0x360 (8)
	struct Unknown RIng_Glow_01; // 0x368 (8)
	struct Unknown TextBlock_4; // 0x370 (8)
	struct Unknown TextLight_2; // 0x378 (8)
	struct Unknown TextLight_3; // 0x380 (8)
	int32_t Save; // 0x388 (4)
	char NewVar_1 : 0; // 0x38C (1)
	char IsStopSound : 0; // 0x38D (1)
	float LoopSountStartTime; // 0x390 (4)
	struct Unknown LoopSound; // 0x394 (4)
	float LoopSountEndTime; // 0x398 (4)
	float 1StartTime; // 0x39C (4)
	float 10StartTime; // 0x3A0 (4)
	float 100StartTime; // 0x3A4 (4)
	float 1000StartTime; // 0x3A8 (4)
	float FinStartTime; // 0x3AC (4)

	void Divide(int32_t Value1, int32_t& RetS1, int32_t& RetS2); // Function U.U.Divide(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StopSound(); // Function U.U.StopSound(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent(); // Function U.U.CustomEvent(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent_2(); // Function U.U.CustomEvent_2(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent_3(); // Function U.U.CustomEvent_3(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent_4(); // Function U.U.CustomEvent_4(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetGold(int32_t AddGold, int32_t GetGold); // Function U.U.SetGold(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent_5(); // Function U.U.CustomEvent_5(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelReportUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x278 (8)
	struct Unknown btn_Cancel; // 0x280 (8)
	struct Unknown btn_report; // 0x288 (8)
	struct Unknown combobox_button_overlay; // 0x290 (8)
	struct Unknown combobox_string; // 0x298 (8)
	struct Unknown Image; // 0x2A0 (8)
	struct Unknown Image_2; // 0x2A8 (8)
	struct Unknown Image_545; // 0x2B0 (8)
	struct Unknown NormalArrow; // 0x2B8 (8)
	struct Unknown OpeningArrow; // 0x2C0 (8)
	struct Unknown popup; // 0x2C8 (8)
	struct Unknown txt_description; // 0x2D0 (8)
	struct Unknown txt_nickname; // 0x2D8 (8)
	struct Unknown uw; // 0x2E0 (8)
	struct FText DescriptionText; // 0x2E8 (24)
	struct TArray<Unknown> ReportIndexText; // 0x300 (16)
	struct FText DefaultComboString; // 0x310 (24)
	int32_t CurrentSelectIndex; // 0x328 (4)
	int32_t SelectIndexFromProgram; // 0x32C (4)
	char CheckCloseComboArrow : 0; // 0x330 (1)

	void SetOpeningArrow(char InOpening); // Function U.U.SetOpeningArrow(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetReportComboStringFromProgram(int32_t InSelectIndex); // Function U.U.SetReportComboStringFromProgram(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetReportComboString(); // Function U.U.SetReportComboString(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetDefaultComboString(); // Function U.U.SetDefaultComboString(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetReportIndexText(); // Function U.U.SetReportIndexText(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetDescriptionText(); // Function U.U.SetDescriptionText(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetNativeValues(); // Function U.U.SetNativeValues(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PreConstruct(char IsDesignTime); // Function U.U.PreConstruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__combobox_string_K2Node_ComponentBoundEvent_0_OnOpeningEvent__DelegateSignature(); // Function U.U.BndEvt__combobox_string_K2Node_ComponentBoundEvent_0_OnOpeningEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__combobox_string_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature(struct FString SelectedItem, char SelectionType); // Function U.U.BndEvt__combobox_string_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnReportConfirm(); // Function U.U.OnReportConfirm(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Anim_Bouns; // 0x250 (8)
	struct Unknown 1; // 0x258 (8)
	struct Unknown 10; // 0x260 (8)
	struct Unknown 100; // 0x268 (8)
	struct Unknown 1000; // 0x270 (8)
	struct Unknown Empty; // 0x278 (8)
	struct Unknown Image_7; // 0x280 (8)
	struct Unknown Image_11; // 0x288 (8)
	struct Unknown Image_14; // 0x290 (8)
	struct Unknown Image_15; // 0x298 (8)
	struct Unknown Image_16; // 0x2A0 (8)
	struct Unknown Image_17; // 0x2A8 (8)
	struct Unknown Image_18; // 0x2B0 (8)
	struct Unknown Image_20; // 0x2B8 (8)
	struct Unknown Image_21; // 0x2C0 (8)
	struct Unknown Image_22; // 0x2C8 (8)
	struct Unknown Image_23; // 0x2D0 (8)
	struct Unknown Image_1473; // 0x2D8 (8)
	struct Unknown TextBlock_4; // 0x2E0 (8)
	struct Unknown TextLight_3; // 0x2E8 (8)
	int32_t Save; // 0x2F0 (4)
	struct Unknown LoopSound; // 0x2F4 (4)
	char IsStopSound : 0; // 0x2F8 (1)

	void Divide(int32_t Value, int32_t& RetS1, int32_t& RetS2); // Function U.U.Divide(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetGold(int32_t RandomGold); // Function U.U.SetGold(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StopSound(); // Function U.U.StopSound(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown HorizontalBox; // 0x250 (8)
	struct Unknown HorizontalBox_2; // 0x258 (8)
	struct Unknown Image; // 0x260 (8)
	struct Unknown Image_2; // 0x268 (8)
	struct Unknown Image_3; // 0x270 (8)
	struct Unknown Image_4; // 0x278 (8)
	struct Unknown Image_5; // 0x280 (8)
	struct Unknown Image_6; // 0x288 (8)
	struct Unknown Image_7; // 0x290 (8)
	struct Unknown Image_8; // 0x298 (8)
	struct Unknown Image_9; // 0x2A0 (8)
	struct Unknown Image_10; // 0x2A8 (8)
	struct Unknown Image_11; // 0x2B0 (8)
	struct Unknown Image_12; // 0x2B8 (8)
	struct Unknown Image_13; // 0x2C0 (8)
	struct Unknown Image_14; // 0x2C8 (8)
	struct Unknown Image_15; // 0x2D0 (8)
	struct Unknown Image_72; // 0x2D8 (8)
	struct Unknown Image_164; // 0x2E0 (8)
	struct Unknown Image_352; // 0x2E8 (8)
	struct Unknown Image_659; // 0x2F0 (8)
	struct Unknown Overlay_4; // 0x2F8 (8)
	struct Unknown SizeBox; // 0x300 (8)
	struct Unknown SizeBox_54; // 0x308 (8)
	struct Unknown T_WeaponType; // 0x310 (8)
	struct Unknown TextBlock_176; // 0x318 (8)
	struct Unknown TextBlock_258; // 0x320 (8)
	struct Unknown TextBlock_331; // 0x328 (8)
	struct Unknown WidgetSwitcher_1; // 0x330 (8)
	struct Unknown ItemInfo; // 0x338 (8)
	struct Unknown ItemDetailInfo; // 0x340 (1168)
	struct FText LocalText; // 0x7D0 (24)
	char bIsSmallIcon : 0; // 0x7E8 (1)

	void IsMaterialData(struct FName ItemKey, char& bRet, int32_t& Index); // Function U.U.IsMaterialData(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRarity(); // Function U.U.SetRarity(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Init(struct Unknown ItemInfo, char UseSmallIcon); // Function U.U.Init(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadIcon(struct Unknown Icon); // Function U.U.AsyncLoadIcon(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Event2; // 0x250 (8)
	struct Unknown Event; // 0x258 (8)
	struct Unknown Anim_Second; // 0x260 (8)
	struct Unknown Hide; // 0x268 (8)
	struct Unknown Infos_Ani; // 0x270 (8)
	struct Unknown Anim_Defeat; // 0x278 (8)
	struct Unknown Anim_Victory; // 0x280 (8)
	struct Unknown Arrow; // 0x288 (8)
	struct Unknown Arrow_2; // 0x290 (8)
	struct Unknown ArrowLine; // 0x298 (8)
	struct Unknown ArrowLine_2; // 0x2A0 (8)
	struct Unknown BackgroundBlur; // 0x2A8 (8)
	struct Unknown BackgroundBlur_447; // 0x2B0 (8)
	struct Unknown BlackBG01; // 0x2B8 (8)
	struct Unknown BlackBG02; // 0x2C0 (8)
	struct Unknown BottomLine; // 0x2C8 (8)
	struct Unknown BottomLine_2; // 0x2D0 (8)
	struct Unknown Button; // 0x2D8 (8)
	struct Unknown Button_2; // 0x2E0 (8)
	struct Unknown Button_104; // 0x2E8 (8)
	struct Unknown CanvasPanel_7; // 0x2F0 (8)
	struct Unknown CanvasPanel_49; // 0x2F8 (8)
	struct Unknown CanvasPanel_488; // 0x300 (8)
	struct Unknown CanvasPanel_832; // 0x308 (8)
	struct Unknown Glow1; // 0x310 (8)
	struct Unknown Glow1_2; // 0x318 (8)
	struct Unknown Glow2; // 0x320 (8)
	struct Unknown Glow3; // 0x328 (8)
	struct Unknown Glow3_2; // 0x330 (8)
	struct Unknown GlowLine; // 0x338 (8)
	struct Unknown HeadShot; // 0x340 (8)
	struct Unknown HorizontalBox_KillerWeaponInfo; // 0x348 (8)
	struct Unknown HorizontalBox_Rarity; // 0x350 (8)
	struct Unknown Image_4; // 0x358 (8)
	struct Unknown Image_5; // 0x360 (8)
	struct Unknown Image_6; // 0x368 (8)
	struct Unknown Image_7; // 0x370 (8)
	struct Unknown Image_8; // 0x378 (8)
	struct Unknown Image_16; // 0x380 (8)
	struct Unknown Image_17; // 0x388 (8)
	struct Unknown Image_18; // 0x390 (8)
	struct Unknown Image_19; // 0x398 (8)
	struct Unknown Image_20; // 0x3A0 (8)
	struct Unknown Image_21; // 0x3A8 (8)
	struct Unknown Image_22; // 0x3B0 (8)
	struct Unknown Image_23; // 0x3B8 (8)
	struct Unknown Image_252; // 0x3C0 (8)
	struct Unknown Image_505; // 0x3C8 (8)
	struct Unknown Image_1091; // 0x3D0 (8)
	struct Unknown Image_1443; // 0x3D8 (8)
	struct Unknown Image_1558; // 0x3E0 (8)
	struct Unknown L_Wing01; // 0x3E8 (8)
	struct Unknown L_Wing01_2; // 0x3F0 (8)
	struct Unknown L_Wing01_3; // 0x3F8 (8)
	struct Unknown L_Wing01_4; // 0x400 (8)
	struct Unknown L_Wing02; // 0x408 (8)
	struct Unknown L_Wing02_2; // 0x410 (8)
	struct Unknown L_Wing02_3; // 0x418 (8)
	struct Unknown L_Wing02_4; // 0x420 (8)
	struct Unknown L_Wing03; // 0x428 (8)
	struct Unknown L_Wing03_2; // 0x430 (8)
	struct Unknown L_Wing03_3; // 0x438 (8)
	struct Unknown L_Wing03_4; // 0x440 (8)
	struct Unknown L_WingLine; // 0x448 (8)
	struct Unknown L_WingLine_2; // 0x450 (8)
	struct Unknown Logo; // 0x458 (8)
	struct Unknown Logo_2; // 0x460 (8)
	struct Unknown Overlay_1; // 0x468 (8)
	struct Unknown Overlay_WeaponLevel; // 0x470 (8)
	struct Unknown PosX; // 0x478 (8)
	struct Unknown PosY; // 0x480 (8)
	struct Unknown PosZ; // 0x488 (8)
	struct Unknown R_Wing01; // 0x490 (8)
	struct Unknown R_Wing01_2; // 0x498 (8)
	struct Unknown R_Wing01_3; // 0x4A0 (8)
	struct Unknown R_Wing01_4; // 0x4A8 (8)
	struct Unknown R_Wing02; // 0x4B0 (8)
	struct Unknown R_Wing02_2; // 0x4B8 (8)
	struct Unknown R_Wing02_3; // 0x4C0 (8)
	struct Unknown R_Wing02_4; // 0x4C8 (8)
	struct Unknown R_Wing03; // 0x4D0 (8)
	struct Unknown R_Wing03_2; // 0x4D8 (8)
	struct Unknown R_Wing03_3; // 0x4E0 (8)
	struct Unknown R_Wing03_4; // 0x4E8 (8)
	struct Unknown R_WingLine; // 0x4F0 (8)
	struct Unknown R_WingLine_2; // 0x4F8 (8)
	struct Unknown Ribbon; // 0x500 (8)
	struct Unknown Ribbon_2; // 0x508 (8)
	struct Unknown Ring; // 0x510 (8)
	struct Unknown ScrollBox_1; // 0x518 (8)
	struct Unknown T_DamageType; // 0x520 (8)
	struct Unknown T_WeaponLevel; // 0x528 (8)
	struct Unknown TextBlock_3; // 0x530 (8)
	struct Unknown TextBlock_4; // 0x538 (8)
	struct Unknown TextBlock_5; // 0x540 (8)
	struct Unknown TextBlock_6; // 0x548 (8)
	struct Unknown TextBlock_8; // 0x550 (8)
	struct Unknown TextBlock_9; // 0x558 (8)
	struct Unknown TextBlock_10; // 0x560 (8)
	struct Unknown TextBlock_11; // 0x568 (8)
	struct Unknown TextBlock_900; // 0x570 (8)
	struct Unknown TopLine; // 0x578 (8)
	struct Unknown TopLine_2; // 0x580 (8)
	struct Unknown U; // 0x588 (8)
	struct Unknown U; // 0x590 (8)
	struct Unknown WeaponName; // 0x598 (8)
	struct Unknown WidgetSwitcher_DamageCauser; // 0x5A0 (8)
	struct Unknown WinText1; // 0x5A8 (8)
	struct Unknown WinText1_2; // 0x5B0 (8)
	struct Unknown WinText1_3; // 0x5B8 (8)
	struct Unknown WinText1_4; // 0x5C0 (8)
	struct Unknown WinText2; // 0x5C8 (8)
	struct Unknown WinText3; // 0x5D0 (8)
	char MatchEnd : 0; // 0x5D8 (1)
	struct Unknown AnimationData; // 0x5D9 (2)
	struct Unknown MatchEndWidgetRef; // 0x5E0 (8)
	struct Unknown SimpleResult; // 0x5E8 (168)
	struct TArray<Unknown> SimpleTimer; // 0x690 (16)
	struct FMulticastInlineDelegate EventDispatcher_HideComplete; // 0x6A0 (16)
	char bSuccessWinEventCall : 0; // 0x6B0 (1)
	struct TArray<Unknown> PlayingAudio; // 0x6B8 (16)
	char bTestMode : 0; // 0x6C8 (1)
	char bTestIsWin : 0; // 0x6C9 (1)
	float MatchFinalResultShowTime; // 0x6CC (4)

	void SequenceEvent__ENTRYPOINTU_2(); // Function U.U.SequenceEvent__ENTRYPOINTU_2(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_1(); // Function U.U.SequenceEvent__ENTRYPOINTU_1(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckSkipBtn(); // Function U.U.CheckSkipBtn(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayCharacterResultAnimation(); // Function U.U.PlayCharacterResultAnimation(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateInputMode(); // Function U.U.UpdateInputMode(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RemoveOverlapedWidgets(); // Function U.U.RemoveOverlapedWidgets(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetKillerInfo(struct Unknown SimpleResult); // Function U.U.SetKillerInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetDropedItem(); // Function U.U.SetDropedItem(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowMatchEndAnimation(struct Unknown AnimationData, struct Unknown Result, char IsTestMode); // Function U.U.ShowMatchEndAnimation(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowLoseAnimation(struct Unknown Data); // Function U.U.ShowLoseAnimation(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideAnimation(); // Function U.U.HideAnimation(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DelegateOnWhoKilledMe_Event_1(struct Unknown& SimpleResult); // Function U.U.DelegateOnWhoKilledMe_Event_1(HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Init(); // Function U.U.Init(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_103_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_103_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EventDispatcher_HideComplete__DelegateSignature(); // Function U.U.EventDispatcher_HideComplete__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Infos_Ani; // 0x250 (8)
	struct Unknown SimpleResult_Events; // 0x258 (8)
	struct Unknown Lose_ani; // 0x260 (8)
	struct Unknown Win_ani; // 0x268 (8)
	struct Unknown Lose_Events; // 0x270 (8)
	struct Unknown Win_Events; // 0x278 (8)
	struct Unknown ClassName; // 0x280 (8)
	struct Unknown ClassWeaponName; // 0x288 (8)
	struct Unknown HeadShot; // 0x290 (8)
	struct Unknown HorizontalBox_KillerWeaponInfo; // 0x298 (8)
	struct Unknown HorizontalBox_Rarity; // 0x2A0 (8)
	struct Unknown Icon_KillerClass; // 0x2A8 (8)
	struct Unknown Image_894; // 0x2B0 (8)
	struct Unknown Image_2002; // 0x2B8 (8)
	struct Unknown Level; // 0x2C0 (8)
	struct Unknown LoseMessage; // 0x2C8 (8)
	struct Unknown Overlay_DropItems; // 0x2D0 (8)
	struct Unknown Overlay_KillerInfo; // 0x2D8 (8)
	struct Unknown Overlay_WeaponLevel; // 0x2E0 (8)
	struct Unknown T_DamageType; // 0x2E8 (8)
	struct Unknown T_WeaponLevel; // 0x2F0 (8)
	struct Unknown TextBlock_ItemCount; // 0x2F8 (8)
	struct Unknown Uniform_ItemList; // 0x300 (8)
	struct Unknown UserName; // 0x308 (8)
	struct Unknown U_1; // 0x310 (8)
	struct Unknown U; // 0x318 (8)
	struct Unknown WeaponName; // 0x320 (8)
	struct Unknown WidgetSwitcher_DamageCauser; // 0x328 (8)
	struct Unknown AnimationData; // 0x330 (2)
	struct Unknown MatchEndWidgetRef; // 0x338 (8)
	struct Unknown SimpleResult; // 0x340 (168)
	char MatchEnd : 0; // 0x3E8 (1)

	void SequenceEvent__ENTRYPOINTU_10(); // Function U.U.SequenceEvent__ENTRYPOINTU_10(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_9(); // Function U.U.SequenceEvent__ENTRYPOINTU_9(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_8(); // Function U.U.SequenceEvent__ENTRYPOINTU_8(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_7(); // Function U.U.SequenceEvent__ENTRYPOINTU_7(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_6(); // Function U.U.SequenceEvent__ENTRYPOINTU_6(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_5(); // Function U.U.SequenceEvent__ENTRYPOINTU_5(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_4(); // Function U.U.SequenceEvent__ENTRYPOINTU_4(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_3(); // Function U.U.SequenceEvent__ENTRYPOINTU_3(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_2(); // Function U.U.SequenceEvent__ENTRYPOINTU_2(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_1(); // Function U.U.SequenceEvent__ENTRYPOINTU_1(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetDropedItem(); // Function U.U.SetDropedItem(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateInputMode(); // Function U.U.UpdateInputMode(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RemoveOverlapedWidgets(); // Function U.U.RemoveOverlapedWidgets(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideHUDMessageWidget(); // Function U.U.HideHUDMessageWidget(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideMainWidget(); // Function U.U.HideMainWidget(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetSimpleResult(); // Function U.U.SetSimpleResult(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetMatchEnd(); // Function U.U.SetMatchEnd(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetKillerInfo(struct Unknown& Result); // Function U.U.SetKillerInfo(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ReleaseSlomo(); // Function U.U.ReleaseSlomo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ApplySlomo(); // Function U.U.ApplySlomo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayWidgetLoseAni(); // Function U.U.PlayWidgetLoseAni(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayWidgetWinAni(); // Function U.U.PlayWidgetWinAni(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SkipMatchEndAnimation(); // Function U.U.SkipMatchEndAnimation(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayCharacterWinAnimation(); // Function U.U.PlayCharacterWinAnimation(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayDefeatBGM(); // Function U.U.PlayDefeatBGM(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayWinBGM(); // Function U.U.PlayWinBGM(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_75D3BA16496147EA282F81A6BD982AD6(struct Unknown Loaded); // Function U.U.OnLoaded_75D3BA16496147EA282F81A6BD982AD6(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function U.U.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncIcon(struct Unknown Image); // Function U.U.AsyncIcon(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnClicked_SkipButton(); // Function U.U.OnClicked_SkipButton(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DelegateOnWhoKilledMe_Event_1(struct Unknown& SimpleResult); // Function U.U.DelegateOnWhoKilledMe_Event_1(HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown Ani_Complete; // 0x248 (8)
	struct Unknown Ani_BG; // 0x250 (8)
	struct Unknown Bg; // 0x258 (8)
	struct Unknown Complete; // 0x260 (8)
	struct Unknown TextBlock_QuestDesc; // 0x268 (8)
	struct Unknown TextBlock_QuestTitle; // 0x270 (8)
	struct Unknown U; // 0x278 (8)
	struct Unknown U; // 0x280 (8)
	struct Unknown U_2; // 0x288 (8)
	struct Unknown U_3; // 0x290 (8)
	struct Unknown TaskInfo; // 0x298 (32)
	struct Unknown TaskData; // 0x2B8 (176)

	void SetTaskInfo(struct Unknown TaskInfo); // Function U.U.SetTaskInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Anim_OnFire; // 0x250 (8)
	struct Unknown FireLine; // 0x258 (8)

	void SetLineInfo(float Angle, float Length); // Function U.U.SetLineInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnAnimationFinished(struct Unknown Animation); // Function U.U.OnAnimationFinished(BlueprintCosmetic|Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelRoutePingWidget {

public:

	struct Unknown Anim_OnShow; // 0x248 (8)
	struct Unknown Line; // 0x250 (8)
	struct FMulticastInlineDelegate OnMarkerClicked; // 0x258 (16)
	char IsLastPoint : 0; // 0x268 (1)

	void SetGuideLine(); // Function U.U.SetGuideLine(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Set(char IsLastPoint); // Function U.U.Set(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetLineLength(float Length); // Function U.U.SetLineLength(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetTeamColor(struct Unknown LinearColor); // Function U.U.SetTeamColor(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMarkerClicked__DelegateSignature(struct Unknown Button, char mapObjectID); // Function U.U.OnMarkerClicked__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown Image_81; // 0x248 (8)
	struct Unknown Image_86; // 0x250 (8)
	struct Unknown Image_88; // 0x258 (8)
	struct Unknown Image_89; // 0x260 (8)
	struct Unknown Image_90; // 0x268 (8)
	struct Unknown Image_91; // 0x270 (8)
	struct Unknown Image_92; // 0x278 (8)
	struct Unknown Image_93; // 0x280 (8)
	struct Unknown Image_94; // 0x288 (8)
	struct Unknown Image_95; // 0x290 (8)
	struct Unknown Image_96; // 0x298 (8)
	struct Unknown Image_97; // 0x2A0 (8)
	struct Unknown Image_98; // 0x2A8 (8)
	struct Unknown Image_99; // 0x2B0 (8)
	struct Unknown Image_100; // 0x2B8 (8)
	struct Unknown Image_101; // 0x2C0 (8)
	struct Unknown Image_102; // 0x2C8 (8)
	struct Unknown Image_103; // 0x2D0 (8)
	struct Unknown Image_104; // 0x2D8 (8)
	struct Unknown Image_107; // 0x2E0 (8)
	struct Unknown Image_108; // 0x2E8 (8)
	struct Unknown Image_119; // 0x2F0 (8)
	struct Unknown Image_120; // 0x2F8 (8)
	struct Unknown Image_121; // 0x300 (8)
	struct Unknown Image_122; // 0x308 (8)
	struct Unknown Image_123; // 0x310 (8)
	struct Unknown Image_134; // 0x318 (8)
	struct Unknown Image_137; // 0x320 (8)
	struct Unknown Image_138; // 0x328 (8)
	struct Unknown Image_139; // 0x330 (8)
	struct Unknown Image_140; // 0x338 (8)
	struct Unknown Image_141; // 0x340 (8)
	struct Unknown Image_142; // 0x348 (8)
	struct Unknown Image_143; // 0x350 (8)
	struct Unknown Image_144; // 0x358 (8)
	struct Unknown Image_145; // 0x360 (8)
	struct Unknown Image_146; // 0x368 (8)
	struct Unknown Image_147; // 0x370 (8)
	struct Unknown Image_148; // 0x378 (8)
	struct Unknown Image_149; // 0x380 (8)
	struct Unknown Image_152; // 0x388 (8)
	struct Unknown Image_153; // 0x390 (8)
	struct Unknown Image_154; // 0x398 (8)
	struct Unknown Image_155; // 0x3A0 (8)
	struct Unknown Image_156; // 0x3A8 (8)
	struct Unknown Image_157; // 0x3B0 (8)
	struct Unknown Image_158; // 0x3B8 (8)
	struct Unknown Image_159; // 0x3C0 (8)
	struct Unknown Image_160; // 0x3C8 (8)
	struct Unknown Image_161; // 0x3D0 (8)
	struct Unknown Image_162; // 0x3D8 (8)
	struct Unknown Image_163; // 0x3E0 (8)
	struct Unknown Image_164; // 0x3E8 (8)
	struct Unknown WidgetSwitcher_1; // 0x3F0 (8)
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelPlayerMarkerWidget {

public:

	struct Unknown Image_SupplyBoxMarker; // 0x248 (8)
	struct Unknown PersonalSupplyBox; // 0x250 (8)
	struct Unknown WidgetSwitcher_2; // 0x258 (8)
	struct FMulticastInlineDelegate OnMarkerClicked; // 0x260 (16)
	struct Unknown CurrentMarker; // 0x270 (8)
	struct Unknown MapCompRef; // 0x278 (8)
	struct Unknown TmpPingTypeTexture; // 0x280 (8)

	void UpdatePersonalSupplyBox(); // Function U.U.UpdatePersonalSupplyBox(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPersonalSupplyBox(struct Unknown MapCompRef); // Function U.U.SetPersonalSupplyBox(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMarkerClicked__DelegateSignature(struct Unknown Button, char mapObjectID); // Function U.U.OnMarkerClicked__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelPlayerIconWidget {

public:

	struct Unknown UberGraphFrame; // 0x318 (8)
	struct Unknown Anim_OnNotifyPos; // 0x320 (8)
	struct Unknown Anim_OnAttacked; // 0x328 (8)
	struct Unknown Canvas_Attacked; // 0x330 (8)
	struct Unknown Canvas_Fire; // 0x338 (8)
	struct Unknown Canvas_NotifyPos; // 0x340 (8)
	struct Unknown Img_FreeCam; // 0x348 (8)
	struct Unknown PlayerState; // 0x350 (8)

	void OnClickPlayerNameButton(); // Function U.U.OnClickPlayerNameButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnAttackedWidget(); // Function U.U.OnAttackedWidget(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnFireWidget(struct Unknown MapComp, struct Unknown Rotation, float Length); // Function U.U.OnFireWidget(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetFreeCam(); // Function U.U.SetFreeCam(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Initialize(struct Unknown PlayerState); // Function U.U.Initialize(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnAnimationFinished(struct Unknown Animation); // Function U.U.OnAnimationFinished(BlueprintCosmetic|Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Rotate(float Angle); // Function U.U.Rotate(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT_UserName_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__BT_UserName_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayTargetPosAnim(); // Function U.U.PlayTargetPosAnim(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Image; // 0x250 (8)
	struct Unknown Image_2; // 0x258 (8)
	struct Unknown Image_3; // 0x260 (8)
	struct Unknown Image_4; // 0x268 (8)
	struct Unknown Image_917; // 0x270 (8)
	struct Unknown Img_TypeIcon; // 0x278 (8)
	struct Unknown KeyImageWidget; // 0x280 (8)
	struct Unknown KeyImageWidget_2; // 0x288 (8)
	struct Unknown KeyImageWidget_3; // 0x290 (8)
	struct Unknown KeyImageWidget_4; // 0x298 (8)
	struct Unknown KeyImageWidget_5; // 0x2A0 (8)
	struct Unknown T_Context; // 0x2A8 (8)
	struct Unknown T_Context_2; // 0x2B0 (8)
	struct Unknown T_Context_3; // 0x2B8 (8)
	struct Unknown T_Context_4; // 0x2C0 (8)
	struct Unknown T_Context_5; // 0x2C8 (8)
	struct Unknown Text_SkillName; // 0x2D0 (8)
	struct Unknown VB_Nuclear; // 0x2D8 (8)
	struct Unknown VB_Retreat; // 0x2E0 (8)
	struct Unknown WidgetSwitcher_126; // 0x2E8 (8)

	void SetTutorialInfo(enum class Unknow SkillType); // Function U.U.SetTutorialInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
