// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelPlayerIconWidget {
	struct Unknown UberGraphFrame; //  0x318 Size(8)
	struct Unknown Anim_OnNotifyPos; //  0x320 Size(8)
	struct Unknown Anim_OnAttacked; //  0x328 Size(8)
	struct Unknown Canvas_Attacked; //  0x330 Size(8)
	struct Unknown Canvas_Fire; //  0x338 Size(8)
	struct Unknown Canvas_NotifyPos; //  0x340 Size(8)
	struct Unknown Img_FreeCam; //  0x348 Size(8)
	struct Unknown PlayerState; //  0x350 Size(8)

	void OnClickPlayerNameButton(); // Function U.U.OnClickPlayerNameButton(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Ani_Gold; //  0x250 Size(8)
	struct Unknown 1; //  0x258 Size(8)
	struct Unknown 10; //  0x260 Size(8)
	struct Unknown 100; //  0x268 Size(8)
	struct Unknown 1000; //  0x270 Size(8)
	struct Unknown BonusBG; //  0x278 Size(8)
	struct Unknown BrightSpot_01; //  0x280 Size(8)
	struct Unknown BrightSpot_02; //  0x288 Size(8)
	struct Unknown BrightSpot_03; //  0x290 Size(8)
	struct Unknown BrightSpot_04; //  0x298 Size(8)
	struct Unknown BrightSpot_05; //  0x2a0 Size(8)
	struct Unknown Empty; //  0x2a8 Size(8)
	struct Unknown Glow_01; //  0x2b0 Size(8)
	struct Unknown Gold; //  0x2b8 Size(8)
	struct Unknown Image_7; //  0x2c0 Size(8)
	struct Unknown Image_11; //  0x2c8 Size(8)
	struct Unknown Image_14; //  0x2d0 Size(8)
	struct Unknown Image_15; //  0x2d8 Size(8)
	struct Unknown Image_16; //  0x2e0 Size(8)
	struct Unknown Image_17; //  0x2e8 Size(8)
	struct Unknown Image_18; //  0x2f0 Size(8)
	struct Unknown Image_20; //  0x2f8 Size(8)
	struct Unknown Image_21; //  0x300 Size(8)
	struct Unknown Image_22; //  0x308 Size(8)
	struct Unknown Image_23; //  0x310 Size(8)
	struct Unknown Image_335; //  0x318 Size(8)
	struct Unknown Image_1473; //  0x320 Size(8)
	struct Unknown Light; //  0x328 Size(8)
	struct Unknown Light_01; //  0x330 Size(8)
	struct Unknown Light_02; //  0x338 Size(8)
	struct Unknown Light_03; //  0x340 Size(8)
	struct Unknown Light_04; //  0x348 Size(8)
	struct Unknown Light_05; //  0x350 Size(8)
	struct Unknown Light_06; //  0x358 Size(8)
	struct Unknown PickUpGold; //  0x360 Size(8)
	struct Unknown RIng_Glow_01; //  0x368 Size(8)
	struct Unknown TextBlock_4; //  0x370 Size(8)
	struct Unknown TextLight_2; //  0x378 Size(8)
	struct Unknown TextLight_3; //  0x380 Size(8)
	int32_t Save; //  0x388 Size(4)
	char NewVar_1; //  0x38c Size(1)
	char IsStopSound; //  0x38d Size(1)
	float LoopSountStartTime; //  0x390 Size(4)
	struct Unknown LoopSound; //  0x394 Size(4)
	float LoopSountEndTime; //  0x398 Size(4)
	float 1StartTime; //  0x39c Size(4)
	float 10StartTime; //  0x3a0 Size(4)
	float 100StartTime; //  0x3a4 Size(4)
	float 1000StartTime; //  0x3a8 Size(4)
	float FinStartTime; //  0x3ac Size(4)

	void Divide(int32_t Value1, int32_t& RetS1, int32_t& RetS2); // Function U.U.Divide(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x2a0 Size(8)
	struct Unknown VisualBorder; //  0x2a8 Size(8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Button_Focus; //  0x250 Size(8)
	struct Unknown HorizontalBox_1; //  0x258 Size(8)
	struct Unknown Image_223; //  0x260 Size(8)
	struct Unknown Img_Movie; //  0x268 Size(8)
	struct Unknown MediaPlayer; //  0x270 Size(8)
	char bPopup; //  0x278 Size(1)
	struct Unknown Media; //  0x280 Size(8)
	struct Unknown MediaSoundComp; //  0x288 Size(8)
	struct Unknown Game; //  0x290 Size(8)
	float GammaIntensity; //  0x298 Size(4)
	struct Unknown SkipNoticeTimer; //  0x2a0 Size(8)
	struct Unknown MediaTexture; //  0x2a8 Size(8)
	struct FName OpeningFileName; //  0x2b0 Size(8)
	char End; //  0x2b8 Size(1)
	char NextScene; //  0x2b9 Size(1)

	void MoveNextScene(); // Function U.U.MoveNextScene(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown FadeOut; //  0x250 Size(8)
	struct Unknown HitImage; //  0x258 Size(8)
	struct Unknown SizeBox_1; //  0x260 Size(8)
	struct Unknown InstigatorLocation; //  0x268 Size(c)
	struct Unknown InstigatorCharacter; //  0x278 Size(8)

	void Hide(); // Function U.U.Hide(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Bg; //  0x250 Size(8)
	struct Unknown btn_Cancel; //  0x258 Size(8)
	struct Unknown btn_OK; //  0x260 Size(8)
	struct Unknown Button_Focus; //  0x268 Size(8)
	struct Unknown Button_Focus2; //  0x270 Size(8)
	struct Unknown CanvasPanel_Exit; //  0x278 Size(8)
	struct Unknown HorizontalBox_1; //  0x280 Size(8)
	struct Unknown Image_2; //  0x288 Size(8)
	struct Unknown Image_223; //  0x290 Size(8)
	struct Unknown Img_Movie; //  0x298 Size(8)
	struct Unknown RichTextBlock_244; //  0x2a0 Size(8)
	struct Unknown MediaPlayer; //  0x2a8 Size(8)
	char bPopup; //  0x2b0 Size(1)
	struct Unknown MediaSoundComp; //  0x2b8 Size(8)
	float GammaIntensity; //  0x2c0 Size(4)
	struct Unknown Game; //  0x2c8 Size(8)
	struct Unknown SkipNoticeTimer; //  0x2d0 Size(8)
	struct Unknown MediaTexture; //  0x2d8 Size(8)
	struct Unknown Media; //  0x2e0 Size(8)
	char NextScene; //  0x2e8 Size(1)

	void PlayMedia(); // Function U.U.PlayMedia(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelPerkDeckWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Msg_open; //  0x250 Size(8)
	struct Unknown POPUP_OPEN; //  0x258 Size(8)
	struct Unknown Idle; //  0x260 Size(8)
	struct Unknown btn_Choose; //  0x268 Size(8)
	struct Unknown btn_OK; //  0x270 Size(8)
	struct Unknown btn_OK_6; //  0x278 Size(8)
	struct Unknown btn_PerkDeck; //  0x280 Size(8)
	struct Unknown Button_CloseMovie; //  0x288 Size(8)
	struct Unknown Button_PlayMovie; //  0x290 Size(8)
	struct Unknown Button_Refresh; //  0x298 Size(8)
	struct Unknown Button_Reselect; //  0x2a0 Size(8)
	struct Unknown Button_SelectMode; //  0x2a8 Size(8)
	struct Unknown Canvas_CantSelectMessage; //  0x2b0 Size(8)
	struct Unknown Canvas_MovieScreen; //  0x2b8 Size(8)
	struct Unknown CanvasPanel_ClassList; //  0x2c0 Size(8)
	struct Unknown CanvasPanel_NewbieAdvantage; //  0x2c8 Size(8)
	struct Unknown CheckBox_PerkDeckNotReOpen; //  0x2d0 Size(8)
	struct Unknown GoldLack; //  0x2d8 Size(8)
	struct Unknown HorizontalBox_ClassList; //  0x2e0 Size(8)
	struct Unknown HorizontalBox_PerkDeckReOpen; //  0x2e8 Size(8)
	struct Unknown Image_1; //  0x2f0 Size(8)
	struct Unknown Image_2; //  0x2f8 Size(8)
	struct Unknown Image_5; //  0x300 Size(8)
	struct Unknown Image_10; //  0x308 Size(8)
	struct Unknown Image_11; //  0x310 Size(8)
	struct Unknown Image_13; //  0x318 Size(8)
	struct Unknown Image_134; //  0x320 Size(8)
	struct Unknown Image_213; //  0x328 Size(8)
	struct Unknown Image_247; //  0x330 Size(8)
	struct Unknown Image_271; //  0x338 Size(8)
	struct Unknown Image_276; //  0x340 Size(8)
	struct Unknown Image_335; //  0x348 Size(8)
	struct Unknown Image_342; //  0x350 Size(8)
	struct Unknown Image_484; //  0x358 Size(8)
	struct Unknown Image_566; //  0x360 Size(8)
	struct Unknown Image_1200; //  0x368 Size(8)
	struct Unknown Image_1511; //  0x370 Size(8)
	struct Unknown Image_Class; //  0x378 Size(8)
	struct Unknown Image_ClassIcon; //  0x380 Size(8)
	struct Unknown Image_Cycle; //  0x388 Size(8)
	struct Unknown Image_Cycle_2; //  0x390 Size(8)
	struct Unknown Image_Cycle_4; //  0x398 Size(8)
	struct Unknown Image_Weapon; //  0x3a0 Size(8)
	struct Unknown Img_Movie; //  0x3a8 Size(8)
	struct Unknown ReseletTextGroup1; //  0x3b0 Size(8)
	struct Unknown ReseletTextGroup1_2; //  0x3b8 Size(8)
	struct Unknown ReseletTextGroup2; //  0x3c0 Size(8)
	struct Unknown ReseletTextGroup2_2; //  0x3c8 Size(8)
	struct Unknown ReseletTextGroup2_4; //  0x3d0 Size(8)
	struct Unknown ScaleBox_ClassList; //  0x3d8 Size(8)
	struct Unknown ScaleBox_SelectNotifyMessage; //  0x3e0 Size(8)
	struct Unknown SizeBox_Choose; //  0x3e8 Size(8)
	struct Unknown SizeBox_Ok; //  0x3f0 Size(8)
	struct Unknown SizeBox_Ok2; //  0x3f8 Size(8)
	struct Unknown SizeBox_Random; //  0x400 Size(8)
	struct Unknown SizeBox_Refrest; //  0x408 Size(8)
	struct Unknown SizeBox_Select; //  0x410 Size(8)
	struct Unknown T_AmmoName; //  0x418 Size(8)
	struct Unknown T_ClassDeckName; //  0x420 Size(8)
	struct Unknown T_ClassDesc; //  0x428 Size(8)
	struct Unknown T_CurrentGold; //  0x430 Size(8)
	struct Unknown T_WeaponDesc; //  0x438 Size(8)
	struct Unknown T_WeaponName; //  0x440 Size(8)
	struct Unknown TextBlock_Close; //  0x448 Size(8)
	struct Unknown TextBlock_Close_2; //  0x450 Size(8)
	struct Unknown TextBlock_Close_7; //  0x458 Size(8)
	struct Unknown TextBlock_MaxReset; //  0x460 Size(8)
	struct Unknown TextBlock_MaxReset_2; //  0x468 Size(8)
	struct Unknown TextBlock_Price_ChangeDeckList; //  0x470 Size(8)
	struct Unknown TextBlock_Price_Random; //  0x478 Size(8)
	struct Unknown TextBlock_Price_Select; //  0x480 Size(8)
	struct Unknown TextBlock_RandomRemainCount; //  0x488 Size(8)
	struct Unknown TextBlock_RefreshRemainCount; //  0x490 Size(8)
	struct Unknown TextBlock_Reselect; //  0x498 Size(8)
	struct Unknown TextBlock_Reselect_2; //  0x4a0 Size(8)
	struct Unknown TextBlock_Reselect_4; //  0x4a8 Size(8)
	struct Unknown U; //  0x4b0 Size(8)
	struct Unknown U; //  0x4b8 Size(8)
	struct Unknown WidgetSwitcher_ChangeDeck; //  0x4c0 Size(8)
	struct Unknown WidgetSwitcher_ChangeDeck_2; //  0x4c8 Size(8)
	struct Unknown WidgetSwitcher_Reselect; //  0x4d0 Size(8)
	struct Unknown WidgetSwitcher_Reselect_2; //  0x4d8 Size(8)
	struct Unknown WidgetSwitcher_Reselect_4; //  0x4e0 Size(8)
	struct Unknown InventoryWidget; //  0x4e8 Size(8)
	struct TArray<Unknown> Slots; //  0x4f0 Size(10)
	struct Unknown IconBrush; //  0x500 Size(88)
	struct Unknown HoverWidget; //  0x588 Size(8)
	struct Unknown HoverTimerHandle; //  0x590 Size(8)
	int64_t LocalTemp; //  0x598 Size(8)
	struct Unknown MediaPlayer; //  0x5a0 Size(8)
	struct TMap<{}, {}>Unknown ClassVideo_Map; //  0x5a8 Size(50)
	char bBlockButton; //  0x5f8 Size(1)
	char bButtonEnabled; //  0x5f9 Size(1)
	char bCanRemainCount; //  0x5fa Size(1)
	char bCanCurrentGold; //  0x5fb Size(1)
	char bWaitingResponse; //  0x5fc Size(1)
	int64_t CurrentGold; //  0x600 Size(8)
	int32_t ChangeDeckCount; //  0x608 Size(4)
	int32_t ChangeDeckListCount; //  0x60c Size(4)
	int32_t Perk; //  0x610 Size(4)
	int32_t DisableTime; //  0x614 Size(4)
	struct TMap<{}, {}>Unknown ClassInfoWidgetMap; //  0x618 Size(50)
	struct Unknown CurrentPerkDeckSelectInfo; //  0x668 Size(18)
	int32_t LocalPerkMode; //  0x680 Size(4)
	float ClassListPadding; //  0x684 Size(4)
	struct Unknown Handle_PlayMovie; //  0x688 Size(8)
	struct Unknown CurrentClassVideo; //  0x690 Size(8)
	struct Unknown Handle_SetPerkInfoByHoverClassButton; //  0x698 Size(8)
	char LastClassButtonHovered; //  0x6a0 Size(1)
	int32_t LastClassIndex; //  0x6a4 Size(4)

	void SequenceEvent__ENTRYPOINTU_3(); // Function U.U.SequenceEvent__ENTRYPOINTU_3(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelReplayTimelineWidget {
	struct Unknown UberGraphFrame; //  0x360 Size(8)
	struct Unknown Bg; //  0x368 Size(8)
	struct Unknown Border_Timeline; //  0x370 Size(8)
	struct Unknown Border_TimeToGo; //  0x378 Size(8)
	struct Unknown BT_FreeCam; //  0x380 Size(8)
	struct Unknown BT_ReplayPause; //  0x388 Size(8)
	struct Unknown BT_ReplayResume; //  0x390 Size(8)
	struct Unknown BT_SpeedDown; //  0x398 Size(8)
	struct Unknown BT_SpeedUp; //  0x3a0 Size(8)
	struct Unknown BT_TimelineScaleDown; //  0x3a8 Size(8)
	struct Unknown BT_TimelineScaleUp; //  0x3b0 Size(8)
	struct Unknown Canvas_EventMarkers; //  0x3b8 Size(8)
	struct Unknown Chk_ShowKill; //  0x3c0 Size(8)
	struct Unknown Chk_ShowKnockout; //  0x3c8 Size(8)
	struct Unknown Chk_ShowMyKill; //  0x3d0 Size(8)
	struct Unknown Chk_ShowMyKnockout; //  0x3d8 Size(8)
	struct Unknown Chk_ShowMyResuscitated; //  0x3e0 Size(8)
	struct Unknown Chk_ShowResuscitated; //  0x3e8 Size(8)
	struct Unknown ReplayTimelineSlider; //  0x3f0 Size(8)
	struct Unknown ScrollBox_Timeline; //  0x3f8 Size(8)
	struct Unknown SizeBox_Timeline; //  0x400 Size(8)
	struct Unknown Slider_TimelineScale; //  0x408 Size(8)
	struct Unknown T_CameraType; //  0x410 Size(8)
	struct Unknown T_CurrentTime; //  0x418 Size(8)
	struct Unknown T_PlaySpeed; //  0x420 Size(8)
	struct Unknown T_TimeToGo; //  0x428 Size(8)
	struct Unknown T_TotalTime; //  0x430 Size(8)
	float TimelineSizeBoxOffset; //  0x438 Size(4)
	struct Unknown* Class_EventMarker_Kill; //  0x440 Size(8)
	struct Unknown* Class_EventMarker_Knockout; //  0x448 Size(8)
	float LastViewportSize; //  0x450 Size(4)
	char IsMouseOnBorder; //  0x454 Size(1)
	struct Unknown* Class_EventMarker_Resuscitated; //  0x458 Size(8)
	struct Unknown* Class_EventMarker_WhenReported; //  0x460 Size(8)
	enum class Unknow CameraType; //  0x468 Size(1)
	char ViewMode; //  0x469 Size(1)

	void CheckCameraType(); // Function U.U.CheckCameraType(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelScopeWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Idle; //  0x250 Size(8)
	struct Unknown Scope_In; //  0x258 Size(8)
	struct Unknown CanvasPanel_1; //  0x260 Size(8)
	struct Unknown Scope_Center; //  0x268 Size(8)
	struct Unknown Scope_Center_Dot; //  0x270 Size(8)

	void SetScopeImageAngle(float NewAngle); // Function U.U.SetScopeImageAngle(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelDebugWidget {
	struct Unknown TextBlock_DebugString; //  0x258 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown btn_Cancel; //  0x250 Size(8)
	struct Unknown btn_Cancel_3; //  0x258 Size(8)
	struct Unknown btn_OK; //  0x260 Size(8)
	struct Unknown HorizontalBox_WeaponList; //  0x268 Size(8)
	struct Unknown Image_68; //  0x270 Size(8)
	struct Unknown Image_128; //  0x278 Size(8)
	struct Unknown U; //  0x280 Size(8)
	struct Unknown U_2; //  0x288 Size(8)
	struct Unknown U_3; //  0x290 Size(8)
	struct FMulticastInlineDelegate EventDispatcher_RequestItemCraft; //  0x298 Size(10)
	struct Unknown SelectedWidget; //  0x2a8 Size(8)
	struct FMulticastInlineDelegate EventDispatcher_Cancel; //  0x2b0 Size(10)

	void SetWeaponList(struct TArray<Unknown>& WeaponList, int32_t BaseItemID); // Function U.U.SetWeaponList(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelReportUserCompletedWi {
	struct Unknown UberGraphFrame; //  0x250 Size(8)
	struct Unknown btn_confirm; //  0x258 Size(8)
	struct Unknown popup; //  0x260 Size(8)
	struct Unknown txt_description; //  0x268 Size(8)
	struct Unknown uw; //  0x270 Size(8)
	struct FText DescriptionText; //  0x278 Size(18)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelReportUserWidget {
	struct Unknown UberGraphFrame; //  0x278 Size(8)
	struct Unknown btn_Cancel; //  0x280 Size(8)
	struct Unknown btn_report; //  0x288 Size(8)
	struct Unknown combobox_button_overlay; //  0x290 Size(8)
	struct Unknown combobox_string; //  0x298 Size(8)
	struct Unknown Image; //  0x2a0 Size(8)
	struct Unknown Image_2; //  0x2a8 Size(8)
	struct Unknown Image_545; //  0x2b0 Size(8)
	struct Unknown NormalArrow; //  0x2b8 Size(8)
	struct Unknown OpeningArrow; //  0x2c0 Size(8)
	struct Unknown popup; //  0x2c8 Size(8)
	struct Unknown txt_description; //  0x2d0 Size(8)
	struct Unknown txt_nickname; //  0x2d8 Size(8)
	struct Unknown uw; //  0x2e0 Size(8)
	struct FText DescriptionText; //  0x2e8 Size(18)
	struct TArray<Unknown> ReportIndexText; //  0x300 Size(10)
	struct FText DefaultComboString; //  0x310 Size(18)
	int32_t CurrentSelectIndex; //  0x328 Size(4)
	int32_t SelectIndexFromProgram; //  0x32c Size(4)
	char CheckCloseComboArrow; //  0x330 Size(1)

	void SetOpeningArrow(char InOpening); // Function U.U.SetOpeningArrow(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelSightInfoWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Canvas_Charge; //  0x250 Size(8)
	struct Unknown ChargeIndicator; //  0x258 Size(8)
	struct Unknown Image_LeanDamageBg; //  0x260 Size(8)
	struct Unknown IMG_Gauge1; //  0x268 Size(8)
	struct Unknown IMG_Gauge2; //  0x270 Size(8)
	struct Unknown IMG_Gauge3; //  0x278 Size(8)
	struct Unknown IMG_Gauge4; //  0x280 Size(8)
	struct Unknown IMG_Gauge5; //  0x288 Size(8)
	struct Unknown IMG_Gauge6; //  0x290 Size(8)
	struct Unknown LeftTime; //  0x298 Size(8)
	struct Unknown Overlay_Gauge; //  0x2a0 Size(8)
	struct Unknown T_BulletsPerShot; //  0x2a8 Size(8)
	struct Unknown T_Damage; //  0x2b0 Size(8)
	struct Unknown T_RPM; //  0x2b8 Size(8)
	struct Unknown VerticalBox_; //  0x2c0 Size(8)
	struct Unknown BravoHotelCharacter; //  0x2c8 Size(8)
	struct TArray<Unknown> GaugeIMGArray; //  0x2d0 Size(10)
	int32_t LastGauge; //  0x2e0 Size(4)
	char Timer_; //  0x2e4 Size(1)
	struct Unknown Timer_UpdateInfos; //  0x2e8 Size(8)
	struct Unknown ChargeIndicatorDynamicMaterial; //  0x2f0 Size(8)

	void HideChargeInfo(); // Function U.U.HideChargeInfo(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Button_1; //  0x250 Size(8)
	struct Unknown death; //  0x258 Size(8)
	struct Unknown Image_168; //  0x260 Size(8)
	struct Unknown Image_216; //  0x268 Size(8)
	struct Unknown Image_506; //  0x270 Size(8)
	struct Unknown Image_623; //  0x278 Size(8)
	struct Unknown Img_LogOut; //  0x280 Size(8)
	struct Unknown Img_Voice; //  0x288 Size(8)
	struct Unknown Img_Voice_2; //  0x290 Size(8)
	struct Unknown Overlay_Death; //  0x298 Size(8)
	struct Unknown Slider_139; //  0x2a0 Size(8)
	struct Unknown T_PlayerIndex; //  0x2a8 Size(8)
	struct Unknown T_PlayerName; //  0x2b0 Size(8)
	struct Unknown TextBlock_209; //  0x2b8 Size(8)
	struct Unknown VerticalBox_1; //  0x2c0 Size(8)
	struct Unknown WidgetSwitcher; //  0x2c8 Size(8)
	struct FMulticastInlineDelegate EventDispatcher_ChangeVolumeState; //  0x2d0 Size(10)
	struct Unknown CurVoiceTalkState; //  0x2e0 Size(20)
	struct Unknown PingImage; //  0x300 Size(8)

	void SetInfo(struct Unknown VoiceTalkState); // Function U.U.SetInfo(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x1360 Size(8)
	struct Unknown Anim_LoopHintMainWeapon; //  0x1368 Size(8)
	struct Unknown Anim_Material_Get; //  0x1370 Size(8)
	struct Unknown Anim_Material_Hover; //  0x1378 Size(8)
	struct Unknown Anim_Upgrade; //  0x1380 Size(8)
	struct Unknown Anim_Progress; //  0x1388 Size(8)
	struct Unknown WeaponPerk_fadeIn; //  0x1390 Size(8)
	struct Unknown Anim_LoopNotifySubWeapon; //  0x1398 Size(8)
	struct Unknown Anim_StartNotifySubWeapon; //  0x13a0 Size(8)
	struct Unknown Anim_LoopNotifyMainWeapon; //  0x13a8 Size(8)
	struct Unknown Anim_StartNotifyMainWeapon; //  0x13b0 Size(8)
	struct Unknown Ammo01; //  0x13b8 Size(8)
	struct Unknown Ammo02; //  0x13c0 Size(8)
	struct Unknown AmmoInfo01; //  0x13c8 Size(8)
	struct Unknown AmmoInfo02; //  0x13d0 Size(8)
	struct Unknown Barrel01; //  0x13d8 Size(8)
	struct Unknown BG01; //  0x13e0 Size(8)
	struct Unknown BG02; //  0x13e8 Size(8)
	struct Unknown BorderImage02; //  0x13f0 Size(8)
	struct Unknown btn_RecipeTree; //  0x13f8 Size(8)
	struct Unknown ButtStockSlot01; //  0x1400 Size(8)
	struct Unknown ButtStockSlot02; //  0x1408 Size(8)
	struct Unknown Canvas_AnimMain; //  0x1410 Size(8)
	struct Unknown Canvas_AnimMain_Progress; //  0x1418 Size(8)
	struct Unknown Canvas_AnimMain_Upgrade; //  0x1420 Size(8)
	struct Unknown Canvas_AnimSub; //  0x1428 Size(8)
	struct Unknown Choice_BG01; //  0x1430 Size(8)
	struct Unknown Choice_BG02; //  0x1438 Size(8)
	struct Unknown GripSlot01; //  0x1440 Size(8)
	struct Unknown HorizontalBox_Perk; //  0x1448 Size(8)
	struct Unknown HorizontalBox_Rarity1; //  0x1450 Size(8)
	struct Unknown HorizontalBox_Rarity2; //  0x1458 Size(8)
	struct Unknown Image_2; //  0x1460 Size(8)
	struct Unknown Image_3; //  0x1468 Size(8)
	struct Unknown Image_5; //  0x1470 Size(8)
	struct Unknown Image_7; //  0x1478 Size(8)
	struct Unknown Image_48; //  0x1480 Size(8)
	struct Unknown Image_85; //  0x1488 Size(8)
	struct Unknown Image_86; //  0x1490 Size(8)
	struct Unknown Image_175; //  0x1498 Size(8)
	struct Unknown Image_202; //  0x14a0 Size(8)
	struct Unknown Image_212; //  0x14a8 Size(8)
	struct Unknown Image_214; //  0x14b0 Size(8)
	struct Unknown Image_217; //  0x14b8 Size(8)
	struct Unknown Image_219; //  0x14c0 Size(8)
	struct Unknown Image_234; //  0x14c8 Size(8)
	struct Unknown Image_356; //  0x14d0 Size(8)
	struct Unknown Image_369; //  0x14d8 Size(8)
	struct Unknown Image_371; //  0x14e0 Size(8)
	struct Unknown Image_372; //  0x14e8 Size(8)
	struct Unknown Image_682; //  0x14f0 Size(8)
	struct Unknown Image_805; //  0x14f8 Size(8)
	struct Unknown Image_807; //  0x1500 Size(8)
	struct Unknown Image_808; //  0x1508 Size(8)
	struct Unknown Image_809; //  0x1510 Size(8)
	struct Unknown Image_1071; //  0x1518 Size(8)
	struct Unknown Image_Bindable; //  0x1520 Size(8)
	struct Unknown Image_Supply; //  0x1528 Size(8)
	struct Unknown ImageAmmo01; //  0x1530 Size(8)
	struct Unknown ImageAmmo02; //  0x1538 Size(8)
	struct Unknown Info01; //  0x1540 Size(8)
	struct Unknown Info02; //  0x1548 Size(8)
	struct Unknown Line01; //  0x1550 Size(8)
	struct Unknown Line02; //  0x1558 Size(8)
	struct Unknown MagazineSlot01; //  0x1560 Size(8)
	struct Unknown MagazineSlot02; //  0x1568 Size(8)
	struct Unknown MainWeaponSlot; //  0x1570 Size(8)
	struct Unknown MuzzleDeviceSlot01; //  0x1578 Size(8)
	struct Unknown MuzzleDeviceSlot02; //  0x1580 Size(8)
	struct Unknown Overlay_2; //  0x1588 Size(8)
	struct Unknown Perk01; //  0x1590 Size(8)
	struct Unknown Perk01_Sub; //  0x1598 Size(8)
	struct Unknown Perk02; //  0x15a0 Size(8)
	struct Unknown Perk02_Sub; //  0x15a8 Size(8)
	struct Unknown Perk03; //  0x15b0 Size(8)
	struct Unknown Perk03_Sub; //  0x15b8 Size(8)
	struct Unknown Perk04; //  0x15c0 Size(8)
	struct Unknown Perk04_Sub; //  0x15c8 Size(8)
	struct Unknown SightSlot01; //  0x15d0 Size(8)
	struct Unknown SightSlot02; //  0x15d8 Size(8)
	struct Unknown SubWeaponSlot; //  0x15e0 Size(8)
	struct Unknown TextBlock_1; //  0x15e8 Size(8)
	struct Unknown TextBlock_Range01; //  0x15f0 Size(8)
	struct Unknown TopNameBG01; //  0x15f8 Size(8)
	struct Unknown TopNameBG02; //  0x1600 Size(8)
	struct Unknown U; //  0x1608 Size(8)
	struct Unknown U; //  0x1610 Size(8)
	struct Unknown U_2; //  0x1618 Size(8)
	struct Unknown U_3; //  0x1620 Size(8)
	struct Unknown U; //  0x1628 Size(8)
	struct Unknown WeaponImage01; //  0x1630 Size(8)
	struct Unknown WeaponImage02; //  0x1638 Size(8)
	struct Unknown WeaponIndex01; //  0x1640 Size(8)
	struct Unknown WeaponIndex02; //  0x1648 Size(8)
	struct Unknown WeaponName01; //  0x1650 Size(8)
	struct Unknown WeaponName02; //  0x1658 Size(8)
	struct Unknown WeaponTitle01; //  0x1660 Size(8)
	struct Unknown WeaponTitle02; //  0x1668 Size(8)
	struct Unknown WidgetSwitcher_1; //  0x1670 Size(8)
	struct Unknown WidgetSwitcher_Rarity; //  0x1678 Size(8)
	struct Unknown WidgetSwitcher_SpecialWeapon; //  0x1680 Size(8)
	enum class Unknow WeaponType; //  0x1688 Size(1)
	int32_t SlotIndex; //  0x168c Size(4)
	struct Unknown WeaponBase; //  0x1690 Size(8)
	char bCanEquip; //  0x1698 Size(1)
	struct TMap<{}, {}>Unknown WeaponAttachmentSlots01; //  0x16a0 Size(50)
	struct TMap<{}, {}>Unknown WeaponAttachmentSlots02; //  0x16f0 Size(50)
	float WeaponIconHeight; //  0x1740 Size(4)
	char bHover; //  0x1744 Size(1)
	struct Unknown HoverWidget; //  0x1748 Size(8)
	int32_t NotifyAnimLoopNum; //  0x1750 Size(4)

	void IsEquipped(char& Return); // Function U.U.IsEquipped(Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown TextBlock_62; //  0x248 Size(8)

	void Init(struct FString Str); // Function U.U.Init(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Hide; //  0x250 Size(8)
	struct Unknown Rank; //  0x258 Size(8)
	struct Unknown RankUp; //  0x260 Size(8)
	struct Unknown Anim_Reward; //  0x268 Size(8)
	struct Unknown Arrow_3; //  0x270 Size(8)
	struct Unknown ArrowLine_3; //  0x278 Size(8)
	struct Unknown BottomLine_3; //  0x280 Size(8)
	struct Unknown BrightSpot_01; //  0x288 Size(8)
	struct Unknown BrightSpot_02; //  0x290 Size(8)
	struct Unknown BrightSpot_03; //  0x298 Size(8)
	struct Unknown BrightSpot_04; //  0x2a0 Size(8)
	struct Unknown BrightSpot_05; //  0x2a8 Size(8)
	struct Unknown Button_DeathCam_2; //  0x2b0 Size(8)
	struct Unknown Button_Exit; //  0x2b8 Size(8)
	struct Unknown Button_KillCam; //  0x2c0 Size(8)
	struct Unknown Button_Report; //  0x2c8 Size(8)
	struct Unknown Button_Spectate; //  0x2d0 Size(8)
	struct Unknown CanvasPanel_3; //  0x2d8 Size(8)
	struct Unknown CanvasPanel_9; //  0x2e0 Size(8)
	struct Unknown CanvasPanel_1174; //  0x2e8 Size(8)
	struct Unknown CanvasPanel_1384; //  0x2f0 Size(8)
	struct Unknown Glow1; //  0x2f8 Size(8)
	struct Unknown Glow2; //  0x300 Size(8)
	struct Unknown Glow3; //  0x308 Size(8)
	struct Unknown Glow_01; //  0x310 Size(8)
	struct Unknown GlowLine; //  0x318 Size(8)
	struct Unknown Gold; //  0x320 Size(8)
	struct Unknown Image_26; //  0x328 Size(8)
	struct Unknown Image_27; //  0x330 Size(8)
	struct Unknown Image_28; //  0x338 Size(8)
	struct Unknown Image_29; //  0x340 Size(8)
	struct Unknown Image_216; //  0x348 Size(8)
	struct Unknown Image_223; //  0x350 Size(8)
	struct Unknown Image_458; //  0x358 Size(8)
	struct Unknown Image_559; //  0x360 Size(8)
	struct Unknown Image_CurrentRANK; //  0x368 Size(8)
	struct Unknown Image_DownRANK; //  0x370 Size(8)
	struct Unknown Image_UpRANK; //  0x378 Size(8)
	struct Unknown L_Wing01; //  0x380 Size(8)
	struct Unknown L_Wing01_2; //  0x388 Size(8)
	struct Unknown L_Wing01_5; //  0x390 Size(8)
	struct Unknown L_Wing02; //  0x398 Size(8)
	struct Unknown L_Wing02_2; //  0x3a0 Size(8)
	struct Unknown L_Wing02_5; //  0x3a8 Size(8)
	struct Unknown L_Wing03; //  0x3b0 Size(8)
	struct Unknown L_Wing03_2; //  0x3b8 Size(8)
	struct Unknown L_Wing03_5; //  0x3c0 Size(8)
	struct Unknown L_WingLine; //  0x3c8 Size(8)
	struct Unknown L_WingLine_3; //  0x3d0 Size(8)
	struct Unknown Light_2; //  0x3d8 Size(8)
	struct Unknown Light_01; //  0x3e0 Size(8)
	struct Unknown Light_02; //  0x3e8 Size(8)
	struct Unknown Light_03; //  0x3f0 Size(8)
	struct Unknown Light_04; //  0x3f8 Size(8)
	struct Unknown Light_05; //  0x400 Size(8)
	struct Unknown Light_06; //  0x408 Size(8)
	struct Unknown Overlay; //  0x410 Size(8)
	struct Unknown Overlay_2; //  0x418 Size(8)
	struct Unknown Overlay_264; //  0x420 Size(8)
	struct Unknown Overlay_Report; //  0x428 Size(8)
	struct Unknown Overlay_Spectate; //  0x430 Size(8)
	struct Unknown R_Wing01; //  0x438 Size(8)
	struct Unknown R_Wing01_2; //  0x440 Size(8)
	struct Unknown R_Wing01_5; //  0x448 Size(8)
	struct Unknown R_Wing01_6; //  0x450 Size(8)
	struct Unknown R_Wing02; //  0x458 Size(8)
	struct Unknown R_Wing02_2; //  0x460 Size(8)
	struct Unknown R_Wing02_5; //  0x468 Size(8)
	struct Unknown R_Wing02_6; //  0x470 Size(8)
	struct Unknown R_Wing03; //  0x478 Size(8)
	struct Unknown R_Wing03_2; //  0x480 Size(8)
	struct Unknown R_Wing03_5; //  0x488 Size(8)
	struct Unknown R_Wing03_6; //  0x490 Size(8)
	struct Unknown R_WingLine; //  0x498 Size(8)
	struct Unknown R_WingLine_3; //  0x4a0 Size(8)
	struct Unknown Ribbon; //  0x4a8 Size(8)
	struct Unknown Ring; //  0x4b0 Size(8)
	struct Unknown RIng_Glow_01; //  0x4b8 Size(8)
	struct Unknown ScrollBox_2; //  0x4c0 Size(8)
	struct Unknown ScrollBox_199; //  0x4c8 Size(8)
	struct Unknown SizeBox_8; //  0x4d0 Size(8)
	struct Unknown Spacer_6018; //  0x4d8 Size(8)
	struct Unknown Spacer_6217; //  0x4e0 Size(8)
	struct Unknown Spacer_Center; //  0x4e8 Size(8)
	struct Unknown Spacer_Center_2; //  0x4f0 Size(8)
	struct Unknown T_RemainTime_2; //  0x4f8 Size(8)
	struct Unknown Text_Report; //  0x500 Size(8)
	struct Unknown TextBlock_3; //  0x508 Size(8)
	struct Unknown TextBlock_12; //  0x510 Size(8)
	struct Unknown TextBlock_13; //  0x518 Size(8)
	struct Unknown TextBlock_14; //  0x520 Size(8)
	struct Unknown TextBlock_25; //  0x528 Size(8)
	struct Unknown TextBlock_27; //  0x530 Size(8)
	struct Unknown TextBlock_1425; //  0x538 Size(8)
	struct Unknown TextBlock_2242; //  0x540 Size(8)
	struct Unknown TextBlock_2769; //  0x548 Size(8)
	struct Unknown TextBlock_3056; //  0x550 Size(8)
	struct Unknown TextBlock_LocalMatchRP; //  0x558 Size(8)
	struct Unknown TextGlow01; //  0x560 Size(8)
	struct Unknown TextGlow02; //  0x568 Size(8)
	struct Unknown TextGlow03; //  0x570 Size(8)
	struct Unknown TopLine_3; //  0x578 Size(8)
	struct Unknown U; //  0x580 Size(8)
	struct Unknown U_2; //  0x588 Size(8)
	struct Unknown U_3; //  0x590 Size(8)
	struct Unknown U_4; //  0x598 Size(8)
	struct Unknown U_5; //  0x5a0 Size(8)
	struct Unknown U_369; //  0x5a8 Size(8)
	struct Unknown U; //  0x5b0 Size(8)
	struct Unknown U; //  0x5b8 Size(8)
	struct Unknown VerticalBox_191; //  0x5c0 Size(8)
	struct Unknown WidgetSwitcher_2; //  0x5c8 Size(8)
	char MatchEnd; //  0x5d0 Size(1)
	struct Unknown AnimationData; //  0x5d1 Size(2)
	struct Unknown MatchEndWidgetRef; //  0x5d8 Size(8)
	struct Unknown SimpleResult; //  0x5e0 Size(a8)
	struct Unknown SimpleTimer; //  0x688 Size(8)
	char IsWinningCam; //  0x690 Size(1)
	struct Unknown StartSound; //  0x694 Size(4)
	struct Unknown GainGoldHandle; //  0x698 Size(8)
	struct Unknown GoldHandle; //  0x6a0 Size(8)
	struct Unknown FinalResultData; //  0x6a8 Size(4)
	int32_t RandomGold; //  0x6ac Size(4)
	int32_t GainGoldValue; //  0x6b0 Size(4)
	struct Unknown LocalWidget; //  0x6b8 Size(8)
	struct Unknown PlayerState; //  0x6c0 Size(8)
	struct Unknown Timehandle_Rank; //  0x6c8 Size(8)
	char Increase; //  0x6d0 Size(1)
	char bMaxPrograssbar; //  0x6d1 Size(1)
	int32_t CurrentRP; //  0x6d4 Size(4)
	int32_t PlayerOriRP; //  0x6d8 Size(4)
	int32_t TargetRP; //  0x6dc Size(4)
	int32_t NextTireRP; //  0x6e0 Size(4)
	int32_t CurrentTierID; //  0x6e4 Size(4)
	char IsGiveUp; //  0x6e8 Size(1)
	int32_t TempRank; //  0x6ec Size(4)
	int32_t TempKill; //  0x6f0 Size(4)
	int32_t TempHit; //  0x6f4 Size(4)
	int32_t TempSuvival; //  0x6f8 Size(4)
	int32_t SeasonRP; //  0x6fc Size(4)
	int32_t GainedRP; //  0x700 Size(4)
	int32_t AminRPText; //  0x704 Size(4)
	int32_t StartRP; //  0x708 Size(4)
	int32_t EndRP; //  0x70c Size(4)
	float ShowTime; //  0x710 Size(4)
	char IsTargetCameraKiller; //  0x714 Size(1)

	void SequenceEvent__ENTRYPOINTU_2(); // Function U.U.SequenceEvent__ENTRYPOINTU_2(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Anim_KillMessage; //  0x250 Size(8)
	struct Unknown Anim_RemoveCoreInfo; //  0x258 Size(8)
	struct Unknown Anim_AddCoreInfo; //  0x260 Size(8)
	struct Unknown HB_Smartping; //  0x268 Size(8)
	struct Unknown Img_Back; //  0x270 Size(8)
	struct Unknown Img_Back_2; //  0x278 Size(8)
	struct Unknown Img_MarkerIcon; //  0x280 Size(8)
	struct Unknown IMG_PerkDeckIcon; //  0x288 Size(8)
	struct Unknown NewRichText; //  0x290 Size(8)
	struct Unknown T_Damage; //  0x298 Size(8)
	struct Unknown T_DamageCauser; //  0x2a0 Size(8)
	struct Unknown T_DamageResult; //  0x2a8 Size(8)
	struct Unknown T_HeadShot; //  0x2b0 Size(8)
	struct Unknown T_HitCount; //  0x2b8 Size(8)
	struct Unknown T_HitType; //  0x2c0 Size(8)
	struct Unknown T_Message; //  0x2c8 Size(8)
	struct Unknown T_PingType; //  0x2d0 Size(8)
	struct Unknown T_PlayerName; //  0x2d8 Size(8)
	struct Unknown T_TargetClass; //  0x2e0 Size(8)
	struct Unknown T_TargetLevel; //  0x2e8 Size(8)
	struct Unknown T_TargetName; //  0x2f0 Size(8)
	struct Unknown T_TargetWeapon; //  0x2f8 Size(8)
	struct Unknown T_WeaponLevel; //  0x300 Size(8)
	struct Unknown WidgetSwitcher_194; //  0x308 Size(8)
	struct Unknown WidgetSwitcher_Main; //  0x310 Size(8)
	struct Unknown ParentWidgetRef; //  0x318 Size(8)
	struct Unknown Timer_StartRemove; //  0x320 Size(8)
	struct Unknown DamageLogInfo; //  0x328 Size(b58)
	float LogTime; //  0xe80 Size(4)
	float LogStackValidTime; //  0xe84 Size(4)

	void DamageResultText(struct FText& Result); // Function U.U.DamageResultText(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown EndQuest; //  0x250 Size(8)
	struct Unknown StartQuest; //  0x258 Size(8)
	struct Unknown Idle; //  0x260 Size(8)
	struct Unknown Bg; //  0x268 Size(8)
	struct Unknown Image_308; //  0x270 Size(8)
	struct Unknown Image_697; //  0x278 Size(8)
	struct Unknown Image_839; //  0x280 Size(8)
	struct Unknown TextBlock_QuestDesc; //  0x288 Size(8)
	struct Unknown TextBlock_QuestTitle; //  0x290 Size(8)
	struct Unknown U; //  0x298 Size(8)
	struct Unknown U_2; //  0x2a0 Size(8)
	struct Unknown U_94; //  0x2a8 Size(8)
	struct Unknown VerticalBox_Tasks; //  0x2b0 Size(8)
	struct Unknown QuestInfo; //  0x2b8 Size(30)
	struct Unknown QuestData; //  0x2e8 Size(58)
	char ActiveQuest; //  0x340 Size(1)
	struct TArray<Unknown> PendingQuestInfo; //  0x348 Size(10)

	void ConsumeQuestInfo(); // Function U.U.ConsumeQuestInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelReplayTimelineEventMarker {
	struct Unknown UberGraphFrame; //  0x290 Size(8)
	struct Unknown MarkerBorder; //  0x298 Size(8)

	void K2_SetKillEvent(char IsMyInfo); // Function U.U.K2_SetKillEvent(Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Button_Weapon; //  0x250 Size(8)
	struct Unknown HorizontalBox_Rarity; //  0x258 Size(8)
	struct Unknown Image_2; //  0x260 Size(8)
	struct Unknown Image_3; //  0x268 Size(8)
	struct Unknown Image_4; //  0x270 Size(8)
	struct Unknown Image_5; //  0x278 Size(8)
	struct Unknown Image_6; //  0x280 Size(8)
	struct Unknown Image_7; //  0x288 Size(8)
	struct Unknown Image_8; //  0x290 Size(8)
	struct Unknown Image_310; //  0x298 Size(8)
	struct Unknown Image_Item_Weapon; //  0x2a0 Size(8)
	struct Unknown Image_New; //  0x2a8 Size(8)
	struct Unknown T_Name; //  0x2b0 Size(8)
	struct Unknown WidgetSwitcher_Own; //  0x2b8 Size(8)
	struct Unknown ParentWidgetRef; //  0x2c0 Size(8)
	struct Unknown CraftingInfo; //  0x2c8 Size(128)
	struct TArray<Unknown> CraftMaterialItemIDList; //  0x3f0 Size(10)
	int32_t CraftMaterialWeaponID; //  0x400 Size(4)
	char IsOwn; //  0x404 Size(1)
	char IsOwnAny; //  0x405 Size(1)
	struct Unknown DefaultImage; //  0x408 Size(8)
	struct Unknown PressedDefaultImage; //  0x410 Size(8)
	char IsNew; //  0x418 Size(1)

	void SetNew(char IsNew); // Function U.U.SetNew(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelPersonalSupplyBoxSlotItemWidget {
	struct Unknown UberGraphFrame; //  0x3e8 Size(8)
	struct Unknown Over; //  0x3f0 Size(8)
	struct Unknown Bg; //  0x3f8 Size(8)
	struct Unknown CanvasPanel_2; //  0x400 Size(8)
	struct Unknown CanvasPanel_4; //  0x408 Size(8)
	struct Unknown Cont; //  0x410 Size(8)
	struct Unknown DropHoverImage; //  0x418 Size(8)
	struct Unknown Image; //  0x420 Size(8)
	struct Unknown Image_86; //  0x428 Size(8)
	struct Unknown Image_187; //  0x430 Size(8)
	struct Unknown Image_675; //  0x438 Size(8)
	struct Unknown Image_874; //  0x440 Size(8)
	struct Unknown ItemImage; //  0x448 Size(8)
	struct Unknown ItemName; //  0x450 Size(8)
	struct Unknown Lock; //  0x458 Size(8)
	struct Unknown Price_Value; //  0x460 Size(8)
	struct Unknown ProgressBar_65; //  0x468 Size(8)
	struct Unknown Repair; //  0x470 Size(8)
	struct Unknown WeaponName; //  0x478 Size(8)
	struct Unknown WeaponName_2; //  0x480 Size(8)
	struct Unknown WeaponName_3; //  0x488 Size(8)
	struct Unknown WidgetSwitcher_1; //  0x490 Size(8)
	struct Unknown DraggedWidget; //  0x498 Size(8)
	struct Unknown DragItemBrush; //  0x4a0 Size(88)
	char EnableDrag; //  0x528 Size(1)
	struct TSoftObjectPtr<Unknown> ItemIconImg; //  0x530 Size(28)
	struct FName AmmorKey; //  0x558 Size(8)
	struct FMulticastInlineDelegate OnHoverStateEventDispatcher; //  0x560 Size(10)
	struct FMulticastInlineDelegate OnRightClickEventDispatcher; //  0x570 Size(10)
	struct Unknown SaveKey; //  0x580 Size(18)
	int32_t ClickNum; //  0x598 Size(4)
	char RandomPerk; //  0x59c Size(1)

	struct Unknown OnMouseButtonUp(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonUp(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown ComboBoxString_Sort_2; //  0x250 Size(8)
	struct Unknown Down_2; //  0x258 Size(8)
	struct Unknown Image; //  0x260 Size(8)
	struct Unknown Img_BG; //  0x268 Size(8)
	struct Unknown Overlay_2; //  0x270 Size(8)
	struct Unknown SortText_2; //  0x278 Size(8)
	struct Unknown Up_2; //  0x280 Size(8)
	struct Unknown U; //  0x288 Size(8)
	struct Unknown U_2; //  0x290 Size(8)
	struct Unknown U_3; //  0x298 Size(8)
	struct Unknown VerticalBox_Category; //  0x2a0 Size(8)
	struct TMap<{}, {}>Unknown CategoryList; //  0x2a8 Size(50)
	struct TArray<Unknown> SortTypeList; //  0x2f8 Size(10)
	struct Unknown LastOpenedCategory; //  0x308 Size(8)
	char IsOwn; //  0x310 Size(1)
	char IsOwnAny; //  0x311 Size(1)
	int32_t CraftingID; //  0x314 Size(4)
	struct FText TextAll; //  0x318 Size(18)
	int32_t LanguageIndex; //  0x330 Size(4)

	void CheckLanguageIndex(); // Function U.U.CheckLanguageIndex(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Canvas_Recipe1; //  0x250 Size(8)
	struct Unknown Canvas_Recipe2; //  0x258 Size(8)
	struct Unknown U; //  0x260 Size(8)
	struct Unknown U_2; //  0x268 Size(8)
	struct Unknown U_3; //  0x270 Size(8)
	struct Unknown U_4; //  0x278 Size(8)
	struct Unknown U_5; //  0x280 Size(8)
	struct Unknown U_6; //  0x288 Size(8)
	struct Unknown U_7; //  0x290 Size(8)
	struct Unknown U_8; //  0x298 Size(8)
	struct Unknown U_9; //  0x2a0 Size(8)
	struct Unknown U_10; //  0x2a8 Size(8)
	struct Unknown U_11; //  0x2b0 Size(8)
	struct Unknown WidgetSwitcher_68; //  0x2b8 Size(8)
	struct TArray<Unknown> Recipe_ItemArray; //  0x2c0 Size(10)
	struct TArray<Unknown> Recipe_ItemArray2; //  0x2d0 Size(10)
	char HasWeapon; //  0x2e0 Size(1)
	struct Unknown ArmoryInputRef; //  0x2e8 Size(8)
	float CurrentOpacity; //  0x2f0 Size(4)

	void SetOpacity(); // Function U.U.SetOpacity(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelTeamInfoWidget {
	struct Unknown UberGraphFrame; //  0x258 Size(8)
	struct Unknown U; //  0x260 Size(8)
	struct Unknown U_2; //  0x268 Size(8)
	struct Unknown VerticalBox_InfoList; //  0x270 Size(8)

	struct Unknown CreateSlot(); // Function U.U.CreateSlot(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Button_43; //  0x250 Size(8)
	struct Unknown off; //  0x258 Size(8)
	struct Unknown On; //  0x260 Size(8)
	struct Unknown TextBlock_67; //  0x268 Size(8)
	struct FText Text; //  0x270 Size(18)

	void BndEvt__Button_42_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_42_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Anim_Show_classinfo; //  0x250 Size(8)
	struct Unknown Button_SpreadList; //  0x258 Size(8)
	struct Unknown Image_323; //  0x260 Size(8)
	struct Unknown U; //  0x268 Size(8)
	struct Unknown U_2; //  0x270 Size(8)
	struct Unknown U_3; //  0x278 Size(8)
	struct Unknown U_4; //  0x280 Size(8)
	struct Unknown U_5; //  0x288 Size(8)
	struct Unknown U_6; //  0x290 Size(8)
	struct Unknown U_7; //  0x298 Size(8)
	struct Unknown U_8; //  0x2a0 Size(8)
	struct Unknown U_9; //  0x2a8 Size(8)
	struct Unknown U_10; //  0x2b0 Size(8)
	struct Unknown U_11; //  0x2b8 Size(8)
	struct Unknown U_12; //  0x2c0 Size(8)
	struct Unknown VerticalBox_ClassBox; //  0x2c8 Size(8)
	struct Unknown VerticalBox_ClassList; //  0x2d0 Size(8)
	struct Unknown VerticalBox_; //  0x2d8 Size(8)
	struct Unknown VerticalBox_Main; //  0x2e0 Size(8)
	int32_t LastTableRow; //  0x2e8 Size(4)
	struct TMap<{}, {}>Unknown ClassInfoItemMap; //  0x2f0 Size(50)
	char ListVisibility; //  0x340 Size(1)

	void UpdateClassCount(); // Function U.U.UpdateClassCount(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown IMG_PerkLevelUpFx; //  0x250 Size(8)
	enum class Unknow PerkSlot; //  0x258 Size(1)
	struct Unknown PerkFxTexture; //  0x260 Size(8)
	char PlayAnimation_1; //  0x268 Size(1)
	float CurrentAnimationTime; //  0x26c Size(4)
	float AnimLastTime; //  0x270 Size(4)
	struct Unknown PerkFxMaterialInstance; //  0x278 Size(8)
	struct Unknown UltimatePerkFxTexture; //  0x280 Size(8)

	void InitFxInfo(); // Function U.U.InitFxInfo(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Img_Voice; //  0x250 Size(8)
	struct Unknown Img_VoiceX; //  0x258 Size(8)
	struct Unknown SizeBox_2; //  0x260 Size(8)
	struct Unknown TextBlock; //  0x268 Size(8)
	struct Unknown WidgetSwitcher_LogOut; //  0x270 Size(8)
	struct Unknown Timer; //  0x278 Size(8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Image; //  0x250 Size(8)
	struct Unknown Image_1; //  0x258 Size(8)
	struct Unknown Image_2; //  0x260 Size(8)
	struct Unknown Image_3; //  0x268 Size(8)
	struct Unknown Image_4; //  0x270 Size(8)
	struct Unknown Image_5; //  0x278 Size(8)
	struct Unknown Image_6; //  0x280 Size(8)
	struct Unknown Image_7; //  0x288 Size(8)
	struct Unknown Image_773; //  0x290 Size(8)
	struct Unknown WeaponSlot01; //  0x298 Size(8)
	struct Unknown WeaponSlot02; //  0x2a0 Size(8)
	struct Unknown WeaponSlot03; //  0x2a8 Size(8)
	struct Unknown WeaponSlot04; //  0x2b0 Size(8)
	struct Unknown WeaponSlot05; //  0x2b8 Size(8)
	struct TMap<{}, {}>Unknown WeaponSlots; //  0x2c0 Size(50)

	void ShowStatupAnim(struct Unknown& StatParams, enum class Unknow StatType); // Function U.U.ShowStatupAnim(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x3d8 Size(8)
	struct Unknown BT; //  0x3e0 Size(8)
	struct Unknown BT; //  0x3e8 Size(8)
	struct Unknown C; //  0x3f0 Size(8)
	struct Unknown IM; //  0x3f8 Size(8)
	struct Unknown IM; //  0x400 Size(8)
	struct Unknown IM; //  0x408 Size(8)
	struct Unknown IM; //  0x410 Size(8)
	struct Unknown IM; //  0x418 Size(8)
	struct Unknown IM; //  0x420 Size(8)
	struct Unknown Menu02; //  0x428 Size(8)
	struct Unknown Menu03; //  0x430 Size(8)
	struct Unknown Overlay_Mask; //  0x438 Size(8)
	struct Unknown TX; //  0x440 Size(8)
	struct Unknown TX; //  0x448 Size(8)
	struct Unknown TX; //  0x450 Size(8)
	struct Unknown TX; //  0x458 Size(8)
	struct Unknown TX; //  0x460 Size(8)

	void SetIconTexture(struct TSoftObjectPtr<Unknown> IconTexture); // Function U.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown Image_3; //  0x248 Size(8)
	struct Unknown IM; //  0x250 Size(8)
	struct Unknown IM; //  0x258 Size(8)
	struct Unknown IM; //  0x260 Size(8)
	struct Unknown U; //  0x268 Size(8)

	struct Unknown OnClose(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnClose(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelBroadcastingWidget {
	struct Unknown UberGraphFrame; //  0x258 Size(8)
	struct Unknown Anim_9WarningMessage; //  0x260 Size(8)
	struct Unknown Anim_10SupplyMessage; //  0x268 Size(8)
	struct Unknown Anim_8LevelUpMessage; //  0x270 Size(8)
	struct Unknown Anim_4GameStartMessage; //  0x278 Size(8)
	struct Unknown Anim_27Revival; //  0x280 Size(8)
	struct Unknown Anim_TeamKillWarning; //  0x288 Size(8)
	struct Unknown 0BlueZoneDesc; //  0x290 Size(8)
	struct Unknown 10SupplyMessage; //  0x298 Size(8)
	struct Unknown 11BroadcastMessage; //  0x2a0 Size(8)
	struct Unknown 12TeamKillWarning; //  0x2a8 Size(8)
	struct Unknown 13ActionDescription; //  0x2b0 Size(8)
	struct Unknown 14Action; //  0x2b8 Size(8)
	struct Unknown 15CastingMessage; //  0x2c0 Size(8)
	struct Unknown 16CastingCount; //  0x2c8 Size(8)
	struct Unknown 17CastingCancelInfo; //  0x2d0 Size(8)
	struct Unknown 18ActionMessage; //  0x2d8 Size(8)
	struct Unknown 19CoreInfo; //  0x2e0 Size(8)
	struct Unknown 1BlueZoneName; //  0x2e8 Size(8)
	struct Unknown 20ZeroingDistance; //  0x2f0 Size(8)
	struct Unknown 21PlayerReportInfo; //  0x2f8 Size(8)
	struct Unknown 22SpectatorCount; //  0x300 Size(8)
	struct Unknown 23PlayerInfo; //  0x308 Size(8)
	struct Unknown 24RoundOverInfo; //  0x310 Size(8)
	struct Unknown 25RoundOver; //  0x318 Size(8)
	struct Unknown 26GuideWidget; //  0x320 Size(8)
	struct Unknown 27Revival; //  0x328 Size(8)
	struct Unknown 28RequestMessageInfo_2; //  0x330 Size(8)
	struct Unknown 29EndResuscitated; //  0x338 Size(8)
	struct Unknown 2GameCountDown; //  0x340 Size(8)
	struct Unknown 30ItemCancelMessage; //  0x348 Size(8)
	struct Unknown 3GameCountDownNum; //  0x350 Size(8)
	struct Unknown 4GameStartMessage; //  0x358 Size(8)
	struct Unknown 5ChangeClassInfo; //  0x360 Size(8)
	struct Unknown 6KillMessage; //  0x368 Size(8)
	struct Unknown 7KillCount; //  0x370 Size(8)
	struct Unknown 8LevelUpMessage; //  0x378 Size(8)
	struct Unknown 9WarningMessage; //  0x380 Size(8)
	struct Unknown HUDList; //  0x388 Size(8)
	struct Unknown Image; //  0x390 Size(8)
	struct Unknown Image_1; //  0x398 Size(8)
	struct Unknown Image_2; //  0x3a0 Size(8)
	struct Unknown Image_4; //  0x3a8 Size(8)
	struct Unknown Image_5; //  0x3b0 Size(8)
	struct Unknown Image_8; //  0x3b8 Size(8)
	struct Unknown Image_248; //  0x3c0 Size(8)
	struct Unknown RichT_ResustingOwnerName; //  0x3c8 Size(8)
	struct Unknown ShowMessage; //  0x3d0 Size(8)
	struct Unknown U; //  0x3d8 Size(8)
	struct Unknown U_2; //  0x3e0 Size(8)
	struct Unknown U_243; //  0x3e8 Size(8)
	struct Unknown U; //  0x3f0 Size(8)
	struct Unknown U; //  0x3f8 Size(8)
	struct Unknown U; //  0x400 Size(8)
	struct TMap<{}, {}>Unknown LastPriority; //  0x408 Size(50)
	struct TArray<Unknown> ShowAnimList; //  0x458 Size(10)
	struct TArray<Unknown> HideAnimList; //  0x468 Size(10)
	float ShowAnimTime; //  0x478 Size(4)
	float HideAnimTime; //  0x47c Size(4)
	struct TMap<{}, {}>Unknown TimerList; //  0x480 Size(50)
	int32_t TeamKillWarningAnimLoopNum; //  0x4d0 Size(4)
	struct FText CheatMessage; //  0x4d8 Size(18)

	void GetMyKillCountMessageWidget(struct Unknown& KillCountWidget); // Function U.U.GetMyKillCountMessageWidget(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown Complete; //  0x248 Size(8)
	struct Unknown Image_161; //  0x250 Size(8)
	struct Unknown WidgetSwitcher_2; //  0x258 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown AdministratorPanel; //  0x250 Size(8)
	struct Unknown Cheat; //  0x258 Size(8)
	struct Unknown Image_Lock; //  0x260 Size(8)
	struct Unknown Image_Version; //  0x268 Size(8)
	struct Unknown ReplayListItemBtn_; //  0x270 Size(8)
	struct Unknown TextBlock_BattleMode; //  0x278 Size(8)
	struct Unknown TextBlock_Day; //  0x280 Size(8)
	struct Unknown TextBlock_FileSize; //  0x288 Size(8)
	struct Unknown TextBlock_FPP; //  0x290 Size(8)
	struct Unknown TextBlock_MapName; //  0x298 Size(8)
	struct Unknown TextBlock_Month; //  0x2a0 Size(8)
	struct Unknown TextBlock_PlayerRank; //  0x2a8 Size(8)
	struct Unknown TextBlock_PlayTime; //  0x2b0 Size(8)
	struct Unknown TextBlock_Time; //  0x2b8 Size(8)
	struct Unknown TextBlock_TotalCount; //  0x2c0 Size(8)
	struct Unknown TextBlock_TotalPlayerCount; //  0x2c8 Size(8)
	struct Unknown TextBlock_Year; //  0x2d0 Size(8)
	struct FMulticastInlineDelegate Click; //  0x2d8 Size(10)
	struct Unknown ReplayItemInfo; //  0x2e8 Size(128)
	struct Unknown Style; //  0x410 Size(278)
	struct Unknown ReplayListWidget; //  0x688 Size(8)

	void GetBattleModeString(int32_t Idx, struct FText& Str); // Function U.U.GetBattleModeString(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelMainWidget {
	struct Unknown UberGraphFrame; //  0x450 Size(8)
	struct Unknown Anim_HideWidget; //  0x458 Size(8)
	struct Unknown HideLaserPoint; //  0x460 Size(8)
	struct Unknown ShowLaserPoint; //  0x468 Size(8)
	struct Unknown BackgroundBlur_154; //  0x470 Size(8)
	struct Unknown Canvas; //  0x478 Size(8)
	struct Unknown HB_PerkSpin; //  0x480 Size(8)
	struct Unknown RedCircle; //  0x488 Size(8)
	struct Unknown TextBlock_Start; //  0x490 Size(8)
	struct Unknown U; //  0x498 Size(8)
	struct Unknown U; //  0x4a0 Size(8)
	struct Unknown U; //  0x4a8 Size(8)
	struct Unknown U; //  0x4b0 Size(8)
	struct Unknown U; //  0x4b8 Size(8)
	struct Unknown U; //  0x4c0 Size(8)
	struct Unknown U; //  0x4c8 Size(8)
	struct Unknown TargetPawn; //  0x4d0 Size(8)
	struct Unknown Last; //  0x4d8 Size(c)
	struct TArray<Unknown> GainPerkPopups; //  0x4e8 Size(10)
	struct Unknown U; //  0x4f8 Size(8)
	struct Unknown U; //  0x500 Size(8)
	struct Unknown Timer_IsMouseWidgetInMap; //  0x508 Size(8)
	struct Unknown U; //  0x510 Size(8)
	char bIsShow; //  0x518 Size(1)
	float TmpViewportUpAngle; //  0x51c Size(4)
	float TmpViewportSideAngle; //  0x520 Size(4)
	struct Unknown CenterPosition; //  0x524 Size(8)
	struct Unknown U; //  0x530 Size(8)
	struct Unknown Timer_AutoPerkDeck; //  0x538 Size(8)
	int32_t LastPlayZoneID; //  0x540 Size(4)
	char bShowLevelUp; //  0x544 Size(1)
	char IsPlayingUltimateSound; //  0x545 Size(1)
	char bIsUnlockUltimateSkill; //  0x546 Size(1)

	void HideSkillMouseCursor(); // Function U.U.HideSkillMouseCursor(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Fade_in_Black_Bg; //  0x250 Size(8)
	struct Unknown Anim_ShowPerk; //  0x258 Size(8)
	struct Unknown Image_319; //  0x260 Size(8)
	struct Unknown Img_Opened; //  0x268 Size(8)
	struct Unknown T_Desc; //  0x270 Size(8)
	struct Unknown T_Name; //  0x278 Size(8)
	struct Unknown U; //  0x280 Size(8)
	struct Unknown RarityBGMaterialInstance; //  0x288 Size(8)
	float CurrentAnim; //  0x290 Size(4)

	void SetItemOption(struct Unknown& ItemOption); // Function U.U.SetItemOption(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelScopeWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown CanvasPanel_1; //  0x250 Size(8)
	struct Unknown Image_19; //  0x258 Size(8)
	struct Unknown Image_20; //  0x260 Size(8)
	struct Unknown Image_21; //  0x268 Size(8)
	struct Unknown Image_22; //  0x270 Size(8)
	struct Unknown Image_23; //  0x278 Size(8)
	struct Unknown Image_24; //  0x280 Size(8)
	struct Unknown WidgetSwitcher_167; //  0x288 Size(8)
	struct Unknown NewVar_1; //  0x290 Size(8)

	void SetScopeImageAngle(float NewAngle); // Function U.U.SetScopeImageAngle(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelGameMatchEndWidget {
	struct Unknown UberGraphFrame; //  0x360 Size(8)
	struct Unknown U; //  0x368 Size(8)
	struct Unknown U; //  0x370 Size(8)
	struct Unknown UW_SimpleResult; //  0x378 Size(8)
	struct Unknown MainWidgetRef; //  0x380 Size(8)
	struct Unknown PlayerHUDRef; //  0x388 Size(8)
	struct Unknown UW_FinalResult; //  0x390 Size(8)
	struct Unknown UW_Animation; //  0x398 Size(8)
	struct Unknown PlayerControllerRef; //  0x3a0 Size(8)
	char NewResult; //  0x3a8 Size(1)
	struct Unknown ResultData; //  0x3a9 Size(4)
	char IsGiveUp; //  0x3ad Size(1)
	float WinMatchEndResultShowTime; //  0x3b0 Size(4)
	struct Unknown ResultMatchEndAnimation; //  0x3b4 Size(2)

	char IsVisibleMatchEndWidget(); // Function U.U.IsVisibleMatchEndWidget(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Button_OK; //  0x250 Size(8)
	struct Unknown Image_337; //  0x258 Size(8)
	struct Unknown Image_581; //  0x260 Size(8)
	struct Unknown Image_583; //  0x268 Size(8)
	struct Unknown Image_584; //  0x270 Size(8)
	struct Unknown Slider_Gamma; //  0x278 Size(8)
	struct Unknown TextBlock_Gamma; //  0x280 Size(8)
	struct Unknown Game; //  0x288 Size(8)
	float Gamma; //  0x290 Size(4)
	struct FText Gamma; //  0x298 Size(18)
	struct FMulticastInlineDelegate ClosedWidget; //  0x2b0 Size(10)

	void Refresh(); // Function U.U.Refresh(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelRoutePingWidget {
	struct Unknown Anim_OnShow; //  0x248 Size(8)
	struct Unknown Line; //  0x250 Size(8)
	struct FMulticastInlineDelegate OnMarkerClicked; //  0x258 Size(10)
	char IsLastPoint; //  0x268 Size(1)

	void SetG(); // Function U.U.SetG(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown Image_112; //  0x248 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelPopupWidget {
	struct Unknown UberGraphFrame; //  0x268 Size(8)
	struct Unknown Bg; //  0x270 Size(8)
	struct Unknown btn_Cancel; //  0x278 Size(8)
	struct Unknown btn_OK; //  0x280 Size(8)
	struct Unknown Desc; //  0x288 Size(8)
	struct Unknown Image_2; //  0x290 Size(8)
	struct Unknown Overlay; //  0x298 Size(8)
	struct Unknown Overlay_1; //  0x2a0 Size(8)
	struct Unknown Overlay_2; //  0x2a8 Size(8)
	struct Unknown RichTextBlock_244; //  0x2b0 Size(8)
	struct Unknown TextBlock_17; //  0x2b8 Size(8)
	struct Unknown Throbber_159; //  0x2c0 Size(8)
	struct Unknown Title; //  0x2c8 Size(8)
	struct Unknown WidgetSwitcher_1; //  0x2d0 Size(8)
	struct FName MapNameToExit; //  0x2d8 Size(8)
	char IsExitGame; //  0x2e0 Size(1)
	struct Unknown ControllerRef; //  0x2e8 Size(8)
	char IsTutorial; //  0x2f0 Size(1)
	char IsDeathCam; //  0x2f1 Size(1)
	struct FMulticastInlineDelegate EventDispatcher_Mov; //  0x2f8 Size(10)
	char ErrorType; //  0x308 Size(1)
	char IsPerkDeckSelectMode; //  0x309 Size(1)
	struct FMulticastInlineDelegate EventDispatcher_TrySelectMode; //  0x310 Size(10)
	char OkayType; //  0x320 Size(1)

	void SetOptionChangedFromBenchmark(); // Function U.U.SetOptionChangedFromBenchmark(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelGameBuffSlot {
	struct Unknown UberGraphFrame; //  0x2f8 Size(8)
	struct Unknown Anim_Boost_Off; //  0x300 Size(8)
	struct Unknown Anim_Boost_On; //  0x308 Size(8)
	struct Unknown CanvasPanel_BoostInfo; //  0x310 Size(8)
	struct Unknown Image_Active; //  0x318 Size(8)
	struct Unknown IMG_CoolTime; //  0x320 Size(8)
	struct Unknown T_CoolTime; //  0x328 Size(8)
	struct Unknown MI_CoolTimeDynamicInstance; //  0x330 Size(8)
	struct Unknown MI_BuffActive; //  0x338 Size(8)
	float BoostOffAnimTime; //  0x340 Size(4)
	char IsActive; //  0x344 Size(1)
	struct Unknown BoostBuffInfo; //  0x348 Size(188)

	void SetIsActive(char bActive); // Function U.U.SetIsActive(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown Image; //  0x248 Size(8)
	struct Unknown Image_2; //  0x250 Size(8)
	struct Unknown Image_3; //  0x258 Size(8)
	struct Unknown Image_4; //  0x260 Size(8)
	struct Unknown Image_5; //  0x268 Size(8)
	struct Unknown Image_6; //  0x270 Size(8)
	struct Unknown Image_7; //  0x278 Size(8)
	struct Unknown Image_8; //  0x280 Size(8)
	struct Unknown Image_9; //  0x288 Size(8)
	struct Unknown Image_106; //  0x290 Size(8)
	struct Unknown T_Accuracy; //  0x298 Size(8)
	struct Unknown T_EffectiveRange; //  0x2a0 Size(8)
	struct Unknown T_FireRate; //  0x2a8 Size(8)
	struct Unknown T_MagSize; //  0x2b0 Size(8)
	struct Unknown T_Power; //  0x2b8 Size(8)

	void SetWeaponStat(struct Unknown& WeaponInfo); // Function U.U.SetWeaponStat(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown NewAnimation_2; //  0x250 Size(8)
	struct Unknown BackgroundBlur_1; //  0x258 Size(8)
	struct Unknown Blur; //  0x260 Size(8)
	struct Unknown CanvasPanel_1; //  0x268 Size(8)
	struct Unknown Focus; //  0x270 Size(8)
	struct Unknown FocusPanel; //  0x278 Size(8)
	struct Unknown Lobby; //  0x280 Size(8)
	struct Unknown U; //  0x288 Size(8)
	struct Unknown U; //  0x290 Size(8)
	struct Unknown U; //  0x298 Size(8)
	struct Unknown U; //  0x2a0 Size(8)
	struct Unknown U; //  0x2a8 Size(8)
	struct Unknown U; //  0x2b0 Size(8)
	struct Unknown NormalTextColor; //  0x2b8 Size(28)
	struct Unknown HoverTextColor; //  0x2e0 Size(28)
	struct Unknown LobbyWidgetRef; //  0x308 Size(8)
	struct Unknown NormalSelectedTextColor; //  0x310 Size(28)
	struct Unknown HoverSelectedTextColor; //  0x338 Size(28)
	struct Unknown NormalOptionButtonColor; //  0x360 Size(10)
	struct Unknown HoverOptionButtonColor; //  0x370 Size(10)
	struct Unknown MatchingPopupTimerHandle; //  0x380 Size(8)
	struct Unknown PopupKey; //  0x388 Size(18)
	char bExitPopupOpen; //  0x3a0 Size(1)
	char bOptionPopupOpen; //  0x3a1 Size(1)
	char BattleMode; //  0x3a2 Size(1)
	struct Unknown LobbyCoherentSprite; //  0x3a8 Size(8)
	struct Unknown SettingWidget; //  0x3b0 Size(8)
	struct Unknown LobbySound; //  0x3b8 Size(8)
	struct FString CurrentTab; //  0x3c0 Size(10)
	struct Unknown U; //  0x3d0 Size(8)
	struct Unknown LobbyCoherent2DTexture; //  0x3d8 Size(8)

	void EndCraft(); // Function U.U.EndCraft(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown HoverBG; //  0x250 Size(8)
	struct Unknown ScrollBox_1; //  0x258 Size(8)
	struct Unknown W; //  0x260 Size(8)

	void DragLeave(struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.DragLeave(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown HorizontalBox_Rarity; //  0x250 Size(8)
	struct Unknown HorizontalBox_Rarity_NotOwn; //  0x258 Size(8)
	struct Unknown Image_310; //  0x260 Size(8)
	struct Unknown Image_Weapon_6Grade_bg; //  0x268 Size(8)
	struct Unknown Img_Icon; //  0x270 Size(8)
	struct Unknown RetainerBox_2; //  0x278 Size(8)
	struct Unknown T_CurrentCount; //  0x280 Size(8)
	struct Unknown T_Level; //  0x288 Size(8)
	struct Unknown T_MaxCount; //  0x290 Size(8)
	struct Unknown WidgetSwitcher_Rarity; //  0x298 Size(8)
	int32_t ItemWeaponID; //  0x2a0 Size(4)
	struct Unknown WeaponInfo; //  0x2a8 Size(b30)
	struct Unknown WeaponItemInfo; //  0xdd8 Size(98)
	int32_t CurrentCount; //  0xe70 Size(4)

	void SetOwnInfo(); // Function U.U.SetOwnInfo(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x3d8 Size(8)
	struct Unknown BT; //  0x3e0 Size(8)
	struct Unknown BT; //  0x3e8 Size(8)
	struct Unknown BT; //  0x3f0 Size(8)
	struct Unknown C; //  0x3f8 Size(8)
	struct Unknown IM; //  0x400 Size(8)
	struct Unknown IM; //  0x408 Size(8)
	struct Unknown IM; //  0x410 Size(8)
	struct Unknown IM; //  0x418 Size(8)
	struct Unknown IM; //  0x420 Size(8)
	struct Unknown IM; //  0x428 Size(8)
	struct Unknown Menu02; //  0x430 Size(8)
	struct Unknown Menu03; //  0x438 Size(8)
	struct Unknown Menu04; //  0x440 Size(8)
	struct Unknown Overlay_Mask; //  0x448 Size(8)
	struct Unknown TX; //  0x450 Size(8)
	struct Unknown TX; //  0x458 Size(8)
	struct Unknown TX; //  0x460 Size(8)
	struct Unknown TX; //  0x468 Size(8)
	struct Unknown TX; //  0x470 Size(8)
	struct Unknown TX; //  0x478 Size(8)
	struct Unknown TX; //  0x480 Size(8)
	struct FText PerkSlot; //  0x488 Size(18)

	void SetIconTexture(struct TSoftObjectPtr<Unknown> IconTexture); // Function U.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelPlayerMarkerWidget {
	struct Unknown Image_SupplyBoxMarker; //  0x248 Size(8)
	struct Unknown PersonalSupplyBox; //  0x250 Size(8)
	struct Unknown WidgetSwitcher_2; //  0x258 Size(8)
	struct FMulticastInlineDelegate OnMarkerClicked; //  0x260 Size(10)
	struct Unknown CurrentMarker; //  0x270 Size(8)
	struct Unknown MapCompRef; //  0x278 Size(8)
	struct Unknown TmpPingTypeTexture; //  0x280 Size(8)

	void UpdatePersonalSupplyBox(); // Function U.U.UpdatePersonalSupplyBox(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Character_BG_Motion; //  0x250 Size(8)
	struct Unknown Image_308; //  0x258 Size(8)
	struct Unknown ScrollBox_KeepedList; //  0x260 Size(8)
	struct Unknown SizeBox_KeepedList; //  0x268 Size(8)
	struct Unknown PlayerController; //  0x270 Size(8)
	float SlotMaxHeight; //  0x278 Size(4)

	void UpdateSlotMaxSize(int32_t SlotNum); // Function U.U.UpdateSlotMaxSize(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelAttackDamageWidget {
	struct Unknown FadeOut; //  0x3a0 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelMapCompWidget {
	struct Unknown UberGraphFrame; //  0x500 Size(8)
	struct Unknown Aircraft; //  0x508 Size(8)
	struct Unknown Background; //  0x510 Size(8)
	struct Unknown Canvas; //  0x518 Size(8)
	struct Unknown InvalidationBox_1; //  0x520 Size(8)
	struct Unknown Test_2; //  0x528 Size(8)
	struct Unknown Test_2; //  0x530 Size(8)
	struct Unknown TestLineRouteDotline_2; //  0x538 Size(8)
	int32_t MapDisplayInfoFlag; //  0x540 Size(4)
	struct FMulticastInlineDelegate OnWheelOnMap; //  0x548 Size(10)
	struct FMulticastInlineDelegate OnMouseButtonUpOnMap; //  0x558 Size(10)
	struct FMulticastInlineDelegate OnObjectClickOnMap; //  0x568 Size(10)
	struct FMulticastInlineDelegate OnDragginOnMap; //  0x578 Size(10)
	char IsDragging; //  0x588 Size(1)
	float DeltaValue; //  0x58c Size(4)
	struct TArray<Unknown> GridString_XAxis; //  0x590 Size(10)
	struct TArray<Unknown> GridString_YAxis; //  0x5a0 Size(10)
	struct Unknown PersonalSupplyBoxRef; //  0x5b0 Size(8)
	struct Unknown ReplayFreeCamWidget; //  0x5b8 Size(8)
	float MapScaleInterpSpeed; //  0x5c0 Size(4)
	char MouseRightBtnDown; //  0x5c4 Size(1)
	struct Unknown SelectPingMenuTimer; //  0x5c8 Size(8)
	struct Unknown SelectionMenu; //  0x5d0 Size(8)
	struct FMulticastInlineDelegate OnMouseButtonDownOnMap; //  0x5d8 Size(10)
	struct Unknown MouseButtonDownPos; //  0x5e8 Size(8)
	char IsUpdateMapScale; //  0x5f0 Size(1)
	float MapScaleInerpSpeedRatio; //  0x5f4 Size(4)
	char IsDrawingRoutePing; //  0x5f8 Size(1)
	struct TArray<Unknown> IgnoreAreaCircleLines; //  0x600 Size(10)

	void CheckAgreePing(char& bRet, struct Unknown& Location); // Function U.U.CheckAgreePing(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Anim_Show; //  0x250 Size(8)
	struct Unknown Border; //  0x258 Size(8)
	struct Unknown Border_51; //  0x260 Size(8)
	struct Unknown btn_All_OK; //  0x268 Size(8)
	struct Unknown btn_Close; //  0x270 Size(8)
	struct Unknown HorizontalBox_CloseButton; //  0x278 Size(8)
	struct Unknown Image_2; //  0x280 Size(8)
	struct Unknown U; //  0x288 Size(8)
	struct Unknown U_2; //  0x290 Size(8)
	struct Unknown U_3; //  0x298 Size(8)
	struct Unknown U; //  0x2a0 Size(8)
	struct Unknown U; //  0x2a8 Size(8)
	struct Unknown WidgetSwitcher_90; //  0x2b0 Size(8)
	struct TArray<Unknown> OpenedOptionList; //  0x2b8 Size(10)

	void OnClosePerkPopup(); // Function U.U.OnClosePerkPopup(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Anim_TextBg; //  0x250 Size(8)
	struct Unknown HorizontalBox_Damage; //  0x258 Size(8)
	struct Unknown Image_145; //  0x260 Size(8)
	struct Unknown Image_155; //  0x268 Size(8)
	struct Unknown T_StatName; //  0x270 Size(8)
	struct Unknown T_Value; //  0x278 Size(8)
	struct FText Text_StatName; //  0x280 Size(18)

	void SetStatValue(int32_t Type, float Value); // Function U.U.SetStatValue(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown ShowAnim; //  0x248 Size(8)
	struct Unknown U; //  0x250 Size(8)
	struct Unknown WidgetSwitcher_53; //  0x258 Size(8)
	int32_t Gold; //  0x260 Size(4)
	struct TArray<Unknown> WeaponList; //  0x268 Size(10)
	struct TArray<Unknown> MaterialList; //  0x278 Size(10)
	struct TArray<Unknown> ItemWeaponIDList; //  0x288 Size(10)
	struct TArray<Unknown> LastItemWeaponIDList; //  0x298 Size(10)
	struct TArray<Unknown> NewWeaponList; //  0x2a8 Size(10)
	struct TArray<Unknown> MaterialIDList; //  0x2b8 Size(10)
	struct TArray<Unknown> LastMaterialIDList; //  0x2c8 Size(10)
	struct TArray<Unknown> NewMaterialList; //  0x2d8 Size(10)
	struct TArray<Unknown> NewCraftIDList; //  0x2e8 Size(10)
	struct Unknown CraftWeaponInfo; //  0x2f8 Size(c0)
	struct FString MainTabName; //  0x3b8 Size(10)
	struct FString ArmoryTabName; //  0x3c8 Size(10)
	char bNeedCheckWeaponList; //  0x3d8 Size(1)
	char bNeedCheckMaterialList; //  0x3d9 Size(1)

	void NotifyNewItemToCoh(); // Function U.U.NotifyNewItemToCoh(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Armory_Repair_M; //  0x250 Size(8)
	struct Unknown Armory_Strengthen_M; //  0x258 Size(8)
	struct Unknown Armory_Failed_M; //  0x260 Size(8)
	struct Unknown Armory_Break_M; //  0x268 Size(8)
	struct Unknown Armory_Failed_Break_M; //  0x270 Size(8)
	struct Unknown Armory_Failed_Down_M; //  0x278 Size(8)
	struct Unknown Armory_Awesome_M; //  0x280 Size(8)
	struct Unknown Armory_Success_M; //  0x288 Size(8)
	struct Unknown Armory_Awesome; //  0x290 Size(8)
	struct Unknown Armory_Break; //  0x298 Size(8)
	struct Unknown Armory_Failed; //  0x2a0 Size(8)
	struct Unknown Armory_Failed_Break; //  0x2a8 Size(8)
	struct Unknown Armory_Failed_Down; //  0x2b0 Size(8)
	struct Unknown Armory_Repair; //  0x2b8 Size(8)
	struct Unknown Armory_Strengthen; //  0x2c0 Size(8)
	struct Unknown Armory_Success; //  0x2c8 Size(8)
	struct Unknown Awesome_Damage1; //  0x2d0 Size(8)
	struct Unknown Awesome_Damage2; //  0x2d8 Size(8)
	struct Unknown Awesome_ItemName; //  0x2e0 Size(8)
	struct Unknown Awesome_Level1; //  0x2e8 Size(8)
	struct Unknown Awesome_Level2; //  0x2f0 Size(8)
	struct Unknown Awesome_MagSize1; //  0x2f8 Size(8)
	struct Unknown Awesome_MagSize2; //  0x300 Size(8)
	struct Unknown Awesome_Spread1; //  0x308 Size(8)
	struct Unknown Awesome_Spread2; //  0x310 Size(8)
	struct Unknown Awesome_UpLevel; //  0x318 Size(8)
	struct Unknown Break_Count; //  0x320 Size(8)
	struct Unknown Break_ItemName; //  0x328 Size(8)
	struct Unknown BreakTitle; //  0x330 Size(8)
	struct Unknown Button_1; //  0x338 Size(8)
	struct Unknown Button_2; //  0x340 Size(8)
	struct Unknown Button_228; //  0x348 Size(8)
	struct Unknown Button_230; //  0x350 Size(8)
	struct Unknown Button_232; //  0x358 Size(8)
	struct Unknown Button_233; //  0x360 Size(8)
	struct Unknown Button_EnchanceCancle; //  0x368 Size(8)
	struct Unknown Button_Enhance; //  0x370 Size(8)
	struct Unknown Button_Fatigue; //  0x378 Size(8)
	struct Unknown Empty; //  0x380 Size(8)
	struct Unknown FB_Damage1; //  0x388 Size(8)
	struct Unknown FB_Damage2; //  0x390 Size(8)
	struct Unknown FB_Level1; //  0x398 Size(8)
	struct Unknown FB_Level2; //  0x3a0 Size(8)
	struct Unknown FB_MagSize1; //  0x3a8 Size(8)
	struct Unknown FB_MagSize2; //  0x3b0 Size(8)
	struct Unknown FB_Spread1; //  0x3b8 Size(8)
	struct Unknown FB_Spread2; //  0x3c0 Size(8)
	struct Unknown FD_Damage1; //  0x3c8 Size(8)
	struct Unknown FD_Damage2; //  0x3d0 Size(8)
	struct Unknown FD_DownLevel; //  0x3d8 Size(8)
	struct Unknown FD_Level1; //  0x3e0 Size(8)
	struct Unknown FD_Level2; //  0x3e8 Size(8)
	struct Unknown FD_MagSize1; //  0x3f0 Size(8)
	struct Unknown FD_MagSize2; //  0x3f8 Size(8)
	struct Unknown FD_Spread1; //  0x400 Size(8)
	struct Unknown FD_Spread2; //  0x408 Size(8)
	struct Unknown HorizontalBox_Awesome_Damage; //  0x410 Size(8)
	struct Unknown HorizontalBox_Awesome_MagSize; //  0x418 Size(8)
	struct Unknown HorizontalBox_Awesome_Spread; //  0x420 Size(8)
	struct Unknown HorizontalBox_FB_Damage; //  0x428 Size(8)
	struct Unknown HorizontalBox_FB_MagSize; //  0x430 Size(8)
	struct Unknown HorizontalBox_FB_Spread; //  0x438 Size(8)
	struct Unknown HorizontalBox_FD_Damage; //  0x440 Size(8)
	struct Unknown HorizontalBox_FD_MasSize; //  0x448 Size(8)
	struct Unknown HorizontalBox_FD_Spread; //  0x450 Size(8)
	struct Unknown HorizontalBox_Strengthen_Damage; //  0x458 Size(8)
	struct Unknown HorizontalBox_Strengthen_MagSize; //  0x460 Size(8)
	struct Unknown HorizontalBox_Strengthen_Spread; //  0x468 Size(8)
	struct Unknown HorizontalBox_Success_Damage; //  0x470 Size(8)
	struct Unknown HorizontalBox_Success_Durable; //  0x478 Size(8)
	struct Unknown HorizontalBox_Success_Fatigue; //  0x480 Size(8)
	struct Unknown HorizontalBox_Success_MagSize; //  0x488 Size(8)
	struct Unknown HorizontalBox_Success_Spread; //  0x490 Size(8)
	struct Unknown Image; //  0x498 Size(8)
	struct Unknown Image_2; //  0x4a0 Size(8)
	struct Unknown Image_3; //  0x4a8 Size(8)
	struct Unknown Image_4; //  0x4b0 Size(8)
	struct Unknown Image_8; //  0x4b8 Size(8)
	struct Unknown Image_14; //  0x4c0 Size(8)
	struct Unknown Image_15; //  0x4c8 Size(8)
	struct Unknown Image_16; //  0x4d0 Size(8)
	struct Unknown Image_17; //  0x4d8 Size(8)
	struct Unknown Image_18; //  0x4e0 Size(8)
	struct Unknown Image_20; //  0x4e8 Size(8)
	struct Unknown Image_27; //  0x4f0 Size(8)
	struct Unknown Image_167; //  0x4f8 Size(8)
	struct Unknown Image_501; //  0x500 Size(8)
	struct Unknown Image_503; //  0x508 Size(8)
	struct Unknown Image_817; //  0x510 Size(8)
	struct Unknown Image_820; //  0x518 Size(8)
	struct Unknown Image_821; //  0x520 Size(8)
	struct Unknown Image_822; //  0x528 Size(8)
	struct Unknown Image_823; //  0x530 Size(8)
	struct Unknown Image_824; //  0x538 Size(8)
	struct Unknown Image_825; //  0x540 Size(8)
	struct Unknown Image_826; //  0x548 Size(8)
	struct Unknown Image_827; //  0x550 Size(8)
	struct Unknown Image_828; //  0x558 Size(8)
	struct Unknown Image_829; //  0x560 Size(8)
	struct Unknown Image_830; //  0x568 Size(8)
	struct Unknown Image_831; //  0x570 Size(8)
	struct Unknown Image_832; //  0x578 Size(8)
	struct Unknown Image_833; //  0x580 Size(8)
	struct Unknown Image_834; //  0x588 Size(8)
	struct Unknown Image_835; //  0x590 Size(8)
	struct Unknown Image_836; //  0x598 Size(8)
	struct Unknown Image_837; //  0x5a0 Size(8)
	struct Unknown Image_838; //  0x5a8 Size(8)
	struct Unknown Image_839; //  0x5b0 Size(8)
	struct Unknown Image_840; //  0x5b8 Size(8)
	struct Unknown Image_841; //  0x5c0 Size(8)
	struct Unknown Image_842; //  0x5c8 Size(8)
	struct Unknown Image_843; //  0x5d0 Size(8)
	struct Unknown Image_845; //  0x5d8 Size(8)
	struct Unknown Image_846; //  0x5e0 Size(8)
	struct Unknown Image_847; //  0x5e8 Size(8)
	struct Unknown Image_848; //  0x5f0 Size(8)
	struct Unknown Image_849; //  0x5f8 Size(8)
	struct Unknown Image_850; //  0x600 Size(8)
	struct Unknown Image_851; //  0x608 Size(8)
	struct Unknown Image_852; //  0x610 Size(8)
	struct Unknown Image_853; //  0x618 Size(8)
	struct Unknown Image_854; //  0x620 Size(8)
	struct Unknown Image_855; //  0x628 Size(8)
	struct Unknown Image_856; //  0x630 Size(8)
	struct Unknown Image_857; //  0x638 Size(8)
	struct Unknown Image_858; //  0x640 Size(8)
	struct Unknown Image_859; //  0x648 Size(8)
	struct Unknown Image_860; //  0x650 Size(8)
	struct Unknown Image_861; //  0x658 Size(8)
	struct Unknown Image_862; //  0x660 Size(8)
	struct Unknown Image_863; //  0x668 Size(8)
	struct Unknown Image_864; //  0x670 Size(8)
	struct Unknown Image_865; //  0x678 Size(8)
	struct Unknown Image_866; //  0x680 Size(8)
	struct Unknown Image_867; //  0x688 Size(8)
	struct Unknown Image_868; //  0x690 Size(8)
	struct Unknown Image_921; //  0x698 Size(8)
	struct Unknown Image_1264; //  0x6a0 Size(8)
	struct Unknown Image_1266; //  0x6a8 Size(8)
	struct Unknown Image_1269; //  0x6b0 Size(8)
	struct Unknown Image_1270; //  0x6b8 Size(8)
	struct Unknown Image_1271; //  0x6c0 Size(8)
	struct Unknown Image_1272; //  0x6c8 Size(8)
	struct Unknown Image_1273; //  0x6d0 Size(8)
	struct Unknown Image_1277; //  0x6d8 Size(8)
	struct Unknown Image_1278; //  0x6e0 Size(8)
	struct Unknown Image_1279; //  0x6e8 Size(8)
	struct Unknown Image_1280; //  0x6f0 Size(8)
	struct Unknown Image_1284; //  0x6f8 Size(8)
	struct Unknown Image_1285; //  0x700 Size(8)
	struct Unknown Image_1318; //  0x708 Size(8)
	struct Unknown Image_1319; //  0x710 Size(8)
	struct Unknown Image_1320; //  0x718 Size(8)
	struct Unknown Image_1321; //  0x720 Size(8)
	struct Unknown Image_1322; //  0x728 Size(8)
	struct Unknown Image_1323; //  0x730 Size(8)
	struct Unknown Image_1324; //  0x738 Size(8)
	struct Unknown Image_1329; //  0x740 Size(8)
	struct Unknown Image_1330; //  0x748 Size(8)
	struct Unknown Image_1335; //  0x750 Size(8)
	struct Unknown Image_1336; //  0x758 Size(8)
	struct Unknown Image_1341; //  0x760 Size(8)
	struct Unknown Image_1342; //  0x768 Size(8)
	struct Unknown Image_1343; //  0x770 Size(8)
	struct Unknown Image_1344; //  0x778 Size(8)
	struct Unknown Image_1345; //  0x780 Size(8)
	struct Unknown Image_1346; //  0x788 Size(8)
	struct Unknown Image_1347; //  0x790 Size(8)
	struct Unknown Image_1348; //  0x798 Size(8)
	struct Unknown Image_1349; //  0x7a0 Size(8)
	struct Unknown Image_1350; //  0x7a8 Size(8)
	struct Unknown Image_1351; //  0x7b0 Size(8)
	struct Unknown Image_1352; //  0x7b8 Size(8)
	struct Unknown Image_1353; //  0x7c0 Size(8)
	struct Unknown Image_1354; //  0x7c8 Size(8)
	struct Unknown Image_1355; //  0x7d0 Size(8)
	struct Unknown Image_1356; //  0x7d8 Size(8)
	struct Unknown Image_1358; //  0x7e0 Size(8)
	struct Unknown Image_1359; //  0x7e8 Size(8)
	struct Unknown Image_1361; //  0x7f0 Size(8)
	struct Unknown Image_1362; //  0x7f8 Size(8)
	struct Unknown Image_1363; //  0x800 Size(8)
	struct Unknown Image_1364; //  0x808 Size(8)
	struct Unknown Image_1366; //  0x810 Size(8)
	struct Unknown Image_1368; //  0x818 Size(8)
	struct Unknown Image_1369; //  0x820 Size(8)
	struct Unknown Image_1370; //  0x828 Size(8)
	struct Unknown Image_1372; //  0x830 Size(8)
	struct Unknown Image_1374; //  0x838 Size(8)
	struct Unknown Image_1375; //  0x840 Size(8)
	struct Unknown Image_1376; //  0x848 Size(8)
	struct Unknown Image_1378; //  0x850 Size(8)
	struct Unknown Image_1380; //  0x858 Size(8)
	struct Unknown Image_1381; //  0x860 Size(8)
	struct Unknown Image_1382; //  0x868 Size(8)
	struct Unknown Image_1384; //  0x870 Size(8)
	struct Unknown Image_1972; //  0x878 Size(8)
	struct Unknown ImageTX_Complete_Fail; //  0x880 Size(8)
	struct Unknown ItemList; //  0x888 Size(8)
	struct Unknown Overlay_FB_ItemList; //  0x890 Size(8)
	struct Unknown Strengthen_Cost; //  0x898 Size(8)
	struct Unknown Strengthen_Count; //  0x8a0 Size(8)
	struct Unknown Strengthen_CurrentDamageText1; //  0x8a8 Size(8)
	struct Unknown Strengthen_CurrentDamageText2; //  0x8b0 Size(8)
	struct Unknown Strengthen_CurrentMagSizeText1; //  0x8b8 Size(8)
	struct Unknown Strengthen_CurrentMagSizeText2; //  0x8c0 Size(8)
	struct Unknown Strengthen_CurrentSpreadText1; //  0x8c8 Size(8)
	struct Unknown Strengthen_CurrentSpreadText2; //  0x8d0 Size(8)
	struct Unknown Strengthen_Icon; //  0x8d8 Size(8)
	struct Unknown Strengthen_IconType1; //  0x8e0 Size(8)
	struct Unknown Strengthen_IconType2; //  0x8e8 Size(8)
	struct Unknown Strengthen_IconType3; //  0x8f0 Size(8)
	struct Unknown Strengthen_Level1; //  0x8f8 Size(8)
	struct Unknown Strengthen_Level2; //  0x900 Size(8)
	struct Unknown Strengthen_Name; //  0x908 Size(8)
	struct Unknown Strengthen_TextType1; //  0x910 Size(8)
	struct Unknown Strengthen_TextType2; //  0x918 Size(8)
	struct Unknown Strengthen_TextType3; //  0x920 Size(8)
	struct Unknown Success_Damage1; //  0x928 Size(8)
	struct Unknown Success_Damage2; //  0x930 Size(8)
	struct Unknown Success_ItemName; //  0x938 Size(8)
	struct Unknown Success_ItemName_2; //  0x940 Size(8)
	struct Unknown Success_Level1; //  0x948 Size(8)
	struct Unknown Success_Level2; //  0x950 Size(8)
	struct Unknown Success_MagSize1; //  0x958 Size(8)
	struct Unknown Success_MagSize2; //  0x960 Size(8)
	struct Unknown Success_Spread1; //  0x968 Size(8)
	struct Unknown Success_Spread2; //  0x970 Size(8)
	struct Unknown Success_UpLevel; //  0x978 Size(8)
	struct Unknown T_Durability; //  0x980 Size(8)
	struct Unknown T_Fatigue; //  0x988 Size(8)
	struct Unknown T_PreFatigue; //  0x990 Size(8)
	struct Unknown TerrainHeight; //  0x998 Size(8)
	struct Unknown TextBlock_2089; //  0x9a0 Size(8)
	struct Unknown TextBlock_FB_ItemCount; //  0x9a8 Size(8)
	struct Unknown TextBlock_FB_ItemName; //  0x9b0 Size(8)
	struct Unknown TextBlock_FB_Title; //  0x9b8 Size(8)
	struct Unknown WidgetSwitcher_1; //  0x9c0 Size(8)
	struct Unknown ResultInfo; //  0x9c8 Size(38)
	float CurrentDurability; //  0xa00 Size(4)

	void SequenceEvent__ENTRYPOINTU_16(); // Function U.U.SequenceEvent__ENTRYPOINTU_16(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown HorizontalBox; //  0x250 Size(8)
	struct Unknown HorizontalBox_2; //  0x258 Size(8)
	struct Unknown Image; //  0x260 Size(8)
	struct Unknown Image_2; //  0x268 Size(8)
	struct Unknown Image_3; //  0x270 Size(8)
	struct Unknown Image_4; //  0x278 Size(8)
	struct Unknown Image_5; //  0x280 Size(8)
	struct Unknown Image_6; //  0x288 Size(8)
	struct Unknown Image_7; //  0x290 Size(8)
	struct Unknown Image_8; //  0x298 Size(8)
	struct Unknown Image_9; //  0x2a0 Size(8)
	struct Unknown Image_10; //  0x2a8 Size(8)
	struct Unknown Image_11; //  0x2b0 Size(8)
	struct Unknown Image_12; //  0x2b8 Size(8)
	struct Unknown Image_13; //  0x2c0 Size(8)
	struct Unknown Image_14; //  0x2c8 Size(8)
	struct Unknown Image_15; //  0x2d0 Size(8)
	struct Unknown Image_72; //  0x2d8 Size(8)
	struct Unknown Image_164; //  0x2e0 Size(8)
	struct Unknown Image_352; //  0x2e8 Size(8)
	struct Unknown Image_659; //  0x2f0 Size(8)
	struct Unknown Overlay_4; //  0x2f8 Size(8)
	struct Unknown SizeBox; //  0x300 Size(8)
	struct Unknown SizeBox_54; //  0x308 Size(8)
	struct Unknown T_WeaponType; //  0x310 Size(8)
	struct Unknown TextBlock_176; //  0x318 Size(8)
	struct Unknown TextBlock_258; //  0x320 Size(8)
	struct Unknown TextBlock_331; //  0x328 Size(8)
	struct Unknown WidgetSwitcher_1; //  0x330 Size(8)
	struct Unknown ItemInfo; //  0x338 Size(8)
	struct Unknown Item; //  0x340 Size(490)
	struct FText LocalText; //  0x7d0 Size(18)
	char bIsSmallIcon; //  0x7e8 Size(1)

	void IsMaterialData(struct FName ItemKey, char& bRet, int32_t& Index); // Function U.U.IsMaterialData(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown ArmorSlot; //  0x248 Size(8)
	struct Unknown BagSlot; //  0x250 Size(8)
	struct Unknown BottomSlot; //  0x258 Size(8)
	struct Unknown EyeWearSlot; //  0x260 Size(8)
	struct Unknown GhillieSlot; //  0x268 Size(8)
	struct Unknown GlovesSlot; //  0x270 Size(8)
	struct Unknown HatSlot; //  0x278 Size(8)
	struct Unknown HelmetSlot; //  0x280 Size(8)
	struct Unknown MaskSlot; //  0x288 Size(8)
	struct Unknown OuterSlot; //  0x290 Size(8)
	struct Unknown ShoesSlot; //  0x298 Size(8)
	struct Unknown TopSlot; //  0x2a0 Size(8)
	struct Unknown U; //  0x2a8 Size(8)
	struct Unknown Timer_UpdateItemList; //  0x2b0 Size(8)

	void SetEquippedSlot(struct Unknown InventoryItemInfo); // Function U.U.SetEquippedSlot(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown ADS_Pannel; //  0x250 Size(8)
	struct Unknown ADSZoom; //  0x258 Size(8)
	struct Unknown CanvasPanel_Main; //  0x260 Size(8)
	struct Unknown Descent; //  0x268 Size(8)
	struct Unknown Descent_Pannel; //  0x270 Size(8)
	struct Unknown Drive; //  0x278 Size(8)
	struct Unknown Drive_Pannel; //  0x280 Size(8)
	struct Unknown Key_ADSZeroingM; //  0x288 Size(8)
	struct Unknown Key_ADSZeroingP; //  0x290 Size(8)
	struct Unknown Key_ADSZoomIn; //  0x298 Size(8)
	struct Unknown Key_ADSZoomOut; //  0x2a0 Size(8)
	struct Unknown Ladder; //  0x2a8 Size(8)
	struct Unknown Ladder_Pannel; //  0x2b0 Size(8)
	struct Unknown Parachuting; //  0x2b8 Size(8)
	struct Unknown Parachuting_Pannel; //  0x2c0 Size(8)
	struct Unknown SmartPing; //  0x2c8 Size(8)
	struct Unknown SmartPing_Pannel; //  0x2d0 Size(8)
	struct Unknown Spectate; //  0x2d8 Size(8)
	struct Unknown Spectate_Pannel; //  0x2e0 Size(8)
	struct Unknown Swim; //  0x2e8 Size(8)
	struct Unknown Swim_Pannel; //  0x2f0 Size(8)
	struct Unknown T_ADSZeroingM; //  0x2f8 Size(8)
	struct Unknown T_ADSZeroingP; //  0x300 Size(8)
	struct Unknown T_ADSZoomIn; //  0x308 Size(8)
	struct Unknown T_ADSZoomOut; //  0x310 Size(8)
	struct Unknown UseItem; //  0x318 Size(8)
	struct Unknown UseItem_Pannel; //  0x320 Size(8)
	struct Unknown WidgetSwitcher_Guide; //  0x328 Size(8)
	struct Unknown WorldMap; //  0x330 Size(8)
	struct Unknown WorldMap_Always; //  0x338 Size(8)
	struct Unknown WorldMap_Pannel; //  0x340 Size(8)

	void UpdateWorldMapGuideOpacity(int32_t PreZoomLevel, int32_t NewZoomLevel); // Function U.U.UpdateWorldMapGuideOpacity(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown FollowCamGuide; //  0x248 Size(8)
	struct Unknown FreeCamGuide; //  0x250 Size(8)
	struct Unknown KeyImageWidget_C_1; //  0x258 Size(8)
	struct Unknown KeyImageWidget_C_2; //  0x260 Size(8)
	struct Unknown KeyImageWidget_C_3; //  0x268 Size(8)
	struct Unknown KeyImageWidget_C_4; //  0x270 Size(8)
	struct Unknown KeyImageWidget_C_5; //  0x278 Size(8)
	struct Unknown KeyImageWidget_C_6; //  0x280 Size(8)
	struct Unknown KeyImageWidget_C_7; //  0x288 Size(8)
	struct Unknown KeyImageWidget_C_8; //  0x290 Size(8)
	struct Unknown KeyImageWidget_C_10; //  0x298 Size(8)
	struct Unknown KeyImageWidget_C_153; //  0x2a0 Size(8)
	struct Unknown KeyImageWidget_C_154; //  0x2a8 Size(8)
	struct Unknown KeyImageWidget_C_155; //  0x2b0 Size(8)
	struct Unknown KeyImageWidget_C_157; //  0x2b8 Size(8)
	struct Unknown KeyImageWidget_C_158; //  0x2c0 Size(8)
	struct Unknown KeyImageWidget_C_159; //  0x2c8 Size(8)
	struct Unknown KeyImageWidget_C_160; //  0x2d0 Size(8)
	struct Unknown KillCamGuide; //  0x2d8 Size(8)
	struct Unknown T_Guide; //  0x2e0 Size(8)
	struct Unknown TextBlock_1; //  0x2e8 Size(8)
	struct Unknown TextBlock_2; //  0x2f0 Size(8)
	struct Unknown TextBlock_4; //  0x2f8 Size(8)
	struct Unknown TextBlock_5; //  0x300 Size(8)
	struct Unknown TextBlock_6; //  0x308 Size(8)
	struct Unknown TextBlock_7; //  0x310 Size(8)
	struct Unknown TextBlock_8; //  0x318 Size(8)
	struct Unknown TextBlock_9; //  0x320 Size(8)
	struct Unknown TextBlock_10; //  0x328 Size(8)
	struct Unknown TextBlock_11; //  0x330 Size(8)
	struct Unknown TextBlock_13; //  0x338 Size(8)
	struct Unknown TextBlock_14; //  0x340 Size(8)
	struct Unknown TextBlock_15; //  0x348 Size(8)
	struct Unknown TextBlock_16; //  0x350 Size(8)
	struct Unknown TextBlock_17; //  0x358 Size(8)
	struct Unknown WidgetSwitcher_132; //  0x360 Size(8)

	void SetKillCamGuide(); // Function U.U.SetKillCamGuide(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelScopeWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Image_1; //  0x250 Size(8)

	void SetScopeImageAngle(float NewAngle); // Function U.U.SetScopeImageAngle(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelReplayListWidget {
	struct Unknown UberGraphFrame; //  0x260 Size(8)
	struct Unknown Button_Delete; //  0x268 Size(8)
	struct Unknown Button_Keep; //  0x270 Size(8)
	struct Unknown Button_OldFileDelete; //  0x278 Size(8)
	struct Unknown Button_Play; //  0x280 Size(8)
	struct Unknown Button_Refresh; //  0x288 Size(8)
	struct Unknown DetailInfo; //  0x290 Size(8)
	struct Unknown HorizontalBox_3; //  0x298 Size(8)
	struct Unknown HorizontalBox_4; //  0x2a0 Size(8)
	struct Unknown HorizontalBox_5; //  0x2a8 Size(8)
	struct Unknown HorizontalBox_01; //  0x2b0 Size(8)
	struct Unknown HorizontalBox_Version; //  0x2b8 Size(8)
	struct Unknown Image_1; //  0x2c0 Size(8)
	struct Unknown Image_483; //  0x2c8 Size(8)
	struct Unknown Image_1010; //  0x2d0 Size(8)
	struct Unknown Image_2531; //  0x2d8 Size(8)
	struct Unknown Image_2533; //  0x2e0 Size(8)
	struct Unknown Image_2535; //  0x2e8 Size(8)
	struct Unknown Image_3059; //  0x2f0 Size(8)
	struct Unknown Image_3229; //  0x2f8 Size(8)
	struct Unknown Image_3231; //  0x300 Size(8)
	struct Unknown Image_; //  0x308 Size(8)
	struct Unknown Image_ClassImage; //  0x310 Size(8)
	struct Unknown Image_Icon1; //  0x318 Size(8)
	struct Unknown Image_Icon2; //  0x320 Size(8)
	struct Unknown Image_Icon3; //  0x328 Size(8)
	struct Unknown Image_Icon4; //  0x330 Size(8)
	struct Unknown Image_MapImage; //  0x338 Size(8)
	struct Unknown Overlay; //  0x340 Size(8)
	struct Unknown ReplayListBox; //  0x348 Size(8)
	struct Unknown TextBlock_2388; //  0x350 Size(8)
	struct Unknown TextBlock_BattleMode; //  0x358 Size(8)
	struct Unknown TextBlock_BlueZoneMaxPlayerCount; //  0x360 Size(8)
	struct Unknown TextBlock_BlueZoneTitle; //  0x368 Size(8)
	struct Unknown TextBlock_ClassLevel1; //  0x370 Size(8)
	struct Unknown TextBlock_ClassLevel2; //  0x378 Size(8)
	struct Unknown TextBlock_ClassLevel3; //  0x380 Size(8)
	struct Unknown TextBlock_ClassLevel4; //  0x388 Size(8)
	struct Unknown TextBlock_ClassName1; //  0x390 Size(8)
	struct Unknown TextBlock_ClassName2; //  0x398 Size(8)
	struct Unknown TextBlock_ClassName3; //  0x3a0 Size(8)
	struct Unknown TextBlock_ClassName4; //  0x3a8 Size(8)
	struct Unknown TextBlock_CurrentFileCount; //  0x3b0 Size(8)
	struct Unknown TextBlock_Damage; //  0x3b8 Size(8)
	struct Unknown TextBlock_FPP; //  0x3c0 Size(8)
	struct Unknown TextBlock_Keep; //  0x3c8 Size(8)
	struct Unknown TextBlock_Kill; //  0x3d0 Size(8)
	struct Unknown TextBlock_LifeTime; //  0x3d8 Size(8)
	struct Unknown TextBlock_MapName; //  0x3e0 Size(8)
	struct Unknown TextBlock_Name1; //  0x3e8 Size(8)
	struct Unknown TextBlock_Name2; //  0x3f0 Size(8)
	struct Unknown TextBlock_Name3; //  0x3f8 Size(8)
	struct Unknown TextBlock_Name4; //  0x400 Size(8)
	struct Unknown TextBlock_Rank; //  0x408 Size(8)
	struct Unknown TextBlock_Time; //  0x410 Size(8)
	struct Unknown TextBlock_TotalPlayerCount; //  0x418 Size(8)
	struct Unknown TextBlock_TotalSize; //  0x420 Size(8)
	struct Unknown TextBlock_Weapon1; //  0x428 Size(8)
	struct Unknown TextBlock_Weapon2; //  0x430 Size(8)
	struct Unknown TextBlock_Weapon3; //  0x438 Size(8)
	struct Unknown TextBlock_Weapon4; //  0x440 Size(8)
	struct Unknown U; //  0x448 Size(8)
	struct Unknown U_3; //  0x450 Size(8)
	struct Unknown U_4; //  0x458 Size(8)
	struct Unknown U_5; //  0x460 Size(8)
	struct Unknown U_6; //  0x468 Size(8)
	struct Unknown U_7; //  0x470 Size(8)
	struct Unknown U_8; //  0x478 Size(8)
	struct Unknown U_9; //  0x480 Size(8)
	struct Unknown U_10; //  0x488 Size(8)
	struct Unknown U_11; //  0x490 Size(8)
	struct Unknown U_12; //  0x498 Size(8)
	struct Unknown U_13; //  0x4a0 Size(8)
	struct Unknown SelectedItemInfo; //  0x4a8 Size(128)

	void GetBattleModeString(int32_t Idx, struct FText& Str); // Function U.U.GetBattleModeString(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown Image_2; //  0x248 Size(8)
	struct Unknown InvalidationBox_1; //  0x250 Size(8)
	struct Unknown Switcher; //  0x258 Size(8)
	float OwnDirection; //  0x260 Size(4)

	void Initialize(float Direction); // Function U.U.Initialize(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Button_98; //  0x250 Size(8)
	struct Unknown Time_2; //  0x258 Size(8)
	struct Unknown SavedEvent; //  0x260 Size(28)
	struct FString SavedReplayFileName; //  0x288 Size(10)
	struct Unknown ReplayListWidget; //  0x298 Size(8)

	void Init(struct Unknown Event, struct FString ReplayFileName, struct Unknown ReplayListWidget); // Function U.U.Init(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Infos_Ani; //  0x250 Size(8)
	struct Unknown SimpleResult_Events; //  0x258 Size(8)
	struct Unknown Lose_ani; //  0x260 Size(8)
	struct Unknown Win_ani; //  0x268 Size(8)
	struct Unknown Lose_Events; //  0x270 Size(8)
	struct Unknown Win_Events; //  0x278 Size(8)
	struct Unknown ClassName; //  0x280 Size(8)
	struct Unknown ClassWeaponName; //  0x288 Size(8)
	struct Unknown HeadShot; //  0x290 Size(8)
	struct Unknown HorizontalBox_KillerWeaponInfo; //  0x298 Size(8)
	struct Unknown HorizontalBox_Rarity; //  0x2a0 Size(8)
	struct Unknown Icon_KillerClass; //  0x2a8 Size(8)
	struct Unknown Image_894; //  0x2b0 Size(8)
	struct Unknown Image_2002; //  0x2b8 Size(8)
	struct Unknown Level; //  0x2c0 Size(8)
	struct Unknown LoseMessage; //  0x2c8 Size(8)
	struct Unknown Overlay_DropItems; //  0x2d0 Size(8)
	struct Unknown Overlay_KillerInfo; //  0x2d8 Size(8)
	struct Unknown Overlay_WeaponLevel; //  0x2e0 Size(8)
	struct Unknown T_DamageType; //  0x2e8 Size(8)
	struct Unknown T_WeaponLevel; //  0x2f0 Size(8)
	struct Unknown TextBlock_ItemCount; //  0x2f8 Size(8)
	struct Unknown Uniform_ItemList; //  0x300 Size(8)
	struct Unknown UserName; //  0x308 Size(8)
	struct Unknown U_1; //  0x310 Size(8)
	struct Unknown U; //  0x318 Size(8)
	struct Unknown WeaponName; //  0x320 Size(8)
	struct Unknown WidgetSwitcher_DamageCauser; //  0x328 Size(8)
	struct Unknown AnimationData; //  0x330 Size(2)
	struct Unknown MatchEndWidgetRef; //  0x338 Size(8)
	struct Unknown SimpleResult; //  0x340 Size(a8)
	char MatchEnd; //  0x3e8 Size(1)

	void SequenceEvent__ENTRYPOINTU_10(); // Function U.U.SequenceEvent__ENTRYPOINTU_10(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelRoutePingWidget {
	struct Unknown Anim_OnShow; //  0x248 Size(8)
	struct Unknown BackColor; //  0x250 Size(8)
	struct Unknown T_Num; //  0x258 Size(8)
	struct FMulticastInlineDelegate OnMarkerClicked; //  0x260 Size(10)

	void SetPointAngle(float Angle); // Function U.U.SetPointAngle(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown TX; //  0x248 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelAircraftRouteWidget {
	struct Unknown UberGraphFrame; //  0x2b0 Size(8)
	struct Unknown Propeller1; //  0x2b8 Size(8)
	struct Unknown Aircraft; //  0x2c0 Size(8)
	struct Unknown Image_156; //  0x2c8 Size(8)
	struct Unknown Image_236; //  0x2d0 Size(8)
	struct Unknown Image_237; //  0x2d8 Size(8)
	struct Unknown MapCompRef; //  0x2e0 Size(8)

	void StopAirCraftAnimation(); // Function U.U.StopAirCraftAnimation(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Character_BG_Motion; //  0x250 Size(8)
	struct Unknown ArmorSlot; //  0x258 Size(8)
	struct Unknown BagSlot; //  0x260 Size(8)
	struct Unknown BottomSlot; //  0x268 Size(8)
	struct Unknown Character_BG; //  0x270 Size(8)
	struct Unknown EyeWearSlot; //  0x278 Size(8)
	struct Unknown GhillieSlot; //  0x280 Size(8)
	struct Unknown GlovesSlot; //  0x288 Size(8)
	struct Unknown HatSlot; //  0x290 Size(8)
	struct Unknown HelmetSlot; //  0x298 Size(8)
	struct Unknown MaskSlot; //  0x2a0 Size(8)
	struct Unknown OuterSlot; //  0x2a8 Size(8)
	struct Unknown ShoesSlot; //  0x2b0 Size(8)
	struct Unknown TopSlot; //  0x2b8 Size(8)
	struct Unknown U; //  0x2c0 Size(8)
	struct Unknown PlayerController; //  0x2c8 Size(8)
	struct TMap<{}, {}>Unknown EquipedSlots; //  0x2d0 Size(50)

	void ShowStatupAnim(struct Unknown& StatParams, enum class Unknow StatType); // Function U.U.ShowStatupAnim(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelTeamInfoSlotWidget {
	struct Unknown UberGraphFrame; //  0x308 Size(8)
	struct Unknown Anim_IconBouncing; //  0x310 Size(8)
	struct Unknown Progress_Stroke; //  0x318 Size(8)
	struct Unknown Shoot_ani; //  0x320 Size(8)
	struct Unknown CanvasPanel_Main; //  0x328 Size(8)
	struct Unknown death; //  0x330 Size(8)
	struct Unknown Image_126; //  0x338 Size(8)
	struct Unknown Image_168; //  0x340 Size(8)
	struct Unknown Image_280; //  0x348 Size(8)
	struct Unknown Image_623; //  0x350 Size(8)
	struct Unknown Image_624; //  0x358 Size(8)
	struct Unknown Image_1058; //  0x360 Size(8)
	struct Unknown Image_Firing; //  0x368 Size(8)
	struct Unknown Image_Heart; //  0x370 Size(8)
	struct Unknown Image_Outline; //  0x378 Size(8)
	struct Unknown Image_TeamInfoClassIcon; //  0x380 Size(8)
	struct Unknown Img_LogOut; //  0x388 Size(8)
	struct Unknown Img_Voice; //  0x390 Size(8)
	struct Unknown Img_VoiceMute; //  0x398 Size(8)
	struct Unknown InvalidationBox_1; //  0x3a0 Size(8)
	struct Unknown Overlay_447; //  0x3a8 Size(8)
	struct Unknown Overlay_Death; //  0x3b0 Size(8)
	struct Unknown Overlay_RemainGoldenTimeSelf; //  0x3b8 Size(8)
	struct Unknown Overlay_RequestResus; //  0x3c0 Size(8)
	struct Unknown ProgressBar_440; //  0x3c8 Size(8)
	struct Unknown ProgressBar_443; //  0x3d0 Size(8)
	struct Unknown SizeBox_132; //  0x3d8 Size(8)
	struct Unknown StateGoldenTime; //  0x3e0 Size(8)
	struct Unknown StateKnockdown; //  0x3e8 Size(8)
	struct Unknown T_ClassName; //  0x3f0 Size(8)
	struct Unknown T_ClassWeapon; //  0x3f8 Size(8)
	struct Unknown T_PlayerIndex; //  0x400 Size(8)
	struct Unknown T_PlayerName; //  0x408 Size(8)
	struct Unknown TeamColor; //  0x410 Size(8)
	struct Unknown TextBlock_4; //  0x418 Size(8)
	struct Unknown TextBlock_297; //  0x420 Size(8)
	struct Unknown TextBlock_590; //  0x428 Size(8)
	struct Unknown TextBlock_591; //  0x430 Size(8)
	struct Unknown TextBlock_1016; //  0x438 Size(8)
	struct Unknown TextBlock_RemainGoldenTimeSelf; //  0x440 Size(8)
	struct Unknown TextBlock_RequestResus; //  0x448 Size(8)
	struct Unknown TextBlock_Resuscitating; //  0x450 Size(8)
	struct Unknown U; //  0x458 Size(8)
	struct Unknown WidgetSwitcher_LogOut; //  0x460 Size(8)
	struct Unknown WidgetSwitcher_Resuscitate; //  0x468 Size(8)
	int32_t Index; //  0x470 Size(4)
	enum class Unknow Behavior; //  0x474 Size(1)
	float hp; //  0x478 Size(4)
	struct FText Name; //  0x480 Size(18)
	struct TArray<Unknown> ColorList; //  0x498 Size(10)
	char bPin; //  0x4a8 Size(1)
	float PrevHP; //  0x4ac Size(4)
	char bReduceHP; //  0x4b0 Size(1)
	struct Unknown TimerHandleReduceHP; //  0x4b8 Size(8)
	char bIncreaseHP; //  0x4c0 Size(1)
	struct Unknown HealthChangeCurve; //  0x4c8 Size(8)
	struct Unknown HealthDangerCurve; //  0x4d0 Size(8)
	struct Unknown HealTimer; //  0x4d8 Size(8)
	struct Unknown FaintTimer; //  0x4e0 Size(8)
	float BaseHealth; //  0x4e8 Size(4)
	float TargetHealth; //  0x4ec Size(4)
	float HealthWeight; //  0x4f0 Size(4)
	float TargetFaint; //  0x4f4 Size(4)
	float BaseFaint; //  0x4f8 Size(4)
	float FaintWeight; //  0x4fc Size(4)
	float CurrentHPPercent; //  0x500 Size(4)
	float HealHPPercent; //  0x504 Size(4)
	float FaintPercent; //  0x508 Size(4)
	float CurrentAlpha; //  0x50c Size(4)
	float AlphaTimer; //  0x510 Size(4)
	struct Unknown AlphaCurve; //  0x518 Size(8)
	char KnockDown; //  0x520 Size(1)
	float HeartBeat; //  0x524 Size(4)
	struct Unknown DisConnectSprite; //  0x528 Size(8)
	struct Unknown KnockDownSprite; //  0x530 Size(8)
	struct Unknown DeathSprite; //  0x538 Size(8)
	struct Unknown VehicleSprite; //  0x540 Size(8)
	struct Unknown HpTimer; //  0x548 Size(8)
	float EndTime; //  0x550 Size(4)
	float StartTime; //  0x554 Size(4)
	float TotalTime; //  0x558 Size(4)
	float ResultValue; //  0x55c Size(4)
	float AddTme; //  0x560 Size(4)
	float PreStart; //  0x564 Size(4)

	void OnLoaded_27D2D12149E3EA31998D6D88C1D08B2F(struct Unknown Loaded); // Function U.U.OnLoaded_27D2D12149E3EA31998D6D88C1D08B2F(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelPlayerInfoWidget {
	struct Unknown UberGraphFrame; //  0x2c0 Size(8)
	struct Unknown Lung_Red; //  0x2c8 Size(8)
	struct Unknown Weaving_Stand; //  0x2d0 Size(8)
	struct Unknown Weaving_Sit; //  0x2d8 Size(8)
	struct Unknown HorizontalBox_Backpack_Star; //  0x2e0 Size(8)
	struct Unknown HorizontalBox_Chest_Star; //  0x2e8 Size(8)
	struct Unknown HorizontalBox_Damage; //  0x2f0 Size(8)
	struct Unknown HorizontalBox_Helmet_Star; //  0x2f8 Size(8)
	struct Unknown HorizontalBox_Levels; //  0x300 Size(8)
	struct Unknown Image_BackPack_Star; //  0x308 Size(8)
	struct Unknown Image_C4; //  0x310 Size(8)
	struct Unknown Image_Chest_Star; //  0x318 Size(8)
	struct Unknown Image_DamageBg; //  0x320 Size(8)
	struct Unknown Image_FireMode; //  0x328 Size(8)
	struct Unknown Image_Helmet_Star; //  0x330 Size(8)
	struct Unknown Image_Time; //  0x338 Size(8)
	struct Unknown Image_Timer; //  0x340 Size(8)
	struct Unknown Image_Weapon; //  0x348 Size(8)
	struct Unknown Overlay_Tab; //  0x350 Size(8)
	struct Unknown ProgressBar_Backpack; //  0x358 Size(8)
	struct Unknown ProgressBar_Chest; //  0x360 Size(8)
	struct Unknown ProgressBar_Helmet; //  0x368 Size(8)
	struct Unknown SizeBox_Backpack; //  0x370 Size(8)
	struct Unknown SizeBox_Chest; //  0x378 Size(8)
	struct Unknown SizeBox_Helmet; //  0x380 Size(8)
	struct Unknown T_C4Time; //  0x388 Size(8)
	struct Unknown T_Damage; //  0x390 Size(8)
	struct Unknown T_PerkWeaponAmmo; //  0x398 Size(8)
	struct Unknown T_SlotIndex; //  0x3a0 Size(8)
	struct Unknown T_WeaponName; //  0x3a8 Size(8)
	struct Unknown TextBlock_bulletCount; //  0x3b0 Size(8)
	struct Unknown TextBlock_bulletMaxCount; //  0x3b8 Size(8)
	struct Unknown U; //  0x3c0 Size(8)
	struct Unknown U_2; //  0x3c8 Size(8)
	struct Unknown U_3; //  0x3d0 Size(8)
	struct Unknown U_4; //  0x3d8 Size(8)
	struct Unknown U_5; //  0x3e0 Size(8)
	struct Unknown U_6; //  0x3e8 Size(8)
	struct Unknown U; //  0x3f0 Size(8)
	struct Unknown U; //  0x3f8 Size(8)
	struct Unknown WidgetSwitcher_Bullet; //  0x400 Size(8)
	struct Unknown WidgetSwitcher_C4; //  0x408 Size(8)
	struct Unknown WidgetSwitcher_Stance; //  0x410 Size(8)
	struct Unknown Anim_LastHeadbanging; //  0x418 Size(8)
	struct Unknown Timer_UpdateInfos; //  0x420 Size(8)
	char bIsCoolTimeWeapon; //  0x428 Size(1)
	struct Unknown CurrentWeapon; //  0x430 Size(8)
	struct Unknown TargetPawnRef; //  0x438 Size(8)
	struct Unknown CoolTimeMaterial; //  0x440 Size(8)
	struct Unknown WeaponInfo; //  0x448 Size(a8)
	int32_t SlotIndex; //  0x4f0 Size(4)

	void IsNo(char& Weapon); // Function U.U.IsNo(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown TextBlock; //  0x250 Size(8)
	struct FText SetText; //  0x258 Size(18)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelMiniMapWidget {
	struct Unknown UberGraphFrame; //  0x260 Size(8)
	struct Unknown PlayerIconOn; //  0x268 Size(8)
	struct Unknown ShirinkingAnimation; //  0x270 Size(8)
	struct Unknown AlertIcon; //  0x278 Size(8)
	struct Unknown B; //  0x280 Size(8)
	struct Unknown B; //  0x288 Size(8)
	struct Unknown CircleInfoGroup; //  0x290 Size(8)
	struct Unknown C; //  0x298 Size(8)
	struct Unknown CurrentProgressBar; //  0x2a0 Size(8)
	struct Unknown Image_174; //  0x2a8 Size(8)
	struct Unknown Image_766; //  0x2b0 Size(8)
	struct Unknown InvalidationBox_2; //  0x2b8 Size(8)
	struct Unknown LulledGroup; //  0x2c0 Size(8)
	struct Unknown PhaseText; //  0x2c8 Size(8)
	struct Unknown PlayerIconGroup; //  0x2d0 Size(8)
	struct Unknown S; //  0x2d8 Size(8)
	struct Unknown SB_CircleInfo; //  0x2e0 Size(8)
	struct Unknown ShrinkingGroup; //  0x2e8 Size(8)
	struct Unknown Switcher; //  0x2f0 Size(8)
	struct Unknown U; //  0x2f8 Size(8)
	struct Unknown U; //  0x300 Size(8)
	int32_t State; //  0x308 Size(4)
	struct Unknown MapSize_Default; //  0x30c Size(8)
	struct Unknown MapSize_Extend; //  0x314 Size(8)
	int32_t InitializeCount; //  0x31c Size(4)
	char bExtendMode; //  0x320 Size(1)
	int32_t RecipeCount; //  0x324 Size(4)
	struct Unknown TargetCharacter; //  0x328 Size(8)

	void SetRecipeList(); // Function U.U.SetRecipeList(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown Image_136; //  0x248 Size(8)
	struct Unknown Slider_Speed; //  0x250 Size(8)
	struct Unknown T_CamSpeed; //  0x258 Size(8)
	struct Unknown Handle_HideFreeCamSpeed; //  0x260 Size(8)

	void HideFreeCamSpeed(); // Function U.U.HideFreeCamSpeed(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Ani_FadeOut; //  0x250 Size(8)
	struct Unknown Ani_FadeIn; //  0x258 Size(8)
	struct Unknown 1; //  0x260 Size(8)
	struct Unknown 10; //  0x268 Size(8)
	struct Unknown 2; //  0x270 Size(8)
	struct Unknown 3; //  0x278 Size(8)
	struct Unknown 4; //  0x280 Size(8)
	struct Unknown 5; //  0x288 Size(8)
	struct Unknown 6; //  0x290 Size(8)
	struct Unknown 7; //  0x298 Size(8)
	struct Unknown 8; //  0x2a0 Size(8)
	struct Unknown 9; //  0x2a8 Size(8)
	struct Unknown Button_Beteran; //  0x2b0 Size(8)
	struct Unknown Button_GamePlayTutorial; //  0x2b8 Size(8)
	struct Unknown Button_TutorialMovie; //  0x2c0 Size(8)
	struct Unknown Image_62; //  0x2c8 Size(8)
	struct Unknown Image_369; //  0x2d0 Size(8)
	struct Unknown Light1; //  0x2d8 Size(8)
	struct Unknown Light2; //  0x2e0 Size(8)
	struct Unknown red1; //  0x2e8 Size(8)
	struct Unknown red2; //  0x2f0 Size(8)
	struct Unknown RichTextBlock; //  0x2f8 Size(8)
	struct Unknown RichTextBlock_418; //  0x300 Size(8)
	char NextScene; //  0x308 Size(1)

	void MoveNextScene(); // Function U.U.MoveNextScene(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown U; //  0x250 Size(8)
	struct Unknown HoverWidget; //  0x258 Size(8)

	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Button_96; //  0x250 Size(8)
	struct Unknown Image; //  0x258 Size(8)
	struct Unknown Image_193; //  0x260 Size(8)
	struct Unknown Image_395; //  0x268 Size(8)
	struct Unknown Image_Arrow_Guide; //  0x270 Size(8)
	struct Unknown Img_hover; //  0x278 Size(8)
	struct Unknown Img_Pressed; //  0x280 Size(8)
	struct Unknown U; //  0x288 Size(8)
	struct Unknown WidgetSwitcher_263; //  0x290 Size(8)
	struct FMulticastInlineDelegate EventDispatcher_EndOpen; //  0x298 Size(10)
	struct Unknown ItemOption; //  0x2a8 Size(b8)
	char IsOpened; //  0x360 Size(1)
	float CurrentHoverOpacity; //  0x364 Size(4)
	struct Unknown PressedMaterialInstance; //  0x368 Size(8)
	float CurrentPressedAnim; //  0x370 Size(4)
	struct FMulticastInlineDelegate EventDispatcher_StartOpen; //  0x378 Size(10)

	void SetItemOption(struct Unknown& ItemOption); // Function U.U.SetItemOption(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelScopeWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown CanvasPanel_1; //  0x250 Size(8)
	struct Unknown Image; //  0x258 Size(8)
	struct Unknown Image_2; //  0x260 Size(8)
	struct Unknown Image_3; //  0x268 Size(8)
	struct Unknown Image_4; //  0x270 Size(8)
	struct Unknown Image_5; //  0x278 Size(8)
	struct Unknown Image_6; //  0x280 Size(8)
	struct Unknown Image_7; //  0x288 Size(8)
	struct Unknown Image_8; //  0x290 Size(8)
	struct Unknown Image_9; //  0x298 Size(8)
	struct Unknown Image_10; //  0x2a0 Size(8)
	struct Unknown Image_11; //  0x2a8 Size(8)
	struct Unknown Image_12; //  0x2b0 Size(8)
	struct Unknown Image_13; //  0x2b8 Size(8)
	struct Unknown Image_14; //  0x2c0 Size(8)
	struct Unknown Image_15; //  0x2c8 Size(8)
	struct Unknown Image_16; //  0x2d0 Size(8)
	struct Unknown Image_17; //  0x2d8 Size(8)
	struct Unknown Image_18; //  0x2e0 Size(8)
	struct Unknown Image_47; //  0x2e8 Size(8)
	struct Unknown ScaleBox4X_5mm; //  0x2f0 Size(8)
	struct Unknown ScaleBox4X_7mm; //  0x2f8 Size(8)
	struct Unknown ScaleBox4X_SR; //  0x300 Size(8)
	struct Unknown WidgetSwitcher_167; //  0x308 Size(8)
	struct Unknown NewVar_1; //  0x310 Size(8)

	void SetScopeImageAngle(float NewAngle); // Function U.U.SetScopeImageAngle(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Bg; //  0x250 Size(8)
	struct Unknown Button_Cancle; //  0x258 Size(8)
	struct Unknown Button_OK; //  0x260 Size(8)
	struct Unknown Image; //  0x268 Size(8)
	struct Unknown Image_168; //  0x270 Size(8)
	struct Unknown Image_423; //  0x278 Size(8)
	struct Unknown Image_853; //  0x280 Size(8)
	struct Unknown Image_1449; //  0x288 Size(8)
	struct Unknown Image_1451; //  0x290 Size(8)
	struct Unknown Image_1452; //  0x298 Size(8)
	struct Unknown Image_1453; //  0x2a0 Size(8)
	struct Unknown Image_1454; //  0x2a8 Size(8)
	struct Unknown Image_1965; //  0x2b0 Size(8)
	struct Unknown Image_1967; //  0x2b8 Size(8)
	struct Unknown Image_1968; //  0x2c0 Size(8)
	struct Unknown Image_1969; //  0x2c8 Size(8)
	struct Unknown Image_1970; //  0x2d0 Size(8)
	struct Unknown Image_1971; //  0x2d8 Size(8)
	struct Unknown Image_1972; //  0x2e0 Size(8)
	struct Unknown Image_1973; //  0x2e8 Size(8)
	struct Unknown Image_1974; //  0x2f0 Size(8)
	struct Unknown Image_1975; //  0x2f8 Size(8)
	struct Unknown Image_1976; //  0x300 Size(8)
	struct Unknown Image_1977; //  0x308 Size(8)
	struct Unknown Image_1978; //  0x310 Size(8)
	struct Unknown Image_2324; //  0x318 Size(8)
	struct Unknown TextBlock_CurrentGold; //  0x320 Size(8)
	struct Unknown TextBlock_Price; //  0x328 Size(8)
	struct Unknown TargetCharacter; //  0x330 Size(8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown T_Desc; //  0x248 Size(8)
	struct Unknown U; //  0x250 Size(8)
	struct Unknown U_2; //  0x258 Size(8)
	struct Unknown U_3; //  0x260 Size(8)
	struct Unknown U_4; //  0x268 Size(8)
	struct Unknown U_5; //  0x270 Size(8)
	struct Unknown U_6; //  0x278 Size(8)
	struct Unknown U_7; //  0x280 Size(8)
	struct Unknown U_8; //  0x288 Size(8)
	struct Unknown U_9; //  0x290 Size(8)
	struct Unknown U_10; //  0x298 Size(8)
	struct Unknown WrapBox_Options; //  0x2a0 Size(8)

	void SetRandomOptionDesc(struct FText Desc); // Function U.U.SetRandomOptionDesc(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Button_Request; //  0x250 Size(8)
	struct Unknown Image_955; //  0x258 Size(8)
	struct Unknown Image_1208; //  0x260 Size(8)
	struct Unknown SizeBox_77; //  0x268 Size(8)
	struct Unknown SizeBox_78; //  0x270 Size(8)
	struct Unknown Text_Price; //  0x278 Size(8)
	struct Unknown TextBlock_767; //  0x280 Size(8)
	struct Unknown WidgetSwitcher_Price; //  0x288 Size(8)
	struct Unknown PlayerControllerRef; //  0x290 Size(8)
	char bCanRequest; //  0x298 Size(1)
	char bRequest; //  0x299 Size(1)
	struct FText RequstingResuscitationText; //  0x2a0 Size(18)
	float RequestingSizeBoxWidth; //  0x2b8 Size(4)
	struct Unknown RequestTextColor; //  0x2c0 Size(28)
	struct Unknown RequestingTextColor; //  0x2e8 Size(28)
	float RequestingSizeBoxInitWidth; //  0x310 Size(4)
	struct FText RequstingResuscitationInitText; //  0x318 Size(18)
	struct Unknown InitButtonStyle; //  0x330 Size(278)
	struct Unknown RequestingButtonStyle; //  0x5a8 Size(278)
	struct Unknown CanRequestButtonStyle; //  0x820 Size(278)

	void Init(); // Function U.U.Init(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelPlayerInfoProgresss {
	struct Unknown UberGraphFrame; //  0x2e8 Size(8)
	struct Unknown Anim_Healing; //  0x2f0 Size(8)
	struct Unknown HorizontalBox_Health; //  0x2f8 Size(8)
	struct Unknown Image_eager; //  0x300 Size(8)
	struct Unknown SizeBox_main; //  0x308 Size(8)
	struct Unknown Curve_ProgressMaxSizeRatio; //  0x310 Size(8)
	float DefaultSlotSize; //  0x318 Size(4)
	float MaxHealthSize; //  0x31c Size(4)
	float CurrentHealthSize; //  0x320 Size(4)
	float CurrentMaxHealth; //  0x324 Size(4)

	void GetHealthPosition(float InHealth, float& PositionX); // Function U.U.GetHealthPosition(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown IM; //  0x248 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x1360 Size(8)
	struct Unknown Ani_Tutorial_Glow; //  0x1368 Size(8)
	struct Unknown C_Slot_Up_Arrow; //  0x1370 Size(8)
	struct Unknown C_SlotHover_ItemState_Hide; //  0x1378 Size(8)
	struct Unknown C_SlotHover_ItemState_Show; //  0x1380 Size(8)
	struct Unknown C_SlotHover; //  0x1388 Size(8)
	struct Unknown BGImage; //  0x1390 Size(8)
	struct Unknown BGImage_2; //  0x1398 Size(8)
	struct Unknown CanvasPanel_ITemState; //  0x13a0 Size(8)
	struct Unknown Count120; //  0x13a8 Size(8)
	struct Unknown Crate_Default; //  0x13b0 Size(8)
	struct Unknown Crate_Hover; //  0x13b8 Size(8)
	struct Unknown Effect_Booster; //  0x13c0 Size(8)
	struct Unknown Effect_Capsule; //  0x13c8 Size(8)
	struct Unknown HorizontalBox_Rarity; //  0x13d0 Size(8)
	struct Unknown HoverImage; //  0x13d8 Size(8)
	struct Unknown HoverImage_Round; //  0x13e0 Size(8)
	struct Unknown Image_531; //  0x13e8 Size(8)
	struct Unknown Image_539; //  0x13f0 Size(8)
	struct Unknown Image_540; //  0x13f8 Size(8)
	struct Unknown Image_541; //  0x1400 Size(8)
	struct Unknown Image_542; //  0x1408 Size(8)
	struct Unknown Image_543; //  0x1410 Size(8)
	struct Unknown Image_544; //  0x1418 Size(8)
	struct Unknown Image_Bindable; //  0x1420 Size(8)
	struct Unknown Image_Supply; //  0x1428 Size(8)
	struct Unknown ItemImage; //  0x1430 Size(8)
	struct Unknown ItemState_Text; //  0x1438 Size(8)
	struct Unknown KeepedItem_List; //  0x1440 Size(8)
	struct Unknown KeepedItem_ListHover; //  0x1448 Size(8)
	struct Unknown LvColor; //  0x1450 Size(8)
	struct Unknown Motion; //  0x1458 Size(8)
	struct Unknown ProgressBar_309; //  0x1460 Size(8)
	struct Unknown SizeBox_1; //  0x1468 Size(8)
	struct Unknown TextBlock_3; //  0x1470 Size(8)
	struct Unknown Tutorial_Glow; //  0x1478 Size(8)
	struct Unknown U; //  0x1480 Size(8)
	struct Unknown U; //  0x1488 Size(8)
	struct Unknown WeaponColorBg; //  0x1490 Size(8)
	struct Unknown WeaponEquipItem_Default; //  0x1498 Size(8)
	struct Unknown WeaponEquipItem_Hov; //  0x14a0 Size(8)
	struct Unknown WeaponItemImage; //  0x14a8 Size(8)
	int32_t InventoryItemInfoIndex; //  0x14b0 Size(4)
	struct Unknown MedicalBGColor; //  0x14b4 Size(10)
	int32_t CurCount; //  0x14c4 Size(4)
	struct FMulticastInlineDelegate SetSlotInfo; //  0x14c8 Size(10)
	char CanUseCapsule; //  0x14d8 Size(1)
	struct Unknown SelectedHoverImage; //  0x14e0 Size(8)
	struct TArray<Unknown> ShowRarityStar; //  0x14e8 Size(10)
	struct TArray<Unknown> ShowIconBG; //  0x14f8 Size(10)

	void CheckBoosterItem(char& IsBoost, struct Unknown& OutColor, struct Unknown& OutTexture); // Function U.U.CheckBoosterItem(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelKillInfoSlotWidget {
	struct Unknown UberGraphFrame; //  0x258 Size(8)
	struct Unknown Anim_Hide; //  0x260 Size(8)
	struct Unknown Anim_Down; //  0x268 Size(8)
	struct Unknown CanvasPanel_Main; //  0x270 Size(8)
	struct Unknown Img_Back; //  0x278 Size(8)
	struct Unknown Img_BroadType; //  0x280 Size(8)
	struct Unknown Img_; //  0x288 Size(8)
	struct Unknown Img_Weapon; //  0x290 Size(8)
	struct Unknown ScaleBox_Weapon; //  0x298 Size(8)
	struct Unknown SizeBox_BroadType; //  0x2a0 Size(8)
	struct Unknown SizeBox_DamageType; //  0x2a8 Size(8)
	struct Unknown SizeBox_HeadShot; //  0x2b0 Size(8)
	struct Unknown T_Context; //  0x2b8 Size(8)
	struct Unknown U; //  0x2c0 Size(8)
	struct Unknown U; //  0x2c8 Size(8)
	struct FMulticastInlineDelegate OnTimeOut; //  0x2d0 Size(10)
	struct TMap<{}, {}>Unknown BroadcastDamageType; //  0x2e0 Size(50)
	struct Unknown MyTeamColor; //  0x330 Size(28)
	struct Unknown MyTeamKnockOutColor; //  0x358 Size(28)
	struct Unknown EnermyTeamColor; //  0x380 Size(28)
	struct Unknown EnermyTeamKnockOutColor; //  0x3a8 Size(28)
	struct Unknown DefaultColor; //  0x3d0 Size(28)
	struct Unknown DefaultKnockColor; //  0x3f8 Size(28)
	struct Unknown ResuscatedColor; //  0x420 Size(28)
	struct Unknown ParentWidgetRef; //  0x448 Size(8)
	struct Unknown Timer_StartHideAnim; //  0x450 Size(8)
	struct Unknown CurrentInfoColor; //  0x458 Size(28)

	void ResetInfos(); // Function U.U.ResetInfos(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelKillInfoSlotWidget {
	struct Unknown UberGraphFrame; //  0x258 Size(8)
	struct Unknown Anim_Hide; //  0x260 Size(8)
	struct Unknown Anim_Down; //  0x268 Size(8)
	struct Unknown HorizontalBox_Killer; //  0x270 Size(8)
	struct Unknown ScaleBox_KillerIcon; //  0x278 Size(8)
	struct Unknown T_ClassIcon; //  0x280 Size(8)
	struct Unknown T_Level; //  0x288 Size(8)
	struct Unknown T_LV; //  0x290 Size(8)
	struct Unknown T_Name; //  0x298 Size(8)
	struct FMulticastInlineDelegate OnTimeOut; //  0x2a0 Size(10)
	struct Unknown LocalPlayerState; //  0x2b0 Size(8)

	void OnLoaded_9DF86FA64782B378E42DBB813545BD34(struct Unknown Loaded); // Function U.U.OnLoaded_9DF86FA64782B378E42DBB813545BD34(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelKillInfoWidget {
	struct Unknown UberGraphFrame; //  0x2c0 Size(8)
	struct Unknown KillMessageList; //  0x2c8 Size(8)
	struct Unknown U; //  0x2d0 Size(8)
	struct Unknown U_2; //  0x2d8 Size(8)
	struct Unknown U_3; //  0x2e0 Size(8)
	struct Unknown U_4; //  0x2e8 Size(8)
	struct Unknown U_5; //  0x2f0 Size(8)
	struct Unknown U_6; //  0x2f8 Size(8)
	struct Unknown U_7; //  0x300 Size(8)
	struct Unknown U_8; //  0x308 Size(8)
	struct Unknown U_9; //  0x310 Size(8)
	struct Unknown U_10; //  0x318 Size(8)
	struct TArray<Unknown> TmpInfoList; //  0x320 Size(10)

	void AddKillMessage(struct Unknown& BroadCastInfo); // Function U.U.AddKillMessage(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown HorizontalBox_Rarity; //  0x250 Size(8)
	struct Unknown Image_bg; //  0x258 Size(8)
	struct Unknown Image_Icon; //  0x260 Size(8)
	struct Unknown T_Name; //  0x268 Size(8)
	struct Unknown T_WeaponType; //  0x270 Size(8)
	struct Unknown TextBlock_186; //  0x278 Size(8)
	struct Unknown Tooltip; //  0x280 Size(8)
	struct Unknown ItemInfo; //  0x288 Size(8)
	struct Unknown Item; //  0x290 Size(490)

	void SetRarity(); // Function U.U.SetRarity(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelGameBuffSlot {
	struct Unknown Image_1294; //  0x2f8 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelFallingWidget {
	struct Unknown UberGraphFrame; //  0x270 Size(8)
	struct Unknown Parachute_Loop; //  0x278 Size(8)
	struct Unknown Parachute_Open; //  0x280 Size(8)
	struct Unknown Canvas; //  0x288 Size(8)
	struct Unknown HorizontalBox_Ground; //  0x290 Size(8)
	struct Unknown HorizontalBox_Parachute; //  0x298 Size(8)
	struct Unknown HorizontalBox_Sea; //  0x2a0 Size(8)
	struct Unknown Image_797; //  0x2a8 Size(8)
	struct Unknown Image_798; //  0x2b0 Size(8)
	struct Unknown Overlay_Speed; //  0x2b8 Size(8)
	struct Unknown Parachute; //  0x2c0 Size(8)
	struct Unknown Player; //  0x2c8 Size(8)
	struct Unknown PlayerGroup; //  0x2d0 Size(8)
	struct Unknown SeaHeight; //  0x2d8 Size(8)
	struct Unknown Speed; //  0x2e0 Size(8)
	struct Unknown TerrainHeight; //  0x2e8 Size(8)
	char IsParachute; //  0x2f0 Size(1)

	void SetParachuteInfo(struct Unknown SetParachuteInfo); // Function U.U.SetParachuteInfo(Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelItemUseWidget {
	struct Unknown UberGraphFrame; //  0x268 Size(8)
	struct Unknown Flicker; //  0x270 Size(8)
	struct Unknown BaseGuage; //  0x278 Size(8)
	struct Unknown Guage; //  0x280 Size(8)
	struct Unknown HB_CancelMessage; //  0x288 Size(8)
	struct Unknown Image_921; //  0x290 Size(8)
	struct Unknown Percent; //  0x298 Size(8)
	struct Unknown ProgressBar_Item; //  0x2a0 Size(8)
	struct Unknown RichT_Message; //  0x2a8 Size(8)
	struct Unknown TextBlock_1; //  0x2b0 Size(8)
	struct Unknown TextBlock_Time; //  0x2b8 Size(8)
	struct Unknown UseMessage; //  0x2c0 Size(8)
	struct Unknown VerticalBox_2; //  0x2c8 Size(8)
	float PercentValue; //  0x2d0 Size(4)
	char KnockState; //  0x2d4 Size(1)
	float HideTimer; //  0x2d8 Size(4)
	struct Unknown ProgressStyle; //  0x2e0 Size(1a0)
	char IsShowRevive; //  0x480 Size(1)
	struct Unknown CastingInfo; //  0x488 Size(18)
	float CurrentTime; //  0x4a0 Size(4)
	int32_t KeyFontSize; //  0x4a4 Size(4)
	float KeySizeScale; //  0x4a8 Size(4)
	int32_t CurrentLanguage; //  0x4ac Size(4)

	void CheckLanguage(); // Function U.U.CheckLanguage(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown Image_47; //  0x248 Size(8)

	void UpdateCursorVisibility(); // Function U.U.UpdateCursorVisibility(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown FadeIn; //  0x250 Size(8)
	struct Unknown CharacterPreviewImage; //  0x258 Size(8)
	struct Unknown Image_1; //  0x260 Size(8)
	struct Unknown ControllerRef; //  0x268 Size(8)

	enum class Unknow Get_CharacterPreviewImage_Visibility_1(); // Function U.U.Get_CharacterPreviewImage_Visibility_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Anim_HideKillAssist; //  0x250 Size(8)
	struct Unknown Anim_ShowAssist; //  0x258 Size(8)
	struct Unknown Anim_ShowKill; //  0x260 Size(8)
	struct Unknown T_AssistCount; //  0x268 Size(8)
	struct Unknown T_KillCount; //  0x270 Size(8)
	int32_t DefaultFontSize; //  0x278 Size(4)
	int32_t MiniFontSize; //  0x27c Size(4)
	char IsShowingKillCount; //  0x280 Size(1)
	struct Unknown Timer_HideKillCountText; //  0x288 Size(8)
	float RemainTime; //  0x290 Size(4)

	void SetHideTimer(); // Function U.U.SetHideTimer(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Image_ClassIcon; //  0x250 Size(8)
	struct Unknown TextBlock_ClassName; //  0x258 Size(8)
	struct Unknown TextBlock_Count; //  0x260 Size(8)

	void SetClassCount(int32_t Count); // Function U.U.SetClassCount(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Spectator_Ani; //  0x250 Size(8)
	struct Unknown Button_Report; //  0x258 Size(8)
	struct Unknown Canvas_Finding; //  0x260 Size(8)
	struct Unknown Canvas_Target; //  0x268 Size(8)
	struct Unknown Deco; //  0x270 Size(8)
	struct Unknown Image_351; //  0x278 Size(8)
	struct Unknown IMG_ClassIcon; //  0x280 Size(8)
	struct Unknown NickName; //  0x288 Size(8)
	struct Unknown Overlay_Report; //  0x290 Size(8)
	struct Unknown ReportDescriptionText; //  0x298 Size(8)
	struct Unknown Text_Report; //  0x2a0 Size(8)
	struct Unknown TextBlock_3; //  0x2a8 Size(8)
	struct Unknown TextBlock_208; //  0x2b0 Size(8)
	struct Unknown VerticalBox_Report; //  0x2b8 Size(8)
	struct Unknown WidgetSwitcher_136; //  0x2c0 Size(8)
	char IsReportAble; //  0x2c8 Size(1)
	struct Unknown TargetPlayerState; //  0x2d0 Size(8)

	void ReportSended(); // Function U.U.ReportSended(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Disappear; //  0x250 Size(8)
	struct Unknown Finish; //  0x258 Size(8)
	struct Unknown Spin; //  0x260 Size(8)
	struct Unknown Idle; //  0x268 Size(8)
	struct Unknown Image_180; //  0x270 Size(8)
	struct Unknown ItemImage_bg; //  0x278 Size(8)
	struct Unknown ItemImage_Dummy1; //  0x280 Size(8)
	struct Unknown ItemImage_Main; //  0x288 Size(8)
	struct Unknown TextBlock_1; //  0x290 Size(8)
	struct Unknown TextBlock_3; //  0x298 Size(8)
	struct Unknown TextMountablewea; //  0x2a0 Size(8)
	struct Unknown TextMountableweaLV1; //  0x2a8 Size(8)
	struct Unknown PerkInfo; //  0x2b0 Size(28)
	struct Unknown Perk; //  0x2d8 Size(e0)
	char bLevelUp; //  0x3b8 Size(1)
	char bFinishing; //  0x3b9 Size(1)
	float FinishTime; //  0x3bc Size(4)
	enum class Unknow PerkSlot; //  0x3c0 Size(1)

	struct FText Get_TextBlock_1_Text_1(); // Function U.U.Get_TextBlock_1_Text_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelReplayPlayerListItem {
	struct Unknown UberGraphFrame; //  0x270 Size(8)
	struct Unknown BT_PlayerName; //  0x278 Size(8)
	struct Unknown PB_HP; //  0x280 Size(8)
	struct Unknown T_PlayerName; //  0x288 Size(8)
	struct Unknown T_PlayerNameHighlight; //  0x290 Size(8)
	struct Unknown T_SortInfo; //  0x298 Size(8)
	char bIsTargetPawn; //  0x2a0 Size(1)
	char bIsAlive; //  0x2a1 Size(1)

	void UpdateHighlightNameColor(); // Function U.U.UpdateHighlightNameColor(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelReplayPlayerListGroup {
	struct Unknown UberGraphFrame; //  0x260 Size(8)
	struct Unknown Img_TeamColor; //  0x268 Size(8)
	struct Unknown T_TeamNum; //  0x270 Size(8)
	struct Unknown VB_PlayerList; //  0x278 Size(8)

	void CheckEmptyGroup(); // Function U.U.CheckEmptyGroup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x2a0 Size(8)
	struct Unknown EventInform; //  0x2a8 Size(8)
	struct Unknown VisualBorder; //  0x2b0 Size(8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown WrapBox_Main; //  0x250 Size(8)
	struct Unknown DefaultTextStyle; //  0x258 Size(268)
	struct FText TextString; //  0x4c0 Size(18)
	struct Unknown Game; //  0x4d8 Size(8)
	char HorizontalAlignment; //  0x4e0 Size(1)
	float KeyImageScale; //  0x4e4 Size(4)

	void ParseString(struct FString InputString); // Function U.U.ParseString(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x2a0 Size(8)
	struct Unknown VisualBorder; //  0x2a8 Size(8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x2a0 Size(8)
	struct Unknown VisualBorder; //  0x2a8 Size(8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Canvas_Main; //  0x250 Size(8)
	struct Unknown CB_DrawDeathPosition; //  0x258 Size(8)
	struct Unknown CB_DrawFireDirection; //  0x260 Size(8)
	struct Unknown CB_DrawHitted; //  0x268 Size(8)
	struct Unknown CB_DrawPersonalSupplyBox; //  0x270 Size(8)
	struct Unknown CB_Transport; //  0x278 Size(8)
	struct Unknown ReplayController; //  0x280 Size(8)
	struct Unknown MainWidget; //  0x288 Size(8)
	struct Unknown PlayerHUD; //  0x290 Size(8)

	void Init(); // Function U.U.Init(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelReplayPlayerListWidget {
	struct Unknown UberGraphFrame; //  0x2e0 Size(8)
	struct Unknown Bt_ListNext; //  0x2e8 Size(8)
	struct Unknown BT_ListPrev; //  0x2f0 Size(8)
	struct Unknown ScrollBox_PlayerItem; //  0x2f8 Size(8)
	struct Unknown T_SortType; //  0x300 Size(8)
	struct Unknown VB_ListMain; //  0x308 Size(8)

	struct Unknown CreatePlayerListGroup(struct Unknown PlayerState); // Function U.U.CreatePlayerListGroup(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelVoiceTalkWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Image; //  0x250 Size(8)
	struct Unknown ScrollBox_99; //  0x258 Size(8)
	struct Unknown U; //  0x260 Size(8)
	struct Unknown U_135; //  0x268 Size(8)
	struct Unknown U_196; //  0x270 Size(8)
	struct TArray<Unknown> TempTeamPlayers; //  0x278 Size(10)

	void CheckCreateSlot(char& bRet); // Function U.U.CheckCreateSlot(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown BT; //  0x250 Size(8)
	struct Unknown BT; //  0x258 Size(8)
	struct Unknown BT; //  0x260 Size(8)
	struct Unknown BT; //  0x268 Size(8)
	struct Unknown BT; //  0x270 Size(8)
	struct Unknown BT; //  0x278 Size(8)
	struct Unknown BT; //  0x280 Size(8)
	struct Unknown BT; //  0x288 Size(8)
	struct Unknown BT; //  0x290 Size(8)
	struct Unknown BT; //  0x298 Size(8)
	struct Unknown BT; //  0x2a0 Size(8)
	struct Unknown BT; //  0x2a8 Size(8)
	struct Unknown BT; //  0x2b0 Size(8)
	struct Unknown BT; //  0x2b8 Size(8)
	struct Unknown BT; //  0x2c0 Size(8)
	struct Unknown BT; //  0x2c8 Size(8)
	struct Unknown BT; //  0x2d0 Size(8)
	struct Unknown BT; //  0x2d8 Size(8)
	struct Unknown BT; //  0x2e0 Size(8)
	struct Unknown BT; //  0x2e8 Size(8)
	struct Unknown BT; //  0x2f0 Size(8)
	struct Unknown BT; //  0x2f8 Size(8)
	struct Unknown BT; //  0x300 Size(8)
	struct Unknown BT; //  0x308 Size(8)
	struct Unknown BT; //  0x310 Size(8)
	struct Unknown BT; //  0x318 Size(8)
	struct Unknown BT; //  0x320 Size(8)
	struct Unknown BT; //  0x328 Size(8)
	struct Unknown BT; //  0x330 Size(8)
	struct Unknown BT; //  0x338 Size(8)
	struct Unknown BT; //  0x340 Size(8)
	struct Unknown BT; //  0x348 Size(8)
	struct Unknown BT; //  0x350 Size(8)
	struct Unknown BT; //  0x358 Size(8)
	struct Unknown BT; //  0x360 Size(8)
	struct Unknown BT; //  0x368 Size(8)
	struct Unknown BT; //  0x370 Size(8)
	struct Unknown BT; //  0x378 Size(8)
	struct Unknown BT; //  0x380 Size(8)
	struct Unknown Button_1; //  0x388 Size(8)
	struct Unknown Button_2; //  0x390 Size(8)
	struct Unknown Button_3; //  0x398 Size(8)
	struct Unknown Button_4; //  0x3a0 Size(8)
	struct Unknown Image_1; //  0x3a8 Size(8)
	struct Unknown Image_2; //  0x3b0 Size(8)
	struct Unknown Image_3; //  0x3b8 Size(8)
	struct Unknown Image_4; //  0x3c0 Size(8)
	struct Unknown IM; //  0x3c8 Size(8)
	struct Unknown IM; //  0x3d0 Size(8)
	struct Unknown IM; //  0x3d8 Size(8)
	struct Unknown IM; //  0x3e0 Size(8)
	struct Unknown IM; //  0x3e8 Size(8)
	struct Unknown IM; //  0x3f0 Size(8)
	struct Unknown IM; //  0x3f8 Size(8)
	struct Unknown IM; //  0x400 Size(8)
	struct Unknown IM; //  0x408 Size(8)
	struct Unknown IM; //  0x410 Size(8)
	struct Unknown IM; //  0x418 Size(8)
	struct Unknown IM; //  0x420 Size(8)
	struct Unknown IM; //  0x428 Size(8)
	struct Unknown IM; //  0x430 Size(8)
	struct Unknown IM; //  0x438 Size(8)
	struct Unknown IM; //  0x440 Size(8)
	struct Unknown IM; //  0x448 Size(8)
	struct Unknown IM; //  0x450 Size(8)
	struct Unknown IM; //  0x458 Size(8)
	struct Unknown IM; //  0x460 Size(8)
	struct Unknown IM; //  0x468 Size(8)
	struct Unknown IM; //  0x470 Size(8)
	struct Unknown IM; //  0x478 Size(8)
	struct Unknown IM; //  0x480 Size(8)
	struct Unknown IM; //  0x488 Size(8)
	struct Unknown IM; //  0x490 Size(8)
	struct Unknown IM; //  0x498 Size(8)
	struct Unknown IM; //  0x4a0 Size(8)
	struct Unknown IM; //  0x4a8 Size(8)
	struct Unknown IM; //  0x4b0 Size(8)
	struct Unknown IM; //  0x4b8 Size(8)
	struct Unknown IM; //  0x4c0 Size(8)
	struct Unknown IM; //  0x4c8 Size(8)
	struct Unknown IM; //  0x4d0 Size(8)
	struct Unknown IM; //  0x4d8 Size(8)
	struct Unknown IM; //  0x4e0 Size(8)
	struct Unknown IM; //  0x4e8 Size(8)
	struct Unknown IM; //  0x4f0 Size(8)
	struct Unknown S; //  0x4f8 Size(8)
	struct Unknown S; //  0x500 Size(8)
	struct Unknown S; //  0x508 Size(8)
	struct Unknown S; //  0x510 Size(8)
	struct Unknown S; //  0x518 Size(8)
	struct Unknown S; //  0x520 Size(8)
	struct Unknown S; //  0x528 Size(8)
	struct Unknown TextBlock_2; //  0x530 Size(8)
	struct Unknown TextBlock_3; //  0x538 Size(8)
	struct Unknown TextBlock_4; //  0x540 Size(8)
	struct Unknown TextBlock_5; //  0x548 Size(8)
	struct Unknown TX; //  0x550 Size(8)
	struct Unknown TX; //  0x558 Size(8)
	struct Unknown TX; //  0x560 Size(8)
	struct Unknown TX; //  0x568 Size(8)
	struct Unknown TX; //  0x570 Size(8)
	struct Unknown TX; //  0x578 Size(8)
	struct Unknown TX; //  0x580 Size(8)
	struct Unknown TX; //  0x588 Size(8)
	struct Unknown TX; //  0x590 Size(8)
	struct Unknown TX; //  0x598 Size(8)
	struct Unknown TX; //  0x5a0 Size(8)
	struct Unknown TX; //  0x5a8 Size(8)
	struct Unknown TX; //  0x5b0 Size(8)
	struct Unknown TX; //  0x5b8 Size(8)
	struct Unknown TX; //  0x5c0 Size(8)
	struct Unknown TX; //  0x5c8 Size(8)
	struct Unknown TX; //  0x5d0 Size(8)
	struct Unknown TX; //  0x5d8 Size(8)
	struct Unknown TX; //  0x5e0 Size(8)
	struct Unknown TX; //  0x5e8 Size(8)
	struct Unknown TX; //  0x5f0 Size(8)
	struct Unknown TX; //  0x5f8 Size(8)
	struct Unknown TX; //  0x600 Size(8)
	struct Unknown TX; //  0x608 Size(8)
	struct Unknown TX; //  0x610 Size(8)
	struct Unknown TX; //  0x618 Size(8)
	struct Unknown TX; //  0x620 Size(8)
	struct Unknown TX; //  0x628 Size(8)
	struct Unknown TX; //  0x630 Size(8)
	struct Unknown TX; //  0x638 Size(8)
	struct Unknown TX; //  0x640 Size(8)
	struct Unknown TX; //  0x648 Size(8)
	struct Unknown TX; //  0x650 Size(8)
	struct Unknown TX; //  0x658 Size(8)
	struct Unknown TX; //  0x660 Size(8)
	struct Unknown TX; //  0x668 Size(8)
	struct Unknown TX; //  0x670 Size(8)
	struct Unknown TX; //  0x678 Size(8)
	struct Unknown VerticalBox_Perk; //  0x680 Size(8)
	struct Unknown NormalSlateColor; //  0x688 Size(28)
	struct Unknown SelectedSlateColor; //  0x6b0 Size(28)
	struct Unknown BlackMarketMainRef; //  0x6d8 Size(8)

	void SetConsumableData(enum class Unknow Type); // Function U.U.SetConsumableData(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Ani_Countdown; //  0x250 Size(8)
	struct Unknown TextBlock_RemailTime; //  0x258 Size(8)
	int32_t PreTime; //  0x260 Size(4)
	char ActiveTimer; //  0x264 Size(1)
	int32_t RemainTime; //  0x268 Size(4)

	struct FText Get_TextBlock_RemailTime_Text_1(); // Function U.U.Get_TextBlock_RemailTime_Text_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelAliveInfoWidget {
	struct Unknown UberGraphFrame; //  0x288 Size(8)
	struct Unknown Gold; //  0x290 Size(8)
	struct Unknown Gold; //  0x298 Size(8)
	struct Unknown Revival_Add; //  0x2a0 Size(8)
	struct Unknown AliveCount_Text; //  0x2a8 Size(8)
	struct Unknown AliveCount_Text_2; //  0x2b0 Size(8)
	struct Unknown HorizontalBox_8; //  0x2b8 Size(8)
	struct Unknown HorizontalBox_16; //  0x2c0 Size(8)
	struct Unknown HorizontalBox_89; //  0x2c8 Size(8)
	struct Unknown HorizontalBox_Alive; //  0x2d0 Size(8)
	struct Unknown HorizontalBox_Assist; //  0x2d8 Size(8)
	struct Unknown HorizontalBox_CurrentGold; //  0x2e0 Size(8)
	struct Unknown HorizontalBox_Kill; //  0x2e8 Size(8)
	struct Unknown HorizontalBox_Team; //  0x2f0 Size(8)
	struct Unknown Image; //  0x2f8 Size(8)
	struct Unknown Image_1; //  0x300 Size(8)
	struct Unknown Image_2; //  0x308 Size(8)
	struct Unknown Image_6; //  0x310 Size(8)
	struct Unknown Image_102; //  0x318 Size(8)
	struct Unknown Image_271; //  0x320 Size(8)
	struct Unknown Image_376; //  0x328 Size(8)
	struct Unknown Image_378; //  0x330 Size(8)
	struct Unknown Image_1584; //  0x338 Size(8)
	struct Unknown KillAliveBG; //  0x340 Size(8)
	struct Unknown KillAliveBG_2; //  0x348 Size(8)
	struct Unknown KillAliveBG_3; //  0x350 Size(8)
	struct Unknown KillAliveBG_4; //  0x358 Size(8)
	struct Unknown KillCount_Text; //  0x360 Size(8)
	struct Unknown KillCount_Text_2; //  0x368 Size(8)
	struct Unknown RichTextBlock_275; //  0x370 Size(8)
	struct Unknown SizeBox_1; //  0x378 Size(8)
	struct Unknown SizeBox_3; //  0x380 Size(8)
	struct Unknown Spacer_2; //  0x388 Size(8)
	struct Unknown T_AliveCount; //  0x390 Size(8)
	struct Unknown T_AssistCount; //  0x398 Size(8)
	struct Unknown T_KillCount; //  0x3a0 Size(8)
	struct Unknown T_TeamCount; //  0x3a8 Size(8)
	struct Unknown TextBlock_1; //  0x3b0 Size(8)
	struct Unknown TextBlock_CurrentGold; //  0x3b8 Size(8)
	char ShowKillCountUI; //  0x3c0 Size(1)
	int32_t CurrentKillCount; //  0x3c4 Size(4)
	int32_t NewVar_1; //  0x3c8 Size(4)
	struct Unknown ShowGoldDescHandle; //  0x3d0 Size(8)
	struct Unknown AliveCount_Text_1_1; //  0x3d8 Size(8)
	struct Unknown KillCount_Text_1_1; //  0x3e0 Size(8)

	enum class Unknow Get_HorizontalBox_CurrentGold_Visibility_1(); // Function U.U.Get_HorizontalBox_CurrentGold_Visibility_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Anim_OnFire; //  0x250 Size(8)
	struct Unknown FireLine; //  0x258 Size(8)

	void SetLineInfo(float Angle, float Length); // Function U.U.SetLineInfo(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x3d8 Size(8)
	struct Unknown BT; //  0x3e0 Size(8)
	struct Unknown BT; //  0x3e8 Size(8)
	struct Unknown BT; //  0x3f0 Size(8)
	struct Unknown BT; //  0x3f8 Size(8)
	struct Unknown BT; //  0x400 Size(8)
	struct Unknown BT; //  0x408 Size(8)
	struct Unknown BT; //  0x410 Size(8)
	struct Unknown BT; //  0x418 Size(8)
	struct Unknown C; //  0x420 Size(8)
	struct Unknown IM; //  0x428 Size(8)
	struct Unknown IM; //  0x430 Size(8)
	struct Unknown IM; //  0x438 Size(8)
	struct Unknown IM; //  0x440 Size(8)
	struct Unknown IM; //  0x448 Size(8)
	struct Unknown IM; //  0x450 Size(8)
	struct Unknown Menu02; //  0x458 Size(8)
	struct Unknown Menu03; //  0x460 Size(8)
	struct Unknown Menu04; //  0x468 Size(8)
	struct Unknown Menu05; //  0x470 Size(8)
	struct Unknown Menu06; //  0x478 Size(8)
	struct Unknown Menu07; //  0x480 Size(8)
	struct Unknown Menu08; //  0x488 Size(8)
	struct Unknown Menu09; //  0x490 Size(8)
	struct Unknown Overlay_Mask; //  0x498 Size(8)
	struct Unknown TX; //  0x4a0 Size(8)
	struct Unknown TX; //  0x4a8 Size(8)
	struct Unknown TX; //  0x4b0 Size(8)
	struct Unknown TX; //  0x4b8 Size(8)
	struct Unknown TX; //  0x4c0 Size(8)
	struct Unknown TX; //  0x4c8 Size(8)
	struct Unknown TX; //  0x4d0 Size(8)
	struct Unknown TX; //  0x4d8 Size(8)
	struct Unknown TX; //  0x4e0 Size(8)
	struct Unknown TX; //  0x4e8 Size(8)
	struct Unknown TX; //  0x4f0 Size(8)
	struct Unknown TX; //  0x4f8 Size(8)
	struct Unknown TX; //  0x500 Size(8)
	struct Unknown TX; //  0x508 Size(8)
	struct Unknown TX; //  0x510 Size(8)
	struct Unknown TX; //  0x518 Size(8)
	struct Unknown TX; //  0x520 Size(8)

	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelRoutePingWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Canvas; //  0x250 Size(8)
	struct FMulticastInlineDelegate OnMarkerClicked; //  0x258 Size(10)
	struct Unknown PlayerState; //  0x268 Size(8)
	struct TArray<Unknown> PointsArray; //  0x270 Size(10)
	struct Unknown StartPosition; //  0x280 Size(8)
	struct TArray<Unknown> PointWidgets; //  0x288 Size(10)
	struct TArray<Unknown> LineWidgets; //  0x298 Size(10)
	struct Unknown U; //  0x2a8 Size(8)
	char IsDrawing; //  0x2b0 Size(1)
	struct Unknown GuideLineWidgetRef; //  0x2b8 Size(8)
	struct Unknown GuideLinePos; //  0x2c0 Size(8)
	char IsUpdate; //  0x2c8 Size(1)

	void InitGuideLine(); // Function U.U.InitGuideLine(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Event2; //  0x250 Size(8)
	struct Unknown Event; //  0x258 Size(8)
	struct Unknown Anim_Second; //  0x260 Size(8)
	struct Unknown Hide; //  0x268 Size(8)
	struct Unknown Infos_Ani; //  0x270 Size(8)
	struct Unknown Anim_Defeat; //  0x278 Size(8)
	struct Unknown Anim_Victory; //  0x280 Size(8)
	struct Unknown Arrow; //  0x288 Size(8)
	struct Unknown Arrow_2; //  0x290 Size(8)
	struct Unknown ArrowLine; //  0x298 Size(8)
	struct Unknown ArrowLine_2; //  0x2a0 Size(8)
	struct Unknown BackgroundBlur; //  0x2a8 Size(8)
	struct Unknown BackgroundBlur_447; //  0x2b0 Size(8)
	struct Unknown BlackBG01; //  0x2b8 Size(8)
	struct Unknown BlackBG02; //  0x2c0 Size(8)
	struct Unknown BottomLine; //  0x2c8 Size(8)
	struct Unknown BottomLine_2; //  0x2d0 Size(8)
	struct Unknown Button; //  0x2d8 Size(8)
	struct Unknown Button_2; //  0x2e0 Size(8)
	struct Unknown Button_104; //  0x2e8 Size(8)
	struct Unknown CanvasPanel_7; //  0x2f0 Size(8)
	struct Unknown CanvasPanel_49; //  0x2f8 Size(8)
	struct Unknown CanvasPanel_488; //  0x300 Size(8)
	struct Unknown CanvasPanel_832; //  0x308 Size(8)
	struct Unknown Glow1; //  0x310 Size(8)
	struct Unknown Glow1_2; //  0x318 Size(8)
	struct Unknown Glow2; //  0x320 Size(8)
	struct Unknown Glow3; //  0x328 Size(8)
	struct Unknown Glow3_2; //  0x330 Size(8)
	struct Unknown GlowLine; //  0x338 Size(8)
	struct Unknown HeadShot; //  0x340 Size(8)
	struct Unknown HorizontalBox_KillerWeaponInfo; //  0x348 Size(8)
	struct Unknown HorizontalBox_Rarity; //  0x350 Size(8)
	struct Unknown Image_4; //  0x358 Size(8)
	struct Unknown Image_5; //  0x360 Size(8)
	struct Unknown Image_6; //  0x368 Size(8)
	struct Unknown Image_7; //  0x370 Size(8)
	struct Unknown Image_8; //  0x378 Size(8)
	struct Unknown Image_16; //  0x380 Size(8)
	struct Unknown Image_17; //  0x388 Size(8)
	struct Unknown Image_18; //  0x390 Size(8)
	struct Unknown Image_19; //  0x398 Size(8)
	struct Unknown Image_20; //  0x3a0 Size(8)
	struct Unknown Image_21; //  0x3a8 Size(8)
	struct Unknown Image_22; //  0x3b0 Size(8)
	struct Unknown Image_23; //  0x3b8 Size(8)
	struct Unknown Image_252; //  0x3c0 Size(8)
	struct Unknown Image_505; //  0x3c8 Size(8)
	struct Unknown Image_1091; //  0x3d0 Size(8)
	struct Unknown Image_1443; //  0x3d8 Size(8)
	struct Unknown Image_1558; //  0x3e0 Size(8)
	struct Unknown L_Wing01; //  0x3e8 Size(8)
	struct Unknown L_Wing01_2; //  0x3f0 Size(8)
	struct Unknown L_Wing01_3; //  0x3f8 Size(8)
	struct Unknown L_Wing01_4; //  0x400 Size(8)
	struct Unknown L_Wing02; //  0x408 Size(8)
	struct Unknown L_Wing02_2; //  0x410 Size(8)
	struct Unknown L_Wing02_3; //  0x418 Size(8)
	struct Unknown L_Wing02_4; //  0x420 Size(8)
	struct Unknown L_Wing03; //  0x428 Size(8)
	struct Unknown L_Wing03_2; //  0x430 Size(8)
	struct Unknown L_Wing03_3; //  0x438 Size(8)
	struct Unknown L_Wing03_4; //  0x440 Size(8)
	struct Unknown L_WingLine; //  0x448 Size(8)
	struct Unknown L_WingLine_2; //  0x450 Size(8)
	struct Unknown Logo; //  0x458 Size(8)
	struct Unknown Logo_2; //  0x460 Size(8)
	struct Unknown Overlay_1; //  0x468 Size(8)
	struct Unknown Overlay_WeaponLevel; //  0x470 Size(8)
	struct Unknown PosX; //  0x478 Size(8)
	struct Unknown PosY; //  0x480 Size(8)
	struct Unknown PosZ; //  0x488 Size(8)
	struct Unknown R_Wing01; //  0x490 Size(8)
	struct Unknown R_Wing01_2; //  0x498 Size(8)
	struct Unknown R_Wing01_3; //  0x4a0 Size(8)
	struct Unknown R_Wing01_4; //  0x4a8 Size(8)
	struct Unknown R_Wing02; //  0x4b0 Size(8)
	struct Unknown R_Wing02_2; //  0x4b8 Size(8)
	struct Unknown R_Wing02_3; //  0x4c0 Size(8)
	struct Unknown R_Wing02_4; //  0x4c8 Size(8)
	struct Unknown R_Wing03; //  0x4d0 Size(8)
	struct Unknown R_Wing03_2; //  0x4d8 Size(8)
	struct Unknown R_Wing03_3; //  0x4e0 Size(8)
	struct Unknown R_Wing03_4; //  0x4e8 Size(8)
	struct Unknown R_WingLine; //  0x4f0 Size(8)
	struct Unknown R_WingLine_2; //  0x4f8 Size(8)
	struct Unknown Ribbon; //  0x500 Size(8)
	struct Unknown Ribbon_2; //  0x508 Size(8)
	struct Unknown Ring; //  0x510 Size(8)
	struct Unknown ScrollBox_1; //  0x518 Size(8)
	struct Unknown T_DamageType; //  0x520 Size(8)
	struct Unknown T_WeaponLevel; //  0x528 Size(8)
	struct Unknown TextBlock_3; //  0x530 Size(8)
	struct Unknown TextBlock_4; //  0x538 Size(8)
	struct Unknown TextBlock_5; //  0x540 Size(8)
	struct Unknown TextBlock_6; //  0x548 Size(8)
	struct Unknown TextBlock_8; //  0x550 Size(8)
	struct Unknown TextBlock_9; //  0x558 Size(8)
	struct Unknown TextBlock_10; //  0x560 Size(8)
	struct Unknown TextBlock_11; //  0x568 Size(8)
	struct Unknown TextBlock_900; //  0x570 Size(8)
	struct Unknown TopLine; //  0x578 Size(8)
	struct Unknown TopLine_2; //  0x580 Size(8)
	struct Unknown U; //  0x588 Size(8)
	struct Unknown U; //  0x590 Size(8)
	struct Unknown WeaponName; //  0x598 Size(8)
	struct Unknown WidgetSwitcher_DamageCauser; //  0x5a0 Size(8)
	struct Unknown WinText1; //  0x5a8 Size(8)
	struct Unknown WinText1_2; //  0x5b0 Size(8)
	struct Unknown WinText1_3; //  0x5b8 Size(8)
	struct Unknown WinText1_4; //  0x5c0 Size(8)
	struct Unknown WinText2; //  0x5c8 Size(8)
	struct Unknown WinText3; //  0x5d0 Size(8)
	char MatchEnd; //  0x5d8 Size(1)
	struct Unknown AnimationData; //  0x5d9 Size(2)
	struct Unknown MatchEndWidgetRef; //  0x5e0 Size(8)
	struct Unknown SimpleResult; //  0x5e8 Size(a8)
	struct TArray<Unknown> SimpleTimer; //  0x690 Size(10)
	struct FMulticastInlineDelegate EventDispatcher_HideComplete; //  0x6a0 Size(10)
	char bSuccessWinEventCall; //  0x6b0 Size(1)
	struct TArray<Unknown> PlayingAudio; //  0x6b8 Size(10)
	char bTestMode; //  0x6c8 Size(1)
	char bTestIsWin; //  0x6c9 Size(1)
	float MatchFinalResultShowTime; //  0x6cc Size(4)

	void SequenceEvent__ENTRYPOINTU_2(); // Function U.U.SequenceEvent__ENTRYPOINTU_2(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Button; //  0x250 Size(8)
	struct Unknown Button_Text; //  0x258 Size(8)
	struct Unknown Overlay_Button; //  0x260 Size(8)
	struct FText ButtonText; //  0x268 Size(18)
	struct FMulticastInlineDelegate OnClicked; //  0x280 Size(10)
	struct FMulticastInlineDelegate OnPressed; //  0x290 Size(10)
	struct FMulticastInlineDelegate OnReleased; //  0x2a0 Size(10)
	struct FMulticastInlineDelegate OnHovered; //  0x2b0 Size(10)

	void BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButt(); // Function U.U.BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButt(BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Level_Up_New; //  0x250 Size(8)
	struct Unknown VSkill_Motion; //  0x258 Size(8)
	struct Unknown FinalitySkill_Motion; //  0x260 Size(8)
	struct Unknown LEVEL_UP; //  0x268 Size(8)
	struct Unknown CanvasPanel_294; //  0x270 Size(8)
	struct Unknown FSkill_Info; //  0x278 Size(8)
	struct Unknown FSkill_Title; //  0x280 Size(8)
	struct Unknown HorizontalBox_290; //  0x288 Size(8)
	struct Unknown Image_1; //  0x290 Size(8)
	struct Unknown Image_2; //  0x298 Size(8)
	struct Unknown Image_4; //  0x2a0 Size(8)
	struct Unknown Image_5; //  0x2a8 Size(8)
	struct Unknown Image_6; //  0x2b0 Size(8)
	struct Unknown Image_9; //  0x2b8 Size(8)
	struct Unknown Image_10; //  0x2c0 Size(8)
	struct Unknown Image_245; //  0x2c8 Size(8)
	struct Unknown Image_247; //  0x2d0 Size(8)
	struct Unknown Image_413; //  0x2d8 Size(8)
	struct Unknown Image_458; //  0x2e0 Size(8)
	struct Unknown Image_602; //  0x2e8 Size(8)
	struct Unknown Image_UltimateGetMat; //  0x2f0 Size(8)
	struct Unknown IMG_FinalitySkill; //  0x2f8 Size(8)
	struct Unknown Img_UltimateMaterial; //  0x300 Size(8)
	struct Unknown Light; //  0x308 Size(8)
	struct Unknown T_Desc; //  0x310 Size(8)
	struct Unknown T_Level; //  0x318 Size(8)
	struct Unknown T_PerkName; //  0x320 Size(8)
	struct Unknown TextBlock_LevelUpNewText; //  0x328 Size(8)
	struct Unknown U; //  0x330 Size(8)
	struct Unknown U; //  0x338 Size(8)
	struct Unknown VSkill_Info; //  0x340 Size(8)
	struct Unknown VSkill_Titile; //  0x348 Size(8)
	struct Unknown VSkillThumbStroke_02; //  0x350 Size(8)
	struct Unknown WidgetSwitcher_LevelUpInfo; //  0x358 Size(8)
	struct Unknown Handle_LevelUpEffect; //  0x360 Size(8)
	float EffectDelay; //  0x368 Size(4)
	struct TArray<Unknown> PerkInfoQue; //  0x370 Size(10)
	struct Unknown CurrentPerkInfo; //  0x380 Size(2c)
	struct TArray<Unknown> PerkLevelUpInfo; //  0x3b0 Size(10)
	struct Unknown PerkLevelUpData; //  0x3c0 Size(178)
	struct Unknown CurrentPerkData; //  0x538 Size(e0)
	int32_t CurrentLevel; //  0x618 Size(4)
	char IsAlreadyUnlockedUltimate; //  0x61c Size(1)
	char CurrentLevelUpInfo; //  0x61d Size(1)
	struct TArray<Unknown> CurrentLevelQue; //  0x620 Size(10)
	float CurrentUltimateMaterialValue; //  0x630 Size(4)
	char UltimateUpdate; //  0x634 Size(1)
	struct Unknown UltimateMaterialInstance; //  0x638 Size(8)
	float UltimateAnimTime; //  0x640 Size(4)
	struct Unknown UltimateGetMaterialInstance; //  0x648 Size(8)

	void SequenceEvent__ENTRYPOINTU_4(struct Unknown Image_365); // Function U.U.SequenceEvent__ENTRYPOINTU_4(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelReportUserProgramWidget {
	struct Unknown UberGraphFrame; //  0x278 Size(8)
	struct Unknown btn_Cancel; //  0x280 Size(8)
	struct Unknown btn_report; //  0x288 Size(8)
	struct Unknown Button_2; //  0x290 Size(8)
	struct Unknown Button_3; //  0x298 Size(8)
	struct Unknown Button_4; //  0x2a0 Size(8)
	struct Unknown Button_5; //  0x2a8 Size(8)
	struct Unknown CheckBox_2; //  0x2b0 Size(8)
	struct Unknown CheckBox_3; //  0x2b8 Size(8)
	struct Unknown CheckBox_4; //  0x2c0 Size(8)
	struct Unknown CheckBox_5; //  0x2c8 Size(8)
	struct Unknown combobox_button_overlay; //  0x2d0 Size(8)
	struct Unknown combobox_string; //  0x2d8 Size(8)
	struct Unknown Image; //  0x2e0 Size(8)
	struct Unknown Image_2; //  0x2e8 Size(8)
	struct Unknown Image_545; //  0x2f0 Size(8)
	struct Unknown NormalArrow; //  0x2f8 Size(8)
	struct Unknown OpeningArrow; //  0x300 Size(8)
	struct Unknown popup; //  0x308 Size(8)
	struct Unknown txt_description; //  0x310 Size(8)
	struct Unknown txt_nickname; //  0x318 Size(8)
	struct Unknown uw; //  0x320 Size(8)
	struct FText DescriptionText; //  0x328 Size(18)
	struct TArray<Unknown> ReportIndexText; //  0x340 Size(10)
	struct FText DefaultComboString; //  0x350 Size(18)
	int32_t CurrentSelectIndex; //  0x368 Size(4)
	char CheckCloseComboArrow; //  0x36c Size(1)

	void CheckSelectProgramIndex(); // Function U.U.CheckSelectProgramIndex(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelReportUserConfirmWidget {
	struct Unknown UberGraphFrame; //  0x258 Size(8)
	struct Unknown btn_Cancel; //  0x260 Size(8)
	struct Unknown btn_confirm; //  0x268 Size(8)
	struct Unknown popup; //  0x270 Size(8)
	struct Unknown txt_description; //  0x278 Size(8)
	struct Unknown uw; //  0x280 Size(8)

	void PreConstruct(char IsDesignTime); // Function U.U.PreConstruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Anim_Bouns; //  0x250 Size(8)
	struct Unknown 1; //  0x258 Size(8)
	struct Unknown 10; //  0x260 Size(8)
	struct Unknown 100; //  0x268 Size(8)
	struct Unknown 1000; //  0x270 Size(8)
	struct Unknown Empty; //  0x278 Size(8)
	struct Unknown Image_7; //  0x280 Size(8)
	struct Unknown Image_11; //  0x288 Size(8)
	struct Unknown Image_14; //  0x290 Size(8)
	struct Unknown Image_15; //  0x298 Size(8)
	struct Unknown Image_16; //  0x2a0 Size(8)
	struct Unknown Image_17; //  0x2a8 Size(8)
	struct Unknown Image_18; //  0x2b0 Size(8)
	struct Unknown Image_20; //  0x2b8 Size(8)
	struct Unknown Image_21; //  0x2c0 Size(8)
	struct Unknown Image_22; //  0x2c8 Size(8)
	struct Unknown Image_23; //  0x2d0 Size(8)
	struct Unknown Image_1473; //  0x2d8 Size(8)
	struct Unknown TextBlock_4; //  0x2e0 Size(8)
	struct Unknown TextLight_3; //  0x2e8 Size(8)
	int32_t Save; //  0x2f0 Size(4)
	struct Unknown LoopSound; //  0x2f4 Size(4)
	char IsStopSound; //  0x2f8 Size(1)

	void Divide(int32_t Value, int32_t& RetS1, int32_t& RetS2); // Function U.U.Divide(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown HorizontalBox_Next; //  0x250 Size(8)
	struct Unknown ProgressBar_Current; //  0x258 Size(8)
	struct Unknown ProgressBar_; //  0x260 Size(8)
	struct Unknown ProgressBar_Up; //  0x268 Size(8)
	struct Unknown TextBlock_Current; //  0x270 Size(8)
	struct Unknown TextBlock_Max; //  0x278 Size(8)
	struct Unknown TextBlock_Next; //  0x280 Size(8)
	char EnableUpdate; //  0x288 Size(1)
	float CurTime; //  0x28c Size(4)
	float ShowTime; //  0x290 Size(4)
	float EndPoint; //  0x294 Size(4)
	float ChangeValue; //  0x298 Size(4)
	float StartPoint; //  0x29c Size(4)
	float Min; //  0x2a0 Size(4)
	float MAX; //  0x2a4 Size(4)
	char IsUPState; //  0x2a8 Size(1)
	struct FMulticastInlineDelegate Dispatcher_ProgressBarDone; //  0x2b0 Size(10)

	void SetData(float StartPoint, float EndPoint, float Min, float MAX, float ShowTime, char Play); // Function U.U.SetData(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown FadeIn3; //  0x250 Size(8)
	struct Unknown FadeIn2; //  0x258 Size(8)
	struct Unknown Rank; //  0x260 Size(8)
	struct Unknown RankUp; //  0x268 Size(8)
	struct Unknown FadeOut; //  0x270 Size(8)
	struct Unknown FadeIn; //  0x278 Size(8)
	struct Unknown Button_DeathCam; //  0x280 Size(8)
	struct Unknown Button_Exit; //  0x288 Size(8)
	struct Unknown Button_Report; //  0x290 Size(8)
	struct Unknown Button_Spectate; //  0x298 Size(8)
	struct Unknown Image; //  0x2a0 Size(8)
	struct Unknown Image_2; //  0x2a8 Size(8)
	struct Unknown Image_3; //  0x2b0 Size(8)
	struct Unknown Image_4; //  0x2b8 Size(8)
	struct Unknown Image_5; //  0x2c0 Size(8)
	struct Unknown Image_6; //  0x2c8 Size(8)
	struct Unknown Image_7; //  0x2d0 Size(8)
	struct Unknown Image_8; //  0x2d8 Size(8)
	struct Unknown Image_135; //  0x2e0 Size(8)
	struct Unknown Image_149; //  0x2e8 Size(8)
	struct Unknown Image_239; //  0x2f0 Size(8)
	struct Unknown Image_314; //  0x2f8 Size(8)
	struct Unknown Image_377; //  0x300 Size(8)
	struct Unknown Image_444; //  0x308 Size(8)
	struct Unknown Image_477; //  0x310 Size(8)
	struct Unknown Image_518; //  0x318 Size(8)
	struct Unknown Image_531; //  0x320 Size(8)
	struct Unknown Image_745; //  0x328 Size(8)
	struct Unknown Image_992; //  0x330 Size(8)
	struct Unknown Image_1373; //  0x338 Size(8)
	struct Unknown Image_1459; //  0x340 Size(8)
	struct Unknown Image_1506; //  0x348 Size(8)
	struct Unknown Image_1508; //  0x350 Size(8)
	struct Unknown Image_1925; //  0x358 Size(8)
	struct Unknown Image_NextTireIcon; //  0x360 Size(8)
	struct Unknown Light_01; //  0x368 Size(8)
	struct Unknown Light_02; //  0x370 Size(8)
	struct Unknown Light_03; //  0x378 Size(8)
	struct Unknown Light_04; //  0x380 Size(8)
	struct Unknown Light_05; //  0x388 Size(8)
	struct Unknown Light_06; //  0x390 Size(8)
	struct Unknown Light_07; //  0x398 Size(8)
	struct Unknown Light_08; //  0x3a0 Size(8)
	struct Unknown Overlay_Rank; //  0x3a8 Size(8)
	struct Unknown Overlay_Report; //  0x3b0 Size(8)
	struct Unknown Overlay_Spectate; //  0x3b8 Size(8)
	struct Unknown ProgressBar_Current; //  0x3c0 Size(8)
	struct Unknown ProgressBar_; //  0x3c8 Size(8)
	struct Unknown ProgressBar_Up; //  0x3d0 Size(8)
	struct Unknown ScrollBox_GoldList; //  0x3d8 Size(8)
	struct Unknown ScrollBox_ItemList; //  0x3e0 Size(8)
	struct Unknown SizeBox_8; //  0x3e8 Size(8)
	struct Unknown Spacer_6018; //  0x3f0 Size(8)
	struct Unknown Spacer_6217; //  0x3f8 Size(8)
	struct Unknown Spacer_Center; //  0x400 Size(8)
	struct Unknown T_RemainTime; //  0x408 Size(8)
	struct Unknown team_kill; //  0x410 Size(8)
	struct Unknown Team_Revives; //  0x418 Size(8)
	struct Unknown Text_Report; //  0x420 Size(8)
	struct Unknown TextBlock_1425; //  0x428 Size(8)
	struct Unknown TextBlock_CurrentRP; //  0x430 Size(8)
	struct Unknown TextBlock_ItemCount; //  0x438 Size(8)
	struct Unknown TextBlock_Kill; //  0x440 Size(8)
	struct Unknown TextBlock_MatchRP; //  0x448 Size(8)
	struct Unknown TextBlock_NextRP; //  0x450 Size(8)
	struct Unknown TextBlock_Rank; //  0x458 Size(8)
	struct Unknown TextBlock_Resuscitates; //  0x460 Size(8)
	struct Unknown TextBlock_Title; //  0x468 Size(8)
	struct Unknown TextBlock_TotalGold; //  0x470 Size(8)
	struct Unknown TextBlock_TotalTeamCount; //  0x478 Size(8)
	struct Unknown U; //  0x480 Size(8)
	struct Unknown U; //  0x488 Size(8)
	struct Unknown U_1; //  0x490 Size(8)
	struct Unknown U_2; //  0x498 Size(8)
	struct Unknown U; //  0x4a0 Size(8)
	struct Unknown VerticalBox_188; //  0x4a8 Size(8)
	struct Unknown FinalResultData; //  0x4b0 Size(4)
	struct Unknown PlayerState; //  0x4b8 Size(8)
	struct Unknown Timehandle_Rank; //  0x4c0 Size(8)
	int32_t PlayerOriRP; //  0x4c8 Size(4)
	int32_t TargetRP; //  0x4cc Size(4)
	int32_t CurrentRP; //  0x4d0 Size(4)
	int32_t NextTireRP; //  0x4d4 Size(4)
	char Increase; //  0x4d8 Size(1)
	int32_t CurrentTierID; //  0x4dc Size(4)
	char bMaxPrograssbar; //  0x4e0 Size(1)
	struct Unknown MatchEndWidgetRef; //  0x4e8 Size(8)
	int32_t RandomGold; //  0x4f0 Size(4)
	struct Unknown GoldHandle; //  0x4f8 Size(8)
	char IsWinningCam; //  0x500 Size(1)
	int32_t GainGoldValue; //  0x504 Size(4)
	struct Unknown GainGoldHandle; //  0x508 Size(8)
	struct Unknown StartSound; //  0x510 Size(4)

	void SequenceEvent__ENTRYPOINTU_4(); // Function U.U.SequenceEvent__ENTRYPOINTU_4(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown TextBlock_Gold; //  0x248 Size(8)
	struct Unknown TextBlock_Title; //  0x250 Size(8)
	struct Unknown ColorType1; //  0x258 Size(28)
	struct Unknown ColorType2; //  0x280 Size(28)

	void Init(struct FText Title, int32_t Value); // Function U.U.Init(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Image; //  0x250 Size(8)
	struct Unknown Image_2; //  0x258 Size(8)
	struct Unknown Image_3; //  0x260 Size(8)
	struct Unknown Image_4; //  0x268 Size(8)
	struct Unknown Image_917; //  0x270 Size(8)
	struct Unknown Img_TypeIcon; //  0x278 Size(8)
	struct Unknown KeyImageWidget; //  0x280 Size(8)
	struct Unknown KeyImageWidget_2; //  0x288 Size(8)
	struct Unknown KeyImageWidget_3; //  0x290 Size(8)
	struct Unknown KeyImageWidget_4; //  0x298 Size(8)
	struct Unknown KeyImageWidget_5; //  0x2a0 Size(8)
	struct Unknown T_Context; //  0x2a8 Size(8)
	struct Unknown T_Context_2; //  0x2b0 Size(8)
	struct Unknown T_Context_3; //  0x2b8 Size(8)
	struct Unknown T_Context_4; //  0x2c0 Size(8)
	struct Unknown T_Context_5; //  0x2c8 Size(8)
	struct Unknown Text_SkillName; //  0x2d0 Size(8)
	struct Unknown VB_Nuclear; //  0x2d8 Size(8)
	struct Unknown VB_Retreat; //  0x2e0 Size(8)
	struct Unknown WidgetSwitcher_126; //  0x2e8 Size(8)

	void SetTutorialInfo(enum class Unknow SkillType); // Function U.U.SetTutorialInfo(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelSkillMapWidget {
	struct Unknown UberGraphFrame; //  0x250 Size(8)
	struct Unknown Tutorial_MouseCursor; //  0x258 Size(8)
	struct Unknown Tutorial_Arrow_Loop2; //  0x260 Size(8)
	struct Unknown RadarDecoLight; //  0x268 Size(8)
	struct Unknown RadarCircle_M; //  0x270 Size(8)
	struct Unknown BackgroundBlur_154; //  0x278 Size(8)
	struct Unknown B; //  0x280 Size(8)
	struct Unknown Button_Nuclear; //  0x288 Size(8)
	struct Unknown CP_RealMapSize; //  0x290 Size(8)
	struct Unknown Image; //  0x298 Size(8)
	struct Unknown Image_2; //  0x2a0 Size(8)
	struct Unknown Image_3; //  0x2a8 Size(8)
	struct Unknown Image_4; //  0x2b0 Size(8)
	struct Unknown Image_5; //  0x2b8 Size(8)
	struct Unknown Image_6; //  0x2c0 Size(8)
	struct Unknown Image_7; //  0x2c8 Size(8)
	struct Unknown Image_171; //  0x2d0 Size(8)
	struct Unknown Image_181; //  0x2d8 Size(8)
	struct Unknown Image_228; //  0x2e0 Size(8)
	struct Unknown Image_326; //  0x2e8 Size(8)
	struct Unknown Image_405; //  0x2f0 Size(8)
	struct Unknown Image_508; //  0x2f8 Size(8)
	struct Unknown Img_MapBackGround; //  0x300 Size(8)
	struct Unknown Img_MapCenter; //  0x308 Size(8)
	struct Unknown Img_RadarDummy; //  0x310 Size(8)
	struct Unknown Tutorial; //  0x318 Size(8)
	struct Unknown U; //  0x320 Size(8)
	struct Unknown MapBackGroundPosition; //  0x328 Size(8)
	struct Unknown RadarDummyPosition; //  0x330 Size(8)

	void MapClickEvent(struct Unknown ClickLocation); // Function U.U.MapClickEvent(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelTopInfoWidget {
	struct Unknown UberGraphFrame; //  0x278 Size(8)
	struct Unknown Anim_HideWidget; //  0x280 Size(8)
	struct Unknown Canvas; //  0x288 Size(8)
	struct Unknown Canvas_Minimap; //  0x290 Size(8)
	struct Unknown CanvasPanel_StatupFirst; //  0x298 Size(8)
	struct Unknown CanvasPanel_StatupThird; //  0x2a0 Size(8)
	struct Unknown T_GameVersion; //  0x2a8 Size(8)
	struct Unknown U; //  0x2b0 Size(8)
	struct Unknown U; //  0x2b8 Size(8)
	struct Unknown U; //  0x2c0 Size(8)
	struct Unknown U; //  0x2c8 Size(8)
	struct Unknown U; //  0x2d0 Size(8)
	struct Unknown U; //  0x2d8 Size(8)
	struct Unknown U; //  0x2e0 Size(8)
	struct Unknown U; //  0x2e8 Size(8)
	struct Unknown U; //  0x2f0 Size(8)
	struct Unknown U; //  0x2f8 Size(8)
	struct Unknown Vertical_MinimapAndTeamInfo; //  0x300 Size(8)
	struct Unknown PlayerController; //  0x308 Size(8)
	struct Unknown U; //  0x310 Size(8)
	struct Unknown MainWidget; //  0x318 Size(8)
	enum class Unknow CurrentState; //  0x320 Size(1)
	struct Unknown Last; //  0x324 Size(c)

	void ShowStatupAnim(struct Unknown& StatupParams); // Function U.U.ShowStatupAnim(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelItemRecipeTreeWidget {
	struct Unknown UberGraphFrame; //  0x258 Size(8)
	struct Unknown HorizontalBox_11; //  0x260 Size(8)
	struct Unknown HorizontalBox_12; //  0x268 Size(8)
	struct Unknown HorizontalBox_13; //  0x270 Size(8)
	struct Unknown HorizontalBox_14; //  0x278 Size(8)
	struct Unknown HorizontalBox_15; //  0x280 Size(8)
	struct Unknown HorizontalBox_16; //  0x288 Size(8)
	struct Unknown HorizontalBox_00; //  0x290 Size(8)
	struct Unknown HorizontalBox_02; //  0x298 Size(8)
	struct Unknown HorizontalBox_03; //  0x2a0 Size(8)
	struct Unknown HorizontalBox_04; //  0x2a8 Size(8)
	struct Unknown HorizontalBox_05; //  0x2b0 Size(8)
	struct Unknown HorizontalBox_06; //  0x2b8 Size(8)
	struct Unknown HorizontalBox_07; //  0x2c0 Size(8)
	struct Unknown HorizontalBox_08; //  0x2c8 Size(8)
	struct Unknown HorizontalBox_09; //  0x2d0 Size(8)
	struct Unknown Line00; //  0x2d8 Size(8)
	struct Unknown Line01; //  0x2e0 Size(8)
	struct Unknown Line02; //  0x2e8 Size(8)
	struct Unknown Line03; //  0x2f0 Size(8)
	struct Unknown Line04; //  0x2f8 Size(8)
	struct Unknown Line05; //  0x300 Size(8)
	struct Unknown Line06; //  0x308 Size(8)
	struct Unknown Line07; //  0x310 Size(8)
	struct Unknown Line08; //  0x318 Size(8)
	struct Unknown Line09; //  0x320 Size(8)
	struct Unknown Line10; //  0x328 Size(8)
	struct Unknown Line11; //  0x330 Size(8)
	struct Unknown Line12; //  0x338 Size(8)
	struct Unknown Line13; //  0x340 Size(8)
	struct Unknown Line14; //  0x348 Size(8)
	struct Unknown Line15; //  0x350 Size(8)
	struct Unknown Overlay_Main; //  0x358 Size(8)
	struct Unknown Slot00; //  0x360 Size(8)
	struct Unknown Slot01; //  0x368 Size(8)
	struct Unknown Slot02; //  0x370 Size(8)
	struct Unknown Slot03; //  0x378 Size(8)
	struct Unknown Slot04; //  0x380 Size(8)
	struct Unknown Slot05; //  0x388 Size(8)
	struct Unknown Slot06; //  0x390 Size(8)
	struct Unknown Slot07; //  0x398 Size(8)
	struct Unknown Slot08; //  0x3a0 Size(8)
	struct Unknown Slot09; //  0x3a8 Size(8)
	struct Unknown Slot10; //  0x3b0 Size(8)
	struct Unknown Slot11; //  0x3b8 Size(8)
	struct Unknown Slot12; //  0x3c0 Size(8)
	struct Unknown Slot13; //  0x3c8 Size(8)
	struct Unknown Slot14; //  0x3d0 Size(8)
	struct Unknown Slot15; //  0x3d8 Size(8)
	struct Unknown Slot16; //  0x3e0 Size(8)
	struct Unknown Slot17; //  0x3e8 Size(8)
	struct Unknown Slot18; //  0x3f0 Size(8)
	struct Unknown Slot19; //  0x3f8 Size(8)
	struct Unknown Slot20; //  0x400 Size(8)
	struct Unknown Slot21; //  0x408 Size(8)
	struct Unknown Slot22; //  0x410 Size(8)
	struct Unknown Slot23; //  0x418 Size(8)
	struct Unknown Slot24; //  0x420 Size(8)
	struct Unknown Slot25; //  0x428 Size(8)
	struct Unknown Slot26; //  0x430 Size(8)
	struct Unknown Slot27; //  0x438 Size(8)
	struct Unknown Slot28; //  0x440 Size(8)
	struct Unknown Slot29; //  0x448 Size(8)
	struct Unknown Slot30; //  0x450 Size(8)
	struct Unknown Slot31; //  0x458 Size(8)
	struct Unknown VerticalBox_2438; //  0x460 Size(8)
	struct Unknown HoverWidget; //  0x468 Size(8)
	struct FName HaveItemKey; //  0x470 Size(8)
	struct FName TargetItemKey; //  0x478 Size(8)
	char IsSearchExpertWeapon; //  0x480 Size(1)

	void ShowTreeNode(struct Unknown WidgetInfo, char bShow, char bCombinable); // Function U.U.ShowTreeNode(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown GoldImage; //  0x250 Size(8)
	struct Unknown Image_362; //  0x258 Size(8)
	struct Unknown Message; //  0x260 Size(8)
	struct Unknown PriceValue; //  0x268 Size(8)
	struct Unknown SizeBox_2; //  0x270 Size(8)

	void SetPriceData(struct FText ItemName, int32_t Price); // Function U.U.SetPriceData(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown AmmoImage; //  0x250 Size(8)
	struct Unknown AmmoText; //  0x258 Size(8)
	struct Unknown Button_2; //  0x260 Size(8)
	struct Unknown CanvasPanel_98; //  0x268 Size(8)
	struct Unknown HorizontalBox_Perk; //  0x270 Size(8)
	struct Unknown HorizontalBox_Rarity; //  0x278 Size(8)
	struct Unknown Image; //  0x280 Size(8)
	struct Unknown Image_369; //  0x288 Size(8)
	struct Unknown Image_704; //  0x290 Size(8)
	struct Unknown Image_874; //  0x298 Size(8)
	struct Unknown Image_924; //  0x2a0 Size(8)
	struct Unknown Image_1262; //  0x2a8 Size(8)
	struct Unknown Image_1400; //  0x2b0 Size(8)
	struct Unknown Reinforce; //  0x2b8 Size(8)
	struct Unknown TextBlock_291; //  0x2c0 Size(8)
	struct Unknown U; //  0x2c8 Size(8)
	struct Unknown U_2; //  0x2d0 Size(8)
	struct Unknown U_3; //  0x2d8 Size(8)
	struct Unknown WeaponBg; //  0x2e0 Size(8)
	struct Unknown WeaponImage01; //  0x2e8 Size(8)
	struct Unknown WeaponName; //  0x2f0 Size(8)
	struct Unknown WidgetSwitcher_1; //  0x2f8 Size(8)
	struct Unknown DraggedWidget; //  0x300 Size(8)
	struct Unknown WeaponData; //  0x308 Size(98)
	struct FMulticastInlineDelegate OnDropEventDispatcher; //  0x3a0 Size(10)
	struct FName AmmorKey; //  0x3b0 Size(8)
	struct FMulticastInlineDelegate ShowToolTipEventDispatcher; //  0x3b8 Size(10)
	char IsDefaultWeapon; //  0x3c8 Size(1)
	int32_t ClickNum; //  0x3cc Size(4)
	struct FMulticastInlineDelegate OnDefaultWeaponEvent; //  0x3d0 Size(10)
	struct Unknown SaveKey; //  0x3e0 Size(18)

	struct Unknown OnMouseButtonUp(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonUp(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Cont; //  0x250 Size(8)
	struct Unknown DropHoverImage; //  0x258 Size(8)
	struct Unknown EmptyImage; //  0x260 Size(8)
	struct Unknown EquipImage; //  0x268 Size(8)
	struct Unknown HoverImage2; //  0x270 Size(8)
	struct Unknown ItemImage; //  0x278 Size(8)
	struct Unknown WidgetSwitcher_2; //  0x280 Size(8)
	int32_t Index; //  0x288 Size(4)
	struct FMulticastInlineDelegate OnDropEventDispatcher; //  0x290 Size(10)
	struct Unknown Data; //  0x2a0 Size(100)
	struct Unknown DraggedWidget; //  0x3a0 Size(8)
	char IsEmpty; //  0x3a8 Size(1)
	struct FMulticastInlineDelegate ShowToolTipEventDispatcher; //  0x3b0 Size(10)
	struct FMulticastInlineDelegate OnChangeSlotEventDispatcher; //  0x3c0 Size(10)
	struct FMulticastInlineDelegate OnRightClickEventDispatcher; //  0x3d0 Size(10)
	struct Unknown SaveKey; //  0x3e0 Size(18)
	int32_t ClickNum; //  0x3f8 Size(4)

	struct Unknown OnMouseButtonUp(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonUp(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelPersonalSupplyBoxWidget {
	struct Unknown UberGraphFrame; //  0x3f8 Size(8)
	struct Unknown Ani_PadOn; //  0x400 Size(8)
	struct Unknown BG_Pad; //  0x408 Size(8)
	struct Unknown btn_PerkDeckEnabled; //  0x410 Size(8)
	struct Unknown Canvas_ChangeEnable; //  0x418 Size(8)
	struct Unknown CanvasPanel; //  0x420 Size(8)
	struct Unknown CanvasPanel_3; //  0x428 Size(8)
	struct Unknown ComboBoxString_237; //  0x430 Size(8)
	struct Unknown CurHaveGoldValue; //  0x438 Size(8)
	struct Unknown CurPriceText; //  0x440 Size(8)
	struct Unknown Down; //  0x448 Size(8)
	struct Unknown EquipBg; //  0x450 Size(8)
	struct Unknown Free; //  0x458 Size(8)
	struct Unknown GoldImage; //  0x460 Size(8)
	struct Unknown GoldImage_2; //  0x468 Size(8)
	struct Unknown GoldLack; //  0x470 Size(8)
	struct Unknown HaveWeaponText; //  0x478 Size(8)
	struct Unknown HorizontalBox_1; //  0x480 Size(8)
	struct Unknown Image; //  0x488 Size(8)
	struct Unknown Image_2; //  0x490 Size(8)
	struct Unknown Image_3; //  0x498 Size(8)
	struct Unknown Image_4; //  0x4a0 Size(8)
	struct Unknown Image_5; //  0x4a8 Size(8)
	struct Unknown Image_91; //  0x4b0 Size(8)
	struct Unknown Image_119; //  0x4b8 Size(8)
	struct Unknown Image_172; //  0x4c0 Size(8)
	struct Unknown Image_192; //  0x4c8 Size(8)
	struct Unknown Image_251; //  0x4d0 Size(8)
	struct Unknown Image_362; //  0x4d8 Size(8)
	struct Unknown Image_400; //  0x4e0 Size(8)
	struct Unknown Image_545; //  0x4e8 Size(8)
	struct Unknown Image_552; //  0x4f0 Size(8)
	struct Unknown Image_614; //  0x4f8 Size(8)
	struct Unknown Image_722; //  0x500 Size(8)
	struct Unknown Image_1025; //  0x508 Size(8)
	struct Unknown Image_1262; //  0x510 Size(8)
	struct Unknown ItemIcon; //  0x518 Size(8)
	struct Unknown Items_1Text; //  0x520 Size(8)
	struct Unknown ItemScroll; //  0x528 Size(8)
	struct Unknown ItemsText; //  0x530 Size(8)
	struct Unknown OkText; //  0x538 Size(8)
	struct Unknown Overlay_4; //  0x540 Size(8)
	struct Unknown Overlay_215; //  0x548 Size(8)
	struct Unknown PriceBg; //  0x550 Size(8)
	struct Unknown PriceBg_2; //  0x558 Size(8)
	struct Unknown PriceText; //  0x560 Size(8)
	struct Unknown PriceValue; //  0x568 Size(8)
	struct Unknown RichTextBlock; //  0x570 Size(8)
	struct Unknown RichTextBlock_74; //  0x578 Size(8)
	struct Unknown SizeBox_4; //  0x580 Size(8)
	struct Unknown SlotBg; //  0x588 Size(8)
	struct Unknown SortText; //  0x590 Size(8)
	struct Unknown SpecialWeaponText; //  0x598 Size(8)
	struct Unknown TextBlock_3; //  0x5a0 Size(8)
	struct Unknown Up; //  0x5a8 Size(8)
	struct Unknown U_2; //  0x5b0 Size(8)
	struct Unknown U_3; //  0x5b8 Size(8)
	struct Unknown U_4; //  0x5c0 Size(8)
	struct Unknown U_5; //  0x5c8 Size(8)
	struct Unknown U_6; //  0x5d0 Size(8)
	struct Unknown U_186; //  0x5d8 Size(8)
	struct Unknown U; //  0x5e0 Size(8)
	struct Unknown U; //  0x5e8 Size(8)
	struct Unknown VerticalBox_1; //  0x5f0 Size(8)
	struct Unknown WeaponScroll; //  0x5f8 Size(8)
	struct Unknown WidgetSwitcher_1; //  0x600 Size(8)
	struct TArray<Unknown> SortType; //  0x608 Size(10)
	struct TArray<Unknown> RarityList; //  0x618 Size(10)
	struct TMap<{}, {}>Unknown ComboxList; //  0x628 Size(50)
	struct FString SelectComboBox; //  0x678 Size(10)
	char IsShowAni; //  0x688 Size(1)
	char IsFree; //  0x689 Size(1)
	struct Unknown SaveSupplyItem; //  0x690 Size(100)
	int32_t CurOwnGold; //  0x790 Size(4)
	int32_t TotalPrice; //  0x794 Size(4)

	struct Unknown OnMouseButtonDown(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelInventoryWidget {
	struct Unknown UberGraphFrame; //  0x278 Size(8)
	struct Unknown FadeIn; //  0x280 Size(8)
	struct Unknown BackgroundBlur_1; //  0x288 Size(8)
	struct Unknown BackPackBound_begin; //  0x290 Size(8)
	struct Unknown BackPackBound_end; //  0x298 Size(8)
	struct Unknown BlackMarketOverlay; //  0x2a0 Size(8)
	struct Unknown BT; //  0x2a8 Size(8)
	struct Unknown Button_SortByTime; //  0x2b0 Size(8)
	struct Unknown Button_SortByType; //  0x2b8 Size(8)
	struct Unknown CanvasPanel_1; //  0x2c0 Size(8)
	struct Unknown CanvasPanel_7; //  0x2c8 Size(8)
	struct Unknown CanvasPanel_16; //  0x2d0 Size(8)
	struct Unknown Carried_Area; //  0x2d8 Size(8)
	struct Unknown CarriedBound_begin; //  0x2e0 Size(8)
	struct Unknown CarriedBound_end; //  0x2e8 Size(8)
	struct Unknown CarriedList; //  0x2f0 Size(8)
	struct Unknown CarriedList_StrongBox; //  0x2f8 Size(8)
	struct Unknown CheckBox; //  0x300 Size(8)
	struct Unknown CheckBox_1; //  0x308 Size(8)
	struct Unknown CheckBox_2; //  0x310 Size(8)
	struct Unknown CombineRecipe; //  0x318 Size(8)
	struct Unknown EquippedList; //  0x320 Size(8)
	struct Unknown HorizontalBox; //  0x328 Size(8)
	struct Unknown HorizontalBox_7; //  0x330 Size(8)
	struct Unknown HorizontalBox_WeightMax; //  0x338 Size(8)
	struct Unknown Image; //  0x340 Size(8)
	struct Unknown Image_2; //  0x348 Size(8)
	struct Unknown Image_3; //  0x350 Size(8)
	struct Unknown Image_5; //  0x358 Size(8)
	struct Unknown Image_6; //  0x360 Size(8)
	struct Unknown Image_7; //  0x368 Size(8)
	struct Unknown Image_8; //  0x370 Size(8)
	struct Unknown Image_9; //  0x378 Size(8)
	struct Unknown Image_10; //  0x380 Size(8)
	struct Unknown Image_223; //  0x388 Size(8)
	struct Unknown Image_227; //  0x390 Size(8)
	struct Unknown Image_271; //  0x398 Size(8)
	struct Unknown Image_324; //  0x3a0 Size(8)
	struct Unknown Image_489; //  0x3a8 Size(8)
	struct Unknown Image_556; //  0x3b0 Size(8)
	struct Unknown Image_Guess; //  0x3b8 Size(8)
	struct Unknown Image_ItemInfo; //  0x3c0 Size(8)
	struct Unknown IM; //  0x3c8 Size(8)
	struct Unknown IM; //  0x3d0 Size(8)
	struct Unknown InputMaskImage; //  0x3d8 Size(8)
	struct Unknown Material_Area; //  0x3e0 Size(8)
	struct Unknown MaterialBound_begin; //  0x3e8 Size(8)
	struct Unknown MaterialBound_end; //  0x3f0 Size(8)
	struct Unknown ProgressBar_MaxWeight; //  0x3f8 Size(8)
	struct Unknown ProgressBar_Weight; //  0x400 Size(8)
	struct Unknown ProgressBar_WeightBag; //  0x408 Size(8)
	struct Unknown ProximityBound; //  0x410 Size(8)
	struct Unknown ProximityList; //  0x418 Size(8)
	struct Unknown StrongBox_Area; //  0x420 Size(8)
	struct Unknown T_AdditionalMaxWeight; //  0x428 Size(8)
	struct Unknown T_AdditionalMaxWeightSymbol; //  0x430 Size(8)
	struct Unknown T_AdditionalWeight; //  0x438 Size(8)
	struct Unknown T_AdditionalWeightSymbol; //  0x440 Size(8)
	struct Unknown T_MaxWeight; //  0x448 Size(8)
	struct Unknown T_StrongboxCount; //  0x450 Size(8)
	struct Unknown T_Weight; //  0x458 Size(8)
	struct Unknown T_WeightSlash; //  0x460 Size(8)
	struct Unknown TextBlock_11; //  0x468 Size(8)
	struct Unknown TextBlock_CurrentGold; //  0x470 Size(8)
	struct Unknown TextBlock_SortByTime; //  0x478 Size(8)
	struct Unknown TextBlock_SortByType; //  0x480 Size(8)
	struct Unknown U; //  0x488 Size(8)
	struct Unknown U; //  0x490 Size(8)
	struct Unknown U; //  0x498 Size(8)
	struct Unknown U; //  0x4a0 Size(8)
	struct Unknown U; //  0x4a8 Size(8)
	struct Unknown U; //  0x4b0 Size(8)
	struct Unknown WeaponBound; //  0x4b8 Size(8)
	struct Unknown WeaponList; //  0x4c0 Size(8)
	struct Unknown WeightPerCent; //  0x4c8 Size(8)
	struct Unknown PlayerController; //  0x4d0 Size(8)
	char bItemDrag; //  0x4d8 Size(1)
	struct Unknown DropPopup; //  0x4e0 Size(8)
	float MaximumWeight; //  0x4e8 Size(4)
	int32_t OldProximityItemCount; //  0x4ec Size(4)
	struct Unknown ProximityGround; //  0x4f0 Size(8)
	struct Unknown DefaultPawnRef; //  0x4f8 Size(8)
	struct TArray<Unknown> ProximityGroundPool; //  0x500 Size(10)
	struct Unknown OldDefaultPawnRef; //  0x510 Size(8)
	struct Unknown CharacterTimerHandle; //  0x518 Size(8)
	struct TArray<Unknown> DropBoxWidgetList; //  0x520 Size(10)
	struct Unknown DropBoxParentWidget; //  0x530 Size(8)
	struct Unknown SavedInventorySettings; //  0x538 Size(8)
	struct Unknown EquipedWeapon; //  0x540 Size(8)
	struct TArray<Unknown> OldWeaponList; //  0x548 Size(10)
	char ChangeAttachments; //  0x558 Size(1)
	struct Unknown ItemHoverWidget; //  0x560 Size(8)
	struct Unknown MainWidget; //  0x568 Size(8)
	struct FMulticastInlineDelegate EventDispatcher_OnCloseInventory; //  0x570 Size(10)
	struct TArray<Unknown> StealableWidgetList; //  0x580 Size(10)
	char bItemInfoHovered; //  0x590 Size(1)
	char bFirstTimeNotifyItemInfo; //  0x591 Size(1)
	struct Unknown Timer_ItemInfoTooltip; //  0x598 Size(8)
	char IsShowingItemInfoTooltip; //  0x5a0 Size(1)
	int32_t FirstTimeCapsuleItem; //  0x5a4 Size(4)
	int32_t FirstTimeCraft; //  0x5a8 Size(4)
	char bGoldWarning; //  0x5ac Size(1)
	struct Unknown DefaultWeightColor; //  0x5b0 Size(28)
	struct Unknown MinusWeightColor; //  0x5d8 Size(28)
	struct Unknown PlusWeightColor; //  0x600 Size(28)

	void AllHiddenMaterialWidget(); // Function U.U.AllHiddenMaterialWidget(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown FadeIn; //  0x250 Size(8)
	struct Unknown Image; //  0x258 Size(8)
	struct Unknown Image_2; //  0x260 Size(8)
	struct Unknown Image_69; //  0x268 Size(8)
	char NextScene; //  0x270 Size(1)

	void Destory(); // Function U.U.Destory(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown Image_91; //  0x248 Size(8)
	struct Unknown InventoryCharacterRef; //  0x250 Size(8)
	char Visible; //  0x258 Size(1)

	enum class Unknow GetVisibility_1(); // Function U.U.GetVisibility_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown Image_Selected; //  0x248 Size(8)
	struct Unknown TextBlock_Selected; //  0x250 Size(8)
	int32_t PlayerIndex; //  0x258 Size(4)

	void SetTeamIndex(int32_t PlayerIndex); // Function U.U.SetTeamIndex(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Bg; //  0x250 Size(8)
	struct Unknown btn_Cancel; //  0x258 Size(8)
	struct Unknown btn_OK; //  0x260 Size(8)
	struct Unknown Image_2; //  0x268 Size(8)

	void Hide(); // Function U.U.Hide(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelGamePopupWidget {
	struct Unknown UberGraphFrame; //  0x250 Size(8)
	struct Unknown BT; //  0x258 Size(8)
	struct Unknown BT; //  0x260 Size(8)
	struct Unknown BT; //  0x268 Size(8)
	struct Unknown BT; //  0x270 Size(8)
	struct Unknown Button_1; //  0x278 Size(8)
	struct Unknown Button_2; //  0x280 Size(8)
	struct Unknown Button_4; //  0x288 Size(8)
	struct Unknown Image_2; //  0x290 Size(8)
	struct Unknown IM; //  0x298 Size(8)
	struct Unknown Overlay_Exit; //  0x2a0 Size(8)
	struct Unknown TextBlock_2; //  0x2a8 Size(8)
	struct Unknown U; //  0x2b0 Size(8)
	struct Unknown VerticalBox_InGame; //  0x2b8 Size(8)
	struct Unknown VerticalBox_Lobby; //  0x2c0 Size(8)
	struct FName MapNameToExit; //  0x2c8 Size(8)
	char IsLobby; //  0x2d0 Size(1)

	struct Unknown OnMouseButtonDown(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown T_Desc; //  0x248 Size(8)
	struct Unknown U_3; //  0x250 Size(8)
	struct Unknown ItemOption; //  0x258 Size(b8)

	void SetItemOption(struct Unknown& ItemOption); // Function U.U.SetItemOption(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown Ani_MouseRight; //  0x248 Size(8)
	struct Unknown Image; //  0x250 Size(8)
	struct Unknown Image_2; //  0x258 Size(8)
	struct Unknown Image_292; //  0x260 Size(8)
	struct Unknown Image_503; //  0x268 Size(8)

	void HideMouse(); // Function U.U.HideMouse(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown BGImage; //  0x250 Size(8)
	struct Unknown BorderImage; //  0x258 Size(8)
	struct Unknown DisableImage; //  0x260 Size(8)
	struct Unknown Image_177; //  0x268 Size(8)
	struct Unknown ItemCount; //  0x270 Size(8)
	struct Unknown ItemImage; //  0x278 Size(8)
	struct Unknown WidgetReference; //  0x280 Size(8)
	char Lock; //  0x288 Size(1)
	enum class Unknow InventoryDragType; //  0x289 Size(1)
	struct Unknown ChangeTarget; //  0x290 Size(8)
	struct Unknown PlayerHUDRef; //  0x298 Size(8)

	void GetBravoHotelPlayerHUD(struct Unknown& NewParam); // Function U.U.GetBravoHotelPlayerHUD(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown BlockMouse; //  0x250 Size(8)
	struct Unknown Button_Accept; //  0x258 Size(8)
	struct Unknown Button_Cancel; //  0x260 Size(8)
	struct Unknown Button_Close; //  0x268 Size(8)
	struct Unknown Button_Max; //  0x270 Size(8)
	struct Unknown Button_Min; //  0x278 Size(8)
	struct Unknown Image_9; //  0x280 Size(8)
	struct Unknown Slider_137; //  0x288 Size(8)
	struct Unknown TextBlock_Accept; //  0x290 Size(8)
	struct Unknown TextBlock_MaxCount; //  0x298 Size(8)
	struct Unknown TextBlock_MinCount; //  0x2a0 Size(8)
	struct Unknown TextBlock_Title; //  0x2a8 Size(8)
	struct Unknown TextBox_DropCount; //  0x2b0 Size(8)
	int32_t CurrentCount; //  0x2b8 Size(4)
	int32_t MaxCount; //  0x2bc Size(4)
	struct FText LastEnteredText; //  0x2c0 Size(18)
	struct Unknown ItemInfo; //  0x2d8 Size(98)
	struct Unknown Item; //  0x370 Size(490)
	struct Unknown PickupRef; //  0x800 Size(8)
	struct Unknown DropBoxRef; //  0x808 Size(8)
	struct Unknown InventoryWidget; //  0x810 Size(8)
	char bClosing; //  0x818 Size(1)
	struct Unknown MaterialSlot; //  0x820 Size(8)

	void CheckNumeric(struct FString CheckString, char& CheckResult); // Function U.U.CheckNumeric(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Anim_LoopHintSpecialWeapon; //  0x250 Size(8)
	struct Unknown Button_183; //  0x258 Size(8)
	struct Unknown Button_283; //  0x260 Size(8)
	struct Unknown CanvasPanel; //  0x268 Size(8)
	struct Unknown CanvasPanel_2; //  0x270 Size(8)
	struct Unknown Image_2; //  0x278 Size(8)
	struct Unknown Image_3; //  0x280 Size(8)
	struct Unknown Image_4; //  0x288 Size(8)
	struct Unknown Image_185; //  0x290 Size(8)
	struct Unknown Image_186; //  0x298 Size(8)
	struct Unknown Image_189; //  0x2a0 Size(8)
	struct Unknown Image_297; //  0x2a8 Size(8)
	struct Unknown Img_Find; //  0x2b0 Size(8)
	struct Unknown Overlay_2; //  0x2b8 Size(8)
	struct Unknown SizeBox_3; //  0x2c0 Size(8)
	struct Unknown T_SerchButton; //  0x2c8 Size(8)
	struct Unknown TextBlock_5; //  0x2d0 Size(8)
	struct Unknown TextBlock_495; //  0x2d8 Size(8)
	struct Unknown Throbber; //  0x2e0 Size(8)
	struct Unknown U; //  0x2e8 Size(8)
	struct Unknown U_2; //  0x2f0 Size(8)
	struct Unknown U_3; //  0x2f8 Size(8)
	struct Unknown U_4; //  0x300 Size(8)
	struct Unknown U_5; //  0x308 Size(8)
	struct Unknown U_6; //  0x310 Size(8)
	struct Unknown U_7; //  0x318 Size(8)
	struct Unknown U_8; //  0x320 Size(8)
	struct Unknown U_9; //  0x328 Size(8)
	struct Unknown U_10; //  0x330 Size(8)
	struct Unknown U_11; //  0x338 Size(8)
	struct Unknown U_12; //  0x340 Size(8)
	struct Unknown VerticalBox_2; //  0x348 Size(8)
	struct Unknown VerticalBox_4; //  0x350 Size(8)
	char ShowButton; //  0x358 Size(1)
	int32_t Index; //  0x35c Size(4)
	struct TArray<Unknown> TempList; //  0x360 Size(10)
	int32_t MaxSlotCount; //  0x370 Size(4)
	char EnableShowExpertWeapon; //  0x374 Size(1)

	void Get(int32_t Index, struct Unknown& Slot); // Function U.U.Get(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown perk_Icon_Scale; //  0x250 Size(8)
	struct Unknown HorizontalBox_Rarity; //  0x258 Size(8)
	struct Unknown Image; //  0x260 Size(8)
	struct Unknown Image_2; //  0x268 Size(8)
	struct Unknown Image_3; //  0x270 Size(8)
	struct Unknown Image_4; //  0x278 Size(8)
	struct Unknown Image_5; //  0x280 Size(8)
	struct Unknown Image_6; //  0x288 Size(8)
	struct Unknown Image_7; //  0x290 Size(8)
	struct Unknown Image_328; //  0x298 Size(8)
	struct Unknown Img_GradeBG; //  0x2a0 Size(8)
	struct Unknown Img_Icon; //  0x2a8 Size(8)
	struct Unknown ItemOptionInfo; //  0x2b0 Size(b8)

	void SequenceEvent__ENTRYPOINTU_1(); // Function U.U.SequenceEvent__ENTRYPOINTU_1(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown WeaponPerk_ani; //  0x250 Size(8)
	struct Unknown Image_102; //  0x258 Size(8)
	struct Unknown Image_254; //  0x260 Size(8)
	struct Unknown Image_Grade_Color_Line; //  0x268 Size(8)

	void SetBuffIcon(struct TSoftObjectPtr<Unknown> Icon, int32_t Rarity); // Function U.U.SetBuffIcon(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown PlayerController; //  0x250 Size(8)
	struct Unknown InventoryItemInfo; //  0x258 Size(98)
	struct Unknown InventoryItemDetailInfo; //  0x2f0 Size(490)
	struct Unknown WeaponInfo; //  0x780 Size(b30)
	struct Unknown ItemSlotHoverWIdget; //  0x12b0 Size(8)
	struct Unknown InventoryWidget; //  0x12b8 Size(8)
	struct Unknown DraggedWidget; //  0x12c0 Size(8)
	enum class Unknow InventorySlotWidgetKind; //  0x12c8 Size(1)
	struct Unknown DragItemBrush; //  0x12d0 Size(88)
	char RButtonDown; //  0x1358 Size(1)
	char bEpuipped; //  0x1359 Size(1)

	void IsEquipped(char& Return); // Function U.U.IsEquipped(Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x1360 Size(8)
	struct Unknown Complete_ani; //  0x1368 Size(8)
	struct Unknown Searching_ani; //  0x1370 Size(8)
	struct Unknown Blank_SkillBG; //  0x1378 Size(8)
	struct Unknown Border_507; //  0x1380 Size(8)
	struct Unknown Button_332; //  0x1388 Size(8)
	struct Unknown Get_SkillBG; //  0x1390 Size(8)
	struct Unknown Get_SkillBG_lv5; //  0x1398 Size(8)
	struct Unknown Get_SkillBG_lv6; //  0x13a0 Size(8)
	struct Unknown Get_SkillBG_lv7; //  0x13a8 Size(8)
	struct Unknown HorizontalBox_Rarity; //  0x13b0 Size(8)
	struct Unknown Image; //  0x13b8 Size(8)
	struct Unknown Image_2; //  0x13c0 Size(8)
	struct Unknown Image_3; //  0x13c8 Size(8)
	struct Unknown Image_4; //  0x13d0 Size(8)
	struct Unknown Image_5; //  0x13d8 Size(8)
	struct Unknown Image_6; //  0x13e0 Size(8)
	struct Unknown Image_7; //  0x13e8 Size(8)
	struct Unknown Image_8; //  0x13f0 Size(8)
	struct Unknown Image_9; //  0x13f8 Size(8)
	struct Unknown Image_10; //  0x1400 Size(8)
	struct Unknown Image_12; //  0x1408 Size(8)
	struct Unknown Image_16; //  0x1410 Size(8)
	struct Unknown Image_332; //  0x1418 Size(8)
	struct Unknown Image_689; //  0x1420 Size(8)
	struct Unknown Image_690; //  0x1428 Size(8)
	struct Unknown Image_Full; //  0x1430 Size(8)
	struct Unknown Image_Have; //  0x1438 Size(8)
	struct Unknown Img_Active; //  0x1440 Size(8)
	struct Unknown IMG_Complete; //  0x1448 Size(8)
	struct Unknown IMG_ItemIcon; //  0x1450 Size(8)
	struct Unknown MouseHover_2; //  0x1458 Size(8)
	struct Unknown MouseHover_; //  0x1460 Size(8)
	struct Unknown MousePress_2; //  0x1468 Size(8)
	struct Unknown MousePress_; //  0x1470 Size(8)
	struct Unknown MyWeapon; //  0x1478 Size(8)
	struct Unknown Searching; //  0x1480 Size(8)
	struct Unknown Searching_; //  0x1488 Size(8)
	struct Unknown SizeBox_1; //  0x1490 Size(8)
	struct Unknown SizeBox_8; //  0x1498 Size(8)
	struct Unknown T_PerkName; //  0x14a0 Size(8)
	struct Unknown T_PerkName_2; //  0x14a8 Size(8)
	struct Unknown T_PerkName_3; //  0x14b0 Size(8)
	struct Unknown T_PerkName_4; //  0x14b8 Size(8)
	struct Unknown VerticalBox_1; //  0x14c0 Size(8)
	struct Unknown HoverWidget; //  0x14c8 Size(8)
	char Selected; //  0x14d0 Size(1)
	struct Unknown SelectItem; //  0x14d4 Size(10)
	struct Unknown NewVar_1; //  0x14e8 Size(8)
	char EnableSearch; //  0x14f0 Size(1)
	struct Unknown Temp; //  0x14f4 Size(10)
	char IsComplete; //  0x1504 Size(1)

	struct Unknown OnMouseButtonDown(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x1360 Size(8)
	struct Unknown Bg; //  0x1368 Size(8)
	struct Unknown BGImage; //  0x1370 Size(8)
	struct Unknown BorderImage; //  0x1378 Size(8)
	struct Unknown EmptyImage; //  0x1380 Size(8)
	struct Unknown ItemImage; //  0x1388 Size(8)
	struct Unknown OverImage; //  0x1390 Size(8)
	struct Unknown SizeBox_1; //  0x1398 Size(8)
	enum class Unknow WeaponAttachmentType; //  0x13a0 Size(1)
	int32_t WeaponSlotIndex; //  0x13a4 Size(4)
	char IsHover; //  0x13a8 Size(1)
	struct Unknown WeaponSlotWidget; //  0x13b0 Size(8)
	enum class Unknow WeaponAttachmentUseType; //  0x13b8 Size(1)
	int32_t SlotMode; //  0x13bc Size(4)
	struct Unknown HoverWidget; //  0x13c0 Size(8)

	void SetHoverWidgetRef(); // Function U.U.SetHoverWidgetRef(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown Image_81; //  0x248 Size(8)
	struct Unknown Image_86; //  0x250 Size(8)
	struct Unknown Image_88; //  0x258 Size(8)
	struct Unknown Image_89; //  0x260 Size(8)
	struct Unknown Image_90; //  0x268 Size(8)
	struct Unknown Image_91; //  0x270 Size(8)
	struct Unknown Image_92; //  0x278 Size(8)
	struct Unknown Image_93; //  0x280 Size(8)
	struct Unknown Image_94; //  0x288 Size(8)
	struct Unknown Image_95; //  0x290 Size(8)
	struct Unknown Image_96; //  0x298 Size(8)
	struct Unknown Image_97; //  0x2a0 Size(8)
	struct Unknown Image_98; //  0x2a8 Size(8)
	struct Unknown Image_99; //  0x2b0 Size(8)
	struct Unknown Image_100; //  0x2b8 Size(8)
	struct Unknown Image_101; //  0x2c0 Size(8)
	struct Unknown Image_102; //  0x2c8 Size(8)
	struct Unknown Image_103; //  0x2d0 Size(8)
	struct Unknown Image_104; //  0x2d8 Size(8)
	struct Unknown Image_107; //  0x2e0 Size(8)
	struct Unknown Image_108; //  0x2e8 Size(8)
	struct Unknown Image_119; //  0x2f0 Size(8)
	struct Unknown Image_120; //  0x2f8 Size(8)
	struct Unknown Image_121; //  0x300 Size(8)
	struct Unknown Image_122; //  0x308 Size(8)
	struct Unknown Image_123; //  0x310 Size(8)
	struct Unknown Image_134; //  0x318 Size(8)
	struct Unknown Image_137; //  0x320 Size(8)
	struct Unknown Image_138; //  0x328 Size(8)
	struct Unknown Image_139; //  0x330 Size(8)
	struct Unknown Image_140; //  0x338 Size(8)
	struct Unknown Image_141; //  0x340 Size(8)
	struct Unknown Image_142; //  0x348 Size(8)
	struct Unknown Image_143; //  0x350 Size(8)
	struct Unknown Image_144; //  0x358 Size(8)
	struct Unknown Image_145; //  0x360 Size(8)
	struct Unknown Image_146; //  0x368 Size(8)
	struct Unknown Image_147; //  0x370 Size(8)
	struct Unknown Image_148; //  0x378 Size(8)
	struct Unknown Image_149; //  0x380 Size(8)
	struct Unknown Image_152; //  0x388 Size(8)
	struct Unknown Image_153; //  0x390 Size(8)
	struct Unknown Image_154; //  0x398 Size(8)
	struct Unknown Image_155; //  0x3a0 Size(8)
	struct Unknown Image_156; //  0x3a8 Size(8)
	struct Unknown Image_157; //  0x3b0 Size(8)
	struct Unknown Image_158; //  0x3b8 Size(8)
	struct Unknown Image_159; //  0x3c0 Size(8)
	struct Unknown Image_160; //  0x3c8 Size(8)
	struct Unknown Image_161; //  0x3d0 Size(8)
	struct Unknown Image_162; //  0x3d8 Size(8)
	struct Unknown Image_163; //  0x3e0 Size(8)
	struct Unknown Image_164; //  0x3e8 Size(8)
	struct Unknown WidgetSwitcher_1; //  0x3f0 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x1360 Size(8)
	struct Unknown Ani_Tutorial_Glow; //  0x1368 Size(8)
	struct Unknown P_Upgrade_Arrow; //  0x1370 Size(8)
	struct Unknown C_SlotHover_ItemState_Hide; //  0x1378 Size(8)
	struct Unknown C_SlotHover_ItemState_Show; //  0x1380 Size(8)
	struct Unknown Hover_Gold; //  0x1388 Size(8)
	struct Unknown P_SlotHover; //  0x1390 Size(8)
	struct Unknown BGImage; //  0x1398 Size(8)
	struct Unknown CanvasPanel_ITemState; //  0x13a0 Size(8)
	struct Unknown Count; //  0x13a8 Size(8)
	struct Unknown Effect_Craft; //  0x13b0 Size(8)
	struct Unknown HorizontalBox_Rarity; //  0x13b8 Size(8)
	struct Unknown HoverImage; //  0x13c0 Size(8)
	struct Unknown HoverImage_Gold; //  0x13c8 Size(8)
	struct Unknown IconRepair; //  0x13d0 Size(8)
	struct Unknown Image_1; //  0x13d8 Size(8)
	struct Unknown Image_2; //  0x13e0 Size(8)
	struct Unknown Image_222; //  0x13e8 Size(8)
	struct Unknown ItemImage; //  0x13f0 Size(8)
	struct Unknown ItemNameName; //  0x13f8 Size(8)
	struct Unknown ItemState_Text; //  0x1400 Size(8)
	struct Unknown NeedMaterial; //  0x1408 Size(8)
	struct Unknown Overlay_Key; //  0x1410 Size(8)
	struct Unknown ProgressBar_475; //  0x1418 Size(8)
	struct Unknown SizeBox_1; //  0x1420 Size(8)
	struct Unknown TextBlock_ShortCut; //  0x1428 Size(8)
	struct Unknown Tutorial_Glow; //  0x1430 Size(8)
	struct Unknown U; //  0x1438 Size(8)
	struct Unknown U; //  0x1440 Size(8)
	struct Unknown WeaponItemImage; //  0x1448 Size(8)
	char bGold; //  0x1450 Size(1)
	struct Unknown SelectedHoverImage; //  0x1458 Size(8)
	struct Unknown MedicalBGColor; //  0x1460 Size(10)
	struct FMulticastInlineDelegate SetSlotInfo; //  0x1470 Size(10)
	int32_t SlotIndex; //  0x1480 Size(4)
	struct FName RecipeKey; //  0x1484 Size(8)
	struct Unknown RecipeData; //  0x1490 Size(38)
	char bLeftClicked; //  0x14c8 Size(1)
	char CanCraft; //  0x14c9 Size(1)

	void Get(char& bResult, struct Unknown& WeaponInfo); // Function U.U.Get(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Title; //  0x250 Size(8)
	struct Unknown W; //  0x258 Size(8)
	struct FText TitleText; //  0x260 Size(18)
	char TitleVisible; //  0x278 Size(1)
	struct Unknown TargetActor; //  0x280 Size(8)
	struct TArray<Unknown> ItemInfos; //  0x288 Size(10)
	struct Unknown InventoryWidget; //  0x298 Size(8)

	void CreateSlots(); // Function U.U.CreateSlots(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown DropBoxPanel; //  0x250 Size(8)
	struct Unknown Image_1; //  0x258 Size(8)
	struct Unknown Image_2; //  0x260 Size(8)
	struct Unknown Image_3; //  0x268 Size(8)
	struct Unknown Image_4; //  0x270 Size(8)
	struct Unknown Image_5; //  0x278 Size(8)
	struct Unknown Image_9; //  0x280 Size(8)
	struct Unknown Image_10; //  0x288 Size(8)
	struct Unknown Image_11; //  0x290 Size(8)
	struct Unknown Image_12; //  0x298 Size(8)
	struct Unknown Image_13; //  0x2a0 Size(8)
	struct Unknown Image_14; //  0x2a8 Size(8)
	struct Unknown Image_15; //  0x2b0 Size(8)
	struct Unknown Image_16; //  0x2b8 Size(8)
	struct Unknown Image_17; //  0x2c0 Size(8)
	struct Unknown Image_18; //  0x2c8 Size(8)
	struct Unknown Image_19; //  0x2d0 Size(8)
	struct Unknown Image_20; //  0x2d8 Size(8)
	struct Unknown Image_21; //  0x2e0 Size(8)
	struct Unknown ScrollBox_2; //  0x2e8 Size(8)
	struct Unknown SizeBox_1; //  0x2f0 Size(8)
	struct Unknown W; //  0x2f8 Size(8)
	struct Unknown WrapBox_1; //  0x300 Size(8)

	char DropItem(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.DropItem(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x1360 Size(8)
	struct Unknown Anim_LoopHintMaterial; //  0x1368 Size(8)
	struct Unknown Anim_Upgrade; //  0x1370 Size(8)
	struct Unknown P_Upgrade_Arrow; //  0x1378 Size(8)
	struct Unknown C_SlotHover_ItemState_Hide; //  0x1380 Size(8)
	struct Unknown C_SlotHover_ItemState_Show; //  0x1388 Size(8)
	struct Unknown Hover_Gold; //  0x1390 Size(8)
	struct Unknown P_SlotHover; //  0x1398 Size(8)
	struct Unknown BGImage; //  0x13a0 Size(8)
	struct Unknown CanvasPanel_ITemState; //  0x13a8 Size(8)
	struct Unknown CanvasPanel_Unnecessary; //  0x13b0 Size(8)
	struct Unknown Count; //  0x13b8 Size(8)
	struct Unknown Count_Icon; //  0x13c0 Size(8)
	struct Unknown fill; //  0x13c8 Size(8)
	struct Unknown Hint; //  0x13d0 Size(8)
	struct Unknown HoverImage; //  0x13d8 Size(8)
	struct Unknown HoverImage_Gold; //  0x13e0 Size(8)
	struct Unknown Image_1; //  0x13e8 Size(8)
	struct Unknown Image_2; //  0x13f0 Size(8)
	struct Unknown Image_95; //  0x13f8 Size(8)
	struct Unknown ItemImage; //  0x1400 Size(8)
	struct Unknown ItemNameName; //  0x1408 Size(8)
	struct Unknown ItemState_Text; //  0x1410 Size(8)
	struct Unknown LvColor; //  0x1418 Size(8)
	struct Unknown NeedMaterial; //  0x1420 Size(8)
	struct Unknown OverBG_3; //  0x1428 Size(8)
	struct Unknown ProgressBar_136; //  0x1430 Size(8)
	struct Unknown SizeBox_1; //  0x1438 Size(8)
	struct Unknown WeaponItemImage; //  0x1440 Size(8)
	char bGold; //  0x1448 Size(1)
	struct Unknown SelectedHoverImage; //  0x1450 Size(8)
	struct Unknown MedicalBGColor; //  0x1458 Size(10)
	struct FMulticastInlineDelegate SetSlotInfo; //  0x1468 Size(10)
	int32_t SlotIndex; //  0x1478 Size(4)

	void Get(char& bResult, struct Unknown& WeaponInfo); // Function U.U.Get(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x1360 Size(8)
	struct Unknown Complete_ani; //  0x1368 Size(8)
	struct Unknown Serching_ani; //  0x1370 Size(8)
	struct Unknown Button; //  0x1378 Size(8)
	struct Unknown IconBox; //  0x1380 Size(8)
	struct Unknown Image; //  0x1388 Size(8)
	struct Unknown Image_2; //  0x1390 Size(8)
	struct Unknown Image_3; //  0x1398 Size(8)
	struct Unknown Image_4; //  0x13a0 Size(8)
	struct Unknown Image_5; //  0x13a8 Size(8)
	struct Unknown Image_6; //  0x13b0 Size(8)
	struct Unknown Image_7; //  0x13b8 Size(8)
	struct Unknown Image_8; //  0x13c0 Size(8)
	struct Unknown Image_9; //  0x13c8 Size(8)
	struct Unknown Image_10; //  0x13d0 Size(8)
	struct Unknown Image_149; //  0x13d8 Size(8)
	struct Unknown Image_170; //  0x13e0 Size(8)
	struct Unknown Image_253; //  0x13e8 Size(8)
	struct Unknown Image_305; //  0x13f0 Size(8)
	struct Unknown Image_Full; //  0x13f8 Size(8)
	struct Unknown IMG_ItemIcon; //  0x1400 Size(8)
	struct Unknown MaterialIcon; //  0x1408 Size(8)
	struct Unknown MouseHover_2; //  0x1410 Size(8)
	struct Unknown MouseHover_; //  0x1418 Size(8)
	struct Unknown MousePress_2; //  0x1420 Size(8)
	struct Unknown MousePress_; //  0x1428 Size(8)
	struct Unknown Searching_; //  0x1430 Size(8)
	struct Unknown Stroke; //  0x1438 Size(8)
	struct Unknown Stroke_2; //  0x1440 Size(8)
	struct Unknown Stroke_3; //  0x1448 Size(8)
	struct Unknown Stroke_4; //  0x1450 Size(8)
	struct Unknown PreHoveredWidget; //  0x1458 Size(8)
	enum class Unknow PreDragType; //  0x1460 Size(1)
	char Selected; //  0x1461 Size(1)
	int32_t NeedCount; //  0x1464 Size(4)
	struct FName ItemKey; //  0x1468 Size(8)
	struct Unknown SelectItem; //  0x1470 Size(10)
	char BindSelectSearch; //  0x1480 Size(1)
	char EnableSearch; //  0x1481 Size(1)

	enum class Unknow Get_Image_Full_Visibility_1(); // Function U.U.Get_Image_Full_Visibility_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Character_BG_Motion; //  0x250 Size(8)
	struct Unknown Image_308; //  0x258 Size(8)
	struct Unknown ScrollBox_KeepedList; //  0x260 Size(8)
	struct Unknown TextBlock_Count; //  0x268 Size(8)
	struct Unknown PlayerController; //  0x270 Size(8)

	void HoverRecipeItems(struct TArray<Unknown>& ItemKeys); // Function U.U.HoverRecipeItems(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x1360 Size(8)
	struct Unknown Abillity; //  0x1368 Size(8)
	struct Unknown AbillityBG; //  0x1370 Size(8)
	struct Unknown AbillityValue; //  0x1378 Size(8)
	struct Unknown Bg; //  0x1380 Size(8)
	struct Unknown BorderBG; //  0x1388 Size(8)
	struct Unknown ChoiceBG; //  0x1390 Size(8)
	struct Unknown DefenseBG; //  0x1398 Size(8)
	struct Unknown DurabilityBar; //  0x13a0 Size(8)
	struct Unknown EmptyBG; //  0x13a8 Size(8)
	struct Unknown ItemImage; //  0x13b0 Size(8)
	struct Unknown OverBG; //  0x13b8 Size(8)
	enum class Unknow WearableItemType; //  0x13c0 Size(1)
	char IsDefense; //  0x13c1 Size(1)
	struct Unknown HoverWidget; //  0x13c8 Size(8)
	struct Unknown HoverOwnerWidget; //  0x13d0 Size(8)
	int32_t Index; //  0x13d8 Size(4)

	void OnDragDetected(struct Unknown MyGeometry, struct Unknown& PointerEvent, struct Unknown& Operation); // Function U.U.OnDragDetected(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x3d8 Size(8)
	struct Unknown BT; //  0x3e0 Size(8)
	struct Unknown BT; //  0x3e8 Size(8)
	struct Unknown BT; //  0x3f0 Size(8)
	struct Unknown BT; //  0x3f8 Size(8)
	struct Unknown BT; //  0x400 Size(8)
	struct Unknown C; //  0x408 Size(8)
	struct Unknown IM; //  0x410 Size(8)
	struct Unknown IM; //  0x418 Size(8)
	struct Unknown IM; //  0x420 Size(8)
	struct Unknown IM; //  0x428 Size(8)
	struct Unknown IM; //  0x430 Size(8)
	struct Unknown IM; //  0x438 Size(8)
	struct Unknown Menu02; //  0x440 Size(8)
	struct Unknown Menu03; //  0x448 Size(8)
	struct Unknown Menu04; //  0x450 Size(8)
	struct Unknown Menu05; //  0x458 Size(8)
	struct Unknown Menu06; //  0x460 Size(8)
	struct Unknown Overlay_Mask; //  0x468 Size(8)
	struct Unknown TX; //  0x470 Size(8)
	struct Unknown TX; //  0x478 Size(8)
	struct Unknown TX; //  0x480 Size(8)
	struct Unknown TX; //  0x488 Size(8)
	struct Unknown TX; //  0x490 Size(8)
	struct Unknown TX; //  0x498 Size(8)
	struct Unknown TX; //  0x4a0 Size(8)
	struct Unknown TX; //  0x4a8 Size(8)
	struct Unknown TX; //  0x4b0 Size(8)
	struct Unknown TX; //  0x4b8 Size(8)
	struct Unknown TX; //  0x4c0 Size(8)

	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Character_BG_Motion; //  0x250 Size(8)
	struct Unknown Image_130; //  0x258 Size(8)
	struct Unknown Image_308; //  0x260 Size(8)
	struct Unknown ScrollBox_KeepedList; //  0x268 Size(8)
	struct Unknown U; //  0x270 Size(8)
	struct Unknown U_74; //  0x278 Size(8)
	struct Unknown PlayerController; //  0x280 Size(8)

	void DisableCarriedListHover(); // Function U.U.DisableCarriedListHover(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Image_94; //  0x250 Size(8)
	struct Unknown Image_224; //  0x258 Size(8)
	struct Unknown RichTextBlock_321; //  0x260 Size(8)
	struct Unknown InventoryRef; //  0x268 Size(8)

	struct Unknown OnMouseButtonDown_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonDown_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown Image_362; //  0x248 Size(8)
	struct Unknown Image_552; //  0x250 Size(8)
	struct Unknown RichTextBlock_74; //  0x258 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x1360 Size(8)
	struct Unknown Anim_Material_Get; //  0x1368 Size(8)
	struct Unknown Anim_Material_Hover; //  0x1370 Size(8)
	struct Unknown Anim_Upgrade; //  0x1378 Size(8)
	struct Unknown Anim_Progress; //  0x1380 Size(8)
	struct Unknown Abillity; //  0x1388 Size(8)
	struct Unknown AbillityBG; //  0x1390 Size(8)
	struct Unknown AbillityValue; //  0x1398 Size(8)
	struct Unknown Bg; //  0x13a0 Size(8)
	struct Unknown Bg_3; //  0x13a8 Size(8)
	struct Unknown BorderBG; //  0x13b0 Size(8)
	struct Unknown BorderBG_3; //  0x13b8 Size(8)
	struct Unknown btn_HelmetTree; //  0x13c0 Size(8)
	struct Unknown ChoiceBG; //  0x13c8 Size(8)
	struct Unknown ChoiceBG_3; //  0x13d0 Size(8)
	struct Unknown DefenseBG; //  0x13d8 Size(8)
	struct Unknown DefenseBG_3; //  0x13e0 Size(8)
	struct Unknown DurabilityBar; //  0x13e8 Size(8)
	struct Unknown DurabilityBar_3; //  0x13f0 Size(8)
	struct Unknown EmptyBG; //  0x13f8 Size(8)
	struct Unknown EmptyBG_3; //  0x1400 Size(8)
	struct Unknown Image; //  0x1408 Size(8)
	struct Unknown Image_197; //  0x1410 Size(8)
	struct Unknown Image_234; //  0x1418 Size(8)
	struct Unknown Image_279; //  0x1420 Size(8)
	struct Unknown Image_491; //  0x1428 Size(8)
	struct Unknown Image_682; //  0x1430 Size(8)
	struct Unknown ItemImage; //  0x1438 Size(8)
	struct Unknown ItemImage_3; //  0x1440 Size(8)
	struct Unknown OverBG; //  0x1448 Size(8)
	struct Unknown OverBG_3; //  0x1450 Size(8)
	struct Unknown Overlay_1; //  0x1458 Size(8)
	struct Unknown U; //  0x1460 Size(8)
	struct Unknown U; //  0x1468 Size(8)
	struct Unknown WidgetSwitcher_3; //  0x1470 Size(8)
	enum class Unknow WearableItemType; //  0x1478 Size(1)
	char IsDefense; //  0x1479 Size(1)
	struct Unknown HoverWidget; //  0x1480 Size(8)
	struct Unknown HoverOwnerWidget; //  0x1488 Size(8)
	int32_t SwitcherIndex; //  0x1490 Size(4)

	void IsDraging(char& bResult); // Function U.U.IsDraging(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelDevelopmentBlackMarket {
	struct Unknown UberGraphFrame; //  0x2e8 Size(8)
	struct Unknown AllItem; //  0x2f0 Size(8)
	struct Unknown Button_1004; //  0x2f8 Size(8)
	struct Unknown CheckBox_1; //  0x300 Size(8)
	struct Unknown C; //  0x308 Size(8)
	struct Unknown IM; //  0x310 Size(8)
	struct Unknown IM; //  0x318 Size(8)
	struct Unknown IM; //  0x320 Size(8)
	struct Unknown IM; //  0x328 Size(8)
	struct Unknown IM; //  0x330 Size(8)
	struct Unknown IM; //  0x338 Size(8)
	struct Unknown IM; //  0x340 Size(8)
	struct Unknown IM; //  0x348 Size(8)
	struct Unknown IM; //  0x350 Size(8)
	struct Unknown IM; //  0x358 Size(8)
	struct Unknown IM; //  0x360 Size(8)
	struct Unknown Text_culture; //  0x368 Size(8)
	struct Unknown U; //  0x370 Size(8)
	struct Unknown U; //  0x378 Size(8)
	struct Unknown W; //  0x380 Size(8)
	struct Unknown WrapBox_6; //  0x388 Size(8)
	enum class Unknow CurrentTab; //  0x390 Size(1)
	struct Unknown SelectTabColor; //  0x394 Size(10)
	struct Unknown UnSelectTabColor; //  0x3a4 Size(10)
	char ShowWorkInProcess; //  0x3b4 Size(1)
	struct TArray<Unknown> ItemList; //  0x3b8 Size(10)
	enum class Unknow SelectedWeaponSubTab; //  0x3c8 Size(1)
	enum class Unknow SelectedAttachmentSubTab; //  0x3c9 Size(1)
	enum class Unknow SelectedWearableSubTab; //  0x3ca Size(1)
	enum class Unknow SelectedGearSubTab; //  0x3cb Size(1)
	enum class Unknow SelectedCustomSubTab; //  0x3cc Size(1)
	struct TArray<Unknown> SortTypeList; //  0x3d0 Size(10)
	struct TArray<Unknown> WeaponAscendList; //  0x3e0 Size(10)
	int32_t CurrentWeaponSortType; //  0x3f0 Size(4)
	struct TArray<Unknown> AmmoAscendList; //  0x3f8 Size(10)
	int32_t CurrentAmmoSortType; //  0x408 Size(4)
	struct TArray<Unknown> AttachmentAscendList; //  0x410 Size(10)
	int32_t CurrentAttachmentSortType; //  0x420 Size(4)
	int32_t CurrentWearableSortType; //  0x424 Size(4)
	int32_t CurrentConsumableSortType; //  0x428 Size(4)
	int32_t CurrentCustomSortType; //  0x42c Size(4)
	int32_t CurrentVehicleSortType; //  0x430 Size(4)
	struct TArray<Unknown> WearableAscendList; //  0x438 Size(10)
	struct TArray<Unknown> ConsumableAscendList; //  0x448 Size(10)
	struct TArray<Unknown> CustomAscendList; //  0x458 Size(10)
	struct TArray<Unknown> VehicleAscendList; //  0x468 Size(10)
	struct Unknown Save; //  0x478 Size(8)
	struct TArray<Unknown> GearAscendList; //  0x480 Size(10)
	int32_t CurrentGearSortType; //  0x490 Size(4)
	struct FString BlackmarketSaveSlotName; //  0x498 Size(10)
	int32_t TestIndex; //  0x4a8 Size(4)
	struct TArray<Unknown> PerkAscendList; //  0x4b0 Size(10)
	int32_t CurrentPerkSortType; //  0x4c0 Size(4)
	enum class Unknow SelectedPerkSubTab; //  0x4c4 Size(1)
	int32_t CurrentPresetSortType; //  0x4c8 Size(4)
	struct TArray<Unknown> PresetAscendList; //  0x4d0 Size(10)
	struct FName SelectedPerkClass; //  0x4e0 Size(8)
	enum class Unknow SelectedConsumableSubTab; //  0x4e8 Size(1)

	void IsCorrectPresetSlot(enum class Unknow status, char& bResult); // Function U.U.IsCorrectPresetSlot(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Anim_MoveUp_HUD; //  0x250 Size(8)
	struct Unknown Anim_MoveRight; //  0x258 Size(8)
	struct Unknown Anim_MoveUp; //  0x260 Size(8)
	struct Unknown U; //  0x268 Size(8)
	struct Unknown U; //  0x270 Size(8)
	struct Unknown U; //  0x278 Size(8)
	struct Unknown U; //  0x280 Size(8)
	struct Unknown U; //  0x288 Size(8)
	struct Unknown U; //  0x290 Size(8)
	struct Unknown VerticalBox_Stats; //  0x298 Size(8)

	void SetStatInfo(struct Unknown& StatupParams, char IsUpAnim); // Function U.U.SetStatInfo(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x1360 Size(8)
	struct Unknown P_Upgrade_Arrow; //  0x1368 Size(8)
	struct Unknown C_SlotHover_ItemState_Hide; //  0x1370 Size(8)
	struct Unknown C_SlotHover_ItemState_Show; //  0x1378 Size(8)
	struct Unknown Hover_Gold; //  0x1380 Size(8)
	struct Unknown P_SlotHover; //  0x1388 Size(8)
	struct Unknown BGImage; //  0x1390 Size(8)
	struct Unknown BGImage_2; //  0x1398 Size(8)
	struct Unknown CanvasPanel_ITemState; //  0x13a0 Size(8)
	struct Unknown CanvasPanel_Unnecessary; //  0x13a8 Size(8)
	struct Unknown Count; //  0x13b0 Size(8)
	struct Unknown Crate_Default; //  0x13b8 Size(8)
	struct Unknown Crate_Hover; //  0x13c0 Size(8)
	struct Unknown DurabilityBar; //  0x13c8 Size(8)
	struct Unknown fill; //  0x13d0 Size(8)
	struct Unknown HorizontalBox_Rarity; //  0x13d8 Size(8)
	struct Unknown HoverImage; //  0x13e0 Size(8)
	struct Unknown HoverImage_Gold; //  0x13e8 Size(8)
	struct Unknown HoverImage_Round; //  0x13f0 Size(8)
	struct Unknown Image_1; //  0x13f8 Size(8)
	struct Unknown Image_2; //  0x1400 Size(8)
	struct Unknown Image_531; //  0x1408 Size(8)
	struct Unknown Image_539; //  0x1410 Size(8)
	struct Unknown Image_540; //  0x1418 Size(8)
	struct Unknown Image_541; //  0x1420 Size(8)
	struct Unknown Image_542; //  0x1428 Size(8)
	struct Unknown Image_543; //  0x1430 Size(8)
	struct Unknown Image_544; //  0x1438 Size(8)
	struct Unknown Image_Bindable; //  0x1440 Size(8)
	struct Unknown Image_Supply; //  0x1448 Size(8)
	struct Unknown ItemImage; //  0x1450 Size(8)
	struct Unknown ItemNameName; //  0x1458 Size(8)
	struct Unknown ItemState_Text; //  0x1460 Size(8)
	struct Unknown KeepedItem_List; //  0x1468 Size(8)
	struct Unknown KeepedItem_ListHover; //  0x1470 Size(8)
	struct Unknown LvColor; //  0x1478 Size(8)
	struct Unknown NeedMaterial; //  0x1480 Size(8)
	struct Unknown SizeBox_1; //  0x1488 Size(8)
	struct Unknown TextBlock_Range; //  0x1490 Size(8)
	struct Unknown UpgradeItem; //  0x1498 Size(8)
	struct Unknown UpgradeItem_Arrow01; //  0x14a0 Size(8)
	struct Unknown UpgradeItem_Arrow02; //  0x14a8 Size(8)
	struct Unknown UpgradeItem_default; //  0x14b0 Size(8)
	struct Unknown UpgradeItem_Hover; //  0x14b8 Size(8)
	struct Unknown weapon__; //  0x14c0 Size(8)
	struct Unknown WeaponColorBg; //  0x14c8 Size(8)
	struct Unknown WeaponEquipItem_Default; //  0x14d0 Size(8)
	struct Unknown WeaponEquipItem_Hov; //  0x14d8 Size(8)
	struct Unknown WeaponItemImage; //  0x14e0 Size(8)
	struct Unknown WeaponType; //  0x14e8 Size(8)
	struct Unknown PickupRef; //  0x14f0 Size(8)
	struct Unknown DroppedItemInfo; //  0x14f8 Size(98)
	struct Unknown DropBoxRef; //  0x1590 Size(8)
	char bGold; //  0x1598 Size(1)
	struct Unknown SelectedHoverImage; //  0x15a0 Size(8)
	struct Unknown WeaponData; //  0x15a8 Size(b30)
	struct Unknown MedicalBGColor; //  0x20d8 Size(10)
	int32_t CurCount; //  0x20e8 Size(4)
	struct FMulticastInlineDelegate SetSlotInfo; //  0x20f0 Size(10)
	struct Unknown TargetActor; //  0x2100 Size(8)
	struct Unknown StealableCharacter; //  0x2108 Size(8)
	struct TArray<Unknown> ShowRarityStar; //  0x2110 Size(10)
	struct TArray<Unknown> ShowIconBG; //  0x2120 Size(10)

	void CheckHoverMaterial(); // Function U.U.CheckHoverMaterial(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown CurrentAccel; //  0x250 Size(c)
	struct Unknown TargetAccel; //  0x25c Size(c)
	struct Unknown CurrentCameraActor; //  0x268 Size(8)
	struct Unknown OldCameraLocation; //  0x270 Size(c)
	struct Unknown CurrentCameraLocation; //  0x27c Size(c)
	struct Unknown OriginCameraLocation; //  0x288 Size(c)
	struct Unknown TargetCameraLocation; //  0x294 Size(c)
	struct Unknown DataAsset; //  0x2a0 Size(8)
	char ResetOriginTransform; //  0x2a8 Size(1)
	float BeginFocusDist; //  0x2ac Size(4)
	float EndFocusDist; //  0x2b0 Size(4)
	float CurrentFocus; //  0x2b4 Size(4)

	void UpdateMouseWheel(float Delta); // Function U.U.UpdateMouseWheel(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Image_92; //  0x250 Size(8)
	struct Unknown Image_253; //  0x258 Size(8)
	struct Unknown Image_774; //  0x260 Size(8)
	struct Unknown PerkInfo; //  0x268 Size(2c)
	struct Unknown Perk; //  0x298 Size(e0)
	struct Unknown IconBrush; //  0x378 Size(88)
	struct Unknown Popup; //  0x400 Size(8)

	struct Unknown GetColorAndOpacity_1(); // Function U.U.GetColorAndOpacity_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelInventoryPerkWidget {
	struct Unknown UberGraphFrame; //  0x2e8 Size(8)
	struct Unknown Anim_Glow; //  0x2f0 Size(8)
	struct Unknown HideFreeSupply; //  0x2f8 Size(8)
	struct Unknown ShowFreeSupply; //  0x300 Size(8)
	struct Unknown LevelUp; //  0x308 Size(8)
	struct Unknown Ability_Defense; //  0x310 Size(8)
	struct Unknown Ability_Speed; //  0x318 Size(8)
	struct Unknown Ability_Power; //  0x320 Size(8)
	struct Unknown Survive_FadeInOut; //  0x328 Size(8)
	struct Unknown Anim_LevelUp; //  0x330 Size(8)
	struct Unknown Anim_LevelUpSpeed; //  0x338 Size(8)
	struct Unknown Anim_LevelUpPower; //  0x340 Size(8)
	struct Unknown btn_ItemTree; //  0x348 Size(8)
	struct Unknown btn_PerkDeck; //  0x350 Size(8)
	struct Unknown btn_PerkDeck_2; //  0x358 Size(8)
	struct Unknown btn_PerkDeckEnabled; //  0x360 Size(8)
	struct Unknown btn_PerkDeckEnabled_2; //  0x368 Size(8)
	struct Unknown Canvas_BG; //  0x370 Size(8)
	struct Unknown Canvas_ChangeClass; //  0x378 Size(8)
	struct Unknown Canvas_ChangeDisable; //  0x380 Size(8)
	struct Unknown Canvas_ChangeDisable_2; //  0x388 Size(8)
	struct Unknown Canvas_ChangeEnable; //  0x390 Size(8)
	struct Unknown Canvas_ChangeEnable_2; //  0x398 Size(8)
	struct Unknown Canvas_ChangeSupply; //  0x3a0 Size(8)
	struct Unknown Canvas_LevelupEffect; //  0x3a8 Size(8)
	struct Unknown Canvas_Main; //  0x3b0 Size(8)
	struct Unknown Canvas_Perk; //  0x3b8 Size(8)
	struct Unknown Canvas_SupplyButton; //  0x3c0 Size(8)
	struct Unknown Canvas_UltimateEffect; //  0x3c8 Size(8)
	struct Unknown Canvas_UltimateLightEffect; //  0x3d0 Size(8)
	struct Unknown HorizontalBox_300; //  0x3d8 Size(8)
	struct Unknown HorizontalBox_303; //  0x3e0 Size(8)
	struct Unknown HorizontalBox_Stat; //  0x3e8 Size(8)
	struct Unknown HorizontalBox_UnlockLevel; //  0x3f0 Size(8)
	struct Unknown Image; //  0x3f8 Size(8)
	struct Unknown Image_5; //  0x400 Size(8)
	struct Unknown Image_86; //  0x408 Size(8)
	struct Unknown Image_126; //  0x410 Size(8)
	struct Unknown Image_163; //  0x418 Size(8)
	struct Unknown Image_180; //  0x420 Size(8)
	struct Unknown Image_200; //  0x428 Size(8)
	struct Unknown Image_203; //  0x430 Size(8)
	struct Unknown Image_222; //  0x438 Size(8)
	struct Unknown Image_384; //  0x440 Size(8)
	struct Unknown Image_387; //  0x448 Size(8)
	struct Unknown Image_388; //  0x450 Size(8)
	struct Unknown Image_389; //  0x458 Size(8)
	struct Unknown Image_485; //  0x460 Size(8)
	struct Unknown Image_571; //  0x468 Size(8)
	struct Unknown Image_1098; //  0x470 Size(8)
	struct Unknown Image_1100; //  0x478 Size(8)
	struct Unknown Image_1104; //  0x480 Size(8)
	struct Unknown Image_Cycle; //  0x488 Size(8)
	struct Unknown Image_Cycle_2; //  0x490 Size(8)
	struct Unknown IMG_ClassIcon; //  0x498 Size(8)
	struct Unknown IMG_PerkDeckIcon; //  0x4a0 Size(8)
	struct Unknown IMG_Supply; //  0x4a8 Size(8)
	struct Unknown IMG_UltimatedSkill; //  0x4b0 Size(8)
	struct Unknown InvalidationBox_1; //  0x4b8 Size(8)
	struct Unknown KeyImageWidget; //  0x4c0 Size(8)
	struct Unknown NotEnoughGold; //  0x4c8 Size(8)
	struct Unknown Over_Ultimate; //  0x4d0 Size(8)
	struct Unknown Overlay_UltimateKey; //  0x4d8 Size(8)
	struct Unknown Spacer_251; //  0x4e0 Size(8)
	struct Unknown T_ClassName; //  0x4e8 Size(8)
	struct Unknown T_Defense; //  0x4f0 Size(8)
	struct Unknown T_DefenseAnim; //  0x4f8 Size(8)
	struct Unknown T_Power; //  0x500 Size(8)
	struct Unknown T_PowerAnim; //  0x508 Size(8)
	struct Unknown T_Speed; //  0x510 Size(8)
	struct Unknown T_SpeedAnim; //  0x518 Size(8)
	struct Unknown T_UltimateName; //  0x520 Size(8)
	struct Unknown T_UnlockLevel; //  0x528 Size(8)
	struct Unknown T_UnlockLevel2; //  0x530 Size(8)
	struct Unknown T_WeaponName; //  0x538 Size(8)
	struct Unknown TextBlock_2; //  0x540 Size(8)
	struct Unknown TextBlock_3; //  0x548 Size(8)
	struct Unknown TextBlock_4; //  0x550 Size(8)
	struct Unknown TextBlock_9; //  0x558 Size(8)
	struct Unknown TextBlock_ClassLevel; //  0x560 Size(8)
	struct Unknown TextBlock_Count_Blue; //  0x568 Size(8)
	struct Unknown TextBlock_Count_Green; //  0x570 Size(8)
	struct Unknown TextBlock_Count_Red; //  0x578 Size(8)
	struct Unknown TextBlock_Defense; //  0x580 Size(8)
	struct Unknown TextBlock_Power; //  0x588 Size(8)
	struct Unknown TextBlock_Price; //  0x590 Size(8)
	struct Unknown TextBlock_Price_2; //  0x598 Size(8)
	struct Unknown TextBlock_Select; //  0x5a0 Size(8)
	struct Unknown TextBlock_Select_2; //  0x5a8 Size(8)
	struct Unknown TextBlock_Speed; //  0x5b0 Size(8)
	struct Unknown TextBlock_SurviveMessage01; //  0x5b8 Size(8)
	struct Unknown TextBlock_SurviveMessage02; //  0x5c0 Size(8)
	struct Unknown TextBlock_UltimateDesc; //  0x5c8 Size(8)
	struct Unknown Title; //  0x5d0 Size(8)
	struct Unknown UltiLight_001; //  0x5d8 Size(8)
	struct Unknown UltiLight_002; //  0x5e0 Size(8)
	struct Unknown UltiLight_003; //  0x5e8 Size(8)
	struct Unknown U; //  0x5f0 Size(8)
	struct Unknown U_2; //  0x5f8 Size(8)
	struct Unknown U_3; //  0x600 Size(8)
	struct Unknown U_4; //  0x608 Size(8)
	struct Unknown U_5; //  0x610 Size(8)
	struct Unknown U_6; //  0x618 Size(8)
	struct Unknown U_7; //  0x620 Size(8)
	struct Unknown U_8; //  0x628 Size(8)
	struct Unknown U_9; //  0x630 Size(8)
	struct Unknown VB_Health; //  0x638 Size(8)
	struct Unknown VB_Power; //  0x640 Size(8)
	struct Unknown VB_Speed; //  0x648 Size(8)
	struct Unknown VerticalBox_Blue; //  0x650 Size(8)
	struct Unknown VerticalBox_Green; //  0x658 Size(8)
	struct Unknown VerticalBox_Red; //  0x660 Size(8)
	struct Unknown WidgetSwitcher_ChangeClass; //  0x668 Size(8)
	struct Unknown WidgetSwitcher_ChangeSupply; //  0x670 Size(8)
	struct Unknown WidgetSwitcher_TreeAndClass; //  0x678 Size(8)
	struct Unknown WidgetSwitcher_Ultimate; //  0x680 Size(8)
	struct FName CurrentPerkDeckName; //  0x688 Size(8)
	struct TArray<Unknown> CurrentPerkInfos; //  0x690 Size(10)
	struct FName ExpertWeaponKey; //  0x6a0 Size(8)
	struct TMap<{}, {}>Unknown CurrentPerkCells; //  0x6a8 Size(50)
	int32_t PerkMode; //  0x6f8 Size(4)
	struct Unknown HoverWidget; //  0x700 Size(8)
	int32_t PowerValue; //  0x708 Size(4)
	struct Unknown TimerHandle_Power; //  0x710 Size(8)
	int32_t SpeedValue; //  0x718 Size(4)
	struct Unknown TimerHandle_Speed; //  0x720 Size(8)
	int32_t DefenseValue; //  0x728 Size(4)
	struct Unknown TimerHandle_; //  0x730 Size(8)
	char bPlayAbilityCountSoundStart; //  0x738 Size(1)
	char bPlayAbilityCountSoundEnd; //  0x739 Size(1)
	struct Unknown LevelUpSound; //  0x740 Size(8)
	char EnableSupplyBtn; //  0x748 Size(1)
	struct Unknown FreeSupplyTimer; //  0x750 Size(8)
	struct Unknown NotEnoughtGoldTimer; //  0x758 Size(8)
	struct TArray<Unknown> GainPerkPopups; //  0x760 Size(10)
	char IsPlayingUltimateSound; //  0x770 Size(1)
	int32_t LastLevel; //  0x774 Size(4)
	struct Unknown Perk; //  0x778 Size(28)

	void SequenceEvent__ENTRYPOINTU_2(); // Function U.U.SequenceEvent__ENTRYPOINTU_2(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Button_Main; //  0x250 Size(8)
	struct Unknown Image_ClassIcon; //  0x258 Size(8)
	struct Unknown Image_ComingSoonBg; //  0x260 Size(8)
	struct Unknown Image_Disabled; //  0x268 Size(8)
	struct Unknown Image_Outline; //  0x270 Size(8)
	struct Unknown Image_Push; //  0x278 Size(8)
	struct Unknown Overlay_Main; //  0x280 Size(8)
	struct Unknown T_ComingSoon; //  0x288 Size(8)
	struct Unknown U; //  0x290 Size(8)
	struct Unknown U_2; //  0x298 Size(8)
	struct Unknown U_3; //  0x2a0 Size(8)
	struct Unknown U; //  0x2a8 Size(8)
	struct Unknown VerticalBox_Selected; //  0x2b0 Size(8)
	struct Unknown Perk; //  0x2b8 Size(28)
	int32_t SelectedNum; //  0x2e0 Size(4)
	int32_t SelectedMinIndex; //  0x2e4 Size(4)
	struct FMulticastInlineDelegate ChooseClass; //  0x2e8 Size(10)
	int32_t ClassIndex; //  0x2f8 Size(4)
	struct FMulticastInlineDelegate HoverClass; //  0x300 Size(10)
	char bIsLocalSelected; //  0x310 Size(1)
	char bIsSelected; //  0x311 Size(1)
	struct Unknown CurrentPerkDeckData; //  0x318 Size(4b0)
	char bIsDuplicateSelectPossible; //  0x7c8 Size(1)
	char bButtonDisabled; //  0x7c9 Size(1)
	char bNoUpdatedDisabled; //  0x7ca Size(1)
	char bIsBlocked; //  0x7cb Size(1)

	void SetBlocked(char IsBlocked, char ComingSoon); // Function U.U.SetBlocked(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown RichTextBlock_52; //  0x250 Size(8)
	struct Unknown DefaultTextStyle; //  0x258 Size(268)
	struct FText TextString; //  0x4c0 Size(18)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Button_ItemSlotHover_4; //  0x250 Size(8)
	struct Unknown U_4; //  0x258 Size(8)
	struct Unknown ItemWeaponInfo; //  0x260 Size(88)
	struct Unknown ParentWidget; //  0x2e8 Size(8)

	void SetButtonEnabled(char InIsEnabled); // Function U.U.SetButtonEnabled(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelCompassWidget {
	struct Unknown UberGraphFrame; //  0x350 Size(8)
	struct Unknown CanvasPanel_3; //  0x358 Size(8)
	struct Unknown CanvasPanel_4; //  0x360 Size(8)
	struct Unknown grid; //  0x368 Size(8)
	struct Unknown Image; //  0x370 Size(8)
	struct Unknown Image_1; //  0x378 Size(8)
	struct Unknown Image_2; //  0x380 Size(8)
	struct Unknown Image_234; //  0x388 Size(8)
	struct Unknown Image_582; //  0x390 Size(8)
	struct Unknown InvalidationBox_1; //  0x398 Size(8)
	struct Unknown RetainerBox_108; //  0x3a0 Size(8)
	struct Unknown SupplyBoxMarker; //  0x3a8 Size(8)
	struct Unknown UnitParent; //  0x3b0 Size(8)
	struct Unknown U; //  0x3b8 Size(8)
	struct Unknown U_2; //  0x3c0 Size(8)
	struct Unknown U_3; //  0x3c8 Size(8)
	struct Unknown U_4; //  0x3d0 Size(8)
	struct Unknown U_5; //  0x3d8 Size(8)
	struct Unknown U_6; //  0x3e0 Size(8)
	struct Unknown U_7; //  0x3e8 Size(8)
	struct Unknown U_8; //  0x3f0 Size(8)
	struct Unknown U_9; //  0x3f8 Size(8)
	struct Unknown U_10; //  0x400 Size(8)
	struct Unknown U_11; //  0x408 Size(8)
	struct Unknown U_12; //  0x410 Size(8)
	struct Unknown U_13; //  0x418 Size(8)
	struct Unknown U_14; //  0x420 Size(8)
	struct Unknown U_1; //  0x428 Size(8)
	struct Unknown ViewAngle; //  0x430 Size(8)
	float ScaleForAngleToDistance; //  0x438 Size(4)
	float PositionCurveOffset; //  0x43c Size(4)
	struct Unknown PositionCurve; //  0x440 Size(8)
	float PositionCurveWeight; //  0x448 Size(4)
	float ScaleCurveWeight; //  0x44c Size(4)
	float ScaleCurveOffset; //  0x450 Size(4)
	int32_t NormalDirectionFontSize; //  0x454 Size(4)
	int32_t SpecialDirectionFontSize; //  0x458 Size(4)
	struct TArray<Unknown> ArrayPlayerMarkerWidget; //  0x460 Size(10)
	struct Unknown NorthColor; //  0x470 Size(10)
	int32_t Angle0To360; //  0x480 Size(4)
	float TempMarkerPosition; //  0x484 Size(4)
	float ArrangedAngle; //  0x488 Size(4)

	struct Unknown CreateExpertWeaponItemMarker(); // Function U.U.CreateExpertWeaponItemMarker(Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown Image_80; //  0x248 Size(8)

	void destroy(); // Function U.U.destroy(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelScopeWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Image_1; //  0x250 Size(8)

	void SetScopeImageAngle(float NewAngle); // Function U.U.SetScopeImageAngle(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelWorldMapWidget {
	struct Unknown UberGraphFrame; //  0x2b8 Size(8)
	struct Unknown FadeIn; //  0x2c0 Size(8)
	struct Unknown NewAnimation_2; //  0x2c8 Size(8)
	struct Unknown Bg; //  0x2d0 Size(8)
	struct Unknown B; //  0x2d8 Size(8)
	struct Unknown B; //  0x2e0 Size(8)
	struct Unknown CloseButton; //  0x2e8 Size(8)
	struct Unknown ShowHelBoxButton; //  0x2f0 Size(8)
	struct Unknown U; //  0x2f8 Size(8)
	struct Unknown WidgetSwitcher_1; //  0x300 Size(8)
	int32_t MAX_ZOOM_LEVEL; //  0x308 Size(4)
	int32_t ZoomLevel; //  0x30c Size(4)
	float MAX_SCALE_FACTOR; //  0x310 Size(4)
	int32_t InitializeCount; //  0x314 Size(4)
	struct Unknown PosOnViewport; //  0x318 Size(8)
	float CurrentScaleFactor; //  0x320 Size(4)
	struct Unknown MouseButtonDownPos; //  0x324 Size(8)
	struct Unknown SelectPingMenuTimer; //  0x330 Size(8)
	struct Unknown SelectionMenu; //  0x338 Size(8)
	char IsRoutePing; //  0x340 Size(1)
	int32_t MaxRoutePointCount; //  0x344 Size(4)
	struct TArray<Unknown> RoutePointArray; //  0x348 Size(10)

	void SetClassInfoBoardVisibilityByZoomLevel(int32_t LastZoomLevel, int32_t NewZoomLevel); // Function U.U.SetClassInfoBoardVisibilityByZoomLevel(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown U; //  0x250 Size(8)
	struct Unknown U_2; //  0x258 Size(8)
	struct Unknown U_3; //  0x260 Size(8)
	struct Unknown U_4; //  0x268 Size(8)
	struct Unknown VerticalBox_OptionList; //  0x270 Size(8)

	void AddOptionList(struct Unknown& ItemOption); // Function U.U.AddOptionList(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Popup_Alpha_Bg_Black; //  0x250 Size(8)
	struct Unknown btn_OK; //  0x258 Size(8)
	struct Unknown Image_751; //  0x260 Size(8)
	struct Unknown Perk_List; //  0x268 Size(8)
	struct Unknown U; //  0x270 Size(8)
	struct Unknown U_2; //  0x278 Size(8)
	struct Unknown U_3; //  0x280 Size(8)
	struct FMulticastInlineDelegate EventDispatcher_OnClosePerkPopup; //  0x288 Size(10)

	void SetOptionList(struct TArray<Unknown>& OptionList); // Function U.U.SetOptionList(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelInventoryHoverWidget {
	struct Unknown UberGraphFrame; //  0x280 Size(8)
	struct Unknown UpArrow; //  0x288 Size(8)
	struct Unknown FadeIn; //  0x290 Size(8)
	struct Unknown Ammo_Compare; //  0x298 Size(8)
	struct Unknown Ammo_Value; //  0x2a0 Size(8)
	struct Unknown AmmoIcon; //  0x2a8 Size(8)
	struct Unknown AmmoInfo; //  0x2b0 Size(8)
	struct Unknown Arrow_01; //  0x2b8 Size(8)
	struct Unknown Arrow_02; //  0x2c0 Size(8)
	struct Unknown BuffList; //  0x2c8 Size(8)
	struct Unknown BuffList_2; //  0x2d0 Size(8)
	struct Unknown EffectiveRange_Compare; //  0x2d8 Size(8)
	struct Unknown EffectiveRange_Value; //  0x2e0 Size(8)
	struct Unknown FiringRate_Compare; //  0x2e8 Size(8)
	struct Unknown FiringRate_Value; //  0x2f0 Size(8)
	struct Unknown HorizontalBox_ItemRarity; //  0x2f8 Size(8)
	struct Unknown HorizontalBox_MaterialRarity; //  0x300 Size(8)
	struct Unknown HorizontalBox_WeaponRarity; //  0x308 Size(8)
	struct Unknown Image; //  0x310 Size(8)
	struct Unknown Image_2; //  0x318 Size(8)
	struct Unknown Image_3; //  0x320 Size(8)
	struct Unknown Image_8; //  0x328 Size(8)
	struct Unknown Image_9; //  0x330 Size(8)
	struct Unknown Image_10; //  0x338 Size(8)
	struct Unknown Image_11; //  0x340 Size(8)
	struct Unknown Image_12; //  0x348 Size(8)
	struct Unknown Image_13; //  0x350 Size(8)
	struct Unknown Image_14; //  0x358 Size(8)
	struct Unknown Image_15; //  0x360 Size(8)
	struct Unknown Image_16; //  0x368 Size(8)
	struct Unknown Image_20; //  0x370 Size(8)
	struct Unknown Image_22; //  0x378 Size(8)
	struct Unknown Image_23; //  0x380 Size(8)
	struct Unknown Image_24; //  0x388 Size(8)
	struct Unknown Image_25; //  0x390 Size(8)
	struct Unknown Image_26; //  0x398 Size(8)
	struct Unknown Image_27; //  0x3a0 Size(8)
	struct Unknown Image_28; //  0x3a8 Size(8)
	struct Unknown Image_29; //  0x3b0 Size(8)
	struct Unknown Image_30; //  0x3b8 Size(8)
	struct Unknown Image_31; //  0x3c0 Size(8)
	struct Unknown Image_32; //  0x3c8 Size(8)
	struct Unknown Image_310; //  0x3d0 Size(8)
	struct Unknown Image_557; //  0x3d8 Size(8)
	struct Unknown Image_WeaponLock; //  0x3e0 Size(8)
	struct Unknown Img_MaterialBG; //  0x3e8 Size(8)
	struct Unknown IMG_MaterialIcon; //  0x3f0 Size(8)
	struct Unknown IMG_Stat; //  0x3f8 Size(8)
	struct Unknown ItemBg; //  0x400 Size(8)
	struct Unknown ItemBg_01; //  0x408 Size(8)
	struct Unknown ItemBg_02; //  0x410 Size(8)
	struct Unknown ItemSlot; //  0x418 Size(8)
	struct Unknown ItemSlot; //  0x420 Size(8)
	struct Unknown ItemSlot_2; //  0x428 Size(8)
	struct Unknown ItemSlot; //  0x430 Size(8)
	struct Unknown ItemSlot_2; //  0x438 Size(8)
	struct Unknown ItemSlot; //  0x440 Size(8)
	struct Unknown ItemSlot; //  0x448 Size(8)
	struct Unknown ItemSlot; //  0x450 Size(8)
	struct Unknown ItemSlot; //  0x458 Size(8)
	struct Unknown ItemSlotHover; //  0x460 Size(8)
	struct Unknown PerkBG; //  0x468 Size(8)
	struct Unknown PerkImage; //  0x470 Size(8)
	struct Unknown PerkLevelText; //  0x478 Size(8)
	struct Unknown PerkName; //  0x480 Size(8)
	struct Unknown PerkSlotHover; //  0x488 Size(8)
	struct Unknown PopupHover_2; //  0x490 Size(8)
	struct Unknown Power_Compare; //  0x498 Size(8)
	struct Unknown Power_Value; //  0x4a0 Size(8)
	struct Unknown SizeBox; //  0x4a8 Size(8)
	struct Unknown SizeBox_7; //  0x4b0 Size(8)
	struct Unknown SizeBox_ComparingText; //  0x4b8 Size(8)
	struct Unknown SizeBox_Item; //  0x4c0 Size(8)
	struct Unknown Stability_Compare; //  0x4c8 Size(8)
	struct Unknown Stability_Value; //  0x4d0 Size(8)
	struct Unknown StatSlotHover; //  0x4d8 Size(8)
	struct Unknown T_BindPlayerName; //  0x4e0 Size(8)
	struct Unknown T_Material; //  0x4e8 Size(8)
	struct Unknown T_MaterialDesc; //  0x4f0 Size(8)
	struct Unknown T_PerkDescLv1; //  0x4f8 Size(8)
	struct Unknown T_PerkDescLv2; //  0x500 Size(8)
	struct Unknown T_PerkDescLv3; //  0x508 Size(8)
	struct Unknown T_Stat; //  0x510 Size(8)
	struct Unknown T_StatDesc; //  0x518 Size(8)
	struct Unknown T_TooltipDesc; //  0x520 Size(8)
	struct Unknown T_UltimateDesc; //  0x528 Size(8)
	struct Unknown T_UnlockUltimateLev; //  0x530 Size(8)
	struct Unknown Text_CombineTarget; //  0x538 Size(8)
	struct Unknown TextBlock_3; //  0x540 Size(8)
	struct Unknown TextBlock_4; //  0x548 Size(8)
	struct Unknown TextBlock_5; //  0x550 Size(8)
	struct Unknown TextBlock_6; //  0x558 Size(8)
	struct Unknown UpArrowAni; //  0x560 Size(8)
	struct Unknown U; //  0x568 Size(8)
	struct Unknown U_2; //  0x570 Size(8)
	struct Unknown U; //  0x578 Size(8)
	struct Unknown U_2; //  0x580 Size(8)
	struct Unknown U_3; //  0x588 Size(8)
	struct Unknown U_4; //  0x590 Size(8)
	struct Unknown VerticalBox_3; //  0x598 Size(8)
	struct Unknown VerticalBox_BuffList; //  0x5a0 Size(8)
	struct Unknown VerticalBox_BuffList_2; //  0x5a8 Size(8)
	struct Unknown VerticalBox_CombineTarget; //  0x5b0 Size(8)
	struct Unknown VerticalBox_; //  0x5b8 Size(8)
	struct Unknown VerticalBox_ItemDiv; //  0x5c0 Size(8)
	struct Unknown VerticalBox_WeaponBindedInfo; //  0x5c8 Size(8)
	struct Unknown WeaponItemCapacity; //  0x5d0 Size(8)
	struct Unknown WeaponItemComparingName; //  0x5d8 Size(8)
	struct Unknown WeaponItemDescription; //  0x5e0 Size(8)
	struct Unknown WeaponItemImage; //  0x5e8 Size(8)
	struct Unknown WeaponItemSlot; //  0x5f0 Size(8)
	struct Unknown WeaponItemSlotHover; //  0x5f8 Size(8)
	struct Unknown WeaponItemType; //  0x600 Size(8)
	struct Unknown WeaponLockImage; //  0x608 Size(8)
	struct Unknown WeaponName; //  0x610 Size(8)
	struct Unknown WidgetSwitcher; //  0x618 Size(8)
	struct Unknown WidgetSwitcher_1; //  0x620 Size(8)
	struct Unknown WidgetSwitcher_2; //  0x628 Size(8)
	struct Unknown WidgetSwitcher_3; //  0x630 Size(8)
	struct Unknown WidgetSwitcher_4; //  0x638 Size(8)
	struct Unknown WidgetSwitcher_Main; //  0x640 Size(8)
	struct Unknown WidgetSwitcher_PerkUltimate; //  0x648 Size(8)
	struct Unknown ItemInfo; //  0x650 Size(98)
	struct Unknown WeaponInfo; //  0x6e8 Size(b30)
	char bCompare; //  0x1218 Size(1)
	struct Unknown NormalSlateColor; //  0x1220 Size(28)
	struct Unknown UpSlateColor; //  0x1248 Size(28)
	struct Unknown DownSlateColor; //  0x1270 Size(28)
	struct Unknown UpLinearColor; //  0x1298 Size(10)
	struct Unknown DownLinearColor; //  0x12a8 Size(10)
	struct Unknown WeaponObjectRef; //  0x12b8 Size(8)
	struct Unknown Item; //  0x12c0 Size(490)
	struct Unknown PerkInfo; //  0x1750 Size(2c)
	struct Unknown Perk; //  0x1780 Size(e0)
	struct FName Ammo; //  0x1860 Size(8)
	enum class Unknow DragType; //  0x1868 Size(1)
	struct Unknown HoveredWidget; //  0x1870 Size(8)
	struct Unknown CurrentShowingWidgetRef; //  0x1878 Size(8)
	char IsUltimatePerk; //  0x1880 Size(1)
	struct FText UltimateName; //  0x1888 Size(18)
	struct Unknown UltimateLinearColor; //  0x18a0 Size(10)
	struct TSoftObjectPtr<Unknown> UltimateImage; //  0x18b0 Size(28)
	struct Unknown HoverTimerHandle; //  0x18d8 Size(8)
	char NeedCheckVisibility; //  0x18e0 Size(1)
	char IsVisualMode; //  0x18e1 Size(1)
	char IsRandomPerk; //  0x18e2 Size(1)
	struct TArray<Unknown> ItemRarityImages; //  0x18e8 Size(10)
	struct TArray<Unknown> WeaponRarityImages; //  0x18f8 Size(10)

	float GetDisplayAccuracy(); // Function U.U.GetDisplayAccuracy(Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown FadeIn; //  0x250 Size(8)
	struct Unknown FadeOut; //  0x258 Size(8)
	struct Unknown Image_69; //  0x260 Size(8)
	char NextScene; //  0x268 Size(1)

	void SequenceEvent__ENTRYPOINTU_2(); // Function U.U.SequenceEvent__ENTRYPOINTU_2(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Button_Crapting_Btn; //  0x250 Size(8)
	struct Unknown Button_Crapting_Btn_dis; //  0x258 Size(8)
	struct Unknown Image_112; //  0x260 Size(8)
	struct Unknown Img_Gold; //  0x268 Size(8)
	struct Unknown Img_Gold_Inert; //  0x270 Size(8)
	struct Unknown Img_Gold_Inert_2; //  0x278 Size(8)
	struct Unknown RichTextBlock_578; //  0x280 Size(8)
	struct Unknown T_GoldCost; //  0x288 Size(8)
	struct Unknown T_GoldCost_2; //  0x290 Size(8)
	struct Unknown U; //  0x298 Size(8)
	struct Unknown U; //  0x2a0 Size(8)
	struct Unknown U; //  0x2a8 Size(8)
	struct Unknown U; //  0x2b0 Size(8)
	struct Unknown U; //  0x2b8 Size(8)
	struct Unknown WidgetSwitcher_179; //  0x2c0 Size(8)
	struct Unknown WidgetSwitcher_Gold; //  0x2c8 Size(8)
	struct Unknown CraftingInfo; //  0x2d0 Size(128)
	struct Unknown SelectedButton; //  0x3f8 Size(8)

	void GetCraftingWeaponRarity(int32_t& OutRarity); // Function U.U.GetCraftingWeaponRarity(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Image_Buff; //  0x250 Size(8)
	struct Unknown Image_Grade_Color_Line; //  0x258 Size(8)
	struct Unknown ItemOption; //  0x260 Size(b8)

	void SetItemOption(struct Unknown& ItemOption); // Function U.U.SetItemOption(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown Image_273; //  0x248 Size(8)
	struct Unknown U; //  0x250 Size(8)
	struct Unknown U; //  0x258 Size(8)

	void SetWeaponInfo(int32_t WeaponItemID); // Function U.U.SetWeaponInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown HorizontalBox_Rarity; //  0x248 Size(8)
	struct Unknown T_WeaponName; //  0x250 Size(8)

	void SetNameByID(int32_t ItemId); // Function U.U.SetNameByID(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Button_306; //  0x250 Size(8)
	struct Unknown CanvasPanel_Line; //  0x258 Size(8)
	struct Unknown CanvasPanel_Position; //  0x260 Size(8)
	struct Unknown Image_Leader; //  0x268 Size(8)
	struct Unknown Image_Rank; //  0x270 Size(8)
	struct Unknown Img_Cut; //  0x278 Size(8)
	struct Unknown Img_MS; //  0x280 Size(8)
	struct Unknown Img_MS_2; //  0x288 Size(8)
	struct Unknown Img_MS_3; //  0x290 Size(8)
	struct Unknown Img_PlayerLine; //  0x298 Size(8)
	struct Unknown Img_PlayerPoint; //  0x2a0 Size(8)
	struct Unknown Img_Voice; //  0x2a8 Size(8)
	struct Unknown Img_VoiceElimination; //  0x2b0 Size(8)
	struct Unknown Overlay_OnReady; //  0x2b8 Size(8)
	struct Unknown Overlay_Position; //  0x2c0 Size(8)
	struct Unknown Overlay_TeamOnReady; //  0x2c8 Size(8)
	struct Unknown T_PlayerName; //  0x2d0 Size(8)
	struct Unknown T_PlayerName_2; //  0x2d8 Size(8)
	struct Unknown WidgetSwitcher_3; //  0x2e0 Size(8)
	struct Unknown WidgetSwitcher_IsTeam; //  0x2e8 Size(8)
	struct Unknown WidgetSwitcher_State; //  0x2f0 Size(8)
	int32_t LastSeaponTierId; //  0x2f8 Size(4)
	float WidgetHalfSizeX; //  0x2fc Size(4)

	void Set(char IsLeft, char IsSoloMode, struct Unknown CharacterRef, struct Unknown MemberInfo); // Function U.U.Set(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown HorizontalBox_Rarity; //  0x250 Size(8)
	struct Unknown HorizontalBox_Rarity_NotOwn; //  0x258 Size(8)
	struct Unknown Img_BG; //  0x260 Size(8)
	struct Unknown Img_Icon; //  0x268 Size(8)
	struct Unknown RetainerBox_2; //  0x270 Size(8)
	struct Unknown T_CurrentCount; //  0x278 Size(8)
	struct Unknown T_MaxCount; //  0x280 Size(8)
	struct Unknown T_RecipeNum; //  0x288 Size(8)
	struct Unknown WidgetSwitcher_Rarity; //  0x290 Size(8)
	struct Unknown MaterialInfo; //  0x298 Size(d0)
	int32_t ItemId; //  0x368 Size(4)
	int32_t MaxCount; //  0x36c Size(4)
	int32_t CurrentCount; //  0x370 Size(4)

	void SetNotOwnRarityVisibility(int32_t Rarity); // Function U.U.SetNotOwnRarityVisibility(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Button_Category; //  0x250 Size(8)
	struct Unknown CanvasPanel_SlotList; //  0x258 Size(8)
	struct Unknown Image_New; //  0x260 Size(8)
	struct Unknown T_CategoryName; //  0x268 Size(8)
	struct Unknown U_4; //  0x270 Size(8)
	struct Unknown U_5; //  0x278 Size(8)
	struct Unknown U_6; //  0x280 Size(8)
	struct Unknown VerticalBox_ItemList; //  0x288 Size(8)
	struct Unknown WidgetSwitcher_Own; //  0x290 Size(8)
	struct FString WeaponType; //  0x298 Size(10)
	char IsPressed; //  0x2a8 Size(1)
	char IsOwn; //  0x2a9 Size(1)
	char IsOwnAny; //  0x2aa Size(1)
	struct Unknown ParentWidgetRef; //  0x2b0 Size(8)
	float SlotSize; //  0x2b8 Size(4)
	float CurrentListSize; //  0x2bc Size(4)
	struct Unknown DefaultImage; //  0x2c0 Size(8)
	struct Unknown HoverImage; //  0x2c8 Size(8)
	struct Unknown PressedDefaultImage; //  0x2d0 Size(8)
	struct Unknown PressedHoverImage; //  0x2d8 Size(8)

	void SetNew(); // Function U.U.SetNew(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Ellipsis_M; //  0x250 Size(8)
	struct Unknown CanvasPanel_123; //  0x258 Size(8)
	struct Unknown Enhancing; //  0x260 Size(8)
	struct Unknown Image_305; //  0x268 Size(8)
	struct Unknown Image_841; //  0x270 Size(8)
	struct Unknown InputEventBox; //  0x278 Size(8)
	struct Unknown Skip; //  0x280 Size(8)
	struct Unknown TextBlock_335; //  0x288 Size(8)
	struct Unknown TextBlock_336; //  0x290 Size(8)
	struct Unknown TextBlock_337; //  0x298 Size(8)
	struct Unknown TextBlock_362; //  0x2a0 Size(8)
	struct Unknown TextEnhanceing; //  0x2a8 Size(8)
	struct Unknown U; //  0x2b0 Size(8)
	struct Unknown U; //  0x2b8 Size(8)
	struct Unknown EnhanceResultTimerHandle; //  0x2c0 Size(8)

	void Craft(); // Function U.U.Craft(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Image_20; //  0x250 Size(8)
	struct Unknown TargetAccel; //  0x258 Size(c)
	struct Unknown CurrentAccel; //  0x264 Size(c)
	float TargetScale; //  0x270 Size(4)
	struct Unknown DataAsset; //  0x278 Size(8)
	char ResetOriginTransform; //  0x280 Size(1)
	char MouseInputLock; //  0x281 Size(1)
	char IsUpdatingRotation; //  0x282 Size(1)
	char IsValidMeshActor; //  0x283 Size(1)
	char IsPressedLeftMouse; //  0x284 Size(1)

	void CheckValidMeshActor(char& Return); // Function U.U.CheckValidMeshActor(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown Ani_Complete; //  0x248 Size(8)
	struct Unknown Ani_BG; //  0x250 Size(8)
	struct Unknown Bg; //  0x258 Size(8)
	struct Unknown Complete; //  0x260 Size(8)
	struct Unknown TextBlock_QuestDesc; //  0x268 Size(8)
	struct Unknown TextBlock_QuestTitle; //  0x270 Size(8)
	struct Unknown U; //  0x278 Size(8)
	struct Unknown U; //  0x280 Size(8)
	struct Unknown U_2; //  0x288 Size(8)
	struct Unknown U_3; //  0x290 Size(8)
	struct Unknown TaskInfo; //  0x298 Size(20)
	struct Unknown Task; //  0x2b8 Size(b0)

	void SetTaskInfo(struct Unknown TaskInfo); // Function U.U.SetTaskInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct FName ItemRowName; //  0x248 Size(8)
	struct FString ConsoleCommandString; //  0x250 Size(10)
	struct FString GiveCount; //  0x260 Size(10)
	enum class Unknow ItemType; //  0x270 Size(1)
	struct Unknown Icon; //  0x278 Size(8)
	char bSlot; //  0x280 Size(1)
	int32_t Count; //  0x284 Size(4)
	struct FName AmmoName; //  0x288 Size(8)
	struct FString AmmoCommandString; //  0x290 Size(10)
	int32_t AmmoCount; //  0x2a0 Size(4)
	struct Unknown BlackMarketMainRef; //  0x2a8 Size(8)
	struct Unknown BlackmarketDataInfo; //  0x2b0 Size(118)
	struct TArray<Unknown> ConsoleMultiCommandString; //  0x3c8 Size(10)

	void SetConsoleMultiCommandString(struct TArray<Unknown>& Str); // Function U.U.SetConsoleMultiCommandString(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x3d8 Size(8)
	struct Unknown BT; //  0x3e0 Size(8)
	struct Unknown BT; //  0x3e8 Size(8)
	struct Unknown BT; //  0x3f0 Size(8)
	struct Unknown BT; //  0x3f8 Size(8)
	struct Unknown BT; //  0x400 Size(8)
	struct Unknown C; //  0x408 Size(8)
	struct Unknown IM; //  0x410 Size(8)
	struct Unknown IM; //  0x418 Size(8)
	struct Unknown IM; //  0x420 Size(8)
	struct Unknown IM; //  0x428 Size(8)
	struct Unknown IM; //  0x430 Size(8)
	struct Unknown IM; //  0x438 Size(8)
	struct Unknown Menu02; //  0x440 Size(8)
	struct Unknown Menu03; //  0x448 Size(8)
	struct Unknown Menu04; //  0x450 Size(8)
	struct Unknown Menu05; //  0x458 Size(8)
	struct Unknown Menu06; //  0x460 Size(8)
	struct Unknown Overlay_Mask; //  0x468 Size(8)
	struct Unknown TX; //  0x470 Size(8)
	struct Unknown TX; //  0x478 Size(8)
	struct Unknown TX; //  0x480 Size(8)
	struct Unknown TX; //  0x488 Size(8)
	struct Unknown TX; //  0x490 Size(8)
	struct Unknown TX; //  0x498 Size(8)
	struct Unknown TX; //  0x4a0 Size(8)
	struct Unknown TX; //  0x4a8 Size(8)
	struct Unknown TX; //  0x4b0 Size(8)
	struct Unknown TX; //  0x4b8 Size(8)
	struct Unknown TX; //  0x4c0 Size(8)

	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x3d8 Size(8)
	struct Unknown BT; //  0x3e0 Size(8)
	struct Unknown BT; //  0x3e8 Size(8)
	struct Unknown BT; //  0x3f0 Size(8)
	struct Unknown BT; //  0x3f8 Size(8)
	struct Unknown BT; //  0x400 Size(8)
	struct Unknown BT; //  0x408 Size(8)
	struct Unknown BT; //  0x410 Size(8)
	struct Unknown BT; //  0x418 Size(8)
	struct Unknown BT; //  0x420 Size(8)
	struct Unknown BT; //  0x428 Size(8)
	struct Unknown C; //  0x430 Size(8)
	struct Unknown IM; //  0x438 Size(8)
	struct Unknown IM; //  0x440 Size(8)
	struct Unknown IM; //  0x448 Size(8)
	struct Unknown IM; //  0x450 Size(8)
	struct Unknown IM; //  0x458 Size(8)
	struct Unknown IM; //  0x460 Size(8)
	struct Unknown Menu02; //  0x468 Size(8)
	struct Unknown Menu03; //  0x470 Size(8)
	struct Unknown Menu04; //  0x478 Size(8)
	struct Unknown Menu05; //  0x480 Size(8)
	struct Unknown Menu06; //  0x488 Size(8)
	struct Unknown Menu07; //  0x490 Size(8)
	struct Unknown Menu08; //  0x498 Size(8)
	struct Unknown Menu09; //  0x4a0 Size(8)
	struct Unknown Menu10; //  0x4a8 Size(8)
	struct Unknown Menu11; //  0x4b0 Size(8)
	struct Unknown Overlay_Mask; //  0x4b8 Size(8)
	struct Unknown TX; //  0x4c0 Size(8)
	struct Unknown TX; //  0x4c8 Size(8)
	struct Unknown TX; //  0x4d0 Size(8)
	struct Unknown TX; //  0x4d8 Size(8)
	struct Unknown TX; //  0x4e0 Size(8)
	struct Unknown TX; //  0x4e8 Size(8)
	struct Unknown TX; //  0x4f0 Size(8)
	struct Unknown TX; //  0x4f8 Size(8)
	struct Unknown TX; //  0x500 Size(8)
	struct Unknown TX; //  0x508 Size(8)
	struct Unknown TX; //  0x510 Size(8)
	struct Unknown TX; //  0x518 Size(8)
	struct Unknown TX; //  0x520 Size(8)
	struct Unknown TX; //  0x528 Size(8)
	struct Unknown TX; //  0x530 Size(8)
	struct Unknown TX; //  0x538 Size(8)
	struct Unknown TX; //  0x540 Size(8)
	struct Unknown TX; //  0x548 Size(8)
	struct Unknown TX; //  0x550 Size(8)
	struct Unknown TX; //  0x558 Size(8)
	struct Unknown TX; //  0x560 Size(8)

	void SetIconTexture(struct TSoftObjectPtr<Unknown> IconTexture); // Function U.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x3d8 Size(8)
	struct Unknown BT; //  0x3e0 Size(8)
	struct Unknown C; //  0x3e8 Size(8)
	struct Unknown IM; //  0x3f0 Size(8)
	struct Unknown IM; //  0x3f8 Size(8)
	struct Unknown IM; //  0x400 Size(8)
	struct Unknown IM; //  0x408 Size(8)
	struct Unknown IM; //  0x410 Size(8)
	struct Unknown IM; //  0x418 Size(8)
	struct Unknown Menu02; //  0x420 Size(8)
	struct Unknown Overlay_Mask; //  0x428 Size(8)
	struct Unknown TX; //  0x430 Size(8)
	struct Unknown TX; //  0x438 Size(8)
	struct Unknown TX; //  0x440 Size(8)

	void SetIconTexture(struct TSoftObjectPtr<Unknown> IconTexture); // Function U.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x3d8 Size(8)
	struct Unknown BT; //  0x3e0 Size(8)
	struct Unknown C; //  0x3e8 Size(8)
	struct Unknown IM; //  0x3f0 Size(8)
	struct Unknown IM; //  0x3f8 Size(8)
	struct Unknown IM; //  0x400 Size(8)
	struct Unknown IM; //  0x408 Size(8)
	struct Unknown IM; //  0x410 Size(8)
	struct Unknown IM; //  0x418 Size(8)
	struct Unknown Menu02; //  0x420 Size(8)
	struct Unknown Overlay_Mask; //  0x428 Size(8)
	struct Unknown TX; //  0x430 Size(8)
	struct Unknown TX; //  0x438 Size(8)
	struct Unknown TX; //  0x440 Size(8)

	void SetSlotInfo(struct Unknown BlackmarketDataInfo); // Function U.U.SetSlotInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x3d8 Size(8)
	struct Unknown BT; //  0x3e0 Size(8)
	struct Unknown BT; //  0x3e8 Size(8)
	struct Unknown BT; //  0x3f0 Size(8)
	struct Unknown BT; //  0x3f8 Size(8)
	struct Unknown BT; //  0x400 Size(8)
	struct Unknown C; //  0x408 Size(8)
	struct Unknown IM; //  0x410 Size(8)
	struct Unknown IM; //  0x418 Size(8)
	struct Unknown IM; //  0x420 Size(8)
	struct Unknown IM; //  0x428 Size(8)
	struct Unknown IM; //  0x430 Size(8)
	struct Unknown IM; //  0x438 Size(8)
	struct Unknown Menu02; //  0x440 Size(8)
	struct Unknown Menu03; //  0x448 Size(8)
	struct Unknown Menu04; //  0x450 Size(8)
	struct Unknown Menu05; //  0x458 Size(8)
	struct Unknown Menu06; //  0x460 Size(8)
	struct Unknown Overlay_Mask; //  0x468 Size(8)
	struct Unknown TX; //  0x470 Size(8)
	struct Unknown TX; //  0x478 Size(8)
	struct Unknown TX; //  0x480 Size(8)
	struct Unknown TX; //  0x488 Size(8)
	struct Unknown TX; //  0x490 Size(8)
	struct Unknown TX; //  0x498 Size(8)
	struct Unknown TX; //  0x4a0 Size(8)
	struct Unknown TX; //  0x4a8 Size(8)
	struct Unknown TX; //  0x4b0 Size(8)
	struct Unknown TX; //  0x4b8 Size(8)
	struct Unknown TX; //  0x4c0 Size(8)

	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x3d8 Size(8)
	struct Unknown BT; //  0x3e0 Size(8)
	struct Unknown BT; //  0x3e8 Size(8)
	struct Unknown BT; //  0x3f0 Size(8)
	struct Unknown BT; //  0x3f8 Size(8)
	struct Unknown C; //  0x400 Size(8)
	struct Unknown IM; //  0x408 Size(8)
	struct Unknown IM; //  0x410 Size(8)
	struct Unknown IM; //  0x418 Size(8)
	struct Unknown IM; //  0x420 Size(8)
	struct Unknown IM; //  0x428 Size(8)
	struct Unknown IM; //  0x430 Size(8)
	struct Unknown Menu02; //  0x438 Size(8)
	struct Unknown Menu03; //  0x440 Size(8)
	struct Unknown Menu04; //  0x448 Size(8)
	struct Unknown Menu05; //  0x450 Size(8)
	struct Unknown Overlay_Mask; //  0x458 Size(8)
	struct Unknown TX; //  0x460 Size(8)
	struct Unknown TX; //  0x468 Size(8)
	struct Unknown TX; //  0x470 Size(8)
	struct Unknown TX; //  0x478 Size(8)
	struct Unknown TX; //  0x480 Size(8)
	struct Unknown TX; //  0x488 Size(8)
	struct Unknown TX; //  0x490 Size(8)
	struct Unknown TX; //  0x498 Size(8)
	struct Unknown TX; //  0x4a0 Size(8)

	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Button_Tab; //  0x250 Size(8)
	struct Unknown Image_Check; //  0x258 Size(8)
	struct Unknown TextBlock_TabName; //  0x260 Size(8)
	struct Unknown BlackMarket_SubTab; //  0x268 Size(8)
	enum class Unknow TabType; //  0x270 Size(1)
	struct FText TabName; //  0x278 Size(18)
	struct FName TabIndex; //  0x290 Size(8)
	char Selected; //  0x298 Size(1)

	struct Unknown Get_TextBlock_TabName_ColorAndOpacity_1(); // Function U.U.Get_TextBlock_TabName_ColorAndOpacity_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelScenarioWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Ani_TutorialComplete_FadeOut; //  0x250 Size(8)
	struct Unknown Ani_TutorialComplete; //  0x258 Size(8)
	struct Unknown Idle; //  0x260 Size(8)
	struct Unknown CanvasPanel_1; //  0x268 Size(8)
	struct Unknown U; //  0x270 Size(8)

	enum class Unknow GetVisibility_1(); // Function U.U.GetVisibility_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelConversationWidget {
	struct Unknown UberGraphFrame; //  0x258 Size(8)
	struct Unknown First; //  0x260 Size(8)
	struct Unknown Hide; //  0x268 Size(8)
	struct Unknown Show; //  0x270 Size(8)
	struct Unknown Idle; //  0x278 Size(8)
	struct Unknown Bg; //  0x280 Size(8)
	struct Unknown Bg_2; //  0x288 Size(8)
	struct Unknown Bg_3; //  0x290 Size(8)
	struct Unknown Button_407; //  0x298 Size(8)
	struct Unknown Image; //  0x2a0 Size(8)
	struct Unknown Image_2; //  0x2a8 Size(8)
	struct Unknown Image_55; //  0x2b0 Size(8)
	struct Unknown Image_340; //  0x2b8 Size(8)
	struct Unknown Overlay_Base; //  0x2c0 Size(8)
	struct Unknown TextBlock_Message; //  0x2c8 Size(8)
	struct Unknown TextBlock_SpeakerName; //  0x2d0 Size(8)
	struct Unknown U; //  0x2d8 Size(8)
	struct Unknown WidgetSwitcher_Face; //  0x2e0 Size(8)
	struct Unknown SentenceData; //  0x2e8 Size(b0)

	void Finished_F3AEE8B3477(); // Function U.U.Finished_F3AEE8B3477(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Image_2; //  0x250 Size(8)
	struct Unknown Notice; //  0x258 Size(8)
	struct Unknown WidgetSwitcher_1; //  0x260 Size(8)

	void SetMessage(struct FText Str); // Function U.U.SetMessage(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Hide; //  0x250 Size(8)
	struct Unknown Show; //  0x258 Size(8)
	struct Unknown Bg; //  0x260 Size(8)
	struct Unknown Button_OK; //  0x268 Size(8)
	struct Unknown Image_168; //  0x270 Size(8)
	struct Unknown Image_669; //  0x278 Size(8)
	struct Unknown Message; //  0x280 Size(8)
	struct Unknown TextBlock_Title; //  0x288 Size(8)
	struct Unknown U; //  0x290 Size(8)
	struct Unknown Timer; //  0x298 Size(8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelNetworkDelayWidget {
	struct Unknown Image_350; //  0x260 Size(8)
	struct Unknown Image_409; //  0x268 Size(8)
	struct Unknown Image_479; //  0x270 Size(8)
	struct Unknown Image_564; //  0x278 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Anim_ToggleItemList; //  0x250 Size(8)
	struct Unknown Anim_TogglePlayerList; //  0x258 Size(8)
	struct Unknown Anim_ToggleTimeline; //  0x260 Size(8)
	struct Unknown U; //  0x268 Size(8)
	struct Unknown U; //  0x270 Size(8)
	struct Unknown U; //  0x278 Size(8)
	struct Unknown U; //  0x280 Size(8)
	struct Unknown U; //  0x288 Size(8)
	struct Unknown U; //  0x290 Size(8)
	struct Unknown U; //  0x298 Size(8)
	struct Unknown ReplayController; //  0x2a0 Size(8)
	struct TArray<Unknown> UserNameTooltips; //  0x2a8 Size(10)
	struct Unknown MainWidget; //  0x2b8 Size(8)
	int32_t UserNameTooltipsNum; //  0x2c0 Size(4)

	void SetTargetPawnInfo(); // Function U.U.SetTargetPawnInfo(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Escape_Cursor_Reset; //  0x250 Size(8)
	struct Unknown MiniNuke_Cursor_Reset; //  0x258 Size(8)
	struct Unknown Escape_Cursor; //  0x260 Size(8)
	struct Unknown MiniNuke_Cursor; //  0x268 Size(8)
	struct Unknown Image_390; //  0x270 Size(8)
	struct Unknown Image_519; //  0x278 Size(8)
	struct Unknown Img_CursorNuclear; //  0x280 Size(8)
	struct Unknown SizeBox_Nuclear; //  0x288 Size(8)
	struct Unknown WidgetSwitcher_1; //  0x290 Size(8)
	struct Unknown Anim_MouseClicked; //  0x298 Size(8)
	struct Unknown DummyWidgetRef; //  0x2a0 Size(8)

	void PlayClickSound(); // Function U.U.PlayClickSound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelPlayerMarkerWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Anim_OnShow; //  0x250 Size(8)
	struct Unknown Canvas_Move; //  0x258 Size(8)
	struct Unknown IconImage; //  0x260 Size(8)
	struct Unknown Overlay_1; //  0x268 Size(8)
	struct Unknown PlayerMarker; //  0x270 Size(8)
	struct Unknown SizeBox_IconImage; //  0x278 Size(8)
	struct Unknown TeamIndex; //  0x280 Size(8)
	struct Unknown U; //  0x288 Size(8)
	struct Unknown WidgetSwitcher_Icon; //  0x290 Size(8)
	char IsShowingAnimReserv; //  0x298 Size(1)
	struct FMulticastInlineDelegate OnMarkerClicked; //  0x2a0 Size(10)
	struct Unknown CurrentMarker; //  0x2b0 Size(8)
	struct TMap<{}, {}>Unknown Map_PingTypeTexture; //  0x2b8 Size(50)
	struct TMap<{}, {}>Unknown Map_PingItemTypeTexture; //  0x308 Size(50)
	struct Unknown SupplyBoxNotOpen; //  0x358 Size(8)
	struct Unknown SupplyBoxOpened; //  0x360 Size(8)
	struct Unknown PlayerState; //  0x368 Size(8)
	char IsOnMap; //  0x370 Size(1)
	char Selected; //  0x371 Size(1)
	char MyPing; //  0x372 Size(1)

	struct Unknown OnMouseButtonDown(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Anim_MS; //  0x250 Size(8)
	struct Unknown Image_78; //  0x258 Size(8)
	struct Unknown PingImage; //  0x260 Size(8)

	void UpdatePing(); // Function U.U.UpdatePing(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown NewAnimation; //  0x248 Size(8)
	struct Unknown Icon; //  0x250 Size(8)
	struct Unknown ImageLine; //  0x258 Size(8)
	struct Unknown Img_Color; //  0x260 Size(8)

	void InitIcon(struct Unknown PlayerState); // Function U.U.InitIcon(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Image_73; //  0x250 Size(8)
	struct Unknown KeyImageWidget; //  0x258 Size(8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelInventoryPerkSlotWidget {
	struct Unknown UberGraphFrame; //  0x2a0 Size(8)
	struct Unknown LevelUp; //  0x2a8 Size(8)
	struct Unknown Blank_SkillBG; //  0x2b0 Size(8)
	struct Unknown Get_SkillBG; //  0x2b8 Size(8)
	struct Unknown IMG_CoolTime; //  0x2c0 Size(8)
	struct Unknown IMG_PerkIcon; //  0x2c8 Size(8)
	struct Unknown KeyImageWidget; //  0x2d0 Size(8)
	struct Unknown Lv1; //  0x2d8 Size(8)
	struct Unknown Lv2; //  0x2e0 Size(8)
	struct Unknown Lv3; //  0x2e8 Size(8)
	struct Unknown Over_CoolTime; //  0x2f0 Size(8)
	struct Unknown T_CoolTime; //  0x2f8 Size(8)
	struct Unknown T_PerkName; //  0x300 Size(8)
	struct Unknown WidgetSwitcher_Icon; //  0x308 Size(8)
	char bHover; //  0x310 Size(1)
	float CurrentExpPercent; //  0x314 Size(4)
	int32_t CurrentLevel; //  0x318 Size(4)
	int32_t LastLevel; //  0x31c Size(4)
	float TargetExpPercent; //  0x320 Size(4)
	float ExpSpeed; //  0x324 Size(4)
	struct Unknown Perk; //  0x328 Size(e0)
	float CurrentLevelPercent; //  0x408 Size(4)
	int32_t MaxLevel; //  0x40c Size(4)
	struct Unknown HoverWidget; //  0x410 Size(8)
	struct TArray<Unknown> LvArray; //  0x418 Size(10)

	void SetForVisual(); // Function U.U.SetForVisual(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Image_350; //  0x250 Size(8)
	struct Unknown Image_585; //  0x258 Size(8)
	struct Unknown Image_Grade_Color_Line; //  0x260 Size(8)
	struct Unknown TextBlock_445; //  0x268 Size(8)

	void SetBuffInfo(struct FText BuffName, struct FText Desc, struct TSoftObjectPtr<Unknown> Icon, int32_t Rarity); // Function U.U.SetBuffInfo(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Image_350; //  0x250 Size(8)
	struct Unknown Image_585; //  0x258 Size(8)
	struct Unknown Image_Grade_Color_Line; //  0x260 Size(8)

	void SetBuffInfo(struct FText BuffName, struct FText Desc, struct TSoftObjectPtr<Unknown> Icon, int32_t Rarity); // Function U.U.SetBuffInfo(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown LevelUp; //  0x250 Size(8)
	struct Unknown FadeOut; //  0x258 Size(8)
	struct Unknown FadeIn; //  0x260 Size(8)
	struct Unknown Idle; //  0x268 Size(8)
	struct Unknown CanvasPanel_2; //  0x270 Size(8)
	struct Unknown Image_336; //  0x278 Size(8)
	struct Unknown Image_Back; //  0x280 Size(8)
	struct Unknown Overlay_186; //  0x288 Size(8)
	struct Unknown PerkLastLevel; //  0x290 Size(8)
	struct Unknown PerkLevelText; //  0x298 Size(8)
	struct Unknown PerkName; //  0x2a0 Size(8)
	struct Unknown PerkSlotHover; //  0x2a8 Size(8)
	struct Unknown RichTextBlock_Desc; //  0x2b0 Size(8)
	struct Unknown TextBlock_1; //  0x2b8 Size(8)
	struct Unknown TextBlock_8; //  0x2c0 Size(8)
	struct Unknown U; //  0x2c8 Size(8)
	struct Unknown PerkInfo; //  0x2d0 Size(2c)
	struct Unknown Perk; //  0x300 Size(e0)
	int32_t PerkLevel; //  0x3e0 Size(4)
	struct Unknown PerInGameData; //  0x3e8 Size(1c8)
	int32_t Index; //  0x5b0 Size(4)
	struct Unknown MainWiget; //  0x5b8 Size(8)
	float CurrentHeight; //  0x5c0 Size(4)
	int32_t LastPerkLevel; //  0x5c4 Size(4)
	struct Unknown DefaultPosition; //  0x5c8 Size(8)
	int32_t CurrenteLevel; //  0x5d0 Size(4)
	char IsPlayingUltimateSound; //  0x5d4 Size(1)

	char IsUltimateLevel(); // Function U.U.IsUltimateLevel(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelVehicleWidget {
	struct Unknown UberGraphFrame; //  0x2a8 Size(8)
	struct Unknown FuelGauge; //  0x2b0 Size(8)
	struct Unknown FuelIcon; //  0x2b8 Size(8)
	struct Unknown HPFaint; //  0x2c0 Size(8)
	struct Unknown HPGauge; //  0x2c8 Size(8)
	struct Unknown HPIcon; //  0x2d0 Size(8)
	struct Unknown SpeedText; //  0x2d8 Size(8)
	struct Unknown SubInfoParent; //  0x2e0 Size(8)
	struct Unknown U; //  0x2e8 Size(8)
	struct Unknown CachedVehicle; //  0x2f0 Size(8)
	struct Unknown MySeatColor; //  0x2f8 Size(10)
	struct Unknown EmptyFuelColor; //  0x308 Size(10)
	float InterpTargetHpRate; //  0x318 Size(4)
	float InterpCurrentHpRate; //  0x31c Size(4)
	float InterpSpeed; //  0x320 Size(4)
	struct Unknown HPFaintCurve; //  0x328 Size(8)
	struct Unknown HPColorCurve; //  0x330 Size(8)
	struct Unknown SubInfoWidget; //  0x338 Size(8)
	char EnableBind; //  0x340 Size(1)
	struct Unknown NewVar_1; //  0x348 Size(8)

	void OnWheelWrecked(int32_t WheelIndex); // Function U.U.OnWheelWrecked(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Anim_Hide_Ima; //  0x250 Size(8)
	struct Unknown Anim_Hide_text; //  0x258 Size(8)
	struct Unknown Anim_Show_Ima; //  0x260 Size(8)
	struct Unknown Anim_Show_text; //  0x268 Size(8)
	struct Unknown Canvas_Main; //  0x270 Size(8)
	struct Unknown HorizontalBox_86; //  0x278 Size(8)
	struct Unknown Image_130; //  0x280 Size(8)
	struct Unknown Image_811; //  0x288 Size(8)
	struct Unknown Img_MapImage; //  0x290 Size(8)
	struct Unknown MatchType; //  0x298 Size(8)
	struct Unknown MaxPlayerCount; //  0x2a0 Size(8)
	struct Unknown Overlay_Text; //  0x2a8 Size(8)
	struct Unknown PersonType; //  0x2b0 Size(8)
	struct Unknown T_MapImageDesc; //  0x2b8 Size(8)
	struct Unknown T_MapImageTitle; //  0x2c0 Size(8)
	struct Unknown Ultimate; //  0x2c8 Size(8)
	char IsShowText; //  0x2d0 Size(1)
	struct Unknown Timer_HideMapImage; //  0x2d8 Size(8)
	int32_t LastZoomLevel; //  0x2e0 Size(4)
	float WantOpacity; //  0x2e4 Size(4)
	struct Unknown MainWidgetRef; //  0x2e8 Size(8)
	char IsShowImage; //  0x2f0 Size(1)
	enum class Unknow LastWidgetType; //  0x2f1 Size(1)
	struct FText UltimateText; //  0x2f8 Size(18)

	void UpdateWantedOpacity(); // Function U.U.UpdateWantedOpacity(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelJetpackWidget {
	struct Unknown UberGraphFrame; //  0x268 Size(8)
	struct Unknown FuelGauge; //  0x270 Size(8)
	struct Unknown FuelIcon; //  0x278 Size(8)
	struct Unknown FuelText; //  0x280 Size(8)

	void SetNativeValues(); // Function U.U.SetNativeValues(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelInteractionWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown UpArrow; //  0x250 Size(8)
	struct Unknown InteractivePopup_motion; //  0x258 Size(8)
	struct Unknown AmmoCnt; //  0x260 Size(8)
	struct Unknown Ammo; //  0x268 Size(8)
	struct Unknown AmmoUp; //  0x270 Size(8)
	struct Unknown Attack; //  0x278 Size(8)
	struct Unknown AttackDown; //  0x280 Size(8)
	struct Unknown AttackUp; //  0x288 Size(8)
	struct Unknown BuffListWithText; //  0x290 Size(8)
	struct Unknown CanvasPanel_17; //  0x298 Size(8)
	struct Unknown CP_Key; //  0x2a0 Size(8)
	struct Unknown CustomWidgetSwitcher; //  0x2a8 Size(8)
	struct Unknown fill; //  0x2b0 Size(8)
	struct Unknown Firingrate; //  0x2b8 Size(8)
	struct Unknown FiringrateDown; //  0x2c0 Size(8)
	struct Unknown FiringrateUp; //  0x2c8 Size(8)
	struct Unknown HB_BuffList; //  0x2d0 Size(8)
	struct Unknown HorizontalBox_Rarity; //  0x2d8 Size(8)
	struct Unknown HorizontalBox_WeaponRarity; //  0x2e0 Size(8)
	struct Unknown Image; //  0x2e8 Size(8)
	struct Unknown Image_4; //  0x2f0 Size(8)
	struct Unknown Image_10; //  0x2f8 Size(8)
	struct Unknown Image_152; //  0x300 Size(8)
	struct Unknown Image_ItemIcon; //  0x308 Size(8)
	struct Unknown Image_WeaponLock; //  0x310 Size(8)
	struct Unknown Interactive; //  0x318 Size(8)
	struct Unknown ItemBg_01; //  0x320 Size(8)
	struct Unknown Key_Bomb; //  0x328 Size(8)
	struct Unknown KeyImageWidget_C_1; //  0x330 Size(8)
	struct Unknown NeedItem; //  0x338 Size(8)
	struct Unknown PickUpBg; //  0x340 Size(8)
	struct Unknown PickupItem; //  0x348 Size(8)
	struct Unknown Range; //  0x350 Size(8)
	struct Unknown RangeDown; //  0x358 Size(8)
	struct Unknown RangeUp; //  0x360 Size(8)
	struct Unknown RichT_Action; //  0x368 Size(8)
	struct Unknown RichT_Action; //  0x370 Size(8)
	struct Unknown SizeBox_WeaponOwner; //  0x378 Size(8)
	struct Unknown Stability; //  0x380 Size(8)
	struct Unknown StabilityDown; //  0x388 Size(8)
	struct Unknown StabilityUp; //  0x390 Size(8)
	struct Unknown Switcher_Item; //  0x398 Size(8)
	struct Unknown T_BombCancel; //  0x3a0 Size(8)
	struct Unknown T_ComparingWeaponName; //  0x3a8 Size(8)
	struct Unknown T_PickupItemName; //  0x3b0 Size(8)
	struct Unknown T_WeaponName; //  0x3b8 Size(8)
	struct Unknown Text_CombineTarget; //  0x3c0 Size(8)
	struct Unknown TextBlock_5; //  0x3c8 Size(8)
	struct Unknown U; //  0x3d0 Size(8)
	struct Unknown U_2; //  0x3d8 Size(8)
	struct Unknown U_3; //  0x3e0 Size(8)
	struct Unknown U; //  0x3e8 Size(8)
	struct Unknown U_2; //  0x3f0 Size(8)
	struct Unknown U_3; //  0x3f8 Size(8)
	struct Unknown VerticalBox_CombineTarget; //  0x400 Size(8)
	struct Unknown VerticalBox_StatUp; //  0x408 Size(8)
	struct Unknown WeaponDesc; //  0x410 Size(8)
	struct Unknown WeaponItemImage; //  0x418 Size(8)
	struct Unknown WeaponItemSlot; //  0x420 Size(8)
	struct Unknown WeaponItemSlot_2; //  0x428 Size(8)
	struct Unknown WeaponItemSlotHover; //  0x430 Size(8)
	struct Unknown WidgetSwitcher_123; //  0x438 Size(8)
	struct Unknown DisableTextColor; //  0x440 Size(28)
	struct Unknown EnableTextColor; //  0x468 Size(28)
	char IsDisable; //  0x490 Size(1)
	struct Unknown PickupItemInfo_1; //  0x498 Size(98)
	struct Unknown UpLinearColor; //  0x530 Size(10)
	struct Unknown DownLinearColor; //  0x540 Size(10)
	struct Unknown NormalSlateColor; //  0x550 Size(28)
	struct Unknown UpSlateColor; //  0x578 Size(28)
	struct Unknown DownSlateColor; //  0x5a0 Size(28)
	char bAction; //  0x5c8 Size(1)
	char bCompare; //  0x5c9 Size(1)
	struct Unknown CompareWeaponInfo; //  0x5d0 Size(b30)
	char IsNoHide; //  0x1100 Size(1)
	char bWeapon; //  0x1101 Size(1)
	char bPlayAnimation_WeaponCompare; //  0x1102 Size(1)
	struct Unknown VisibleTextColor; //  0x1108 Size(28)
	struct Unknown BrushActionKeyWhite; //  0x1130 Size(88)
	struct Unknown BrushActionKeyRed; //  0x11b8 Size(88)
	struct FName TempName; //  0x1240 Size(8)
	struct FText AvailableAmmoQuantity; //  0x1248 Size(18)

	void SetCompareFloatArrow(struct Unknown UpImgae, struct Unknown DownImgae, struct Unknown Text, struct Unknown CompareInfo); // Function U.U.SetCompareFloatArrow(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown VB_CoreList; //  0x250 Size(8)
	int32_t MaxWidgetCount; //  0x258 Size(4)
	char bStartFromTop; //  0x25c Size(1)
	char Alignment; //  0x25d Size(1)
	int32_t SetWidgetSwitcherIndex; //  0x260 Size(4)

	void CheckCanStackDamageLog(struct Unknown& DamageLogInfo, char& CanStack); // Function U.U.CheckCanStackDamageLog(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelTeamPositionWidget {
	struct Unknown UberGraphFrame; //  0x290 Size(8)
	struct Unknown Anim_Bouncing; //  0x298 Size(8)
	struct Unknown CanvasRequestResuscitation; //  0x2a0 Size(8)
	struct Unknown CriticalGuage; //  0x2a8 Size(8)
	struct Unknown DyingGuage; //  0x2b0 Size(8)
	struct Unknown Img_StateDeath; //  0x2b8 Size(8)
	struct Unknown Img_StateDisconnect; //  0x2c0 Size(8)
	struct Unknown Img_StateParachute; //  0x2c8 Size(8)
	struct Unknown Img_StateRevival; //  0x2d0 Size(8)
	struct Unknown Img_StateVehicle; //  0x2d8 Size(8)
	struct Unknown Img_TeamColor; //  0x2e0 Size(8)
	struct Unknown KnockDownBar; //  0x2e8 Size(8)
	struct Unknown MoveParameter; //  0x2f0 Size(8)
	struct Unknown RevivingGuage; //  0x2f8 Size(8)
	struct Unknown Switcher_Guage; //  0x300 Size(8)
	struct Unknown Switcher_Icon; //  0x308 Size(8)
	struct Unknown TextBlock_Name; //  0x310 Size(8)
	struct Unknown TextBlock_PlayerIndex; //  0x318 Size(8)
	struct Unknown RevivingTimerHandle; //  0x320 Size(8)
	float TotalRevivingTime; //  0x328 Size(4)
	float CurrentRevivingTime; //  0x32c Size(4)
	char IsRequestResuscitation; //  0x330 Size(1)

	void Move(); // Function U.U.Move(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown EnemySkull; //  0x250 Size(8)
	struct Unknown Image_436; //  0x258 Size(8)
	struct Unknown Pawn; //  0x260 Size(8)

	void SetDiedPawnInfo(struct Unknown BroadCastInfo); // Function U.U.SetDiedPawnInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelCompassUnitWidget {
	struct Unknown InvalidationBox_1; //  0x250 Size(8)
	struct Unknown InvalidationBox_2; //  0x258 Size(8)
	struct Unknown SpecialText; //  0x260 Size(8)

	struct FText GetAngleText(int32_t Angle, char& IsNormal); // Function U.U.GetAngleText(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelAttackUserWidget {
	struct Unknown Enemy_Lv_Motion_FadeOut_Inert; //  0x2a0 Size(8)
	struct Unknown Enemy_Lv_Motion_FadeIn_Inert; //  0x2a8 Size(8)
	struct Unknown FadeOut; //  0x2b0 Size(8)
	struct Unknown Enemy_Inert; //  0x2b8 Size(8)
	struct Unknown HorizontalBox_1; //  0x2c0 Size(8)
	struct Unknown HorizontalBox_2; //  0x2c8 Size(8)
	struct Unknown Image_2; //  0x2d0 Size(8)
	struct Unknown Image_145; //  0x2d8 Size(8)
	struct Unknown Overlay_2; //  0x2e0 Size(8)
	struct Unknown Overlay_98; //  0x2e8 Size(8)
	struct Unknown Pawn; //  0x2f0 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown RichTextBlock_52; //  0x250 Size(8)
	struct FText SetText; //  0x258 Size(18)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Action; //  0x250 Size(8)
	struct Unknown Image_14; //  0x258 Size(8)
	struct Unknown LeftBtn; //  0x260 Size(8)
	struct Unknown MidBtn; //  0x268 Size(8)
	struct Unknown Mouse; //  0x270 Size(8)
	struct Unknown RightBtn; //  0x278 Size(8)
	struct Unknown ScaleBox_2; //  0x280 Size(8)
	struct Unknown Side; //  0x288 Size(8)
	struct Unknown SideUp; //  0x290 Size(8)
	struct Unknown Text_Action; //  0x298 Size(8)
	struct Unknown Text_Action_UsingAlphaBg; //  0x2a0 Size(8)
	struct Unknown Turn; //  0x2a8 Size(8)
	struct Unknown WheelDown; //  0x2b0 Size(8)
	struct Unknown WheelUp; //  0x2b8 Size(8)
	struct Unknown WidgetSwitcher_TextStyle; //  0x2c0 Size(8)
	struct Unknown X; //  0x2c8 Size(8)
	struct Unknown Y; //  0x2d0 Size(8)
	struct Unknown Temp; //  0x2d8 Size(8)
	char NewVar_1; //  0x2e0 Size(1)
	float DefalutScale; //  0x2e4 Size(4)

	void SetFontSize(int32_t Size); // Function U.U.SetFontSize(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown C; //  0x250 Size(8)
	struct Unknown Blink; //  0x258 Size(8)
	struct Unknown Dot; //  0x260 Size(8)
	struct Unknown MainCanvas; //  0x268 Size(8)
	struct Unknown BT; //  0x270 Size(8)
	struct Unknown C; //  0x278 Size(8)
	struct Unknown C; //  0x280 Size(8)
	struct Unknown C; //  0x288 Size(8)
	struct Unknown C; //  0x290 Size(8)
	struct Unknown C; //  0x298 Size(8)
	struct Unknown ED; //  0x2a0 Size(8)
	struct Unknown ED; //  0x2a8 Size(8)
	struct Unknown Image_1; //  0x2b0 Size(8)
	struct Unknown Image_2; //  0x2b8 Size(8)
	struct Unknown Image_3; //  0x2c0 Size(8)
	struct Unknown Image_5; //  0x2c8 Size(8)
	struct Unknown Image_10; //  0x2d0 Size(8)
	struct Unknown Image_204; //  0x2d8 Size(8)
	struct Unknown IM; //  0x2e0 Size(8)
	struct Unknown IM; //  0x2e8 Size(8)
	struct Unknown TX; //  0x2f0 Size(8)
	struct Unknown TX; //  0x2f8 Size(8)
	struct Unknown TX; //  0x300 Size(8)
	struct Unknown TXT_Connecting_Dot; //  0x308 Size(8)
	struct Unknown U; //  0x310 Size(8)
	struct Unknown TitleWidgetRef; //  0x318 Size(8)
	int32_t State; //  0x320 Size(4)
	char bPlayOnce; //  0x324 Size(1)
	char bPopupOpen; //  0x325 Size(1)
	struct Unknown ExitPopupKey; //  0x328 Size(18)

	void SetTitleWidget(struct Unknown TitleWidget); // Function U.U.SetTitleWidget(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelLoginWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Blink; //  0x250 Size(8)
	struct Unknown FadeIn; //  0x258 Size(8)
	struct Unknown Button_480; //  0x260 Size(8)
	struct Unknown Button_482; //  0x268 Size(8)
	struct Unknown Button_483; //  0x270 Size(8)
	struct Unknown Button_484; //  0x278 Size(8)
	struct Unknown Button_485; //  0x280 Size(8)
	struct Unknown Button_486; //  0x288 Size(8)
	struct Unknown Button_ExitGame; //  0x290 Size(8)
	struct Unknown Button_Retry; //  0x298 Size(8)
	struct Unknown CanvasPanel_10; //  0x2a0 Size(8)
	struct Unknown CanvasPanel_143; //  0x2a8 Size(8)
	struct Unknown CanvasPanel_; //  0x2b0 Size(8)
	struct Unknown CanvasPanel_JuvenileRestricted; //  0x2b8 Size(8)
	struct Unknown CanvasPanel_RestrictedUser; //  0x2c0 Size(8)
	struct Unknown CanvasPanel_ServerInspection; //  0x2c8 Size(8)
	struct Unknown CanvasPanel_UnableToConnectServer; //  0x2d0 Size(8)
	struct Unknown CanvasPanel_WaitingServer; //  0x2d8 Size(8)
	struct Unknown HorizontalBox_1; //  0x2e0 Size(8)
	struct Unknown HorizontalBox_2; //  0x2e8 Size(8)
	struct Unknown Image_122; //  0x2f0 Size(8)
	struct Unknown Image_123; //  0x2f8 Size(8)
	struct Unknown Image_309; //  0x300 Size(8)
	struct Unknown Image_bg; //  0x308 Size(8)
	struct Unknown SizeBox; //  0x310 Size(8)
	struct Unknown SizeBox_2; //  0x318 Size(8)
	struct Unknown SizeBox_85; //  0x320 Size(8)
	struct Unknown TextBlock; //  0x328 Size(8)
	struct Unknown TextBlock_2; //  0x330 Size(8)
	struct Unknown TextBlock_3; //  0x338 Size(8)
	struct Unknown TextBlock_4; //  0x340 Size(8)
	struct Unknown TextBlock_544; //  0x348 Size(8)
	struct Unknown TextBlock_546; //  0x350 Size(8)
	struct Unknown TextBlock_Desc; //  0x358 Size(8)
	struct Unknown TextBlock_EndTime; //  0x360 Size(8)
	struct Unknown Throbber_1; //  0x368 Size(8)
	struct Unknown Throbber_979; //  0x370 Size(8)
	struct Unknown TX; //  0x378 Size(8)
	struct Unknown WidgetSwitcher_1; //  0x380 Size(8)
	struct Unknown TitleWidgetRef; //  0x388 Size(8)
	struct FString ErrorID; //  0x390 Size(10)
	int32_t ErrorIndex; //  0x3a0 Size(4)
	struct FString ErrorParameters; //  0x3a8 Size(10)
	struct Unknown MediaPlayer; //  0x3b8 Size(8)
	struct Unknown Media; //  0x3c0 Size(8)
	struct Unknown MediaTexture; //  0x3c8 Size(8)
	struct Unknown MediaSoundComp; //  0x3d0 Size(8)
	int32_t ApplyUserInfoCount; //  0x3d8 Size(4)
	char bServicePlatformFlow; //  0x3dc Size(1)

	void DefaultMessage(); // Function U.U.DefaultMessage(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelScopeWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Idle; //  0x250 Size(8)
	struct Unknown Scope_In; //  0x258 Size(8)
	struct Unknown CanvasPanel_1; //  0x260 Size(8)
	struct Unknown Distance_Image; //  0x268 Size(8)
	struct Unknown Distance_Text; //  0x270 Size(8)
	struct Unknown Magnify_Image; //  0x278 Size(8)
	struct Unknown Magnify_Text; //  0x280 Size(8)
	struct Unknown Scope_BG; //  0x288 Size(8)
	struct Unknown Scope_Info_Line; //  0x290 Size(8)
	struct Unknown Scope_Wing; //  0x298 Size(8)

	struct Unknown Get__1(); // Function U.U.Get__1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelScopeWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown CanvasPanel_1; //  0x250 Size(8)
	struct Unknown Image_25; //  0x258 Size(8)
	struct Unknown Image_26; //  0x260 Size(8)
	struct Unknown Image_27; //  0x268 Size(8)
	struct Unknown Image_28; //  0x270 Size(8)
	struct Unknown Image_29; //  0x278 Size(8)
	struct Unknown Image_30; //  0x280 Size(8)
	struct Unknown WidgetSwitcher_167; //  0x288 Size(8)
	struct Unknown NewVar_1; //  0x290 Size(8)

	void SetScopeImageAngle(float NewAngle); // Function U.U.SetScopeImageAngle(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelScopeWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown CanvasPanel_1; //  0x250 Size(8)
	struct Unknown Image_1; //  0x258 Size(8)
	struct Unknown NewVar_1; //  0x260 Size(8)

	void SetScopeImageAngle(float NewAngle); // Function U.U.SetScopeImageAngle(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

