// WidgetBlueprintGeneratedClass U.U
class UU : public UU {

public:

	struct Unknown UberGraphFrame; // 0x1360 (8)
	struct Unknown Complete_ani; // 0x1368 (8)
	struct Unknown Searching_ani; // 0x1370 (8)
	struct Unknown Blank_SkillBG; // 0x1378 (8)
	struct Unknown Border_507; // 0x1380 (8)
	struct Unknown Button_332; // 0x1388 (8)
	struct Unknown Get_SkillBG; // 0x1390 (8)
	struct Unknown Get_SkillBG_lv5; // 0x1398 (8)
	struct Unknown Get_SkillBG_lv6; // 0x13A0 (8)
	struct Unknown Get_SkillBG_lv7; // 0x13A8 (8)
	struct Unknown HorizontalBox_Rarity; // 0x13B0 (8)
	struct Unknown Image; // 0x13B8 (8)
	struct Unknown Image_2; // 0x13C0 (8)
	struct Unknown Image_3; // 0x13C8 (8)
	struct Unknown Image_4; // 0x13D0 (8)
	struct Unknown Image_5; // 0x13D8 (8)
	struct Unknown Image_6; // 0x13E0 (8)
	struct Unknown Image_7; // 0x13E8 (8)
	struct Unknown Image_8; // 0x13F0 (8)
	struct Unknown Image_9; // 0x13F8 (8)
	struct Unknown Image_10; // 0x1400 (8)
	struct Unknown Image_12; // 0x1408 (8)
	struct Unknown Image_16; // 0x1410 (8)
	struct Unknown Image_332; // 0x1418 (8)
	struct Unknown Image_689; // 0x1420 (8)
	struct Unknown Image_690; // 0x1428 (8)
	struct Unknown Image_Full; // 0x1430 (8)
	struct Unknown Image_Have; // 0x1438 (8)
	struct Unknown Img_Active; // 0x1440 (8)
	struct Unknown IMG_Complete; // 0x1448 (8)
	struct Unknown IMG_ItemIcon; // 0x1450 (8)
	struct Unknown MouseHover_2; // 0x1458 (8)
	struct Unknown MouseHover_; // 0x1460 (8)
	struct Unknown MousePress_2; // 0x1468 (8)
	struct Unknown MousePress_; // 0x1470 (8)
	struct Unknown MyWeapon; // 0x1478 (8)
	struct Unknown Searching; // 0x1480 (8)
	struct Unknown Searching_; // 0x1488 (8)
	struct Unknown SizeBox_1; // 0x1490 (8)
	struct Unknown SizeBox_8; // 0x1498 (8)
	struct Unknown T_PerkName; // 0x14A0 (8)
	struct Unknown T_PerkName_2; // 0x14A8 (8)
	struct Unknown T_PerkName_3; // 0x14B0 (8)
	struct Unknown T_PerkName_4; // 0x14B8 (8)
	struct Unknown VerticalBox_1; // 0x14C0 (8)
	struct Unknown HoverWidget; // 0x14C8 (8)
	char Selected : 0; // 0x14D0 (1)
	struct Unknown SelectItem; // 0x14D4 (16)
	struct Unknown NewVar_1; // 0x14E8 (8)
	char EnableSearch : 0; // 0x14F0 (1)
	struct Unknown TempData; // 0x14F4 (16)
	char IsComplete : 0; // 0x1504 (1)

	struct Unknown OnMouseButtonDown(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnMouseButtonUp(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonUp(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetOpacity(char bActive, char bComplete); // Function U.U.SetOpacity(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void MouseEnterImpl(); // Function U.U.MouseEnterImpl(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRarity(enum class Unknow Rarity, char bStar); // Function U.U.SetRarity(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetMaterialInfo(struct FName ItemKey, int32_t Count, char Complete, char Having, struct Unknown HoverWidget, struct FName TopItem); // Function U.U.SetMaterialInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_B0A3D28F44780582B366508928D8D420(struct Unknown Loaded); // Function U.U.OnLoaded_B0A3D28F44780582B366508928D8D420(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_331_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_331_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_331_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_331_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_331_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_331_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_331_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_331_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Set(char Select); // Function U.U.Set(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function U.U.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (struct Unknown MaterialItemKey, char IsSelect); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (char EnableMaterialSearch); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadIconTexture(struct Unknown IconTexture); // Function U.U.AsyncLoadIconTexture(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Disappear; // 0x250 (8)
	struct Unknown Finish; // 0x258 (8)
	struct Unknown Spin; // 0x260 (8)
	struct Unknown Idle; // 0x268 (8)
	struct Unknown Image_180; // 0x270 (8)
	struct Unknown ItemImage_bg; // 0x278 (8)
	struct Unknown ItemImage_Dummy1; // 0x280 (8)
	struct Unknown ItemImage_Main; // 0x288 (8)
	struct Unknown TextBlock_1; // 0x290 (8)
	struct Unknown TextBlock_3; // 0x298 (8)
	struct Unknown TextMountablewea; // 0x2A0 (8)
	struct Unknown TextMountableweaLV1; // 0x2A8 (8)
	struct Unknown PerkInfo; // 0x2B0 (40)
	struct Unknown PerkData; // 0x2D8 (224)
	char bLevelUp : 0; // 0x3B8 (1)
	char bFinishing : 0; // 0x3B9 (1)
	float FinishTime; // 0x3BC (4)
	enum class Unknow PerkSlot; // 0x3C0 (1)

	struct FText Get_TextBlock_1_Text_1(); // Function U.U.Get_TextBlock_1_Text_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown Get_ItemImage_bg_Brush_1(); // Function U.U.Get_ItemImage_bg_Brush_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown Get_ItemImage_Main_Brush_1(); // Function U.U.Get_ItemImage_Main_Brush_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct FText Get_TextMountablewea_Text_1(); // Function U.U.Get_TextMountablewea_Text_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	enum class Unknow Get_TextBlock_2_Visibility_1(); // Function U.U.Get_TextBlock_2_Visibility_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	enum class Unknow Get_TextBlock_0_Visibility_1(); // Function U.U.Get_TextBlock_0_Visibility_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartFinish(); // Function U.U.StartFinish(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartSpin(); // Function U.U.StartSpin(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EndFinish(); // Function U.U.EndFinish(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkInfo(struct Unknown PerkInfo); // Function U.U.SetPerkInfo(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RemoveSelf(); // Function U.U.RemoveSelf(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelJetpackWidget {

public:

	struct Unknown UberGraphFrame; // 0x268 (8)
	struct Unknown FuelGauge; // 0x270 (8)
	struct Unknown FuelIcon; // 0x278 (8)
	struct Unknown FuelText; // 0x280 (8)

	void SetNativeValues(); // Function U.U.SetNativeValues(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Button_Category; // 0x250 (8)
	struct Unknown CanvasPanel_SlotList; // 0x258 (8)
	struct Unknown Image_New; // 0x260 (8)
	struct Unknown T_CategoryName; // 0x268 (8)
	struct Unknown U_4; // 0x270 (8)
	struct Unknown U_5; // 0x278 (8)
	struct Unknown U_6; // 0x280 (8)
	struct Unknown VerticalBox_ItemList; // 0x288 (8)
	struct Unknown WidgetSwitcher_Own; // 0x290 (8)
	struct FString WeaponType; // 0x298 (16)
	char IsPressed : 0; // 0x2A8 (1)
	char IsOwn : 0; // 0x2A9 (1)
	char IsOwnAny : 0; // 0x2AA (1)
	struct Unknown ParentWidgetRef; // 0x2B0 (8)
	float SlotSize; // 0x2B8 (4)
	float CurrentListSize; // 0x2BC (4)
	struct Unknown DefaultImage; // 0x2C0 (8)
	struct Unknown HoverImage; // 0x2C8 (8)
	struct Unknown PressedDefaultImage; // 0x2D0 (8)
	struct Unknown PressedHoverImage; // 0x2D8 (8)

	void SetNew(); // Function U.U.SetNew(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetButtonImage(); // Function U.U.SetButtonImage(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckSlotAnim(); // Function U.U.CheckSlotAnim(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckOwn(char& OutIsOwn, char& IsOwnAny); // Function U.U.CheckOwn(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AddCraftingWeapon(struct Unknown& CraftingID); // Function U.U.AddCraftingWeapon(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void InitCategoryInfo(struct Unknown& CraftingInfo, struct Unknown ParentWidgetRef); // Function U.U.InitCategoryInfo(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Category_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Category_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CloseList(); // Function U.U.CloseList(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OpenList(); // Function U.U.OpenList(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Category_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Category_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Image_94; // 0x250 (8)
	struct Unknown Image_224; // 0x258 (8)
	struct Unknown RichTextBlock_321; // 0x260 (8)
	struct Unknown InventoryRef; // 0x268 (8)

	struct Unknown OnMouseButtonDown_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonDown_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideInfo(); // Function U.U.HideInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowInfo(struct Unknown InvenRef); // Function U.U.ShowInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function U.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ForceCloseInfo(); // Function U.U.ForceCloseInfo(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Character_BG_Motion; // 0x250 (8)
	struct Unknown Image_308; // 0x258 (8)
	struct Unknown ScrollBox_KeepedList; // 0x260 (8)
	struct Unknown SizeBox_KeepedList; // 0x268 (8)
	struct Unknown PlayerController; // 0x270 (8)
	float SlotMaxHeight; // 0x278 (4)

	void UpdateSlotMaxSize(int32_t SlotNum); // Function U.U.UpdateSlotMaxSize(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DisableCarriedListHover(); // Function U.U.DisableCarriedListHover(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	char DropItem(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.DropItem(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetInventoryComponent(char& Result, struct Unknown& InventoryComponentRef); // Function U.U.GetInventoryComponent(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Reset(); // Function U.U.Reset(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverEquipSlotList(enum class Unknow WearableItemType); // Function U.U.HoverEquipSlotList(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverResetEquipSlotList(); // Function U.U.HoverResetEquipSlotList(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	char OnDrop(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.OnDrop(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnDragEnter(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.OnDragEnter(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnDragLeave(struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.OnDragLeave(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown ShowAnim; // 0x248 (8)
	struct Unknown U; // 0x250 (8)
	struct Unknown WidgetSwitcher_53; // 0x258 (8)
	int32_t Gold; // 0x260 (4)
	struct TArray<Unknown> WeaponList; // 0x268 (16)
	struct TArray<Unknown> MaterialList; // 0x278 (16)
	struct TArray<Unknown> ItemWeaponIDList; // 0x288 (16)
	struct TArray<Unknown> LastItemWeaponIDList; // 0x298 (16)
	struct TArray<Unknown> New; // 0x2A8 (16)
	struct TArray<Unknown> MaterialIDList; // 0x2B8 (16)
	struct TArray<Unknown> LastMaterialIDList; // 0x2C8 (16)
	struct TArray<Unknown> NewMaterialList; // 0x2D8 (16)
	struct TArray<Unknown> NewCraftIDList; // 0x2E8 (16)
	struct Unknown CraftWeaponInfo; // 0x2F8 (192)
	struct FString MainTabName; // 0x3B8 (16)
	struct FString ArmoryTabName; // 0x3C8 (16)
	char bNeedCheckWeaponList : 0; // 0x3D8 (1)
	char bNeedCheckMaterialList : 0; // 0x3D9 (1)

	void NotifyNewItemToCoh(); // Function U.U.NotifyNewItemToCoh(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RemoveNewCraftingList(struct FName ID); // Function U.U.RemoveNewCraftingList(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateNewCraftingSlots(); // Function U.U.UpdateNewCraftingSlots(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateNewMaterialList(); // Function U.U.UpdateNewMaterialList(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateNewWeaponList(); // Function U.U.UpdateNewWeaponList(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CreateCraftWeaponPerkPopup(); // Function U.U.CreateCraftWeaponPerkPopup(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EndCraft(); // Function U.U.EndCraft(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartCraft(struct Unknown& CraftWeapon); // Function U.U.StartCraft(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetOwnWeaponCount(int32_t BaseWeaponID, int32_t& Count); // Function U.U.GetOwnWeaponCount(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetOwnItemCount(int32_t ItemId, int32_t& Count); // Function U.U.GetOwnItemCount(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckOwnWeapon(int32_t BaseWeaponID, char& IsOwn); // Function U.U.CheckOwnWeapon(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckOwnItems(struct TArray<Unknown>& ItemId, char& AllOwn, int32_t& OwnCount); // Function U.U.CheckOwnItems(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangedMaterialList(struct TArray<Unknown>& MaterialList); // Function U.U.OnChangedMaterialList(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangedWeaponList(struct TArray<Unknown>& WeaponList); // Function U.U.OnChangedWeaponList(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangedGold(int32_t Gold); // Function U.U.OnChangedGold(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangedArmoryTab(struct FString TabName); // Function U.U.OnChangedArmoryTab(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangedMainTab(struct FString TabName); // Function U.U.OnChangedMainTab(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UU {

public:

	struct Unknown UberGraphFrame; // 0x3D8 (8)
	struct Unknown BT; // 0x3E0 (8)
	struct Unknown BT; // 0x3E8 (8)
	struct Unknown BT; // 0x3F0 (8)
	struct Unknown BT; // 0x3F8 (8)
	struct Unknown BT; // 0x400 (8)
	struct Unknown C; // 0x408 (8)
	struct Unknown IM; // 0x410 (8)
	struct Unknown IM; // 0x418 (8)
	struct Unknown IM; // 0x420 (8)
	struct Unknown IM; // 0x428 (8)
	struct Unknown IM; // 0x430 (8)
	struct Unknown IM; // 0x438 (8)
	struct Unknown Menu02; // 0x440 (8)
	struct Unknown Menu03; // 0x448 (8)
	struct Unknown Menu04; // 0x450 (8)
	struct Unknown Menu05; // 0x458 (8)
	struct Unknown Menu06; // 0x460 (8)
	struct Unknown Overlay_Mask; // 0x468 (8)
	struct Unknown TX; // 0x470 (8)
	struct Unknown TX; // 0x478 (8)
	struct Unknown TX; // 0x480 (8)
	struct Unknown TX; // 0x488 (8)
	struct Unknown TX; // 0x490 (8)
	struct Unknown TX; // 0x498 (8)
	struct Unknown TX; // 0x4A0 (8)
	struct Unknown TX; // 0x4A8 (8)
	struct Unknown TX; // 0x4B0 (8)
	struct Unknown TX; // 0x4B8 (8)
	struct Unknown TX; // 0x4C0 (8)

	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetIconTexture(struct Unknown IconTexture); // Function U.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_F6A17E404AD1BD4EA73593A8AF9F47DF(struct Unknown Loaded); // Function U.U.OnLoaded_F6A17E404AD1BD4EA73593A8AF9F47DF(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function U.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AysncLoading(struct Unknown IconTexture); // Function U.U.AysncLoading(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SwitchMenu(); // Function U.U.SwitchMenu(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SwitchSlot(); // Function U.U.SwitchSlot(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Button_Crapting_Btn; // 0x250 (8)
	struct Unknown Button_Crapting_Btn_dis; // 0x258 (8)
	struct Unknown Image_112; // 0x260 (8)
	struct Unknown Img_Gold; // 0x268 (8)
	struct Unknown Img_Gold_Inert; // 0x270 (8)
	struct Unknown Img_Gold_Inert_2; // 0x278 (8)
	struct Unknown RichTextBlock_578; // 0x280 (8)
	struct Unknown T_GoldCost; // 0x288 (8)
	struct Unknown T_GoldCost_2; // 0x290 (8)
	struct Unknown U; // 0x298 (8)
	struct Unknown U; // 0x2A0 (8)
	struct Unknown U; // 0x2A8 (8)
	struct Unknown U; // 0x2B0 (8)
	struct Unknown U; // 0x2B8 (8)
	struct Unknown WidgetSwitcher_179; // 0x2C0 (8)
	struct Unknown WidgetSwitcher_Gold; // 0x2C8 (8)
	struct Unknown CraftingInfo; // 0x2D0 (296)
	struct Unknown SelectedButton; // 0x3F8 (8)

	void GetCraftingWeaponRarity(int32_t& OutRarity); // Function U.U.GetCraftingWeaponRarity(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangedArmoryTab(); // Function U.U.OnChangedArmoryTab(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetButtonEnabled(); // Function U.U.SetButtonEnabled(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckOwn(); // Function U.U.CheckOwn(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCraftingInfo(struct Unknown ButtonRef); // Function U.U.SetCraftingInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Crapting_Btn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Crapting_Btn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RequestCraftWeapon(int32_t WeaponIndex, struct FString ItemId); // Function U.U.RequestCraftWeapon(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Crapting_Btn_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Crapting_Btn_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SelectCancel(); // Function U.U.SelectCancel(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown ADS_Pannel; // 0x250 (8)
	struct Unknown ADSZoom; // 0x258 (8)
	struct Unknown CanvasPanel_Main; // 0x260 (8)
	struct Unknown Descent; // 0x268 (8)
	struct Unknown Descent_Pannel; // 0x270 (8)
	struct Unknown Drive; // 0x278 (8)
	struct Unknown Drive_Pannel; // 0x280 (8)
	struct Unknown Key_ADSZeroingM; // 0x288 (8)
	struct Unknown Key_ADSZeroingP; // 0x290 (8)
	struct Unknown Key_ADSZoomIn; // 0x298 (8)
	struct Unknown Key_ADSZoomOut; // 0x2A0 (8)
	struct Unknown Ladder; // 0x2A8 (8)
	struct Unknown Ladder_Pannel; // 0x2B0 (8)
	struct Unknown Parachuting; // 0x2B8 (8)
	struct Unknown Parachuting_Pannel; // 0x2C0 (8)
	struct Unknown SmartPing; // 0x2C8 (8)
	struct Unknown SmartPing_Pannel; // 0x2D0 (8)
	struct Unknown Spectate; // 0x2D8 (8)
	struct Unknown Spectate_Pannel; // 0x2E0 (8)
	struct Unknown Swim; // 0x2E8 (8)
	struct Unknown Swim_Pannel; // 0x2F0 (8)
	struct Unknown T_ADSZeroingM; // 0x2F8 (8)
	struct Unknown T_ADSZeroingP; // 0x300 (8)
	struct Unknown T_ADSZoomIn; // 0x308 (8)
	struct Unknown T_ADSZoomOut; // 0x310 (8)
	struct Unknown UseItem; // 0x318 (8)
	struct Unknown UseItem_Pannel; // 0x320 (8)
	struct Unknown WidgetSwitcher_Guide; // 0x328 (8)
	struct Unknown WorldMap; // 0x330 (8)
	struct Unknown WorldMap_Always; // 0x338 (8)
	struct Unknown WorldMap_Pannel; // 0x340 (8)

	void UpdateWorldMapGuideOpacity(int32_t PreZoomLevel, int32_t NewZoomLevel); // Function U.U.UpdateWorldMapGuideOpacity(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckMainVisibility(); // Function U.U.CheckMainVisibility(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RefreshKeys(); // Function U.U.RefreshKeys(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckADSMode(); // Function U.U.CheckADSMode(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateVisibleSpectateWidget(); // Function U.U.UpdateVisibleSpectateWidget(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetGuideMode(struct FText Message); // Function U.U.SetGuideMode(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetVisibilityByUserSettings(); // Function U.U.SetVisibilityByUserSettings(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangedPlayerInfosDelegate_Event_1(); // Function U.U.OnChangedPlayerInfosDelegate_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function U.U.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnGameUserSettingsApply_Key_Event_1(struct TArray<Unknown>& List); // Function U.U.OnGameUserSettingsApply_Key_Event_1(HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangeWorldMapZoomLevelDeleg_1(int32_t PreZoomLevel, int32_t NewZoomLevel); // Function U.U.OnChangeWorldMapZoomLevelDeleg_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelSightInfoWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Canvas_Charge; // 0x250 (8)
	struct Unknown ChargeIndicator; // 0x258 (8)
	struct Unknown Image_LeanDamageBg; // 0x260 (8)
	struct Unknown IMG_Gauge1; // 0x268 (8)
	struct Unknown IMG_Gauge2; // 0x270 (8)
	struct Unknown IMG_Gauge3; // 0x278 (8)
	struct Unknown IMG_Gauge4; // 0x280 (8)
	struct Unknown IMG_Gauge5; // 0x288 (8)
	struct Unknown IMG_Gauge6; // 0x290 (8)
	struct Unknown LeftTime; // 0x298 (8)
	struct Unknown Overlay_Gauge; // 0x2A0 (8)
	struct Unknown T_BulletsPerShot; // 0x2A8 (8)
	struct Unknown T_Damage; // 0x2B0 (8)
	struct Unknown T_RPM; // 0x2B8 (8)
	struct Unknown VerticalBox_Damage; // 0x2C0 (8)
	struct Unknown BravoHotelCharacter; // 0x2C8 (8)
	struct TArray<Unknown> GaugeIMGArray; // 0x2D0 (16)
	int32_t LastGauge; // 0x2E0 (4)
	char Timer_ : 0; // 0x2E4 (1)
	struct Unknown Timer_UpdateInfos; // 0x2E8 (8)
	struct Unknown ChargeIndicatorDynamicMaterial; // 0x2F0 (8)

	void HideChargeInfo(); // Function U.U.HideChargeInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateChargeInfo(float MaxGaugeValue, float CurrentGaugeValue); // Function U.U.UpdateChargeInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateBulletsPerShot(); // Function U.U.UpdateBulletsPerShot(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateSnipeGauge(); // Function U.U.UpdateSnipeGauge(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateDamage(); // Function U.U.UpdateDamage(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateInfos(); // Function U.U.UpdateInfos(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideSightInfo(); // Function U.U.HideSightInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowSightInfo(); // Function U.U.ShowSightInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Init(); // Function U.U.Init(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelReplayPlayerListGroup {

public:

	struct Unknown UberGraphFrame; // 0x260 (8)
	struct Unknown Img_TeamColor; // 0x268 (8)
	struct Unknown T_TeamNum; // 0x270 (8)
	struct Unknown VB_PlayerList; // 0x278 (8)

	void CheckEmptyGroup(); // Function U.U.CheckEmptyGroup(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetTeamColor(); // Function U.U.SetTeamColor(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetTeamNumText(); // Function U.U.SetTeamNumText(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Init(struct Unknown PlayerState); // Function U.U.Init(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdatePlayerInfo(enum class Unknow PlayerListSortType); // Function U.U.UpdatePlayerInfo(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelTeamInfoWidget {

public:

	struct Unknown UberGraphFrame; // 0x258 (8)
	struct Unknown U; // 0x260 (8)
	struct Unknown U_2; // 0x268 (8)
	struct Unknown VerticalBox_InfoList; // 0x270 (8)

	struct Unknown CreateSlot(); // Function U.U.CreateSlot(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateInvalidationbox(); // Function U.U.UpdateInvalidationbox(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown Image_81; // 0x248 (8)
	struct Unknown Image_86; // 0x250 (8)
	struct Unknown Image_88; // 0x258 (8)
	struct Unknown Image_89; // 0x260 (8)
	struct Unknown Image_90; // 0x268 (8)
	struct Unknown Image_91; // 0x270 (8)
	struct Unknown Image_92; // 0x278 (8)
	struct Unknown Image_93; // 0x280 (8)
	struct Unknown Image_94; // 0x288 (8)
	struct Unknown Image_95; // 0x290 (8)
	struct Unknown Image_96; // 0x298 (8)
	struct Unknown Image_97; // 0x2A0 (8)
	struct Unknown Image_98; // 0x2A8 (8)
	struct Unknown Image_99; // 0x2B0 (8)
	struct Unknown Image_100; // 0x2B8 (8)
	struct Unknown Image_101; // 0x2C0 (8)
	struct Unknown Image_102; // 0x2C8 (8)
	struct Unknown Image_103; // 0x2D0 (8)
	struct Unknown Image_104; // 0x2D8 (8)
	struct Unknown Image_107; // 0x2E0 (8)
	struct Unknown Image_108; // 0x2E8 (8)
	struct Unknown Image_119; // 0x2F0 (8)
	struct Unknown Image_120; // 0x2F8 (8)
	struct Unknown Image_121; // 0x300 (8)
	struct Unknown Image_122; // 0x308 (8)
	struct Unknown Image_123; // 0x310 (8)
	struct Unknown Image_134; // 0x318 (8)
	struct Unknown Image_137; // 0x320 (8)
	struct Unknown Image_138; // 0x328 (8)
	struct Unknown Image_139; // 0x330 (8)
	struct Unknown Image_140; // 0x338 (8)
	struct Unknown Image_141; // 0x340 (8)
	struct Unknown Image_142; // 0x348 (8)
	struct Unknown Image_143; // 0x350 (8)
	struct Unknown Image_144; // 0x358 (8)
	struct Unknown Image_145; // 0x360 (8)
	struct Unknown Image_146; // 0x368 (8)
	struct Unknown Image_147; // 0x370 (8)
	struct Unknown Image_148; // 0x378 (8)
	struct Unknown Image_149; // 0x380 (8)
	struct Unknown Image_152; // 0x388 (8)
	struct Unknown Image_153; // 0x390 (8)
	struct Unknown Image_154; // 0x398 (8)
	struct Unknown Image_155; // 0x3A0 (8)
	struct Unknown Image_156; // 0x3A8 (8)
	struct Unknown Image_157; // 0x3B0 (8)
	struct Unknown Image_158; // 0x3B8 (8)
	struct Unknown Image_159; // 0x3C0 (8)
	struct Unknown Image_160; // 0x3C8 (8)
	struct Unknown Image_161; // 0x3D0 (8)
	struct Unknown Image_162; // 0x3D8 (8)
	struct Unknown Image_163; // 0x3E0 (8)
	struct Unknown Image_164; // 0x3E8 (8)
	struct Unknown WidgetSwitcher_1; // 0x3F0 (8)
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Button_Main; // 0x250 (8)
	struct Unknown Image_ClassIcon; // 0x258 (8)
	struct Unknown Image_ComingSoonBg; // 0x260 (8)
	struct Unknown Image_Disabled; // 0x268 (8)
	struct Unknown Image_Outline; // 0x270 (8)
	struct Unknown Image_Push; // 0x278 (8)
	struct Unknown Overlay_Main; // 0x280 (8)
	struct Unknown T_ComingSoon; // 0x288 (8)
	struct Unknown U; // 0x290 (8)
	struct Unknown U_2; // 0x298 (8)
	struct Unknown U_3; // 0x2A0 (8)
	struct Unknown U; // 0x2A8 (8)
	struct Unknown VerticalBox_Selected; // 0x2B0 (8)
	struct Unknown PerkDeckClassInfo; // 0x2B8 (40)
	int32_t SelectedNum; // 0x2E0 (4)
	int32_t SelectedMinIndex; // 0x2E4 (4)
	struct FMulticastInlineDelegate ChooseClass; // 0x2E8 (16)
	int32_t ClassIndex; // 0x2F8 (4)
	struct FMulticastInlineDelegate HoverClass; // 0x300 (16)
	char bIsLocalSelected : 0; // 0x310 (1)
	char bIsSelected : 0; // 0x311 (1)
	struct Unknown CurrentPerkDeckData; // 0x318 (1200)
	char bIsDuplicateSelectPossible : 0; // 0x7C8 (1)
	char bButtonDisabled : 0; // 0x7C9 (1)
	char bNoUpdatedDisabled : 0; // 0x7CA (1)
	char bIsBlocked : 0; // 0x7CB (1)

	void SetBlocked(char IsBlocked, char ComingSoon); // Function U.U.SetBlocked(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DisableWithoutSelected(); // Function U.U.DisableWithoutSelected(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateButtonDisabled(); // Function U.U.UpdateButtonDisabled(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateOutLine(); // Function U.U.UpdateOutLine(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetSelectedInfo(struct Unknown& PlayerState); // Function U.U.SetSelectedInfo(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetSelected(); // Function U.U.ResetSelected(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkDeckClassInfoByRowName(struct FName RowName); // Function U.U.SetPerkDeckClassInfoByRowName(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkDeckClassInfo(struct Unknown& PerkDeckClassInfo, int32_t ClassIndex); // Function U.U.SetPerkDeckClassInfo(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_4ECB692A48B41C9343CA15BDA4F3DA1C(struct Unknown Loaded); // Function U.U.OnLoaded_4ECB692A48B41C9343CA15BDA4F3DA1C(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_101_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_101_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_101_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_101_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Main_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Main_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadingClassSelectIcon(struct Unknown Texture); // Function U.U.AsyncLoadingClassSelectIcon(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverClass__DelegateSignature(int32_t ClassIndex, char IsHoverd); // Function U.U.HoverClass__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ChooseClass__DelegateSignature(int32_t ClassIndex); // Function U.U.ChooseClass__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown Image_2; // 0x248 (8)
	struct Unknown InvalidationBox_1; // 0x250 (8)
	struct Unknown Switcher; // 0x258 (8)
	float OwnDirection; // 0x260 (4)

	void Initialize(float Direction); // Function U.U.Initialize(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown U; // 0x250 (8)
	struct Unknown U_2; // 0x258 (8)
	struct Unknown U_3; // 0x260 (8)
	struct Unknown U_4; // 0x268 (8)
	struct Unknown VerticalBox_OptionList; // 0x270 (8)

	void AddOptionList(struct Unknown& ItemOption); // Function U.U.AddOptionList(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetOptionList(struct TArray<Unknown>& OptionIDList); // Function U.U.SetOptionList(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelReplayPlayerListWidg {

public:

	struct Unknown UberGraphFrame; // 0x2E0 (8)
	struct Unknown Bt_ListNext; // 0x2E8 (8)
	struct Unknown BT_ListPrev; // 0x2F0 (8)
	struct Unknown ScrollBox_PlayerItem; // 0x2F8 (8)
	struct Unknown T_SortType; // 0x300 (8)
	struct Unknown VB_ListMain; // 0x308 (8)

	struct Unknown CreatePlayerListGroup(struct Unknown PlayerState); // Function U.U.CreatePlayerListGroup(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetSortTypeText(); // Function U.U.SetSortTypeText(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown CreatePlayerButton(struct Unknown PlayerState); // Function U.U.CreatePlayerButton(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT_ListPrevWidget_(); // Function U.U.BndEvt__BT_ListPrevWidget_(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Bt_ListNext_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Bt_ListNext_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UU {

public:

	struct Unknown UberGraphFrame; // 0x268 (8)
	struct Unknown SeatIcons; // 0x270 (8)
	struct Unknown WheelIcons; // 0x278 (8)

	void Setup(struct Unknown VehicleInstance); // Function U.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelRoutePingWidget {

public:

	struct Unknown Anim_OnShow; // 0x248 (8)
	struct Unknown BackColor; // 0x250 (8)
	struct Unknown T_Num; // 0x258 (8)
	struct FMulticastInlineDelegate OnMarkerClicked; // 0x260 (16)

	void SetPointAngle(float Angle); // Function U.U.SetPointAngle(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SelectPointIcon(int32_t Index, char IsLastPoint, char IsUpdate); // Function U.U.SelectPointIcon(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetTeamColor(struct Unknown LinearColor); // Function U.U.SetTeamColor(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMarkerClicked__DelegateSignature(struct Unknown Button, char mapObjectID); // Function U.U.OnMarkerClicked__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Ellipsis_M; // 0x250 (8)
	struct Unknown CanvasPanel_123; // 0x258 (8)
	struct Unknown Enhancing; // 0x260 (8)
	struct Unknown Image_305; // 0x268 (8)
	struct Unknown Image_841; // 0x270 (8)
	struct Unknown InputEventBox; // 0x278 (8)
	struct Unknown Skip; // 0x280 (8)
	struct Unknown TextBlock_335; // 0x288 (8)
	struct Unknown TextBlock_336; // 0x290 (8)
	struct Unknown TextBlock_337; // 0x298 (8)
	struct Unknown TextBlock_362; // 0x2A0 (8)
	struct Unknown TextEnhanceing; // 0x2A8 (8)
	struct Unknown U; // 0x2B0 (8)
	struct Unknown U; // 0x2B8 (8)
	struct Unknown EnhanceResultTimerHandle; // 0x2C0 (8)

	void Craft(); // Function U.U.Craft(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Result(); // Function U.U.Result(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetInputEventBox(char Visible); // Function U.U.SetInputEventBox(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StopProceedingSound(); // Function U.U.StopProceedingSound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayProceedingSound(); // Function U.U.PlayProceedingSound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetLobbyWidget(struct Unknown& Widget); // Function U.U.GetLobbyWidget(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Proceeding(); // Function U.U.Proceeding(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowArmoryUI(struct FString ArmoryResultName); // Function U.U.ShowArmoryUI(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Skip_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Skip_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Skip_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Skip_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EnhanceResult(); // Function U.U.EnhanceResult(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent_1(); // Function U.U.CustomEvent_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetTimerCraftResult(); // Function U.U.SetTimerCraftResult(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnCraftResult(); // Function U.U.OnCraftResult(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown Ani_Complete; // 0x248 (8)
	struct Unknown Ani_BG; // 0x250 (8)
	struct Unknown Bg; // 0x258 (8)
	struct Unknown Complete; // 0x260 (8)
	struct Unknown TextBlock_QuestDesc; // 0x268 (8)
	struct Unknown TextBlock_QuestTitle; // 0x270 (8)
	struct Unknown U; // 0x278 (8)
	struct Unknown U; // 0x280 (8)
	struct Unknown U_2; // 0x288 (8)
	struct Unknown U_3; // 0x290 (8)
	struct Unknown TaskInfo; // 0x298 (32)
	struct Unknown TaskData; // 0x2B8 (176)

	void SetTaskInfo(struct Unknown TaskInfo); // Function U.U.SetTaskInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown Image_112; // 0x248 (8)
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelConversationWidget {

public:

	struct Unknown UberGraphFrame; // 0x258 (8)
	struct Unknown First; // 0x260 (8)
	struct Unknown Hide; // 0x268 (8)
	struct Unknown Show; // 0x270 (8)
	struct Unknown Idle; // 0x278 (8)
	struct Unknown Bg; // 0x280 (8)
	struct Unknown Bg_2; // 0x288 (8)
	struct Unknown Bg_3; // 0x290 (8)
	struct Unknown Button_407; // 0x298 (8)
	struct Unknown Image; // 0x2A0 (8)
	struct Unknown Image_2; // 0x2A8 (8)
	struct Unknown Image_55; // 0x2B0 (8)
	struct Unknown Image_340; // 0x2B8 (8)
	struct Unknown Overlay_Base; // 0x2C0 (8)
	struct Unknown TextBlock_Message; // 0x2C8 (8)
	struct Unknown TextBlock_SpeakerName; // 0x2D0 (8)
	struct Unknown U; // 0x2D8 (8)
	struct Unknown WidgetSwitcher_Face; // 0x2E0 (8)
	struct Unknown SentenceData; // 0x2E8 (176)

	void Finished_F3AEE8B3477DC5B8B5A3EA8301B8E940(); // Function U.U.Finished_F3AEE8B3477DC5B8B5A3EA8301B8E940(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowSentense(struct Unknown& SentenceData); // Function U.U.ShowSentense(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideSentense(); // Function U.U.HideSentense(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_406_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_406_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelKillInfoSlotWidget {

public:

	struct Unknown UberGraphFrame; // 0x258 (8)
	struct Unknown Anim_Hide; // 0x260 (8)
	struct Unknown Anim_Down; // 0x268 (8)
	struct Unknown CanvasPanel_Main; // 0x270 (8)
	struct Unknown Img_Back; // 0x278 (8)
	struct Unknown Img_BroadType; // 0x280 (8)
	struct Unknown Img_DamegeType; // 0x288 (8)
	struct Unknown Img_Weapon; // 0x290 (8)
	struct Unknown ScaleBox_Weapon; // 0x298 (8)
	struct Unknown SizeBox_BroadType; // 0x2A0 (8)
	struct Unknown SizeBox_DamageType; // 0x2A8 (8)
	struct Unknown SizeBox_HeadShot; // 0x2B0 (8)
	struct Unknown T_Context; // 0x2B8 (8)
	struct Unknown U; // 0x2C0 (8)
	struct Unknown U; // 0x2C8 (8)
	struct FMulticastInlineDelegate OnTimeOut; // 0x2D0 (16)
	struct TMap<Unknown, Unknown> BroadcastDamageType; // 0x2E0 (80)
	struct Unknown MyTeamColor; // 0x330 (40)
	struct Unknown MyTeamKnockOutColor; // 0x358 (40)
	struct Unknown EnermyTeamColor; // 0x380 (40)
	struct Unknown EnermyTeamKnockOutColor; // 0x3A8 (40)
	struct Unknown DefaultColor; // 0x3D0 (40)
	struct Unknown DefaultKnockColor; // 0x3F8 (40)
	struct Unknown ResuscatedColor; // 0x420 (40)
	struct Unknown ParentWidgetRef; // 0x448 (8)
	struct Unknown Timer_StartHideAnim; // 0x450 (8)
	struct Unknown CurrentInfoColor; // 0x458 (40)

	void ResetInfos(); // Function U.U.ResetInfos(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetBroadcastTypeIcon(enum class Unknow MessageType); // Function U.U.SetBroadcastTypeIcon(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetTeamType(struct Unknown PlayerState, enum class Unknow& TeamType); // Function U.U.GetTeamType(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetInfoColor(struct Unknown Killer, struct Unknown Died, enum class Unknow MessageType, struct Unknown& OutTeamColor); // Function U.U.GetInfoColor(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetBGColor(enum class Unknow MessageType); // Function U.U.SetBGColor(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayDownAnim(); // Function U.U.PlayDownAnim(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartHideAnim(); // Function U.U.StartHideAnim(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartShow(); // Function U.U.StartShow(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_E905D98740C8E2F4A90B4C89D663ACAA(struct Unknown Loaded); // Function U.U.OnLoaded_E905D98740C8E2F4A90B4C89D663ACAA(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_342F68DF4CB26590AC0C9EA8C343CCF1(struct Unknown Loaded); // Function U.U.OnLoaded_342F68DF4CB26590AC0C9EA8C343CCF1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetKillMessageInfo(struct Unknown& Info); // Function U.U.SetKillMessageInfo(HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnTimeOut__DelegateSignature(int32_t ArrayIndex, struct Unknown Slot); // Function U.U.OnTimeOut__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Bg; // 0x250 (8)
	struct Unknown btn_Cancel; // 0x258 (8)
	struct Unknown btn_OK; // 0x260 (8)
	struct Unknown Image_2; // 0x268 (8)

	void Hide(); // Function U.U.Hide(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Show(); // Function U.U.Show(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_Cancel_K2Node_ComponentBoundEvent_35_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__btn_Cancel_K2Node_ComponentBoundEvent_35_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_OK_K2Node_ComponentBoundEvent_52_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__btn_OK_K2Node_ComponentBoundEvent_52_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_OK_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__btn_OK_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_Cancel_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignatu(); // Function U.U.BndEvt__btn_Cancel_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignatu(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelGamePopupWidget {

public:

	struct Unknown UberGraphFrame; // 0x250 (8)
	struct Unknown Btn; // 0x258 (8)
	struct Unknown BT; // 0x260 (8)
	struct Unknown BT; // 0x268 (8)
	struct Unknown BT; // 0x270 (8)
	struct Unknown Button_1; // 0x278 (8)
	struct Unknown Button_2; // 0x280 (8)
	struct Unknown Button_4; // 0x288 (8)
	struct Unknown Image_2; // 0x290 (8)
	struct Unknown IM; // 0x298 (8)
	struct Unknown Overlay_Exit; // 0x2A0 (8)
	struct Unknown TextBlock_2; // 0x2A8 (8)
	struct Unknown U; // 0x2B0 (8)
	struct Unknown VerticalBox_InGame; // 0x2B8 (8)
	struct Unknown VerticalBox_Lobby; // 0x2C0 (8)
	struct FName MapNameToExit; // 0x2C8 (8)
	char IsLobby : 0; // 0x2D0 (1)

	struct Unknown OnMouseButtonDown(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnMouseWheel(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseWheel(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Show(); // Function U.U.Show(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Hide(); // Function U.U.Hide(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_1_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_1_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_1_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_1_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_3_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_3_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_3_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_3_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function U.U.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Ani_Countdown; // 0x250 (8)
	struct Unknown TextBlock_RemailTime; // 0x258 (8)
	int32_t PreTime; // 0x260 (4)
	char ActiveTimer : 0; // 0x264 (1)
	int32_t RemainTime; // 0x268 (4)

	struct FText Get_TextBlock_RemailTime_Text_1(); // Function U.U.Get_TextBlock_RemailTime_Text_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetVisibileState(enum class Unknow CurrentState); // Function U.U.SetVisibileState(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (enum class Unknow PrevState, enum class Unknow CurrentState); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetTimer(int32_t RemainTime); // Function U.U.SetTimer(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (int32_t RemainTime); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Button_ItemSlotHover_4; // 0x250 (8)
	struct Unknown U_4; // 0x258 (8)
	struct Unknown ItemWeaponInfo; // 0x260 (136)
	struct Unknown ParentWidget; // 0x2E8 (8)

	void SetButtonEnabled(char InIsEnabled); // Function U.U.SetButtonEnabled(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Set(struct Unknown& ItemWeaponInfo, struct Unknown ParentWidget); // Function U.U.Set(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_ItemSlotHover_3_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_ItemSlotHover_3_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetButton(); // Function U.U.ResetButton(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SelectButton(); // Function U.U.SelectButton(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UU {

public:

	struct Unknown UberGraphFrame; // 0x3D8 (8)
	struct Unknown BT; // 0x3E0 (8)
	struct Unknown C; // 0x3E8 (8)
	struct Unknown IM; // 0x3F0 (8)
	struct Unknown IM; // 0x3F8 (8)
	struct Unknown IM; // 0x400 (8)
	struct Unknown IM; // 0x408 (8)
	struct Unknown IM; // 0x410 (8)
	struct Unknown IM; // 0x418 (8)
	struct Unknown Menu02; // 0x420 (8)
	struct Unknown Overlay_Mask; // 0x428 (8)
	struct Unknown TX; // 0x430 (8)
	struct Unknown TX; // 0x438 (8)
	struct Unknown TX; // 0x440 (8)

	void SetSlotInfo(struct Unknown BlackmarketDataInfo); // Function U.U.SetSlotInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnClick(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnClick(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetIconTexture(struct Unknown IconTexture); // Function U.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_7C34C7D64FB053FED5EAACB72A3EAAD0(struct Unknown Loaded); // Function U.U.OnLoaded_7C34C7D64FB053FED5EAACB72A3EAAD0(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function U.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AysncLoading(struct Unknown IconTexture); // Function U.U.AysncLoading(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SwitchMenu(); // Function U.U.SwitchMenu(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SwitchSlot(); // Function U.U.SwitchSlot(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown HorizontalBox_Next; // 0x250 (8)
	struct Unknown ProgressBar_Current; // 0x258 (8)
	struct Unknown ProgressBar_Down; // 0x260 (8)
	struct Unknown ProgressBar_Up; // 0x268 (8)
	struct Unknown TextBlock_Current; // 0x270 (8)
	struct Unknown TextBlock_Max; // 0x278 (8)
	struct Unknown TextBlock_Next; // 0x280 (8)
	char EnableUpdate : 0; // 0x288 (1)
	float CurTime; // 0x28C (4)
	float ShowTime; // 0x290 (4)
	float EndPoint; // 0x294 (4)
	float ChangeValue; // 0x298 (4)
	float StartPoint; // 0x29C (4)
	float Min; // 0x2A0 (4)
	float MAX; // 0x2A4 (4)
	char IsUPState : 0; // 0x2A8 (1)
	struct FMulticastInlineDelegate Dispatcher_ProgressBarDone; // 0x2B0 (16)

	void SetData(float StartPoint, float EndPoint, float Min, float MAX, float ShowTime, char Play); // Function U.U.SetData(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Dispatcher_ProgressBarDone__DelegateSignature(); // Function U.U.Dispatcher_ProgressBarDone__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown IMG_PerkLevelUpFx; // 0x250 (8)
	enum class Unknow PerkSlot; // 0x258 (1)
	struct Unknown PerkFxTexture; // 0x260 (8)
	char PlayAnimation_1 : 0; // 0x268 (1)
	float CurrentAnimationTime; // 0x26C (4)
	float AnimLastTime; // 0x270 (4)
	struct Unknown PerkFxMaterialInstance; // 0x278 (8)
	struct Unknown UltimatePerkFxTexture; // 0x280 (8)

	void InitFxInfo(); // Function U.U.InitFxInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown Image; // 0x248 (8)
	struct Unknown Image_2; // 0x250 (8)
	struct Unknown Image_3; // 0x258 (8)
	struct Unknown Image_4; // 0x260 (8)
	struct Unknown Image_5; // 0x268 (8)
	struct Unknown Image_6; // 0x270 (8)
	struct Unknown Image_7; // 0x278 (8)
	struct Unknown Image_8; // 0x280 (8)
	struct Unknown Image_9; // 0x288 (8)
	struct Unknown Image_106; // 0x290 (8)
	struct Unknown T_Accuracy; // 0x298 (8)
	struct Unknown T_EffectiveRange; // 0x2A0 (8)
	struct Unknown T_FireRate; // 0x2A8 (8)
	struct Unknown T_MagSize; // 0x2B0 (8)
	struct Unknown T_Power; // 0x2B8 (8)

	void Set(struct Unknown& WeaponInfo); // Function U.U.Set(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelReplayTimelineWidget {

public:

	struct Unknown UberGraphFrame; // 0x360 (8)
	struct Unknown Bg; // 0x368 (8)
	struct Unknown Border_Timeline; // 0x370 (8)
	struct Unknown Border_TimeToGo; // 0x378 (8)
	struct Unknown BT_FreeCam; // 0x380 (8)
	struct Unknown BT_ReplayPause; // 0x388 (8)
	struct Unknown BT_ReplayResume; // 0x390 (8)
	struct Unknown BT_SpeedDown; // 0x398 (8)
	struct Unknown BT_SpeedUp; // 0x3A0 (8)
	struct Unknown BT_TimelineScaleDown; // 0x3A8 (8)
	struct Unknown BT_TimelineScaleUp; // 0x3B0 (8)
	struct Unknown Canvas_EventMarkers; // 0x3B8 (8)
	struct Unknown Chk_ShowKill; // 0x3C0 (8)
	struct Unknown Chk_ShowKnockout; // 0x3C8 (8)
	struct Unknown Chk_ShowMyKill; // 0x3D0 (8)
	struct Unknown Chk_ShowMyKnockout; // 0x3D8 (8)
	struct Unknown Chk_ShowMyResuscitated; // 0x3E0 (8)
	struct Unknown Chk_ShowResuscitated; // 0x3E8 (8)
	struct Unknown ReplayTimelineSlider; // 0x3F0 (8)
	struct Unknown ScrollBox_Timeline; // 0x3F8 (8)
	struct Unknown SizeBox_Timeline; // 0x400 (8)
	struct Unknown Slider_TimelineScale; // 0x408 (8)
	struct Unknown T_CameraType; // 0x410 (8)
	struct Unknown T_CurrentTime; // 0x418 (8)
	struct Unknown T_PlaySpeed; // 0x420 (8)
	struct Unknown T_TimeToGo; // 0x428 (8)
	struct Unknown T_TotalTime; // 0x430 (8)
	float TimelineSizeBoxOffset; // 0x438 (4)
	struct Unknown* Class_EventMarker_Kill; // 0x440 (8)
	struct Unknown* Class_EventMarker_Knockout; // 0x448 (8)
	float LastViewportSize; // 0x450 (4)
	char IsMouseOnBorder : 0; // 0x454 (1)
	struct Unknown* Class_EventMarker_Resuscitated; // 0x458 (8)
	struct Unknown* Class_EventMarker_WhenReported; // 0x460 (8)
	enum class Unknow CameraType; // 0x468 (1)
	char ViewMode; // 0x469 (1)

	void CheckCameraType(); // Function U.U.CheckCameraType(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown GetTimelineToolTipPositionBySlider(struct FString& ToolTipTime); // Function U.U.GetTimelineToolTipPositionBySlider(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetTimeToGo(); // Function U.U.SetTimeToGo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckTimeToGo(); // Function U.U.CheckTimeToGo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CalcTimelineScale(char IsUpScale); // Function U.U.CalcTimelineScale(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetTimelineToolTipText(struct FString& Text); // Function U.U.SetTimelineToolTipText(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown On_Border_Timeline_MouseLeave_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.On_Border_Timeline_MouseLeave_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetTickTime(); // Function U.U.SetTickTime(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct FText Get_T_PlaySpeed_Text_1(); // Function U.U.Get_T_PlaySpeed_Text_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown On_Border_Timeline_MouseMove_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.On_Border_Timeline_MouseMove_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown On_Border_Timeline_MouseEnter_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.On_Border_Timeline_MouseEnter_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown CreateEventMarker(enum class Unknow killType); // Function U.U.CreateEventMarker(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckChangeViewportSize(); // Function U.U.CheckChangeViewportSize(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetEventMarkersPos(enum class Unknow killType, float TotalTime); // Function U.U.SetEventMarkersPos(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetTimelineScaleBoxWidth(); // Function U.U.SetTimelineScaleBoxWidth(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Init(); // Function U.U.Init(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void TogglePauseResumeButton(char PauseResume); // Function U.U.TogglePauseResumeButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT_ReplayResume_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__BT_ReplayResume_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT_ReplayPause_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__BT_ReplayPause_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ChangeCameraTypeDelegate_Event_1(enum class Unknow CameraType, struct FString TargetPlayerName); // Function U.U.ChangeCameraTypeDelegate_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT_FreeCam_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__BT_FreeCam_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Slider_302_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature(float Value); // Function U.U.BndEvt__Slider_302_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnReplayJumpCompleteEvent_Event_1(char bSuccess); // Function U.U.OnReplayJumpCompleteEvent_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BPUpdateTimelineScale(); // Function U.U.BPUpdateTimelineScale(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT_TimelineScaleDown_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__Delegateure(); // Function U.U.BndEvt__BT_TimelineScaleDown_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__Delegate(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT_TimelineScaleUp_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__De(); // Function U.U.BndEvt__BT_TimelineScaleUp_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__De(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Chk_ShowKill_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChange(char bIsChecked); // Function U.U.BndEvt__Chk_ShowKill_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChange(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Chk_ShowKnockout_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature(char bIsChecked); // Function U.U.BndEvt__Chk_ShowKnockout_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT_SpeedDown_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__Delegate(); // Function U.U.BndEvt__BT_SpeedDown_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__Delegate(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT_SpeedUp_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__BT_SpeedUp_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ScrollBox_Timeline_K2Node_ComponentBoundEvent_11_OnUserScrolledEvent__De(float CurrentOffset); // Function U.U.BndEvt__ScrollBox_Timeline_K2Node_ComponentBoundEvent_11_OnUserScrolledEvent__De(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BPUpdateKillEventMarkersPos(enum class Unknow killType, float TotalTime); // Function U.U.BPUpdateKillEventMarkersPos(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnReplayPauseEvent_Event_1(char bPaused); // Function U.U.OnReplayPauseEvent_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ReplayTimelineSlider_K2Node_ComponentBoundEvent_12_OnMouseCaptureEndEvent__DelegateSignature(); // Function U.U.BndEvt__ReplayTimelineSlider_K2Node_ComponentBoundEvent_12_OnMouseCaptureEndEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Chk_ShowMyKill_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__De(char bIsChecked); // Function U.U.BndEvt__Chk_ShowMyKill_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__De(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Chk_ShowMyKnockout_K2Node_ComponentBoundEvent_16_OnCheckBoxComponentStateChanged__DelegateSignature(char bIsChecked); // Function U.U.BndEvt__Chk_ShowMyKnockout_K2Node_ComponentBoundEvent_16_OnCheckBoxComponentStateChanged__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Chk_ShowMyResuscitated_K2Node_ComponentBoundEvent_17_OnCheckBoxComponentStateChanged__De(char bIsChecked); // Function U.U.BndEvt__Chk_ShowMyResuscitated_K2Node_ComponentBoundEvent_17_OnCheckBoxComponentStateChanged__De(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Chk_ShowResuscitated_K2Node_ComponentBoundEvent_18_OnCheckBoxComponentStateChanged__Dele(char bIsChecked); // Function U.U.BndEvt__Chk_ShowResuscitated_K2Node_ComponentBoundEvent_18_OnCheckBoxComponentStateChanged__Dele(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ChangeViewModeDelegate_Event_1(char ViewMode); // Function U.U.ChangeViewModeDelegate_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelGameBuffSlot {

public:

	struct Unknown UberGraphFrame; // 0x2F8 (8)
	struct Unknown Anim_Boost_Off; // 0x300 (8)
	struct Unknown Anim_Boost_On; // 0x308 (8)
	struct Unknown CanvasPanel_BoostInfo; // 0x310 (8)
	struct Unknown Image_Active; // 0x318 (8)
	struct Unknown IMG_CoolTime; // 0x320 (8)
	struct Unknown T_CoolTime; // 0x328 (8)
	struct Unknown MI_CoolTimeDynamicInstance; // 0x330 (8)
	struct Unknown MI_BuffActive; // 0x338 (8)
	float BoostOffAnimTime; // 0x340 (4)
	char IsActive : 0; // 0x344 (1)
	struct Unknown BoostBuffInfo; // 0x348 (392)

	void SetIsActive(char bActive); // Function U.U.SetIsActive(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void InitBuffInfo(); // Function U.U.InitBuffInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateCoolTime(float Timer, float MaxTime); // Function U.U.UpdateCoolTime(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_541BBAAD4C8A218716460DAC5837CB3E(struct Unknown Loaded); // Function U.U.OnLoaded_541BBAAD4C8A218716460DAC5837CB3E(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_UpdateBuff(float Timer, float MaxTime); // Function U.U.K2_UpdateBuff(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_OnNewBuff(); // Function U.U.K2_OnNewBuff(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnAnimationFinished(struct Unknown Animation); // Function U.U.OnAnimationFinished(BlueprintCosmetic|Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_OnRenewBuff(); // Function U.U.K2_OnRenewBuff(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayAnimBoostOn(); // Function U.U.PlayAnimBoostOn(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncloadImage(struct Unknown Image); // Function U.U.AsyncloadImage(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelTopInfoWidget {

public:

	struct Unknown UberGraphFrame; // 0x278 (8)
	struct Unknown Anim_HideWidget; // 0x280 (8)
	struct Unknown Canvas; // 0x288 (8)
	struct Unknown Canvas_Minimap; // 0x290 (8)
	struct Unknown CanvasPanel_StatupFirst; // 0x298 (8)
	struct Unknown CanvasPanel_StatupThird; // 0x2A0 (8)
	struct Unknown T_GameVersion; // 0x2A8 (8)
	struct Unknown U; // 0x2B0 (8)
	struct Unknown U; // 0x2B8 (8)
	struct Unknown U; // 0x2C0 (8)
	struct Unknown U; // 0x2C8 (8)
	struct Unknown U; // 0x2D0 (8)
	struct Unknown U; // 0x2D8 (8)
	struct Unknown U; // 0x2E0 (8)
	struct Unknown U; // 0x2E8 (8)
	struct Unknown U; // 0x2F0 (8)
	struct Unknown U; // 0x2F8 (8)
	struct Unknown Vertical_MinimapAndTeamInfo; // 0x300 (8)
	struct Unknown PlayerController; // 0x308 (8)
	struct Unknown U; // 0x310 (8)
	struct Unknown MainWidget; // 0x318 (8)
	enum class Unknow CurrentState; // 0x320 (1)
	struct Unknown LastDisplayAbility; // 0x324 (12)

	void ShowStatupAnim(struct Unknown& StatupParams); // Function U.U.ShowStatupAnim(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckStatupAnim(struct Unknown& DisplayAbility); // Function U.U.CheckStatupAnim(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnShowNotRecorverHPMessage(char Type, int32_t ItemId); // Function U.U.OnShowNotRecorverHPMessage(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void On(enum class Unknow PreviousState, enum class Unknow CurrentState); // Function U.U.On(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowAmmoReloadedMessage(int32_t ReloadedAmmoCount); // Function U.U.ShowAmmoReloadedMessage(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowProgressMessage(int32_t Type, int32_t Time); // Function U.U.ShowProgressMessage(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowKillMessage(struct FText WeaponName, struct FText Victim, char HeadShot, char TeamKill); // Function U.U.ShowKillMessage(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetGameVersion(); // Function U.U.SetGameVersion(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ChangeWidgetVisibleByToggleType(enum class Unknow CurrentType); // Function U.U.ChangeWidgetVisibleByToggleType(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown GetSlotHoverWidget(); // Function U.U.GetSlotHoverWidget(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowFireModeLog(enum class Unknow Mode); // Function U.U.ShowFireModeLog(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetMainWidget(struct Unknown& MainWidget); // Function U.U.GetMainWidget(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Get(int32_t& HelmetLevel, int32_t& ArmorLevel, int32_t& BagLevel); // Function U.U.Get(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CreateHoverWidget(); // Function U.U.CreateHoverWidget(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkInfo(); // Function U.U.SetPerkInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	char OnDrop(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.OnDrop(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	int32_t GetFinalAliveCount(int32_t AliveCount); // Function U.U.GetFinalAliveCount(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function U.U.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetPerkDeck(); // Function U.U.ResetPerkDeck(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetEnergy(float energy); // Function U.U.SetEnergy(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowHealthRecovery(); // Function U.U.ShowHealthRecovery(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideHealthRecovery(); // Function U.U.HideHealthRecovery(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowEnergyRecovery(); // Function U.U.ShowEnergyRecovery(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideEnergyRecovery(); // Function U.U.HideEnergyRecovery(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetArmorInfo(char bHasHelmet, float HelmetGauge, char bHasChest, float ChestGauge, char bHasBackpack, float BackpackGauge); // Function U.U.SetArmorInfo(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetMyInfo(); // Function U.U.ResetMyInfo(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowNotRecorverHPMessage(char Type, int32_t ItemId); // Function U.U.ShowNotRecorverHPMessage(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCurrentWeaponFireMode(enum class Unknow FireMode); // Function U.U.SetCurrentWeaponFireMode(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowPerkDeck(); // Function U.U.ShowPerkDeck(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HidePerkDeck(); // Function U.U.HidePerkDeck(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayReadyGivePerk(); // Function U.U.PlayReadyGivePerk(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayKillGivePerk(int32_t KillCount); // Function U.U.PlayKillGivePerk(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangedToggleType(enum class Unknow PreType, enum class Unknow CurrentType); // Function U.U.OnChangedToggleType(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckVisibilityPerkDeck(); // Function U.U.CheckVisibilityPerkDeck(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideHUDMessage(enum class Unknow MessageType); // Function U.U.HideHUDMessage(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AddKillMessage(struct Unknown& Info); // Function U.U.AddKillMessage(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowCastingUI(struct Unknown& CastingInfo); // Function U.U.ShowCastingUI(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideCastingUI(); // Function U.U.HideCastingUI(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OpenInventory(); // Function U.U.OpenInventory(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CloseInventory(); // Function U.U.CloseInventory(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayShowAnim(); // Function U.U.PlayShowAnim(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayHideAnim(); // Function U.U.PlayHideAnim(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangedPlayerInfos(); // Function U.U.OnChangedPlayerInfos(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowHUDMessage(struct Unknown MessageRow); // Function U.U.ShowHUDMessage(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_SetPerkInfo(); // Function U.U.K2_SetPerkInfo(Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowMyKillCountMessage(char bIsKill, struct FText& Message); // Function U.U.ShowMyKillCountMessage(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowHitDamageLog(struct Unknown& HitDamageLogInfo); // Function U.U.ShowHitDamageLog(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void LevelUpEvent(struct Unknown PerkInfo, int32_t CurrentLevel, enum class Unknow LevelUpType, struct Unknown DisplayAbility, int32_t LastLevel); // Function U.U.LevelUpEvent(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PreConstruct(char IsDesignTime); // Function U.U.PreConstruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelTeamPositionWidget {

public:

	struct Unknown UberGraphFrame; // 0x290 (8)
	struct Unknown Anim_Bouncing; // 0x298 (8)
	struct Unknown CanvasRequestResuscitation; // 0x2A0 (8)
	struct Unknown CriticalGuage; // 0x2A8 (8)
	struct Unknown DyingGuage; // 0x2B0 (8)
	struct Unknown Img_StateDeath; // 0x2B8 (8)
	struct Unknown Img_StateDisconnect; // 0x2C0 (8)
	struct Unknown Img_StateParachute; // 0x2C8 (8)
	struct Unknown Img_StateRevival; // 0x2D0 (8)
	struct Unknown Img_StateVehicle; // 0x2D8 (8)
	struct Unknown Img_TeamColor; // 0x2E0 (8)
	struct Unknown KnockDownBar; // 0x2E8 (8)
	struct Unknown MoveParameter; // 0x2F0 (8)
	struct Unknown RevivingGuage; // 0x2F8 (8)
	struct Unknown Switcher_Guage; // 0x300 (8)
	struct Unknown Switcher_Icon; // 0x308 (8)
	struct Unknown TextBlock_Name; // 0x310 (8)
	struct Unknown TextBlock_PlayerIndex; // 0x318 (8)
	struct Unknown RevivingTimerHandle; // 0x320 (8)
	float TotalRevivingTime; // 0x328 (4)
	float CurrentRevivingTime; // 0x32C (4)
	char IsRequestResuscitation : 0; // 0x330 (1)

	void Move(); // Function U.U.Move(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckRequestResuscitation(); // Function U.U.CheckRequestResuscitation(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetHealthPercent(float& Percent); // Function U.U.GetHealthPercent(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateKnockOutHealth(); // Function U.U.UpdateKnockOutHealth(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateCastingGauge(char& IsCasting); // Function U.U.UpdateCastingGauge(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetNameVisibility(); // Function U.U.SetNameVisibility(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetTeamNumInfo(); // Function U.U.SetTeamNumInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateRevivalGauge(); // Function U.U.UpdateRevivalGauge(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateKnockOutGauge(); // Function U.U.UpdateKnockOutGauge(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateGauge(); // Function U.U.UpdateGauge(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetIconSwitcher(); // Function U.U.SetIconSwitcher(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRotationVisibility(); // Function U.U.SetRotationVisibility(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetTeamColorVisibility(); // Function U.U.SetTeamColorVisibility(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPlayerName(); // Function U.U.SetPlayerName(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_OnChangedBehavior(); // Function U.U.K2_OnChangedBehavior(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_OnChangedDisconnect(); // Function U.U.K2_OnChangedDisconnect(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_OnChangedIconIndex(); // Function U.U.K2_OnChangedIconIndex(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_OnChangedIsInViewport(); // Function U.U.K2_OnChangedIsInViewport(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_OnChangedPlayerState(); // Function U.U.K2_OnChangedPlayerState(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown Ani_MouseRight; // 0x248 (8)
	struct Unknown Image; // 0x250 (8)
	struct Unknown Image_2; // 0x258 (8)
	struct Unknown Image_292; // 0x260 (8)
	struct Unknown Image_503; // 0x268 (8)

	void HideMouse(); // Function U.U.HideMouse(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowMouse(); // Function U.U.ShowMouse(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelScopeWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Idle; // 0x250 (8)
	struct Unknown Scope_In; // 0x258 (8)
	struct Unknown CanvasPanel_1; // 0x260 (8)
	struct Unknown Distance_Image; // 0x268 (8)
	struct Unknown Distance_Text; // 0x270 (8)
	struct Unknown Magnify_Image; // 0x278 (8)
	struct Unknown Magnify_Text; // 0x280 (8)
	struct Unknown Scope_BG; // 0x288 (8)
	struct Unknown Scope_Info_Line; // 0x290 (8)
	struct Unknown Scope_Wing; // 0x298 (8)

	struct Unknown Get_Distance_Text_ColorAndOpacity_1(); // Function U.U.Get_Distance_Text_ColorAndOpacity_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct FText Get_Magnify_Text(); // Function U.U.Get_Magnify_Text(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct FText Get_DistanceText(); // Function U.U.Get_DistanceText(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetScopeImageAngle(float NewAngle); // Function U.U.SetScopeImageAngle(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_OnEnterADS(); // Function U.U.K2_OnEnterADS(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_OnExitADS(); // Function U.U.K2_OnExitADS(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown BT; // 0x250 (8)
	struct Unknown BT; // 0x258 (8)
	struct Unknown BT; // 0x260 (8)
	struct Unknown BT; // 0x268 (8)
	struct Unknown BT; // 0x270 (8)
	struct Unknown BT; // 0x278 (8)
	struct Unknown BT; // 0x280 (8)
	struct Unknown BT; // 0x288 (8)
	struct Unknown BT; // 0x290 (8)
	struct Unknown BT; // 0x298 (8)
	struct Unknown BT; // 0x2A0 (8)
	struct Unknown BT; // 0x2A8 (8)
	struct Unknown BT; // 0x2B0 (8)
	struct Unknown BT; // 0x2B8 (8)
	struct Unknown BT; // 0x2C0 (8)
	struct Unknown BT; // 0x2C8 (8)
	struct Unknown BT; // 0x2D0 (8)
	struct Unknown BT; // 0x2D8 (8)
	struct Unknown BT; // 0x2E0 (8)
	struct Unknown BT; // 0x2E8 (8)
	struct Unknown BT; // 0x2F0 (8)
	struct Unknown BT; // 0x2F8 (8)
	struct Unknown BT; // 0x300 (8)
	struct Unknown BT; // 0x308 (8)
	struct Unknown BT; // 0x310 (8)
	struct Unknown BT; // 0x318 (8)
	struct Unknown BT; // 0x320 (8)
	struct Unknown BT; // 0x328 (8)
	struct Unknown BT; // 0x330 (8)
	struct Unknown BT; // 0x338 (8)
	struct Unknown BT; // 0x340 (8)
	struct Unknown BT; // 0x348 (8)
	struct Unknown BT; // 0x350 (8)
	struct Unknown BT; // 0x358 (8)
	struct Unknown BT; // 0x360 (8)
	struct Unknown BT; // 0x368 (8)
	struct Unknown BT; // 0x370 (8)
	struct Unknown BT; // 0x378 (8)
	struct Unknown BT; // 0x380 (8)
	struct Unknown Button_1; // 0x388 (8)
	struct Unknown Button_2; // 0x390 (8)
	struct Unknown Button_3; // 0x398 (8)
	struct Unknown Button_4; // 0x3A0 (8)
	struct Unknown Image_1; // 0x3A8 (8)
	struct Unknown Image_2; // 0x3B0 (8)
	struct Unknown Image_3; // 0x3B8 (8)
	struct Unknown Image_4; // 0x3C0 (8)
	struct Unknown IM; // 0x3C8 (8)
	struct Unknown IM; // 0x3D0 (8)
	struct Unknown IM; // 0x3D8 (8)
	struct Unknown IM; // 0x3E0 (8)
	struct Unknown IM; // 0x3E8 (8)
	struct Unknown IM; // 0x3F0 (8)
	struct Unknown IM; // 0x3F8 (8)
	struct Unknown IM; // 0x400 (8)
	struct Unknown IM; // 0x408 (8)
	struct Unknown IM; // 0x410 (8)
	struct Unknown IM; // 0x418 (8)
	struct Unknown IM; // 0x420 (8)
	struct Unknown IM; // 0x428 (8)
	struct Unknown IM; // 0x430 (8)
	struct Unknown IM; // 0x438 (8)
	struct Unknown IM; // 0x440 (8)
	struct Unknown IM; // 0x448 (8)
	struct Unknown IM; // 0x450 (8)
	struct Unknown IM; // 0x458 (8)
	struct Unknown IM; // 0x460 (8)
	struct Unknown IM; // 0x468 (8)
	struct Unknown IM; // 0x470 (8)
	struct Unknown IM; // 0x478 (8)
	struct Unknown IM; // 0x480 (8)
	struct Unknown IM; // 0x488 (8)
	struct Unknown IM; // 0x490 (8)
	struct Unknown IM; // 0x498 (8)
	struct Unknown IM; // 0x4A0 (8)
	struct Unknown IM; // 0x4A8 (8)
	struct Unknown IM; // 0x4B0 (8)
	struct Unknown IM; // 0x4B8 (8)
	struct Unknown IM; // 0x4C0 (8)
	struct Unknown IM; // 0x4C8 (8)
	struct Unknown IM; // 0x4D0 (8)
	struct Unknown IM; // 0x4D8 (8)
	struct Unknown IM; // 0x4E0 (8)
	struct Unknown IM; // 0x4E8 (8)
	struct Unknown IM; // 0x4F0 (8)
	struct Unknown S; // 0x4F8 (8)
	struct Unknown S; // 0x500 (8)
	struct Unknown S; // 0x508 (8)
	struct Unknown S; // 0x510 (8)
	struct Unknown S; // 0x518 (8)
	struct Unknown S; // 0x520 (8)
	struct Unknown S; // 0x528 (8)
	struct Unknown TextBlock_2; // 0x530 (8)
	struct Unknown TextBlock_3; // 0x538 (8)
	struct Unknown TextBlock_4; // 0x540 (8)
	struct Unknown TextBlock_5; // 0x548 (8)
	struct Unknown TX; // 0x550 (8)
	struct Unknown TX; // 0x558 (8)
	struct Unknown TX; // 0x560 (8)
	struct Unknown TX; // 0x568 (8)
	struct Unknown TX; // 0x570 (8)
	struct Unknown TX; // 0x578 (8)
	struct Unknown TX; // 0x580 (8)
	struct Unknown TX; // 0x588 (8)
	struct Unknown TX; // 0x590 (8)
	struct Unknown TX; // 0x598 (8)
	struct Unknown TX; // 0x5A0 (8)
	struct Unknown TX; // 0x5A8 (8)
	struct Unknown TX; // 0x5B0 (8)
	struct Unknown TX; // 0x5B8 (8)
	struct Unknown TX; // 0x5C0 (8)
	struct Unknown TX; // 0x5C8 (8)
	struct Unknown TX; // 0x5D0 (8)
	struct Unknown TX; // 0x5D8 (8)
	struct Unknown TX; // 0x5E0 (8)
	struct Unknown TX; // 0x5E8 (8)
	struct Unknown TX; // 0x5F0 (8)
	struct Unknown TX; // 0x5F8 (8)
	struct Unknown TX; // 0x600 (8)
	struct Unknown TX; // 0x608 (8)
	struct Unknown TX; // 0x610 (8)
	struct Unknown TX; // 0x618 (8)
	struct Unknown TX; // 0x620 (8)
	struct Unknown TX; // 0x628 (8)
	struct Unknown TX; // 0x630 (8)
	struct Unknown TX; // 0x638 (8)
	struct Unknown TX; // 0x640 (8)
	struct Unknown TX; // 0x648 (8)
	struct Unknown TX; // 0x650 (8)
	struct Unknown TX; // 0x658 (8)
	struct Unknown TX; // 0x660 (8)
	struct Unknown TX; // 0x668 (8)
	struct Unknown TX; // 0x670 (8)
	struct Unknown TX; // 0x678 (8)
	struct Unknown VerticalBox_Perk; // 0x680 (8)
	struct Unknown NormalSlateColor; // 0x688 (40)
	struct Unknown SelectedSlateColor; // 0x6B0 (40)
	struct Unknown BlackMarketMainRef; // 0x6D8 (8)

	void SetConsumableData(enum class Unknow Type); // Function U.U.SetConsumableData(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DeselectConsumableButton(enum class Unknow Type); // Function U.U.DeselectConsumableButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SelectConsumableButton(enum class Unknow Type); // Function U.U.SelectConsumableButton(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CreatePerkTab(); // Function U.U.CreatePerkTab(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ClickSubTab(enum class Unknow TabType, struct FName Index); // Function U.U.ClickSubTab(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DeselectPerkButton(enum class Unknow Type); // Function U.U.DeselectPerkButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkData(enum class Unknow Type, struct FName Class); // Function U.U.SetPerkData(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SelectPerkButton(enum class Unknow Type); // Function U.U.SelectPerkButton(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetGearData(enum class Unknow Type); // Function U.U.SetGearData(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DeselectGearButton(enum class Unknow Type); // Function U.U.DeselectGearButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SelectGearButton(enum class Unknow Type); // Function U.U.SelectGearButton(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCustomData(enum class Unknow Type); // Function U.U.SetCustomData(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DeselectCustomButton(enum class Unknow Type); // Function U.U.DeselectCustomButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SelectCustomButton(enum class Unknow Type); // Function U.U.SelectCustomButton(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Set(enum class Unknow Type); // Function U.U.Set(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetAttachmentData(enum class Unknow Type); // Function U.U.SetAttachmentData(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DeselectWearableButton(enum class Unknow Type); // Function U.U.DeselectWearableButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SelectWearableButton(enum class Unknow Type); // Function U.U.SelectWearableButton(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DeselectAttachmentButton(enum class Unknow Type); // Function U.U.DeselectAttachmentButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SelectAttachmentButton(enum class Unknow Type); // Function U.U.SelectAttachmentButton(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SelectCategory(enum class Unknow TabType); // Function U.U.SelectCategory(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Set(enum class Unknow WeaponType); // Function U.U.Set(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DeselectWeaponButton(enum class Unknow Type); // Function U.U.DeselectWeaponButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SelectWeaponButton(enum class Unknow Type); // Function U.U.SelectWeaponButton(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DeselectAllWeaponSubButton(); // Function U.U.DeselectAllWeaponSubButton(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DeselectAllAttachmentSubButton(); // Function U.U.DeselectAllAttachmentSubButton(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DeselectAllWearableSubButton(); // Function U.U.DeselectAllWearableSubButton(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DeselectAllCustomSubButton(); // Function U.U.DeselectAllCustomSubButton(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DeselectAllGearSubButton(); // Function U.U.DeselectAllGearSubButton(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DeselectAllPerkSubButton(); // Function U.U.DeselectAllPerkSubButton(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_2_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_2_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_0_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_3_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_3_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DeselectAllConsumableButton(); // Function U.U.DeselectAllConsumableButton(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelReportUserProgramWidget {

public:

	struct Unknown UberGraphFrame; // 0x278 (8)
	struct Unknown btn_Cancel; // 0x280 (8)
	struct Unknown btn_report; // 0x288 (8)
	struct Unknown Button_2; // 0x290 (8)
	struct Unknown Button_3; // 0x298 (8)
	struct Unknown Button_4; // 0x2A0 (8)
	struct Unknown Button_5; // 0x2A8 (8)
	struct Unknown CheckBox_2; // 0x2B0 (8)
	struct Unknown CheckBox_3; // 0x2B8 (8)
	struct Unknown CheckBox_4; // 0x2C0 (8)
	struct Unknown CheckBox_5; // 0x2C8 (8)
	struct Unknown combobox_button_overlay; // 0x2D0 (8)
	struct Unknown combobox_string; // 0x2D8 (8)
	struct Unknown Image; // 0x2E0 (8)
	struct Unknown Image_2; // 0x2E8 (8)
	struct Unknown Image_545; // 0x2F0 (8)
	struct Unknown NormalArrow; // 0x2F8 (8)
	struct Unknown OpeningArrow; // 0x300 (8)
	struct Unknown popup; // 0x308 (8)
	struct Unknown txt_description; // 0x310 (8)
	struct Unknown txt_nickname; // 0x318 (8)
	struct Unknown uw; // 0x320 (8)
	struct FText DescriptionText; // 0x328 (24)
	struct TArray<Unknown> ReportIndexText; // 0x340 (16)
	struct FText DefaultComboString; // 0x350 (24)
	int32_t CurrentSelectIndex; // 0x368 (4)
	char CheckCloseComboArrow : 0; // 0x36C (1)

	void CheckSelectProgramIndex(); // Function U.U.CheckSelectProgramIndex(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetOpeningArrow(char InOpening); // Function U.U.SetOpeningArrow(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetDefaultComboString(); // Function U.U.SetDefaultComboString(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Set(); // Function U.U.Set(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetDescriptionText(); // Function U.U.SetDescriptionText(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetNativeValues(); // Function U.U.SetNativeValues(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PreConstruct(char IsDesignTime); // Function U.U.PreConstruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__combobox_string_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__De(struct FString SelectedItem, char SelectionType); // Function U.U.BndEvt__combobox_string_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__De(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__combobox_string_K2Node_ComponentBoundEvent_1_OnOpeningEvent__DelegateSignatue(); // Function U.U.BndEvt__combobox_string_K2Node_ComponentBoundEvent_1_OnOpeningEvent__DelegateSignatu(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_1_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_1_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_2_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_2_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_3_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_3_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_4_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_4_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnReportConfirm(); // Function U.U.OnReportConfirm(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelInventoryPerkWidget {

public:

	struct Unknown UberGraphFrame; // 0x2E8 (8)
	struct Unknown Anim_Glow; // 0x2F0 (8)
	struct Unknown HideFreeSupply; // 0x2F8 (8)
	struct Unknown ShowFreeSupply; // 0x300 (8)
	struct Unknown LevelUp; // 0x308 (8)
	struct Unknown Ability_Defense; // 0x310 (8)
	struct Unknown Ability_Speed; // 0x318 (8)
	struct Unknown Ability_Power; // 0x320 (8)
	struct Unknown Survive_FadeInOut; // 0x328 (8)
	struct Unknown Anim_LevelUpDefense; // 0x330 (8)
	struct Unknown Anim_LevelUpSpeed; // 0x338 (8)
	struct Unknown Anim_LevelUpPower; // 0x340 (8)
	struct Unknown btn_ItemTree; // 0x348 (8)
	struct Unknown btn_PerkDeckDisabled; // 0x350 (8)
	struct Unknown btn_PerkDeckDisabled_2; // 0x358 (8)
	struct Unknown btn_PerkDeckEnabled; // 0x360 (8)
	struct Unknown btn_PerkDeckEnabled_2; // 0x368 (8)
	struct Unknown Canvas_BG; // 0x370 (8)
	struct Unknown Canvas_ChangeClass; // 0x378 (8)
	struct Unknown Canvas_ChangeDisable; // 0x380 (8)
	struct Unknown Canvas_ChangeDisable_2; // 0x388 (8)
	struct Unknown Canvas_ChangeEnable; // 0x390 (8)
	struct Unknown Canvas_ChangeEnable_2; // 0x398 (8)
	struct Unknown Canvas_ChangeSupply; // 0x3A0 (8)
	struct Unknown Canvas_LevelupEffect; // 0x3A8 (8)
	struct Unknown Canvas_Main; // 0x3B0 (8)
	struct Unknown Canvas_Perk; // 0x3B8 (8)
	struct Unknown Canvas_SupplyButton; // 0x3C0 (8)
	struct Unknown Canvas_UltimateEffect; // 0x3C8 (8)
	struct Unknown Canvas_UltimateLightEffect; // 0x3D0 (8)
	struct Unknown HorizontalBox_300; // 0x3D8 (8)
	struct Unknown HorizontalBox_303; // 0x3E0 (8)
	struct Unknown HorizontalBox_Stat; // 0x3E8 (8)
	struct Unknown HorizontalBox_UnlockLevel; // 0x3F0 (8)
	struct Unknown Image; // 0x3F8 (8)
	struct Unknown Image_5; // 0x400 (8)
	struct Unknown Image_86; // 0x408 (8)
	struct Unknown Image_126; // 0x410 (8)
	struct Unknown Image_163; // 0x418 (8)
	struct Unknown Image_180; // 0x420 (8)
	struct Unknown Image_200; // 0x428 (8)
	struct Unknown Image_203; // 0x430 (8)
	struct Unknown Image_222; // 0x438 (8)
	struct Unknown Image_384; // 0x440 (8)
	struct Unknown Image_387; // 0x448 (8)
	struct Unknown Image_388; // 0x450 (8)
	struct Unknown Image_389; // 0x458 (8)
	struct Unknown Image_485; // 0x460 (8)
	struct Unknown Image_571; // 0x468 (8)
	struct Unknown Image_1098; // 0x470 (8)
	struct Unknown Image_1100; // 0x478 (8)
	struct Unknown Image_1104; // 0x480 (8)
	struct Unknown Image_Cycle; // 0x488 (8)
	struct Unknown Image_Cycle_2; // 0x490 (8)
	struct Unknown IMG_ClassIcon; // 0x498 (8)
	struct Unknown Img_PerkDeckIcon; // 0x4A0 (8)
	struct Unknown IMG_Supply; // 0x4A8 (8)
	struct Unknown IMG_UltimatedSkill; // 0x4B0 (8)
	struct Unknown InvalidationBox_1; // 0x4B8 (8)
	struct Unknown KeyImageWidget; // 0x4C0 (8)
	struct Unknown NotEnoughGold; // 0x4C8 (8)
	struct Unknown Over_Ultimate; // 0x4D0 (8)
	struct Unknown Overlay_UltimateKey; // 0x4D8 (8)
	struct Unknown Spacer_251; // 0x4E0 (8)
	struct Unknown T_ClassName; // 0x4E8 (8)
	struct Unknown T_Defense; // 0x4F0 (8)
	struct Unknown T_DefenseAnim; // 0x4F8 (8)
	struct Unknown T_Power; // 0x500 (8)
	struct Unknown T_PowerAnim; // 0x508 (8)
	struct Unknown T_Speed; // 0x510 (8)
	struct Unknown T_SpeedAnim; // 0x518 (8)
	struct Unknown T_UltimateName; // 0x520 (8)
	struct Unknown T_UnlockLevel; // 0x528 (8)
	struct Unknown T_UnlockLevel2; // 0x530 (8)
	struct Unknown T_WeaponName; // 0x538 (8)
	struct Unknown TextBlock_2; // 0x540 (8)
	struct Unknown TextBlock_3; // 0x548 (8)
	struct Unknown TextBlock_4; // 0x550 (8)
	struct Unknown TextBlock_9; // 0x558 (8)
	struct Unknown TextBlock_ClassLevel; // 0x560 (8)
	struct Unknown TextBlock_Count_Blue; // 0x568 (8)
	struct Unknown TextBlock_Count_Green; // 0x570 (8)
	struct Unknown TextBlock_Count_Red; // 0x578 (8)
	struct Unknown TextBlock_Defense; // 0x580 (8)
	struct Unknown TextBlock_Power; // 0x588 (8)
	struct Unknown TextBlock_Price; // 0x590 (8)
	struct Unknown TextBlock_Price_2; // 0x598 (8)
	struct Unknown TextBlock_Select; // 0x5A0 (8)
	struct Unknown TextBlock_Select_2; // 0x5A8 (8)
	struct Unknown TextBlock_Speed; // 0x5B0 (8)
	struct Unknown TextBlock_SurviveMessage01; // 0x5B8 (8)
	struct Unknown TextBlock_SurviveMessage02; // 0x5C0 (8)
	struct Unknown TextBlock_UltimateDesc; // 0x5C8 (8)
	struct Unknown Title; // 0x5D0 (8)
	struct Unknown UltiLight_001; // 0x5D8 (8)
	struct Unknown UltiLight_002; // 0x5E0 (8)
	struct Unknown UltiLight_003; // 0x5E8 (8)
	struct Unknown U; // 0x5F0 (8)
	struct Unknown U_2; // 0x5F8 (8)
	struct Unknown U_3; // 0x600 (8)
	struct Unknown U_4; // 0x608 (8)
	struct Unknown U_5; // 0x610 (8)
	struct Unknown U_6; // 0x618 (8)
	struct Unknown U_7; // 0x620 (8)
	struct Unknown U_8; // 0x628 (8)
	struct Unknown U_9; // 0x630 (8)
	struct Unknown VB_Health; // 0x638 (8)
	struct Unknown VB_Power; // 0x640 (8)
	struct Unknown VB_Speed; // 0x648 (8)
	struct Unknown VerticalBox_Blue; // 0x650 (8)
	struct Unknown VerticalBox_Green; // 0x658 (8)
	struct Unknown VerticalBox_Red; // 0x660 (8)
	struct Unknown WidgetSwitcher_ChangeClass; // 0x668 (8)
	struct Unknown WidgetSwitcher_ChangeSupply; // 0x670 (8)
	struct Unknown WidgetSwitcher_TreeAndClass; // 0x678 (8)
	struct Unknown WidgetSwitcher_Ultimate; // 0x680 (8)
	struct FName CurrentPerkDeckName; // 0x688 (8)
	struct TArray<Unknown> CurrentPerkInfos; // 0x690 (16)
	struct FName ExpertWeaponKey; // 0x6A0 (8)
	struct TMap<Unknown, Unknown> CurrentPerkCells; // 0x6A8 (80)
	int32_t PerkMode; // 0x6F8 (4)
	struct Unknown HoverWidget; // 0x700 (8)
	int32_t PowerValue; // 0x708 (4)
	struct Unknown TimerHandle_Power; // 0x710 (8)
	int32_t SpeedValue; // 0x718 (4)
	struct Unknown TimerHandle_Speed; // 0x720 (8)
	int32_t DefenseValue; // 0x728 (4)
	struct Unknown TimerHandle_Defense; // 0x730 (8)
	char bPlayAbilityCountSoundStart : 0; // 0x738 (1)
	char bPlayAbilityCountSoundEnd : 0; // 0x739 (1)
	struct Unknown LevelUpSound; // 0x740 (8)
	char EnableSupplyBtn : 0; // 0x748 (1)
	struct Unknown FreeSupplyTimer; // 0x750 (8)
	struct Unknown NotEnoughtGoldTimer; // 0x758 (8)
	struct TArray<Unknown> GainPerkPopups; // 0x760 (16)
	char IsPlayingUltimateSound : 0; // 0x770 (1)
	int32_t LastLevel; // 0x774 (4)
	struct Unknown PerkDeckClassInfo; // 0x778 (40)

	void SequenceEvent__ENTRYPOINTU_2(); // Function U.U.SequenceEvent__ENTRYPOINTU_2(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_1(); // Function U.U.SequenceEvent__ENTRYPOINTU_1(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetEnabledInvalidationbox(char Enabled); // Function U.U.SetEnabledInvalidationbox(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetUltimateSound(); // Function U.U.ResetUltimateSound(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AddGainPerkPopup(struct Unknown PerkInfo, int32_t CurrentLevel, int32_t LastLevel); // Function U.U.AddGainPerkPopup(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateInvalidationbox(); // Function U.U.UpdateInvalidationbox(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangedToggleType(enum class Unknow ToggleType); // Function U.U.OnChangedToggleType(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnBattleRoyaleStateChanged(enum class Unknow PreviousState, enum class Unknow CurrentState); // Function U.U.OnBattleRoyaleStateChanged(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateStatsInfo(); // Function U.U.UpdateStatsInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnMouseButtonDown(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetUltimateSkillKeyIcon(struct TArray<Unknown>& Type); // Function U.U.SetUltimateSkillKeyIcon(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayAbilityCountSoundEnd(); // Function U.U.PlayAbilityCountSoundEnd(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayAbilityCountSoundStart(); // Function U.U.PlayAbilityCountSoundStart(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowStatusHovered(struct Unknown InHoveredWidget); // Function U.U.ShowStatusHovered(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetAbilityAnimation(struct Unknown& Handle, int32_t Value, struct Unknown Animation, struct FString FunctionName, int32_t Index); // Function U.U.SetAbilityAnimation(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void InitAnimation(); // Function U.U.InitAnimation(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DefenseCountAnimation(); // Function U.U.DefenseCountAnimation(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SpeedCountAnimation(); // Function U.U.SpeedCountAnimation(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PowerCountAnimation(); // Function U.U.PowerCountAnimation(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlaySoundBonusLevelUp(); // Function U.U.PlaySoundBonusLevelUp(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlaySoundTimeBonus(); // Function U.U.PlaySoundTimeBonus(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetPositionTargetPerk(enum class Unknow PerkSlot, int32_t PerkIndex, char& Result, struct Unknown& Position); // Function U.U.GetPositionTargetPerk(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetSlotAndIndexTargetPerk(struct FName TargetPerkName, char& HasPerk, enum class Unknow& PerkSlot, int32_t& PerkIndex); // Function U.U.GetSlotAndIndexTargetPerk(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AddUltimateSkillUnlockEffect(int32_t CurrentLevel); // Function U.U.AddUltimateSkillUnlockEffect(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetPerkCells(); // Function U.U.ResetPerkCells(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetClassLevelText(); // Function U.U.SetClassLevelText(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PerkLevelUpEffect(struct Unknown PerkInfo, int32_t CurrentLevel); // Function U.U.PerkLevelUpEffect(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkdeckWidget(char State); // Function U.U.SetPerkdeckWidget(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowUltimatePerk(); // Function U.U.ShowUltimatePerk(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayStatsLevelUpAnim(struct Unknown IncreasedAbility); // Function U.U.PlayStatsLevelUpAnim(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayLevelTextAnim(); // Function U.U.PlayLevelTextAnim(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckUltimateOpen(int32_t CurrentLevel); // Function U.U.CheckUltimateOpen(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PerkLevelUp(struct Unknown PerkInfo, int32_t CurrentLevel, int32_t LastLevel); // Function U.U.PerkLevelUp(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetUltimateSkillInfo(char UseLocalPlayerInfo, char IsMaxLevel); // Function U.U.SetUltimateSkillInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPriceFontColor(); // Function U.U.SetPriceFontColor(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct FText Get_TextBlock_Price_Text_1(); // Function U.U.Get_TextBlock_Price_Text_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CreatePerkDeck(char UseLocalPlayerInfo, char IsMaxLevel); // Function U.U.CreatePerkDeck(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerks(struct Unknown HoverWidget, char bUseLocalPlayerInfo, char bMaxLevel, char bPerkDeckMode, struct Unknown PerkDeckClassInfo); // Function U.U.SetPerks(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_99DDE97542548A0CC17B5FBAD209C3DD(struct Unknown Loaded); // Function U.U.OnLoaded_99DDE97542548A0CC17B5FBAD209C3DD(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_4F86CE894B71E485811BFEA8F94AD46E(struct Unknown Loaded); // Function U.U.OnLoaded_4F86CE894B71E485811BFEA8F94AD46E(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_9E0A9EF44F73119D77D7119DEA0EF67A(struct Unknown Loaded); // Function U.U.OnLoaded_9E0A9EF44F73119D77D7119DEA0EF67A(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function U.U.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadIcon(struct Unknown Image); // Function U.U.AsyncLoadIcon(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncCohIcon(struct Unknown Image); // Function U.U.AsyncCohIcon(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayReadyGivePerk(); // Function U.U.PlayReadyGivePerk(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StopReadyGivePerk(); // Function U.U.StopReadyGivePerk(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncClassIcon(struct Unknown Image); // Function U.U.AsyncClassIcon(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AbilityPowerAnimationFinished(); // Function U.U.AbilityPowerAnimationFinished(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AbilitySpeedAnimationFinished(); // Function U.U.AbilitySpeedAnimationFinished(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void LevelUpAnimationFinished(); // Function U.U.LevelUpAnimationFinished(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayKillGivePerk(int32_t KillCount); // Function U.U.PlayKillGivePerk(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnHoveredWidget(struct Unknown HoveredWidget); // Function U.U.OnHoveredWidget(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_PerkDeck_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__btn_PerkDeck_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AbilityDefenseAnimationFinished(); // Function U.U.AbilityDefenseAnimationFinished(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__btn_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_PerkDeck_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__btn_PerkDeck_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_PerkDeck_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__Delegate(); // Function U.U.BndEvt__btn_PerkDeck_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__Delegate(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_PerkDeckDisabled_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__Delegate(); // Function U.U.BndEvt__btn_PerkDeckDisabled_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__Delegate(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_PerkDeckEnabled_1_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__btn_PerkDeckEnabled_1_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (enum class Unknow PrevState, enum class Unknow CurrentState); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckFreeSupply(char IsInventoryOpen); // Function U.U.CheckFreeSupply(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartUltimateAnim(); // Function U.U.StartUltimateAnim(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateUnlockLevel(int32_t NewLevel); // Function U.U.UpdateUnlockLevel(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void K2_RefreshPerkDeck(); // Function U.U.K2_RefreshPerkDeck(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetEnoughGold(char IsEnough); // Function U.U.SetEnoughGold(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelKillInfoSlotWidget {

public:

	struct Unknown UberGraphFrame; // 0x258 (8)
	struct Unknown Anim_Hide; // 0x260 (8)
	struct Unknown Anim_Down; // 0x268 (8)
	struct Unknown HorizontalBox_Killer; // 0x270 (8)
	struct Unknown ScaleBox_KillerIcon; // 0x278 (8)
	struct Unknown T_ClassIcon; // 0x280 (8)
	struct Unknown T_Level; // 0x288 (8)
	struct Unknown T_LV; // 0x290 (8)
	struct Unknown T_Name; // 0x298 (8)
	struct FMulticastInlineDelegate OnTimeOut; // 0x2A0 (16)
	struct Unknown LocalPlayerState; // 0x2B0 (8)

	void OnLoaded_9DF86FA64782B378E42DBB813545BD34(struct Unknown Loaded); // Function U.U.OnLoaded_9DF86FA64782B378E42DBB813545BD34(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPlayerInfo(struct Unknown PlayerState, struct Unknown InfoColor); // Function U.U.SetPlayerInfo(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnTimeOut__DelegateSignature(int32_t ArrayIndex, struct Unknown Slot); // Function U.U.OnTimeOut__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelVehicleWidget {

public:

	struct Unknown UberGraphFrame; // 0x2A8 (8)
	struct Unknown FuelGauge; // 0x2B0 (8)
	struct Unknown FuelIcon; // 0x2B8 (8)
	struct Unknown HPFaint; // 0x2C0 (8)
	struct Unknown HPGauge; // 0x2C8 (8)
	struct Unknown HPIcon; // 0x2D0 (8)
	struct Unknown SpeedText; // 0x2D8 (8)
	struct Unknown SubInfoParent; // 0x2E0 (8)
	struct Unknown U; // 0x2E8 (8)
	struct Unknown CachedVehicle; // 0x2F0 (8)
	struct Unknown MySeatColor; // 0x2F8 (16)
	struct Unknown EmptyFuelColor; // 0x308 (16)
	float InterpTargetHpRate; // 0x318 (4)
	float InterpCurrentHpRate; // 0x31C (4)
	float InterpSpeed; // 0x320 (4)
	struct Unknown HPFaintCurve; // 0x328 (8)
	struct Unknown HPColorCurve; // 0x330 (8)
	struct Unknown SubInfoWidget; // 0x338 (8)
	char EnableBind : 0; // 0x340 (1)
	struct Unknown NewVar_1; // 0x348 (8)

	void OnWheelWrecked(int32_t WheelIndex); // Function U.U.OnWheelWrecked(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetHPColor(float InPercent); // Function U.U.SetHPColor(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnSeatOccupantExited(struct Unknown Seat); // Function U.U.OnSeatOccupantExited(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnSeatOccupantEntered(struct Unknown Seat); // Function U.U.OnSeatOccupantEntered(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateFuelGauge(); // Function U.U.UpdateFuelGauge(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateSpeedText(); // Function U.U.UpdateSpeedText(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Hide(); // Function U.U.Hide(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Show(struct Unknown VehicleSeat); // Function U.U.Show(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetInfo(float CurFuel, float CurHp, struct FString CurSpeed); // Function U.U.SetInfo(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowVehicle(); // Function U.U.ShowVehicle(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnSeatOccupantEnter(struct Unknown SeatComponent, struct Unknown Occupant); // Function U.U.OnSeatOccupantEnter(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (struct Unknown SeatComponent, struct Unknown Occupant); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideVehicle(); // Function U.U.HideVehicle(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetInterpTarget(); // Function U.U.SetInterpTarget(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelReplayPlayerListItem {

public:

	struct Unknown UberGraphFrame; // 0x270 (8)
	struct Unknown BT_PlayerName; // 0x278 (8)
	struct Unknown PB_HP; // 0x280 (8)
	struct Unknown T_PlayerName; // 0x288 (8)
	struct Unknown T_PlayerNameHighlight; // 0x290 (8)
	struct Unknown T_SortInfo; // 0x298 (8)
	char bIsTargetPawn : 0; // 0x2A0 (1)
	char bIsAlive : 0; // 0x2A1 (1)

	void UpdateHighlightNameColor(); // Function U.U.UpdateHighlightNameColor(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateSortInfo(enum class Unknow PlayerListSortType); // Function U.U.UpdateSortInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckAlive(enum class Unknow PlayerListSortType); // Function U.U.CheckAlive(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateButton(); // Function U.U.UpdateButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateHP(); // Function U.U.UpdateHP(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateDisable(); // Function U.U.UpdateDisable(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateInfos(); // Function U.U.UpdateInfos(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Init(struct Unknown PlayerState); // Function U.U.Init(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT_PlayerName_K2Node_ComponentBoundEvent_0_Oy_Perk(); // Function U.U.BndEvt__BT_PlayerName_K2Node_ComponentBoundEvent_0_(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdatePlayerInfo(enum class Unknow PlayerListSortType); // Function U.U.UpdatePlayerInfo(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Character_BG_Motion; // 0x250 (8)
	struct Unknown Image_308; // 0x258 (8)
	struct Unknown ScrollBox_KeepedList; // 0x260 (8)
	struct Unknown TextBlock_Count; // 0x268 (8)
	struct Unknown PlayerController; // 0x270 (8)

	void HoverRecipeItems(struct TArray<Unknown>& ItemKeys); // Function U.U.HoverRecipeItems(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverRecipeTree(struct FName ItemKey); // Function U.U.HoverRecipeTree(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CompleteItems(struct TArray<Unknown>& ItemKeys); // Function U.U.CompleteItems(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DisableCarriedListHover(); // Function U.U.DisableCarriedListHover(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	char DropItem(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.DropItem(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetInventoryComponent(char& Result, struct Unknown& InventoryComponentRef); // Function U.U.GetInventoryComponent(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Reset(); // Function U.U.Reset(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverItems(struct TArray<Unknown>& ItemKeys); // Function U.U.HoverItems(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HoverReset(); // Function U.U.HoverReset(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	char OnDrop(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.OnDrop(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnDragEnter(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.OnDragEnter(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnDragLeave(struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.OnDragLeave(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown EndQuest; // 0x250 (8)
	struct Unknown StartQuest; // 0x258 (8)
	struct Unknown Idle; // 0x260 (8)
	struct Unknown Bg; // 0x268 (8)
	struct Unknown Image_308; // 0x270 (8)
	struct Unknown Image_697; // 0x278 (8)
	struct Unknown Image_839; // 0x280 (8)
	struct Unknown TextBlock_QuestDesc; // 0x288 (8)
	struct Unknown TextBlock_QuestTitle; // 0x290 (8)
	struct Unknown U; // 0x298 (8)
	struct Unknown U_2; // 0x2A0 (8)
	struct Unknown U_94; // 0x2A8 (8)
	struct Unknown VerticalBox_Tasks; // 0x2B0 (8)
	struct Unknown QuestInfo; // 0x2B8 (48)
	struct Unknown QuestData; // 0x2E8 (88)
	char ActiveQuest : 0; // 0x340 (1)
	struct TArray<Unknown> PendingQuestInfo; // 0x348 (16)

	void ConsumeQuestInfo(); // Function U.U.ConsumeQuestInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CompleteQuest(); // Function U.U.CompleteQuest(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateQuestInfo(struct Unknown QuestInfo); // Function U.U.UpdateQuestInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetQuestInfo(struct Unknown QuestInfo); // Function U.U.SetQuestInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Finished_98C3A1304432C887E8D12CAE4AA78DFF(); // Function U.U.Finished_98C3A1304432C887E8D12CAE4AA78DFF(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CompleteQuestEvent(); // Function U.U.CompleteQuestEvent(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Hide; // 0x250 (8)
	struct Unknown RankDown; // 0x258 (8)
	struct Unknown RankUp; // 0x260 (8)
	struct Unknown Anim_Reward; // 0x268 (8)
	struct Unknown Arrow_3; // 0x270 (8)
	struct Unknown ArrowLine_3; // 0x278 (8)
	struct Unknown BottomLine_3; // 0x280 (8)
	struct Unknown BrightSpot_01; // 0x288 (8)
	struct Unknown BrightSpot_02; // 0x290 (8)
	struct Unknown BrightSpot_03; // 0x298 (8)
	struct Unknown BrightSpot_04; // 0x2A0 (8)
	struct Unknown BrightSpot_05; // 0x2A8 (8)
	struct Unknown Button_DeathCam_2; // 0x2B0 (8)
	struct Unknown Button_Exit; // 0x2B8 (8)
	struct Unknown Button_KillCam; // 0x2C0 (8)
	struct Unknown Button_Report; // 0x2C8 (8)
	struct Unknown Button_Spectate; // 0x2D0 (8)
	struct Unknown CanvasPanel_3; // 0x2D8 (8)
	struct Unknown CanvasPanel_9; // 0x2E0 (8)
	struct Unknown CanvasPanel_1174; // 0x2E8 (8)
	struct Unknown CanvasPanel_1384; // 0x2F0 (8)
	struct Unknown Glow1; // 0x2F8 (8)
	struct Unknown Glow2; // 0x300 (8)
	struct Unknown Glow3; // 0x308 (8)
	struct Unknown Glow_01; // 0x310 (8)
	struct Unknown GlowLine; // 0x318 (8)
	struct Unknown Gold; // 0x320 (8)
	struct Unknown Image_26; // 0x328 (8)
	struct Unknown Image_27; // 0x330 (8)
	struct Unknown Image_28; // 0x338 (8)
	struct Unknown Image_29; // 0x340 (8)
	struct Unknown Image_216; // 0x348 (8)
	struct Unknown Image_223; // 0x350 (8)
	struct Unknown Image_458; // 0x358 (8)
	struct Unknown Image_559; // 0x360 (8)
	struct Unknown Image_CurrentRANK; // 0x368 (8)
	struct Unknown Image_DownRANK; // 0x370 (8)
	struct Unknown Image_UpRANK; // 0x378 (8)
	struct Unknown L_Wing01; // 0x380 (8)
	struct Unknown L_Wing01_2; // 0x388 (8)
	struct Unknown L_Wing01_5; // 0x390 (8)
	struct Unknown L_Wing02; // 0x398 (8)
	struct Unknown L_Wing02_2; // 0x3A0 (8)
	struct Unknown L_Wing02_5; // 0x3A8 (8)
	struct Unknown L_Wing03; // 0x3B0 (8)
	struct Unknown L_Wing03_2; // 0x3B8 (8)
	struct Unknown L_Wing03_5; // 0x3C0 (8)
	struct Unknown L_WingLine; // 0x3C8 (8)
	struct Unknown L_WingLine_3; // 0x3D0 (8)
	struct Unknown Light_2; // 0x3D8 (8)
	struct Unknown Light_01; // 0x3E0 (8)
	struct Unknown Light_02; // 0x3E8 (8)
	struct Unknown Light_03; // 0x3F0 (8)
	struct Unknown Light_04; // 0x3F8 (8)
	struct Unknown Light_05; // 0x400 (8)
	struct Unknown Light_06; // 0x408 (8)
	struct Unknown Overlay; // 0x410 (8)
	struct Unknown Overlay_2; // 0x418 (8)
	struct Unknown Overlay_264; // 0x420 (8)
	struct Unknown Overlay_Report; // 0x428 (8)
	struct Unknown Overlay_Spectate; // 0x430 (8)
	struct Unknown R_Wing01; // 0x438 (8)
	struct Unknown R_Wing01_2; // 0x440 (8)
	struct Unknown R_Wing01_5; // 0x448 (8)
	struct Unknown R_Wing01_6; // 0x450 (8)
	struct Unknown R_Wing02; // 0x458 (8)
	struct Unknown R_Wing02_2; // 0x460 (8)
	struct Unknown R_Wing02_5; // 0x468 (8)
	struct Unknown R_Wing02_6; // 0x470 (8)
	struct Unknown R_Wing03; // 0x478 (8)
	struct Unknown R_Wing03_2; // 0x480 (8)
	struct Unknown R_Wing03_5; // 0x488 (8)
	struct Unknown R_Wing03_6; // 0x490 (8)
	struct Unknown R_WingLine; // 0x498 (8)
	struct Unknown R_WingLine_3; // 0x4A0 (8)
	struct Unknown Ribbon; // 0x4A8 (8)
	struct Unknown ring; // 0x4B0 (8)
	struct Unknown RIng_Glow_01; // 0x4B8 (8)
	struct Unknown ScrollBox_2; // 0x4C0 (8)
	struct Unknown ScrollBox_199; // 0x4C8 (8)
	struct Unknown SizeBox_8; // 0x4D0 (8)
	struct Unknown Spacer_6018; // 0x4D8 (8)
	struct Unknown Spacer_6217; // 0x4E0 (8)
	struct Unknown Spacer_Center; // 0x4E8 (8)
	struct Unknown Spacer_Center_2; // 0x4F0 (8)
	struct Unknown T_RemainTime_2; // 0x4F8 (8)
	struct Unknown Text_Report; // 0x500 (8)
	struct Unknown TextBlock_3; // 0x508 (8)
	struct Unknown TextBlock_12; // 0x510 (8)
	struct Unknown TextBlock_13; // 0x518 (8)
	struct Unknown TextBlock_14; // 0x520 (8)
	struct Unknown TextBlock_25; // 0x528 (8)
	struct Unknown TextBlock_27; // 0x530 (8)
	struct Unknown TextBlock_1425; // 0x538 (8)
	struct Unknown TextBlock_2242; // 0x540 (8)
	struct Unknown TextBlock_2769; // 0x548 (8)
	struct Unknown TextBlock_3056; // 0x550 (8)
	struct Unknown TextBlock_LocalMatchRP; // 0x558 (8)
	struct Unknown TextGlow01; // 0x560 (8)
	struct Unknown TextGlow02; // 0x568 (8)
	struct Unknown TextGlow03; // 0x570 (8)
	struct Unknown TopLine_3; // 0x578 (8)
	struct Unknown U; // 0x580 (8)
	struct Unknown U_2; // 0x588 (8)
	struct Unknown U_3; // 0x590 (8)
	struct Unknown U_4; // 0x598 (8)
	struct Unknown U_5; // 0x5A0 (8)
	struct Unknown U_369; // 0x5A8 (8)
	struct Unknown U; // 0x5B0 (8)
	struct Unknown U; // 0x5B8 (8)
	struct Unknown VerticalBox_191; // 0x5C0 (8)
	struct Unknown WidgetSwitcher_2; // 0x5C8 (8)
	char MatchEnd : 0; // 0x5D0 (1)
	struct Unknown AnimationData; // 0x5D1 (2)
	struct Unknown MatchEndWidgetRef; // 0x5D8 (8)
	struct Unknown SimpleResult; // 0x5E0 (168)
	struct Unknown SimpleTimer; // 0x688 (8)
	char IsWinningCam : 0; // 0x690 (1)
	struct Unknown StartSound; // 0x694 (4)
	struct Unknown GainGoldHandle; // 0x698 (8)
	struct Unknown GoldHandle; // 0x6A0 (8)
	struct Unknown FinalResultData; // 0x6A8 (4)
	int32_t RandomGold; // 0x6AC (4)
	int32_t GainGoldValue; // 0x6B0 (4)
	struct Unknown LocalWidget; // 0x6B8 (8)
	struct Unknown PlayerState; // 0x6C0 (8)
	struct Unknown Timehandle_Rank; // 0x6C8 (8)
	char Increase : 0; // 0x6D0 (1)
	char bMaxPrograssbar : 0; // 0x6D1 (1)
	int32_t CurrentRP; // 0x6D4 (4)
	int32_t PlayerOriRP; // 0x6D8 (4)
	int32_t TargetRP; // 0x6DC (4)
	int32_t NextTireRP; // 0x6E0 (4)
	int32_t CurrentTierID; // 0x6E4 (4)
	char IsGiveUp : 0; // 0x6E8 (1)
	int32_t TempRank; // 0x6EC (4)
	int32_t TempKill; // 0x6F0 (4)
	int32_t TempHit; // 0x6F4 (4)
	int32_t TempSuvival; // 0x6F8 (4)
	int32_t SeasonRP; // 0x6FC (4)
	int32_t GainedRP; // 0x700 (4)
	int32_t AminRPText; // 0x704 (4)
	int32_t StartRP; // 0x708 (4)
	int32_t EndRP; // 0x70C (4)
	float ShowTime; // 0x710 (4)
	char IsTargetCameraKiller : 0; // 0x714 (1)

	void SequenceEvent__ENTRYPOINTU_2(); // Function U.U.SequenceEvent__ENTRYPOINTU_2(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_1(); // Function U.U.SequenceEvent__ENTRYPOINTU_1(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowMAXRPText(); // Function U.U.ShowMAXRPText(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RankerDown(); // Function U.U.RankerDown(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RankPointSetData(); // Function U.U.RankPointSetData(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetupRankDown(); // Function U.U.SetupRankDown(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetupRankUp(); // Function U.U.SetupRankUp(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetTierRP(int32_t& NextRP, char& Next, int32_t& NowRP, int32_t& PreviousRP, char& Previous); // Function U.U.GetTierRP(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetItem(); // Function U.U.SetItem(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRank(); // Function U.U.SetRank(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPlayInfo(); // Function U.U.SetPlayInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Init(); // Function U.U.Init(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRankImage(int32_t IDD, struct Unknown Widgett); // Function U.U.SetRankImage(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateInputMode(); // Function U.U.UpdateInputMode(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideSimpleWidget(); // Function U.U.HideSimpleWidget(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Check(); // Function U.U.Check(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Check(); // Function U.U.Check(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ReportSended(); // Function U.U.ReportSended(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetColorTextWidget(struct Unknown Widgett, int32_t Valuee, struct Unknown Colorr); // Function U.U.SetColorTextWidget(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetGold(); // Function U.U.SetGold(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_DeathCam_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_DeathCam_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Spectate_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Spectate_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Exit_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Exit_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_DeathCam_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_DeathCam_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Spectate_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Spectate_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Exit_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignatu(); // Function U.U.BndEvt__Button_Exit_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignatuna(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Report_K2Node_ComponentBoundEvent_0_(); // Function U.U.BndEvt__Button_Report_K2Node_ComponentBoundEvent_0_(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowDeathCam(); // Function U.U.ShowDeathCam(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Close(); // Function U.U.Close(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Report_K2Node_ComponentBoundEvent_6_(); // Function U.U.BndEvt__Button_Report_K2Node_ComponentBoundEvent_6_(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function U.U.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowGold(); // Function U.U.ShowGold(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetInfo(struct Unknown PS, struct Unknown ResultData, struct Unknown MatchEndWidget); // Function U.U.SetInfo(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EventRankAnimation(); // Function U.U.EventRankAnimation(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadTexture(struct Unknown Imge, struct Unknown Widget); // Function U.U.AsyncLoadTexture(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RankUpDown(); // Function U.U.RankUpDown(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_DeathCam_1_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_DeathCam_1_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_DeathCam_1_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_DeathCam_1_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelPlayerMarkerWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Anim_OnShow; // 0x250 (8)
	struct Unknown Canvas_Move; // 0x258 (8)
	struct Unknown IconImage; // 0x260 (8)
	struct Unknown Overlay_1; // 0x268 (8)
	struct Unknown PlayerMarker; // 0x270 (8)
	struct Unknown SizeBox_IconImage; // 0x278 (8)
	struct Unknown TeamIndex; // 0x280 (8)
	struct Unknown U; // 0x288 (8)
	struct Unknown WidgetSwitcher_Icon; // 0x290 (8)
	char IsShowingAnimReserv : 0; // 0x298 (1)
	struct FMulticastInlineDelegate OnMarkerClicked; // 0x2A0 (16)
	struct Unknown CurrentMarker; // 0x2B0 (8)
	struct TMap<Unknown, Unknown> Map_PingTypeTexture; // 0x2B8 (80)
	struct TMap<Unknown, Unknown> Map_PingItemTypeTexture; // 0x308 (80)
	struct Unknown SupplyBoxNotOpen; // 0x358 (8)
	struct Unknown SupplyBoxOpened; // 0x360 (8)
	struct Unknown PlayerState; // 0x368 (8)
	char IsOnMap : 0; // 0x370 (1)
	char Selected : 0; // 0x371 (1)
	char MyPing : 0; // 0x372 (1)

	struct Unknown OnMouseButtonDown(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetImageFromPingType(enum class Unknow PingType, struct Unknown& Image); // Function U.U.GetImageFromPingType(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetGuidePingInfoForSmartpingMenu(enum class Unknow PingType); // Function U.U.SetGuidePingInfoForSmartpingMenu(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPingType(struct Unknown PingInfo, char IsOpend); // Function U.U.SetPingType(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnResetMarkerInfo(); // Function U.U.OnResetMarkerInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPlayerColor(struct Unknown PlayerState); // Function U.U.SetPlayerColor(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ReserveShowingAnimation(); // Function U.U.ReserveShowingAnimation(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnMouseButtonUp(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonUp(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Initialize(struct Unknown PlayerState); // Function U.U.Initialize(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetInfo(struct Unknown PingInfo, char UsingAnimation, char IsOpened); // Function U.U.SetInfo(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetMarkerInfo(char IsUpdate); // Function U.U.ResetMarkerInfo(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetMaterialInfo(char UsingAnimation, struct Unknown MaterialPingInfo); // Function U.U.SetMaterialInfo(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetResuscitationInfo(char UsingAnimation, struct Unknown PlayerState); // Function U.U.SetResuscitationInfo(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetLocalPingInfo(char UsingAnimation, struct Unknown LocalPingInfo); // Function U.U.SetLocalPingInfo(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetExpertWeaponInfo(char UsingAnimation, struct Unknown ExpertWeaponPingInfo); // Function U.U.SetExpertWeaponInfo(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function U.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMarkerClicked__DelegateSignature(struct Unknown Button, char mapObjectID); // Function U.U.OnMarkerClicked__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelScopeWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Image_1; // 0x250 (8)

	void SetScopeImageAngle(float NewAngle); // Function U.U.SetScopeImageAngle(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown FadeOut; // 0x250 (8)
	struct Unknown HitImage; // 0x258 (8)
	struct Unknown SizeBox_1; // 0x260 (8)
	struct Unknown InstigatorLocation; // 0x268 (12)
	struct Unknown InstigatorCharacter; // 0x278 (8)

	void Hide(); // Function U.U.Hide(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UU {

public:

	struct Unknown UberGraphFrame; // 0x3D8 (8)
	struct Unknown BT; // 0x3E0 (8)
	struct Unknown BT; // 0x3E8 (8)
	struct Unknown BT; // 0x3F0 (8)
	struct Unknown BT; // 0x3F8 (8)
	struct Unknown BT; // 0x400 (8)
	struct Unknown BT; // 0x408 (8)
	struct Unknown BT; // 0x410 (8)
	struct Unknown BT; // 0x418 (8)
	struct Unknown BT; // 0x420 (8)
	struct Unknown BT; // 0x428 (8)
	struct Unknown C; // 0x430 (8)
	struct Unknown IM; // 0x438 (8)
	struct Unknown IM; // 0x440 (8)
	struct Unknown IM; // 0x448 (8)
	struct Unknown IM; // 0x450 (8)
	struct Unknown IM; // 0x458 (8)
	struct Unknown IM; // 0x460 (8)
	struct Unknown Menu02; // 0x468 (8)
	struct Unknown Menu03; // 0x470 (8)
	struct Unknown Menu04; // 0x478 (8)
	struct Unknown Menu05; // 0x480 (8)
	struct Unknown Menu06; // 0x488 (8)
	struct Unknown Menu07; // 0x490 (8)
	struct Unknown Menu08; // 0x498 (8)
	struct Unknown Menu09; // 0x4A0 (8)
	struct Unknown Menu10; // 0x4A8 (8)
	struct Unknown Menu11; // 0x4B0 (8)
	struct Unknown Overlay_Mask; // 0x4B8 (8)
	struct Unknown TX; // 0x4C0 (8)
	struct Unknown TX; // 0x4C8 (8)
	struct Unknown TX; // 0x4D0 (8)
	struct Unknown TX; // 0x4D8 (8)
	struct Unknown TX; // 0x4E0 (8)
	struct Unknown TX; // 0x4E8 (8)
	struct Unknown TX; // 0x4F0 (8)
	struct Unknown TX; // 0x4F8 (8)
	struct Unknown TX; // 0x500 (8)
	struct Unknown TX; // 0x508 (8)
	struct Unknown TX; // 0x510 (8)
	struct Unknown TX; // 0x518 (8)
	struct Unknown TX; // 0x520 (8)
	struct Unknown TX; // 0x528 (8)
	struct Unknown TX; // 0x530 (8)
	struct Unknown TX; // 0x538 (8)
	struct Unknown TX; // 0x540 (8)
	struct Unknown TX; // 0x548 (8)
	struct Unknown TX; // 0x550 (8)
	struct Unknown TX; // 0x558 (8)
	struct Unknown TX; // 0x560 (8)

	void SetIconTexture(struct Unknown IconTexture); // Function U.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown On_IM_2(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.On_IM_2(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_9693EBAC46E1F6BA769CC6A2AB0B68E0(struct Unknown Loaded); // Function U.U.OnLoaded_9693EBAC46E1F6BA769CC6A2AB0B68E0(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function U.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AysncLoading(struct Unknown IconTexture); // Function U.U.AysncLoading(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SwitchMenu(); // Function U.U.SwitchMenu(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SwitchSlot(); // Function U.U.SwitchSlot(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Button; // 0x250 (8)
	struct Unknown Button_Text; // 0x258 (8)
	struct Unknown Overlay_Button; // 0x260 (8)
	struct FText ButtonText; // 0x268 (24)
	struct FMulticastInlineDelegate OnClicked; // 0x280 (16)
	struct FMulticastInlineDelegate OnPressed; // 0x290 (16)
	struct FMulticastInlineDelegate OnReleased; // 0x2A0 (16)
	struct FMulticastInlineDelegate OnHovered; // 0x2B0 (16)

	void BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PreConstruct(char IsDesignTime); // Function U.U.PreConstruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnInitialized(); // Function U.U.OnInitialized(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnHovered__DelegateSignature(); // Function U.U.OnHovered__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnReleased__DelegateSignature(); // Function U.U.OnReleased__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnPressed__DelegateSignature(); // Function U.U.OnPressed__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnClicked__DelegateSignature(); // Function U.U.OnClicked__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelVoiceTalkWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Image; // 0x250 (8)
	struct Unknown ScrollBox_99; // 0x258 (8)
	struct Unknown U; // 0x260 (8)
	struct Unknown U_135; // 0x268 (8)
	struct Unknown U_196; // 0x270 (8)
	struct TArray<Unknown> TempTeamPlayers; // 0x278 (16)

	void CheckCreateSlot(char& bRet); // Function U.U.CheckCreateSlot(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ChangeVolumeState(struct Unknown VoiceTalkState); // Function U.U.ChangeVolumeState(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelWorldMapWidget {

public:

	struct Unknown UberGraphFrame; // 0x2B8 (8)
	struct Unknown FadeIn; // 0x2C0 (8)
	struct Unknown NewAnimation_2; // 0x2C8 (8)
	struct Unknown Bg; // 0x2D0 (8)
	struct Unknown B; // 0x2D8 (8)
	struct Unknown B; // 0x2E0 (8)
	struct Unknown CloseButton; // 0x2E8 (8)
	struct Unknown ShowHelBoxButton; // 0x2F0 (8)
	struct Unknown U; // 0x2F8 (8)
	struct Unknown WidgetSwitcher_1; // 0x300 (8)
	int32_t MAX_ZOOM_LEVEL; // 0x308 (4)
	int32_t ZoomLevel; // 0x30C (4)
	float MAX_SCALE_FACTOR; // 0x310 (4)
	int32_t InitializeCount; // 0x314 (4)
	struct Unknown PosOnViewport; // 0x318 (8)
	float CurrentScaleFactor; // 0x320 (4)
	struct Unknown MouseButtonDownPos; // 0x324 (8)
	struct Unknown SelectPingMenuTimer; // 0x330 (8)
	struct Unknown SelectionMenu; // 0x338 (8)
	char IsRoutePing : 0; // 0x340 (1)
	int32_t MaxRoutePointCount; // 0x344 (4)
	struct TArray<Unknown> RoutePointArray; // 0x348 (16)

	void SetClassInfoBoardVisibilityByZoomLevel(int32_t LastZoomLevel, int32_t NewZoomLevel); // Function U.U.SetClassInfoBoardVisibilityByZoomLevel(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetZoomLevel(int32_t& ZoomLevel); // Function U.U.GetZoomLevel(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StopRoutePing(); // Function U.U.StopRoutePing(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateRoutePing(); // Function U.U.UpdateRoutePing(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsFullRoutePing(char& NewParam); // Function U.U.IsFullRoutePing(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckRoutePing(); // Function U.U.CheckRoutePing(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetRoutePing(); // Function U.U.ResetRoutePing(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AddRoutePing(); // Function U.U.AddRoutePing(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRoutePing(); // Function U.U.SetRoutePing(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetVisiblePingMenu(char Visible); // Function U.U.SetVisiblePingMenu(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DebugStringOnMap(struct FString DebugString, struct Unknown WorldPosition, float RemainTime, float FontSize); // Function U.U.DebugStringOnMap(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMapDragging(struct Unknown deltaOnViewport); // Function U.U.OnMapDragging(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RemoveMarker(); // Function U.U.RemoveMarker(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMapRightClick(struct Unknown PosOnViewport, char IsAgree, struct Unknown ForceLocation); // Function U.U.OnMapRightClick(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetZoom(int32_t NewZoomLevel); // Function U.U.SetZoom(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMapZoomOut(); // Function U.U.OnMapZoomOut(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMapZoomIn(); // Function U.U.OnMapZoomIn(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CalcScaleFactorByZoom(int32_t ZoomLevel, float& ScaleFactor); // Function U.U.CalcScaleFactorByZoom(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsZoomLevelInRange(int32_t ZoomLevel, char& Ret); // Function U.U.IsZoomLevelInRange(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_91_OnButtonClickedEvent__DelegateSignatu(); // Function U.U.BndEvt__Button_0_K2Node_ComponentBoundEvent_91_OnButtonClickedEvent__DelegateSignatu(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ShowHelBoxButton_K2Node_ComponentBoundEvent_452_OnButtonClickedEvent__De(); // Function U.U.BndEvt__ShowHelBoxButton_K2Node_ComponentBoundEvent_452_OnButtonClickedEvent__De(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AddAreaWidget(enum class Unknow WorldMapAreaWidgetType, struct Unknown& AreaWidgetInfo); // Function U.U.AddAreaWidget(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void NotifyNeedRefreshToMap(); // Function U.U.NotifyNeedRefreshToMap(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnAttackedWidget(int32_t UniquePlayerId); // Function U.U.OnAttackedWidget(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnFireWidget(int32_t UniquePlayerId, struct Unknown Rotation, float Length); // Function U.U.OnFireWidget(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetMapPlayers(); // Function U.U.ResetMapPlayers(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnViewportSized(); // Function U.U.OnViewportSized(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void NotifyTargetPawnPos(); // Function U.U.NotifyTargetPawnPos(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RemoveAreaWidget(enum class Unknow WorldMapAreaWidgetType, struct Unknown& AreaWidgetInfo); // Function U.U.RemoveAreaWidget(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateWorldMapClassInfo(); // Function U.U.UpdateWorldMapClassInfo(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnInputSmartPingAgreeWorldMap(); // Function U.U.OnInputSmartPingAgreeWorldMap(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnInputStopSmartPingWorldMap(); // Function U.U.OnInputStopSmartPingWorldMMa(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnInputSmartPingMenuWorld(); // Function U.U.OnInputSmartPingMenuWorld(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnInputSmartPingWorldMap(); // Function U.U.OnInputSmartPingWorldMap(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (char IsShow); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowPingMenu(); // Function U.U.ShowPingMenu(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseButtonDownOnMap(struct Unknown Button, struct Unknown PosOnViewport); // Function U.U.OnMouseButtonDownOnMap(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseButtonUpOnMap(struct Unknown Button, struct Unknown PosOnViewport); // Function U.U.OnMouseButtonUpOnMap(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnDraggingOnMap(struct Unknown Delta); // Function U.U.OnDraggingOnMap(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnWheelOnMap(float Delta, struct Unknown PosOnViewport); // Function U.U.OnWheelOnMap(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnObjectClickOnMap(struct Unknown Button, char mapObjectID); // Function U.U.OnObjectClickOnMap(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelTeamInfoSlotWidget {

public:

	struct Unknown UberGraphFrame; // 0x308 (8)
	struct Unknown Anim_IconBouncing; // 0x310 (8)
	struct Unknown Progress_Stroke; // 0x318 (8)
	struct Unknown Shoot_ani; // 0x320 (8)
	struct Unknown CanvasPanel_Main; // 0x328 (8)
	struct Unknown death; // 0x330 (8)
	struct Unknown Image_126; // 0x338 (8)
	struct Unknown Image_168; // 0x340 (8)
	struct Unknown Image_280; // 0x348 (8)
	struct Unknown Image_623; // 0x350 (8)
	struct Unknown Image_624; // 0x358 (8)
	struct Unknown Image_1058; // 0x360 (8)
	struct Unknown Image_Firing; // 0x368 (8)
	struct Unknown Image_Heart; // 0x370 (8)
	struct Unknown Image_Outline; // 0x378 (8)
	struct Unknown Image_TeamInfoClassIcon; // 0x380 (8)
	struct Unknown Img_LogOut; // 0x388 (8)
	struct Unknown Img_Voice; // 0x390 (8)
	struct Unknown Img_VoiceMute; // 0x398 (8)
	struct Unknown InvalidationBox_1; // 0x3A0 (8)
	struct Unknown Overlay_447; // 0x3A8 (8)
	struct Unknown Overlay_Death; // 0x3B0 (8)
	struct Unknown Overlay_RemainGoldenTimeSelf; // 0x3B8 (8)
	struct Unknown Overlay_RequestResus; // 0x3C0 (8)
	struct Unknown ProgressBar_440; // 0x3C8 (8)
	struct Unknown ProgressBar_443; // 0x3D0 (8)
	struct Unknown SizeBox_132; // 0x3D8 (8)
	struct Unknown StateGoldenTime; // 0x3E0 (8)
	struct Unknown StateKnockdown; // 0x3E8 (8)
	struct Unknown T_ClassName; // 0x3F0 (8)
	struct Unknown T_ClassWeapon; // 0x3F8 (8)
	struct Unknown T_PlayerIndex; // 0x400 (8)
	struct Unknown T_PlayerName; // 0x408 (8)
	struct Unknown TeamColor; // 0x410 (8)
	struct Unknown TextBlock_4; // 0x418 (8)
	struct Unknown TextBlock_297; // 0x420 (8)
	struct Unknown TextBlock_590; // 0x428 (8)
	struct Unknown TextBlock_591; // 0x430 (8)
	struct Unknown TextBlock_1016; // 0x438 (8)
	struct Unknown TextBlock_RemainGoldenTimeSelf; // 0x440 (8)
	struct Unknown TextBlock_RequestResus; // 0x448 (8)
	struct Unknown TextBlock_Resuscitating; // 0x450 (8)
	struct Unknown U; // 0x458 (8)
	struct Unknown WidgetSwitcher_LogOut; // 0x460 (8)
	struct Unknown WidgetSwitcher_Resuscitate; // 0x468 (8)
	int32_t Index; // 0x470 (4)
	enum class Unknow Behavior; // 0x474 (1)
	float hp; // 0x478 (4)
	struct FText Name; // 0x480 (24)
	struct TArray<Unknown> ColorList; // 0x498 (16)
	char bPin : 0; // 0x4A8 (1)
	float PrevHP; // 0x4AC (4)
	char bReduceHP : 0; // 0x4B0 (1)
	struct Unknown TimerHandleReduceHP; // 0x4B8 (8)
	char bIncreaseHP : 0; // 0x4C0 (1)
	struct Unknown HealthChangeCurve; // 0x4C8 (8)
	struct Unknown HealthDangerCurve; // 0x4D0 (8)
	struct Unknown HealTimer; // 0x4D8 (8)
	struct Unknown FaintTimer; // 0x4E0 (8)
	float BaseHealth; // 0x4E8 (4)
	float TargetHealth; // 0x4EC (4)
	float HealthWeight; // 0x4F0 (4)
	float TargetFaint; // 0x4F4 (4)
	float BaseFaint; // 0x4F8 (4)
	float FaintWeight; // 0x4FC (4)
	float CurrentHPPercent; // 0x500 (4)
	float HealHPPercent; // 0x504 (4)
	float FaintPercent; // 0x508 (4)
	float CurrentAlpha; // 0x50C (4)
	float AlphaTimer; // 0x510 (4)
	struct Unknown AlphaCurve; // 0x518 (8)
	char KnockDown : 0; // 0x520 (1)
	float HeartBeat; // 0x524 (4)
	struct Unknown DisConnectSprite; // 0x528 (8)
	struct Unknown KnockDownSprite; // 0x530 (8)
	struct Unknown DeathSprite; // 0x538 (8)
	struct Unknown VehicleSprite; // 0x540 (8)
	struct Unknown HpTimer; // 0x548 (8)
	float EndTime; // 0x550 (4)
	float StartTime; // 0x554 (4)
	float TotalTime; // 0x558 (4)
	float ResultValue; // 0x55C (4)
	float AddTme; // 0x560 (4)
	float PreStart; // 0x564 (4)

	void OnLoaded_27D2D12149E3EA31998D6D88C1D08B2F(struct Unknown Loaded); // Function U.U.OnLoaded_27D2D12149E3EA31998D6D88C1D08B2F(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetNickName(struct FString NewNickName); // Function U.U.SetNickName(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetIndex(int32_t NewIndex); // Function U.U.SetIndex(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkLevel(int32_t NewPerkLevel); // Function U.U.SetPerkLevel(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPerkName(struct FName& NewPerkName); // Function U.U.SetPerkName(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetKillCount(int32_t NewKillCount); // Function U.U.SetKillCount(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetHp(int32_t NewCur, int32_t NewMax); // Function U.U.SetHp(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPing(struct Unknown& NewPingInfo); // Function U.U.SetPing(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetTalking(char NewTalking, char bIsMute); // Function U.U.SetTalking(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetFiring(char NewIsFiring); // Function U.U.SetFiring(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AnimationHP(float Start, float End, float Time); // Function U.U.AnimationHP(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Hp_Ani(); // Function U.U.Hp_Ani(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetGoldenTime(struct Unknown NewRemainTime, float NewPercent); // Function U.U.SetGoldenTime(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetExpertWeaponName(struct FText& New); // Function U.U.SetExpertWeaponName(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCharacterState(enum class Unknow NewState, char IsDisconnect); // Function U.U.SetCharacterState(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRequestResuscitation(char bNewFlag); // Function U.U.SetRequestResuscitation(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetResuscitating(char bNewFlag); // Function U.U.SetResuscitating(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateInvalidationbox(); // Function U.U.UpdateInvalidationbox(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelScenarioWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Ani_TutorialComplete_FadeOut; // 0x250 (8)
	struct Unknown Ani_TutorialComplete; // 0x258 (8)
	struct Unknown Idle; // 0x260 (8)
	struct Unknown CanvasPanel_1; // 0x268 (8)
	struct Unknown U; // 0x270 (8)

	enum class Unknow GetVisibility_1(); // Function U.U.GetVisibility_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Finished_1CB7927F4A56CBA0CBA6E698E86EC64F(); // Function U.U.Finished_1CB7927F4A56CBA0CBA6E698E86EC64F(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Finished_619E7E41423DCBE2E8D2AC87D77B76F6(); // Function U.U.Finished_619E7E41423DCBE2E8D2AC87D77B76F6(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnUpdateScenarioQuest(struct Unknown& QuestInfo); // Function U.U.OnUpdateScenarioQuest(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnStartScenarioQuest(struct Unknown& QuestInfo); // Function U.U.OnStartScenarioQuest(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnStopScenarioQuest(struct Unknown& QuestInfo); // Function U.U.OnStopScenarioQuest(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnEndScenario(); // Function U.U.OnEndScenario(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UU {

public:

	struct Unknown UberGraphFrame; // 0x3D8 (8)
	struct Unknown BT; // 0x3E0 (8)
	struct Unknown C; // 0x3E8 (8)
	struct Unknown IM; // 0x3F0 (8)
	struct Unknown IM; // 0x3F8 (8)
	struct Unknown IM; // 0x400 (8)
	struct Unknown IM; // 0x408 (8)
	struct Unknown IM; // 0x410 (8)
	struct Unknown IM; // 0x418 (8)
	struct Unknown Menu02; // 0x420 (8)
	struct Unknown Overlay_Mask; // 0x428 (8)
	struct Unknown TX; // 0x430 (8)
	struct Unknown TX; // 0x438 (8)
	struct Unknown TX; // 0x440 (8)

	void SetIconTexture(struct Unknown IconTexture); // Function U.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown On_IM_1(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_65481F2E4FBDAFF739C1CA99F79D422C(struct Unknown Loaded); // Function U.U.OnLoaded_65481F2E4FBDAFF739C1CA99F79D422C(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AysncLoading(struct Unknown IconTexture); // Function U.U.AysncLoading(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function U.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SwitchMenu(); // Function U.U.SwitchMenu(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SwitchSlot(); // Function U.U.SwitchSlot(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Button_Focus; // 0x250 (8)
	struct Unknown HorizontalBox_1; // 0x258 (8)
	struct Unknown Image_223; // 0x260 (8)
	struct Unknown Img_Movie; // 0x268 (8)
	struct Unknown MediaPlayer; // 0x270 (8)
	char bPopup : 0; // 0x278 (1)
	struct Unknown Media; // 0x280 (8)
	struct Unknown MediaSoundComp; // 0x288 (8)
	struct Unknown Game; // 0x290 (8)
	float GammaIntensity; // 0x298 (4)
	struct Unknown SkipNoticeTimer; // 0x2A0 (8)
	struct Unknown MediaTexture; // 0x2A8 (8)
	struct FName OpeningFileName; // 0x2B0 (8)
	char End : 0; // 0x2B8 (1)
	char NextScene : 0; // 0x2B9 (1)

	void MoveNextScene(); // Function U.U.MoveNextScene(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnKeyDown(struct Unknown MyGeometry, struct Unknown InKeyEvent); // Function U.U.OnKeyDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent_1(); // Function U.U.CustomEvent_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent_2(); // Function U.U.CustomEvent_2(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Focus_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__Delegate(); // Function U.U.BndEvt__Button_Focus_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__Delegate(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown BlockMouse; // 0x250 (8)
	struct Unknown Button_Accept; // 0x258 (8)
	struct Unknown Button_Cancel; // 0x260 (8)
	struct Unknown Button_Close; // 0x268 (8)
	struct Unknown Button_Max; // 0x270 (8)
	struct Unknown Button_Min; // 0x278 (8)
	struct Unknown Image_9; // 0x280 (8)
	struct Unknown Slider_137; // 0x288 (8)
	struct Unknown TextBlock_Accept; // 0x290 (8)
	struct Unknown TextBlock_MaxCount; // 0x298 (8)
	struct Unknown TextBlock_MinCount; // 0x2A0 (8)
	struct Unknown TextBlock_Title; // 0x2A8 (8)
	struct Unknown TextBox_DropCount; // 0x2B0 (8)
	int32_t CurrentCount; // 0x2B8 (4)
	int32_t MaxCount; // 0x2BC (4)
	struct FText LastEnteredText; // 0x2C0 (24)
	struct Unknown ItemInfo; // 0x2D8 (152)
	struct Unknown ItemDetailInfo; // 0x370 (1168)
	struct Unknown PickupRef; // 0x800 (8)
	struct Unknown DropBoxRef; // 0x808 (8)
	struct Unknown InventoryWidget; // 0x810 (8)
	char bClosing : 0; // 0x818 (1)
	struct Unknown MaterialSlot; // 0x820 (8)

	void CheckNumeric(struct FString CheckString, char& CheckResult); // Function U.U.CheckNumeric(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetButtonTextColor(char IsHover, char IsPress, struct Unknown& TextColor); // Function U.U.GetButtonTextColor(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnMouseButtonDown(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetDefault(char InvenWeightCheck); // Function U.U.SetDefault(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetTextBoxText(int32_t CurrentCount); // Function U.U.SetTextBoxText(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetSliderValue(int32_t CurrentCount); // Function U.U.SetSliderValue(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PreConstruct(char IsDesignTime); // Function U.U.PreConstruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__TextBox_DropCount_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommitte(struct FText& Text, char CommitMethod); // Function U.U.BndEvt__TextBox_DropCount_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommitte(HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__TextBox_DropCount_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__De(struct FText& Text); // Function U.U.BndEvt__TextBox_DropCount_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__De(HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Slider_136_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature(float Value); // Function U.U.BndEvt__Slider_136_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Close(); // Function U.U.Close(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_4_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_4_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_1_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_1_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Min_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Min_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Max_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Max_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Accept_K2Node_ComponentBoundEvent_7_Opup(); // Function U.U.BndEvt__Button_Accept_K2Node_ComponentBoundEvent_7_(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Accept(); // Function U.U.Accept(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown HorizontalBox_Rarity; // 0x250 (8)
	struct Unknown Image_bg; // 0x258 (8)
	struct Unknown Image_Icon; // 0x260 (8)
	struct Unknown T_Name; // 0x268 (8)
	struct Unknown T_WeaponType; // 0x270 (8)
	struct Unknown TextBlock_186; // 0x278 (8)
	struct Unknown Tooltip; // 0x280 (8)
	struct Unknown ItemInfo; // 0x288 (8)
	struct Unknown ItemDetailInfo; // 0x290 (1168)

	void SetRarity(); // Function U.U.SetRarity(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetHoverPosition(struct Unknown ViewportSize, struct Unknown MousePosition, struct Unknown HoverSize, struct Unknown& Out); // Function U.U.GetHoverPosition(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Init(struct Unknown ItemInfo); // Function U.U.Init(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_476BD37943992650800406AA289D7379(struct Unknown Loaded); // Function U.U.OnLoaded_476BD37943992650800406AA289D7379(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseLeave(struct Unknown& MouseEvent); // Function U.U.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadIcon(struct Unknown Icon); // Function U.U.AsyncLoadIcon(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown CurrentAccel; // 0x250 (12)
	struct Unknown TargetAccel; // 0x25C (12)
	struct Unknown CurrentCameraActor; // 0x268 (8)
	struct Unknown OldCameraLocation; // 0x270 (12)
	struct Unknown CurrentCameraLocation; // 0x27C (12)
	struct Unknown OriginCameraLocation; // 0x288 (12)
	struct Unknown TargetCameraLocation; // 0x294 (12)
	struct Unknown DataAsset; // 0x2A0 (8)
	char ResetOriginTransform : 0; // 0x2A8 (1)
	float BeginFocusDist; // 0x2AC (4)
	float EndFocusDist; // 0x2B0 (4)
	float CurrentFocusDist; // 0x2B4 (4)

	void UpdateMouseWheel(float Delta); // Function U.U.UpdateMouseWheel(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateMouseY(float Delta); // Function U.U.UpdateMouseY(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateMouseX(float Delta); // Function U.U.UpdateMouseX(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateCharacter(float DeltaTime); // Function U.U.UpdateCharacter(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateCamera(float DeltaTime); // Function U.U.UpdateCamera(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PercentDist(float CurDist, float& Percent); // Function U.U.PercentDist(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void MouseWheel(float Delta); // Function U.U.MouseWheel(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Reset(char ForceSnap); // Function U.U.Reset(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCameraActor(struct Unknown CurrentCamera, struct Unknown TargetCamera, float BeginFocusDist, float EndFocusDist); // Function U.U.SetCameraActor(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetLobbyWidget(struct Unknown& Widget); // Function U.U.GetLobbyWidget(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Hide(); // Function U.U.Hide(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Show(); // Function U.U.Show(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown RichTextBlock_52; // 0x250 (8)
	struct FText SetText; // 0x258 (24)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelReportUserCompletedWidget {

public:

	struct Unknown UberGraphFrame; // 0x250 (8)
	struct Unknown btn_confirm; // 0x258 (8)
	struct Unknown popup; // 0x260 (8)
	struct Unknown txt_description; // 0x268 (8)
	struct Unknown uw; // 0x270 (8)
	struct FText DescriptionText; // 0x278 (24)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PreConstruct(char IsDesignTime); // Function U.U.PreConstruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown AdministratorPanel; // 0x250 (8)
	struct Unknown Cheat; // 0x258 (8)
	struct Unknown Image_Lock; // 0x260 (8)
	struct Unknown Image_Version; // 0x268 (8)
	struct Unknown ReplayListItemBtn_; // 0x270 (8)
	struct Unknown TextBlock_BattleMode; // 0x278 (8)
	struct Unknown TextBlock_Day; // 0x280 (8)
	struct Unknown TextBlock_FileSize; // 0x288 (8)
	struct Unknown TextBlock_FPP; // 0x290 (8)
	struct Unknown TextBlock_MapName; // 0x298 (8)
	struct Unknown TextBlock_Month; // 0x2A0 (8)
	struct Unknown TextBlock_PlayerRank; // 0x2A8 (8)
	struct Unknown TextBlock_PlayTime; // 0x2B0 (8)
	struct Unknown TextBlock_Time; // 0x2B8 (8)
	struct Unknown TextBlock_TotalCount; // 0x2C0 (8)
	struct Unknown TextBlock_TotalPlayerCount; // 0x2C8 (8)
	struct Unknown TextBlock_Year; // 0x2D0 (8)
	struct FMulticastInlineDelegate Click; // 0x2D8 (16)
	struct Unknown ReplayItemInfo; // 0x2E8 (296)
	struct Unknown Style; // 0x410 (632)
	struct Unknown ReplayListWidget; // 0x688 (8)

	void GetBattleModeString(int32_t Idx, struct FText& Str); // Function U.U.GetBattleModeString(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetReportType(struct FText& Type); // Function U.U.GetReportType(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Clicked(); // Function U.U.Clicked(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateKeep(char State); // Function U.U.UpdateKeep(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RevertButtonStyle(); // Function U.U.RevertButtonStyle(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Init(struct Unknown ItemInfo, char Supported, struct Unknown ReplayListWidget); // Function U.U.Init(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ReplayListItemBtn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__ReplayListItemBtn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Click__DelegateSignature(struct Unknown ItemInfo); // Function U.U.Click__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Button_Tab; // 0x250 (8)
	struct Unknown Image_Check; // 0x258 (8)
	struct Unknown TextBlock_TabName; // 0x260 (8)
	struct Unknown BlackMarket_SubTab; // 0x268 (8)
	enum class Unknow TabType; // 0x270 (1)
	struct FText TabName; // 0x278 (24)
	struct FName TabIndex; // 0x290 (8)
	char Selected : 0; // 0x298 (1)

	struct Unknown Get_TextBlock_TabName_ColorAndOpacity_1(); // Function U.U.Get_TextBlock_TabName_ColorAndOpacity_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	enum class Unknow Get_Image_Check_Visibility_1(); // Function U.U.Get_Image_Check_Visibility_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Tab_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__Button_Tab_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelPersonalSupplyBoxWidget {

public:

	struct Unknown UberGraphFrame; // 0x3F8 (8)
	struct Unknown Ani_PadOn; // 0x400 (8)
	struct Unknown BG_Pad; // 0x408 (8)
	struct Unknown btn_PerkDeckEnabled; // 0x410 (8)
	struct Unknown Canvas_ChangeEnable; // 0x418 (8)
	struct Unknown CanvasPanel; // 0x420 (8)
	struct Unknown CanvasPanel_3; // 0x428 (8)
	struct Unknown ComboBoxString_237; // 0x430 (8)
	struct Unknown CurHaveGoldValue; // 0x438 (8)
	struct Unknown CurPriceText; // 0x440 (8)
	struct Unknown Down; // 0x448 (8)
	struct Unknown EquipBg; // 0x450 (8)
	struct Unknown Free; // 0x458 (8)
	struct Unknown GoldImage; // 0x460 (8)
	struct Unknown GoldImage_2; // 0x468 (8)
	struct Unknown GoldLack; // 0x470 (8)
	struct Unknown HaveWeaponText; // 0x478 (8)
	struct Unknown HorizontalBox_1; // 0x480 (8)
	struct Unknown Image; // 0x488 (8)
	struct Unknown Image_2; // 0x490 (8)
	struct Unknown Image_3; // 0x498 (8)
	struct Unknown Image_4; // 0x4A0 (8)
	struct Unknown Image_5; // 0x4A8 (8)
	struct Unknown Image_91; // 0x4B0 (8)
	struct Unknown Image_119; // 0x4B8 (8)
	struct Unknown Image_172; // 0x4C0 (8)
	struct Unknown Image_192; // 0x4C8 (8)
	struct Unknown Image_251; // 0x4D0 (8)
	struct Unknown Image_362; // 0x4D8 (8)
	struct Unknown Image_400; // 0x4E0 (8)
	struct Unknown Image_545; // 0x4E8 (8)
	struct Unknown Image_552; // 0x4F0 (8)
	struct Unknown Image_614; // 0x4F8 (8)
	struct Unknown Image_722; // 0x500 (8)
	struct Unknown Image_1025; // 0x508 (8)
	struct Unknown Image_1262; // 0x510 (8)
	struct Unknown ItemIcon; // 0x518 (8)
	struct Unknown Items_1Text; // 0x520 (8)
	struct Unknown ItemScroll; // 0x528 (8)
	struct Unknown ItemsText; // 0x530 (8)
	struct Unknown OkText; // 0x538 (8)
	struct Unknown Overlay_4; // 0x540 (8)
	struct Unknown Overlay_215; // 0x548 (8)
	struct Unknown PriceBg; // 0x550 (8)
	struct Unknown PriceBg_2; // 0x558 (8)
	struct Unknown PriceText; // 0x560 (8)
	struct Unknown PriceValue; // 0x568 (8)
	struct Unknown RichTextBlock; // 0x570 (8)
	struct Unknown RichTextBlock_74; // 0x578 (8)
	struct Unknown SizeBox_4; // 0x580 (8)
	struct Unknown SlotBg; // 0x588 (8)
	struct Unknown SortText; // 0x590 (8)
	struct Unknown SpecialWeaponText; // 0x598 (8)
	struct Unknown TextBlock_3; // 0x5A0 (8)
	struct Unknown Up; // 0x5A8 (8)
	struct Unknown U_2; // 0x5B0 (8)
	struct Unknown U_3; // 0x5B8 (8)
	struct Unknown U_4; // 0x5C0 (8)
	struct Unknown U_5; // 0x5C8 (8)
	struct Unknown U_6; // 0x5D0 (8)
	struct Unknown U_186; // 0x5D8 (8)
	struct Unknown U; // 0x5E0 (8)
	struct Unknown U; // 0x5E8 (8)
	struct Unknown VerticalBox_1; // 0x5F0 (8)
	struct Unknown WeaponScroll; // 0x5F8 (8)
	struct Unknown WidgetSwitcher_1; // 0x600 (8)
	struct TArray<Unknown> SortType; // 0x608 (16)
	struct TArray<Unknown> RarityList; // 0x618 (16)
	struct TMap<Unknown, Unknown> ComboxList; // 0x628 (80)
	struct FString SelectComboBox; // 0x678 (16)
	char IsShowAni : 0; // 0x688 (1)
	char IsFree : 0; // 0x689 (1)
	struct Unknown SaveSupplyItem; // 0x690 (256)
	int32_t CurOwnGold; // 0x790 (4)
	int32_t TotalPrice; // 0x794 (4)

	struct Unknown OnMouseButtonDown(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetEmptySlot(char& bRet, struct Unknown& Slot); // Function U.U.GetEmptySlot(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	char OnDrop(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function U.U.OnDrop(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetConsumableItemSlot(int32_t Index, struct Unknown& Widget); // Function U.U.GetConsumableItemSlot(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnGenerateWidget_2(struct FString Item); // Function U.U.OnGenerateWidget_2(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnGenerateWidget_1(struct FString Item); // Function U.U.OnGenerateWidget_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown CraeteWeaponItemSlots(); // Function U.U.CraeteWeaponItemSlots(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown CraeteConsumableItemSlots(); // Function U.U.CraeteConsumableItemSlots(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_PerkDeckEnabled_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__btn_PerkDeckEnabled_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ComboBoxString_236_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature(struct FString SelectedItem, char SelectionType); // Function U.U.BndEvt__ComboBoxString_236_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__ComboBoxString_236_K2Node_ComponentBoundEvent_3_OnOpeningEvent__Delegate(); // Function U.U.BndEvt__ComboBoxString_236_K2Node_ComponentBoundEvent_3_OnOpeningEvent__Delegate(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (struct Unknown ConsumalbeItemDat, int32_t SlotIndex); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetConsumableItemData(int32_t SlotIndex, struct Unknown& ConsumableItem, char SetEmpty); // Function U.U.SetConsumableItemData(Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Set(struct Unknown& WeaponItem, char IsDefaultWeapon); // Function U.U.Set(Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (struct Unknown WeaponData); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function U.U.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetTotalPrice(int32_t Price); // Function U.U.SetTotalPrice(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetFree(char IsFree, int32_t FreeCount); // Function U.U.SetFree(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetOwnGold(int32_t OwnGold); // Function U.U.SetOwnGold(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (char IsShow, struct Unknown Slot); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_PerkDeckEnabled_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__btn_PerkDeckEnabled_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_PerkDeckEnabled_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__btn_PerkDeckEnabled_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (char IsShow, struct Unknown Widget); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (enum class Unknow PrevState, enum class Unknow CurrentState); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Close(); // Function U.U.Close(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowConsumableSlotHoverEffect(char IsHover); // Function U.U.ShowConsumableSlotHoverEffect(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EquipSlot(struct Unknown Slot); // Function U.U.EquipSlot(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (struct Unknown Source, struct Unknown Target); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (struct Unknown Slot); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EquipWeaponSlot(struct Unknown Slot); // Function U.U.EquipWeaponSlot(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (struct Unknown Weapon); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetEnoughtGold(char IsEnought); // Function U.U.SetEnoughtGold(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown NewAnimation_2; // 0x250 (8)
	struct Unknown BackgroundBlur_1; // 0x258 (8)
	struct Unknown Blur; // 0x260 (8)
	struct Unknown CanvasPanel_1; // 0x268 (8)
	struct Unknown Focus; // 0x270 (8)
	struct Unknown FocusPanel; // 0x278 (8)
	struct Unknown Lobby; // 0x280 (8)
	struct Unknown U; // 0x288 (8)
	struct Unknown U; // 0x290 (8)
	struct Unknown U; // 0x298 (8)
	struct Unknown U; // 0x2A0 (8)
	struct Unknown U; // 0x2A8 (8)
	struct Unknown U; // 0x2B0 (8)
	struct Unknown NormalTextColor; // 0x2B8 (40)
	struct Unknown HoverTextColor; // 0x2E0 (40)
	struct Unknown LobbyWidgetRef; // 0x308 (8)
	struct Unknown NormalSelectedTextColor; // 0x310 (40)
	struct Unknown HoverSelectedTextColor; // 0x338 (40)
	struct Unknown NormalOptionButtonColor; // 0x360 (16)
	struct Unknown HoverOptionButtonColor; // 0x370 (16)
	struct Unknown MatchingPopupTimerHandle; // 0x380 (8)
	struct Unknown PopupKey; // 0x388 (24)
	char bExitPopupOpen : 0; // 0x3A0 (1)
	char bOptionPopupOpen : 0; // 0x3A1 (1)
	char BattleMode; // 0x3A2 (1)
	struct Unknown LobbyCoherentSprite; // 0x3A8 (8)
	struct Unknown SettingWidget; // 0x3B0 (8)
	struct Unknown LobbySound; // 0x3B8 (8)
	struct FString CurrentTab; // 0x3C0 (16)
	struct Unknown U; // 0x3D0 (8)
	struct Unknown LobbyCoherent2DTexture; // 0x3D8 (8)

	void EndCraft(); // Function U.U.EndCraft(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartCraft(struct Unknown& CraftWeapon); // Function U.U.StartCraft(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetHoverWidget(struct Unknown& U); // Function U.U.GetHoverWidget(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CreateHoverWidget(); // Function U.U.CreateHoverWidget(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangedArmoryTab(struct FString TabName); // Function U.U.OnChangedArmoryTab(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangedMainTab(struct FString TabName); // Function U.U.OnChangedMainTab(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateMouseWheel(float Delta); // Function U.U.UpdateMouseWheel(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateMouseY(float Delta); // Function U.U.UpdateMouseY(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateMouseX(float Delta); // Function U.U.UpdateMouseX(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void MatchFailedSound(); // Function U.U.MatchFailedSound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void MatchStartSound(); // Function U.U.MatchStartSound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowReplayList(); // Function U.U.ShowReplayList(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetArmoryInputBox(char Visible); // Function U.U.SetArmoryInputBox(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideSelectGameMode(); // Function U.U.HideSelectGameMode(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowSelectGameMode(); // Function U.U.ShowSelectGameMode(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideBlur(); // Function U.U.HideBlur(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowBlur(); // Function U.U.ShowBlur(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideUI(); // Function U.U.HideUI(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowArmoryUI(struct FString ArmoryResultName); // Function U.U.ShowArmoryUI(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckKeyUp(struct Unknown Input, char& bResult); // Function U.U.CheckKeyUp(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckKeyDown(struct Unknown Input, char& bResult); // Function U.U.CheckKeyDown(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ProcessInput(); // Function U.U.ProcessInput(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ClickExit(); // Function U.U.ClickExit(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ClickOption(); // Function U.U.ClickOption(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartGame(); // Function U.U.StartGame(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetMatchingPopup(); // Function U.U.ResetMatchingPopup(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetStartButton(); // Function U.U.ResetStartButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowMatchingStart(); // Function U.U.ShowMatchingStart(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideMatchingResult(); // Function U.U.HideMatchingResult(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowMatchingResult(int32_t ErrorCode, struct FString ExtraDescription); // Function U.U.ShowMatchingResult(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetLobbyWidget(struct Unknown LobbyWidget); // Function U.U.SetLobbyWidget(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UIButtonClickSound(); // Function U.U.UIButtonClickSound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UIButtonHoverSound(); // Function U.U.UIButtonHoverSound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnGenerateWidget_1(struct FString Item); // Function U.U.OnGenerateWidget_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__BT(); // Function U.U.BndEvt__BT(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CoherentBind(); // Function U.U.CoherentBind(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMatchingFailed(int32_t ErrorCode, struct FString ExtraDescription); // Function U.U.OnMatchingFailed(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayUIButtonClickSound(); // Function U.U.PlayUIButtonClickSound(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayUIBtuttonOverSound(); // Function U.U.PlayUIBtuttonOverSound(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Exit(); // Function U.U.Exit(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Option(); // Function U.U.Option(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void FinishLoadEvent(struct FString Path, char isMainFrame); // Function U.U.FinishLoadEvent(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (struct FString Path, char isMainFrame); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetReceiveInput(char ReceiveInput); // Function U.U.SetReceiveInput(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function U.U.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelAircraftRouteWidget {

public:

	struct Unknown UberGraphFrame; // 0x2B0 (8)
	struct Unknown Propeller1; // 0x2B8 (8)
	struct Unknown Aircraft; // 0x2C0 (8)
	struct Unknown Image_156; // 0x2C8 (8)
	struct Unknown Image_236; // 0x2D0 (8)
	struct Unknown Image_237; // 0x2D8 (8)
	struct Unknown MapCompRef; // 0x2E0 (8)

	void StopAirCraftAnimation(); // Function U.U.StopAirCraftAnimation(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateAirCraftScaleByMouseWheel(float Delta); // Function U.U.UpdateAirCraftScaleByMouseWheel(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartAirCraftAnimation(); // Function U.U.StartAirCraftAnimation(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateAircraftAngle(float Angle); // Function U.U.UpdateAircraftAngle(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown BGImage; // 0x250 (8)
	struct Unknown BorderImage; // 0x258 (8)
	struct Unknown DisableImage; // 0x260 (8)
	struct Unknown Image_177; // 0x268 (8)
	struct Unknown ItemCount; // 0x270 (8)
	struct Unknown ItemImage; // 0x278 (8)
	struct Unknown WidgetReference; // 0x280 (8)
	char Lock : 0; // 0x288 (1)
	enum class Unknow InventoryDragType; // 0x289 (1)
	struct Unknown ChangeTarget; // 0x290 (8)
	struct Unknown PlayerHUDRef; // 0x298 (8)

	void GetBravoHotelPlayerHUD(struct Unknown& NewParam); // Function U.U.GetBravoHotelPlayerHUD(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Init(struct Unknown Image, int32_t Count, char LockSlot, enum class Unknow DragType); // Function U.U.Init(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Disable(); // Function U.U.Disable(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Enable(); // Function U.U.Enable(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_CC3EA76649966C8AA6712791A8D413B0(struct Unknown Loaded); // Function U.U.OnLoaded_CC3EA76649966C8AA6712791A8D413B0(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void InitFromObjectRef(struct Unknown Icon, struct Unknown Icon, int32_t Count, char LockSlot, enum class Unknow DragType); // Function U.U.InitFromObjectRef(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function U.U.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown HorizontalBox_Rarity; // 0x248 (8)
	struct Unknown T_WeaponName; // 0x250 (8)

	void SetNameByID(int32_t ItemId); // Function U.U.SetNameByID(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetName(struct FText Name, int32_t Rarity); // Function U.U.SetName(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Button_Weapon; // 0x250 (8)
	struct Unknown HorizontalBox_Rarity; // 0x258 (8)
	struct Unknown Image_2; // 0x260 (8)
	struct Unknown Image_3; // 0x268 (8)
	struct Unknown Image_4; // 0x270 (8)
	struct Unknown Image_5; // 0x278 (8)
	struct Unknown Image_6; // 0x280 (8)
	struct Unknown Image_7; // 0x288 (8)
	struct Unknown Image_8; // 0x290 (8)
	struct Unknown Image_310; // 0x298 (8)
	struct Unknown Image_Item_Weapon; // 0x2A0 (8)
	struct Unknown Image_New; // 0x2A8 (8)
	struct Unknown T_Name; // 0x2B0 (8)
	struct Unknown WidgetSwitcher_Own; // 0x2B8 (8)
	struct Unknown ParentWidgetRef; // 0x2C0 (8)
	struct Unknown CraftingInfo; // 0x2C8 (296)
	struct TArray<Unknown> CraftMaterialItemIDList; // 0x3F0 (16)
	int32_t CraftMaterialWeaponID; // 0x400 (4)
	char IsOwn : 0; // 0x404 (1)
	char IsOwnAny : 0; // 0x405 (1)
	struct Unknown DefaultImage; // 0x408 (8)
	struct Unknown PressedDefaultImage; // 0x410 (8)
	char IsNew : 0; // 0x418 (1)

	void SetNew(char IsNew); // Function U.U.SetNew(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetButtonEnabled(char Enabled); // Function U.U.SetButtonEnabled(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void MakeCraftMaterialItemIDList(); // Function U.U.MakeCraftMaterialItemIDList(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckOwn(char& OutIsOwn, char& OutIsOwnAny); // Function U.U.CheckOwn(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Set(struct Unknown& CraftingInfo); // Function U.U.Set(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_01779F6241D23AEE08F8DCBEA1B49997(struct Unknown Loaded); // Function U.U.OnLoaded_01779F6241D23AEE08F8DCBEA1B49997(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadImg(struct Unknown Object); // Function U.U.AsyncLoadImg(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Weapon_K2Node_ComponentBoundEvent_0_(); // Function U.U.BndEvt__Button_Weapon_K2Node_ComponentBoundEvent_0_(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnClickedWeapon(); // Function U.U.OnClickedWeapon(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetButtonEnabled(); // Function U.U.ResetButtonEnabled(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__Button_Weapon_K2Node_ComponentBoundEvent_1_(); // Function U.U.BndEvt__Button_Weapon_K2Node_ComponentBoundEvent_1_(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Action; // 0x250 (8)
	struct Unknown Image_14; // 0x258 (8)
	struct Unknown LeftBtn; // 0x260 (8)
	struct Unknown MidBtn; // 0x268 (8)
	struct Unknown Mouse; // 0x270 (8)
	struct Unknown RightBtn; // 0x278 (8)
	struct Unknown ScaleBox_2; // 0x280 (8)
	struct Unknown SideDown; // 0x288 (8)
	struct Unknown SideUp; // 0x290 (8)
	struct Unknown Text_Action; // 0x298 (8)
	struct Unknown Text_Action_UsingAlphaBg; // 0x2A0 (8)
	struct Unknown Turn; // 0x2A8 (8)
	struct Unknown WheelDown; // 0x2B0 (8)
	struct Unknown WheelUp; // 0x2B8 (8)
	struct Unknown WidgetSwitcher_TextStyle; // 0x2C0 (8)
	struct Unknown X; // 0x2C8 (8)
	struct Unknown Y; // 0x2D0 (8)
	struct Unknown Temp; // 0x2D8 (8)
	char NewVar_1 : 0; // 0x2E0 (1)
	float DefalutScale; // 0x2E4 (4)

	void SetFontSize(int32_t Size); // Function U.U.SetFontSize(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetKeyNameFromKey(struct Unknown Key, struct FString& Name); // Function U.U.GetKeyNameFromKey(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Set(struct FName KeyString, struct Unknown InputKey); // Function U.U.Set(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void MK3DSpectatorPawn_Turn(); // Function U.U.MK3DSpectatorPawn_Turn(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Set(char Using); // Function U.U.Set(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Image_Buff; // 0x250 (8)
	struct Unknown Image_Grade_Color_Line; // 0x258 (8)
	struct Unknown ItemOption; // 0x260 (184)

	void SetItemOption(struct Unknown& ItemOption); // Function U.U.SetItemOption(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_6C8A793942B5F7D63CF7C5BA6F5F3753(struct Unknown Loaded); // Function U.U.OnLoaded_6C8A793942B5F7D63CF7C5BA6F5F3753(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadImg(struct Unknown Object); // Function U.U.AsyncLoadImg(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnMouseEnter(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Anim_HideKillAssist; // 0x250 (8)
	struct Unknown Anim_ShowAssist; // 0x258 (8)
	struct Unknown Anim_ShowKill; // 0x260 (8)
	struct Unknown T_AssistCount; // 0x268 (8)
	struct Unknown T_KillCount; // 0x270 (8)
	int32_t DefaultFontSize; // 0x278 (4)
	int32_t MiniFontSize; // 0x27C (4)
	char IsShowingKillCount : 0; // 0x280 (1)
	struct Unknown Timer_HideKillCountText; // 0x288 (8)
	float RemainTime; // 0x290 (4)

	void SetHideTimer(); // Function U.U.SetHideTimer(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateAssistTextSize(); // Function U.U.UpdateAssistTextSize(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowKillCount(char bIsKill, struct FText Text); // Function U.U.ShowKillCount(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void HideKillCountText(); // Function U.U.HideKillCountText(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnAnimationFinished(struct Unknown Animation); // Function U.U.OnAnimationFinished(BlueprintCosmetic|Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown VB_CoreList; // 0x250 (8)
	int32_t Max; // 0x258 (4)
	char bStartFromTop : 0; // 0x25C (1)
	char Alignment; // 0x25D (1)
	int32_t Set; // 0x260 (4)

	void CheckCanStackDamageLog(struct Unknown& DamageLogInfo, char& CanStack); // Function U.U.CheckCanStackDamageLog(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AddCoreInfoDamageLog(struct Unknown& DamageLogInfo); // Function U.U.AddCoreInfoDamageLog(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AddMyKillMessage(struct FText Message); // Function U.U.AddMyKillMessage(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AddCoreInfoRequestResuscitation(struct Unknown PlayerState); // Function U.U.AddCoreInfoRequestResuscitation(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AddRequestMessage(struct FText Message, struct Unknown PlayerState); // Function U.U.AddRequestMessage(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AddCoreInfoRouteping(struct Unknown PlayerState); // Function U.U.AddCoreInfoRouteping(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AddCoreInfoMessage(struct FText Message, struct FString Type); // Function U.U.AddCoreInfoMessage(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AddCoreInfoSmartping(struct Unknown PlayerState); // Function U.U.AddCoreInfoSmartping(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowNewWidget(float RemainTime, struct Unknown& CoreInfoItemWidget); // Function U.U.ShowNewWidget(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void InitChildCoreWidget(); // Function U.U.InitChildCoreWidget(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PreConstruct(char IsDesignTime); // Function U.U.PreConstruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelCompassUnitWidget {

public:

	struct Unknown InvalidationBox_1; // 0x250 (8)
	struct Unknown InvalidationBox_2; // 0x258 (8)
	struct Unknown SpecialText; // 0x260 (8)

	struct FText GetAngleText(int32_t Angle, char& IsNormal); // Function U.U.GetAngleText(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Initialize(float Direction, int32_t NormalDirectionFontSize, int32_t SpecialDirectionFontSize); // Function U.U.Initialize(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown MySeatColor; // 0x248 (16)
	struct Unknown WheelGroup; // 0x258 (8)
	struct Unknown SeatGroup; // 0x260 (8)

	void Setup(struct Unknown VehicleInstance); // Function U.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowSeatIcon(int32_t SeatIndex, char bShow, char bIsMine); // Function U.U.ShowSeatIcon(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ShowWreckedWheelIcon(int32_t WheelIndex, char bShow); // Function U.U.ShowWreckedWheelIcon(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Anim_KillMessage; // 0x250 (8)
	struct Unknown Anim_RemoveCoreInfo; // 0x258 (8)
	struct Unknown Anim_AddCoreInfo; // 0x260 (8)
	struct Unknown HB_Smartping; // 0x268 (8)
	struct Unknown Img_Back; // 0x270 (8)
	struct Unknown Img_Back_2; // 0x278 (8)
	struct Unknown Img_MarkerIcon; // 0x280 (8)
	struct Unknown Img_PerkDeckIcon; // 0x288 (8)
	struct Unknown NewRichText; // 0x290 (8)
	struct Unknown T_Damage; // 0x298 (8)
	struct Unknown T_DamageCauser; // 0x2A0 (8)
	struct Unknown T_DamageResult; // 0x2A8 (8)
	struct Unknown T_HeadShot; // 0x2B0 (8)
	struct Unknown T_HitCount; // 0x2B8 (8)
	struct Unknown T_HitType; // 0x2C0 (8)
	struct Unknown T_Message; // 0x2C8 (8)
	struct Unknown T_PingType; // 0x2D0 (8)
	struct Unknown T_PlayerName; // 0x2D8 (8)
	struct Unknown T_TargetClass; // 0x2E0 (8)
	struct Unknown T_TargetLevel; // 0x2E8 (8)
	struct Unknown T_TargetName; // 0x2F0 (8)
	struct Unknown T_TargetWeapon; // 0x2F8 (8)
	struct Unknown T_WeaponLevel; // 0x300 (8)
	struct Unknown WidgetSwitcher_194; // 0x308 (8)
	struct Unknown WidgetSwitcher_Main; // 0x310 (8)
	struct Unknown ParentWidgetRef; // 0x318 (8)
	struct Unknown Timer_StartRemove; // 0x320 (8)
	struct Unknown DamageLogInfo; // 0x328 (2904)
	float LogTime; // 0xE80 (4)
	float LogStackValidTime; // 0xE84 (4)

	void DamageResultText(struct FText& Result); // Function U.U.DamageResultText(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void DamageText(struct FText& Result); // Function U.U.DamageText(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void WeaponText(struct FText& Result); // Function U.U.WeaponText(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void TargetText(struct FText& Result); // Function U.U.TargetText(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StackDamageLog(struct Unknown& DamageLogInfo); // Function U.U.StackDamageLog(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckCanStackDamage(struct Unknown& DamageLogInfo, char& CanStack); // Function U.U.CheckCanStackDamage(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetHitDamageLogInfo(struct Unknown& DamageLogInfo); // Function U.U.SetHitDamageLogInfo(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCoreInfoKillMessage(struct FText Message); // Function U.U.SetCoreInfoKillMessage(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCoreInfoMessageType(struct FString Type); // Function U.U.SetCoreInfoMessageType(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetResuscitationPingInfo(); // Function U.U.SetResuscitationPingInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCoreInfoResuscitation(struct Unknown PlayerState); // Function U.U.SetCoreInfoResuscitation(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRequestMessageInfo(struct Unknown PlayerState, struct FText Message); // Function U.U.SetRequestMessageInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRequestMessage(struct Unknown Player, struct FText Message); // Function U.U.SetRequestMessage(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRoutePingInfo(); // Function U.U.SetRoutePingInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCoreInfoRoutePing(struct Unknown PlayerState); // Function U.U.SetCoreInfoRoutePing(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCoreInfoMessage(struct FText Message, struct FString Type); // Function U.U.SetCoreInfoMessage(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetRemoveTimer(float RemainTime); // Function U.U.SetRemoveTimer(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPlayerInfo(struct Unknown PlayerState); // Function U.U.SetPlayerInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetPingType(struct Unknown PingInfo); // Function U.U.SetPingType(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetCoreInfoSmartping(struct Unknown PlayerState); // Function U.U.SetCoreInfoSmartping(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnAnimationFinished(struct Unknown Animation); // Function U.U.OnAnimationFinished(BlueprintCosmetic|Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayAddCoreInfoAnim(); // Function U.U.PlayAddCoreInfoAnim(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayKillMessageAnim(); // Function U.U.PlayKillMessageAnim(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartRemove(); // Function U.U.StartRemove(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Level_Up_New; // 0x250 (8)
	struct Unknown VSkill_Motion; // 0x258 (8)
	struct Unknown FinalitySkill_Motion; // 0x260 (8)
	struct Unknown LEVEL_UP; // 0x268 (8)
	struct Unknown CanvasPanel_294; // 0x270 (8)
	struct Unknown FSkill_Info; // 0x278 (8)
	struct Unknown FSkill_Title; // 0x280 (8)
	struct Unknown HorizontalBox_290; // 0x288 (8)
	struct Unknown Image_1; // 0x290 (8)
	struct Unknown Image_2; // 0x298 (8)
	struct Unknown Image_4; // 0x2A0 (8)
	struct Unknown Image_5; // 0x2A8 (8)
	struct Unknown Image_6; // 0x2B0 (8)
	struct Unknown Image_9; // 0x2B8 (8)
	struct Unknown Image_10; // 0x2C0 (8)
	struct Unknown Image_245; // 0x2C8 (8)
	struct Unknown Image_247; // 0x2D0 (8)
	struct Unknown Image_413; // 0x2D8 (8)
	struct Unknown Image_458; // 0x2E0 (8)
	struct Unknown Image_602; // 0x2E8 (8)
	struct Unknown Image_UltimateGetMat; // 0x2F0 (8)
	struct Unknown IMG_FinalitySkill; // 0x2F8 (8)
	struct Unknown Img_UltimateMaterial; // 0x300 (8)
	struct Unknown Light; // 0x308 (8)
	struct Unknown T_Desc; // 0x310 (8)
	struct Unknown T_Level; // 0x318 (8)
	struct Unknown T_PerkName; // 0x320 (8)
	struct Unknown TextBlock_LevelUpNewText; // 0x328 (8)
	struct Unknown U; // 0x330 (8)
	struct Unknown U; // 0x338 (8)
	struct Unknown VSkill_Info; // 0x340 (8)
	struct Unknown VSkill_Titile; // 0x348 (8)
	struct Unknown VSkillThumbStroke_02; // 0x350 (8)
	struct Unknown WidgetSwitcher_LevelUpInfo; // 0x358 (8)
	struct Unknown Handle_LevelUpEffect; // 0x360 (8)
	float EffectDelay; // 0x368 (4)
	struct TArray<Unknown> PerkInfoQue; // 0x370 (16)
	struct Unknown CurrentPerkInfo; // 0x380 (44)
	struct TArray<Unknown> PerkLevelUpInfo; // 0x3B0 (16)
	struct Unknown PerkLevelUpData; // 0x3C0 (376)
	struct Unknown CurrentPerkData; // 0x538 (224)
	int32_t CurrentLevel; // 0x618 (4)
	char IsAlreadyUnlockedUltimate : 0; // 0x61C (1)
	char CurrentLevelUpInfo; // 0x61D (1)
	struct TArray<Unknown> CurrentLevelQue; // 0x620 (16)
	float CurrentUltimateMaterialValue; // 0x630 (4)
	char UltimateUpdate : 0; // 0x634 (1)
	struct Unknown UltimateMaterialInstance; // 0x638 (8)
	float UltimateAnimTime; // 0x640 (4)
	struct Unknown UltimateGetMaterialInstance; // 0x648 (8)

	void SequenceEvent__ENTRYPOINTU_4(struct Unknown Image_365); // Function U.U.SequenceEvent__ENTRYPOINTU_4(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_3(); // Function U.U.SequenceEvent__ENTRYPOINTU_3(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_2(); // Function U.U.SequenceEvent__ENTRYPOINTU_2(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SequenceEvent__ENTRYPOINTU_1(); // Function U.U.SequenceEvent__ENTRYPOINTU_1(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetInfos(); // Function U.U.ResetInfos(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayLevelAndUtimate(int32_t Level, char bUltimate); // Function U.U.PlayLevelAndUtimate(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	enum class Unknow GetVisibility_2(); // Function U.U.GetVisibility_2(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	enum class Unknow GetVisibility_1(); // Function U.U.GetVisibility_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void RemoveAllEffects(); // Function U.U.RemoveAllEffects(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayLevelUpSound(); // Function U.U.PlayLevelUpSound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayCharacterLevelUpEffect(); // Function U.U.PlayCharacterLevelUpEffect(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CheckUltimateSkill(); // Function U.U.CheckUltimateSkill(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown Get_FinalitySkillThumb_Brush_1(); // Function U.U.Get_FinalitySkillThumb_Brush_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct FText Get_FSkill_Info_Text_1(); // Function U.U.Get_FSkill_Info_Text_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct FText Get_FSkill_Title_Text_1(); // Function U.U.Get_FSkill_Title_Text_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct FText Get_T_Desc_Text_1(); // Function U.U.Get_T_Desc_Text_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct FText Get_T_PerkName_Text_1(); // Function U.U.Get_T_PerkName_Text_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct FText GetText_1(); // Function U.U.GetText_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayUltimateSkillAnimation(); // Function U.U.PlayUltimateSkillAnimation(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlaySkillUnlockAnimation(); // Function U.U.PlaySkillUnlockAnimation(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayLevelUpAnimation(); // Function U.U.PlayLevelUpAnimation(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsOverUltimateLevel(char& IsUltimate); // Function U.U.IsOverUltimateLevel(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void LevelUpEffect(); // Function U.U.LevelUpEffect(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartLevelUpEffect(); // Function U.U.StartLevelUpEffect(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AddToQue(struct Unknown PerkInfo, int32_t CurrentLevel); // Function U.U.AddToQue(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayLevelUpPopup(struct Unknown PerkInfo, int32_t CurrentLevel); // Function U.U.PlayLevelUpPopup(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartUltimateUpdate(struct Unknown Image_365); // Function U.U.StartUltimateUpdate(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ResetUltimateUpdate(); // Function U.U.ResetUltimateUpdate(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnAnimationFinished(struct Unknown Animation); // Function U.U.OnAnimationFinished(BlueprintCosmetic|Event|Protected|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void UpdateUltimateMaterial(); // Function U.U.UpdateUltimateMaterial(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Image_350; // 0x250 (8)
	struct Unknown Image_585; // 0x258 (8)
	struct Unknown Image_Grade_Color_Line; // 0x260 (8)

	void SetBuffInfo(struct FText BuffName, struct FText Desc, struct Unknown Icon, int32_t Rarity); // Function U.U.SetBuffInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_F9A8A8FB4318139B3972C6ACB5BBA1D9(struct Unknown Loaded); // Function U.U.OnLoaded_F9A8A8FB4318139B3972C6ACB5BBA1D9(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadIconTexture(struct Unknown IconTexture); // Function U.U.AsyncLoadIconTexture(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown EnemySkull; // 0x250 (8)
	struct Unknown Image_436; // 0x258 (8)
	struct Unknown Pawn; // 0x260 (8)

	void SetDiedPawnInfo(struct Unknown BroadCastInfo); // Function U.U.SetDiedPawnInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function U.U.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartAnim(); // Function U.U.StartAnim(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StartSetPosition(); // Function U.U.StartSetPosition(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelAttackDamageWidget {

public:

	struct Unknown FadeOut; // 0x3A0 (8)
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelPopupWidget {

public:

	struct Unknown UberGraphFrame; // 0x268 (8)
	struct Unknown Bg; // 0x270 (8)
	struct Unknown btn_Cancel; // 0x278 (8)
	struct Unknown btn_OK; // 0x280 (8)
	struct Unknown Desc; // 0x288 (8)
	struct Unknown Image_2; // 0x290 (8)
	struct Unknown Overlay; // 0x298 (8)
	struct Unknown Overlay_1; // 0x2A0 (8)
	struct Unknown Overlay_2; // 0x2A8 (8)
	struct Unknown RichTextBlock_244; // 0x2B0 (8)
	struct Unknown TextBlock_17; // 0x2B8 (8)
	struct Unknown Throbber_159; // 0x2C0 (8)
	struct Unknown Title; // 0x2C8 (8)
	struct Unknown WidgetSwitcher_1; // 0x2D0 (8)
	struct FName MapNameToExit; // 0x2D8 (8)
	char IsExitGame : 0; // 0x2E0 (1)
	struct Unknown ControllerRef; // 0x2E8 (8)
	char IsTutorial : 0; // 0x2F0 (1)
	char IsDeathCam : 0; // 0x2F1 (1)
	struct FMulticastInlineDelegate EventDispatcher_Mov; // 0x2F8 (16)
	char ErrorType : 0; // 0x308 (1)
	char IsPerkDeckSelectMode : 0; // 0x309 (1)
	struct FMulticastInlineDelegate EventDispatcher_TrySelect; // 0x310 (16)
	char OkayType : 0; // 0x320 (1)

	void SetOptionChangedFromBenchmark(); // Function U.U.SetOptionChangedFromBenchmark(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PerkDeckSelectMode(); // Function U.U.PerkDeckSelectMode(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsStartedGame(char& bRet); // Function U.U.IsStartedGame(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void IsSoloPlay(char& bRet); // Function U.U.IsSoloPlay(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetMessage(int32_t ErrorCode, struct FString ErrorID, struct FString Param, struct FString& Title, struct FString& Desc); // Function U.U.GetMessage(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EnterDeathCam(char IsWinningCam, char IsTargetCameraKiller); // Function U.U.EnterDeathCam(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EnterWindow(); // Function U.U.EnterWindow(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void GetMyTeamAlive(char& ALIVE); // Function U.U.GetMyTeamAlive(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EnterLobby(); // Function U.U.EnterLobby(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnMouseWheel(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseWheel(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	struct Unknown OnMouseButtonDown(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function U.U.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_OK_K2Node_ComponentBoundEvent_35_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__btn_OK_K2Node_ComponentBoundEvent_35_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_Cancel_K2Node_ComponentBoundEvent_53_OnButtonClickedEvent__DelegateSignature(); // Function U.U.BndEvt__btn_Cancel_K2Node_ComponentBoundEvent_53_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_OK_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(); // Function U.U.BndEvt__btn_OK_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void BndEvt__btn_Cancel_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignatu(); // Function U.U.BndEvt__btn_Cancel_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignatu(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void PlayerLogout(); // Function U.U.PlayerLogout(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void LeaveGame(); // Function U.U.LeaveGame(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnChangedFinalRankDelegate_Event(); // Function U.U.OnChangedFinalRankDelegate_Event(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void FinalResult_Internal(); // Function U.U.FinalResult_Internal(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void MoveLobby(); // Function U.U.MoveLobby(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Show_2(); // Function U.U.Show_2(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Hide_2(); // Function U.U.Hide_2(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetMessageEx(int32_t ErrorIdx, struct FString ErrorID, struct FString Parameter, char bConfirm, char bCancel, char bWaiting, struct Unknown& evt); // Function U.U.SetMessageEx(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void QuitGame(float DelayTime); // Function U.U.QuitGame(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void Destruct(); // Function U.U.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EventDispatcher_TrySelect(); // Function U.U.EventDispatcher_TrySelectMidget(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void EventDispatcher_Mov(); // Function U.U.EventDispatcher_Mov(Public|Delegate|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UBravoHotelAttackUserWidget {

public:

	struct Unknown Enemy_Lv_Motion_FadeOut_Inert; // 0x2A0 (8)
	struct Unknown Enemy_Lv_Motion_FadeIn_Inert; // 0x2A8 (8)
	struct Unknown FadeOut; // 0x2B0 (8)
	struct Unknown Enemy_Inert; // 0x2B8 (8)
	struct Unknown HorizontalBox_1; // 0x2C0 (8)
	struct Unknown HorizontalBox_2; // 0x2C8 (8)
	struct Unknown Image_2; // 0x2D0 (8)
	struct Unknown Image_145; // 0x2D8 (8)
	struct Unknown Overlay_2; // 0x2E0 (8)
	struct Unknown Overlay_98; // 0x2E8 (8)
	struct Unknown Pawn; // 0x2F0 (8)
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Ani_Gold; // 0x250 (8)
	struct Unknown 1; // 0x258 (8)
	struct Unknown 10; // 0x260 (8)
	struct Unknown 100; // 0x268 (8)
	struct Unknown 1000; // 0x270 (8)
	struct Unknown BonusBG; // 0x278 (8)
	struct Unknown BrightSpot_01; // 0x280 (8)
	struct Unknown BrightSpot_02; // 0x288 (8)
	struct Unknown BrightSpot_03; // 0x290 (8)
	struct Unknown BrightSpot_04; // 0x298 (8)
	struct Unknown BrightSpot_05; // 0x2A0 (8)
	struct Unknown Empty; // 0x2A8 (8)
	struct Unknown Glow_01; // 0x2B0 (8)
	struct Unknown Gold; // 0x2B8 (8)
	struct Unknown Image_7; // 0x2C0 (8)
	struct Unknown Image_11; // 0x2C8 (8)
	struct Unknown Image_14; // 0x2D0 (8)
	struct Unknown Image_15; // 0x2D8 (8)
	struct Unknown Image_16; // 0x2E0 (8)
	struct Unknown Image_17; // 0x2E8 (8)
	struct Unknown Image_18; // 0x2F0 (8)
	struct Unknown Image_20; // 0x2F8 (8)
	struct Unknown Image_21; // 0x300 (8)
	struct Unknown Image_22; // 0x308 (8)
	struct Unknown Image_23; // 0x310 (8)
	struct Unknown Image_335; // 0x318 (8)
	struct Unknown Image_1473; // 0x320 (8)
	struct Unknown Light; // 0x328 (8)
	struct Unknown Light_01; // 0x330 (8)
	struct Unknown Light_02; // 0x338 (8)
	struct Unknown Light_03; // 0x340 (8)
	struct Unknown Light_04; // 0x348 (8)
	struct Unknown Light_05; // 0x350 (8)
	struct Unknown Light_06; // 0x358 (8)
	struct Unknown PickUpGold; // 0x360 (8)
	struct Unknown RIng_Glow_01; // 0x368 (8)
	struct Unknown TextBlock_4; // 0x370 (8)
	struct Unknown TextLight_2; // 0x378 (8)
	struct Unknown TextLight_3; // 0x380 (8)
	int32_t Save; // 0x388 (4)
	char NewVar_1 : 0; // 0x38C (1)
	char IsStopSound : 0; // 0x38D (1)
	float LoopSountStartTime; // 0x390 (4)
	struct Unknown LoopSound; // 0x394 (4)
	float LoopSountEndTime; // 0x398 (4)
	float 1StartTime; // 0x39C (4)
	float 10StartTime; // 0x3A0 (4)
	float 100StartTime; // 0x3A4 (4)
	float 1000StartTime; // 0x3A8 (4)
	float FinStartTime; // 0x3AC (4)

	void Divide(int32_t Value1, int32_t& RetS1, int32_t& RetS2); // Function U.U.Divide(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void StopSound(); // Function U.U.StopSound(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent(); // Function U.U.CustomEvent(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent_2(); // Function U.U.CustomEvent_2(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent_3(); // Function U.U.CustomEvent_3(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent_4(); // Function U.U.CustomEvent_4(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void SetGold(int32_t AddGold, int32_t GetGold); // Function U.U.SetGold(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void CustomEvent_5(); // Function U.U.CustomEvent_5(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void (); // Function U.U.(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Image_350; // 0x250 (8)
	struct Unknown Image_585; // 0x258 (8)
	struct Unknown Image_Grade_Color_Line; // 0x260 (8)
	struct Unknown TextBlock_445; // 0x268 (8)

	void SetBuffInfo(struct FText BuffName, struct FText Desc, struct Unknown Icon, int32_t Rarity); // Function U.U.SetBuffInfo(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void OnLoaded_EBF7B6BF4C04ABB8FF3715B4F6A51AD1(struct Unknown Loaded); // Function U.U.OnLoaded_EBF7B6BF4C04ABB8FF3715B4F6A51AD1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void AsyncLoadIconTexture(struct Unknown IconTexture); // Function U.U.AsyncLoadIconTexture(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
	void ExecuteUbergraph_U(int32_t EntryPoint); // Function U.U.ExecuteUbergraph_U(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x23B3180>
};

// WidgetBlueprintGeneratedClass U.U
class UU : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown FadeIn3; // 0x250 (8)
	struct Unknown FadeIn2; // 0x258 (8)
	struct Unknown RankDown; // 0x260 (8)
	struct Unknown RankUp; // 0x268 (8)
	struct Unknown FadeOut; // 0x270 (8)
	struct Unknown FadeIn; // 0x278 (8)
	struct Unknown Button_DeathCam; // 0x280 (8)
	struct Unknown Button_Exit; // 0x288 (8)
	struct Unknown Button_Report; // 0x290 (8)
	struct Unknown Button_Spectate; // 0x298 (8)
	struct Unknown Image; // 0x2A0 (8)
	struct Unknown Image_2; // 0x2A8 (8)
	struct Unknown Image_3; // 0x2B0 (8)
	struct Unknown Image_4; // 0x2B8 (8)
	struct Unknown Image_5; // 0x2C0 (8)
	struct Unknown Image_6; // 0x2C8 (8)
	struct Unknown Image_7; // 0x2D0 (8)
	struct Unknown Image_8; // 0x2D8 (8)
	struct Unknown Image_135; // 0x2E0 (8)
	struct Unknown Image_149; // 0x2E8 (8)
	struct Unknown Image_239; // 0x2F0 (8)
	struct Unknown Image_314; // 0x2F8 (8)
	struct Unknown Image_377; // 0x300 (8)
	struct Unknown Image_444; // 0x308 (8)
	struct Unknown Image_477; // 0x310 (8)
	struct Unknown Image_518; // 0x318 (8)
	struct Unknown Image_531; // 0x320 (8)
	struct Unknown Image_745; // 0x328 (8)
	struct Unknown Image_992; // 0x330 (8)
	struct Unknown Image_1373; // 0x338 (8)
	struct Unknown Image_1459; // 0x340 (8)
	struct Unknown Image_1506; // 0x348 (8)
	struct Unknown Image_1508; // 0x350 (8)
	struct Unknown Image_1925; // 0x358 (8)
	struct Unknown Image_NextTireIcon; // 0x360 (8)
	struct Unknown Light_01; // 0x368 (8)
	struct Unknown Light_02; // 0x370 (8)
	struct Unknown Light_03; // 0x378 (8)
	struct Unknown Light_04; // 0x380 (8)
	struct Unknown Light_05; // 0x388 (8)
	struct Unknown Light_06; // 0x390 (8)
	struct Unknown Light_07; // 0x398 (8)
	struct Unknown Light_08; // 0x3A0 (8)
	struct Unknown Overlay_Rank; // 0x3A8 (8)
	struct Unknown Overlay_Report; // 0x3B0 (8)
	struct Unknown Overlay_Spectate; // 0x3B8 (8)
	struct Unknown ProgressBar_Current; // 0x3C0 (8)
	struct Unknown ProgressBar_Down; // 0x3C8 (8)
	struct Unknown ProgressBar_Up; // 0x3D0 (8)
	struct Unknown ScrollBox_GoldList; // 0x3D8 (8)
