// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Image_73; //  0x250 Size(8)
	Unknown KeyImageWidget; //  0x258 Size(8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Anim_OnFire; //  0x250 Size(8)
	Unknown FireLine; //  0x258 Size(8)

	void SetLineInfo(float Angle, float Length); // Function U.U.SetLineInfo(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelScopeWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Image_1; //  0x250 Size(8)

	void SetScopeImageAngle(float NewAngle); // Function U.U.SetScopeImageAngle(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Cont; //  0x250 Size(8)
	Unknown DropHoverImage; //  0x258 Size(8)
	Unknown EmptyImage; //  0x260 Size(8)
	Unknown EquipImage; //  0x268 Size(8)
	Unknown HoverImage2; //  0x270 Size(8)
	Unknown ItemImage; //  0x278 Size(8)
	Unknown WidgetSwitcher_2; //  0x280 Size(8)
	int32_t Index; //  0x288 Size(4)
	struct FMulticastInlineDelegate OnDropEventDispatcher; //  0x290 Size(10)
	Unknown Data; //  0x2a0 Size(100)
	Unknown DraggedWidget; //  0x3a0 Size(8)
	char IsEmpty; //  0x3a8 Size(1)
	struct FMulticastInlineDelegate ShowToolTipEventDispatcher; //  0x3b0 Size(10)
	struct FMulticastInlineDelegate OnChangeSlotEventDispatcher; //  0x3c0 Size(10)
	struct FMulticastInlineDelegate OnRightClickEventDispatcher; //  0x3d0 Size(10)
	Unknown SaveKey; //  0x3e0 Size(18)
	int32_t ClickNum; //  0x3f8 Size(4)

	Unknown OnMouseButtonUp(Unknown MyGeometry, Unknown& MouseEvent); // Function U.U.OnMouseButtonUp(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelKillInfoWidget {
	Unknown UberGraphFrame; //  0x2c0 Size(8)
	Unknown KillMessageList; //  0x2c8 Size(8)
	Unknown U; //  0x2d0 Size(8)
	Unknown U_2; //  0x2d8 Size(8)
	Unknown U_3; //  0x2e0 Size(8)
	Unknown U_4; //  0x2e8 Size(8)
	Unknown U_5; //  0x2f0 Size(8)
	Unknown U_6; //  0x2f8 Size(8)
	Unknown U_7; //  0x300 Size(8)
	Unknown U_8; //  0x308 Size(8)
	Unknown U_9; //  0x310 Size(8)
	Unknown U_10; //  0x318 Size(8)
	Unknown TmpInfoList; //  0x320 Size(10)

	void AddKillMessage(Unknown& BroadCastInfo); // Function U.U.AddKillMessage(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Anim_Show_classinfo; //  0x250 Size(8)
	Unknown Button_SpreadList; //  0x258 Size(8)
	Unknown Image_323; //  0x260 Size(8)
	Unknown U; //  0x268 Size(8)
	Unknown U_2; //  0x270 Size(8)
	Unknown U_3; //  0x278 Size(8)
	Unknown U_4; //  0x280 Size(8)
	Unknown U_5; //  0x288 Size(8)
	Unknown U_6; //  0x290 Size(8)
	Unknown U_7; //  0x298 Size(8)
	Unknown U_8; //  0x2a0 Size(8)
	Unknown U_9; //  0x2a8 Size(8)
	Unknown U_10; //  0x2b0 Size(8)
	Unknown U_11; //  0x2b8 Size(8)
	Unknown U_12; //  0x2c0 Size(8)
	Unknown VerticalBox_ClassBox; //  0x2c8 Size(8)
	Unknown VerticalBox_ClassList; //  0x2d0 Size(8)
	Unknown VerticalBox_Description; //  0x2d8 Size(8)
	Unknown VerticalBox_Main; //  0x2e0 Size(8)
	int32_t LastTableRow; //  0x2e8 Size(4)
	Unknown ClassInfoItemMap; //  0x2f0 Size(50)
	char ListVisibility; //  0x340 Size(1)

	void UpdateClassCount(); // Function U.U.UpdateClassCount(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelGameBuffSlot {
	Unknown Image_1294; //  0x2f8 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Button; //  0x250 Size(8)
	Unknown Button_Text; //  0x258 Size(8)
	Unknown Overlay_Button; //  0x260 Size(8)
	struct FText ButtonText; //  0x268 Size(18)
	struct FMulticastInlineDelegate OnClicked; //  0x280 Size(10)
	struct FMulticastInlineDelegate OnPressed; //  0x290 Size(10)
	struct FMulticastInlineDelegate OnReleased; //  0x2a0 Size(10)
	struct FMulticastInlineDelegate OnHovered; //  0x2b0 Size(10)

	void BndEvt__Button_K2Node_Compo(); // Function U.U.BndEvt__Button_K2Node_Compo(BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x2a0 Size(8)
	Unknown VisualBorder; //  0x2a8 Size(8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Infos_ani; //  0x250 Size(8)
	Unknown SimpleResult_Events; //  0x258 Size(8)
	Unknown Lose_ani; //  0x260 Size(8)
	Unknown Win_ani; //  0x268 Size(8)
	Unknown Lose_Events; //  0x270 Size(8)
	Unknown Win_Events; //  0x278 Size(8)
	Unknown ClassName; //  0x280 Size(8)
	Unknown ClassWeaponName; //  0x288 Size(8)
	Unknown HeadShot; //  0x290 Size(8)
	Unknown HorizontalBox_KillerWeaponInfo; //  0x298 Size(8)
	Unknown HorizontalBox_Rarity; //  0x2a0 Size(8)
	Unknown Icon_KillerClass; //  0x2a8 Size(8)
	Unknown Image_894; //  0x2b0 Size(8)
	Unknown Image_2002; //  0x2b8 Size(8)
	Unknown Level; //  0x2c0 Size(8)
	Unknown LoseMessage; //  0x2c8 Size(8)
	Unknown Overlay_DropItems; //  0x2d0 Size(8)
	Unknown Overlay_KillerInfo; //  0x2d8 Size(8)
	Unknown Overlay_WeaponLevel; //  0x2e0 Size(8)
	Unknown T_DamageType; //  0x2e8 Size(8)
	Unknown T_WeaponLevel; //  0x2f0 Size(8)
	Unknown TextBlock_ItemCount; //  0x2f8 Size(8)
	Unknown Uniform_ItemList; //  0x300 Size(8)
	Unknown UserName; //  0x308 Size(8)
	Unknown U_1; //  0x310 Size(8)
	Unknown U; //  0x318 Size(8)
	Unknown WeaponName; //  0x320 Size(8)
	Unknown WidgetSwitcher_DamageCauser; //  0x328 Size(8)
	Unknown AnimationData; //  0x330 Size(2)
	Unknown MatchEndWidgetRef; //  0x338 Size(8)
	Unknown SimpleResult; //  0x340 Size(a8)
	char MatchEnd; //  0x3e8 Size(1)

	void SequenceEvent__ENTRYPOINTU_10(); // Function U.U.SequenceEvent__ENTRYPOINTU_10(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown Ani_Complete; //  0x248 Size(8)
	Unknown Ani_BG; //  0x250 Size(8)
	Unknown Bg; //  0x258 Size(8)
	Unknown Complete; //  0x260 Size(8)
	Unknown TextBlock_QuestDesc; //  0x268 Size(8)
	Unknown TextBlock_QuestTitle; //  0x270 Size(8)
	Unknown U; //  0x278 Size(8)
	Unknown U; //  0x280 Size(8)
	Unknown U_2; //  0x288 Size(8)
	Unknown U_3; //  0x290 Size(8)
	Unknown TaskInfo; //  0x298 Size(20)
	Unknown TaskData; //  0x2b8 Size(b0)

	void SetTaskInfo(Unknown TaskInfo); // Function U.U.SetTaskInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelScopeWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown CanvasPanel_1; //  0x250 Size(8)
	Unknown Image; //  0x258 Size(8)
	Unknown Image_2; //  0x260 Size(8)
	Unknown Image_3; //  0x268 Size(8)
	Unknown Image_4; //  0x270 Size(8)
	Unknown Image_5; //  0x278 Size(8)
	Unknown Image_6; //  0x280 Size(8)
	Unknown Image_7; //  0x288 Size(8)
	Unknown Image_8; //  0x290 Size(8)
	Unknown Image_9; //  0x298 Size(8)
	Unknown Image_10; //  0x2a0 Size(8)
	Unknown Image_11; //  0x2a8 Size(8)
	Unknown Image_12; //  0x2b0 Size(8)
	Unknown Image_13; //  0x2b8 Size(8)
	Unknown Image_14; //  0x2c0 Size(8)
	Unknown Image_15; //  0x2c8 Size(8)
	Unknown Image_16; //  0x2d0 Size(8)
	Unknown Image_17; //  0x2d8 Size(8)
	Unknown Image_18; //  0x2e0 Size(8)
	Unknown Image_47; //  0x2e8 Size(8)
	Unknown ScaleBox4X_5mm; //  0x2f0 Size(8)
	Unknown ScaleBox4X_7mm; //  0x2f8 Size(8)
	Unknown ScaleBox4X_SR; //  0x300 Size(8)
	Unknown WidgetSwitcher_167; //  0x308 Size(8)
	Unknown NewVar_1; //  0x310 Size(8)

	void SetScopeImageAngle(float NewAngle); // Function U.U.SetScopeImageAngle(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Button_306; //  0x250 Size(8)
	Unknown CanvasPanel_Line; //  0x258 Size(8)
	Unknown CanvasPanel_Position; //  0x260 Size(8)
	Unknown Image_Leader; //  0x268 Size(8)
	Unknown Image_Rank; //  0x270 Size(8)
	Unknown Img_Cut; //  0x278 Size(8)
	Unknown Img_MS; //  0x280 Size(8)
	Unknown Img_MS_2; //  0x288 Size(8)
	Unknown Img_MS_3; //  0x290 Size(8)
	Unknown Img_PlayerLine; //  0x298 Size(8)
	Unknown Img_PlayerPoint; //  0x2a0 Size(8)
	Unknown Img_Voice; //  0x2a8 Size(8)
	Unknown Img_VoiceElimination; //  0x2b0 Size(8)
	Unknown Overlay_OnReady; //  0x2b8 Size(8)
	Unknown Overlay_Position; //  0x2c0 Size(8)
	Unknown Overlay_TeamOnReady; //  0x2c8 Size(8)
	Unknown T_PlayerName; //  0x2d0 Size(8)
	Unknown T_PlayerName_2; //  0x2d8 Size(8)
	Unknown WidgetSwitcher_3; //  0x2e0 Size(8)
	Unknown WidgetSwitcher_IsTeam; //  0x2e8 Size(8)
	Unknown WidgetSwitcher_State; //  0x2f0 Size(8)
	int32_t LastSeaponTierId; //  0x2f8 Size(4)
	float WidgetHalfSizeX; //  0x2fc Size(4)

	void Set(char IsLeft, char IsSoloMode, Unknown CharacterRef, Unknown Memb); // Function U.U.Set(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown Image_112; //  0x248 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x1360 Size(8)
	Unknown Anim_LoopHintMaterial; //  0x1368 Size(8)
	Unknown Anim_Upgrade; //  0x1370 Size(8)
	Unknown P_Upgrade_Arrow; //  0x1378 Size(8)
	Unknown C_SlotHover_ItemState_Hide; //  0x1380 Size(8)
	Unknown C_SlotHover_ItemState_Show; //  0x1388 Size(8)
	Unknown Hover_Gold; //  0x1390 Size(8)
	Unknown P_SlotHover; //  0x1398 Size(8)
	Unknown BGImage; //  0x13a0 Size(8)
	Unknown CanvasPanel_ITemState; //  0x13a8 Size(8)
	Unknown CanvasPanel_Unnecessary; //  0x13b0 Size(8)
	Unknown Count; //  0x13b8 Size(8)
	Unknown Count_Icon; //  0x13c0 Size(8)
	Unknown fill; //  0x13c8 Size(8)
	Unknown Hint; //  0x13d0 Size(8)
	Unknown HoverImage; //  0x13d8 Size(8)
	Unknown HoverImage_Gold; //  0x13e0 Size(8)
	Unknown Image_1; //  0x13e8 Size(8)
	Unknown Image_2; //  0x13f0 Size(8)
	Unknown Image_95; //  0x13f8 Size(8)
	Unknown ItemImage; //  0x1400 Size(8)
	Unknown ItemNameName; //  0x1408 Size(8)
	Unknown ItemState_Text; //  0x1410 Size(8)
	Unknown LvColor; //  0x1418 Size(8)
	Unknown NeedMaterial; //  0x1420 Size(8)
	Unknown OverBG_3; //  0x1428 Size(8)
	Unknown ProgressBar_136; //  0x1430 Size(8)
	Unknown SizeBox_1; //  0x1438 Size(8)
	Unknown WeaponItemImage; //  0x1440 Size(8)
	char bGold; //  0x1448 Size(1)
	Unknown SelectedHoverImage; //  0x1450 Size(8)
	Unknown MedicalBGColor; //  0x1458 Size(10)
	struct FMulticastInlineDelegate SetSlotInfo; //  0x1468 Size(10)
	int32_t SlotIndex; //  0x1478 Size(4)

	void Get(char& bResult, Unknown& WeaponInfo); // Function U.U.Get(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelVoiceTalkWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Image; //  0x250 Size(8)
	Unknown ScrollBox_99; //  0x258 Size(8)
	Unknown U; //  0x260 Size(8)
	Unknown U_135; //  0x268 Size(8)
	Unknown U_196; //  0x270 Size(8)
	Unknown TempTeamPlayers; //  0x278 Size(10)

	void CheckCreateSlot(char& bRet); // Function U.U.CheckCreateSlot(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown Ani_MouseRight; //  0x248 Size(8)
	Unknown Image; //  0x250 Size(8)
	Unknown Image_2; //  0x258 Size(8)
	Unknown Image_292; //  0x260 Size(8)
	Unknown Image_503; //  0x268 Size(8)

	void HideMouse(); // Function U.U.HideMouse(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Popup_Alpha_Bg_Black; //  0x250 Size(8)
	Unknown btn_Ok; //  0x258 Size(8)
	Unknown Image_751; //  0x260 Size(8)
	Unknown Perk_List; //  0x268 Size(8)
	Unknown U; //  0x270 Size(8)
	Unknown U_2; //  0x278 Size(8)
	Unknown U_3; //  0x280 Size(8)
	struct FMulticastInlineDelegate EventDispatcher_OnClosePerkPopup; //  0x288 Size(10)

	void SetOptionList(Unknown& OptionList); // Function U.U.SetOptionList(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelPlayerMarkerWidget {
	Unknown Image_SupplyBoxMarker; //  0x248 Size(8)
	Unknown PersonalSupplyBox; //  0x250 Size(8)
	Unknown WidgetSwitcher_2; //  0x258 Size(8)
	struct FMulticastInlineDelegate OnMarkerClicked; //  0x260 Size(10)
	Unknown CurrentMarker; //  0x270 Size(8)
	Unknown MapCompRef; //  0x278 Size(8)
	Unknown TmpPingTypeTexture; //  0x280 Size(8)

	void UpdatePersonalSupplyBox(); // Function U.U.UpdatePersonalSupplyBox(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Image_350; //  0x250 Size(8)
	Unknown Image_585; //  0x258 Size(8)
	Unknown Image_Grade_Color_Line; //  0x260 Size(8)

	void SetBuffInfo(struct FText BuffName, struct FText Desc, Unknown Icon, int32_t Rarity); // Function U.U.SetBuffInfo(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Canvas_Main; //  0x250 Size(8)
	Unknown CB_DrawDeathPosition; //  0x258 Size(8)
	Unknown CB_DrawFireDirection; //  0x260 Size(8)
	Unknown CB_DrawHitted; //  0x268 Size(8)
	Unknown CB_DrawPersonalSupplyBox; //  0x270 Size(8)
	Unknown CB_TransportDropBox; //  0x278 Size(8)
	Unknown ReplayController; //  0x280 Size(8)
	Unknown MainWidget; //  0x288 Size(8)
	Unknown PlayerHUD; //  0x290 Size(8)

	void Init(); // Function U.U.Init(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Spectator_Ani; //  0x250 Size(8)
	Unknown Button_Report; //  0x258 Size(8)
	Unknown Canvas_Finding; //  0x260 Size(8)
	Unknown Canvas_Target; //  0x268 Size(8)
	Unknown Deco; //  0x270 Size(8)
	Unknown Image_351; //  0x278 Size(8)
	Unknown IMG_ClassIcon; //  0x280 Size(8)
	Unknown NickName; //  0x288 Size(8)
	Unknown Overlay_Report; //  0x290 Size(8)
	Unknown ReportDescriptionText; //  0x298 Size(8)
	Unknown Text_Report; //  0x2a0 Size(8)
	Unknown TextBlock_3; //  0x2a8 Size(8)
	Unknown TextBlock_208; //  0x2b0 Size(8)
	Unknown VerticalBox_Report; //  0x2b8 Size(8)
	Unknown WidgetSwitcher_136; //  0x2c0 Size(8)
	char IsReportAbleDateTime; //  0x2c8 Size(1)
	Unknown TargetPlayerState; //  0x2d0 Size(8)

	void ReportSended(); // Function U.U.ReportSended(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Button_Request; //  0x250 Size(8)
	Unknown Image_955; //  0x258 Size(8)
	Unknown Image_1208; //  0x260 Size(8)
	Unknown SizeBox_77; //  0x268 Size(8)
	Unknown SizeBox_78; //  0x270 Size(8)
	Unknown Text_Price; //  0x278 Size(8)
	Unknown TextBlock_767; //  0x280 Size(8)
	Unknown WidgetSwitcher_Price; //  0x288 Size(8)
	Unknown PlayerControllerRef; //  0x290 Size(8)
	char bCanRequest; //  0x298 Size(1)
	char bRequest; //  0x299 Size(1)
	struct FText RequstingResuscitationText; //  0x2a0 Size(18)
	float RequestingSizeBoxWidth; //  0x2b8 Size(4)
	Unknown RequestTextColor; //  0x2c0 Size(28)
	Unknown RequestingTextColor; //  0x2e8 Size(28)
	float RequestingSizeBoxInitWidth; //  0x310 Size(4)
	struct FText RequstingResuscitationInitText; //  0x318 Size(18)
	Unknown InitButtonStyle; //  0x330 Size(278)
	Unknown RequestingButtonStyle; //  0x5a8 Size(278)
	Unknown CanRequestButtonStyle; //  0x820 Size(278)

	void Init(); // Function U.U.Init(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelTeamInfoSlotWidget {
	Unknown UberGraphFrame; //  0x308 Size(8)
	Unknown Anim_IconBouncing; //  0x310 Size(8)
	Unknown Progress_Stroke; //  0x318 Size(8)
	Unknown Shoot_ani; //  0x320 Size(8)
	Unknown CanvasPanel_Main; //  0x328 Size(8)
	Unknown death; //  0x330 Size(8)
	Unknown Image_126; //  0x338 Size(8)
	Unknown Image_168; //  0x340 Size(8)
	Unknown Image_280; //  0x348 Size(8)
	Unknown Image_623; //  0x350 Size(8)
	Unknown Image_624; //  0x358 Size(8)
	Unknown Image_1058; //  0x360 Size(8)
	Unknown Image_Firing; //  0x368 Size(8)
	Unknown Image_Heart; //  0x370 Size(8)
	Unknown Image_Outline; //  0x378 Size(8)
	Unknown Image_TeamInfoClassIcon; //  0x380 Size(8)
	Unknown Img_LogOut; //  0x388 Size(8)
	Unknown Img_Voice; //  0x390 Size(8)
	Unknown Img_VoiceMute; //  0x398 Size(8)
	Unknown InvalidationBox_1; //  0x3a0 Size(8)
	Unknown Overlay_447; //  0x3a8 Size(8)
	Unknown Overlay_Death; //  0x3b0 Size(8)
	Unknown Overlay_RemainGoldenTimeSelf; //  0x3b8 Size(8)
	Unknown Overlay_RequestResus; //  0x3c0 Size(8)
	Unknown ProgressBar_440; //  0x3c8 Size(8)
	Unknown ProgressBar_443; //  0x3d0 Size(8)
	Unknown SizeBox_132; //  0x3d8 Size(8)
	Unknown StateGoldenTime; //  0x3e0 Size(8)
	Unknown StateKnockdown; //  0x3e8 Size(8)
	Unknown T_ClassName; //  0x3f0 Size(8)
	Unknown T_ClassWeapon; //  0x3f8 Size(8)
	Unknown T_PlayerIndex; //  0x400 Size(8)
	Unknown T_PlayerName; //  0x408 Size(8)
	Unknown TeamColor; //  0x410 Size(8)
	Unknown TextBlock_4; //  0x418 Size(8)
	Unknown TextBlock_297; //  0x420 Size(8)
	Unknown TextBlock_590; //  0x428 Size(8)
	Unknown TextBlock_591; //  0x430 Size(8)
	Unknown TextBlock_1016; //  0x438 Size(8)
	Unknown TextBlock_RemainGoldenTimeSelf; //  0x440 Size(8)
	Unknown TextBlock_RequestResus; //  0x448 Size(8)
	Unknown TextBlock_Resuscitating; //  0x450 Size(8)
	Unknown U; //  0x458 Size(8)
	Unknown WidgetSwitcher_LogOut; //  0x460 Size(8)
	Unknown WidgetSwitcher_Resuscitate; //  0x468 Size(8)
	int32_t Index; //  0x470 Size(4)
	Unknown Behavior; //  0x474 Size(1)
	float hp; //  0x478 Size(4)
	struct FText Name; //  0x480 Size(18)
	Unknown ColorList; //  0x498 Size(10)
	char bPin; //  0x4a8 Size(1)
	float PrevHP; //  0x4ac Size(4)
	char bReduceHP; //  0x4b0 Size(1)
	Unknown TimerHandleReduceHP; //  0x4b8 Size(8)
	char bIncreaseHP; //  0x4c0 Size(1)
	Unknown HealthChangeCurve; //  0x4c8 Size(8)
	Unknown HealthDangerCurve; //  0x4d0 Size(8)
	Unknown HealTimer; //  0x4d8 Size(8)
	Unknown FaintTimer; //  0x4e0 Size(8)
	float BaseHealth; //  0x4e8 Size(4)
	float TargetHealth; //  0x4ec Size(4)
	float HealthWeight; //  0x4f0 Size(4)
	float TargetFaint; //  0x4f4 Size(4)
	float BaseFaint; //  0x4f8 Size(4)
	float FaintWeight; //  0x4fc Size(4)
	float CurrentHPPercent; //  0x500 Size(4)
	float HealHPPercent; //  0x504 Size(4)
	float FaintPercent; //  0x508 Size(4)
	float CurrentAlpha; //  0x50c Size(4)
	float AlphaTimer; //  0x510 Size(4)
	Unknown AlphaCurve; //  0x518 Size(8)
	char KnockDown; //  0x520 Size(1)
	float HeartBeat; //  0x524 Size(4)
	Unknown DisConnectSprite; //  0x528 Size(8)
	Unknown KnockDownSprite; //  0x530 Size(8)
	Unknown DeathSprite; //  0x538 Size(8)
	Unknown VehicleSprite; //  0x540 Size(8)
	Unknown HpTimer; //  0x548 Size(8)
	float EndTime; //  0x550 Size(4)
	float StartTime; //  0x554 Size(4)
	float TotalTime; //  0x558 Size(4)
	float ResultValue; //  0x55c Size(4)
	float AddTme; //  0x560 Size(4)
	float PreStart; //  0x564 Size(4)

	void OnLoaded_27D2D12149E3EA31998D6D88C1D08B2F(Unknown Loaded); // Function U.U.OnLoaded_27D2D12149E3EA31998D6D88C1D08B2F(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelReportUserWidget {
	Unknown UberGraphFrame; //  0x278 Size(8)
	Unknown btn_Cancel; //  0x280 Size(8)
	Unknown btn_report; //  0x288 Size(8)
	Unknown comb; //  0x290 Size(8)
	Unknown combreport; //  0x298 Size(8)
	Unknown Image; //  0x2a0 Size(8)
	Unknown Image_2; //  0x2a8 Size(8)
	Unknown Image_545; //  0x2b0 Size(8)
	Unknown NormalArrow; //  0x2b8 Size(8)
	Unknown OpeningArrow; //  0x2c0 Size(8)
	Unknown popup; //  0x2c8 Size(8)
	Unknown txt_description; //  0x2d0 Size(8)
	Unknown txt_nickname; //  0x2d8 Size(8)
	Unknown uw; //  0x2e0 Size(8)
	struct FText DescriptionText; //  0x2e8 Size(18)
	Unknown ReportIndexText; //  0x300 Size(10)
	struct FText DefaultComboString; //  0x310 Size(18)
	int32_t CurrentSelectIndex; //  0x328 Size(4)
	int32_t SelectIndexFromProgram; //  0x32c Size(4)
	char CheckCloseComboArrow; //  0x330 Size(1)

	void SetOpeningArrow(char InOpening); // Function U.U.SetOpeningArrow(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelRoutePingWidget {
	Unknown Anim_OnShow; //  0x248 Size(8)
	Unknown Line; //  0x250 Size(8)
	struct FMulticastInlineDelegate OnMarkerClicked; //  0x258 Size(10)
	char IsLastPoint; //  0x268 Size(1)

	void SetGuideLine(); // Function U.U.SetGuideLine(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Anim_LoopHintSpecialWeapon; //  0x250 Size(8)
	Unknown Button_183; //  0x258 Size(8)
	Unknown Button_283; //  0x260 Size(8)
	Unknown CanvasPanel; //  0x268 Size(8)
	Unknown CanvasPanel_2; //  0x270 Size(8)
	Unknown Image_2; //  0x278 Size(8)
	Unknown Image_3; //  0x280 Size(8)
	Unknown Image_4; //  0x288 Size(8)
	Unknown Image_185; //  0x290 Size(8)
	Unknown Image_186; //  0x298 Size(8)
	Unknown Image_189; //  0x2a0 Size(8)
	Unknown Image_297; //  0x2a8 Size(8)
	Unknown Img_Find; //  0x2b0 Size(8)
	Unknown Overlay_2; //  0x2b8 Size(8)
	Unknown SizeBox_3; //  0x2c0 Size(8)
	Unknown T_SerchButton; //  0x2c8 Size(8)
	Unknown TextBlock_5; //  0x2d0 Size(8)
	Unknown TextBlock_495; //  0x2d8 Size(8)
	Unknown Throbber; //  0x2e0 Size(8)
	Unknown U; //  0x2e8 Size(8)
	Unknown U_2; //  0x2f0 Size(8)
	Unknown U_3; //  0x2f8 Size(8)
	Unknown U_4; //  0x300 Size(8)
	Unknown U_5; //  0x308 Size(8)
	Unknown U_6; //  0x310 Size(8)
	Unknown U_7; //  0x318 Size(8)
	Unknown U_8; //  0x320 Size(8)
	Unknown U_9; //  0x328 Size(8)
	Unknown U_10; //  0x330 Size(8)
	Unknown U_11; //  0x338 Size(8)
	Unknown U_12; //  0x340 Size(8)
	Unknown VerticalBox_2; //  0x348 Size(8)
	Unknown VerticalBox_4; //  0x350 Size(8)
	char ShowButton; //  0x358 Size(1)
	int32_t Index; //  0x35c Size(4)
	Unknown TempList; //  0x360 Size(10)
	int32_t MaxSlotCount; //  0x370 Size(4)
	char Enab; //  0x374 Size(1)

	void Get(int32_t Index, Unknown& Slot); // Function U.U.Get(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown btn_Cancel; //  0x250 Size(8)
	Unknown btn_Cancel_3; //  0x258 Size(8)
	Unknown btn_Ok; //  0x260 Size(8)
	Unknown HorizontalBox_WeaponList; //  0x268 Size(8)
	Unknown Image_68; //  0x270 Size(8)
	Unknown Image_128; //  0x278 Size(8)
	Unknown U; //  0x280 Size(8)
	Unknown U_2; //  0x288 Size(8)
	Unknown U_3; //  0x290 Size(8)
	struct FMulticastInlineDelegate EventDispatcher_RequestItemCraft; //  0x298 Size(10)
	Unknown SelectedWidget; //  0x2a8 Size(8)
	struct FMulticastInlineDelegate EventDispatcher_Cancel; //  0x2b0 Size(10)

	void SetWeaponList(Unknown& WeaponList, int32_t BaseItemID); // Function U.U.SetWeaponList(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown TX; //  0x248 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown Image_Selected; //  0x248 Size(8)
	Unknown TextBlock_Selected; //  0x250 Size(8)
	int32_t PlayerIndex; //  0x258 Size(4)

	void SetTeamIndex(int32_t PlayerIndex); // Function U.U.SetTeamIndex(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Anim_Show; //  0x250 Size(8)
	Unknown Border; //  0x258 Size(8)
	Unknown Border_51; //  0x260 Size(8)
	Unknown btn_All_OK; //  0x268 Size(8)
	Unknown btn_Close; //  0x270 Size(8)
	Unknown HorizontalBox_CloseButton; //  0x278 Size(8)
	Unknown Image_2; //  0x280 Size(8)
	Unknown U; //  0x288 Size(8)
	Unknown U_2; //  0x290 Size(8)
	Unknown U_3; //  0x298 Size(8)
	Unknown U; //  0x2a0 Size(8)
	Unknown U; //  0x2a8 Size(8)
	Unknown WidgetSwitcher_90; //  0x2b0 Size(8)
	Unknown OpenedOptionList; //  0x2b8 Size(10)

	void OnClosePerkPopup(); // Function U.U.OnClosePerkPopup(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x1360 Size(8)
	Unknown Bg; //  0x1368 Size(8)
	Unknown BGImage; //  0x1370 Size(8)
	Unknown BorderImage; //  0x1378 Size(8)
	Unknown EmptyImage; //  0x1380 Size(8)
	Unknown ItemImage; //  0x1388 Size(8)
	Unknown OverImage; //  0x1390 Size(8)
	Unknown SizeBox_1; //  0x1398 Size(8)
	Unknown WeaponAttachmentType; //  0x13a0 Size(1)
	int32_t WeaponSlotIndex; //  0x13a4 Size(4)
	char IsHover; //  0x13a8 Size(1)
	Unknown WeaponSlotWidget; //  0x13b0 Size(8)
	Unknown WeaponAttachmentUseType; //  0x13b8 Size(1)
	int32_t SlotMode; //  0x13bc Size(4)
	Unknown HoverWidget; //  0x13c0 Size(8)

	void SetHoverWidgetRef(); // Function U.U.SetHoverWidgetRef(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown VB_CoreList; //  0x250 Size(8)
	int32_t MaxWidgetCount; //  0x258 Size(4)
	char bStartFromTop; //  0x25c Size(1)
	Unknown Alignment; //  0x25d Size(1)
	int32_t SetWidgetSwitcherIndex; //  0x260 Size(4)

	void CheckCanStackDamageLog(Unknown& DamageLogInfo, char& CanStack); // Function U.U.CheckCanStackDamageLog(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown HoverBG; //  0x250 Size(8)
	Unknown ScrollBox_1; //  0x258 Size(8)
	Unknown W; //  0x260 Size(8)

	void DragLeave(Unknown PointerEvent, Unknown Operation); // Function U.U.DragLeave(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Bg; //  0x250 Size(8)
	Unknown btn_Cancel; //  0x258 Size(8)
	Unknown btn_Ok; //  0x260 Size(8)
	Unknown Button_Focus; //  0x268 Size(8)
	Unknown Button_Focus2; //  0x270 Size(8)
	Unknown CanvasPanel_Exit; //  0x278 Size(8)
	Unknown HorizontalBox_1; //  0x280 Size(8)
	Unknown Image_2; //  0x288 Size(8)
	Unknown Image_223; //  0x290 Size(8)
	Unknown Img_Movie; //  0x298 Size(8)
	Unknown RichTextBlock_244; //  0x2a0 Size(8)
	Unknown MediaPlayer; //  0x2a8 Size(8)
	char bPopup; //  0x2b0 Size(1)
	Unknown MediaSoundComp; //  0x2b8 Size(8)
	float GammaIntensity; //  0x2c0 Size(4)
	Unknown Game; //  0x2c8 Size(8)
	Unknown SkipNoticeTimer; //  0x2d0 Size(8)
	Unknown MediaTexture; //  0x2d8 Size(8)
	Unknown Media; //  0x2e0 Size(8)

	void PlayMedia(); // Function U.U.PlayMedia(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelScopeWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Image_1; //  0x250 Size(8)

	void SetScopeImageAngle(float NewAngle); // Function U.U.SetScopeImageAngle(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown TextBlock_Gold; //  0x248 Size(8)
	Unknown TextBlock_Title; //  0x250 Size(8)
	Unknown ColorType1; //  0x258 Size(28)
	Unknown ColorType2; //  0x280 Size(28)

	void Init(struct FText Title, int32_t Value); // Function U.U.Init(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x1360 Size(8)
	Unknown P_Upgrade_Arrow; //  0x1368 Size(8)
	Unknown C_SlotHover_ItemState_Hide; //  0x1370 Size(8)
	Unknown C_SlotHover_ItemState_Show; //  0x1378 Size(8)
	Unknown Hover_Gold; //  0x1380 Size(8)
	Unknown P_SlotHover; //  0x1388 Size(8)
	Unknown BGImage; //  0x1390 Size(8)
	Unknown BGImage_2; //  0x1398 Size(8)
	Unknown CanvasPanel_ITemState; //  0x13a0 Size(8)
	Unknown CanvasPanel_Unnecessary; //  0x13a8 Size(8)
	Unknown Count; //  0x13b0 Size(8)
	Unknown Crate_Default; //  0x13b8 Size(8)
	Unknown Crate_Hover; //  0x13c0 Size(8)
	Unknown DurabilityBar; //  0x13c8 Size(8)
	Unknown fill; //  0x13d0 Size(8)
	Unknown HorizontalBox_Rarity; //  0x13d8 Size(8)
	Unknown HoverImage; //  0x13e0 Size(8)
	Unknown HoverImage_Gold; //  0x13e8 Size(8)
	Unknown HoverImage_Round; //  0x13f0 Size(8)
	Unknown Image_1; //  0x13f8 Size(8)
	Unknown Image_2; //  0x1400 Size(8)
	Unknown Image_531; //  0x1408 Size(8)
	Unknown Image_539; //  0x1410 Size(8)
	Unknown Image_540; //  0x1418 Size(8)
	Unknown Image_541; //  0x1420 Size(8)
	Unknown Image_542; //  0x1428 Size(8)
	Unknown Image_543; //  0x1430 Size(8)
	Unknown Image_544; //  0x1438 Size(8)
	Unknown Image_Bindable; //  0x1440 Size(8)
	Unknown Image_Supply; //  0x1448 Size(8)
	Unknown ItemImage; //  0x1450 Size(8)
	Unknown ItemNameName; //  0x1458 Size(8)
	Unknown ItemState_Text; //  0x1460 Size(8)
	Unknown KeepedItem_List; //  0x1468 Size(8)
	Unknown KeepedItem_ListHover; //  0x1470 Size(8)
	Unknown LvColor; //  0x1478 Size(8)
	Unknown NeedMaterial; //  0x1480 Size(8)
	Unknown SizeBox_1; //  0x1488 Size(8)
	Unknown TextBlock_Range; //  0x1490 Size(8)
	Unknown UpgradeItem; //  0x1498 Size(8)
	Unknown UpgradeItem_Arrow01; //  0x14a0 Size(8)
	Unknown UpgradeItem_Arrow02; //  0x14a8 Size(8)
	Unknown UpgradeItem_default; //  0x14b0 Size(8)
	Unknown UpgradeItem_Hover; //  0x14b8 Size(8)
	Unknown weapon__; //  0x14c0 Size(8)
	Unknown WeaponColorBg; //  0x14c8 Size(8)
	Unknown WeaponEquipItem_Default; //  0x14d0 Size(8)
	Unknown WeaponEquipItem_Hov; //  0x14d8 Size(8)
	Unknown WeaponItemImage; //  0x14e0 Size(8)
	Unknown WeaponType; //  0x14e8 Size(8)
	Unknown PickupRef; //  0x14f0 Size(8)
	Unknown DroppedItemInfo; //  0x14f8 Size(98)
	Unknown DropBoxRef; //  0x1590 Size(8)
	char bGold; //  0x1598 Size(1)
	Unknown SelectedHoverImage; //  0x15a0 Size(8)
	Unknown WeaponData; //  0x15a8 Size(b30)
	Unknown MedicalBGColor; //  0x20d8 Size(10)
	int32_t CurCount; //  0x20e8 Size(4)
	struct FMulticastInlineDelegate SetSlotInfo; //  0x20f0 Size(10)
	Unknown TargetActor; //  0x2100 Size(8)
	Unknown StealableCharacter; //  0x2108 Size(8)
	Unknown ShowRarityStar; //  0x2110 Size(10)
	Unknown ShowIconBG; //  0x2120 Size(10)

	void CheckHoverMaterial(); // Function U.U.CheckHoverMaterial(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x268 Size(8)
	Unknown SeatIcons; //  0x270 Size(8)
	Unknown WheelIcons; //  0x278 Size(8)

	void Setup(Unknown VehicleInstance); // Function U.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown TextBlock; //  0x250 Size(8)
	struct FText SetText; //  0x258 Size(18)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Image; //  0x250 Size(8)
	Unknown Image_2; //  0x258 Size(8)
	Unknown Image_3; //  0x260 Size(8)
	Unknown Image_4; //  0x268 Size(8)
	Unknown Image_917; //  0x270 Size(8)
	Unknown Img_TypeIcon; //  0x278 Size(8)
	Unknown KeyImageWidget; //  0x280 Size(8)
	Unknown KeyImageWidget_2; //  0x288 Size(8)
	Unknown KeyImageWidget_3; //  0x290 Size(8)
	Unknown KeyImageWidget_4; //  0x298 Size(8)
	Unknown KeyImageWidget_5; //  0x2a0 Size(8)
	Unknown T_Context; //  0x2a8 Size(8)
	Unknown T_Context_2; //  0x2b0 Size(8)
	Unknown T_Context_3; //  0x2b8 Size(8)
	Unknown T_Context_4; //  0x2c0 Size(8)
	Unknown T_Context_5; //  0x2c8 Size(8)
	Unknown Text_SkillName; //  0x2d0 Size(8)
	Unknown VB_Nuclear; //  0x2d8 Size(8)
	Unknown VB_Retreat; //  0x2e0 Size(8)
	Unknown WidgetSwitcher_126; //  0x2e8 Size(8)

	void SetTutorialInfo(Unknown SkillType); // Function U.U.SetTutorialInfo(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Anim_MoveUp_HUD; //  0x250 Size(8)
	Unknown Anim_MoveRight; //  0x258 Size(8)
	Unknown Anim_MoveUp; //  0x260 Size(8)
	Unknown U; //  0x268 Size(8)
	Unknown U; //  0x270 Size(8)
	Unknown U; //  0x278 Size(8)
	Unknown U; //  0x280 Size(8)
	Unknown U; //  0x288 Size(8)
	Unknown U; //  0x290 Size(8)
	Unknown VerticalBox_Stats; //  0x298 Size(8)

	void SetStatInfo(Unknown& StatupParams, char IsUpAnim); // Function U.U.SetStatInfo(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown Image_80; //  0x248 Size(8)

	void destroy(); // Function U.U.destroy(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Disappear; //  0x250 Size(8)
	Unknown Finish; //  0x258 Size(8)
	Unknown Spin; //  0x260 Size(8)
	Unknown Idle; //  0x268 Size(8)
	Unknown Image_180; //  0x270 Size(8)
	Unknown ItemImage_bg; //  0x278 Size(8)
	Unknown ItemImage_Dummy1; //  0x280 Size(8)
	Unknown ItemImage_Main; //  0x288 Size(8)
	Unknown TextBlock_1; //  0x290 Size(8)
	Unknown TextBlock_3; //  0x298 Size(8)
	Unknown TextMountablewea; //  0x2a0 Size(8)
	Unknown TextMountableweaLV1; //  0x2a8 Size(8)
	Unknown PerkInfo; //  0x2b0 Size(28)
	Unknown PerkData; //  0x2d8 Size(e0)
	char bLevelUp; //  0x3b8 Size(1)
	char bFinishing; //  0x3b9 Size(1)
	float FinishTime; //  0x3bc Size(4)
	Unknown PerkSlot; //  0x3c0 Size(1)

	struct FText Get_TextBlock_1_Text_1(); // Function U.U.Get_TextBlock_1_Text_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Comb_2; //  0x250 Size(8)
	Unknown Down_2; //  0x258 Size(8)
	Unknown Image; //  0x260 Size(8)
	Unknown Img_BG; //  0x268 Size(8)
	Unknown Overlay_2; //  0x270 Size(8)
	Unknown SortText_2; //  0x278 Size(8)
	Unknown Up_2; //  0x280 Size(8)
	Unknown U; //  0x288 Size(8)
	Unknown U_2; //  0x290 Size(8)
	Unknown U_3; //  0x298 Size(8)
	Unknown VerticalBox_Category; //  0x2a0 Size(8)
	Unknown CategoryList; //  0x2a8 Size(50)
	Unknown SortTypeList; //  0x2f8 Size(10)
	Unknown LastOpenedCategory; //  0x308 Size(8)
	char IsOwn; //  0x310 Size(1)
	char IsOwnAny; //  0x311 Size(1)
	int32_t CraftingID; //  0x314 Size(4)
	struct FText TextAll; //  0x318 Size(18)
	int32_t LanguageIndex; //  0x330 Size(4)

	void CheckLanguageIndex(); // Function U.U.CheckLanguageIndex(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelPlayerInfoProgressWidget {
	Unknown UberGraphFrame; //  0x2e8 Size(8)
	Unknown Anim_Healing; //  0x2f0 Size(8)
	Unknown HorizontalBox_Health; //  0x2f8 Size(8)
	Unknown Image_eager; //  0x300 Size(8)
	Unknown SizeBox_main; //  0x308 Size(8)
	Unknown Curve_ProgressMaxSizeRatio; //  0x310 Size(8)
	float DefaultSlotSize; //  0x318 Size(4)
	float MaxHealthSize; //  0x31c Size(4)
	float CurrentHealthSize; //  0x320 Size(4)
	float CurrentMaxHealth; //  0x324 Size(4)

	void GetHealthPosition(float InHealth, float& PositionX); // Function U.U.GetHealthPosition(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Fade_in_Black_Bg; //  0x250 Size(8)
	Unknown Anim_ShowPerk; //  0x258 Size(8)
	Unknown Image_319; //  0x260 Size(8)
	Unknown Img_Opened; //  0x268 Size(8)
	Unknown T_Desc; //  0x270 Size(8)
	Unknown T_Name; //  0x278 Size(8)
	Unknown U; //  0x280 Size(8)
	Unknown RarityBGMaterialInstance; //  0x288 Size(8)
	float CurrentAnim; //  0x290 Size(4)

	void SetItemOption(Unknown& ItemOption); // Function U.U.SetItemOption(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelInventoryWidget {
	Unknown UberGraphFrame; //  0x278 Size(8)
	Unknown FadeIn; //  0x280 Size(8)
	Unknown BackgroundBlur_1; //  0x288 Size(8)
	Unknown BackPackBound_begin; //  0x290 Size(8)
	Unknown BackPackBound_end; //  0x298 Size(8)
	Unknown BlackMarketOverlay; //  0x2a0 Size(8)
	Unknown BT; //  0x2a8 Size(8)
	Unknown Button_SortByTime; //  0x2b0 Size(8)
	Unknown Button_SortByType; //  0x2b8 Size(8)
	Unknown CanvasPanel_1; //  0x2c0 Size(8)
	Unknown CanvasPanel_7; //  0x2c8 Size(8)
	Unknown CanvasPanel_16; //  0x2d0 Size(8)
	Unknown Carried_Area; //  0x2d8 Size(8)
	Unknown CarriedBound_begin; //  0x2e0 Size(8)
	Unknown CarriedBound_end; //  0x2e8 Size(8)
	Unknown CarriedList; //  0x2f0 Size(8)
	Unknown CarriedList_StrongBox; //  0x2f8 Size(8)
	Unknown CheckBox; //  0x300 Size(8)
	Unknown CheckBox_1; //  0x308 Size(8)
	Unknown CheckBox_2; //  0x310 Size(8)
	Unknown Comb; //  0x318 Size(8)
	Unknown EquippedList; //  0x320 Size(8)
	Unknown HorizontalBox_WeightMax; //  0x328 Size(8)
	Unknown Image; //  0x330 Size(8)
	Unknown Image_2; //  0x338 Size(8)
	Unknown Image_3; //  0x340 Size(8)
	Unknown Image_5; //  0x348 Size(8)
	Unknown Image_6; //  0x350 Size(8)
	Unknown Image_7; //  0x358 Size(8)
	Unknown Image_8; //  0x360 Size(8)
	Unknown Image_9; //  0x368 Size(8)
	Unknown Image_10; //  0x370 Size(8)
	Unknown Image_223; //  0x378 Size(8)
	Unknown Image_227; //  0x380 Size(8)
	Unknown Image_271; //  0x388 Size(8)
	Unknown Image_324; //  0x390 Size(8)
	Unknown Image_489; //  0x398 Size(8)
	Unknown Image_556; //  0x3a0 Size(8)
	Unknown Image_Guess; //  0x3a8 Size(8)
	Unknown Image_ItemInfo; //  0x3b0 Size(8)
	Unknown IM; //  0x3b8 Size(8)
	Unknown IM; //  0x3c0 Size(8)
	Unknown InputMaskImage; //  0x3c8 Size(8)
	Unknown Material_Area; //  0x3d0 Size(8)
	Unknown MaterialBound_begin; //  0x3d8 Size(8)
	Unknown MaterialBound_end; //  0x3e0 Size(8)
	Unknown ProgressBar_MaxWeight; //  0x3e8 Size(8)
	Unknown ProgressBar_Weight; //  0x3f0 Size(8)
	Unknown ProgressBar_WeightBag; //  0x3f8 Size(8)
	Unknown ProximityBound; //  0x400 Size(8)
	Unknown ProximityList; //  0x408 Size(8)
	Unknown StrongBox_Area; //  0x410 Size(8)
	Unknown T_AdditionalMaxWeight; //  0x418 Size(8)
	Unknown T_AdditionalMaxWeightSymbol; //  0x420 Size(8)
	Unknown T_AdditionalWeight; //  0x428 Size(8)
	Unknown T_AdditionalWeightSymbol; //  0x430 Size(8)
	Unknown T_MaxWeight; //  0x438 Size(8)
	Unknown T_StrongboxCount; //  0x440 Size(8)
	Unknown T_Weight; //  0x448 Size(8)
	Unknown T_WeightSlash; //  0x450 Size(8)
	Unknown TextBlock_11; //  0x458 Size(8)
	Unknown TextBlock_CurrentGold; //  0x460 Size(8)
	Unknown TextBlock_SortByTime; //  0x468 Size(8)
	Unknown TextBlock_SortByType; //  0x470 Size(8)
	Unknown U; //  0x478 Size(8)
	Unknown U; //  0x480 Size(8)
	Unknown U; //  0x488 Size(8)
	Unknown U; //  0x490 Size(8)
	Unknown U; //  0x498 Size(8)
	Unknown U; //  0x4a0 Size(8)
	Unknown WeaponBound; //  0x4a8 Size(8)
	Unknown WeaponList; //  0x4b0 Size(8)
	Unknown WeightPerCent; //  0x4b8 Size(8)
	Unknown PlayerController; //  0x4c0 Size(8)
	char bItemDrag; //  0x4c8 Size(1)
	Unknown DropPopup; //  0x4d0 Size(8)
	float MaximumWeight; //  0x4d8 Size(4)
	int32_t OldProximityItemCount; //  0x4dc Size(4)
	Unknown ProximityGround; //  0x4e0 Size(8)
	Unknown DefaultPawnRef; //  0x4e8 Size(8)
	Unknown ProximityGroundPool; //  0x4f0 Size(10)
	Unknown OldDefaultPawnRef; //  0x500 Size(8)
	Unknown CharacterTimerHandle; //  0x508 Size(8)
	Unknown DropBoxWidgetList; //  0x510 Size(10)
	Unknown DropBoxParentWidget; //  0x520 Size(8)
	Unknown SavedInventorySettings; //  0x528 Size(8)
	Unknown EquipedWeapon; //  0x530 Size(8)
	Unknown OldWeaponList; //  0x538 Size(10)
	char ChangeAttachments; //  0x548 Size(1)
	Unknown ItemHoverWidget; //  0x550 Size(8)
	Unknown MainWidget; //  0x558 Size(8)
	struct FMulticastInlineDelegate EventDispatcher_OnCloseInventory; //  0x560 Size(10)
	Unknown StealableWidgetList; //  0x570 Size(10)
	char bItemInfoHovered; //  0x580 Size(1)
	char bFirstTimeNotifyItemInfo; //  0x581 Size(1)
	Unknown Timer_ItemInfoTooltip; //  0x588 Size(8)
	char IsShowingItemInfoTooltip; //  0x590 Size(1)
	int32_t FirstTimeCapsuleItem; //  0x594 Size(4)
	int32_t FirstTimeCraft; //  0x598 Size(4)
	char bGoldWarning; //  0x59c Size(1)
	Unknown DefaultWeightColor; //  0x5a0 Size(28)
	Unknown MinusWeightColor; //  0x5c8 Size(28)
	Unknown PlusWeightColor; //  0x5f0 Size(28)

	void AllHiddenMaterialWidget(); // Function U.U.AllHiddenMaterialWidget(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Button_Crapting_Btn; //  0x250 Size(8)
	Unknown Button_Crapting_Btn_dis; //  0x258 Size(8)
	Unknown Image_112; //  0x260 Size(8)
	Unknown Img_Gold; //  0x268 Size(8)
	Unknown Img_Gold_Inert; //  0x270 Size(8)
	Unknown Img_Gold_Inert_2; //  0x278 Size(8)
	Unknown RichTextBlock_578; //  0x280 Size(8)
	Unknown T_GoldCost; //  0x288 Size(8)
	Unknown T_GoldCost_2; //  0x290 Size(8)
	Unknown U; //  0x298 Size(8)
	Unknown U; //  0x2a0 Size(8)
	Unknown U; //  0x2a8 Size(8)
	Unknown U; //  0x2b0 Size(8)
	Unknown U; //  0x2b8 Size(8)
	Unknown WidgetSwitcher_179; //  0x2c0 Size(8)
	Unknown WidgetSwitcher_Gold; //  0x2c8 Size(8)
	Unknown CraftingInfo; //  0x2d0 Size(128)
	Unknown SelectedButton; //  0x3f8 Size(8)

	void GetCraftingWeaponRarity(int32_t& OutRarity); // Function U.U.GetCraftingWeaponRarity(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Button_OK; //  0x250 Size(8)
	Unknown Image_337; //  0x258 Size(8)
	Unknown Image_581; //  0x260 Size(8)
	Unknown Image_583; //  0x268 Size(8)
	Unknown Image_584; //  0x270 Size(8)
	Unknown Slider_Gamma; //  0x278 Size(8)
	Unknown TextBlock_Gamma; //  0x280 Size(8)
	Unknown Game; //  0x288 Size(8)
	float Gamma; //  0x290 Size(4)
	struct FText Gamma; //  0x298 Size(18)
	struct FMulticastInlineDelegate ClosedWidgetDelegate; //  0x2b0 Size(10)

	void Refresh(); // Function U.U.Refresh(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Bg; //  0x250 Size(8)
	Unknown Button_Cancle; //  0x258 Size(8)
	Unknown Button_OK; //  0x260 Size(8)
	Unknown Image; //  0x268 Size(8)
	Unknown Image_168; //  0x270 Size(8)
	Unknown Image_423; //  0x278 Size(8)
	Unknown Image_853; //  0x280 Size(8)
	Unknown Image_1449; //  0x288 Size(8)
	Unknown Image_1451; //  0x290 Size(8)
	Unknown Image_1452; //  0x298 Size(8)
	Unknown Image_1453; //  0x2a0 Size(8)
	Unknown Image_1454; //  0x2a8 Size(8)
	Unknown Image_1965; //  0x2b0 Size(8)
	Unknown Image_1967; //  0x2b8 Size(8)
	Unknown Image_1968; //  0x2c0 Size(8)
	Unknown Image_1969; //  0x2c8 Size(8)
	Unknown Image_1970; //  0x2d0 Size(8)
	Unknown Image_1971; //  0x2d8 Size(8)
	Unknown Image_1972; //  0x2e0 Size(8)
	Unknown Image_1973; //  0x2e8 Size(8)
	Unknown Image_1974; //  0x2f0 Size(8)
	Unknown Image_1975; //  0x2f8 Size(8)
	Unknown Image_1976; //  0x300 Size(8)
	Unknown Image_1977; //  0x308 Size(8)
	Unknown Image_1978; //  0x310 Size(8)
	Unknown Image_2324; //  0x318 Size(8)
	Unknown TextBlock_CurrentGold; //  0x320 Size(8)
	Unknown TextBlock_Price; //  0x328 Size(8)
	Unknown TargetCharacter; //  0x330 Size(8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelRoutePingWidget {
	Unknown Anim_OnShow; //  0x248 Size(8)
	Unknown BackColor; //  0x250 Size(8)
	Unknown T_Num; //  0x258 Size(8)
	struct FMulticastInlineDelegate OnMarkerClicked; //  0x260 Size(10)

	void SetPointAngle(float Angle); // Function U.U.SetPointAngle(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown BlockMouse; //  0x250 Size(8)
	Unknown Button_Accept; //  0x258 Size(8)
	Unknown Button_Cancel; //  0x260 Size(8)
	Unknown Button_Close; //  0x268 Size(8)
	Unknown Button_Max; //  0x270 Size(8)
	Unknown Button_Min; //  0x278 Size(8)
	Unknown Image_9; //  0x280 Size(8)
	Unknown Slider_137; //  0x288 Size(8)
	Unknown TextBlock_Accept; //  0x290 Size(8)
	Unknown TextBlock_MaxCount; //  0x298 Size(8)
	Unknown TextBlock_MinCount; //  0x2a0 Size(8)
	Unknown TextBlock_Title; //  0x2a8 Size(8)
	Unknown TextBox_DropCount; //  0x2b0 Size(8)
	int32_t CurrentCount; //  0x2b8 Size(4)
	int32_t MaxCount; //  0x2bc Size(4)
	struct FText LastEnteredText; //  0x2c0 Size(18)
	Unknown ItemInfo; //  0x2d8 Size(98)
	Unknown ItemDetailInfo; //  0x370 Size(490)
	Unknown PickupRef; //  0x800 Size(8)
	Unknown DropBoxRef; //  0x808 Size(8)
	Unknown InventoryWidget; //  0x810 Size(8)
	char bClosing; //  0x818 Size(1)
	Unknown MaterialSlot; //  0x820 Size(8)

	void CheckNumeric(struct FString CheckString, char& CheckResult); // Function U.U.CheckNumeric(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x2a0 Size(8)
	Unknown EventInform; //  0x2a8 Size(8)
	Unknown VisualBorder; //  0x2b0 Size(8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown FadeIn3; //  0x250 Size(8)
	Unknown FadeIn2; //  0x258 Size(8)
	Unknown RankDown; //  0x260 Size(8)
	Unknown RankUp; //  0x268 Size(8)
	Unknown FadeOut; //  0x270 Size(8)
	Unknown FadeIn; //  0x278 Size(8)
	Unknown Button_DeathCam; //  0x280 Size(8)
	Unknown Button_Exit; //  0x288 Size(8)
	Unknown Button_Report; //  0x290 Size(8)
	Unknown Button_Spectate; //  0x298 Size(8)
	Unknown Image; //  0x2a0 Size(8)
	Unknown Image_2; //  0x2a8 Size(8)
	Unknown Image_3; //  0x2b0 Size(8)
	Unknown Image_4; //  0x2b8 Size(8)
	Unknown Image_5; //  0x2c0 Size(8)
	Unknown Image_6; //  0x2c8 Size(8)
	Unknown Image_7; //  0x2d0 Size(8)
	Unknown Image_8; //  0x2d8 Size(8)
	Unknown Image_135; //  0x2e0 Size(8)
	Unknown Image_149; //  0x2e8 Size(8)
	Unknown Image_239; //  0x2f0 Size(8)
	Unknown Image_314; //  0x2f8 Size(8)
	Unknown Image_377; //  0x300 Size(8)
	Unknown Image_444; //  0x308 Size(8)
	Unknown Image_477; //  0x310 Size(8)
	Unknown Image_518; //  0x318 Size(8)
	Unknown Image_531; //  0x320 Size(8)
	Unknown Image_745; //  0x328 Size(8)
	Unknown Image_992; //  0x330 Size(8)
	Unknown Image_1373; //  0x338 Size(8)
	Unknown Image_1459; //  0x340 Size(8)
	Unknown Image_1506; //  0x348 Size(8)
	Unknown Image_1508; //  0x350 Size(8)
	Unknown Image_1925; //  0x358 Size(8)
	Unknown Image_NextTireIcon; //  0x360 Size(8)
	Unknown Light_01; //  0x368 Size(8)
	Unknown Light_02; //  0x370 Size(8)
	Unknown Light_03; //  0x378 Size(8)
	Unknown Light_04; //  0x380 Size(8)
	Unknown Light_05; //  0x388 Size(8)
	Unknown Light_06; //  0x390 Size(8)
	Unknown Light_07; //  0x398 Size(8)
	Unknown Light_08; //  0x3a0 Size(8)
	Unknown Overlay_Rank; //  0x3a8 Size(8)
	Unknown Overlay_Report; //  0x3b0 Size(8)
	Unknown Overlay_Spectate; //  0x3b8 Size(8)
	Unknown ProgressBar_Current; //  0x3c0 Size(8)
	Unknown ProgressBar_Down; //  0x3c8 Size(8)
	Unknown ProgressBar_Up; //  0x3d0 Size(8)
	Unknown ScrollBox_GoldList; //  0x3d8 Size(8)
	Unknown ScrollBox_ItemList; //  0x3e0 Size(8)
	Unknown SizeBox_8; //  0x3e8 Size(8)
	Unknown Spacer_6018; //  0x3f0 Size(8)
	Unknown Spacer_6217; //  0x3f8 Size(8)
	Unknown Spacer_Center; //  0x400 Size(8)
	Unknown T_RemainTime; //  0x408 Size(8)
	Unknown team_kill; //  0x410 Size(8)
	Unknown Team_Revives; //  0x418 Size(8)
	Unknown Text_Report; //  0x420 Size(8)
	Unknown TextBlock_1425; //  0x428 Size(8)
	Unknown TextBlock_CurrentRP; //  0x430 Size(8)
	Unknown TextBlock_ItemCount; //  0x438 Size(8)
	Unknown TextBlock_Kill; //  0x440 Size(8)
	Unknown TextBlock_MatchRP; //  0x448 Size(8)
	Unknown TextBlock_NextRP; //  0x450 Size(8)
	Unknown TextBlock_Rank; //  0x458 Size(8)
	Unknown TextBlock_Resuscitates; //  0x460 Size(8)
	Unknown TextBlock_Title; //  0x468 Size(8)
	Unknown TextBlock_TotalGold; //  0x470 Size(8)
	Unknown TextBlock_TotalTeamCount; //  0x478 Size(8)
	Unknown U; //  0x480 Size(8)
	Unknown U; //  0x488 Size(8)
	Unknown U_1; //  0x490 Size(8)
	Unknown U_2; //  0x498 Size(8)
	Unknown U; //  0x4a0 Size(8)
	Unknown VerticalBox_188; //  0x4a8 Size(8)
	Unknown FinalResultData; //  0x4b0 Size(4)
	Unknown PlayerState; //  0x4b8 Size(8)
	Unknown Timehandle_Rank; //  0x4c0 Size(8)
	int32_t PlayerOriRP; //  0x4c8 Size(4)
	int32_t TargetRP; //  0x4cc Size(4)
	int32_t CurrentRP; //  0x4d0 Size(4)
	int32_t NextTireRP; //  0x4d4 Size(4)
	char Increase; //  0x4d8 Size(1)
	int32_t CurrentTierID; //  0x4dc Size(4)
	char bMaxPrograssbar; //  0x4e0 Size(1)
	Unknown MatchEndWidgetRef; //  0x4e8 Size(8)
	int32_t RandomGold; //  0x4f0 Size(4)
	Unknown GoldHandle; //  0x4f8 Size(8)
	char IsWinningCam; //  0x500 Size(1)
	int32_t GainGoldValue; //  0x504 Size(4)
	Unknown GainGoldHandle; //  0x508 Size(8)
	Unknown StartSound; //  0x510 Size(4)

	void SequenceEvent__ENTRYPOINTU_4(); // Function U.U.SequenceEvent__ENTRYPOINTU_4(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelGamePopupWidget {
	Unknown UberGraphFrame; //  0x250 Size(8)
	Unknown BT; //  0x258 Size(8)
	Unknown BT; //  0x260 Size(8)
	Unknown BT; //  0x268 Size(8)
	Unknown BT; //  0x270 Size(8)
	Unknown Button_1; //  0x278 Size(8)
	Unknown Button_2; //  0x280 Size(8)
	Unknown Button_4; //  0x288 Size(8)
	Unknown Image_2; //  0x290 Size(8)
	Unknown IM; //  0x298 Size(8)
	Unknown Overlay_Exit; //  0x2a0 Size(8)
	Unknown TextBlock_2; //  0x2a8 Size(8)
	Unknown U; //  0x2b0 Size(8)
	Unknown VerticalBox_InGame; //  0x2b8 Size(8)
	Unknown VerticalBox_Lobby; //  0x2c0 Size(8)
	struct FName MapNameToExit; //  0x2c8 Size(8)
	char IsLobby; //  0x2d0 Size(1)

	Unknown OnMouseButtonDown(Unknown MyGeometry, Unknown& MouseEvent); // Function U.U.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelPersonalSupplyBoxWidget {
	Unknown UberGraphFrame; //  0x3f8 Size(8)
	Unknown Ani_PadOn; //  0x400 Size(8)
	Unknown BG_Pad; //  0x408 Size(8)
	Unknown btn_PerkDeckEnabled; //  0x410 Size(8)
	Unknown Canvas_ChangeEnable; //  0x418 Size(8)
	Unknown CanvasPanel; //  0x420 Size(8)
	Unknown CanvasPanel_3; //  0x428 Size(8)
	Unknown Comb_237; //  0x430 Size(8)
	Unknown CurHaveGoldValue; //  0x438 Size(8)
	Unknown CurPriceText; //  0x440 Size(8)
	Unknown Down; //  0x448 Size(8)
	Unknown EquipBg; //  0x450 Size(8)
	Unknown Free; //  0x458 Size(8)
	Unknown GoldImage; //  0x460 Size(8)
	Unknown GoldImage_2; //  0x468 Size(8)
	Unknown GoldLack; //  0x470 Size(8)
	Unknown HaveWeaponText; //  0x478 Size(8)
	Unknown HorizontalBox_1; //  0x480 Size(8)
	Unknown Image; //  0x488 Size(8)
	Unknown Image_2; //  0x490 Size(8)
	Unknown Image_3; //  0x498 Size(8)
	Unknown Image_4; //  0x4a0 Size(8)
	Unknown Image_5; //  0x4a8 Size(8)
	Unknown Image_91; //  0x4b0 Size(8)
	Unknown Image_119; //  0x4b8 Size(8)
	Unknown Image_172; //  0x4c0 Size(8)
	Unknown Image_192; //  0x4c8 Size(8)
	Unknown Image_251; //  0x4d0 Size(8)
	Unknown Image_362; //  0x4d8 Size(8)
	Unknown Image_400; //  0x4e0 Size(8)
	Unknown Image_545; //  0x4e8 Size(8)
	Unknown Image_552; //  0x4f0 Size(8)
	Unknown Image_614; //  0x4f8 Size(8)
	Unknown Image_722; //  0x500 Size(8)
	Unknown Image_1025; //  0x508 Size(8)
	Unknown Image_1262; //  0x510 Size(8)
	Unknown ItemIcon; //  0x518 Size(8)
	Unknown Items_1Text; //  0x520 Size(8)
	Unknown ItemScroll; //  0x528 Size(8)
	Unknown ItemsText; //  0x530 Size(8)
	Unknown OkText; //  0x538 Size(8)
	Unknown Overlay_4; //  0x540 Size(8)
	Unknown Overlay_215; //  0x548 Size(8)
	Unknown PriceBg; //  0x550 Size(8)
	Unknown PriceBg_2; //  0x558 Size(8)
	Unknown PriceText; //  0x560 Size(8)
	Unknown PriceValue; //  0x568 Size(8)
	Unknown RichTextBlock; //  0x570 Size(8)
	Unknown RichTextBlock_74; //  0x578 Size(8)
	Unknown SizeBox_4; //  0x580 Size(8)
	Unknown SlotBg; //  0x588 Size(8)
	Unknown SortText; //  0x590 Size(8)
	Unknown SpecialWeaponText; //  0x598 Size(8)
	Unknown TextBlock_3; //  0x5a0 Size(8)
	Unknown Up; //  0x5a8 Size(8)
	Unknown U_2; //  0x5b0 Size(8)
	Unknown U_3; //  0x5b8 Size(8)
	Unknown U_4; //  0x5c0 Size(8)
	Unknown U_5; //  0x5c8 Size(8)
	Unknown U_6; //  0x5d0 Size(8)
	Unknown U_186; //  0x5d8 Size(8)
	Unknown U; //  0x5e0 Size(8)
	Unknown U; //  0x5e8 Size(8)
	Unknown VerticalBox_1; //  0x5f0 Size(8)
	Unknown WeaponScroll; //  0x5f8 Size(8)
	Unknown WidgetSwitcher_1; //  0x600 Size(8)
	Unknown SortType; //  0x608 Size(10)
	Unknown RarityList; //  0x618 Size(10)
	Unknown Comb; //  0x628 Size(50)
	struct FString SelectComboBox; //  0x678 Size(10)
	char IsShowAni; //  0x688 Size(1)
	char IsFree; //  0x689 Size(1)
	Unknown SaveSupplyItem; //  0x690 Size(100)
	int32_t CurOwnGold; //  0x790 Size(4)
	int32_t TotalPrice; //  0x794 Size(4)

	Unknown OnMouseButtonDown(Unknown MyGeometry, Unknown& MouseEvent); // Function U.U.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Anim_KillMessage; //  0x250 Size(8)
	Unknown Anim_RemoveCoreInfo; //  0x258 Size(8)
	Unknown Anim_AddCoreInfo; //  0x260 Size(8)
	Unknown HB_Smartping; //  0x268 Size(8)
	Unknown Img_Back; //  0x270 Size(8)
	Unknown Img_Back_2; //  0x278 Size(8)
	Unknown Img_MarkerIcon; //  0x280 Size(8)
	Unknown IMG_PerkDeckIcon; //  0x288 Size(8)
	Unknown NewRichText; //  0x290 Size(8)
	Unknown T_Damage; //  0x298 Size(8)
	Unknown T_DamageCauser; //  0x2a0 Size(8)
	Unknown T_DamageResult; //  0x2a8 Size(8)
	Unknown T_HeadShot; //  0x2b0 Size(8)
	Unknown T_HitCount; //  0x2b8 Size(8)
	Unknown T_HitType; //  0x2c0 Size(8)
	Unknown T_Message; //  0x2c8 Size(8)
	Unknown T_PingType; //  0x2d0 Size(8)
	Unknown T_PlayerName; //  0x2d8 Size(8)
	Unknown T_TargetClass; //  0x2e0 Size(8)
	Unknown T_TargetLevel; //  0x2e8 Size(8)
	Unknown T_TargetName; //  0x2f0 Size(8)
	Unknown T_TargetWeapon; //  0x2f8 Size(8)
	Unknown T_WeaponLevel; //  0x300 Size(8)
	Unknown WidgetSwitcher_194; //  0x308 Size(8)
	Unknown WidgetSwitcher_Main; //  0x310 Size(8)
	Unknown ParentWidgetRef; //  0x318 Size(8)
	Unknown Timer_StartRemove; //  0x320 Size(8)
	Unknown DamageLogInfo; //  0x328 Size(b58)
	float LogTime; //  0xe80 Size(4)
	float LogStackValidTime; //  0xe84 Size(4)

	void DamageResultText(struct FText& Result); // Function U.U.DamageResultText(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown perk_Icon_Scale; //  0x250 Size(8)
	Unknown HorizontalBox_Rarity; //  0x258 Size(8)
	Unknown Image; //  0x260 Size(8)
	Unknown Image_2; //  0x268 Size(8)
	Unknown Image_3; //  0x270 Size(8)
	Unknown Image_4; //  0x278 Size(8)
	Unknown Image_5; //  0x280 Size(8)
	Unknown Image_6; //  0x288 Size(8)
	Unknown Image_7; //  0x290 Size(8)
	Unknown Image_328; //  0x298 Size(8)
	Unknown Img_GradeBG; //  0x2a0 Size(8)
	Unknown Img_Icon; //  0x2a8 Size(8)
	Unknown ItemOptionInfo; //  0x2b0 Size(b8)

	void SequenceEvent__ENTRYPOINTU_1(); // Function U.U.SequenceEvent__ENTRYPOINTU_1(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x2a0 Size(8)
	Unknown VisualBorder; //  0x2a8 Size(8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown EnemySkull; //  0x250 Size(8)
	Unknown Image_436; //  0x258 Size(8)
	Unknown Pawn; //  0x260 Size(8)

	void SetDiedPawnInfo(Unknown BroadCastInfo); // Function U.U.SetDiedPawnInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown Image; //  0x248 Size(8)
	Unknown Image_2; //  0x250 Size(8)
	Unknown Image_3; //  0x258 Size(8)
	Unknown Image_4; //  0x260 Size(8)
	Unknown Image_5; //  0x268 Size(8)
	Unknown Image_6; //  0x270 Size(8)
	Unknown Image_7; //  0x278 Size(8)
	Unknown Image_8; //  0x280 Size(8)
	Unknown Image_9; //  0x288 Size(8)
	Unknown Image_106; //  0x290 Size(8)
	Unknown T_Accuracy; //  0x298 Size(8)
	Unknown T_EffectiveRange; //  0x2a0 Size(8)
	Unknown T_FireRate; //  0x2a8 Size(8)
	Unknown T_MagSize; //  0x2b0 Size(8)
	Unknown T_Power; //  0x2b8 Size(8)

	void SetWeaponStat(Unknown& WeaponInfo); // Function U.U.SetWeaponStat(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelKillInfoSlotWidget {
	Unknown UberGraphFrame; //  0x258 Size(8)
	Unknown Anim_Hide; //  0x260 Size(8)
	Unknown Anim_Down; //  0x268 Size(8)
	Unknown CanvasPanel_Main; //  0x270 Size(8)
	Unknown Img_Back; //  0x278 Size(8)
	Unknown Img_BroadType; //  0x280 Size(8)
	Unknown Img_DamegeType; //  0x288 Size(8)
	Unknown Img_Weapon; //  0x290 Size(8)
	Unknown ScaleBox_Weapon; //  0x298 Size(8)
	Unknown SizeBox_BroadType; //  0x2a0 Size(8)
	Unknown SizeBox_DamageType; //  0x2a8 Size(8)
	Unknown SizeBox_HeadShot; //  0x2b0 Size(8)
	Unknown T_Context; //  0x2b8 Size(8)
	Unknown U; //  0x2c0 Size(8)
	Unknown U; //  0x2c8 Size(8)
	struct FMulticastInlineDelegate OnTimeOut; //  0x2d0 Size(10)
	Unknown BroadcastDamageType; //  0x2e0 Size(50)
	Unknown MyTeamColor; //  0x330 Size(28)
	Unknown MyTeamKnockOutColor; //  0x358 Size(28)
	Unknown EnermyTeamColor; //  0x380 Size(28)
	Unknown EnermyTeamKnockOutColor; //  0x3a8 Size(28)
	Unknown DefaultColor; //  0x3d0 Size(28)
	Unknown DefaultKnockColor; //  0x3f8 Size(28)
	Unknown ResuscatedColor; //  0x420 Size(28)
	Unknown ParentWidgetRef; //  0x448 Size(8)
	Unknown Timer_StartHideAnim; //  0x450 Size(8)
	Unknown CurrentInfoColor; //  0x458 Size(28)

	void ResetInfos(); // Function U.U.ResetInfos(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelPopupWidget {
	Unknown UberGraphFrame; //  0x268 Size(8)
	Unknown Bg; //  0x270 Size(8)
	Unknown btn_Cancel; //  0x278 Size(8)
	Unknown btn_Ok; //  0x280 Size(8)
	Unknown Desc; //  0x288 Size(8)
	Unknown Image_2; //  0x290 Size(8)
	Unknown Overlay; //  0x298 Size(8)
	Unknown Overlay_1; //  0x2a0 Size(8)
	Unknown Overlay_2; //  0x2a8 Size(8)
	Unknown RichTextBlock_244; //  0x2b0 Size(8)
	Unknown TextBlock_17; //  0x2b8 Size(8)
	Unknown Throbber_159; //  0x2c0 Size(8)
	Unknown Title; //  0x2c8 Size(8)
	Unknown WidgetSwitcher_1; //  0x2d0 Size(8)
	struct FName MapNameToExit; //  0x2d8 Size(8)
	char IsExitGame; //  0x2e0 Size(1)
	Unknown ControllerRef; //  0x2e8 Size(8)
	char IsTutorial; //  0x2f0 Size(1)
	char IsDeathCam; //  0x2f1 Size(1)
	struct FMulticastInlineDelegate EventDispatcher_Mov; //  0x2f8 Size(10)
	char ErrorType; //  0x308 Size(1)
	char IsPerkDeckSelectMode; //  0x309 Size(1)
	struct FMulticastInlineDelegate EventDispatcher_TrySelectMo; //  0x310 Size(10)
	char OkayType; //  0x320 Size(1)

	void SetOptionChangedFromBenchmark(); // Function U.U.SetOptionChangedFromBenchmark(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	struct FName ItemRowName; //  0x248 Size(8)
	struct FString ConsoleCommandString; //  0x250 Size(10)
	struct FString GiveCount; //  0x260 Size(10)
	Unknown ItemType; //  0x270 Size(1)
	Unknown Icon; //  0x278 Size(8)
	char bSlot; //  0x280 Size(1)
	int32_t Count; //  0x284 Size(4)
	struct FName AmmoName; //  0x288 Size(8)
	struct FString AmmoCommandString; //  0x290 Size(10)
	int32_t AmmoCount; //  0x2a0 Size(4)
	Unknown BlackMarketMainRef; //  0x2a8 Size(8)
	Unknown BlackmarketDataInfo; //  0x2b0 Size(118)
	Unknown ConsoleMultiCommandString; //  0x3c8 Size(10)

	void SetConsoleMultiCommandString(Unknown& Str); // Function U.U.SetConsoleMultiCommandString(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown NewAnimation_2; //  0x250 Size(8)
	Unknown BackgroundBlur_1; //  0x258 Size(8)
	Unknown Blur; //  0x260 Size(8)
	Unknown CanvasPanel_1; //  0x268 Size(8)
	Unknown Focus; //  0x270 Size(8)
	Unknown FocusPanel; //  0x278 Size(8)
	Unknown Lobb; //  0x280 Size(8)
	Unknown U; //  0x288 Size(8)
	Unknown U; //  0x290 Size(8)
	Unknown U; //  0x298 Size(8)
	Unknown U; //  0x2a0 Size(8)
	Unknown U; //  0x2a8 Size(8)
	Unknown U; //  0x2b0 Size(8)
	Unknown NormalTextColor; //  0x2b8 Size(28)
	Unknown HoverTextColor; //  0x2e0 Size(28)
	Unknown Lobb; //  0x308 Size(8)
	Unknown NormalSelectedTextColor; //  0x310 Size(28)
	Unknown HoverSelectedTextColor; //  0x338 Size(28)
	Unknown NormalOptionButtonColor; //  0x360 Size(10)
	Unknown HoverOptionButtonColor; //  0x370 Size(10)
	Unknown MatchingPopupTimerHandle; //  0x380 Size(8)
	Unknown PopupKey; //  0x388 Size(18)
	char bExitPopupOpen; //  0x3a0 Size(1)
	char bOptionPopupOpen; //  0x3a1 Size(1)
	Unknown BattleMode; //  0x3a2 Size(1)
	Unknown Lobb; //  0x3a8 Size(8)
	Unknown SettingWidget; //  0x3b0 Size(8)
	Unknown Lobb; //  0x3b8 Size(8)
	struct FString CurrentTab; //  0x3c0 Size(10)
	Unknown U; //  0x3d0 Size(8)
	Unknown Lobb; //  0x3d8 Size(8)

	void EndCraft(); // Function U.U.EndCraft(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown Image_91; //  0x248 Size(8)
	Unknown InventoryCharacterRef; //  0x250 Size(8)
	char Visible; //  0x258 Size(1)

	Unknown GetVisibility_1(); // Function U.U.GetVisibility_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelMiniMapWidget {
	Unknown UberGraphFrame; //  0x260 Size(8)
	Unknown PlayerIconOnDamagingAnimation; //  0x268 Size(8)
	Unknown ShirinkingAnimation; //  0x270 Size(8)
	Unknown AlertIcon; //  0x278 Size(8)
	Unknown B; //  0x280 Size(8)
	Unknown B; //  0x288 Size(8)
	Unknown CircleInfoGroup; //  0x290 Size(8)
	Unknown C; //  0x298 Size(8)
	Unknown CurrentProgressBar; //  0x2a0 Size(8)
	Unknown Image_174; //  0x2a8 Size(8)
	Unknown Image_766; //  0x2b0 Size(8)
	Unknown InvalidationBox_2; //  0x2b8 Size(8)
	Unknown LulledGroup; //  0x2c0 Size(8)
	Unknown PhaseText; //  0x2c8 Size(8)
	Unknown PlayerIconGroup; //  0x2d0 Size(8)
	Unknown S; //  0x2d8 Size(8)
	Unknown SB_CircleInfo; //  0x2e0 Size(8)
	Unknown ShrinkingGroup; //  0x2e8 Size(8)
	Unknown Switcher; //  0x2f0 Size(8)
	Unknown U; //  0x2f8 Size(8)
	Unknown U; //  0x300 Size(8)
	int32_t State; //  0x308 Size(4)
	Unknown MapSize_Default; //  0x30c Size(8)
	Unknown MapSize_Extend; //  0x314 Size(8)
	int32_t InitializeCount; //  0x31c Size(4)
	char bExtendMode; //  0x320 Size(1)
	int32_t RecipeCount; //  0x324 Size(4)
	Unknown TargetCharacter; //  0x328 Size(8)

	void SetRecipeList(); // Function U.U.SetRecipeList(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Anim_Bouns; //  0x250 Size(8)
	Unknown 1; //  0x258 Size(8)
	Unknown 10; //  0x260 Size(8)
	Unknown 100; //  0x268 Size(8)
	Unknown 1000; //  0x270 Size(8)
	Unknown Empty; //  0x278 Size(8)
	Unknown Image_7; //  0x280 Size(8)
	Unknown Image_11; //  0x288 Size(8)
	Unknown Image_14; //  0x290 Size(8)
	Unknown Image_15; //  0x298 Size(8)
	Unknown Image_16; //  0x2a0 Size(8)
	Unknown Image_17; //  0x2a8 Size(8)
	Unknown Image_18; //  0x2b0 Size(8)
	Unknown Image_20; //  0x2b8 Size(8)
	Unknown Image_21; //  0x2c0 Size(8)
	Unknown Image_22; //  0x2c8 Size(8)
	Unknown Image_23; //  0x2d0 Size(8)
	Unknown Image_1473; //  0x2d8 Size(8)
	Unknown TextBlock_4; //  0x2e0 Size(8)
	Unknown TextLight_3; //  0x2e8 Size(8)
	int32_t Save; //  0x2f0 Size(4)
	Unknown LoopSound; //  0x2f4 Size(4)
	char IsStopSound; //  0x2f8 Size(1)

	void Divide(int32_t Value, int32_t& RetS1, int32_t& RetS2); // Function U.U.Divide(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelScopeWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Idle; //  0x250 Size(8)
	Unknown Scope_In; //  0x258 Size(8)
	Unknown CanvasPanel_1; //  0x260 Size(8)
	Unknown Distance_Image; //  0x268 Size(8)
	Unknown Distance_Text; //  0x270 Size(8)
	Unknown Magnify_Image; //  0x278 Size(8)
	Unknown Magnify_Text; //  0x280 Size(8)
	Unknown Scope_BG; //  0x288 Size(8)
	Unknown Scope_Info_Line; //  0x290 Size(8)
	Unknown Scope_Wing; //  0x298 Size(8)

	Unknown Get_Distance_Text_ColorAndOpacity_1(); // Function U.U.Get_Distance_Text_ColorAndOpacity_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown FadeIn; //  0x250 Size(8)
	Unknown CharacterPreviewImage; //  0x258 Size(8)
	Unknown Image_1; //  0x260 Size(8)
	Unknown ControllerRef; //  0x268 Size(8)

	Unknown Get_CharacterPreviewImage_Visibility_1(); // Function U.U.Get_CharacterPreviewImage_Visibility_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown IM; //  0x248 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelPlayerInfoWidget {
	Unknown UberGraphFrame; //  0x2c0 Size(8)
	Unknown Lung_Red; //  0x2c8 Size(8)
	Unknown Weaving_Stand; //  0x2d0 Size(8)
	Unknown Weaving_Sit; //  0x2d8 Size(8)
	Unknown HorizontalBox_Backpack_Star; //  0x2e0 Size(8)
	Unknown HorizontalBox_Chest_Star; //  0x2e8 Size(8)
	Unknown HorizontalBox_Damage; //  0x2f0 Size(8)
	Unknown HorizontalBox_Helmet_Star; //  0x2f8 Size(8)
	Unknown HorizontalBox_Levels; //  0x300 Size(8)
	Unknown Image_BackPack_Star; //  0x308 Size(8)
	Unknown Image_C4; //  0x310 Size(8)
	Unknown Image_Chest_Star; //  0x318 Size(8)
	Unknown Image_DamageBg; //  0x320 Size(8)
	Unknown Image_FireMode; //  0x328 Size(8)
	Unknown Image_Helmet_Star; //  0x330 Size(8)
	Unknown Image_Time; //  0x338 Size(8)
	Unknown Image_Timer; //  0x340 Size(8)
	Unknown Image_Weapon; //  0x348 Size(8)
	Unknown Overlay_Tab; //  0x350 Size(8)
	Unknown ProgressBar_Backpack; //  0x358 Size(8)
	Unknown ProgressBar_Chest; //  0x360 Size(8)
	Unknown ProgressBar_Helmet; //  0x368 Size(8)
	Unknown SizeBox_Backpack; //  0x370 Size(8)
	Unknown SizeBox_Chest; //  0x378 Size(8)
	Unknown SizeBox_Helmet; //  0x380 Size(8)
	Unknown T_C4Time; //  0x388 Size(8)
	Unknown T_Damage; //  0x390 Size(8)
	Unknown T_PerkWeaponAmmo; //  0x398 Size(8)
	Unknown T_SlotIndex; //  0x3a0 Size(8)
	Unknown T_WeaponName; //  0x3a8 Size(8)
	Unknown TextBlock_bulletCount; //  0x3b0 Size(8)
	Unknown TextBlock_bulletMaxCount; //  0x3b8 Size(8)
	Unknown U; //  0x3c0 Size(8)
	Unknown U_2; //  0x3c8 Size(8)
	Unknown U_3; //  0x3d0 Size(8)
	Unknown U_4; //  0x3d8 Size(8)
	Unknown U_5; //  0x3e0 Size(8)
	Unknown U_6; //  0x3e8 Size(8)
	Unknown U; //  0x3f0 Size(8)
	Unknown U; //  0x3f8 Size(8)
	Unknown WidgetSwitcher_Bullet; //  0x400 Size(8)
	Unknown WidgetSwitcher_C4; //  0x408 Size(8)
	Unknown WidgetSwitcher_Stance; //  0x410 Size(8)
	Unknown Anim_LastHeadbanging; //  0x418 Size(8)
	Unknown Timer_UpdateInfos; //  0x420 Size(8)
	char bIsCoolTimeWeapon; //  0x428 Size(1)
	Unknown CurrentWeapon; //  0x430 Size(8)
	Unknown TargetPawnRef; //  0x438 Size(8)
	Unknown CoolTimeMaterial; //  0x440 Size(8)
	Unknown WeaponInfo; //  0x448 Size(a8)
	int32_t SlotIndex; //  0x4f0 Size(4)

	void IsNoDamageWeapon(char& Weapon); // Function U.U.IsNoDamageWeapon(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Button_1; //  0x250 Size(8)
	Unknown death; //  0x258 Size(8)
	Unknown Image_168; //  0x260 Size(8)
	Unknown Image_216; //  0x268 Size(8)
	Unknown Image_506; //  0x270 Size(8)
	Unknown Image_623; //  0x278 Size(8)
	Unknown Img_LogOut; //  0x280 Size(8)
	Unknown Img_Voice; //  0x288 Size(8)
	Unknown Img_Voice_2; //  0x290 Size(8)
	Unknown Overlay_Death; //  0x298 Size(8)
	Unknown Slider_139; //  0x2a0 Size(8)
	Unknown T_PlayerIndex; //  0x2a8 Size(8)
	Unknown T_PlayerName; //  0x2b0 Size(8)
	Unknown TextBlock_209; //  0x2b8 Size(8)
	Unknown VerticalBox_1; //  0x2c0 Size(8)
	Unknown WidgetSwitcher; //  0x2c8 Size(8)
	struct FMulticastInlineDelegate EventDispatcher_ChangeVolumeState; //  0x2d0 Size(10)
	Unknown CurVoiceTalkState; //  0x2e0 Size(20)
	Unknown PingImage; //  0x300 Size(8)

	void SetInfo(Unknown VoiceTalkState); // Function U.U.SetInfo(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown T_Desc; //  0x248 Size(8)
	Unknown U_3; //  0x250 Size(8)
	Unknown ItemOption; //  0x258 Size(b8)

	void SetItemOption(Unknown& ItemOption); // Function U.U.SetItemOption(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Button_Focus; //  0x250 Size(8)
	Unknown HorizontalBox_1; //  0x258 Size(8)
	Unknown Image_223; //  0x260 Size(8)
	Unknown Img_Movie; //  0x268 Size(8)
	Unknown MediaPlayer; //  0x270 Size(8)
	char bPopup; //  0x278 Size(1)
	Unknown Media; //  0x280 Size(8)
	Unknown MediaSoundComp; //  0x288 Size(8)
	Unknown Game; //  0x290 Size(8)
	float GammaIntensity; //  0x298 Size(4)
	Unknown SkipNoticeTimer; //  0x2a0 Size(8)
	Unknown MediaTexture; //  0x2a8 Size(8)
	struct FName OpeningFileName; //  0x2b0 Size(8)
	char End; //  0x2b8 Size(1)

	void MoveNextScene(); // Function U.U.MoveNextScene(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelPlayerMarkerWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Anim_OnShow; //  0x250 Size(8)
	Unknown Canvas_Move; //  0x258 Size(8)
	Unknown IconImage; //  0x260 Size(8)
	Unknown Overlay_1; //  0x268 Size(8)
	Unknown PlayerMarker; //  0x270 Size(8)
	Unknown SizeBox_IconImage; //  0x278 Size(8)
	Unknown TeamIndex; //  0x280 Size(8)
	Unknown U; //  0x288 Size(8)
	Unknown WidgetSwitcher_Icon; //  0x290 Size(8)
	char IsShowingAnimReserv; //  0x298 Size(1)
	struct FMulticastInlineDelegate OnMarkerClicked; //  0x2a0 Size(10)
	Unknown CurrentMarker; //  0x2b0 Size(8)
	Unknown Map_PingTypeTexture; //  0x2b8 Size(50)
	Unknown Map_PingItemTypeTexture; //  0x308 Size(50)
	Unknown SupplyBoxNotOpen; //  0x358 Size(8)
	Unknown SupplyBoxOpened; //  0x360 Size(8)
	Unknown PlayerState; //  0x368 Size(8)
	char IsOnMap; //  0x370 Size(1)
	char Selected; //  0x371 Size(1)
	char MyPing; //  0x372 Size(1)

	Unknown OnMouseButtonDown(Unknown MyGeometry, Unknown& MouseEvent); // Function U.U.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelReplayListWidget {
	Unknown UberGraphFrame; //  0x260 Size(8)
	Unknown Button_Delete; //  0x268 Size(8)
	Unknown Button_Keep; //  0x270 Size(8)
	Unknown Button_OldFileDelete; //  0x278 Size(8)
	Unknown Button_Play; //  0x280 Size(8)
	Unknown Button_Refresh; //  0x288 Size(8)
	Unknown DetailInfo; //  0x290 Size(8)
	Unknown HorizontalBox_3; //  0x298 Size(8)
	Unknown HorizontalBox_4; //  0x2a0 Size(8)
	Unknown HorizontalBox_5; //  0x2a8 Size(8)
	Unknown HorizontalBox_01; //  0x2b0 Size(8)
	Unknown HorizontalBox_Version; //  0x2b8 Size(8)
	Unknown Image_1; //  0x2c0 Size(8)
	Unknown Image_483; //  0x2c8 Size(8)
	Unknown Image_1010; //  0x2d0 Size(8)
	Unknown Image_2531; //  0x2d8 Size(8)
	Unknown Image_2533; //  0x2e0 Size(8)
	Unknown Image_2535; //  0x2e8 Size(8)
	Unknown Image_3059; //  0x2f0 Size(8)
	Unknown Image_3229; //  0x2f8 Size(8)
	Unknown Image_3231; //  0x300 Size(8)
	Unknown Image_; //  0x308 Size(8)
	Unknown Image_ClassImage; //  0x310 Size(8)
	Unknown Image_Icon1; //  0x318 Size(8)
	Unknown Image_Icon2; //  0x320 Size(8)
	Unknown Image_Icon3; //  0x328 Size(8)
	Unknown Image_Icon4; //  0x330 Size(8)
	Unknown Image_MapImage; //  0x338 Size(8)
	Unknown Overlay; //  0x340 Size(8)
	Unknown ReplayListBox; //  0x348 Size(8)
	Unknown TextBlock_2388; //  0x350 Size(8)
	Unknown TextBlock_BattleMode; //  0x358 Size(8)
	Unknown TextBlock_BlueZoneMaxPlayerCount; //  0x360 Size(8)
	Unknown TextBlock_BlueZoneTitle; //  0x368 Size(8)
	Unknown TextBlock_ClassLevel1; //  0x370 Size(8)
	Unknown TextBlock_ClassLevel2; //  0x378 Size(8)
	Unknown TextBlock_ClassLevel3; //  0x380 Size(8)
	Unknown TextBlock_ClassLevel4; //  0x388 Size(8)
	Unknown TextBlock_ClassName1; //  0x390 Size(8)
	Unknown TextBlock_ClassName2; //  0x398 Size(8)
	Unknown TextBlock_ClassName3; //  0x3a0 Size(8)
	Unknown TextBlock_ClassName4; //  0x3a8 Size(8)
	Unknown TextBlock_CurrentFileCount; //  0x3b0 Size(8)
	Unknown TextBlock_Damage; //  0x3b8 Size(8)
	Unknown TextBlock_FPP; //  0x3c0 Size(8)
	Unknown TextBlock_Keep; //  0x3c8 Size(8)
	Unknown TextBlock_Kill; //  0x3d0 Size(8)
	Unknown TextBlock_LifeTime; //  0x3d8 Size(8)
	Unknown TextBlock_MapName; //  0x3e0 Size(8)
	Unknown TextBlock_Name1; //  0x3e8 Size(8)
	Unknown TextBlock_Name2; //  0x3f0 Size(8)
	Unknown TextBlock_Name3; //  0x3f8 Size(8)
	Unknown TextBlock_Name4; //  0x400 Size(8)
	Unknown TextBlock_Rank; //  0x408 Size(8)
	Unknown TextBlock_Time; //  0x410 Size(8)
	Unknown TextBlock_TotalPlayerCount; //  0x418 Size(8)
	Unknown TextBlock_TotalSize; //  0x420 Size(8)
	Unknown TextBlock_Weapon1; //  0x428 Size(8)
	Unknown TextBlock_Weapon2; //  0x430 Size(8)
	Unknown TextBlock_Weapon3; //  0x438 Size(8)
	Unknown TextBlock_Weapon4; //  0x440 Size(8)
	Unknown U; //  0x448 Size(8)
	Unknown U_3; //  0x450 Size(8)
	Unknown U_4; //  0x458 Size(8)
	Unknown U_5; //  0x460 Size(8)
	Unknown U_6; //  0x468 Size(8)
	Unknown U_7; //  0x470 Size(8)
	Unknown U_8; //  0x478 Size(8)
	Unknown U_9; //  0x480 Size(8)
	Unknown U_10; //  0x488 Size(8)
	Unknown U_11; //  0x490 Size(8)
	Unknown U_12; //  0x498 Size(8)
	Unknown U_13; //  0x4a0 Size(8)
	Unknown SelectedItemInfo; //  0x4a8 Size(128)

	void GetBattleModeString(int32_t Idx, struct FText& Str); // Function U.U.GetBattleModeString(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Button_Main; //  0x250 Size(8)
	Unknown Image_ClassIcon; //  0x258 Size(8)
	Unknown Image_ComingSoonBg; //  0x260 Size(8)
	Unknown Image_Disabled; //  0x268 Size(8)
	Unknown Image_Outline; //  0x270 Size(8)
	Unknown Image_Push; //  0x278 Size(8)
	Unknown Overlay_Main; //  0x280 Size(8)
	Unknown T_ComingSoon; //  0x288 Size(8)
	Unknown U; //  0x290 Size(8)
	Unknown U_2; //  0x298 Size(8)
	Unknown U_3; //  0x2a0 Size(8)
	Unknown U; //  0x2a8 Size(8)
	Unknown VerticalBox_Selected; //  0x2b0 Size(8)
	Unknown PerkDeckClassInfo; //  0x2b8 Size(28)
	int32_t SelectedNum; //  0x2e0 Size(4)
	int32_t SelectedMinIndex; //  0x2e4 Size(4)
	struct FMulticastInlineDelegate ChooseClass; //  0x2e8 Size(10)
	int32_t ClassIndex; //  0x2f8 Size(4)
	struct FMulticastInlineDelegate HoverClass; //  0x300 Size(10)
	char bIsLocalSelected; //  0x310 Size(1)
	char bIsSelected; //  0x311 Size(1)
	Unknown CurrentPerkDeckData; //  0x318 Size(4b0)
	char bIsDuplicateSelectPossible; //  0x7c8 Size(1)
	char bButtonDisabled; //  0x7c9 Size(1)
	char bNoUpdatedDisabled; //  0x7ca Size(1)
	char bIsBlocked; //  0x7cb Size(1)

	void SetBlocked(char IsBlocked, char ComingSoon); // Function U.U.SetBlocked(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelScopeWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Idle; //  0x250 Size(8)
	Unknown Scope_In; //  0x258 Size(8)
	Unknown CanvasPanel_1; //  0x260 Size(8)
	Unknown Scope_Center; //  0x268 Size(8)
	Unknown Scope_Center_Dot; //  0x270 Size(8)

	void SetScopeImageAngle(float NewAngle); // Function U.U.SetScopeImageAngle(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelMapCompWidget {
	Unknown UberGraphFrame; //  0x500 Size(8)
	Unknown Aircraft; //  0x508 Size(8)
	Unknown Background; //  0x510 Size(8)
	Unknown Canvas; //  0x518 Size(8)
	Unknown InvalidationBox_1; //  0x520 Size(8)
	Unknown TestDescentEndPoint_2; //  0x528 Size(8)
	Unknown TestDescentStartPoint_2; //  0x530 Size(8)
	Unknown TestLineRouteDotline_2; //  0x538 Size(8)
	int32_t MapDisplayInfoFlag; //  0x540 Size(4)
	struct FMulticastInlineDelegate OnWheelOnMap; //  0x548 Size(10)
	struct FMulticastInlineDelegate OnMouseButtonUpOnMap; //  0x558 Size(10)
	struct FMulticastInlineDelegate OnOb; //  0x568 Size(10)
	struct FMulticastInlineDelegate OnDragginOnMap; //  0x578 Size(10)
	char IsDragging; //  0x588 Size(1)
	float DeltaValue; //  0x58c Size(4)
	Unknown GridString_XAxis; //  0x590 Size(10)
	Unknown GridString_YAxis; //  0x5a0 Size(10)
	Unknown PersonalSupplyBoxRef; //  0x5b0 Size(8)
	Unknown ReplayFreeCamWidget; //  0x5b8 Size(8)
	float MapScaleInterpSpeed; //  0x5c0 Size(4)
	char MouseRightBtnDown; //  0x5c4 Size(1)
	Unknown SelectPingMenuTimer; //  0x5c8 Size(8)
	Unknown SelectionMenu; //  0x5d0 Size(8)
	struct FMulticastInlineDelegate OnMouseButtonDownOnMap; //  0x5d8 Size(10)
	Unknown MouseButtonDownPos; //  0x5e8 Size(8)
	char IsUpdateMapScale; //  0x5f0 Size(1)
	float MapScaleInerpSpeedRatio; //  0x5f4 Size(4)
	char IsDrawingRoutePing; //  0x5f8 Size(1)
	Unknown IgnoreAreaCircleLines; //  0x600 Size(10)

	void CheckAgreePing(char& bRet, Unknown& Location); // Function U.U.CheckAgreePing(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown BGImage; //  0x250 Size(8)
	Unknown BorderImage; //  0x258 Size(8)
	Unknown DisableImage; //  0x260 Size(8)
	Unknown Image_177; //  0x268 Size(8)
	Unknown ItemCount; //  0x270 Size(8)
	Unknown ItemImage; //  0x278 Size(8)
	Unknown WidgetReference; //  0x280 Size(8)
	char Lock; //  0x288 Size(1)
	Unknown InventoryDragType; //  0x289 Size(1)
	Unknown ChangeTarget; //  0x290 Size(8)
	Unknown PlayerHUDRef; //  0x298 Size(8)

	void GetBravoHotelPlayerHUD(Unknown& NewParam); // Function U.U.GetBravoHotelPlayerHUD(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown Image_3; //  0x248 Size(8)
	Unknown IM; //  0x250 Size(8)
	Unknown IM; //  0x258 Size(8)
	Unknown IM; //  0x260 Size(8)
	Unknown U; //  0x268 Size(8)

	Unknown OnClose(Unknown MyGeometry, Unknown& MouseEvent); // Function U.U.OnClose(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown LevelUp; //  0x250 Size(8)
	Unknown FadeOut; //  0x258 Size(8)
	Unknown FadeIn; //  0x260 Size(8)
	Unknown Idle; //  0x268 Size(8)
	Unknown CanvasPanel_2; //  0x270 Size(8)
	Unknown Image_336; //  0x278 Size(8)
	Unknown Image_Back; //  0x280 Size(8)
	Unknown Overlay_186; //  0x288 Size(8)
	Unknown PerkLastLevel; //  0x290 Size(8)
	Unknown PerkLevelText; //  0x298 Size(8)
	Unknown PerkName; //  0x2a0 Size(8)
	Unknown PerkSlotHover; //  0x2a8 Size(8)
	Unknown RichTextBlock_Desc; //  0x2b0 Size(8)
	Unknown TextBlock_1; //  0x2b8 Size(8)
	Unknown TextBlock_8; //  0x2c0 Size(8)
	Unknown U; //  0x2c8 Size(8)
	Unknown PerkInfo; //  0x2d0 Size(2c)
	Unknown PerkData; //  0x300 Size(e0)
	int32_t PerkLevel; //  0x3e0 Size(4)
	Unknown PerInGameData; //  0x3e8 Size(1c8)
	int32_t Index; //  0x5b0 Size(4)
	Unknown MainWiget; //  0x5b8 Size(8)
	float CurrentHeight; //  0x5c0 Size(4)
	int32_t LastPerkLevel; //  0x5c4 Size(4)
	Unknown DefaultPosition; //  0x5c8 Size(8)
	int32_t CurrenteLevel; //  0x5d0 Size(4)
	char IsPlayingUltimateSound; //  0x5d4 Size(1)

	char IsUltimateLevel(); // Function U.U.IsUltimateLevel(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown AdministratorPanel; //  0x250 Size(8)
	Unknown Cheat; //  0x258 Size(8)
	Unknown Image_Lock; //  0x260 Size(8)
	Unknown Image_Version; //  0x268 Size(8)
	Unknown ReplayListItemBtn_; //  0x270 Size(8)
	Unknown TextBlock_BattleMode; //  0x278 Size(8)
	Unknown TextBlock_Day; //  0x280 Size(8)
	Unknown TextBlock_FileSize; //  0x288 Size(8)
	Unknown TextBlock_FPP; //  0x290 Size(8)
	Unknown TextBlock_MapName; //  0x298 Size(8)
	Unknown TextBlock_Month; //  0x2a0 Size(8)
	Unknown TextBlock_PlayerRank; //  0x2a8 Size(8)
	Unknown TextBlock_PlayTime; //  0x2b0 Size(8)
	Unknown TextBlock_Time; //  0x2b8 Size(8)
	Unknown TextBlock_TotalCount; //  0x2c0 Size(8)
	Unknown TextBlock_TotalPlayerCount; //  0x2c8 Size(8)
	Unknown TextBlock_Year; //  0x2d0 Size(8)
	struct FMulticastInlineDelegate Click; //  0x2d8 Size(10)
	Unknown ReplayItemInfo; //  0x2e8 Size(128)
	Unknown Style; //  0x410 Size(278)
	Unknown ReplayListWidget; //  0x688 Size(8)

	void GetBattleModeString(int32_t Idx, struct FText& Str); // Function U.U.GetBattleModeString(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x3d8 Size(8)
	Unknown BT; //  0x3e0 Size(8)
	Unknown C; //  0x3e8 Size(8)
	Unknown IM; //  0x3f0 Size(8)
	Unknown IM; //  0x3f8 Size(8)
	Unknown IM; //  0x400 Size(8)
	Unknown IM; //  0x408 Size(8)
	Unknown IM; //  0x410 Size(8)
	Unknown IM; //  0x418 Size(8)
	Unknown Menu02; //  0x420 Size(8)
	Unknown Overlay_Mask; //  0x428 Size(8)
	Unknown TX; //  0x430 Size(8)
	Unknown TX; //  0x438 Size(8)
	Unknown TX; //  0x440 Size(8)

	void SetSlotInfo(Unknown BlackmarketDataInfo); // Function U.U.SetSlotInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelReplayPlayerListWidget {
	Unknown UberGraphFrame; //  0x2e0 Size(8)
	Unknown Bt_ListNext; //  0x2e8 Size(8)
	Unknown BT_ListPrev; //  0x2f0 Size(8)
	Unknown ScrollBox_PlayerItem; //  0x2f8 Size(8)
	Unknown T_SortType; //  0x300 Size(8)
	Unknown VB_ListMain; //  0x308 Size(8)

	Unknown CreatePlayerListGroup(Unknown PlayerState); // Function U.U.CreatePlayerListGroup(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x1360 Size(8)
	Unknown Ani_Tutorial_Glow; //  0x1368 Size(8)
	Unknown C_Slot_Up_Arrow; //  0x1370 Size(8)
	Unknown C_SlotHover_ItemState_Hide; //  0x1378 Size(8)
	Unknown C_SlotHover_ItemState_Show; //  0x1380 Size(8)
	Unknown C_SlotHover; //  0x1388 Size(8)
	Unknown BGImage; //  0x1390 Size(8)
	Unknown BGImage_2; //  0x1398 Size(8)
	Unknown CanvasPanel_ITemState; //  0x13a0 Size(8)
	Unknown Count120; //  0x13a8 Size(8)
	Unknown Crate_Default; //  0x13b0 Size(8)
	Unknown Crate_Hover; //  0x13b8 Size(8)
	Unknown Effect_Booster; //  0x13c0 Size(8)
	Unknown Effect_Capsule; //  0x13c8 Size(8)
	Unknown HorizontalBox_Rarity; //  0x13d0 Size(8)
	Unknown HoverImage; //  0x13d8 Size(8)
	Unknown HoverImage_Round; //  0x13e0 Size(8)
	Unknown Image_531; //  0x13e8 Size(8)
	Unknown Image_539; //  0x13f0 Size(8)
	Unknown Image_540; //  0x13f8 Size(8)
	Unknown Image_541; //  0x1400 Size(8)
	Unknown Image_542; //  0x1408 Size(8)
	Unknown Image_543; //  0x1410 Size(8)
	Unknown Image_544; //  0x1418 Size(8)
	Unknown Image_Bindable; //  0x1420 Size(8)
	Unknown Image_Supply; //  0x1428 Size(8)
	Unknown ItemImage; //  0x1430 Size(8)
	Unknown ItemState_Text; //  0x1438 Size(8)
	Unknown KeepedItem_List; //  0x1440 Size(8)
	Unknown KeepedItem_ListHover; //  0x1448 Size(8)
	Unknown LvColor; //  0x1450 Size(8)
	Unknown Motion; //  0x1458 Size(8)
	Unknown ProgressBar_309; //  0x1460 Size(8)
	Unknown SizeBox_1; //  0x1468 Size(8)
	Unknown TextBlock_3; //  0x1470 Size(8)
	Unknown Tutorial_Glow; //  0x1478 Size(8)
	Unknown U; //  0x1480 Size(8)
	Unknown U; //  0x1488 Size(8)
	Unknown WeaponColorBg; //  0x1490 Size(8)
	Unknown WeaponEquipItem_Default; //  0x1498 Size(8)
	Unknown WeaponEquipItem_Hov; //  0x14a0 Size(8)
	Unknown WeaponItemImage; //  0x14a8 Size(8)
	int32_t InventoryItemInfoIndex; //  0x14b0 Size(4)
	Unknown MedicalBGColor; //  0x14b4 Size(10)
	int32_t CurCount; //  0x14c4 Size(4)
	struct FMulticastInlineDelegate SetSlotInfo; //  0x14c8 Size(10)
	char CanUseCapsule; //  0x14d8 Size(1)
	Unknown SelectedHoverImage; //  0x14e0 Size(8)
	Unknown ShowRarityStar; //  0x14e8 Size(10)
	Unknown ShowIconBG; //  0x14f8 Size(10)

	void CheckBoosterItem(char& IsBoost, Unknown& OutColor, Unknown& OutTexture); // Function U.U.CheckBoosterItem(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelSkillMapWidget {
	Unknown UberGraphFrame; //  0x250 Size(8)
	Unknown Tutorial_MouseCursor; //  0x258 Size(8)
	Unknown Tutorial_Arrow_Loop2; //  0x260 Size(8)
	Unknown RadarDecoLight; //  0x268 Size(8)
	Unknown RadarCircle_M; //  0x270 Size(8)
	Unknown BackgroundBlur_154; //  0x278 Size(8)
	Unknown B; //  0x280 Size(8)
	Unknown Button_Nuclear; //  0x288 Size(8)
	Unknown CP_RealMapSize; //  0x290 Size(8)
	Unknown Image; //  0x298 Size(8)
	Unknown Image_2; //  0x2a0 Size(8)
	Unknown Image_3; //  0x2a8 Size(8)
	Unknown Image_4; //  0x2b0 Size(8)
	Unknown Image_5; //  0x2b8 Size(8)
	Unknown Image_6; //  0x2c0 Size(8)
	Unknown Image_7; //  0x2c8 Size(8)
	Unknown Image_171; //  0x2d0 Size(8)
	Unknown Image_181; //  0x2d8 Size(8)
	Unknown Image_228; //  0x2e0 Size(8)
	Unknown Image_326; //  0x2e8 Size(8)
	Unknown Image_405; //  0x2f0 Size(8)
	Unknown Image_508; //  0x2f8 Size(8)
	Unknown Img_MapBackGround; //  0x300 Size(8)
	Unknown Img_MapCenter; //  0x308 Size(8)
	Unknown Img_RadarDummy; //  0x310 Size(8)
	Unknown Tutorial; //  0x318 Size(8)
	Unknown U; //  0x320 Size(8)
	Unknown MapBackGroundPosition; //  0x328 Size(8)
	Unknown RadarDummyPosition; //  0x330 Size(8)

	void MapClickEvent(Unknown ClickLocation); // Function U.U.MapClickEvent(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown Image_2; //  0x248 Size(8)
	Unknown InvalidationBox_1; //  0x250 Size(8)
	Unknown Switcher; //  0x258 Size(8)
	float OwnDirection; //  0x260 Size(4)

	void Initialize(float Direction); // Function U.U.Initialize(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown MySeatColor; //  0x248 Size(10)
	Unknown WheelGroup; //  0x258 Size(8)
	Unknown SeatGroup; //  0x260 Size(8)

	void Setup(Unknown VehicleInstance); // Function U.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Button_Tab; //  0x250 Size(8)
	Unknown Image_Check; //  0x258 Size(8)
	Unknown TextBlock_TabName; //  0x260 Size(8)
	Unknown BlackMarket_SubTab; //  0x268 Size(8)
	Unknown TabType; //  0x270 Size(1)
	struct FText TabName; //  0x278 Size(18)
	struct FName TabIndex; //  0x290 Size(8)
	char Selected; //  0x298 Size(1)

	Unknown Get_TextBlock_TabName_ColorAndOpacity_1(); // Function U.U.Get_TextBlock_TabName_ColorAndOpacity_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x1360 Size(8)
	Unknown Anim_LoopHintMainWeapon; //  0x1368 Size(8)
	Unknown Anim_Material_Get; //  0x1370 Size(8)
	Unknown Anim_Material_Hover; //  0x1378 Size(8)
	Unknown Anim_Upgrade; //  0x1380 Size(8)
	Unknown Anim_Progress; //  0x1388 Size(8)
	Unknown WeaponPerk_fadeIn; //  0x1390 Size(8)
	Unknown Anim_LoopNotifySubWeapon; //  0x1398 Size(8)
	Unknown Anim_StartNotifySubWeapon; //  0x13a0 Size(8)
	Unknown Anim_LoopNotifyMainWeapon; //  0x13a8 Size(8)
	Unknown Anim_StartNotifyMainWeapon; //  0x13b0 Size(8)
	Unknown Ammo01; //  0x13b8 Size(8)
	Unknown Ammo02; //  0x13c0 Size(8)
	Unknown AmmoInfo01; //  0x13c8 Size(8)
	Unknown AmmoInfo02; //  0x13d0 Size(8)
	Unknown Barrel01; //  0x13d8 Size(8)
	Unknown BG01; //  0x13e0 Size(8)
	Unknown BG02; //  0x13e8 Size(8)
	Unknown BorderImage02; //  0x13f0 Size(8)
	Unknown btn_RecipeTree; //  0x13f8 Size(8)
	Unknown ButtStockSlot01; //  0x1400 Size(8)
	Unknown ButtStockSlot02; //  0x1408 Size(8)
	Unknown Canvas_AnimMain; //  0x1410 Size(8)
	Unknown Canvas_AnimMain_Progress; //  0x1418 Size(8)
	Unknown Canvas_AnimMain_Upgrade; //  0x1420 Size(8)
	Unknown Canvas_AnimSub; //  0x1428 Size(8)
	Unknown Choice_BG01; //  0x1430 Size(8)
	Unknown Choice_BG02; //  0x1438 Size(8)
	Unknown GripSlot01; //  0x1440 Size(8)
	Unknown HorizontalBox_Perk; //  0x1448 Size(8)
	Unknown HorizontalBox_Rarity1; //  0x1450 Size(8)
	Unknown HorizontalBox_Rarity2; //  0x1458 Size(8)
	Unknown Image_2; //  0x1460 Size(8)
	Unknown Image_3; //  0x1468 Size(8)
	Unknown Image_5; //  0x1470 Size(8)
	Unknown Image_7; //  0x1478 Size(8)
	Unknown Image_48; //  0x1480 Size(8)
	Unknown Image_85; //  0x1488 Size(8)
	Unknown Image_86; //  0x1490 Size(8)
	Unknown Image_175; //  0x1498 Size(8)
	Unknown Image_202; //  0x14a0 Size(8)
	Unknown Image_212; //  0x14a8 Size(8)
	Unknown Image_214; //  0x14b0 Size(8)
	Unknown Image_217; //  0x14b8 Size(8)
	Unknown Image_219; //  0x14c0 Size(8)
	Unknown Image_234; //  0x14c8 Size(8)
	Unknown Image_356; //  0x14d0 Size(8)
	Unknown Image_369; //  0x14d8 Size(8)
	Unknown Image_371; //  0x14e0 Size(8)
	Unknown Image_372; //  0x14e8 Size(8)
	Unknown Image_682; //  0x14f0 Size(8)
	Unknown Image_805; //  0x14f8 Size(8)
	Unknown Image_807; //  0x1500 Size(8)
	Unknown Image_808; //  0x1508 Size(8)
	Unknown Image_809; //  0x1510 Size(8)
	Unknown Image_1071; //  0x1518 Size(8)
	Unknown Image_Bindable; //  0x1520 Size(8)
	Unknown Image_Supply; //  0x1528 Size(8)
	Unknown ImageAmmo01; //  0x1530 Size(8)
	Unknown ImageAmmo02; //  0x1538 Size(8)
	Unknown Info01; //  0x1540 Size(8)
	Unknown Info02; //  0x1548 Size(8)
	Unknown Line01; //  0x1550 Size(8)
	Unknown Line02; //  0x1558 Size(8)
	Unknown MagazineSlot01; //  0x1560 Size(8)
	Unknown MagazineSlot02; //  0x1568 Size(8)
	Unknown MainWeaponSlot; //  0x1570 Size(8)
	Unknown MuzzleDeviceSlot01; //  0x1578 Size(8)
	Unknown MuzzleDeviceSlot02; //  0x1580 Size(8)
	Unknown Overlay_2; //  0x1588 Size(8)
	Unknown Perk01; //  0x1590 Size(8)
	Unknown Perk01_Sub; //  0x1598 Size(8)
	Unknown Perk02; //  0x15a0 Size(8)
	Unknown Perk02_Sub; //  0x15a8 Size(8)
	Unknown Perk03; //  0x15b0 Size(8)
	Unknown Perk03_Sub; //  0x15b8 Size(8)
	Unknown Perk04; //  0x15c0 Size(8)
	Unknown Perk04_Sub; //  0x15c8 Size(8)
	Unknown SightSlot01; //  0x15d0 Size(8)
	Unknown SightSlot02; //  0x15d8 Size(8)
	Unknown SubWeaponSlot; //  0x15e0 Size(8)
	Unknown TextBlock_1; //  0x15e8 Size(8)
	Unknown TextBlock_Range01; //  0x15f0 Size(8)
	Unknown TopNameBG01; //  0x15f8 Size(8)
	Unknown TopNameBG02; //  0x1600 Size(8)
	Unknown U; //  0x1608 Size(8)
	Unknown U; //  0x1610 Size(8)
	Unknown U_2; //  0x1618 Size(8)
	Unknown U_3; //  0x1620 Size(8)
	Unknown U; //  0x1628 Size(8)
	Unknown WeaponImage01; //  0x1630 Size(8)
	Unknown WeaponImage02; //  0x1638 Size(8)
	Unknown WeaponIndex01; //  0x1640 Size(8)
	Unknown WeaponIndex02; //  0x1648 Size(8)
	Unknown WeaponName01; //  0x1650 Size(8)
	Unknown WeaponName02; //  0x1658 Size(8)
	Unknown WeaponTitle01; //  0x1660 Size(8)
	Unknown WeaponTitle02; //  0x1668 Size(8)
	Unknown WidgetSwitcher_1; //  0x1670 Size(8)
	Unknown WidgetSwitcher_Rarity; //  0x1678 Size(8)
	Unknown WidgetSwitcher_SpecialWeapo; //  0x1680 Size(8)
	Unknown WeaponType; //  0x1688 Size(1)
	int32_t SlotIndex; //  0x168c Size(4)
	Unknown WeaponBase; //  0x1690 Size(8)
	char bCanEquip; //  0x1698 Size(1)
	Unknown WeaponAttachmentSlots01; //  0x16a0 Size(50)
	Unknown WeaponAttachmentSlots02; //  0x16f0 Size(50)
	float WeaponIconHeight; //  0x1740 Size(4)
	char bHover; //  0x1744 Size(1)
	Unknown HoverWidget; //  0x1748 Size(8)
	int32_t NotifyAnimLoopNum; //  0x1750 Size(4)

	void IsEquipped(char& Return); // Function U.U.IsEquipped(Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelTeamInfoWidget {
	Unknown UberGraphFrame; //  0x258 Size(8)
	Unknown U; //  0x260 Size(8)
	Unknown U_2; //  0x268 Size(8)
	Unknown VerticalBox_InfoList; //  0x270 Size(8)

	Unknown CreateSlot(); // Function U.U.CreateSlot(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Image_92; //  0x250 Size(8)
	Unknown Image_253; //  0x258 Size(8)
	Unknown Image_774; //  0x260 Size(8)
	Unknown PerkInfo; //  0x268 Size(2c)
	Unknown PerkData; //  0x298 Size(e0)
	Unknown IconBrush; //  0x378 Size(88)
	Unknown Popup; //  0x400 Size(8)

	Unknown GetColorAndOpacity_1(); // Function U.U.GetColorAndOpacity_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelKillInfoSlotWidget {
	Unknown UberGraphFrame; //  0x258 Size(8)
	Unknown Anim_Hide; //  0x260 Size(8)
	Unknown Anim_Down; //  0x268 Size(8)
	Unknown HorizontalBox_Killer; //  0x270 Size(8)
	Unknown ScaleBox_KillerIcon; //  0x278 Size(8)
	Unknown T_ClassIcon; //  0x280 Size(8)
	Unknown T_Level; //  0x288 Size(8)
	Unknown T_LV; //  0x290 Size(8)
	Unknown T_Name; //  0x298 Size(8)
	struct FMulticastInlineDelegate OnTimeOut; //  0x2a0 Size(10)
	Unknown LocalPlayerState; //  0x2b0 Size(8)

	void OnLoaded_9DF86FA64782B378E42DBB813545BD34(Unknown Loaded); // Function U.U.OnLoaded_9DF86FA64782B378E42DBB813545BD34(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown U; //  0x250 Size(8)
	Unknown HoverWidget; //  0x258 Size(8)

	void OnMouseEnter(Unknown MyGeometry, Unknown& MouseEvent); // Function U.U.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelGameBuffSlot {
	Unknown UberGraphFrame; //  0x2f8 Size(8)
	Unknown Anim_Boost_Off; //  0x300 Size(8)
	Unknown Anim_Boost_On; //  0x308 Size(8)
	Unknown CanvasPanel_BoostInfo; //  0x310 Size(8)
	Unknown Image_Active; //  0x318 Size(8)
	Unknown IMG_CoolTime; //  0x320 Size(8)
	Unknown T_CoolTime; //  0x328 Size(8)
	Unknown MI_CoolTimeDynamicInstance; //  0x330 Size(8)
	Unknown MI_BuffActive; //  0x338 Size(8)
	float BoostOffAnimTime; //  0x340 Size(4)
	char IsActive; //  0x344 Size(1)
	Unknown BoostBuffInfo; //  0x348 Size(188)

	void SetIsActive(char bActive); // Function U.U.SetIsActive(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelItemRecipeTreeWidget {
	Unknown UberGraphFrame; //  0x258 Size(8)
	Unknown HorizontalBox_11; //  0x260 Size(8)
	Unknown HorizontalBox_12; //  0x268 Size(8)
	Unknown HorizontalBox_13; //  0x270 Size(8)
	Unknown HorizontalBox_14; //  0x278 Size(8)
	Unknown HorizontalBox_15; //  0x280 Size(8)
	Unknown HorizontalBox_16; //  0x288 Size(8)
	Unknown HorizontalBox_00; //  0x290 Size(8)
	Unknown HorizontalBox_02; //  0x298 Size(8)
	Unknown HorizontalBox_03; //  0x2a0 Size(8)
	Unknown HorizontalBox_04; //  0x2a8 Size(8)
	Unknown HorizontalBox_05; //  0x2b0 Size(8)
	Unknown HorizontalBox_06; //  0x2b8 Size(8)
	Unknown HorizontalBox_07; //  0x2c0 Size(8)
	Unknown HorizontalBox_08; //  0x2c8 Size(8)
	Unknown HorizontalBox_09; //  0x2d0 Size(8)
	Unknown Line00; //  0x2d8 Size(8)
	Unknown Line01; //  0x2e0 Size(8)
	Unknown Line02; //  0x2e8 Size(8)
	Unknown Line03; //  0x2f0 Size(8)
	Unknown Line04; //  0x2f8 Size(8)
	Unknown Line05; //  0x300 Size(8)
	Unknown Line06; //  0x308 Size(8)
	Unknown Line07; //  0x310 Size(8)
	Unknown Line08; //  0x318 Size(8)
	Unknown Line09; //  0x320 Size(8)
	Unknown Line10; //  0x328 Size(8)
	Unknown Line11; //  0x330 Size(8)
	Unknown Line12; //  0x338 Size(8)
	Unknown Line13; //  0x340 Size(8)
	Unknown Line14; //  0x348 Size(8)
	Unknown Line15; //  0x350 Size(8)
	Unknown Overlay_Main; //  0x358 Size(8)
	Unknown Slot00; //  0x360 Size(8)
	Unknown Slot01; //  0x368 Size(8)
	Unknown Slot02; //  0x370 Size(8)
	Unknown Slot03; //  0x378 Size(8)
	Unknown Slot04; //  0x380 Size(8)
	Unknown Slot05; //  0x388 Size(8)
	Unknown Slot06; //  0x390 Size(8)
	Unknown Slot07; //  0x398 Size(8)
	Unknown Slot08; //  0x3a0 Size(8)
	Unknown Slot09; //  0x3a8 Size(8)
	Unknown Slot10; //  0x3b0 Size(8)
	Unknown Slot11; //  0x3b8 Size(8)
	Unknown Slot12; //  0x3c0 Size(8)
	Unknown Slot13; //  0x3c8 Size(8)
	Unknown Slot14; //  0x3d0 Size(8)
	Unknown Slot15; //  0x3d8 Size(8)
	Unknown Slot16; //  0x3e0 Size(8)
	Unknown Slot17; //  0x3e8 Size(8)
	Unknown Slot18; //  0x3f0 Size(8)
	Unknown Slot19; //  0x3f8 Size(8)
	Unknown Slot20; //  0x400 Size(8)
	Unknown Slot21; //  0x408 Size(8)
	Unknown Slot22; //  0x410 Size(8)
	Unknown Slot23; //  0x418 Size(8)
	Unknown Slot24; //  0x420 Size(8)
	Unknown Slot25; //  0x428 Size(8)
	Unknown Slot26; //  0x430 Size(8)
	Unknown Slot27; //  0x438 Size(8)
	Unknown Slot28; //  0x440 Size(8)
	Unknown Slot29; //  0x448 Size(8)
	Unknown Slot30; //  0x450 Size(8)
	Unknown Slot31; //  0x458 Size(8)
	Unknown VerticalBox_2438; //  0x460 Size(8)
	Unknown HoverWidget; //  0x468 Size(8)
	struct FName HaveItemKey; //  0x470 Size(8)
	struct FName TargetItemKey; //  0x478 Size(8)
	char IsSearchExpertWeapon; //  0x480 Size(1)

	void ShowTreeNode(Unknown WidgetInfo, char bShow, char bCombinable); // Function U.U.ShowTreeNode(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelFallingWidget {
	Unknown UberGraphFrame; //  0x270 Size(8)
	Unknown Parachute_Loop; //  0x278 Size(8)
	Unknown Parachute_Open; //  0x280 Size(8)
	Unknown Canvas; //  0x288 Size(8)
	Unknown HorizontalBox_Ground; //  0x290 Size(8)
	Unknown HorizontalBox_Parachute; //  0x298 Size(8)
	Unknown HorizontalBox_Sea; //  0x2a0 Size(8)
	Unknown Image_797; //  0x2a8 Size(8)
	Unknown Image_798; //  0x2b0 Size(8)
	Unknown Overlay_Speed; //  0x2b8 Size(8)
	Unknown Parachute; //  0x2c0 Size(8)
	Unknown Player; //  0x2c8 Size(8)
	Unknown PlayerGroup; //  0x2d0 Size(8)
	Unknown SeaHeight; //  0x2d8 Size(8)
	Unknown Speed; //  0x2e0 Size(8)
	Unknown TerrainHeight; //  0x2e8 Size(8)
	char IsParachute; //  0x2f0 Size(1)

	void SetParachuteInfo(Unknown SetParachuteInfo); // Function U.U.SetParachuteInfo(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelItemUseWidget {
	Unknown UberGraphFrame; //  0x268 Size(8)
	Unknown Flicker; //  0x270 Size(8)
	Unknown BaseGuage; //  0x278 Size(8)
	Unknown Guage; //  0x280 Size(8)
	Unknown HB_CancelMessage; //  0x288 Size(8)
	Unknown Image_921; //  0x290 Size(8)
	Unknown Percent; //  0x298 Size(8)
	Unknown ProgressBar_Item; //  0x2a0 Size(8)
	Unknown RichT_Message; //  0x2a8 Size(8)
	Unknown TextBlock_1; //  0x2b0 Size(8)
	Unknown TextBlock_Time; //  0x2b8 Size(8)
	Unknown UseMessage; //  0x2c0 Size(8)
	Unknown VerticalBox_2; //  0x2c8 Size(8)
	float PercentValue; //  0x2d0 Size(4)
	char KnockState; //  0x2d4 Size(1)
	float HideTimer; //  0x2d8 Size(4)
	Unknown ProgressStyle; //  0x2e0 Size(1a0)
	char IsShowRevive; //  0x480 Size(1)
	Unknown CastingInfo; //  0x488 Size(18)
	float CurrentTime; //  0x4a0 Size(4)
	int32_t KeyFontSize; //  0x4a4 Size(4)
	float KeySizeScale; //  0x4a8 Size(4)
	int32_t CurrentLanguage; //  0x4ac Size(4)

	void CheckLanguage(); // Function U.U.CheckLanguage(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Image_ClassIcon; //  0x250 Size(8)
	Unknown TextBlock_ClassName; //  0x258 Size(8)
	Unknown TextBlock_Count; //  0x260 Size(8)

	void SetClassCount(int32_t Count); // Function U.U.SetClassCount(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelReplayPlayerListItem {
	Unknown UberGraphFrame; //  0x270 Size(8)
	Unknown BT_PlayerName; //  0x278 Size(8)
	Unknown PB_HP; //  0x280 Size(8)
	Unknown T_PlayerName; //  0x288 Size(8)
	Unknown T_PlayerNameHighlight; //  0x290 Size(8)
	Unknown T_SortInfo; //  0x298 Size(8)
	char bIsTargetPawn; //  0x2a0 Size(1)
	char bIsAlive; //  0x2a1 Size(1)

	void UpdateHighlightNameColor(); // Function U.U.UpdateHighlightNameColor(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelReplayPlayerListGroup {
	Unknown UberGraphFrame; //  0x260 Size(8)
	Unknown Img_TeamColor; //  0x268 Size(8)
	Unknown T_TeamNum; //  0x270 Size(8)
	Unknown VB_PlayerList; //  0x278 Size(8)

	void CheckEmptyGroup(); // Function U.U.CheckEmptyGroup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelReplayTimelineEventMarker {
	Unknown UberGraphFrame; //  0x290 Size(8)
	Unknown MarkerBorder; //  0x298 Size(8)

	void K2_SetKillEvent(char IsMyInfo); // Function U.U.K2_SetKillEvent(Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x2a0 Size(8)
	Unknown VisualBorder; //  0x2a8 Size(8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelReplayTimelineWidget {
	Unknown UberGraphFrame; //  0x360 Size(8)
	Unknown Bg; //  0x368 Size(8)
	Unknown Border_Timeline; //  0x370 Size(8)
	Unknown Border_TimeToGo; //  0x378 Size(8)
	Unknown BT_FreeCam; //  0x380 Size(8)
	Unknown BT_ReplayPause; //  0x388 Size(8)
	Unknown BT_ReplayResume; //  0x390 Size(8)
	Unknown BT_SpeedDown; //  0x398 Size(8)
	Unknown BT_SpeedUp; //  0x3a0 Size(8)
	Unknown BT_TimelineScaleDown; //  0x3a8 Size(8)
	Unknown BT_TimelineScaleUp; //  0x3b0 Size(8)
	Unknown Canvas_EventMarkers; //  0x3b8 Size(8)
	Unknown Chk_ShowKill; //  0x3c0 Size(8)
	Unknown Chk_ShowKnockout; //  0x3c8 Size(8)
	Unknown Chk_ShowMyKill; //  0x3d0 Size(8)
	Unknown Chk_ShowMyKnockout; //  0x3d8 Size(8)
	Unknown Chk_ShowMyResuscitated; //  0x3e0 Size(8)
	Unknown Chk_ShowResuscitated; //  0x3e8 Size(8)
	Unknown ReplayTimelineSlider; //  0x3f0 Size(8)
	Unknown ScrollBox_Timeline; //  0x3f8 Size(8)
	Unknown SizeBox_Timeline; //  0x400 Size(8)
	Unknown Slider_TimelineScale; //  0x408 Size(8)
	Unknown T_CameraType; //  0x410 Size(8)
	Unknown T_CurrentTime; //  0x418 Size(8)
	Unknown T_PlaySpeed; //  0x420 Size(8)
	Unknown T_TimeToGo; //  0x428 Size(8)
	Unknown T_TotalTime; //  0x430 Size(8)
	float TimelineSizeBoxOffset; //  0x438 Size(4)
	Unknown Class_EventMarker_Kill; //  0x440 Size(8)
	Unknown Class_EventMarker_Knockout; //  0x448 Size(8)
	float LastViewportSize; //  0x450 Size(4)
	char IsMouseOnBorder; //  0x454 Size(1)
	Unknown Class_EventMarker_Resuscitated; //  0x458 Size(8)
	Unknown Class_EventMarker_WhenReported; //  0x460 Size(8)
	Unknown CameraType; //  0x468 Size(1)
	Unknown ViewMode; //  0x469 Size(1)

	void CheckCameraType(); // Function U.U.CheckCameraType(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown ArmorSlot; //  0x248 Size(8)
	Unknown BagSlot; //  0x250 Size(8)
	Unknown BottomSlot; //  0x258 Size(8)
	Unknown EyeWearSlot; //  0x260 Size(8)
	Unknown GhillieSlot; //  0x268 Size(8)
	Unknown GlovesSlot; //  0x270 Size(8)
	Unknown HatSlot; //  0x278 Size(8)
	Unknown HelmetSlot; //  0x280 Size(8)
	Unknown MaskSlot; //  0x288 Size(8)
	Unknown OuterSlot; //  0x290 Size(8)
	Unknown ShoesSlot; //  0x298 Size(8)
	Unknown TopSlot; //  0x2a0 Size(8)
	Unknown U; //  0x2a8 Size(8)
	Unknown Timer_UpdateItemList; //  0x2b0 Size(8)

	void SetEquippedSlot(Unknown InventoryItemInfo); // Function U.U.SetEquippedSlot(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown FollowCamGuide; //  0x248 Size(8)
	Unknown FreeCamGuide; //  0x250 Size(8)
	Unknown KeyImageWidget_C_1; //  0x258 Size(8)
	Unknown KeyImageWidget_C_2; //  0x260 Size(8)
	Unknown KeyImageWidget_C_3; //  0x268 Size(8)
	Unknown KeyImageWidget_C_4; //  0x270 Size(8)
	Unknown KeyImageWidget_C_5; //  0x278 Size(8)
	Unknown KeyImageWidget_C_6; //  0x280 Size(8)
	Unknown KeyImageWidget_C_7; //  0x288 Size(8)
	Unknown KeyImageWidget_C_8; //  0x290 Size(8)
	Unknown KeyImageWidget_C_10; //  0x298 Size(8)
	Unknown KeyImageWidget_C_153; //  0x2a0 Size(8)
	Unknown KeyImageWidget_C_154; //  0x2a8 Size(8)
	Unknown KeyImageWidget_C_155; //  0x2b0 Size(8)
	Unknown KeyImageWidget_C_157; //  0x2b8 Size(8)
	Unknown KeyImageWidget_C_158; //  0x2c0 Size(8)
	Unknown KeyImageWidget_C_159; //  0x2c8 Size(8)
	Unknown KeyImageWidget_C_160; //  0x2d0 Size(8)
	Unknown KillCamGuide; //  0x2d8 Size(8)
	Unknown T_Guide; //  0x2e0 Size(8)
	Unknown TextBlock_1; //  0x2e8 Size(8)
	Unknown TextBlock_2; //  0x2f0 Size(8)
	Unknown TextBlock_4; //  0x2f8 Size(8)
	Unknown TextBlock_5; //  0x300 Size(8)
	Unknown TextBlock_6; //  0x308 Size(8)
	Unknown TextBlock_7; //  0x310 Size(8)
	Unknown TextBlock_8; //  0x318 Size(8)
	Unknown TextBlock_9; //  0x320 Size(8)
	Unknown TextBlock_10; //  0x328 Size(8)
	Unknown TextBlock_11; //  0x330 Size(8)
	Unknown TextBlock_13; //  0x338 Size(8)
	Unknown TextBlock_14; //  0x340 Size(8)
	Unknown TextBlock_15; //  0x348 Size(8)
	Unknown TextBlock_16; //  0x350 Size(8)
	Unknown TextBlock_17; //  0x358 Size(8)
	Unknown WidgetSwitcher_132; //  0x360 Size(8)

	void SetKillCamGuide(); // Function U.U.SetKillCamGuide(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown Image_136; //  0x248 Size(8)
	Unknown Slider_Speed; //  0x250 Size(8)
	Unknown T_CamSpeed; //  0x258 Size(8)
	Unknown Handle_HideFreeCamSpeed; //  0x260 Size(8)

	void HideFreeCamSpeed(); // Function U.U.HideFreeCamSpeed(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Anim_Hide_Ima; //  0x250 Size(8)
	Unknown Anim_Hide_text; //  0x258 Size(8)
	Unknown Anim_Show_Ima; //  0x260 Size(8)
	Unknown Anim_Show_text; //  0x268 Size(8)
	Unknown Canvas_Main; //  0x270 Size(8)
	Unknown HorizontalBox_86; //  0x278 Size(8)
	Unknown Image_130; //  0x280 Size(8)
	Unknown Image_811; //  0x288 Size(8)
	Unknown Img_MapImage; //  0x290 Size(8)
	Unknown MatchType; //  0x298 Size(8)
	Unknown MaxPlayerCount; //  0x2a0 Size(8)
	Unknown Overlay_Text; //  0x2a8 Size(8)
	Unknown PersonType; //  0x2b0 Size(8)
	Unknown T_MapImageDesc; //  0x2b8 Size(8)
	Unknown T_MapImageTitle; //  0x2c0 Size(8)
	Unknown Ultimate; //  0x2c8 Size(8)
	char IsShowText; //  0x2d0 Size(1)
	Unknown Timer_HideMapImage; //  0x2d8 Size(8)
	int32_t LastZoomLevel; //  0x2e0 Size(4)
	float WantOpacity; //  0x2e4 Size(4)
	Unknown MainWidgetRef; //  0x2e8 Size(8)
	char IsShowImage; //  0x2f0 Size(1)
	Unknown LastWidgetType; //  0x2f1 Size(1)
	struct FText UltimateText; //  0x2f8 Size(18)

	void UpdateWantedOpacity(); // Function U.U.UpdateWantedOpacity(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Ani_Gold; //  0x250 Size(8)
	Unknown 1; //  0x258 Size(8)
	Unknown 10; //  0x260 Size(8)
	Unknown 100; //  0x268 Size(8)
	Unknown 1000; //  0x270 Size(8)
	Unknown BonusBG; //  0x278 Size(8)
	Unknown BrightSpot_01; //  0x280 Size(8)
	Unknown BrightSpot_02; //  0x288 Size(8)
	Unknown BrightSpot_03; //  0x290 Size(8)
	Unknown BrightSpot_04; //  0x298 Size(8)
	Unknown BrightSpot_05; //  0x2a0 Size(8)
	Unknown Empty; //  0x2a8 Size(8)
	Unknown Glow_01; //  0x2b0 Size(8)
	Unknown Gold; //  0x2b8 Size(8)
	Unknown Image_7; //  0x2c0 Size(8)
	Unknown Image_11; //  0x2c8 Size(8)
	Unknown Image_14; //  0x2d0 Size(8)
	Unknown Image_15; //  0x2d8 Size(8)
	Unknown Image_16; //  0x2e0 Size(8)
	Unknown Image_17; //  0x2e8 Size(8)
	Unknown Image_18; //  0x2f0 Size(8)
	Unknown Image_20; //  0x2f8 Size(8)
	Unknown Image_21; //  0x300 Size(8)
	Unknown Image_22; //  0x308 Size(8)
	Unknown Image_23; //  0x310 Size(8)
	Unknown Image_335; //  0x318 Size(8)
	Unknown Image_1473; //  0x320 Size(8)
	Unknown Light; //  0x328 Size(8)
	Unknown Light_01; //  0x330 Size(8)
	Unknown Light_02; //  0x338 Size(8)
	Unknown Light_03; //  0x340 Size(8)
	Unknown Light_04; //  0x348 Size(8)
	Unknown Light_05; //  0x350 Size(8)
	Unknown Light_06; //  0x358 Size(8)
	Unknown PickUpGold; //  0x360 Size(8)
	Unknown RIng_Glow_01; //  0x368 Size(8)
	Unknown TextBlock_4; //  0x370 Size(8)
	Unknown TextLight_2; //  0x378 Size(8)
	Unknown TextLight_3; //  0x380 Size(8)
	int32_t Save; //  0x388 Size(4)
	char NewVar_1; //  0x38c Size(1)
	char IsStopSound; //  0x38d Size(1)
	float LoopSountStartTime; //  0x390 Size(4)
	Unknown LoopSound; //  0x394 Size(4)
	float LoopSountEndTime; //  0x398 Size(4)
	float 1StartTime; //  0x39c Size(4)
	float 10StartTime; //  0x3a0 Size(4)
	float 100StartTime; //  0x3a4 Size(4)
	float 1000StartTime; //  0x3a8 Size(4)
	float FinStartTime; //  0x3ac Size(4)

	void Divide(int32_t Value1, int32_t& RetS1, int32_t& RetS2); // Function U.U.Divide(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown HorizontalBox_Rarity; //  0x250 Size(8)
	Unknown Image_bg; //  0x258 Size(8)
	Unknown Image_Icon; //  0x260 Size(8)
	Unknown T_Name; //  0x268 Size(8)
	Unknown T_WeaponType; //  0x270 Size(8)
	Unknown TextBlock_186; //  0x278 Size(8)
	Unknown Tooltip; //  0x280 Size(8)
	Unknown ItemInfo; //  0x288 Size(8)
	Unknown ItemDetailInfo; //  0x290 Size(490)

	void SetRarity(); // Function U.U.SetRarity(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelReportUserCompletedWidget {
	Unknown UberGraphFrame; //  0x250 Size(8)
	Unknown btn_confirm; //  0x258 Size(8)
	Unknown popup; //  0x260 Size(8)
	Unknown txt_description; //  0x268 Size(8)
	Unknown uw; //  0x270 Size(8)
	struct FText DescriptionText; //  0x278 Size(18)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelReportUserProgramWidget {
	Unknown UberGraphFrame; //  0x278 Size(8)
	Unknown btn_Cancel; //  0x280 Size(8)
	Unknown btn_report; //  0x288 Size(8)
	Unknown Button_2; //  0x290 Size(8)
	Unknown Button_3; //  0x298 Size(8)
	Unknown Button_4; //  0x2a0 Size(8)
	Unknown Button_5; //  0x2a8 Size(8)
	Unknown CheckBox_2; //  0x2b0 Size(8)
	Unknown CheckBox_3; //  0x2b8 Size(8)
	Unknown CheckBox_4; //  0x2c0 Size(8)
	Unknown CheckBox_5; //  0x2c8 Size(8)
	Unknown comb; //  0x2d0 Size(8)
	Unknown combkBox; //  0x2d8 Size(8)
	Unknown Image; //  0x2e0 Size(8)
	Unknown Image_2; //  0x2e8 Size(8)
	Unknown Image_545; //  0x2f0 Size(8)
	Unknown NormalArrow; //  0x2f8 Size(8)
	Unknown OpeningArrow; //  0x300 Size(8)
	Unknown popup; //  0x308 Size(8)
	Unknown txt_description; //  0x310 Size(8)
	Unknown txt_nickname; //  0x318 Size(8)
	Unknown uw; //  0x320 Size(8)
	struct FText DescriptionText; //  0x328 Size(18)
	Unknown ReportIndexText; //  0x340 Size(10)
	struct FText DefaultComboString; //  0x350 Size(18)
	int32_t CurrentSelectIndex; //  0x368 Size(4)
	char CheckCloseComboArrow; //  0x36c Size(1)

	void CheckSelectProgramIndex(); // Function U.U.CheckSelectProgramIndex(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelReportUserConfirmWidget {
	Unknown UberGraphFrame; //  0x258 Size(8)
	Unknown btn_Cancel; //  0x260 Size(8)
	Unknown btn_confirm; //  0x268 Size(8)
	Unknown popup; //  0x270 Size(8)
	Unknown txt_description; //  0x278 Size(8)
	Unknown uw; //  0x280 Size(8)

	void PreConstruct(char IsDesignTime); // Function U.U.PreConstruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown HorizontalBox_Next; //  0x250 Size(8)
	Unknown ProgressBar_Current; //  0x258 Size(8)
	Unknown ProgressBar_Down; //  0x260 Size(8)
	Unknown ProgressBar_Up; //  0x268 Size(8)
	Unknown TextBlock_Current; //  0x270 Size(8)
	Unknown TextBlock_Max; //  0x278 Size(8)
	Unknown TextBlock_Next; //  0x280 Size(8)
	char Enab; //  0x288 Size(1)
	float CurTime; //  0x28c Size(4)
	float ShowTime; //  0x290 Size(4)
	float EndPoint; //  0x294 Size(4)
	float ChangeValue; //  0x298 Size(4)
	float StartPoint; //  0x29c Size(4)
	float Min; //  0x2a0 Size(4)
	float MAX; //  0x2a4 Size(4)
	char IsUPState; //  0x2a8 Size(1)
	struct FMulticastInlineDelegate Dispatcher_ProgressBarDone; //  0x2b0 Size(10)

	void SetData(float StartPoint, float EndPoint, float Min, float MAX, float ShowTime, char Play); // Function U.U.SetData(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown HorizontalBox; //  0x250 Size(8)
	Unknown HorizontalBox_2; //  0x258 Size(8)
	Unknown Image; //  0x260 Size(8)
	Unknown Image_2; //  0x268 Size(8)
	Unknown Image_3; //  0x270 Size(8)
	Unknown Image_4; //  0x278 Size(8)
	Unknown Image_5; //  0x280 Size(8)
	Unknown Image_6; //  0x288 Size(8)
	Unknown Image_7; //  0x290 Size(8)
	Unknown Image_8; //  0x298 Size(8)
	Unknown Image_9; //  0x2a0 Size(8)
	Unknown Image_10; //  0x2a8 Size(8)
	Unknown Image_11; //  0x2b0 Size(8)
	Unknown Image_12; //  0x2b8 Size(8)
	Unknown Image_13; //  0x2c0 Size(8)
	Unknown Image_14; //  0x2c8 Size(8)
	Unknown Image_15; //  0x2d0 Size(8)
	Unknown Image_72; //  0x2d8 Size(8)
	Unknown Image_164; //  0x2e0 Size(8)
	Unknown Image_352; //  0x2e8 Size(8)
	Unknown Image_659; //  0x2f0 Size(8)
	Unknown Overlay_4; //  0x2f8 Size(8)
	Unknown SizeBox; //  0x300 Size(8)
	Unknown SizeBox_54; //  0x308 Size(8)
	Unknown T_WeaponType; //  0x310 Size(8)
	Unknown TextBlock_176; //  0x318 Size(8)
	Unknown TextBlock_258; //  0x320 Size(8)
	Unknown TextBlock_331; //  0x328 Size(8)
	Unknown WidgetSwitcher_1; //  0x330 Size(8)
	Unknown ItemInfo; //  0x338 Size(8)
	Unknown ItemDetailInfo; //  0x340 Size(490)
	struct FText LocalText; //  0x7d0 Size(18)
	char bIsSmallIcon; //  0x7e8 Size(1)

	void IsMaterialData(struct FName ItemKey, char& bRet, int32_t& Index); // Function U.U.IsMaterialData(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Hide; //  0x250 Size(8)
	Unknown RankDown; //  0x258 Size(8)
	Unknown RankUp; //  0x260 Size(8)
	Unknown Anim_Reward; //  0x268 Size(8)
	Unknown Arrow_3; //  0x270 Size(8)
	Unknown ArrowLine_3; //  0x278 Size(8)
	Unknown BottomLine_3; //  0x280 Size(8)
	Unknown BrightSpot_01; //  0x288 Size(8)
	Unknown BrightSpot_02; //  0x290 Size(8)
	Unknown BrightSpot_03; //  0x298 Size(8)
	Unknown BrightSpot_04; //  0x2a0 Size(8)
	Unknown BrightSpot_05; //  0x2a8 Size(8)
	Unknown Button_DeathCam; //  0x2b0 Size(8)
	Unknown Button_DeathCam_2; //  0x2b8 Size(8)
	Unknown Button_Exit; //  0x2c0 Size(8)
	Unknown Button_Report; //  0x2c8 Size(8)
	Unknown Button_Spectate; //  0x2d0 Size(8)
	Unknown CanvasPanel_3; //  0x2d8 Size(8)
	Unknown CanvasPanel_9; //  0x2e0 Size(8)
	Unknown CanvasPanel_1174; //  0x2e8 Size(8)
	Unknown CanvasPanel_1384; //  0x2f0 Size(8)
	Unknown Glow1; //  0x2f8 Size(8)
	Unknown Glow2; //  0x300 Size(8)
	Unknown Glow3; //  0x308 Size(8)
	Unknown Glow_01; //  0x310 Size(8)
	Unknown GlowLine; //  0x318 Size(8)
	Unknown Gold; //  0x320 Size(8)
	Unknown Image_26; //  0x328 Size(8)
	Unknown Image_27; //  0x330 Size(8)
	Unknown Image_28; //  0x338 Size(8)
	Unknown Image_29; //  0x340 Size(8)
	Unknown Image_216; //  0x348 Size(8)
	Unknown Image_223; //  0x350 Size(8)
	Unknown Image_458; //  0x358 Size(8)
	Unknown Image_559; //  0x360 Size(8)
	Unknown Image_CurrentRANK; //  0x368 Size(8)
	Unknown Image_DownRANK; //  0x370 Size(8)
	Unknown Image_UpRANK; //  0x378 Size(8)
	Unknown L_Wing01; //  0x380 Size(8)
	Unknown L_Wing01_2; //  0x388 Size(8)
	Unknown L_Wing01_5; //  0x390 Size(8)
	Unknown L_Wing02; //  0x398 Size(8)
	Unknown L_Wing02_2; //  0x3a0 Size(8)
	Unknown L_Wing02_5; //  0x3a8 Size(8)
	Unknown L_Wing03; //  0x3b0 Size(8)
	Unknown L_Wing03_2; //  0x3b8 Size(8)
	Unknown L_Wing03_5; //  0x3c0 Size(8)
	Unknown L_WingLine; //  0x3c8 Size(8)
	Unknown L_WingLine_3; //  0x3d0 Size(8)
	Unknown Light_2; //  0x3d8 Size(8)
	Unknown Light_01; //  0x3e0 Size(8)
	Unknown Light_02; //  0x3e8 Size(8)
	Unknown Light_03; //  0x3f0 Size(8)
	Unknown Light_04; //  0x3f8 Size(8)
	Unknown Light_05; //  0x400 Size(8)
	Unknown Light_06; //  0x408 Size(8)
	Unknown Overlay_2; //  0x410 Size(8)
	Unknown Overlay_264; //  0x418 Size(8)
	Unknown Overlay_Report; //  0x420 Size(8)
	Unknown Overlay_Spectate; //  0x428 Size(8)
	Unknown R_Wing01; //  0x430 Size(8)
	Unknown R_Wing01_2; //  0x438 Size(8)
	Unknown R_Wing01_5; //  0x440 Size(8)
	Unknown R_Wing01_6; //  0x448 Size(8)
	Unknown R_Wing02; //  0x450 Size(8)
	Unknown R_Wing02_2; //  0x458 Size(8)
	Unknown R_Wing02_5; //  0x460 Size(8)
	Unknown R_Wing02_6; //  0x468 Size(8)
	Unknown R_Wing03; //  0x470 Size(8)
	Unknown R_Wing03_2; //  0x478 Size(8)
	Unknown R_Wing03_5; //  0x480 Size(8)
	Unknown R_Wing03_6; //  0x488 Size(8)
	Unknown R_WingLine; //  0x490 Size(8)
	Unknown R_WingLine_3; //  0x498 Size(8)
	Unknown Ribb; //  0x4a0 Size(8)
	Unknown Ring; //  0x4a8 Size(8)
	Unknown RIng_Glow_01; //  0x4b0 Size(8)
	Unknown ScrollBox_2; //  0x4b8 Size(8)
	Unknown ScrollBox_199; //  0x4c0 Size(8)
	Unknown SizeBox_8; //  0x4c8 Size(8)
	Unknown Spacer_6018; //  0x4d0 Size(8)
	Unknown Spacer_6217; //  0x4d8 Size(8)
	Unknown Spacer_Center; //  0x4e0 Size(8)
	Unknown Spacer_Center_2; //  0x4e8 Size(8)
	Unknown T_RemainTime_2; //  0x4f0 Size(8)
	Unknown Text_Report; //  0x4f8 Size(8)
	Unknown TextBlock_3; //  0x500 Size(8)
	Unknown TextBlock_12; //  0x508 Size(8)
	Unknown TextBlock_13; //  0x510 Size(8)
	Unknown TextBlock_14; //  0x518 Size(8)
	Unknown TextBlock_25; //  0x520 Size(8)
	Unknown TextBlock_27; //  0x528 Size(8)
	Unknown TextBlock_1425; //  0x530 Size(8)
	Unknown TextBlock_2242; //  0x538 Size(8)
	Unknown TextBlock_2769; //  0x540 Size(8)
	Unknown TextBlock_3056; //  0x548 Size(8)
	Unknown TextBlock_LocalMatchRP; //  0x550 Size(8)
	Unknown TextGlow01; //  0x558 Size(8)
	Unknown TextGlow02; //  0x560 Size(8)
	Unknown TextGlow03; //  0x568 Size(8)
	Unknown TopLine_3; //  0x570 Size(8)
	Unknown U; //  0x578 Size(8)
	Unknown U_2; //  0x580 Size(8)
	Unknown U_3; //  0x588 Size(8)
	Unknown U_4; //  0x590 Size(8)
	Unknown U_5; //  0x598 Size(8)
	Unknown U_369; //  0x5a0 Size(8)
	Unknown U; //  0x5a8 Size(8)
	Unknown U; //  0x5b0 Size(8)
	Unknown VerticalBox_191; //  0x5b8 Size(8)
	Unknown WidgetSwitcher_2; //  0x5c0 Size(8)
	char MatchEnd; //  0x5c8 Size(1)
	Unknown AnimationData; //  0x5c9 Size(2)
	Unknown MatchEndWidgetRef; //  0x5d0 Size(8)
	Unknown SimpleResult; //  0x5d8 Size(a8)
	Unknown SimpleTimer; //  0x680 Size(8)
	char IsWinningCam; //  0x688 Size(1)
	Unknown StartSound; //  0x68c Size(4)
	Unknown GainGoldHandle; //  0x690 Size(8)
	Unknown GoldHandle; //  0x698 Size(8)
	Unknown FinalResultData; //  0x6a0 Size(4)
	int32_t RandomGold; //  0x6a4 Size(4)
	int32_t GainGoldValue; //  0x6a8 Size(4)
	Unknown LocalWidget; //  0x6b0 Size(8)
	Unknown PlayerState; //  0x6b8 Size(8)
	Unknown Timehandle_Rank; //  0x6c0 Size(8)
	char Increase; //  0x6c8 Size(1)
	char bMaxPrograssbar; //  0x6c9 Size(1)
	int32_t CurrentRP; //  0x6cc Size(4)
	int32_t PlayerOriRP; //  0x6d0 Size(4)
	int32_t TargetRP; //  0x6d4 Size(4)
	int32_t NextTireRP; //  0x6d8 Size(4)
	int32_t CurrentTierID; //  0x6dc Size(4)
	char IsGiveUp; //  0x6e0 Size(1)
	int32_t TempRank; //  0x6e4 Size(4)
	int32_t TempKill; //  0x6e8 Size(4)
	int32_t TempHit; //  0x6ec Size(4)
	int32_t TempSuvival; //  0x6f0 Size(4)
	int32_t SeasonRP; //  0x6f4 Size(4)
	int32_t GainedRP; //  0x6f8 Size(4)
	int32_t AminRPText; //  0x6fc Size(4)
	int32_t StartRP; //  0x700 Size(4)
	int32_t EndRP; //  0x704 Size(4)
	float ShowTime; //  0x708 Size(4)
	char IsTargetCameraKiller; //  0x70c Size(1)

	void SequenceEvent__ENTRYPOINTU_2(); // Function U.U.SequenceEvent__ENTRYPOINTU_2(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelDevelopmentBlackMarket {
	Unknown UberGraphFrame; //  0x2e8 Size(8)
	Unknown AllItem; //  0x2f0 Size(8)
	Unknown Button_1004; //  0x2f8 Size(8)
	Unknown CheckBox_1; //  0x300 Size(8)
	Unknown C; //  0x308 Size(8)
	Unknown IM; //  0x310 Size(8)
	Unknown IM; //  0x318 Size(8)
	Unknown IM; //  0x320 Size(8)
	Unknown IM; //  0x328 Size(8)
	Unknown IM; //  0x330 Size(8)
	Unknown IM; //  0x338 Size(8)
	Unknown IM; //  0x340 Size(8)
	Unknown IM; //  0x348 Size(8)
	Unknown IM; //  0x350 Size(8)
	Unknown IM; //  0x358 Size(8)
	Unknown IM; //  0x360 Size(8)
	Unknown Text_culture; //  0x368 Size(8)
	Unknown U; //  0x370 Size(8)
	Unknown U; //  0x378 Size(8)
	Unknown W; //  0x380 Size(8)
	Unknown WrapBox_6; //  0x388 Size(8)
	Unknown CurrentTab; //  0x390 Size(1)
	Unknown SelectTabColor; //  0x394 Size(10)
	Unknown UnSelectTabColor; //  0x3a4 Size(10)
	char ShowWorkInProcess; //  0x3b4 Size(1)
	Unknown ItemList; //  0x3b8 Size(10)
	Unknown SelectedWeaponSubTab; //  0x3c8 Size(1)
	Unknown SelectedAttachmentSubTab; //  0x3c9 Size(1)
	Unknown SelectedWearableSubTab; //  0x3ca Size(1)
	Unknown SelectedGearSubTab; //  0x3cb Size(1)
	Unknown SelectedCustomSubTab; //  0x3cc Size(1)
	Unknown SortTypeList; //  0x3d0 Size(10)
	Unknown WeaponAscendList; //  0x3e0 Size(10)
	int32_t CurrentWeaponSortType; //  0x3f0 Size(4)
	Unknown AmmoAscendList; //  0x3f8 Size(10)
	int32_t CurrentAmmoSortType; //  0x408 Size(4)
	Unknown AttachmentAscendList; //  0x410 Size(10)
	int32_t CurrentAttachmentSortType; //  0x420 Size(4)
	int32_t CurrentWearableSortType; //  0x424 Size(4)
	int32_t CurrentConsumableSortType; //  0x428 Size(4)
	int32_t CurrentCustomSortType; //  0x42c Size(4)
	int32_t CurrentVehicleSortType; //  0x430 Size(4)
	Unknown WearableAscendList; //  0x438 Size(10)
	Unknown ConsumableAscendList; //  0x448 Size(10)
	Unknown CustomAscendList; //  0x458 Size(10)
	Unknown VehicleAscendList; //  0x468 Size(10)
	Unknown SaveData; //  0x478 Size(8)
	Unknown GearAscendList; //  0x480 Size(10)
	int32_t CurrentGearSortType; //  0x490 Size(4)
	struct FString BlackmarketSaveSlotName; //  0x498 Size(10)
	int32_t TestIndex; //  0x4a8 Size(4)
	Unknown PerkAscendList; //  0x4b0 Size(10)
	int32_t CurrentPerkSortType; //  0x4c0 Size(4)
	Unknown SelectedPerkSubTab; //  0x4c4 Size(1)
	int32_t CurrentPresetSortType; //  0x4c8 Size(4)
	Unknown PresetAscendList; //  0x4d0 Size(10)
	struct FName SelectedPerkClass; //  0x4e0 Size(8)
	Unknown SelectedConsumableSubTab; //  0x4e8 Size(1)

	void IsCorrectPresetSlot(Unknown status, char& bResult); // Function U.U.IsCorrectPresetSlot(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Event2; //  0x250 Size(8)
	Unknown Event; //  0x258 Size(8)
	Unknown Anim_Second; //  0x260 Size(8)
	Unknown Hide; //  0x268 Size(8)
	Unknown Infos_ani; //  0x270 Size(8)
	Unknown Anim_Defeat; //  0x278 Size(8)
	Unknown Anim_Victory; //  0x280 Size(8)
	Unknown Arrow; //  0x288 Size(8)
	Unknown Arrow_2; //  0x290 Size(8)
	Unknown ArrowLine; //  0x298 Size(8)
	Unknown ArrowLine_2; //  0x2a0 Size(8)
	Unknown BackgroundBlur; //  0x2a8 Size(8)
	Unknown BackgroundBlur_447; //  0x2b0 Size(8)
	Unknown BlackBG01; //  0x2b8 Size(8)
	Unknown BlackBG02; //  0x2c0 Size(8)
	Unknown BottomLine; //  0x2c8 Size(8)
	Unknown BottomLine_2; //  0x2d0 Size(8)
	Unknown Button; //  0x2d8 Size(8)
	Unknown Button_2; //  0x2e0 Size(8)
	Unknown Button_104; //  0x2e8 Size(8)
	Unknown CanvasPanel_7; //  0x2f0 Size(8)
	Unknown CanvasPanel_49; //  0x2f8 Size(8)
	Unknown CanvasPanel_488; //  0x300 Size(8)
	Unknown CanvasPanel_832; //  0x308 Size(8)
	Unknown Glow1; //  0x310 Size(8)
	Unknown Glow1_2; //  0x318 Size(8)
	Unknown Glow2; //  0x320 Size(8)
	Unknown Glow3; //  0x328 Size(8)
	Unknown Glow3_2; //  0x330 Size(8)
	Unknown GlowLine; //  0x338 Size(8)
	Unknown HeadShot; //  0x340 Size(8)
	Unknown HorizontalBox_KillerWeaponInfo; //  0x348 Size(8)
	Unknown HorizontalBox_Rarity; //  0x350 Size(8)
	Unknown Image_4; //  0x358 Size(8)
	Unknown Image_5; //  0x360 Size(8)
	Unknown Image_6; //  0x368 Size(8)
	Unknown Image_7; //  0x370 Size(8)
	Unknown Image_8; //  0x378 Size(8)
	Unknown Image_16; //  0x380 Size(8)
	Unknown Image_17; //  0x388 Size(8)
	Unknown Image_18; //  0x390 Size(8)
	Unknown Image_19; //  0x398 Size(8)
	Unknown Image_20; //  0x3a0 Size(8)
	Unknown Image_21; //  0x3a8 Size(8)
	Unknown Image_22; //  0x3b0 Size(8)
	Unknown Image_23; //  0x3b8 Size(8)
	Unknown Image_252; //  0x3c0 Size(8)
	Unknown Image_505; //  0x3c8 Size(8)
	Unknown Image_1091; //  0x3d0 Size(8)
	Unknown Image_1443; //  0x3d8 Size(8)
	Unknown Image_1558; //  0x3e0 Size(8)
	Unknown L_Wing01; //  0x3e8 Size(8)
	Unknown L_Wing01_2; //  0x3f0 Size(8)
	Unknown L_Wing01_3; //  0x3f8 Size(8)
	Unknown L_Wing01_4; //  0x400 Size(8)
	Unknown L_Wing02; //  0x408 Size(8)
	Unknown L_Wing02_2; //  0x410 Size(8)
	Unknown L_Wing02_3; //  0x418 Size(8)
	Unknown L_Wing02_4; //  0x420 Size(8)
	Unknown L_Wing03; //  0x428 Size(8)
	Unknown L_Wing03_2; //  0x430 Size(8)
	Unknown L_Wing03_3; //  0x438 Size(8)
	Unknown L_Wing03_4; //  0x440 Size(8)
	Unknown L_WingLine; //  0x448 Size(8)
	Unknown L_WingLine_2; //  0x450 Size(8)
	Unknown Logo; //  0x458 Size(8)
	Unknown Logo_2; //  0x460 Size(8)
	Unknown Overlay_1; //  0x468 Size(8)
	Unknown Overlay_WeaponLevel; //  0x470 Size(8)
	Unknown PosX; //  0x478 Size(8)
	Unknown PosY; //  0x480 Size(8)
	Unknown PosZ; //  0x488 Size(8)
	Unknown R_Wing01; //  0x490 Size(8)
	Unknown R_Wing01_2; //  0x498 Size(8)
	Unknown R_Wing01_3; //  0x4a0 Size(8)
	Unknown R_Wing01_4; //  0x4a8 Size(8)
	Unknown R_Wing02; //  0x4b0 Size(8)
	Unknown R_Wing02_2; //  0x4b8 Size(8)
	Unknown R_Wing02_3; //  0x4c0 Size(8)
	Unknown R_Wing02_4; //  0x4c8 Size(8)
	Unknown R_Wing03; //  0x4d0 Size(8)
	Unknown R_Wing03_2; //  0x4d8 Size(8)
	Unknown R_Wing03_3; //  0x4e0 Size(8)
	Unknown R_Wing03_4; //  0x4e8 Size(8)
	Unknown R_WingLine; //  0x4f0 Size(8)
	Unknown R_WingLine_2; //  0x4f8 Size(8)
	Unknown Ribb; //  0x500 Size(8)
	Unknown Ribbng_2; //  0x508 Size(8)
	Unknown Ring; //  0x510 Size(8)
	Unknown ScrollBox_1; //  0x518 Size(8)
	Unknown T_DamageType; //  0x520 Size(8)
	Unknown T_WeaponLevel; //  0x528 Size(8)
	Unknown TextBlock_3; //  0x530 Size(8)
	Unknown TextBlock_4; //  0x538 Size(8)
	Unknown TextBlock_5; //  0x540 Size(8)
	Unknown TextBlock_6; //  0x548 Size(8)
	Unknown TextBlock_8; //  0x550 Size(8)
	Unknown TextBlock_9; //  0x558 Size(8)
	Unknown TextBlock_10; //  0x560 Size(8)
	Unknown TextBlock_11; //  0x568 Size(8)
	Unknown TextBlock_900; //  0x570 Size(8)
	Unknown TopLine; //  0x578 Size(8)
	Unknown TopLine_2; //  0x580 Size(8)
	Unknown U; //  0x588 Size(8)
	Unknown U; //  0x590 Size(8)
	Unknown WeaponName; //  0x598 Size(8)
	Unknown WidgetSwitcher_DamageCauser; //  0x5a0 Size(8)
	Unknown WinText1; //  0x5a8 Size(8)
	Unknown WinText1_2; //  0x5b0 Size(8)
	Unknown WinText1_3; //  0x5b8 Size(8)
	Unknown WinText1_4; //  0x5c0 Size(8)
	Unknown WinText2; //  0x5c8 Size(8)
	Unknown WinText3; //  0x5d0 Size(8)
	char MatchEnd; //  0x5d8 Size(1)
	Unknown AnimationData; //  0x5d9 Size(2)
	Unknown MatchEndWidgetRef; //  0x5e0 Size(8)
	Unknown SimpleResult; //  0x5e8 Size(a8)
	Unknown SimpleTimer; //  0x690 Size(10)
	struct FMulticastInlineDelegate EventDispatcher_HideComplete; //  0x6a0 Size(10)
	char bSuccessWinEventCall; //  0x6b0 Size(1)
	Unknown PlayingAudio; //  0x6b8 Size(10)
	char bTestMode; //  0x6c8 Size(1)
	char bTestIsWin; //  0x6c9 Size(1)
	float MatchFinalResultShowTime; //  0x6cc Size(4)

	void SequenceEvent__ENTRYPOINTU_2(); // Function U.U.SequenceEvent__ENTRYPOINTU_2(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelRoutePingWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Canvas; //  0x250 Size(8)
	struct FMulticastInlineDelegate OnMarkerClicked; //  0x258 Size(10)
	Unknown PlayerState; //  0x268 Size(8)
	Unknown PointsArray; //  0x270 Size(10)
	Unknown StartPosition; //  0x280 Size(8)
	Unknown PointWidgets; //  0x288 Size(10)
	Unknown LineWidgets; //  0x298 Size(10)
	Unknown U; //  0x2a8 Size(8)
	char IsDrawing; //  0x2b0 Size(1)
	Unknown GuideLineWidgetRef; //  0x2b8 Size(8)
	Unknown GuideLinePos; //  0x2c0 Size(8)
	char IsUpdate; //  0x2c8 Size(1)

	void InitGuideLine(); // Function U.U.InitGuideLine(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelAircraftRouteWidget {
	Unknown UberGraphFrame; //  0x2b0 Size(8)
	Unknown Propeller1; //  0x2b8 Size(8)
	Unknown Aircraft; //  0x2c0 Size(8)
	Unknown Image_156; //  0x2c8 Size(8)
	Unknown Image_236; //  0x2d0 Size(8)
	Unknown Image_237; //  0x2d8 Size(8)
	Unknown MapCompRef; //  0x2e0 Size(8)

	void StopAirCraftAnimation(); // Function U.U.StopAirCraftAnimation(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelPlayerIconWidget {
	Unknown UberGraphFrame; //  0x318 Size(8)
	Unknown Anim_OnNotifyPos; //  0x320 Size(8)
	Unknown Anim_OnAttacked; //  0x328 Size(8)
	Unknown Canvas_Attacked; //  0x330 Size(8)
	Unknown Canvas_Fire; //  0x338 Size(8)
	Unknown Canvas_NotifyPos; //  0x340 Size(8)
	Unknown Img_FreeCam; //  0x348 Size(8)
	Unknown PlayerState; //  0x350 Size(8)

	void OnClickPlayerNameButton(); // Function U.U.OnClickPlayerNameButton(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelGameMatchEndWidget {
	Unknown UberGraphFrame; //  0x360 Size(8)
	Unknown U; //  0x368 Size(8)
	Unknown U; //  0x370 Size(8)
	Unknown UW_SimpleResult; //  0x378 Size(8)
	Unknown MainWidgetRef; //  0x380 Size(8)
	Unknown PlayerHUDRef; //  0x388 Size(8)
	Unknown UW_FinalResult; //  0x390 Size(8)
	Unknown UW_Animation; //  0x398 Size(8)
	Unknown PlayerControllerRef; //  0x3a0 Size(8)
	char NewResult; //  0x3a8 Size(1)
	Unknown ResultData; //  0x3a9 Size(4)
	char IsGiveUp; //  0x3ad Size(1)
	float WinMatchEndResultShowTime; //  0x3b0 Size(4)
	Unknown ResultMatchEndAnimation; //  0x3b4 Size(2)

	char IsVisibleMatchEndWidget(); // Function U.U.IsVisibleMatchEndWidget(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown CurrentAccel; //  0x250 Size(c)
	Unknown TargetAccel; //  0x25c Size(c)
	Unknown CurrentCameraActor; //  0x268 Size(8)
	Unknown OldCameraLocation; //  0x270 Size(c)
	Unknown CurrentCameraLocation; //  0x27c Size(c)
	Unknown OriginCameraLocation; //  0x288 Size(c)
	Unknown TargetCameraLocation; //  0x294 Size(c)
	Unknown DataAsset; //  0x2a0 Size(8)
	char ResetOriginTransform; //  0x2a8 Size(1)
	float BeginFocusDist; //  0x2ac Size(4)
	float EndFocusDist; //  0x2b0 Size(4)
	float CurrentFocusDist; //  0x2b4 Size(4)

	void UpdateMouseWheel(float Delta); // Function U.U.UpdateMouseWheel(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown GoldImage; //  0x250 Size(8)
	Unknown Image_362; //  0x258 Size(8)
	Unknown Message; //  0x260 Size(8)
	Unknown PriceValue; //  0x268 Size(8)
	Unknown SizeBox_2; //  0x270 Size(8)

	void SetPriceData(struct FText ItemName, int32_t Price); // Function U.U.SetPriceData(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Button_43; //  0x250 Size(8)
	Unknown off; //  0x258 Size(8)
	Unknown On; //  0x260 Size(8)
	Unknown TextBlock_67; //  0x268 Size(8)
	struct FText Text; //  0x270 Size(18)

	void BndEvt__Button_42_K2Node_Co(); // Function U.U.BndEvt__Button_42_K2Node_Co(BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown AmmoImage; //  0x250 Size(8)
	Unknown AmmoText; //  0x258 Size(8)
	Unknown Button_2; //  0x260 Size(8)
	Unknown CanvasPanel_98; //  0x268 Size(8)
	Unknown HorizontalBox_Perk; //  0x270 Size(8)
	Unknown HorizontalBox_Rarity; //  0x278 Size(8)
	Unknown Image; //  0x280 Size(8)
	Unknown Image_369; //  0x288 Size(8)
	Unknown Image_704; //  0x290 Size(8)
	Unknown Image_874; //  0x298 Size(8)
	Unknown Image_924; //  0x2a0 Size(8)
	Unknown Image_1262; //  0x2a8 Size(8)
	Unknown Image_1400; //  0x2b0 Size(8)
	Unknown Reinforce; //  0x2b8 Size(8)
	Unknown TextBlock_291; //  0x2c0 Size(8)
	Unknown U; //  0x2c8 Size(8)
	Unknown U_2; //  0x2d0 Size(8)
	Unknown U_3; //  0x2d8 Size(8)
	Unknown WeaponBg; //  0x2e0 Size(8)
	Unknown WeaponImage01; //  0x2e8 Size(8)
	Unknown WeaponName; //  0x2f0 Size(8)
	Unknown WidgetSwitcher_1; //  0x2f8 Size(8)
	Unknown DraggedWidget; //  0x300 Size(8)
	Unknown WeaponData; //  0x308 Size(98)
	struct FMulticastInlineDelegate OnDropEventDispatcher; //  0x3a0 Size(10)
	struct FName AmmorKey; //  0x3b0 Size(8)
	struct FMulticastInlineDelegate ShowToolTipEventDispatcher; //  0x3b8 Size(10)
	char IsDefaultWeapon; //  0x3c8 Size(1)
	int32_t ClickNum; //  0x3cc Size(4)
	struct FMulticastInlineDelegate OnDefaultWeaponEventDispatcher; //  0x3d0 Size(10)
	Unknown SaveKey; //  0x3e0 Size(18)

	Unknown OnMouseButtonUp(Unknown MyGeometry, Unknown& MouseEvent); // Function U.U.OnMouseButtonUp(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelPersonalSupplyBoxSlotItemWidget {
	Unknown UberGraphFrame; //  0x3e8 Size(8)
	Unknown Over; //  0x3f0 Size(8)
	Unknown Bg; //  0x3f8 Size(8)
	Unknown CanvasPanel_2; //  0x400 Size(8)
	Unknown CanvasPanel_4; //  0x408 Size(8)
	Unknown Cont; //  0x410 Size(8)
	Unknown DropHoverImage; //  0x418 Size(8)
	Unknown Image; //  0x420 Size(8)
	Unknown Image_86; //  0x428 Size(8)
	Unknown Image_187; //  0x430 Size(8)
	Unknown Image_675; //  0x438 Size(8)
	Unknown Image_874; //  0x440 Size(8)
	Unknown ItemImage; //  0x448 Size(8)
	Unknown ItemName; //  0x450 Size(8)
	Unknown Lock; //  0x458 Size(8)
	Unknown Price_Value; //  0x460 Size(8)
	Unknown ProgressBar_65; //  0x468 Size(8)
	Unknown Repair; //  0x470 Size(8)
	Unknown WeaponName; //  0x478 Size(8)
	Unknown WeaponName_2; //  0x480 Size(8)
	Unknown WeaponName_3; //  0x488 Size(8)
	Unknown WidgetSwitcher_1; //  0x490 Size(8)
	Unknown DraggedWidget; //  0x498 Size(8)
	Unknown DragItemBrush; //  0x4a0 Size(88)
	char Enab; //  0x528 Size(1)
	Unknown ItemIconImg; //  0x530 Size(28)
	struct FName AmmorKey; //  0x558 Size(8)
	struct FMulticastInlineDelegate OnHoverStateEventDispatcher; //  0x560 Size(10)
	struct FMulticastInlineDelegate OnRightClickEventDispatcher; //  0x570 Size(10)
	Unknown SaveKey; //  0x580 Size(18)
	int32_t ClickNum; //  0x598 Size(4)
	char RandomPerk; //  0x59c Size(1)

	Unknown OnMouseButtonUp(Unknown MyGeometry, Unknown& MouseEvent); // Function U.U.OnMouseButtonUp(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown IMG_PerkLevelUpFx; //  0x250 Size(8)
	Unknown PerkSlot; //  0x258 Size(1)
	Unknown PerkFxTexture; //  0x260 Size(8)
	char PlayAnimation_1; //  0x268 Size(1)
	float CurrentAnimationTime; //  0x26c Size(4)
	float AnimLastTime; //  0x270 Size(4)
	Unknown PerkFxMaterialInstance; //  0x278 Size(8)
	Unknown UltimatePerkFxTexture; //  0x280 Size(8)

	void InitFxInfo(); // Function U.U.InitFxInfo(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Anim_TextBg; //  0x250 Size(8)
	Unknown HorizontalBox_Damage; //  0x258 Size(8)
	Unknown Image_145; //  0x260 Size(8)
	Unknown Image_155; //  0x268 Size(8)
	Unknown T_StatName; //  0x270 Size(8)
	Unknown T_Value; //  0x278 Size(8)
	struct FText Text_StatName; //  0x280 Size(18)

	void SetStatValue(int32_t Type, float Value); // Function U.U.SetStatValue(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown DropBoxPanel; //  0x250 Size(8)
	Unknown Image_1; //  0x258 Size(8)
	Unknown Image_2; //  0x260 Size(8)
	Unknown Image_3; //  0x268 Size(8)
	Unknown Image_4; //  0x270 Size(8)
	Unknown Image_5; //  0x278 Size(8)
	Unknown Image_9; //  0x280 Size(8)
	Unknown Image_10; //  0x288 Size(8)
	Unknown Image_11; //  0x290 Size(8)
	Unknown Image_12; //  0x298 Size(8)
	Unknown Image_13; //  0x2a0 Size(8)
	Unknown Image_14; //  0x2a8 Size(8)
	Unknown Image_15; //  0x2b0 Size(8)
	Unknown Image_16; //  0x2b8 Size(8)
	Unknown Image_17; //  0x2c0 Size(8)
	Unknown Image_18; //  0x2c8 Size(8)
	Unknown Image_19; //  0x2d0 Size(8)
	Unknown Image_20; //  0x2d8 Size(8)
	Unknown Image_21; //  0x2e0 Size(8)
	Unknown ScrollBox_2; //  0x2e8 Size(8)
	Unknown SizeBox_1; //  0x2f0 Size(8)
	Unknown W; //  0x2f8 Size(8)
	Unknown WrapBox_1; //  0x300 Size(8)

	char DropItem(Unknown MyGeometry, Unknown PointerEvent, Unknown Operation); // Function U.U.DropItem(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x1360 Size(8)
	Unknown Abillity; //  0x1368 Size(8)
	Unknown AbillityBG; //  0x1370 Size(8)
	Unknown AbillityValue; //  0x1378 Size(8)
	Unknown Bg; //  0x1380 Size(8)
	Unknown BorderBG; //  0x1388 Size(8)
	Unknown ChoiceBG; //  0x1390 Size(8)
	Unknown DefenseBG; //  0x1398 Size(8)
	Unknown DurabilityBar; //  0x13a0 Size(8)
	Unknown EmptyBG; //  0x13a8 Size(8)
	Unknown ItemImage; //  0x13b0 Size(8)
	Unknown OverBG; //  0x13b8 Size(8)
	Unknown WearableItemType; //  0x13c0 Size(1)
	char IsDefense; //  0x13c1 Size(1)
	Unknown HoverWidget; //  0x13c8 Size(8)
	Unknown HoverOwnerWidget; //  0x13d0 Size(8)
	int32_t Index; //  0x13d8 Size(4)

	void OnDragDetected(Unknown MyGeometry, Unknown& PointerEvent, Unknown& Operation); // Function U.U.OnDragDetected(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelDebugWidget {
	Unknown TextBlock_DebugString; //  0x258 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x1360 Size(8)
	Unknown Ani_Tutorial_Glow; //  0x1368 Size(8)
	Unknown P_Upgrade_Arrow; //  0x1370 Size(8)
	Unknown C_SlotHover_ItemState_Hide; //  0x1378 Size(8)
	Unknown C_SlotHover_ItemState_Show; //  0x1380 Size(8)
	Unknown Hover_Gold; //  0x1388 Size(8)
	Unknown P_SlotHover; //  0x1390 Size(8)
	Unknown BGImage; //  0x1398 Size(8)
	Unknown CanvasPanel_ITemState; //  0x13a0 Size(8)
	Unknown Count; //  0x13a8 Size(8)
	Unknown Effect_Craft; //  0x13b0 Size(8)
	Unknown HorizontalBox_Rarity; //  0x13b8 Size(8)
	Unknown HoverImage; //  0x13c0 Size(8)
	Unknown HoverImage_Gold; //  0x13c8 Size(8)
	Unknown IconRepair; //  0x13d0 Size(8)
	Unknown Image_1; //  0x13d8 Size(8)
	Unknown Image_2; //  0x13e0 Size(8)
	Unknown Image_222; //  0x13e8 Size(8)
	Unknown ItemImage; //  0x13f0 Size(8)
	Unknown ItemNameName; //  0x13f8 Size(8)
	Unknown ItemState_Text; //  0x1400 Size(8)
	Unknown NeedMaterial; //  0x1408 Size(8)
	Unknown Overlay_Key; //  0x1410 Size(8)
	Unknown ProgressBar_475; //  0x1418 Size(8)
	Unknown SizeBox_1; //  0x1420 Size(8)
	Unknown TextBlock_ShortCut; //  0x1428 Size(8)
	Unknown Tutorial_Glow; //  0x1430 Size(8)
	Unknown U; //  0x1438 Size(8)
	Unknown U; //  0x1440 Size(8)
	Unknown WeaponItemImage; //  0x1448 Size(8)
	char bGold; //  0x1450 Size(1)
	Unknown SelectedHoverImage; //  0x1458 Size(8)
	Unknown MedicalBGColor; //  0x1460 Size(10)
	struct FMulticastInlineDelegate SetSlotInfo; //  0x1470 Size(10)
	int32_t SlotIndex; //  0x1480 Size(4)
	struct FName RecipeKey; //  0x1484 Size(8)
	Unknown RecipeData; //  0x1490 Size(38)
	char bLeftClicked; //  0x14c8 Size(1)
	char CanCraft; //  0x14c9 Size(1)

	void Get(char& bResult, Unknown& WeaponInfo); // Function U.U.Get(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Button_ItemSlotHover_4; //  0x250 Size(8)
	Unknown U_4; //  0x258 Size(8)
	Unknown ItemWeaponInfo; //  0x260 Size(88)
	Unknown ParentWidget; //  0x2e8 Size(8)

	void SetButtonEnabled(char InIsEnabled); // Function U.U.SetButtonEnabled(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelSightInfoWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Canvas_Charge; //  0x250 Size(8)
	Unknown ChargeIndicator; //  0x258 Size(8)
	Unknown Image_LeanDamageBg; //  0x260 Size(8)
	Unknown IMG_Gauge1; //  0x268 Size(8)
	Unknown IMG_Gauge2; //  0x270 Size(8)
	Unknown IMG_Gauge3; //  0x278 Size(8)
	Unknown IMG_Gauge4; //  0x280 Size(8)
	Unknown IMG_Gauge5; //  0x288 Size(8)
	Unknown IMG_Gauge6; //  0x290 Size(8)
	Unknown LeftTime; //  0x298 Size(8)
	Unknown Overlay_Gauge; //  0x2a0 Size(8)
	Unknown T_BulletsPerShot; //  0x2a8 Size(8)
	Unknown T_Damage; //  0x2b0 Size(8)
	Unknown T_RPM; //  0x2b8 Size(8)
	Unknown VerticalBox_Damage; //  0x2c0 Size(8)
	Unknown BravoHotelCharacter; //  0x2c8 Size(8)
	Unknown GaugeIMGArray; //  0x2d0 Size(10)
	int32_t LastGauge; //  0x2e0 Size(4)
	char Timer_; //  0x2e4 Size(1)
	Unknown Timer_UpdateInfos; //  0x2e8 Size(8)
	Unknown ChargeIndicatorDynamicMaterial; //  0x2f0 Size(8)

	void HideChargeInfo(); // Function U.U.HideChargeInfo(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown WeaponPerk_ani; //  0x250 Size(8)
	Unknown Image_102; //  0x258 Size(8)
	Unknown Image_254; //  0x260 Size(8)
	Unknown Image_Grade_Color_Line; //  0x268 Size(8)

	void SetBuffIcon(Unknown Icon, int32_t Rarity); // Function U.U.SetBuffIcon(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Image; //  0x250 Size(8)
	Unknown Image_1; //  0x258 Size(8)
	Unknown Image_2; //  0x260 Size(8)
	Unknown Image_3; //  0x268 Size(8)
	Unknown Image_4; //  0x270 Size(8)
	Unknown Image_5; //  0x278 Size(8)
	Unknown Image_6; //  0x280 Size(8)
	Unknown Image_7; //  0x288 Size(8)
	Unknown Image_773; //  0x290 Size(8)
	Unknown WeaponSlot01; //  0x298 Size(8)
	Unknown WeaponSlot02; //  0x2a0 Size(8)
	Unknown WeaponSlot03; //  0x2a8 Size(8)
	Unknown WeaponSlot04; //  0x2b0 Size(8)
	Unknown WeaponSlot05; //  0x2b8 Size(8)
	Unknown WeaponSlots; //  0x2c0 Size(50)

	void ShowStatupAnim(Unknown& StatParams, Unknown StatType); // Function U.U.ShowStatupAnim(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown ShowAnim; //  0x248 Size(8)
	Unknown U; //  0x250 Size(8)
	Unknown WidgetSwitcher_53; //  0x258 Size(8)
	int32_t Gold; //  0x260 Size(4)
	Unknown WeaponList; //  0x268 Size(10)
	Unknown MaterialList; //  0x278 Size(10)
	Unknown ItemWeaponIDList; //  0x288 Size(10)
	Unknown LastItemWeaponIDList; //  0x298 Size(10)
	Unknown NewWeaponList; //  0x2a8 Size(10)
	Unknown MaterialIDList; //  0x2b8 Size(10)
	Unknown LastMaterialIDList; //  0x2c8 Size(10)
	Unknown NewMaterialList; //  0x2d8 Size(10)
	Unknown NewCraftIDList; //  0x2e8 Size(10)
	Unknown CraftWeaponInfo; //  0x2f8 Size(c0)
	struct FString MainTabName; //  0x3b8 Size(10)
	struct FString ArmoryTabName; //  0x3c8 Size(10)
	char bNeedCheckWeaponList; //  0x3d8 Size(1)
	char bNeedCheckMaterialList; //  0x3d9 Size(1)

	void NotifyNewItemToCoh(); // Function U.U.NotifyNewItemToCoh(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown PlayerController; //  0x250 Size(8)
	Unknown InventoryItemInfo; //  0x258 Size(98)
	Unknown InventoryItemDetailInfo; //  0x2f0 Size(490)
	Unknown WeaponInfo; //  0x780 Size(b30)
	Unknown ItemSlotHoverWIdget; //  0x12b0 Size(8)
	Unknown InventoryWidget; //  0x12b8 Size(8)
	Unknown DraggedWidget; //  0x12c0 Size(8)
	Unknown InventorySlotWidgetKind; //  0x12c8 Size(1)
	Unknown DragItemBrush; //  0x12d0 Size(88)
	char RButtonDown; //  0x1358 Size(1)
	char bEpuipped; //  0x1359 Size(1)

	void IsEquipped(char& Return); // Function U.U.IsEquipped(Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x1360 Size(8)
	Unknown Complete_ani; //  0x1368 Size(8)
	Unknown Searching_ani; //  0x1370 Size(8)
	Unknown Blank_SkillBG; //  0x1378 Size(8)
	Unknown Border_507; //  0x1380 Size(8)
	Unknown Button_332; //  0x1388 Size(8)
	Unknown Get_SkillBG; //  0x1390 Size(8)
	Unknown Get_SkillBG_lv5; //  0x1398 Size(8)
	Unknown Get_SkillBG_lv6; //  0x13a0 Size(8)
	Unknown Get_SkillBG_lv7; //  0x13a8 Size(8)
	Unknown HorizontalBox_Rarity; //  0x13b0 Size(8)
	Unknown Image; //  0x13b8 Size(8)
	Unknown Image_2; //  0x13c0 Size(8)
	Unknown Image_3; //  0x13c8 Size(8)
	Unknown Image_4; //  0x13d0 Size(8)
	Unknown Image_5; //  0x13d8 Size(8)
	Unknown Image_6; //  0x13e0 Size(8)
	Unknown Image_7; //  0x13e8 Size(8)
	Unknown Image_8; //  0x13f0 Size(8)
	Unknown Image_9; //  0x13f8 Size(8)
	Unknown Image_10; //  0x1400 Size(8)
	Unknown Image_12; //  0x1408 Size(8)
	Unknown Image_16; //  0x1410 Size(8)
	Unknown Image_332; //  0x1418 Size(8)
	Unknown Image_689; //  0x1420 Size(8)
	Unknown Image_690; //  0x1428 Size(8)
	Unknown Image_Full; //  0x1430 Size(8)
	Unknown Image_Have; //  0x1438 Size(8)
	Unknown Img_Active; //  0x1440 Size(8)
	Unknown IMG_Complete; //  0x1448 Size(8)
	Unknown IMG_ItemIcon; //  0x1450 Size(8)
	Unknown MouseHover_2; //  0x1458 Size(8)
	Unknown MouseHover_; //  0x1460 Size(8)
	Unknown MousePress_2; //  0x1468 Size(8)
	Unknown MousePress_; //  0x1470 Size(8)
	Unknown MyWeapon; //  0x1478 Size(8)
	Unknown Searching; //  0x1480 Size(8)
	Unknown Searching_; //  0x1488 Size(8)
	Unknown SizeBox_1; //  0x1490 Size(8)
	Unknown SizeBox_8; //  0x1498 Size(8)
	Unknown T_PerkName; //  0x14a0 Size(8)
	Unknown T_PerkName_2; //  0x14a8 Size(8)
	Unknown T_PerkName_3; //  0x14b0 Size(8)
	Unknown T_PerkName_4; //  0x14b8 Size(8)
	Unknown VerticalBox_1; //  0x14c0 Size(8)
	Unknown HoverWidget; //  0x14c8 Size(8)
	char Selected; //  0x14d0 Size(1)
	Unknown SelectItem; //  0x14d4 Size(10)
	Unknown NewVar_1; //  0x14e8 Size(8)
	char Enab; //  0x14f0 Size(1)
	Unknown TempData; //  0x14f4 Size(10)
	char IsComplete; //  0x1504 Size(1)

	Unknown OnMouseButtonDown(Unknown MyGeometry, Unknown& MouseEvent); // Function U.U.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Character_BG_Motion; //  0x250 Size(8)
	Unknown Image_308; //  0x258 Size(8)
	Unknown ScrollBox_KeepedList; //  0x260 Size(8)
	Unknown SizeBox_KeepedList; //  0x268 Size(8)
	Unknown PlayerController; //  0x270 Size(8)
	float SlotMaxHeight; //  0x278 Size(4)

	void UpdateSlotMaxSize(int32_t SlotNum); // Function U.U.UpdateSlotMaxSize(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Title; //  0x250 Size(8)
	Unknown W; //  0x258 Size(8)
	struct FText TitleText; //  0x260 Size(18)
	char TitleVisible; //  0x278 Size(1)
	Unknown TargetActor; //  0x280 Size(8)
	Unknown ItemInfos; //  0x288 Size(10)
	Unknown InventoryWidget; //  0x298 Size(8)

	void CreateSlots(); // Function U.U.CreateSlots(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelScopeWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown CanvasPanel_1; //  0x250 Size(8)
	Unknown Image_25; //  0x258 Size(8)
	Unknown Image_26; //  0x260 Size(8)
	Unknown Image_27; //  0x268 Size(8)
	Unknown Image_28; //  0x270 Size(8)
	Unknown Image_29; //  0x278 Size(8)
	Unknown Image_30; //  0x280 Size(8)
	Unknown WidgetSwitcher_167; //  0x288 Size(8)
	Unknown NewVar_1; //  0x290 Size(8)

	void SetScopeImageAngle(float NewAngle); // Function U.U.SetScopeImageAngle(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x1360 Size(8)
	Unknown Complete_ani; //  0x1368 Size(8)
	Unknown Serching_ani; //  0x1370 Size(8)
	Unknown Button; //  0x1378 Size(8)
	Unknown IconBox; //  0x1380 Size(8)
	Unknown Image; //  0x1388 Size(8)
	Unknown Image_2; //  0x1390 Size(8)
	Unknown Image_3; //  0x1398 Size(8)
	Unknown Image_4; //  0x13a0 Size(8)
	Unknown Image_5; //  0x13a8 Size(8)
	Unknown Image_6; //  0x13b0 Size(8)
	Unknown Image_7; //  0x13b8 Size(8)
	Unknown Image_8; //  0x13c0 Size(8)
	Unknown Image_9; //  0x13c8 Size(8)
	Unknown Image_10; //  0x13d0 Size(8)
	Unknown Image_149; //  0x13d8 Size(8)
	Unknown Image_170; //  0x13e0 Size(8)
	Unknown Image_253; //  0x13e8 Size(8)
	Unknown Image_305; //  0x13f0 Size(8)
	Unknown Image_Full; //  0x13f8 Size(8)
	Unknown IMG_ItemIcon; //  0x1400 Size(8)
	Unknown MaterialIcon; //  0x1408 Size(8)
	Unknown MouseHover_2; //  0x1410 Size(8)
	Unknown MouseHover_; //  0x1418 Size(8)
	Unknown MousePress_2; //  0x1420 Size(8)
	Unknown MousePress_; //  0x1428 Size(8)
	Unknown Searching_; //  0x1430 Size(8)
	Unknown Stroke; //  0x1438 Size(8)
	Unknown Stroke_2; //  0x1440 Size(8)
	Unknown Stroke_3; //  0x1448 Size(8)
	Unknown Stroke_4; //  0x1450 Size(8)
	Unknown PreHoveredWidget; //  0x1458 Size(8)
	Unknown PreDragType; //  0x1460 Size(1)
	char Selected; //  0x1461 Size(1)
	int32_t NeedCount; //  0x1464 Size(4)
	struct FName ItemKey; //  0x1468 Size(8)
	Unknown SelectItem; //  0x1470 Size(10)
	char BindSelectSearch; //  0x1480 Size(1)
	char Enab; //  0x1481 Size(1)

	Unknown Get_Image_Full_Visibility_1(); // Function U.U.Get_Image_Full_Visibility_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Character_BG_Motion; //  0x250 Size(8)
	Unknown Image_308; //  0x258 Size(8)
	Unknown ScrollBox_KeepedList; //  0x260 Size(8)
	Unknown TextBlock_Count; //  0x268 Size(8)
	Unknown PlayerController; //  0x270 Size(8)

	void HoverRecipeItems(Unknown& ItemKeys); // Function U.U.HoverRecipeItems(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Character_BG_Motion; //  0x250 Size(8)
	Unknown Image_130; //  0x258 Size(8)
	Unknown Image_308; //  0x260 Size(8)
	Unknown ScrollBox_KeepedList; //  0x268 Size(8)
	Unknown U; //  0x270 Size(8)
	Unknown U_74; //  0x278 Size(8)
	Unknown PlayerController; //  0x280 Size(8)

	void DisableCarriedListHover(); // Function U.U.DisableCarriedListHover(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Image_94; //  0x250 Size(8)
	Unknown Image_224; //  0x258 Size(8)
	Unknown RichTextBlock_321; //  0x260 Size(8)
	Unknown InventoryRef; //  0x268 Size(8)

	Unknown OnMouseButtonDown_1(Unknown MyGeometry, Unknown& MouseEvent); // Function U.U.OnMouseButtonDown_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown Image_362; //  0x248 Size(8)
	Unknown Image_552; //  0x250 Size(8)
	Unknown RichTextBlock_74; //  0x258 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x1360 Size(8)
	Unknown Anim_Material_Get; //  0x1368 Size(8)
	Unknown Anim_Material_Hover; //  0x1370 Size(8)
	Unknown Anim_Upgrade; //  0x1378 Size(8)
	Unknown Anim_Progress; //  0x1380 Size(8)
	Unknown Abillity; //  0x1388 Size(8)
	Unknown AbillityBG; //  0x1390 Size(8)
	Unknown AbillityValue; //  0x1398 Size(8)
	Unknown Bg; //  0x13a0 Size(8)
	Unknown Bg_3; //  0x13a8 Size(8)
	Unknown BorderBG; //  0x13b0 Size(8)
	Unknown BorderBG_3; //  0x13b8 Size(8)
	Unknown btn_HelmetTree; //  0x13c0 Size(8)
	Unknown ChoiceBG; //  0x13c8 Size(8)
	Unknown ChoiceBG_3; //  0x13d0 Size(8)
	Unknown DefenseBG; //  0x13d8 Size(8)
	Unknown DefenseBG_3; //  0x13e0 Size(8)
	Unknown DurabilityBar; //  0x13e8 Size(8)
	Unknown DurabilityBar_3; //  0x13f0 Size(8)
	Unknown EmptyBG; //  0x13f8 Size(8)
	Unknown EmptyBG_3; //  0x1400 Size(8)
	Unknown Image; //  0x1408 Size(8)
	Unknown Image_197; //  0x1410 Size(8)
	Unknown Image_234; //  0x1418 Size(8)
	Unknown Image_279; //  0x1420 Size(8)
	Unknown Image_491; //  0x1428 Size(8)
	Unknown Image_682; //  0x1430 Size(8)
	Unknown ItemImage; //  0x1438 Size(8)
	Unknown ItemImage_3; //  0x1440 Size(8)
	Unknown OverBG; //  0x1448 Size(8)
	Unknown OverBG_3; //  0x1450 Size(8)
	Unknown Overlay_1; //  0x1458 Size(8)
	Unknown U; //  0x1460 Size(8)
	Unknown U; //  0x1468 Size(8)
	Unknown WidgetSwitcher_3; //  0x1470 Size(8)
	Unknown WearableItemType; //  0x1478 Size(1)
	char IsDefense; //  0x1479 Size(1)
	Unknown HoverWidget; //  0x1480 Size(8)
	Unknown HoverOwnerWidget; //  0x1488 Size(8)
	int32_t SwitcherIndex; //  0x1490 Size(4)

	void IsDraging(char& bResult); // Function U.U.IsDraging(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Character_BG_Motion; //  0x250 Size(8)
	Unknown ArmorSlot; //  0x258 Size(8)
	Unknown BagSlot; //  0x260 Size(8)
	Unknown BottomSlot; //  0x268 Size(8)
	Unknown Character_BG; //  0x270 Size(8)
	Unknown EyeWearSlot; //  0x278 Size(8)
	Unknown GhillieSlot; //  0x280 Size(8)
	Unknown GlovesSlot; //  0x288 Size(8)
	Unknown HatSlot; //  0x290 Size(8)
	Unknown HelmetSlot; //  0x298 Size(8)
	Unknown MaskSlot; //  0x2a0 Size(8)
	Unknown OuterSlot; //  0x2a8 Size(8)
	Unknown ShoesSlot; //  0x2b0 Size(8)
	Unknown TopSlot; //  0x2b8 Size(8)
	Unknown U; //  0x2c0 Size(8)
	Unknown PlayerController; //  0x2c8 Size(8)
	Unknown EquipedSlots; //  0x2d0 Size(50)

	void ShowStatupAnim(Unknown& StatParams, Unknown StatType); // Function U.U.ShowStatupAnim(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown RichTextBlock_52; //  0x250 Size(8)
	Unknown DefaultTextStyle; //  0x258 Size(268)
	struct FText TextString; //  0x4c0 Size(18)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelAliveInfoWidget {
	Unknown UberGraphFrame; //  0x288 Size(8)
	Unknown GoldDesc_Hide; //  0x290 Size(8)
	Unknown GoldDesc_Show; //  0x298 Size(8)
	Unknown Revival_Add; //  0x2a0 Size(8)
	Unknown AliveCount_Text; //  0x2a8 Size(8)
	Unknown AliveCount_Text_2; //  0x2b0 Size(8)
	Unknown HorizontalBox_8; //  0x2b8 Size(8)
	Unknown HorizontalBox_16; //  0x2c0 Size(8)
	Unknown HorizontalBox_89; //  0x2c8 Size(8)
	Unknown HorizontalBox_Alive; //  0x2d0 Size(8)
	Unknown HorizontalBox_Assist; //  0x2d8 Size(8)
	Unknown HorizontalBox_CurrentGold; //  0x2e0 Size(8)
	Unknown HorizontalBox_Kill; //  0x2e8 Size(8)
	Unknown HorizontalBox_Team; //  0x2f0 Size(8)
	Unknown Image; //  0x2f8 Size(8)
	Unknown Image_1; //  0x300 Size(8)
	Unknown Image_2; //  0x308 Size(8)
	Unknown Image_6; //  0x310 Size(8)
	Unknown Image_102; //  0x318 Size(8)
	Unknown Image_271; //  0x320 Size(8)
	Unknown Image_376; //  0x328 Size(8)
	Unknown Image_378; //  0x330 Size(8)
	Unknown Image_1584; //  0x338 Size(8)
	Unknown KillAliveBG; //  0x340 Size(8)
	Unknown KillAliveBG_2; //  0x348 Size(8)
	Unknown KillAliveBG_3; //  0x350 Size(8)
	Unknown KillAliveBG_4; //  0x358 Size(8)
	Unknown KillCount_Text; //  0x360 Size(8)
	Unknown KillCount_Text_2; //  0x368 Size(8)
	Unknown RichTextBlock_275; //  0x370 Size(8)
	Unknown SizeBox_1; //  0x378 Size(8)
	Unknown SizeBox_3; //  0x380 Size(8)
	Unknown Spacer_2; //  0x388 Size(8)
	Unknown T_AliveCount; //  0x390 Size(8)
	Unknown T_AssistCount; //  0x398 Size(8)
	Unknown T_KillCount; //  0x3a0 Size(8)
	Unknown T_TeamCount; //  0x3a8 Size(8)
	Unknown TextBlock_1; //  0x3b0 Size(8)
	Unknown TextBlock_CurrentGold; //  0x3b8 Size(8)
	char ShowKillCountUI; //  0x3c0 Size(1)
	int32_t CurrentKillCount; //  0x3c4 Size(4)
	int32_t NewVar_1; //  0x3c8 Size(4)
	Unknown ShowGoldDescHandle; //  0x3d0 Size(8)
	Unknown AliveCount_Text_1_1; //  0x3d8 Size(8)
	Unknown KillCount_Text_1_1; //  0x3e0 Size(8)

	Unknown Get_HorizontalBox_CurrentGo_1(); // Function U.U.Get_HorizontalBox_CurrentGo_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown U; //  0x250 Size(8)
	Unknown U_2; //  0x258 Size(8)
	Unknown U_3; //  0x260 Size(8)
	Unknown U_4; //  0x268 Size(8)
	Unknown VerticalBox_OptionList; //  0x270 Size(8)

	void AddOptionList(Unknown& ItemOption); // Function U.U.AddOptionList(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelCompassUnitWidget {
	Unknown InvalidationBox_1; //  0x250 Size(8)
	Unknown InvalidationBox_2; //  0x258 Size(8)
	Unknown SpecialText; //  0x260 Size(8)

	struct FText GetAngleText(int32_t Angle, char& IsNormal); // Function U.U.GetAngleText(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelInventoryPerkWidget {
	Unknown UberGraphFrame; //  0x2e8 Size(8)
	Unknown Anim_Glow; //  0x2f0 Size(8)
	Unknown HideFreeSupply; //  0x2f8 Size(8)
	Unknown ShowFreeSupply; //  0x300 Size(8)
	Unknown LevelUp; //  0x308 Size(8)
	Unknown Ability_Defense; //  0x310 Size(8)
	Unknown Ability_Speed; //  0x318 Size(8)
	Unknown Ability_Power; //  0x320 Size(8)
	Unknown Survive_FadeInOut; //  0x328 Size(8)
	Unknown Anim_LevelUpDefense; //  0x330 Size(8)
	Unknown Anim_LevelUpSpeed; //  0x338 Size(8)
	Unknown Anim_LevelUpPower; //  0x340 Size(8)
	Unknown btn_ItemTree; //  0x348 Size(8)
	Unknown btn_PerkDeckDisabled; //  0x350 Size(8)
	Unknown btn_PerkDeckDisabled_2; //  0x358 Size(8)
	Unknown btn_PerkDeckEnabled; //  0x360 Size(8)
	Unknown btn_PerkDeckEnabled_2; //  0x368 Size(8)
	Unknown Canvas_BG; //  0x370 Size(8)
	Unknown Canvas_ChangeClass; //  0x378 Size(8)
	Unknown Canvas_ChangeDisable; //  0x380 Size(8)
	Unknown Canvas_ChangeDisable_2; //  0x388 Size(8)
	Unknown Canvas_ChangeEnable; //  0x390 Size(8)
	Unknown Canvas_ChangeEnable_2; //  0x398 Size(8)
	Unknown Canvas_ChangeSupply; //  0x3a0 Size(8)
	Unknown Canvas_LevelupEffect; //  0x3a8 Size(8)
	Unknown Canvas_Main; //  0x3b0 Size(8)
	Unknown Canvas_Perk; //  0x3b8 Size(8)
	Unknown Canvas_SupplyButton; //  0x3c0 Size(8)
	Unknown Canvas_UltimateEffect; //  0x3c8 Size(8)
	Unknown Canvas_UltimateLightEffect; //  0x3d0 Size(8)
	Unknown HorizontalBox_300; //  0x3d8 Size(8)
	Unknown HorizontalBox_303; //  0x3e0 Size(8)
	Unknown HorizontalBox_Stat; //  0x3e8 Size(8)
	Unknown HorizontalBox_UnlockLevel; //  0x3f0 Size(8)
	Unknown Image; //  0x3f8 Size(8)
	Unknown Image_5; //  0x400 Size(8)
	Unknown Image_86; //  0x408 Size(8)
	Unknown Image_126; //  0x410 Size(8)
	Unknown Image_163; //  0x418 Size(8)
	Unknown Image_180; //  0x420 Size(8)
	Unknown Image_200; //  0x428 Size(8)
	Unknown Image_203; //  0x430 Size(8)
	Unknown Image_222; //  0x438 Size(8)
	Unknown Image_384; //  0x440 Size(8)
	Unknown Image_387; //  0x448 Size(8)
	Unknown Image_388; //  0x450 Size(8)
	Unknown Image_389; //  0x458 Size(8)
	Unknown Image_485; //  0x460 Size(8)
	Unknown Image_571; //  0x468 Size(8)
	Unknown Image_1098; //  0x470 Size(8)
	Unknown Image_1100; //  0x478 Size(8)
	Unknown Image_1104; //  0x480 Size(8)
	Unknown Image_Cycle; //  0x488 Size(8)
	Unknown Image_Cycle_2; //  0x490 Size(8)
	Unknown IMG_ClassIcon; //  0x498 Size(8)
	Unknown IMG_PerkDeckIcon; //  0x4a0 Size(8)
	Unknown IMG_Supply; //  0x4a8 Size(8)
	Unknown IMG_UltimatedSkill; //  0x4b0 Size(8)
	Unknown InvalidationBox_1; //  0x4b8 Size(8)
	Unknown KeyImageWidget; //  0x4c0 Size(8)
	Unknown NotEnoughGold; //  0x4c8 Size(8)
	Unknown Over_Ultimate; //  0x4d0 Size(8)
	Unknown Overlay_UltimateKey; //  0x4d8 Size(8)
	Unknown Spacer_251; //  0x4e0 Size(8)
	Unknown T_ClassName; //  0x4e8 Size(8)
	Unknown T_Defense; //  0x4f0 Size(8)
	Unknown T_DefenseAnim; //  0x4f8 Size(8)
	Unknown T_Power; //  0x500 Size(8)
	Unknown T_PowerAnim; //  0x508 Size(8)
	Unknown T_Speed; //  0x510 Size(8)
	Unknown T_SpeedAnim; //  0x518 Size(8)
	Unknown T_UltimateName; //  0x520 Size(8)
	Unknown T_UnlockLevel; //  0x528 Size(8)
	Unknown T_UnlockLevel2; //  0x530 Size(8)
	Unknown T_WeaponName; //  0x538 Size(8)
	Unknown TextBlock_2; //  0x540 Size(8)
	Unknown TextBlock_3; //  0x548 Size(8)
	Unknown TextBlock_4; //  0x550 Size(8)
	Unknown TextBlock_9; //  0x558 Size(8)
	Unknown TextBlock_ClassLevel; //  0x560 Size(8)
	Unknown TextBlock_Count_Blue; //  0x568 Size(8)
	Unknown TextBlock_Count_Green; //  0x570 Size(8)
	Unknown TextBlock_Count_Red; //  0x578 Size(8)
	Unknown TextBlock_Defense; //  0x580 Size(8)
	Unknown TextBlock_Power; //  0x588 Size(8)
	Unknown TextBlock_Price; //  0x590 Size(8)
	Unknown TextBlock_Price_2; //  0x598 Size(8)
	Unknown TextBlock_Select; //  0x5a0 Size(8)
	Unknown TextBlock_Select_2; //  0x5a8 Size(8)
	Unknown TextBlock_Speed; //  0x5b0 Size(8)
	Unknown TextBlock_SurviveMessage01; //  0x5b8 Size(8)
	Unknown TextBlock_SurviveMessage02; //  0x5c0 Size(8)
	Unknown TextBlock_UltimateDesc; //  0x5c8 Size(8)
	Unknown Title; //  0x5d0 Size(8)
	Unknown UltiLight_001; //  0x5d8 Size(8)
	Unknown UltiLight_002; //  0x5e0 Size(8)
	Unknown UltiLight_003; //  0x5e8 Size(8)
	Unknown U; //  0x5f0 Size(8)
	Unknown U_2; //  0x5f8 Size(8)
	Unknown U_3; //  0x600 Size(8)
	Unknown U_4; //  0x608 Size(8)
	Unknown U_5; //  0x610 Size(8)
	Unknown U_6; //  0x618 Size(8)
	Unknown U_7; //  0x620 Size(8)
	Unknown U_8; //  0x628 Size(8)
	Unknown U_9; //  0x630 Size(8)
	Unknown VB_Health; //  0x638 Size(8)
	Unknown VB_Power; //  0x640 Size(8)
	Unknown VB_Speed; //  0x648 Size(8)
	Unknown VerticalBox_Blue; //  0x650 Size(8)
	Unknown VerticalBox_Green; //  0x658 Size(8)
	Unknown VerticalBox_Red; //  0x660 Size(8)
	Unknown WidgetSwitcher_ChangeClass; //  0x668 Size(8)
	Unknown WidgetSwitcher_ChangeSupply; //  0x670 Size(8)
	Unknown WidgetSwitcher_TreeAndClass; //  0x678 Size(8)
	Unknown WidgetSwitcher_Ultimate; //  0x680 Size(8)
	struct FName CurrentPerkDeckName; //  0x688 Size(8)
	Unknown CurrentPerkInfos; //  0x690 Size(10)
	struct FName ExpertWeaponKey; //  0x6a0 Size(8)
	Unknown CurrentPerkCells; //  0x6a8 Size(50)
	int32_t PerkMode; //  0x6f8 Size(4)
	Unknown HoverWidget; //  0x700 Size(8)
	int32_t PowerValue; //  0x708 Size(4)
	Unknown TimerHandle_Power; //  0x710 Size(8)
	int32_t SpeedValue; //  0x718 Size(4)
	Unknown TimerHandle_Speed; //  0x720 Size(8)
	int32_t DefenseValue; //  0x728 Size(4)
	Unknown TimerHandle_Defense; //  0x730 Size(8)
	char bPlayAbilityCountSoundStart; //  0x738 Size(1)
	char bPlayAbilityCountSoundEnd; //  0x739 Size(1)
	Unknown LevelUpSound; //  0x740 Size(8)
	char Enab; //  0x748 Size(1)
	Unknown FreeSupplyTimer; //  0x750 Size(8)
	Unknown NotEnoughtGoldTimer; //  0x758 Size(8)
	Unknown GainPerkPopups; //  0x760 Size(10)
	char IsPlayingUltimateSound; //  0x770 Size(1)
	int32_t LastLevel; //  0x774 Size(4)
	Unknown PerkDeckClassInfo; //  0x778 Size(28)

	void SequenceEvent__ENTRYPOINTU_2(); // Function U.U.SequenceEvent__ENTRYPOINTU_2(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Anim_HideKillAssist; //  0x250 Size(8)
	Unknown Anim_ShowAssist; //  0x258 Size(8)
	Unknown Anim_ShowKill; //  0x260 Size(8)
	Unknown T_AssistCount; //  0x268 Size(8)
	Unknown T_KillCount; //  0x270 Size(8)
	int32_t DefaultFontSize; //  0x278 Size(4)
	int32_t MiniFontSize; //  0x27c Size(4)
	char IsShowingKillCount; //  0x280 Size(1)
	Unknown Timer_HideKillCountText; //  0x288 Size(8)
	float RemainTime; //  0x290 Size(4)

	void SetHideTimer(); // Function U.U.SetHideTimer(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown BT; //  0x250 Size(8)
	Unknown BT; //  0x258 Size(8)
	Unknown BT; //  0x260 Size(8)
	Unknown BT; //  0x268 Size(8)
	Unknown BT; //  0x270 Size(8)
	Unknown BT; //  0x278 Size(8)
	Unknown BT; //  0x280 Size(8)
	Unknown BT; //  0x288 Size(8)
	Unknown BT; //  0x290 Size(8)
	Unknown BT; //  0x298 Size(8)
	Unknown BT; //  0x2a0 Size(8)
	Unknown BT; //  0x2a8 Size(8)
	Unknown BT; //  0x2b0 Size(8)
	Unknown BT; //  0x2b8 Size(8)
	Unknown BT; //  0x2c0 Size(8)
	Unknown BT; //  0x2c8 Size(8)
	Unknown BT; //  0x2d0 Size(8)
	Unknown BT; //  0x2d8 Size(8)
	Unknown BT; //  0x2e0 Size(8)
	Unknown BT; //  0x2e8 Size(8)
	Unknown BT; //  0x2f0 Size(8)
	Unknown BT; //  0x2f8 Size(8)
	Unknown BT; //  0x300 Size(8)
	Unknown BT; //  0x308 Size(8)
	Unknown BT; //  0x310 Size(8)
	Unknown BT; //  0x318 Size(8)
	Unknown BT; //  0x320 Size(8)
	Unknown BT; //  0x328 Size(8)
	Unknown BT; //  0x330 Size(8)
	Unknown BT; //  0x338 Size(8)
	Unknown BT; //  0x340 Size(8)
	Unknown BT; //  0x348 Size(8)
	Unknown BT; //  0x350 Size(8)
	Unknown BT; //  0x358 Size(8)
	Unknown BT; //  0x360 Size(8)
	Unknown BT; //  0x368 Size(8)
	Unknown BT; //  0x370 Size(8)
	Unknown BT; //  0x378 Size(8)
	Unknown BT; //  0x380 Size(8)
	Unknown Button_1; //  0x388 Size(8)
	Unknown Button_2; //  0x390 Size(8)
	Unknown Button_3; //  0x398 Size(8)
	Unknown Button_4; //  0x3a0 Size(8)
	Unknown Image_1; //  0x3a8 Size(8)
	Unknown Image_2; //  0x3b0 Size(8)
	Unknown Image_3; //  0x3b8 Size(8)
	Unknown Image_4; //  0x3c0 Size(8)
	Unknown IM; //  0x3c8 Size(8)
	Unknown IM; //  0x3d0 Size(8)
	Unknown IM; //  0x3d8 Size(8)
	Unknown IM; //  0x3e0 Size(8)
	Unknown IM; //  0x3e8 Size(8)
	Unknown IM; //  0x3f0 Size(8)
	Unknown IM; //  0x3f8 Size(8)
	Unknown IM; //  0x400 Size(8)
	Unknown IM; //  0x408 Size(8)
	Unknown IM; //  0x410 Size(8)
	Unknown IM; //  0x418 Size(8)
	Unknown IM; //  0x420 Size(8)
	Unknown IM; //  0x428 Size(8)
	Unknown IM; //  0x430 Size(8)
	Unknown IM; //  0x438 Size(8)
	Unknown IM; //  0x440 Size(8)
	Unknown IM; //  0x448 Size(8)
	Unknown IM; //  0x450 Size(8)
	Unknown IM; //  0x458 Size(8)
	Unknown IM; //  0x460 Size(8)
	Unknown IM; //  0x468 Size(8)
	Unknown IM; //  0x470 Size(8)
	Unknown IM; //  0x478 Size(8)
	Unknown IM; //  0x480 Size(8)
	Unknown IM; //  0x488 Size(8)
	Unknown IM; //  0x490 Size(8)
	Unknown IM; //  0x498 Size(8)
	Unknown IM; //  0x4a0 Size(8)
	Unknown IM; //  0x4a8 Size(8)
	Unknown IM; //  0x4b0 Size(8)
	Unknown IM; //  0x4b8 Size(8)
	Unknown IM; //  0x4c0 Size(8)
	Unknown IM; //  0x4c8 Size(8)
	Unknown IM; //  0x4d0 Size(8)
	Unknown IM; //  0x4d8 Size(8)
	Unknown IM; //  0x4e0 Size(8)
	Unknown IM; //  0x4e8 Size(8)
	Unknown IM; //  0x4f0 Size(8)
	Unknown S; //  0x4f8 Size(8)
	Unknown S; //  0x500 Size(8)
	Unknown S; //  0x508 Size(8)
	Unknown S; //  0x510 Size(8)
	Unknown S; //  0x518 Size(8)
	Unknown S; //  0x520 Size(8)
	Unknown S; //  0x528 Size(8)
	Unknown TextBlock_2; //  0x530 Size(8)
	Unknown TextBlock_3; //  0x538 Size(8)
	Unknown TextBlock_4; //  0x540 Size(8)
	Unknown TextBlock_5; //  0x548 Size(8)
	Unknown TX; //  0x550 Size(8)
	Unknown TX; //  0x558 Size(8)
	Unknown TX; //  0x560 Size(8)
	Unknown TX; //  0x568 Size(8)
	Unknown TX; //  0x570 Size(8)
	Unknown TX; //  0x578 Size(8)
	Unknown TX; //  0x580 Size(8)
	Unknown TX; //  0x588 Size(8)
	Unknown TX; //  0x590 Size(8)
	Unknown TX; //  0x598 Size(8)
	Unknown TX; //  0x5a0 Size(8)
	Unknown TX; //  0x5a8 Size(8)
	Unknown TX; //  0x5b0 Size(8)
	Unknown TX; //  0x5b8 Size(8)
	Unknown TX; //  0x5c0 Size(8)
	Unknown TX; //  0x5c8 Size(8)
	Unknown TX; //  0x5d0 Size(8)
	Unknown TX; //  0x5d8 Size(8)
	Unknown TX; //  0x5e0 Size(8)
	Unknown TX; //  0x5e8 Size(8)
	Unknown TX; //  0x5f0 Size(8)
	Unknown TX; //  0x5f8 Size(8)
	Unknown TX; //  0x600 Size(8)
	Unknown TX; //  0x608 Size(8)
	Unknown TX; //  0x610 Size(8)
	Unknown TX; //  0x618 Size(8)
	Unknown TX; //  0x620 Size(8)
	Unknown TX; //  0x628 Size(8)
	Unknown TX; //  0x630 Size(8)
	Unknown TX; //  0x638 Size(8)
	Unknown TX; //  0x640 Size(8)
	Unknown TX; //  0x648 Size(8)
	Unknown TX; //  0x650 Size(8)
	Unknown TX; //  0x658 Size(8)
	Unknown TX; //  0x660 Size(8)
	Unknown TX; //  0x668 Size(8)
	Unknown TX; //  0x670 Size(8)
	Unknown TX; //  0x678 Size(8)
	Unknown VerticalBox_Perk; //  0x680 Size(8)
	Unknown NormalSlateColor; //  0x688 Size(28)
	Unknown SelectedSlateColor; //  0x6b0 Size(28)
	Unknown BlackMarketMainRef; //  0x6d8 Size(8)

	void SetConsumableData(Unknown Type); // Function U.U.SetConsumableData(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelInteractionWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown UpArrow; //  0x250 Size(8)
	Unknown InteractivePopup_motion; //  0x258 Size(8)
	Unknown AmmoCnt; //  0x260 Size(8)
	Unknown AmmoDown; //  0x268 Size(8)
	Unknown AmmoUp; //  0x270 Size(8)
	Unknown Attack; //  0x278 Size(8)
	Unknown AttackDown; //  0x280 Size(8)
	Unknown AttackUp; //  0x288 Size(8)
	Unknown BuffListWithText; //  0x290 Size(8)
	Unknown CanvasPanel_17; //  0x298 Size(8)
	Unknown CP_Key; //  0x2a0 Size(8)
	Unknown CustomWidgetSwitcher; //  0x2a8 Size(8)
	Unknown fill; //  0x2b0 Size(8)
	Unknown Firingrate; //  0x2b8 Size(8)
	Unknown FiringrateDown; //  0x2c0 Size(8)
	Unknown FiringrateUp; //  0x2c8 Size(8)
	Unknown HB_BuffList; //  0x2d0 Size(8)
	Unknown HorizontalBox_Rarity; //  0x2d8 Size(8)
	Unknown HorizontalBox_WeaponRarity; //  0x2e0 Size(8)
	Unknown Image; //  0x2e8 Size(8)
	Unknown Image_4; //  0x2f0 Size(8)
	Unknown Image_10; //  0x2f8 Size(8)
	Unknown Image_152; //  0x300 Size(8)
	Unknown Image_ItemIcon; //  0x308 Size(8)
	Unknown Image_WeaponLock; //  0x310 Size(8)
	Unknown Interactive; //  0x318 Size(8)
	Unknown ItemBg_01; //  0x320 Size(8)
	Unknown Key_Bomb; //  0x328 Size(8)
	Unknown KeyImageWidget_C_1; //  0x330 Size(8)
	Unknown NeedItem; //  0x338 Size(8)
	Unknown PickUpBg; //  0x340 Size(8)
	Unknown PickupItem; //  0x348 Size(8)
	Unknown Range; //  0x350 Size(8)
	Unknown RangeDown; //  0x358 Size(8)
	Unknown RangeUp; //  0x360 Size(8)
	Unknown RichT_Action; //  0x368 Size(8)
	Unknown RichT_ActionDescription; //  0x370 Size(8)
	Unknown SizeBox_WeaponOwner; //  0x378 Size(8)
	Unknown Stab; //  0x380 Size(8)
	Unknown StabBox_Wj; //  0x388 Size(8)
	Unknown Stab; //  0x390 Size(8)
	Unknown Switcher_Item; //  0x398 Size(8)
	Unknown T_BombCancel; //  0x3a0 Size(8)
	Unknown T_ComparingWeaponName; //  0x3a8 Size(8)
	Unknown T_PickupItemName; //  0x3b0 Size(8)
	Unknown T_WeaponName; //  0x3b8 Size(8)
	Unknown Text_CombineTarget; //  0x3c0 Size(8)
	Unknown TextBlock_5; //  0x3c8 Size(8)
	Unknown U; //  0x3d0 Size(8)
	Unknown U_2; //  0x3d8 Size(8)
	Unknown U_3; //  0x3e0 Size(8)
	Unknown U; //  0x3e8 Size(8)
	Unknown U_2; //  0x3f0 Size(8)
	Unknown U_3; //  0x3f8 Size(8)
	Unknown VerticalBox_CombineTarget; //  0x400 Size(8)
	Unknown VerticalBox_StatUp; //  0x408 Size(8)
	Unknown WeaponDesc; //  0x410 Size(8)
	Unknown WeaponItemImage; //  0x418 Size(8)
	Unknown WeaponItemSlot; //  0x420 Size(8)
	Unknown WeaponItemSlot_2; //  0x428 Size(8)
	Unknown WeaponItemSlotHover; //  0x430 Size(8)
	Unknown WidgetSwitcher_123; //  0x438 Size(8)
	Unknown DisableTextColor; //  0x440 Size(28)
	Unknown Enab; //  0x468 Size(28)
	char IsDisable; //  0x490 Size(1)
	Unknown PickupItemInfo_1; //  0x498 Size(98)
	Unknown UpLinearColor; //  0x530 Size(10)
	Unknown DownLinearColor; //  0x540 Size(10)
	Unknown NormalSlateColor; //  0x550 Size(28)
	Unknown UpSlateColor; //  0x578 Size(28)
	Unknown DownSlateColor; //  0x5a0 Size(28)
	char bAction; //  0x5c8 Size(1)
	char bCompare; //  0x5c9 Size(1)
	Unknown CompareWeaponInfo; //  0x5d0 Size(b30)
	char IsNoHide; //  0x1100 Size(1)
	char bWeapon; //  0x1101 Size(1)
	char bPlayAnimation_WeaponCompare; //  0x1102 Size(1)
	Unknown VisibleTextColor; //  0x1108 Size(28)
	Unknown BrushActionKeyWhite; //  0x1130 Size(88)
	Unknown BrushActionKeyRed; //  0x11b8 Size(88)
	struct FName TempName; //  0x1240 Size(8)
	struct FText AvailableAmmoQuantity; //  0x1248 Size(18)

	void SetCompareFloatArrow(Unknown UpImgae, Unknown DownImgae, Unknown Text, Unknown CompareInfo); // Function U.U.SetCompareFloatArrow(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Image_350; //  0x250 Size(8)
	Unknown Image_585; //  0x258 Size(8)
	Unknown Image_Grade_Color_Line; //  0x260 Size(8)
	Unknown TextBlock_445; //  0x268 Size(8)

	void SetBuffInfo(struct FText BuffName, struct FText Desc, Unknown Icon, int32_t Rarity); // Function U.U.SetBuffInfo(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown HorizontalBox_Rarity; //  0x248 Size(8)
	Unknown T_WeaponName; //  0x250 Size(8)

	void SetNameByID(int32_t ItemId); // Function U.U.SetNameByID(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Image_2; //  0x250 Size(8)
	Unknown Notice; //  0x258 Size(8)
	Unknown WidgetSwitcher_1; //  0x260 Size(8)

	void SetMessage(struct FText Str); // Function U.U.SetMessage(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Button_96; //  0x250 Size(8)
	Unknown Image; //  0x258 Size(8)
	Unknown Image_193; //  0x260 Size(8)
	Unknown Image_395; //  0x268 Size(8)
	Unknown Image_Arrow_Guide; //  0x270 Size(8)
	Unknown Img_hover; //  0x278 Size(8)
	Unknown Img_Pressed; //  0x280 Size(8)
	Unknown U; //  0x288 Size(8)
	Unknown WidgetSwitcher_263; //  0x290 Size(8)
	struct FMulticastInlineDelegate EventDispatcher_EndOpen; //  0x298 Size(10)
	Unknown ItemOption; //  0x2a8 Size(b8)
	char IsOpened; //  0x360 Size(1)
	float CurrentHoverOpacity; //  0x364 Size(4)
	Unknown PressedMaterialInstance; //  0x368 Size(8)
	float CurrentPressedAnim; //  0x370 Size(4)
	struct FMulticastInlineDelegate EventDispatcher_StartOpen; //  0x378 Size(10)

	void SetItemOption(Unknown& ItemOption); // Function U.U.SetItemOption(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Button_Category; //  0x250 Size(8)
	Unknown CanvasPanel_SlotList; //  0x258 Size(8)
	Unknown Image_New; //  0x260 Size(8)
	Unknown T_CategoryName; //  0x268 Size(8)
	Unknown U_4; //  0x270 Size(8)
	Unknown U_5; //  0x278 Size(8)
	Unknown U_6; //  0x280 Size(8)
	Unknown VerticalBox_ItemList; //  0x288 Size(8)
	Unknown WidgetSwitcher_Own; //  0x290 Size(8)
	struct FString WeaponType; //  0x298 Size(10)
	char IsPressed; //  0x2a8 Size(1)
	char IsOwn; //  0x2a9 Size(1)
	char IsOwnAny; //  0x2aa Size(1)
	Unknown ParentWidgetRef; //  0x2b0 Size(8)
	float SlotSize; //  0x2b8 Size(4)
	float CurrentListSize; //  0x2bc Size(4)
	Unknown DefaultImage; //  0x2c0 Size(8)
	Unknown HoverImage; //  0x2c8 Size(8)
	Unknown PressedDefaultImage; //  0x2d0 Size(8)
	Unknown PressedHoverImage; //  0x2d8 Size(8)

	void SetNew(); // Function U.U.SetNew(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelInventoryHoverWidget {
	Unknown UberGraphFrame; //  0x280 Size(8)
	Unknown UpArrow; //  0x288 Size(8)
	Unknown FadeIn; //  0x290 Size(8)
	Unknown Ammo_Compare; //  0x298 Size(8)
	Unknown Ammo_Value; //  0x2a0 Size(8)
	Unknown AmmoIcon; //  0x2a8 Size(8)
	Unknown AmmoInfo; //  0x2b0 Size(8)
	Unknown Arrow_01; //  0x2b8 Size(8)
	Unknown Arrow_02; //  0x2c0 Size(8)
	Unknown BuffList; //  0x2c8 Size(8)
	Unknown BuffList_2; //  0x2d0 Size(8)
	Unknown EffectiveRange_Compare; //  0x2d8 Size(8)
	Unknown EffectiveRange_Value; //  0x2e0 Size(8)
	Unknown FiringRate_Compare; //  0x2e8 Size(8)
	Unknown FiringRate_Value; //  0x2f0 Size(8)
	Unknown HorizontalBox_ItemRarity; //  0x2f8 Size(8)
	Unknown HorizontalBox_MaterialRarity; //  0x300 Size(8)
	Unknown HorizontalBox_WeaponRarity; //  0x308 Size(8)
	Unknown Image; //  0x310 Size(8)
	Unknown Image_2; //  0x318 Size(8)
	Unknown Image_3; //  0x320 Size(8)
	Unknown Image_8; //  0x328 Size(8)
	Unknown Image_9; //  0x330 Size(8)
	Unknown Image_10; //  0x338 Size(8)
	Unknown Image_11; //  0x340 Size(8)
	Unknown Image_12; //  0x348 Size(8)
	Unknown Image_13; //  0x350 Size(8)
	Unknown Image_14; //  0x358 Size(8)
	Unknown Image_15; //  0x360 Size(8)
	Unknown Image_16; //  0x368 Size(8)
	Unknown Image_20; //  0x370 Size(8)
	Unknown Image_22; //  0x378 Size(8)
	Unknown Image_23; //  0x380 Size(8)
	Unknown Image_24; //  0x388 Size(8)
	Unknown Image_25; //  0x390 Size(8)
	Unknown Image_26; //  0x398 Size(8)
	Unknown Image_27; //  0x3a0 Size(8)
	Unknown Image_28; //  0x3a8 Size(8)
	Unknown Image_29; //  0x3b0 Size(8)
	Unknown Image_30; //  0x3b8 Size(8)
	Unknown Image_31; //  0x3c0 Size(8)
	Unknown Image_32; //  0x3c8 Size(8)
	Unknown Image_310; //  0x3d0 Size(8)
	Unknown Image_557; //  0x3d8 Size(8)
	Unknown Image_WeaponLock; //  0x3e0 Size(8)
	Unknown Img_MaterialBG; //  0x3e8 Size(8)
	Unknown IMG_MaterialIcon; //  0x3f0 Size(8)
	Unknown IMG_Stat; //  0x3f8 Size(8)
	Unknown ItemBg; //  0x400 Size(8)
	Unknown ItemBg_01; //  0x408 Size(8)
	Unknown ItemBg_02; //  0x410 Size(8)
	Unknown ItemSlot; //  0x418 Size(8)
	Unknown ItemSlot; //  0x420 Size(8)
	Unknown ItemSlot_2; //  0x428 Size(8)
	Unknown ItemSlot; //  0x430 Size(8)
	Unknown ItemSlot_2; //  0x438 Size(8)
	Unknown ItemSlot; //  0x440 Size(8)
	Unknown ItemSlot; //  0x448 Size(8)
	Unknown ItemSlot; //  0x450 Size(8)
	Unknown ItemSlot; //  0x458 Size(8)
	Unknown ItemSlotHover; //  0x460 Size(8)
	Unknown PerkBG; //  0x468 Size(8)
	Unknown PerkImage; //  0x470 Size(8)
	Unknown PerkLevelText; //  0x478 Size(8)
	Unknown PerkName; //  0x480 Size(8)
	Unknown PerkSlotHover; //  0x488 Size(8)
	Unknown PopupHover_2; //  0x490 Size(8)
	Unknown Power_Compare; //  0x498 Size(8)
	Unknown Power_Value; //  0x4a0 Size(8)
	Unknown SizeBox; //  0x4a8 Size(8)
	Unknown SizeBox_7; //  0x4b0 Size(8)
	Unknown SizeBox_ComparingText; //  0x4b8 Size(8)
	Unknown SizeBox_ItemDivide; //  0x4c0 Size(8)
	Unknown Stab; //  0x4c8 Size(8)
	Unknown StabBox_ItemDiv; //  0x4d0 Size(8)
	Unknown StatSlotHover; //  0x4d8 Size(8)
	Unknown T_BindPlayerName; //  0x4e0 Size(8)
	Unknown T_Material; //  0x4e8 Size(8)
	Unknown T_MaterialDesc; //  0x4f0 Size(8)
	Unknown T_PerkDescLv1; //  0x4f8 Size(8)
	Unknown T_PerkDescLv2; //  0x500 Size(8)
	Unknown T_PerkDescLv3; //  0x508 Size(8)
	Unknown T_Stat; //  0x510 Size(8)
	Unknown T_StatDesc; //  0x518 Size(8)
	Unknown T_TooltipDesc; //  0x520 Size(8)
	Unknown T_UltimateDesc; //  0x528 Size(8)
	Unknown T_UnlockUltimateLev; //  0x530 Size(8)
	Unknown Text_CombineTarget; //  0x538 Size(8)
	Unknown TextBlock_3; //  0x540 Size(8)
	Unknown TextBlock_4; //  0x548 Size(8)
	Unknown TextBlock_5; //  0x550 Size(8)
	Unknown TextBlock_6; //  0x558 Size(8)
	Unknown UpArrowAni; //  0x560 Size(8)
	Unknown U; //  0x568 Size(8)
	Unknown U_2; //  0x570 Size(8)
	Unknown U; //  0x578 Size(8)
	Unknown U_2; //  0x580 Size(8)
	Unknown U_3; //  0x588 Size(8)
	Unknown U_4; //  0x590 Size(8)
	Unknown VerticalBox_3; //  0x598 Size(8)
	Unknown VerticalBox_BuffList; //  0x5a0 Size(8)
	Unknown VerticalBox_BuffList_2; //  0x5a8 Size(8)
	Unknown VerticalBox_CombineTarget; //  0x5b0 Size(8)
	Unknown VerticalBox_Divide; //  0x5b8 Size(8)
	Unknown VerticalBox_ItemDiv; //  0x5c0 Size(8)
	Unknown VerticalBox_WeaponBindedInfo; //  0x5c8 Size(8)
	Unknown WeaponItemCapacity; //  0x5d0 Size(8)
	Unknown WeaponItemComparingName; //  0x5d8 Size(8)
	Unknown WeaponItemDescription; //  0x5e0 Size(8)
	Unknown WeaponItemImage; //  0x5e8 Size(8)
	Unknown WeaponItemSlot; //  0x5f0 Size(8)
	Unknown WeaponItemSlotHover; //  0x5f8 Size(8)
	Unknown WeaponItemType; //  0x600 Size(8)
	Unknown WeaponLockImage; //  0x608 Size(8)
	Unknown WeaponName; //  0x610 Size(8)
	Unknown WidgetSwitcher; //  0x618 Size(8)
	Unknown WidgetSwitcher_1; //  0x620 Size(8)
	Unknown WidgetSwitcher_2; //  0x628 Size(8)
	Unknown WidgetSwitcher_3; //  0x630 Size(8)
	Unknown WidgetSwitcher_4; //  0x638 Size(8)
	Unknown WidgetSwitcher_Main; //  0x640 Size(8)
	Unknown WidgetSwitcher_PerkUltimate; //  0x648 Size(8)
	Unknown ItemInfo; //  0x650 Size(98)
	Unknown WeaponInfo; //  0x6e8 Size(b30)
	char bCompare; //  0x1218 Size(1)
	Unknown NormalSlateColor; //  0x1220 Size(28)
	Unknown UpSlateColor; //  0x1248 Size(28)
	Unknown DownSlateColor; //  0x1270 Size(28)
	Unknown UpLinearColor; //  0x1298 Size(10)
	Unknown DownLinearColor; //  0x12a8 Size(10)
	Unknown WeaponObjectRef; //  0x12b8 Size(8)
	Unknown ItemDetailInfo; //  0x12c0 Size(490)
	Unknown PerkInfo; //  0x1750 Size(2c)
	Unknown PerkData; //  0x1780 Size(e0)
	struct FName Ammo; //  0x1860 Size(8)
	Unknown DragType; //  0x1868 Size(1)
	Unknown HoveredWidget; //  0x1870 Size(8)
	Unknown CurrentShowingWidgetRef; //  0x1878 Size(8)
	char IsUltimatePerk; //  0x1880 Size(1)
	struct FText UltimateName; //  0x1888 Size(18)
	Unknown UltimateLinearColor; //  0x18a0 Size(10)
	Unknown UltimateImage; //  0x18b0 Size(28)
	Unknown HoverTimerHandle; //  0x18d8 Size(8)
	char NeedCheckVisibility; //  0x18e0 Size(1)
	char IsVisualMode; //  0x18e1 Size(1)
	char IsRandomPerk; //  0x18e2 Size(1)
	Unknown ItemRarityImages; //  0x18e8 Size(10)
	Unknown WeaponRarityImages; //  0x18f8 Size(10)

	float GetDisplayAccuracy(); // Function U.U.GetDisplayAccuracy(Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown TextBlock_62; //  0x248 Size(8)

	void Init(struct FString Str); // Function U.U.Init(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Button_98; //  0x250 Size(8)
	Unknown Time_2; //  0x258 Size(8)
	Unknown SavedEvent; //  0x260 Size(28)
	struct FString SavedReplayFileName; //  0x288 Size(10)
	Unknown ReplayListWidget; //  0x298 Size(8)

	void Init(Unknown Event, struct FString ReplayFileName, Unknown ReplayListWidget); // Function U.U.Init(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Img_Voice; //  0x250 Size(8)
	Unknown Img_VoiceX; //  0x258 Size(8)
	Unknown SizeBox_2; //  0x260 Size(8)
	Unknown TextBlock; //  0x268 Size(8)
	Unknown WidgetSwitcher_LogOut; //  0x270 Size(8)
	Unknown Timer; //  0x278 Size(8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown T_Desc; //  0x248 Size(8)
	Unknown U; //  0x250 Size(8)
	Unknown U_2; //  0x258 Size(8)
	Unknown U_3; //  0x260 Size(8)
	Unknown U_4; //  0x268 Size(8)
	Unknown U_5; //  0x270 Size(8)
	Unknown U_6; //  0x278 Size(8)
	Unknown U_7; //  0x280 Size(8)
	Unknown U_8; //  0x288 Size(8)
	Unknown U_9; //  0x290 Size(8)
	Unknown U_10; //  0x298 Size(8)
	Unknown WrapBox_Options; //  0x2a0 Size(8)

	void SetRandomOptionDesc(struct FText Desc); // Function U.U.SetRandomOptionDesc(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Image_Buff; //  0x250 Size(8)
	Unknown Image_Grade_Color_Line; //  0x258 Size(8)
	Unknown ItemOption; //  0x260 Size(b8)

	void SetItemOption(Unknown& ItemOption); // Function U.U.SetItemOption(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown Image_273; //  0x248 Size(8)
	Unknown U; //  0x250 Size(8)
	Unknown U; //  0x258 Size(8)

	void SetWeaponInfo(int32_t WeaponItemID); // Function U.U.SetWeaponInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown HorizontalBox_Rarity; //  0x250 Size(8)
	Unknown HorizontalBox_Rarity_NotOwn; //  0x258 Size(8)
	Unknown Image_310; //  0x260 Size(8)
	Unknown Image_Weapon_6Grade_bg; //  0x268 Size(8)
	Unknown Img_Icon; //  0x270 Size(8)
	Unknown RetainerBox_2; //  0x278 Size(8)
	Unknown T_CurrentCount; //  0x280 Size(8)
	Unknown T_Level; //  0x288 Size(8)
	Unknown T_MaxCount; //  0x290 Size(8)
	Unknown WidgetSwitcher_Rarity; //  0x298 Size(8)
	int32_t ItemWeaponID; //  0x2a0 Size(4)
	Unknown WeaponInfo; //  0x2a8 Size(b30)
	Unknown WeaponItemInfo; //  0xdd8 Size(98)
	int32_t CurrentCount; //  0xe70 Size(4)

	void SetOwnInfo(); // Function U.U.SetOwnInfo(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown HorizontalBox_Rarity; //  0x250 Size(8)
	Unknown HorizontalBox_Rarity_NotOwn; //  0x258 Size(8)
	Unknown Img_BG; //  0x260 Size(8)
	Unknown Img_Icon; //  0x268 Size(8)
	Unknown RetainerBox_2; //  0x270 Size(8)
	Unknown T_CurrentCount; //  0x278 Size(8)
	Unknown T_MaxCount; //  0x280 Size(8)
	Unknown T_RecipeNum; //  0x288 Size(8)
	Unknown WidgetSwitcher_Rarity; //  0x290 Size(8)
	Unknown MaterialInfo; //  0x298 Size(d0)
	int32_t ItemId; //  0x368 Size(4)
	int32_t MaxCount; //  0x36c Size(4)
	int32_t CurrentCount; //  0x370 Size(4)

	void SetNotOwnRarityVisibility(int32_t Rarity); // Function U.U.SetNotOwnRarityVisibility(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Canvas_Recipe1; //  0x250 Size(8)
	Unknown Canvas_Recipe2; //  0x258 Size(8)
	Unknown U; //  0x260 Size(8)
	Unknown U_2; //  0x268 Size(8)
	Unknown U_3; //  0x270 Size(8)
	Unknown U_4; //  0x278 Size(8)
	Unknown U_5; //  0x280 Size(8)
	Unknown U_6; //  0x288 Size(8)
	Unknown U_7; //  0x290 Size(8)
	Unknown U_8; //  0x298 Size(8)
	Unknown U_9; //  0x2a0 Size(8)
	Unknown U_10; //  0x2a8 Size(8)
	Unknown U_11; //  0x2b0 Size(8)
	Unknown WidgetSwitcher_68; //  0x2b8 Size(8)
	Unknown Recipe_ItemArray; //  0x2c0 Size(10)
	Unknown Recipe_ItemArray2; //  0x2d0 Size(10)
	char HasWeapon; //  0x2e0 Size(1)
	Unknown ArmoryInputRef; //  0x2e8 Size(8)
	float CurrentOpacity; //  0x2f0 Size(4)

	void SetOpacity(); // Function U.U.SetOpacity(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelNetworkDelayWidget {
	Unknown Image_350; //  0x260 Size(8)
	Unknown Image_409; //  0x268 Size(8)
	Unknown Image_479; //  0x270 Size(8)
	Unknown Image_564; //  0x278 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Button_Weapon; //  0x250 Size(8)
	Unknown HorizontalBox_Rarity; //  0x258 Size(8)
	Unknown Image_2; //  0x260 Size(8)
	Unknown Image_3; //  0x268 Size(8)
	Unknown Image_4; //  0x270 Size(8)
	Unknown Image_5; //  0x278 Size(8)
	Unknown Image_6; //  0x280 Size(8)
	Unknown Image_7; //  0x288 Size(8)
	Unknown Image_8; //  0x290 Size(8)
	Unknown Image_310; //  0x298 Size(8)
	Unknown Image_Item_Weapon; //  0x2a0 Size(8)
	Unknown Image_New; //  0x2a8 Size(8)
	Unknown T_Name; //  0x2b0 Size(8)
	Unknown WidgetSwitcher_Own; //  0x2b8 Size(8)
	Unknown ParentWidgetRef; //  0x2c0 Size(8)
	Unknown CraftingInfo; //  0x2c8 Size(128)
	Unknown CraftMaterialItemIDList; //  0x3f0 Size(10)
	int32_t CraftMaterialWeaponID; //  0x400 Size(4)
	char IsOwn; //  0x404 Size(1)
	char IsOwnAny; //  0x405 Size(1)
	Unknown DefaultImage; //  0x408 Size(8)
	Unknown PressedDefaultImage; //  0x410 Size(8)
	char IsNew; //  0x418 Size(1)

	void SetNew(char IsNew); // Function U.U.SetNew(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Ellipsis_M; //  0x250 Size(8)
	Unknown CanvasPanel_123; //  0x258 Size(8)
	Unknown Enhancing; //  0x260 Size(8)
	Unknown Image_305; //  0x268 Size(8)
	Unknown Image_841; //  0x270 Size(8)
	Unknown InputEventBox; //  0x278 Size(8)
	Unknown Skip; //  0x280 Size(8)
	Unknown TextBlock_335; //  0x288 Size(8)
	Unknown TextBlock_336; //  0x290 Size(8)
	Unknown TextBlock_337; //  0x298 Size(8)
	Unknown TextBlock_362; //  0x2a0 Size(8)
	Unknown TextEnhanceing; //  0x2a8 Size(8)
	Unknown U; //  0x2b0 Size(8)
	Unknown U; //  0x2b8 Size(8)
	Unknown EnhanceResultTimerHandle; //  0x2c0 Size(8)

	void Craft(); // Function U.U.Craft(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Armory_Repair_M; //  0x250 Size(8)
	Unknown Armory_Strengthen_M; //  0x258 Size(8)
	Unknown Armory_Failed_M; //  0x260 Size(8)
	Unknown Armory_Break_M; //  0x268 Size(8)
	Unknown Armory_Failed_Break_M; //  0x270 Size(8)
	Unknown Armory_Failed_Down_M; //  0x278 Size(8)
	Unknown Armory_Awesome_M; //  0x280 Size(8)
	Unknown Armory_Success_M; //  0x288 Size(8)
	Unknown Armory_Awesome; //  0x290 Size(8)
	Unknown Armory_Break; //  0x298 Size(8)
	Unknown Armory_Failed; //  0x2a0 Size(8)
	Unknown Armory_Failed_Break; //  0x2a8 Size(8)
	Unknown Armory_Failed_Down; //  0x2b0 Size(8)
	Unknown Armory_Repair; //  0x2b8 Size(8)
	Unknown Armory_Strengthen; //  0x2c0 Size(8)
	Unknown Armory_Success; //  0x2c8 Size(8)
	Unknown Awesome_Damage1; //  0x2d0 Size(8)
	Unknown Awesome_Damage2; //  0x2d8 Size(8)
	Unknown Awesome_ItemName; //  0x2e0 Size(8)
	Unknown Awesome_Level1; //  0x2e8 Size(8)
	Unknown Awesome_Level2; //  0x2f0 Size(8)
	Unknown Awesome_MagSize1; //  0x2f8 Size(8)
	Unknown Awesome_MagSize2; //  0x300 Size(8)
	Unknown Awesome_Spread1; //  0x308 Size(8)
	Unknown Awesome_Spread2; //  0x310 Size(8)
	Unknown Awesome_UpLevel; //  0x318 Size(8)
	Unknown Break_Count; //  0x320 Size(8)
	Unknown Break_ItemName; //  0x328 Size(8)
	Unknown BreakTitle; //  0x330 Size(8)
	Unknown Button_1; //  0x338 Size(8)
	Unknown Button_2; //  0x340 Size(8)
	Unknown Button_228; //  0x348 Size(8)
	Unknown Button_230; //  0x350 Size(8)
	Unknown Button_232; //  0x358 Size(8)
	Unknown Button_233; //  0x360 Size(8)
	Unknown Button_EnchanceCancle; //  0x368 Size(8)
	Unknown Button_Enhance; //  0x370 Size(8)
	Unknown Button_Fatigue; //  0x378 Size(8)
	Unknown Empty; //  0x380 Size(8)
	Unknown FB_Damage1; //  0x388 Size(8)
	Unknown FB_Damage2; //  0x390 Size(8)
	Unknown FB_Level1; //  0x398 Size(8)
	Unknown FB_Level2; //  0x3a0 Size(8)
	Unknown FB_MagSize1; //  0x3a8 Size(8)
	Unknown FB_MagSize2; //  0x3b0 Size(8)
	Unknown FB_Spread1; //  0x3b8 Size(8)
	Unknown FB_Spread2; //  0x3c0 Size(8)
	Unknown FD_Damage1; //  0x3c8 Size(8)
	Unknown FD_Damage2; //  0x3d0 Size(8)
	Unknown FD_DownLevel; //  0x3d8 Size(8)
	Unknown FD_Level1; //  0x3e0 Size(8)
	Unknown FD_Level2; //  0x3e8 Size(8)
	Unknown FD_MagSize1; //  0x3f0 Size(8)
	Unknown FD_MagSize2; //  0x3f8 Size(8)
	Unknown FD_Spread1; //  0x400 Size(8)
	Unknown FD_Spread2; //  0x408 Size(8)
	Unknown HorizontalBox_Awesome_Damage; //  0x410 Size(8)
	Unknown HorizontalBox_Awesome_MagSize; //  0x418 Size(8)
	Unknown HorizontalBox_Awesome_Spread; //  0x420 Size(8)
	Unknown HorizontalBox_FB_Damage; //  0x428 Size(8)
	Unknown HorizontalBox_FB_MagSize; //  0x430 Size(8)
	Unknown HorizontalBox_FB_Spread; //  0x438 Size(8)
	Unknown HorizontalBox_FD_Damage; //  0x440 Size(8)
	Unknown HorizontalBox_FD_MasSize; //  0x448 Size(8)
	Unknown HorizontalBox_FD_Spread; //  0x450 Size(8)
	Unknown HorizontalBox_Strengthen_Damage; //  0x458 Size(8)
	Unknown HorizontalBox_Strengthen_MagSize; //  0x460 Size(8)
	Unknown HorizontalBox_Strengthen_Spread; //  0x468 Size(8)
	Unknown HorizontalBox_Success_Damage; //  0x470 Size(8)
	Unknown HorizontalBox_Success_Durable; //  0x478 Size(8)
	Unknown HorizontalBox_Success_Fatigue; //  0x480 Size(8)
	Unknown HorizontalBox_Success_MagSize; //  0x488 Size(8)
	Unknown HorizontalBox_Success_Spread; //  0x490 Size(8)
	Unknown Image; //  0x498 Size(8)
	Unknown Image_2; //  0x4a0 Size(8)
	Unknown Image_3; //  0x4a8 Size(8)
	Unknown Image_4; //  0x4b0 Size(8)
	Unknown Image_8; //  0x4b8 Size(8)
	Unknown Image_14; //  0x4c0 Size(8)
	Unknown Image_15; //  0x4c8 Size(8)
	Unknown Image_16; //  0x4d0 Size(8)
	Unknown Image_17; //  0x4d8 Size(8)
	Unknown Image_18; //  0x4e0 Size(8)
	Unknown Image_20; //  0x4e8 Size(8)
	Unknown Image_27; //  0x4f0 Size(8)
	Unknown Image_167; //  0x4f8 Size(8)
	Unknown Image_501; //  0x500 Size(8)
	Unknown Image_503; //  0x508 Size(8)
	Unknown Image_817; //  0x510 Size(8)
	Unknown Image_820; //  0x518 Size(8)
	Unknown Image_821; //  0x520 Size(8)
	Unknown Image_822; //  0x528 Size(8)
	Unknown Image_823; //  0x530 Size(8)
	Unknown Image_824; //  0x538 Size(8)
	Unknown Image_825; //  0x540 Size(8)
	Unknown Image_826; //  0x548 Size(8)
	Unknown Image_827; //  0x550 Size(8)
	Unknown Image_828; //  0x558 Size(8)
	Unknown Image_829; //  0x560 Size(8)
	Unknown Image_830; //  0x568 Size(8)
	Unknown Image_831; //  0x570 Size(8)
	Unknown Image_832; //  0x578 Size(8)
	Unknown Image_833; //  0x580 Size(8)
	Unknown Image_834; //  0x588 Size(8)
	Unknown Image_835; //  0x590 Size(8)
	Unknown Image_836; //  0x598 Size(8)
	Unknown Image_837; //  0x5a0 Size(8)
	Unknown Image_838; //  0x5a8 Size(8)
	Unknown Image_839; //  0x5b0 Size(8)
	Unknown Image_840; //  0x5b8 Size(8)
	Unknown Image_841; //  0x5c0 Size(8)
	Unknown Image_842; //  0x5c8 Size(8)
	Unknown Image_843; //  0x5d0 Size(8)
	Unknown Image_845; //  0x5d8 Size(8)
	Unknown Image_846; //  0x5e0 Size(8)
	Unknown Image_847; //  0x5e8 Size(8)
	Unknown Image_848; //  0x5f0 Size(8)
	Unknown Image_849; //  0x5f8 Size(8)
	Unknown Image_850; //  0x600 Size(8)
	Unknown Image_851; //  0x608 Size(8)
	Unknown Image_852; //  0x610 Size(8)
	Unknown Image_853; //  0x618 Size(8)
	Unknown Image_854; //  0x620 Size(8)
	Unknown Image_855; //  0x628 Size(8)
	Unknown Image_856; //  0x630 Size(8)
	Unknown Image_857; //  0x638 Size(8)
	Unknown Image_858; //  0x640 Size(8)
	Unknown Image_859; //  0x648 Size(8)
	Unknown Image_860; //  0x650 Size(8)
	Unknown Image_861; //  0x658 Size(8)
	Unknown Image_862; //  0x660 Size(8)
	Unknown Image_863; //  0x668 Size(8)
	Unknown Image_864; //  0x670 Size(8)
	Unknown Image_865; //  0x678 Size(8)
	Unknown Image_866; //  0x680 Size(8)
	Unknown Image_867; //  0x688 Size(8)
	Unknown Image_868; //  0x690 Size(8)
	Unknown Image_921; //  0x698 Size(8)
	Unknown Image_1264; //  0x6a0 Size(8)
	Unknown Image_1266; //  0x6a8 Size(8)
	Unknown Image_1269; //  0x6b0 Size(8)
	Unknown Image_1270; //  0x6b8 Size(8)
	Unknown Image_1271; //  0x6c0 Size(8)
	Unknown Image_1272; //  0x6c8 Size(8)
	Unknown Image_1273; //  0x6d0 Size(8)
	Unknown Image_1277; //  0x6d8 Size(8)
	Unknown Image_1278; //  0x6e0 Size(8)
	Unknown Image_1279; //  0x6e8 Size(8)
	Unknown Image_1280; //  0x6f0 Size(8)
	Unknown Image_1284; //  0x6f8 Size(8)
	Unknown Image_1285; //  0x700 Size(8)
	Unknown Image_1318; //  0x708 Size(8)
	Unknown Image_1319; //  0x710 Size(8)
	Unknown Image_1320; //  0x718 Size(8)
	Unknown Image_1321; //  0x720 Size(8)
	Unknown Image_1322; //  0x728 Size(8)
	Unknown Image_1323; //  0x730 Size(8)
	Unknown Image_1324; //  0x738 Size(8)
	Unknown Image_1329; //  0x740 Size(8)
	Unknown Image_1330; //  0x748 Size(8)
	Unknown Image_1335; //  0x750 Size(8)
	Unknown Image_1336; //  0x758 Size(8)
	Unknown Image_1341; //  0x760 Size(8)
	Unknown Image_1342; //  0x768 Size(8)
	Unknown Image_1343; //  0x770 Size(8)
	Unknown Image_1344; //  0x778 Size(8)
	Unknown Image_1345; //  0x780 Size(8)
	Unknown Image_1346; //  0x788 Size(8)
	Unknown Image_1347; //  0x790 Size(8)
	Unknown Image_1348; //  0x798 Size(8)
	Unknown Image_1349; //  0x7a0 Size(8)
	Unknown Image_1350; //  0x7a8 Size(8)
	Unknown Image_1351; //  0x7b0 Size(8)
	Unknown Image_1352; //  0x7b8 Size(8)
	Unknown Image_1353; //  0x7c0 Size(8)
	Unknown Image_1354; //  0x7c8 Size(8)
	Unknown Image_1355; //  0x7d0 Size(8)
	Unknown Image_1356; //  0x7d8 Size(8)
	Unknown Image_1358; //  0x7e0 Size(8)
	Unknown Image_1359; //  0x7e8 Size(8)
	Unknown Image_1361; //  0x7f0 Size(8)
	Unknown Image_1362; //  0x7f8 Size(8)
	Unknown Image_1363; //  0x800 Size(8)
	Unknown Image_1364; //  0x808 Size(8)
	Unknown Image_1366; //  0x810 Size(8)
	Unknown Image_1368; //  0x818 Size(8)
	Unknown Image_1369; //  0x820 Size(8)
	Unknown Image_1370; //  0x828 Size(8)
	Unknown Image_1372; //  0x830 Size(8)
	Unknown Image_1374; //  0x838 Size(8)
	Unknown Image_1375; //  0x840 Size(8)
	Unknown Image_1376; //  0x848 Size(8)
	Unknown Image_1378; //  0x850 Size(8)
	Unknown Image_1380; //  0x858 Size(8)
	Unknown Image_1381; //  0x860 Size(8)
	Unknown Image_1382; //  0x868 Size(8)
	Unknown Image_1384; //  0x870 Size(8)
	Unknown Image_1972; //  0x878 Size(8)
	Unknown ImageTX_Complete_Fail; //  0x880 Size(8)
	Unknown ItemList; //  0x888 Size(8)
	Unknown Overlay_FB_ItemList; //  0x890 Size(8)
	Unknown Strengthen_Cost; //  0x898 Size(8)
	Unknown Strengthen_Count; //  0x8a0 Size(8)
	Unknown Strengthen_CurrentDamageText1; //  0x8a8 Size(8)
	Unknown Strengthen_CurrentDamageText2; //  0x8b0 Size(8)
	Unknown Strengthen_CurrentMagSizeText1; //  0x8b8 Size(8)
	Unknown Strengthen_CurrentMagSizeText2; //  0x8c0 Size(8)
	Unknown Strengthen_CurrentSpreadText1; //  0x8c8 Size(8)
	Unknown Strengthen_CurrentSpreadText2; //  0x8d0 Size(8)
	Unknown Strengthen_Icon; //  0x8d8 Size(8)
	Unknown Strengthen_IconType1; //  0x8e0 Size(8)
	Unknown Strengthen_IconType2; //  0x8e8 Size(8)
	Unknown Strengthen_IconType3; //  0x8f0 Size(8)
	Unknown Strengthen_Level1; //  0x8f8 Size(8)
	Unknown Strengthen_Level2; //  0x900 Size(8)
	Unknown Strengthen_Name; //  0x908 Size(8)
	Unknown Strengthen_TextType1; //  0x910 Size(8)
	Unknown Strengthen_TextType2; //  0x918 Size(8)
	Unknown Strengthen_TextType3; //  0x920 Size(8)
	Unknown Success_Damage1; //  0x928 Size(8)
	Unknown Success_Damage2; //  0x930 Size(8)
	Unknown Success_ItemName; //  0x938 Size(8)
	Unknown Success_ItemName_2; //  0x940 Size(8)
	Unknown Success_Level1; //  0x948 Size(8)
	Unknown Success_Level2; //  0x950 Size(8)
	Unknown Success_MagSize1; //  0x958 Size(8)
	Unknown Success_MagSize2; //  0x960 Size(8)
	Unknown Success_Spread1; //  0x968 Size(8)
	Unknown Success_Spread2; //  0x970 Size(8)
	Unknown Success_UpLevel; //  0x978 Size(8)
	Unknown T_Durability; //  0x980 Size(8)
	Unknown T_Fatigue; //  0x988 Size(8)
	Unknown T_PreFatigue; //  0x990 Size(8)
	Unknown TerrainHeight; //  0x998 Size(8)
	Unknown TextBlock_2089; //  0x9a0 Size(8)
	Unknown TextBlock_FB_ItemCount; //  0x9a8 Size(8)
	Unknown TextBlock_FB_ItemName; //  0x9b0 Size(8)
	Unknown TextBlock_FB_Title; //  0x9b8 Size(8)
	Unknown WidgetSwitcher_1; //  0x9c0 Size(8)
	Unknown ResultInfo; //  0x9c8 Size(38)
	float CurrentDurability; //  0xa00 Size(4)

	void SequenceEvent__ENTRYPOINTU_16(); // Function U.U.SequenceEvent__ENTRYPOINTU_16(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Image_20; //  0x250 Size(8)
	Unknown TargetAccel; //  0x258 Size(c)
	Unknown CurrentAccel; //  0x264 Size(c)
	float TargetScale; //  0x270 Size(4)
	Unknown DataAsset; //  0x278 Size(8)
	char ResetOriginTransform; //  0x280 Size(1)
	char MouseInputLock; //  0x281 Size(1)
	char IsUpdatingRotation; //  0x282 Size(1)
	char IsValidMeshActor; //  0x283 Size(1)
	char IsPressedLeftMouse; //  0x284 Size(1)

	void CheckValidMeshActor(char& Return); // Function U.U.CheckValidMeshActor(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x3d8 Size(8)
	Unknown BT; //  0x3e0 Size(8)
	Unknown BT; //  0x3e8 Size(8)
	Unknown BT; //  0x3f0 Size(8)
	Unknown BT; //  0x3f8 Size(8)
	Unknown BT; //  0x400 Size(8)
	Unknown BT; //  0x408 Size(8)
	Unknown BT; //  0x410 Size(8)
	Unknown BT; //  0x418 Size(8)
	Unknown BT; //  0x420 Size(8)
	Unknown BT; //  0x428 Size(8)
	Unknown C; //  0x430 Size(8)
	Unknown IM; //  0x438 Size(8)
	Unknown IM; //  0x440 Size(8)
	Unknown IM; //  0x448 Size(8)
	Unknown IM; //  0x450 Size(8)
	Unknown IM; //  0x458 Size(8)
	Unknown IM; //  0x460 Size(8)
	Unknown Menu02; //  0x468 Size(8)
	Unknown Menu03; //  0x470 Size(8)
	Unknown Menu04; //  0x478 Size(8)
	Unknown Menu05; //  0x480 Size(8)
	Unknown Menu06; //  0x488 Size(8)
	Unknown Menu07; //  0x490 Size(8)
	Unknown Menu08; //  0x498 Size(8)
	Unknown Menu09; //  0x4a0 Size(8)
	Unknown Menu10; //  0x4a8 Size(8)
	Unknown Menu11; //  0x4b0 Size(8)
	Unknown Overlay_Mask; //  0x4b8 Size(8)
	Unknown TX; //  0x4c0 Size(8)
	Unknown TX; //  0x4c8 Size(8)
	Unknown TX; //  0x4d0 Size(8)
	Unknown TX; //  0x4d8 Size(8)
	Unknown TX; //  0x4e0 Size(8)
	Unknown TX; //  0x4e8 Size(8)
	Unknown TX; //  0x4f0 Size(8)
	Unknown TX; //  0x4f8 Size(8)
	Unknown TX; //  0x500 Size(8)
	Unknown TX; //  0x508 Size(8)
	Unknown TX; //  0x510 Size(8)
	Unknown TX; //  0x518 Size(8)
	Unknown TX; //  0x520 Size(8)
	Unknown TX; //  0x528 Size(8)
	Unknown TX; //  0x530 Size(8)
	Unknown TX; //  0x538 Size(8)
	Unknown TX; //  0x540 Size(8)
	Unknown TX; //  0x548 Size(8)
	Unknown TX; //  0x550 Size(8)
	Unknown TX; //  0x558 Size(8)
	Unknown TX; //  0x560 Size(8)

	void SetIconTexture(Unknown IconTexture); // Function U.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Bg; //  0x250 Size(8)
	Unknown btn_Cancel; //  0x258 Size(8)
	Unknown btn_Ok; //  0x260 Size(8)
	Unknown Image_2; //  0x268 Size(8)

	void Hide(); // Function U.U.Hide(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown NewAnimation; //  0x248 Size(8)
	Unknown Icon; //  0x250 Size(8)
	Unknown ImageLine; //  0x258 Size(8)
	Unknown Img_Color; //  0x260 Size(8)

	void InitIcon(Unknown PlayerState); // Function U.U.InitIcon(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown Complete; //  0x248 Size(8)
	Unknown Image_161; //  0x250 Size(8)
	Unknown WidgetSwitcher_2; //  0x258 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown EndQuest; //  0x250 Size(8)
	Unknown StartQuest; //  0x258 Size(8)
	Unknown Idle; //  0x260 Size(8)
	Unknown Bg; //  0x268 Size(8)
	Unknown Image_308; //  0x270 Size(8)
	Unknown Image_697; //  0x278 Size(8)
	Unknown Image_839; //  0x280 Size(8)
	Unknown TextBlock_QuestDesc; //  0x288 Size(8)
	Unknown TextBlock_QuestTitle; //  0x290 Size(8)
	Unknown U; //  0x298 Size(8)
	Unknown U_2; //  0x2a0 Size(8)
	Unknown U_94; //  0x2a8 Size(8)
	Unknown VerticalBox_Tasks; //  0x2b0 Size(8)
	Unknown QuestInfo; //  0x2b8 Size(30)
	Unknown QuestData; //  0x2e8 Size(58)
	char ActiveQuest; //  0x340 Size(1)
	Unknown PendingQuestInfo; //  0x348 Size(10)

	void ConsumeQuestInfo(); // Function U.U.ConsumeQuestInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x3d8 Size(8)
	Unknown BT; //  0x3e0 Size(8)
	Unknown BT; //  0x3e8 Size(8)
	Unknown BT; //  0x3f0 Size(8)
	Unknown BT; //  0x3f8 Size(8)
	Unknown BT; //  0x400 Size(8)
	Unknown C; //  0x408 Size(8)
	Unknown IM; //  0x410 Size(8)
	Unknown IM; //  0x418 Size(8)
	Unknown IM; //  0x420 Size(8)
	Unknown IM; //  0x428 Size(8)
	Unknown IM; //  0x430 Size(8)
	Unknown IM; //  0x438 Size(8)
	Unknown Menu02; //  0x440 Size(8)
	Unknown Menu03; //  0x448 Size(8)
	Unknown Menu04; //  0x450 Size(8)
	Unknown Menu05; //  0x458 Size(8)
	Unknown Menu06; //  0x460 Size(8)
	Unknown Overlay_Mask; //  0x468 Size(8)
	Unknown TX; //  0x470 Size(8)
	Unknown TX; //  0x478 Size(8)
	Unknown TX; //  0x480 Size(8)
	Unknown TX; //  0x488 Size(8)
	Unknown TX; //  0x490 Size(8)
	Unknown TX; //  0x498 Size(8)
	Unknown TX; //  0x4a0 Size(8)
	Unknown TX; //  0x4a8 Size(8)
	Unknown TX; //  0x4b0 Size(8)
	Unknown TX; //  0x4b8 Size(8)
	Unknown TX; //  0x4c0 Size(8)

	Unknown On_IM_1(Unknown MyGeometry, Unknown& MouseEvent); // Function U.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown WrapBox_Main; //  0x250 Size(8)
	Unknown DefaultTextStyle; //  0x258 Size(268)
	struct FText TextString; //  0x4c0 Size(18)
	Unknown Game; //  0x4d8 Size(8)
	Unknown HorizontalAlignment; //  0x4e0 Size(1)
	float KeyImageScale; //  0x4e4 Size(4)

	void ParseString(struct FString InputString); // Function U.U.ParseString(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x3d8 Size(8)
	Unknown BT; //  0x3e0 Size(8)
	Unknown BT; //  0x3e8 Size(8)
	Unknown BT; //  0x3f0 Size(8)
	Unknown BT; //  0x3f8 Size(8)
	Unknown BT; //  0x400 Size(8)
	Unknown C; //  0x408 Size(8)
	Unknown IM; //  0x410 Size(8)
	Unknown IM; //  0x418 Size(8)
	Unknown IM; //  0x420 Size(8)
	Unknown IM; //  0x428 Size(8)
	Unknown IM; //  0x430 Size(8)
	Unknown IM; //  0x438 Size(8)
	Unknown Menu02; //  0x440 Size(8)
	Unknown Menu03; //  0x448 Size(8)
	Unknown Menu04; //  0x450 Size(8)
	Unknown Menu05; //  0x458 Size(8)
	Unknown Menu06; //  0x460 Size(8)
	Unknown Overlay_Mask; //  0x468 Size(8)
	Unknown TX; //  0x470 Size(8)
	Unknown TX; //  0x478 Size(8)
	Unknown TX; //  0x480 Size(8)
	Unknown TX; //  0x488 Size(8)
	Unknown TX; //  0x490 Size(8)
	Unknown TX; //  0x498 Size(8)
	Unknown TX; //  0x4a0 Size(8)
	Unknown TX; //  0x4a8 Size(8)
	Unknown TX; //  0x4b0 Size(8)
	Unknown TX; //  0x4b8 Size(8)
	Unknown TX; //  0x4c0 Size(8)

	Unknown On_IM_1(Unknown MyGeometry, Unknown& MouseEvent); // Function U.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x3d8 Size(8)
	Unknown BT; //  0x3e0 Size(8)
	Unknown C; //  0x3e8 Size(8)
	Unknown IM; //  0x3f0 Size(8)
	Unknown IM; //  0x3f8 Size(8)
	Unknown IM; //  0x400 Size(8)
	Unknown IM; //  0x408 Size(8)
	Unknown IM; //  0x410 Size(8)
	Unknown IM; //  0x418 Size(8)
	Unknown Menu02; //  0x420 Size(8)
	Unknown Overlay_Mask; //  0x428 Size(8)
	Unknown TX; //  0x430 Size(8)
	Unknown TX; //  0x438 Size(8)
	Unknown TX; //  0x440 Size(8)

	void SetIconTexture(Unknown IconTexture); // Function U.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x3d8 Size(8)
	Unknown BT; //  0x3e0 Size(8)
	Unknown BT; //  0x3e8 Size(8)
	Unknown C; //  0x3f0 Size(8)
	Unknown IM; //  0x3f8 Size(8)
	Unknown IM; //  0x400 Size(8)
	Unknown IM; //  0x408 Size(8)
	Unknown IM; //  0x410 Size(8)
	Unknown IM; //  0x418 Size(8)
	Unknown IM; //  0x420 Size(8)
	Unknown Menu02; //  0x428 Size(8)
	Unknown Menu03; //  0x430 Size(8)
	Unknown Overlay_Mask; //  0x438 Size(8)
	Unknown TX; //  0x440 Size(8)
	Unknown TX; //  0x448 Size(8)
	Unknown TX; //  0x450 Size(8)
	Unknown TX; //  0x458 Size(8)
	Unknown TX; //  0x460 Size(8)

	void SetIconTexture(Unknown IconTexture); // Function U.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x3d8 Size(8)
	Unknown BT; //  0x3e0 Size(8)
	Unknown BT; //  0x3e8 Size(8)
	Unknown BT; //  0x3f0 Size(8)
	Unknown C; //  0x3f8 Size(8)
	Unknown IM; //  0x400 Size(8)
	Unknown IM; //  0x408 Size(8)
	Unknown IM; //  0x410 Size(8)
	Unknown IM; //  0x418 Size(8)
	Unknown IM; //  0x420 Size(8)
	Unknown IM; //  0x428 Size(8)
	Unknown Menu02; //  0x430 Size(8)
	Unknown Menu03; //  0x438 Size(8)
	Unknown Menu04; //  0x440 Size(8)
	Unknown Overlay_Mask; //  0x448 Size(8)
	Unknown TX; //  0x450 Size(8)
	Unknown TX; //  0x458 Size(8)
	Unknown TX; //  0x460 Size(8)
	Unknown TX; //  0x468 Size(8)
	Unknown TX; //  0x470 Size(8)
	Unknown TX; //  0x478 Size(8)
	Unknown TX; //  0x480 Size(8)
	struct FText PerkSlot; //  0x488 Size(18)

	void SetIconTexture(Unknown IconTexture); // Function U.U.SetIconTexture(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x3d8 Size(8)
	Unknown BT; //  0x3e0 Size(8)
	Unknown BT; //  0x3e8 Size(8)
	Unknown BT; //  0x3f0 Size(8)
	Unknown BT; //  0x3f8 Size(8)
	Unknown BT; //  0x400 Size(8)
	Unknown C; //  0x408 Size(8)
	Unknown IM; //  0x410 Size(8)
	Unknown IM; //  0x418 Size(8)
	Unknown IM; //  0x420 Size(8)
	Unknown IM; //  0x428 Size(8)
	Unknown IM; //  0x430 Size(8)
	Unknown IM; //  0x438 Size(8)
	Unknown Menu02; //  0x440 Size(8)
	Unknown Menu03; //  0x448 Size(8)
	Unknown Menu04; //  0x450 Size(8)
	Unknown Menu05; //  0x458 Size(8)
	Unknown Menu06; //  0x460 Size(8)
	Unknown Overlay_Mask; //  0x468 Size(8)
	Unknown TX; //  0x470 Size(8)
	Unknown TX; //  0x478 Size(8)
	Unknown TX; //  0x480 Size(8)
	Unknown TX; //  0x488 Size(8)
	Unknown TX; //  0x490 Size(8)
	Unknown TX; //  0x498 Size(8)
	Unknown TX; //  0x4a0 Size(8)
	Unknown TX; //  0x4a8 Size(8)
	Unknown TX; //  0x4b0 Size(8)
	Unknown TX; //  0x4b8 Size(8)
	Unknown TX; //  0x4c0 Size(8)

	Unknown On_IM_1(Unknown MyGeometry, Unknown& MouseEvent); // Function U.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x3d8 Size(8)
	Unknown BT; //  0x3e0 Size(8)
	Unknown BT; //  0x3e8 Size(8)
	Unknown BT; //  0x3f0 Size(8)
	Unknown BT; //  0x3f8 Size(8)
	Unknown BT; //  0x400 Size(8)
	Unknown BT; //  0x408 Size(8)
	Unknown BT; //  0x410 Size(8)
	Unknown BT; //  0x418 Size(8)
	Unknown C; //  0x420 Size(8)
	Unknown IM; //  0x428 Size(8)
	Unknown IM; //  0x430 Size(8)
	Unknown IM; //  0x438 Size(8)
	Unknown IM; //  0x440 Size(8)
	Unknown IM; //  0x448 Size(8)
	Unknown IM; //  0x450 Size(8)
	Unknown Menu02; //  0x458 Size(8)
	Unknown Menu03; //  0x460 Size(8)
	Unknown Menu04; //  0x468 Size(8)
	Unknown Menu05; //  0x470 Size(8)
	Unknown Menu06; //  0x478 Size(8)
	Unknown Menu07; //  0x480 Size(8)
	Unknown Menu08; //  0x488 Size(8)
	Unknown Menu09; //  0x490 Size(8)
	Unknown Overlay_Mask; //  0x498 Size(8)
	Unknown TX; //  0x4a0 Size(8)
	Unknown TX; //  0x4a8 Size(8)
	Unknown TX; //  0x4b0 Size(8)
	Unknown TX; //  0x4b8 Size(8)
	Unknown TX; //  0x4c0 Size(8)
	Unknown TX; //  0x4c8 Size(8)
	Unknown TX; //  0x4d0 Size(8)
	Unknown TX; //  0x4d8 Size(8)
	Unknown TX; //  0x4e0 Size(8)
	Unknown TX; //  0x4e8 Size(8)
	Unknown TX; //  0x4f0 Size(8)
	Unknown TX; //  0x4f8 Size(8)
	Unknown TX; //  0x500 Size(8)
	Unknown TX; //  0x508 Size(8)
	Unknown TX; //  0x510 Size(8)
	Unknown TX; //  0x518 Size(8)
	Unknown TX; //  0x520 Size(8)

	Unknown On_IM_1(Unknown MyGeometry, Unknown& MouseEvent); // Function U.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x3d8 Size(8)
	Unknown BT; //  0x3e0 Size(8)
	Unknown BT; //  0x3e8 Size(8)
	Unknown BT; //  0x3f0 Size(8)
	Unknown BT; //  0x3f8 Size(8)
	Unknown C; //  0x400 Size(8)
	Unknown IM; //  0x408 Size(8)
	Unknown IM; //  0x410 Size(8)
	Unknown IM; //  0x418 Size(8)
	Unknown IM; //  0x420 Size(8)
	Unknown IM; //  0x428 Size(8)
	Unknown IM; //  0x430 Size(8)
	Unknown Menu02; //  0x438 Size(8)
	Unknown Menu03; //  0x440 Size(8)
	Unknown Menu04; //  0x448 Size(8)
	Unknown Menu05; //  0x450 Size(8)
	Unknown Overlay_Mask; //  0x458 Size(8)
	Unknown TX; //  0x460 Size(8)
	Unknown TX; //  0x468 Size(8)
	Unknown TX; //  0x470 Size(8)
	Unknown TX; //  0x478 Size(8)
	Unknown TX; //  0x480 Size(8)
	Unknown TX; //  0x488 Size(8)
	Unknown TX; //  0x490 Size(8)
	Unknown TX; //  0x498 Size(8)
	Unknown TX; //  0x4a0 Size(8)

	Unknown On_IM_1(Unknown MyGeometry, Unknown& MouseEvent); // Function U.U.On_IM_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Level_Up_New; //  0x250 Size(8)
	Unknown VSkill_Motion; //  0x258 Size(8)
	Unknown FinalitySkill_Motion; //  0x260 Size(8)
	Unknown LEVEL_UP; //  0x268 Size(8)
	Unknown CanvasPanel_294; //  0x270 Size(8)
	Unknown FSkill_Info; //  0x278 Size(8)
	Unknown FSkill_Title; //  0x280 Size(8)
	Unknown HorizontalBox_290; //  0x288 Size(8)
	Unknown Image_1; //  0x290 Size(8)
	Unknown Image_2; //  0x298 Size(8)
	Unknown Image_4; //  0x2a0 Size(8)
	Unknown Image_5; //  0x2a8 Size(8)
	Unknown Image_6; //  0x2b0 Size(8)
	Unknown Image_9; //  0x2b8 Size(8)
	Unknown Image_10; //  0x2c0 Size(8)
	Unknown Image_245; //  0x2c8 Size(8)
	Unknown Image_247; //  0x2d0 Size(8)
	Unknown Image_413; //  0x2d8 Size(8)
	Unknown Image_458; //  0x2e0 Size(8)
	Unknown Image_602; //  0x2e8 Size(8)
	Unknown Image_UltimateGetMat; //  0x2f0 Size(8)
	Unknown IMG_FinalitySkill; //  0x2f8 Size(8)
	Unknown Img_UltimateMaterial; //  0x300 Size(8)
	Unknown Light; //  0x308 Size(8)
	Unknown T_Desc; //  0x310 Size(8)
	Unknown T_Level; //  0x318 Size(8)
	Unknown T_PerkName; //  0x320 Size(8)
	Unknown TextBlock_LevelUpNewText; //  0x328 Size(8)
	Unknown U; //  0x330 Size(8)
	Unknown U; //  0x338 Size(8)
	Unknown VSkill_Info; //  0x340 Size(8)
	Unknown VSkill_Titile; //  0x348 Size(8)
	Unknown VSkillThumbStroke_02; //  0x350 Size(8)
	Unknown WidgetSwitcher_LevelUpInfo; //  0x358 Size(8)
	Unknown Handle_LevelUpEffect; //  0x360 Size(8)
	float EffectDelay; //  0x368 Size(4)
	Unknown PerkInfoQue; //  0x370 Size(10)
	Unknown CurrentPerkInfo; //  0x380 Size(2c)
	Unknown PerkLevelUpInfo; //  0x3b0 Size(10)
	Unknown PerkLevelUpData; //  0x3c0 Size(178)
	Unknown CurrentPerkData; //  0x538 Size(e0)
	int32_t CurrentLevel; //  0x618 Size(4)
	char IsAlreadyUnlockedUltimate; //  0x61c Size(1)
	Unknown CurrentLevelUpInfo; //  0x61d Size(1)
	Unknown CurrentLevelQue; //  0x620 Size(10)
	float CurrentUltimateMaterialValue; //  0x630 Size(4)
	char UltimateUpdate; //  0x634 Size(1)
	Unknown UltimateMaterialInstance; //  0x638 Size(8)
	float UltimateAnimTime; //  0x640 Size(4)
	Unknown UltimateGetMaterialInstance; //  0x648 Size(8)

	void SequenceEvent__ENTRYPOINTU_4(Unknown Image_365); // Function U.U.SequenceEvent__ENTRYPOINTU_4(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelScenarioWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Ani_TutorialComplete_FadeOut; //  0x250 Size(8)
	Unknown Ani_TutorialComplete; //  0x258 Size(8)
	Unknown Idle; //  0x260 Size(8)
	Unknown CanvasPanel_1; //  0x268 Size(8)
	Unknown U; //  0x270 Size(8)

	Unknown GetVisibility_1(); // Function U.U.GetVisibility_1(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelConversationWidget {
	Unknown UberGraphFrame; //  0x258 Size(8)
	Unknown First; //  0x260 Size(8)
	Unknown Hide; //  0x268 Size(8)
	Unknown Show; //  0x270 Size(8)
	Unknown Idle; //  0x278 Size(8)
	Unknown Bg; //  0x280 Size(8)
	Unknown Bg_2; //  0x288 Size(8)
	Unknown Bg_3; //  0x290 Size(8)
	Unknown Button_407; //  0x298 Size(8)
	Unknown Image; //  0x2a0 Size(8)
	Unknown Image_2; //  0x2a8 Size(8)
	Unknown Image_55; //  0x2b0 Size(8)
	Unknown Image_340; //  0x2b8 Size(8)
	Unknown Overlay_Base; //  0x2c0 Size(8)
	Unknown TextBlock_Message; //  0x2c8 Size(8)
	Unknown TextBlock_SpeakerName; //  0x2d0 Size(8)
	Unknown U; //  0x2d8 Size(8)
	Unknown WidgetSwitcher_Face; //  0x2e0 Size(8)
	Unknown SentenceData; //  0x2e8 Size(b0)

	void Finished_F3AEE8B3477DC5B8B5A3EA8301B8E940(); // Function U.U.Finished_F3AEE8B3477DC5B8B5A3EA8301B8E940(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelPerkDeckWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Msg_open; //  0x250 Size(8)
	Unknown POPUP_OPEN; //  0x258 Size(8)
	Unknown Idle; //  0x260 Size(8)
	Unknown btn_Choose; //  0x268 Size(8)
	Unknown btn_Ok; //  0x270 Size(8)
	Unknown btn_Ok_6; //  0x278 Size(8)
	Unknown btn_PerkDeck; //  0x280 Size(8)
	Unknown Button_CloseMovie; //  0x288 Size(8)
	Unknown Button_PlayMovie; //  0x290 Size(8)
	Unknown Button_Refresh; //  0x298 Size(8)
	Unknown Button_Reselect; //  0x2a0 Size(8)
	Unknown Button_SelectMode; //  0x2a8 Size(8)
	Unknown Canvas_CantSelectMessage; //  0x2b0 Size(8)
	Unknown Canvas_MovieScreen; //  0x2b8 Size(8)
	Unknown CanvasPanel_ClassList; //  0x2c0 Size(8)
	Unknown CanvasPanel_NewbieAdvantage; //  0x2c8 Size(8)
	Unknown CheckBox_PerkDeckNotReOpen; //  0x2d0 Size(8)
	Unknown GoldLack; //  0x2d8 Size(8)
	Unknown HorizontalBox_ClassList; //  0x2e0 Size(8)
	Unknown HorizontalBox_PerkDeckReOpen; //  0x2e8 Size(8)
	Unknown Image_1; //  0x2f0 Size(8)
	Unknown Image_2; //  0x2f8 Size(8)
	Unknown Image_5; //  0x300 Size(8)
	Unknown Image_10; //  0x308 Size(8)
	Unknown Image_11; //  0x310 Size(8)
	Unknown Image_13; //  0x318 Size(8)
	Unknown Image_134; //  0x320 Size(8)
	Unknown Image_213; //  0x328 Size(8)
	Unknown Image_247; //  0x330 Size(8)
	Unknown Image_271; //  0x338 Size(8)
	Unknown Image_276; //  0x340 Size(8)
	Unknown Image_335; //  0x348 Size(8)
	Unknown Image_342; //  0x350 Size(8)
	Unknown Image_484; //  0x358 Size(8)
	Unknown Image_566; //  0x360 Size(8)
	Unknown Image_1200; //  0x368 Size(8)
	Unknown Image_1511; //  0x370 Size(8)
	Unknown Image_Class; //  0x378 Size(8)
	Unknown Image_ClassIcon; //  0x380 Size(8)
	Unknown Image_Cycle; //  0x388 Size(8)
	Unknown Image_Cycle_2; //  0x390 Size(8)
	Unknown Image_Cycle_4; //  0x398 Size(8)
	Unknown Image_Weapon; //  0x3a0 Size(8)
	Unknown Img_Movie; //  0x3a8 Size(8)
	Unknown ReseletTextGroup1; //  0x3b0 Size(8)
	Unknown ReseletTextGroup1_2; //  0x3b8 Size(8)
	Unknown ReseletTextGroup2; //  0x3c0 Size(8)
	Unknown ReseletTextGroup2_2; //  0x3c8 Size(8)
	Unknown ReseletTextGroup2_4; //  0x3d0 Size(8)
	Unknown ScaleBox_ClassList; //  0x3d8 Size(8)
	Unknown ScaleBox_SelectNotifyMessage; //  0x3e0 Size(8)
	Unknown SizeBox_Choose; //  0x3e8 Size(8)
	Unknown SizeBox_Ok; //  0x3f0 Size(8)
	Unknown SizeBox_Ok2; //  0x3f8 Size(8)
	Unknown SizeBox_Random; //  0x400 Size(8)
	Unknown SizeBox_Refrest; //  0x408 Size(8)
	Unknown SizeBox_Select; //  0x410 Size(8)
	Unknown T_AmmoName; //  0x418 Size(8)
	Unknown T_ClassDeckName; //  0x420 Size(8)
	Unknown T_ClassDesc; //  0x428 Size(8)
	Unknown T_CurrentGold; //  0x430 Size(8)
	Unknown T_WeaponDesc; //  0x438 Size(8)
	Unknown T_WeaponName; //  0x440 Size(8)
	Unknown TextBlock_Close; //  0x448 Size(8)
	Unknown TextBlock_Close_2; //  0x450 Size(8)
	Unknown TextBlock_Close_7; //  0x458 Size(8)
	Unknown TextBlock_MaxReset; //  0x460 Size(8)
	Unknown TextBlock_MaxReset_2; //  0x468 Size(8)
	Unknown TextBlock_Price_ChangeDeckList; //  0x470 Size(8)
	Unknown TextBlock_Price_Random; //  0x478 Size(8)
	Unknown TextBlock_Price_Select; //  0x480 Size(8)
	Unknown TextBlock_RandomRemainCount; //  0x488 Size(8)
	Unknown TextBlock_RefreshRemainCount; //  0x490 Size(8)
	Unknown TextBlock_Reselect; //  0x498 Size(8)
	Unknown TextBlock_Reselect_2; //  0x4a0 Size(8)
	Unknown TextBlock_Reselect_4; //  0x4a8 Size(8)
	Unknown U; //  0x4b0 Size(8)
	Unknown U; //  0x4b8 Size(8)
	Unknown WidgetSwitcher_ChangeDeck; //  0x4c0 Size(8)
	Unknown WidgetSwitcher_ChangeDeck_2; //  0x4c8 Size(8)
	Unknown WidgetSwitcher_Reselect; //  0x4d0 Size(8)
	Unknown WidgetSwitcher_Reselect_2; //  0x4d8 Size(8)
	Unknown WidgetSwitcher_Reselect_4; //  0x4e0 Size(8)
	Unknown InventoryWidget; //  0x4e8 Size(8)
	Unknown Slots; //  0x4f0 Size(10)
	Unknown IconBrush; //  0x500 Size(88)
	Unknown HoverWidget; //  0x588 Size(8)
	Unknown HoverTimerHandle; //  0x590 Size(8)
	int64_t LocalTemp; //  0x598 Size(8)
	Unknown MediaPlayer; //  0x5a0 Size(8)
	Unknown ClassVideo_Map; //  0x5a8 Size(50)
	char bBlockButton; //  0x5f8 Size(1)
	char bButtonEnabled; //  0x5f9 Size(1)
	char bCanRemainCount; //  0x5fa Size(1)
	char bCanCurrentGold; //  0x5fb Size(1)
	char bWaitingResponse; //  0x5fc Size(1)
	int64_t CurrentGold; //  0x600 Size(8)
	int32_t ChangeDeckCount; //  0x608 Size(4)
	int32_t ChangeDeckListCount; //  0x60c Size(4)
	int32_t PerkDeckID; //  0x610 Size(4)
	int32_t DisableTime; //  0x614 Size(4)
	Unknown ClassInfoWidgetMap; //  0x618 Size(50)
	Unknown CurrentPerkDeckSelectInfo; //  0x668 Size(18)
	int32_t LocalPerkMode; //  0x680 Size(4)
	float ClassListPadding; //  0x684 Size(4)
	Unknown Handle_PlayMovie; //  0x688 Size(8)
	Unknown CurrentClassVideo; //  0x690 Size(8)
	Unknown Handle_SetPerkInfoByHoverClassButton; //  0x698 Size(8)
	char LastClassButtonHovered; //  0x6a0 Size(1)
	int32_t LastClassIndex; //  0x6a4 Size(4)

	void SequenceEvent__ENTRYPOINTU_3(); // Function U.U.SequenceEvent__ENTRYPOINTU_3(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelVehicleWidget {
	Unknown UberGraphFrame; //  0x2a8 Size(8)
	Unknown FuelGauge; //  0x2b0 Size(8)
	Unknown FuelIcon; //  0x2b8 Size(8)
	Unknown HPFaint; //  0x2c0 Size(8)
	Unknown HPGauge; //  0x2c8 Size(8)
	Unknown HPIcon; //  0x2d0 Size(8)
	Unknown SpeedText; //  0x2d8 Size(8)
	Unknown SubInfoParent; //  0x2e0 Size(8)
	Unknown U; //  0x2e8 Size(8)
	Unknown CachedVehicle; //  0x2f0 Size(8)
	Unknown MySeatColor; //  0x2f8 Size(10)
	Unknown EmptyFuelColor; //  0x308 Size(10)
	float InterpTargetHpRate; //  0x318 Size(4)
	float InterpCurrentHpRate; //  0x31c Size(4)
	float InterpSpeed; //  0x320 Size(4)
	Unknown HPFaintCurve; //  0x328 Size(8)
	Unknown HPColorCurve; //  0x330 Size(8)
	Unknown SubInfoWidget; //  0x338 Size(8)
	char Enab; //  0x340 Size(1)
	Unknown NewVar_1; //  0x348 Size(8)

	void OnWheelWrecked(int32_t WheelIndex); // Function U.U.OnWheelWrecked(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Hide; //  0x250 Size(8)
	Unknown Show; //  0x258 Size(8)
	Unknown Bg; //  0x260 Size(8)
	Unknown Button_OK; //  0x268 Size(8)
	Unknown Image_168; //  0x270 Size(8)
	Unknown Image_669; //  0x278 Size(8)
	Unknown Message; //  0x280 Size(8)
	Unknown TextBlock_Title; //  0x288 Size(8)
	Unknown U; //  0x290 Size(8)
	Unknown Timer; //  0x298 Size(8)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Anim_ToggleItemList; //  0x250 Size(8)
	Unknown Anim_TogglePlayerList; //  0x258 Size(8)
	Unknown Anim_ToggleTimeline; //  0x260 Size(8)
	Unknown U; //  0x268 Size(8)
	Unknown U; //  0x270 Size(8)
	Unknown U; //  0x278 Size(8)
	Unknown U; //  0x280 Size(8)
	Unknown U; //  0x288 Size(8)
	Unknown U; //  0x290 Size(8)
	Unknown U; //  0x298 Size(8)
	Unknown ReplayController; //  0x2a0 Size(8)
	Unknown UserNameTooltips; //  0x2a8 Size(10)
	Unknown MainWidget; //  0x2b8 Size(8)
	int32_t UserNameTooltipsNum; //  0x2c0 Size(4)

	void SetTargetPawnInfo(); // Function U.U.SetTargetPawnInfo(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown RichTextBlock_52; //  0x250 Size(8)
	struct FText SetText; //  0x258 Size(18)

	void Construct(); // Function U.U.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelWorldMapWidget {
	Unknown UberGraphFrame; //  0x2b8 Size(8)
	Unknown FadeIn; //  0x2c0 Size(8)
	Unknown NewAnimation_2; //  0x2c8 Size(8)
	Unknown Bg; //  0x2d0 Size(8)
	Unknown B; //  0x2d8 Size(8)
	Unknown B; //  0x2e0 Size(8)
	Unknown CloseButton; //  0x2e8 Size(8)
	Unknown ShowHelBoxButton; //  0x2f0 Size(8)
	Unknown U; //  0x2f8 Size(8)
	Unknown WidgetSwitcher_1; //  0x300 Size(8)
	int32_t MAX_ZOOM_LEVEL; //  0x308 Size(4)
	int32_t ZoomLevel; //  0x30c Size(4)
	float MAX_SCALE_FACTOR; //  0x310 Size(4)
	int32_t InitializeCount; //  0x314 Size(4)
	Unknown PosOnViewport; //  0x318 Size(8)
	float CurrentScaleFactor; //  0x320 Size(4)
	Unknown MouseButtonDownPos; //  0x324 Size(8)
	Unknown SelectPingMenuTimer; //  0x330 Size(8)
	Unknown SelectionMenu; //  0x338 Size(8)
	char IsRoutePing; //  0x340 Size(1)
	int32_t MaxRoutePointCount; //  0x344 Size(4)
	Unknown RoutePointArray; //  0x348 Size(10)

	void SetClassInfoBoardVisibilityByZoomLevel(int32_t LastZoomLevel, int32_t NewZoomLevel); // Function U.U.SetClassInfoBoardVisibilityByZoomLevel(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Escape_Cursor_Reset; //  0x250 Size(8)
	Unknown MiniNuke_Cursor_Reset; //  0x258 Size(8)
	Unknown Escape_Cursor; //  0x260 Size(8)
	Unknown MiniNuke_Cursor; //  0x268 Size(8)
	Unknown Image_390; //  0x270 Size(8)
	Unknown Image_519; //  0x278 Size(8)
	Unknown Img_CursorNuclear; //  0x280 Size(8)
	Unknown SizeBox_Nuclear; //  0x288 Size(8)
	Unknown WidgetSwitcher_1; //  0x290 Size(8)
	Unknown Anim_MouseClicked; //  0x298 Size(8)

	void PlayClickSound(); // Function U.U.PlayClickSound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelTopInfoWidget {
	Unknown UberGraphFrame; //  0x278 Size(8)
	Unknown Anim_HideWidget; //  0x280 Size(8)
	Unknown Canvas; //  0x288 Size(8)
	Unknown Canvas_Minimap; //  0x290 Size(8)
	Unknown CanvasPanel_StatupFirst; //  0x298 Size(8)
	Unknown CanvasPanel_StatupThird; //  0x2a0 Size(8)
	Unknown T_GameVersion; //  0x2a8 Size(8)
	Unknown U; //  0x2b0 Size(8)
	Unknown U; //  0x2b8 Size(8)
	Unknown U; //  0x2c0 Size(8)
	Unknown U; //  0x2c8 Size(8)
	Unknown U; //  0x2d0 Size(8)
	Unknown U; //  0x2d8 Size(8)
	Unknown U; //  0x2e0 Size(8)
	Unknown U; //  0x2e8 Size(8)
	Unknown U; //  0x2f0 Size(8)
	Unknown U; //  0x2f8 Size(8)
	Unknown Vertical_MinimapAndTeamInfo; //  0x300 Size(8)
	Unknown PlayerController; //  0x308 Size(8)
	Unknown U; //  0x310 Size(8)
	Unknown MainWidget; //  0x318 Size(8)
	Unknown CurrentState; //  0x320 Size(1)
	Unknown LastDisplayAbility; //  0x324 Size(c)

	void ShowStatupAnim(Unknown& StatupParams); // Function U.U.ShowStatupAnim(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Anim_MS; //  0x250 Size(8)
	Unknown Image_78; //  0x258 Size(8)
	Unknown PingImage; //  0x260 Size(8)

	void UpdatePing(); // Function U.U.UpdatePing(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Ani_Countdown; //  0x250 Size(8)
	Unknown TextBlock_RemailTime; //  0x258 Size(8)
	int32_t PreTime; //  0x260 Size(4)
	char ActiveTimer; //  0x264 Size(1)
	int32_t RemainTime; //  0x268 Size(4)

	struct FText Get_TextBlock_RemailTime_Text_1(); // Function U.U.Get_TextBlock_RemailTime_Text_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelInventoryPerkSlotWidget {
	Unknown UberGraphFrame; //  0x2a0 Size(8)
	Unknown LevelUp; //  0x2a8 Size(8)
	Unknown Blank_SkillBG; //  0x2b0 Size(8)
	Unknown Get_SkillBG; //  0x2b8 Size(8)
	Unknown IMG_CoolTime; //  0x2c0 Size(8)
	Unknown IMG_PerkIcon; //  0x2c8 Size(8)
	Unknown KeyImageWidget; //  0x2d0 Size(8)
	Unknown Lv1; //  0x2d8 Size(8)
	Unknown Lv2; //  0x2e0 Size(8)
	Unknown Lv3; //  0x2e8 Size(8)
	Unknown Over_CoolTime; //  0x2f0 Size(8)
	Unknown T_CoolTime; //  0x2f8 Size(8)
	Unknown T_PerkName; //  0x300 Size(8)
	Unknown WidgetSwitcher_Icon; //  0x308 Size(8)
	char bHover; //  0x310 Size(1)
	float CurrentExpPercent; //  0x314 Size(4)
	int32_t CurrentLevel; //  0x318 Size(4)
	int32_t LastLevel; //  0x31c Size(4)
	float TargetExpPercent; //  0x320 Size(4)
	float ExpSpeed; //  0x324 Size(4)
	Unknown PerkData; //  0x328 Size(e0)
	float CurrentLevelPercent; //  0x408 Size(4)
	int32_t MaxLevel; //  0x40c Size(4)
	Unknown HoverWidget; //  0x410 Size(8)
	Unknown LvArray; //  0x418 Size(10)

	void SetForVisual(); // Function U.U.SetForVisual(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown Image_81; //  0x248 Size(8)
	Unknown Image_86; //  0x250 Size(8)
	Unknown Image_88; //  0x258 Size(8)
	Unknown Image_89; //  0x260 Size(8)
	Unknown Image_90; //  0x268 Size(8)
	Unknown Image_91; //  0x270 Size(8)
	Unknown Image_92; //  0x278 Size(8)
	Unknown Image_93; //  0x280 Size(8)
	Unknown Image_94; //  0x288 Size(8)
	Unknown Image_95; //  0x290 Size(8)
	Unknown Image_96; //  0x298 Size(8)
	Unknown Image_97; //  0x2a0 Size(8)
	Unknown Image_98; //  0x2a8 Size(8)
	Unknown Image_99; //  0x2b0 Size(8)
	Unknown Image_100; //  0x2b8 Size(8)
	Unknown Image_101; //  0x2c0 Size(8)
	Unknown Image_102; //  0x2c8 Size(8)
	Unknown Image_103; //  0x2d0 Size(8)
	Unknown Image_104; //  0x2d8 Size(8)
	Unknown Image_107; //  0x2e0 Size(8)
	Unknown Image_108; //  0x2e8 Size(8)
	Unknown Image_119; //  0x2f0 Size(8)
	Unknown Image_120; //  0x2f8 Size(8)
	Unknown Image_121; //  0x300 Size(8)
	Unknown Image_122; //  0x308 Size(8)
	Unknown Image_123; //  0x310 Size(8)
	Unknown Image_134; //  0x318 Size(8)
	Unknown Image_137; //  0x320 Size(8)
	Unknown Image_138; //  0x328 Size(8)
	Unknown Image_139; //  0x330 Size(8)
	Unknown Image_140; //  0x338 Size(8)
	Unknown Image_141; //  0x340 Size(8)
	Unknown Image_142; //  0x348 Size(8)
	Unknown Image_143; //  0x350 Size(8)
	Unknown Image_144; //  0x358 Size(8)
	Unknown Image_145; //  0x360 Size(8)
	Unknown Image_146; //  0x368 Size(8)
	Unknown Image_147; //  0x370 Size(8)
	Unknown Image_148; //  0x378 Size(8)
	Unknown Image_149; //  0x380 Size(8)
	Unknown Image_152; //  0x388 Size(8)
	Unknown Image_153; //  0x390 Size(8)
	Unknown Image_154; //  0x398 Size(8)
	Unknown Image_155; //  0x3a0 Size(8)
	Unknown Image_156; //  0x3a8 Size(8)
	Unknown Image_157; //  0x3b0 Size(8)
	Unknown Image_158; //  0x3b8 Size(8)
	Unknown Image_159; //  0x3c0 Size(8)
	Unknown Image_160; //  0x3c8 Size(8)
	Unknown Image_161; //  0x3d0 Size(8)
	Unknown Image_162; //  0x3d8 Size(8)
	Unknown Image_163; //  0x3e0 Size(8)
	Unknown Image_164; //  0x3e8 Size(8)
	Unknown WidgetSwitcher_1; //  0x3f0 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelJetpackWidget {
	Unknown UberGraphFrame; //  0x268 Size(8)
	Unknown FuelGauge; //  0x270 Size(8)
	Unknown FuelIcon; //  0x278 Size(8)
	Unknown FuelText; //  0x280 Size(8)

	void SetNativeValues(); // Function U.U.SetNativeValues(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelBroadcastingWidget {
	Unknown UberGraphFrame; //  0x258 Size(8)
	Unknown Anim_9WarningMessage; //  0x260 Size(8)
	Unknown Anim_10SupplyMessage; //  0x268 Size(8)
	Unknown Anim_8LevelUpMessage; //  0x270 Size(8)
	Unknown Anim_4GameStartMessage; //  0x278 Size(8)
	Unknown Anim_27Revival; //  0x280 Size(8)
	Unknown Anim_TeamKillWarning; //  0x288 Size(8)
	Unknown 0BlueZoneDesc; //  0x290 Size(8)
	Unknown 10SupplyMessage; //  0x298 Size(8)
	Unknown 11BroadcastMessage; //  0x2a0 Size(8)
	Unknown 12TeamKillWarning; //  0x2a8 Size(8)
	Unknown 13ActionDescription; //  0x2b0 Size(8)
	Unknown 14Action; //  0x2b8 Size(8)
	Unknown 15CastingMessage; //  0x2c0 Size(8)
	Unknown 16CastingCount; //  0x2c8 Size(8)
	Unknown 17CastingCancelInfo; //  0x2d0 Size(8)
	Unknown 18ActionMessage; //  0x2d8 Size(8)
	Unknown 19CoreInfo; //  0x2e0 Size(8)
	Unknown 1BlueZoneName; //  0x2e8 Size(8)
	Unknown 20ZeroingDistance; //  0x2f0 Size(8)
	Unknown 21PlayerReportInfo; //  0x2f8 Size(8)
	Unknown 22SpectatorCount; //  0x300 Size(8)
	Unknown 23PlayerInfo; //  0x308 Size(8)
	Unknown 24RoundOverInfo; //  0x310 Size(8)
	Unknown 25RoundOver; //  0x318 Size(8)
	Unknown 26GuideWidget; //  0x320 Size(8)
	Unknown 27Revival; //  0x328 Size(8)
	Unknown 28RequestMessageInfo_2; //  0x330 Size(8)
	Unknown 29EndResuscitated; //  0x338 Size(8)
	Unknown 2GameCountDown; //  0x340 Size(8)
	Unknown 30ItemCancelMessage; //  0x348 Size(8)
	Unknown 3GameCountDownNum; //  0x350 Size(8)
	Unknown 4GameStartMessage; //  0x358 Size(8)
	Unknown 5ChangeClassInfo; //  0x360 Size(8)
	Unknown 6KillMessage; //  0x368 Size(8)
	Unknown 7KillCount; //  0x370 Size(8)
	Unknown 8LevelUpMessage; //  0x378 Size(8)
	Unknown 9WarningMessage; //  0x380 Size(8)
	Unknown HUDList; //  0x388 Size(8)
	Unknown Image; //  0x390 Size(8)
	Unknown Image_1; //  0x398 Size(8)
	Unknown Image_2; //  0x3a0 Size(8)
	Unknown Image_4; //  0x3a8 Size(8)
	Unknown Image_5; //  0x3b0 Size(8)
	Unknown Image_8; //  0x3b8 Size(8)
	Unknown Image_248; //  0x3c0 Size(8)
	Unknown RichT_ResustingOwnerName; //  0x3c8 Size(8)
	Unknown ShowMessage; //  0x3d0 Size(8)
	Unknown U; //  0x3d8 Size(8)
	Unknown U_2; //  0x3e0 Size(8)
	Unknown U_243; //  0x3e8 Size(8)
	Unknown U; //  0x3f0 Size(8)
	Unknown U; //  0x3f8 Size(8)
	Unknown U; //  0x400 Size(8)
	Unknown LastPriority; //  0x408 Size(50)
	Unknown ShowAnimList; //  0x458 Size(10)
	Unknown HideAnimList; //  0x468 Size(10)
	float ShowAnimTime; //  0x478 Size(4)
	float HideAnimTime; //  0x47c Size(4)
	Unknown TimerList; //  0x480 Size(50)
	int32_t TeamKillWarningAnimLoopNum; //  0x4d0 Size(4)
	struct FText CheatMessage; //  0x4d8 Size(18)

	void GetMyKillCountMessageWidget(Unknown& KillCountWidget); // Function U.U.GetMyKillCountMessageWidget(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown ADS_Pannel; //  0x250 Size(8)
	Unknown ADSZoom; //  0x258 Size(8)
	Unknown CanvasPanel_Main; //  0x260 Size(8)
	Unknown Descent; //  0x268 Size(8)
	Unknown Descent_Pannel; //  0x270 Size(8)
	Unknown Drive; //  0x278 Size(8)
	Unknown Drive_Pannel; //  0x280 Size(8)
	Unknown Key_ADSZeroingM; //  0x288 Size(8)
	Unknown Key_ADSZeroingP; //  0x290 Size(8)
	Unknown Key_ADSZoomIn; //  0x298 Size(8)
	Unknown Key_ADSZoomOut; //  0x2a0 Size(8)
	Unknown Ladder; //  0x2a8 Size(8)
	Unknown Ladder_Pannel; //  0x2b0 Size(8)
	Unknown Parachuting; //  0x2b8 Size(8)
	Unknown Parachuting_Pannel; //  0x2c0 Size(8)
	Unknown SmartPing; //  0x2c8 Size(8)
	Unknown SmartPing_Pannel; //  0x2d0 Size(8)
	Unknown Spectate; //  0x2d8 Size(8)
	Unknown Spectate_Pannel; //  0x2e0 Size(8)
	Unknown Swim; //  0x2e8 Size(8)
	Unknown Swim_Pannel; //  0x2f0 Size(8)
	Unknown T_ADSZeroingM; //  0x2f8 Size(8)
	Unknown T_ADSZeroingP; //  0x300 Size(8)
	Unknown T_ADSZoomIn; //  0x308 Size(8)
	Unknown T_ADSZoomOut; //  0x310 Size(8)
	Unknown UseItem; //  0x318 Size(8)
	Unknown UseItem_Pannel; //  0x320 Size(8)
	Unknown WidgetSwitcher_Guide; //  0x328 Size(8)
	Unknown WorldMap; //  0x330 Size(8)
	Unknown WorldMap_Always; //  0x338 Size(8)
	Unknown WorldMap_Pannel; //  0x340 Size(8)

	void UpdateWorldMapGuideOpacity(int32_t PreZoomLevel, int32_t NewZoomLevel); // Function U.U.UpdateWorldMapGuideOpacity(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelCompassWidget {
	Unknown UberGraphFrame; //  0x350 Size(8)
	Unknown CanvasPanel_3; //  0x358 Size(8)
	Unknown CanvasPanel_4; //  0x360 Size(8)
	Unknown grid; //  0x368 Size(8)
	Unknown Image; //  0x370 Size(8)
	Unknown Image_1; //  0x378 Size(8)
	Unknown Image_2; //  0x380 Size(8)
	Unknown Image_234; //  0x388 Size(8)
	Unknown Image_582; //  0x390 Size(8)
	Unknown InvalidationBox_1; //  0x398 Size(8)
	Unknown RetainerBox_108; //  0x3a0 Size(8)
	Unknown SupplyBoxMarker; //  0x3a8 Size(8)
	Unknown UnitParent; //  0x3b0 Size(8)
	Unknown U; //  0x3b8 Size(8)
	Unknown U_2; //  0x3c0 Size(8)
	Unknown U_3; //  0x3c8 Size(8)
	Unknown U_4; //  0x3d0 Size(8)
	Unknown U_5; //  0x3d8 Size(8)
	Unknown U_6; //  0x3e0 Size(8)
	Unknown U_7; //  0x3e8 Size(8)
	Unknown U_8; //  0x3f0 Size(8)
	Unknown U_9; //  0x3f8 Size(8)
	Unknown U_10; //  0x400 Size(8)
	Unknown U_11; //  0x408 Size(8)
	Unknown U_12; //  0x410 Size(8)
	Unknown U_13; //  0x418 Size(8)
	Unknown U_14; //  0x420 Size(8)
	Unknown U_1; //  0x428 Size(8)
	Unknown ViewAngle; //  0x430 Size(8)
	float ScaleForAngleToDistance; //  0x438 Size(4)
	float PositionCurveOffset; //  0x43c Size(4)
	Unknown PositionCurve; //  0x440 Size(8)
	float PositionCurveWeight; //  0x448 Size(4)
	float ScaleCurveWeight; //  0x44c Size(4)
	float ScaleCurveOffset; //  0x450 Size(4)
	int32_t NormalDirectionFontSize; //  0x454 Size(4)
	int32_t SpecialDirectionFontSize; //  0x458 Size(4)
	Unknown ArrayPlayerMarkerWidget; //  0x460 Size(10)
	Unknown NorthColor; //  0x470 Size(10)
	int32_t Angle0To360; //  0x480 Size(4)
	float TempMarkerPosition; //  0x484 Size(4)
	float ArrangedAngle; //  0x488 Size(4)

	Unknown CreateExpertWeaponItemMarker(); // Function U.U.CreateExpertWeaponItemMarker(Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelTeamPositionWidget {
	Unknown UberGraphFrame; //  0x290 Size(8)
	Unknown Anim_Bouncing; //  0x298 Size(8)
	Unknown CanvasRequestResuscitation; //  0x2a0 Size(8)
	Unknown CriticalGuage; //  0x2a8 Size(8)
	Unknown DyingGuage; //  0x2b0 Size(8)
	Unknown Img_StateDeath; //  0x2b8 Size(8)
	Unknown Img_StateDisconnect; //  0x2c0 Size(8)
	Unknown Img_StateParachute; //  0x2c8 Size(8)
	Unknown Img_StateRevival; //  0x2d0 Size(8)
	Unknown Img_StateVehicle; //  0x2d8 Size(8)
	Unknown Img_TeamColor; //  0x2e0 Size(8)
	Unknown KnockDownBar; //  0x2e8 Size(8)
	Unknown MoveParameter; //  0x2f0 Size(8)
	Unknown RevivingGuage; //  0x2f8 Size(8)
	Unknown Switcher_Guage; //  0x300 Size(8)
	Unknown Switcher_Icon; //  0x308 Size(8)
	Unknown TextBlock_Name; //  0x310 Size(8)
	Unknown TextBlock_PlayerIndex; //  0x318 Size(8)
	Unknown RevivingTimerHandle; //  0x320 Size(8)
	float TotalRevivingTime; //  0x328 Size(4)
	float CurrentRevivingTime; //  0x32c Size(4)
	char IsRequestResuscitation; //  0x330 Size(1)

	void Move(); // Function U.U.Move(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown FadeOut; //  0x250 Size(8)
	Unknown HitImage; //  0x258 Size(8)
	Unknown SizeBox_1; //  0x260 Size(8)
	Unknown InstigatorLocation; //  0x268 Size(c)
	Unknown InstigatorCharacter; //  0x278 Size(8)

	void Hide(); // Function U.U.Hide(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelAttackUserWidget {
	Unknown Enemy_Lv_Motion_FadeOut_Inert; //  0x2a0 Size(8)
	Unknown Enemy_Lv_Motion_FadeIn_Inert; //  0x2a8 Size(8)
	Unknown FadeOut; //  0x2b0 Size(8)
	Unknown Enemy_Inert; //  0x2b8 Size(8)
	Unknown HorizontalBox_1; //  0x2c0 Size(8)
	Unknown HorizontalBox_2; //  0x2c8 Size(8)
	Unknown Image_2; //  0x2d0 Size(8)
	Unknown Image_145; //  0x2d8 Size(8)
	Unknown Overlay_2; //  0x2e0 Size(8)
	Unknown Overlay_98; //  0x2e8 Size(8)
	Unknown Pawn; //  0x2f0 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelAttackDamageWidget {
	Unknown FadeOut; //  0x3a0 Size(8)
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelMainWidget {
	Unknown UberGraphFrame; //  0x450 Size(8)
	Unknown Anim_HideWidget; //  0x458 Size(8)
	Unknown HideLaserPoint; //  0x460 Size(8)
	Unknown ShowLaserPoint; //  0x468 Size(8)
	Unknown BackgroundBlur_154; //  0x470 Size(8)
	Unknown Canvas; //  0x478 Size(8)
	Unknown HB_PerkSpin; //  0x480 Size(8)
	Unknown RedCircle; //  0x488 Size(8)
	Unknown TextBlock_Start; //  0x490 Size(8)
	Unknown U; //  0x498 Size(8)
	Unknown U; //  0x4a0 Size(8)
	Unknown U; //  0x4a8 Size(8)
	Unknown U; //  0x4b0 Size(8)
	Unknown U; //  0x4b8 Size(8)
	Unknown U; //  0x4c0 Size(8)
	Unknown U; //  0x4c8 Size(8)
	Unknown TargetPawn; //  0x4d0 Size(8)
	Unknown LastDisplayAbility; //  0x4d8 Size(c)
	Unknown GainPerkPopups; //  0x4e8 Size(10)
	Unknown U; //  0x4f8 Size(8)
	Unknown U; //  0x500 Size(8)
	Unknown Timer_IsMouseWidgetInMap; //  0x508 Size(8)
	Unknown U; //  0x510 Size(8)
	char bIsShow; //  0x518 Size(1)
	float TmpViewportUpAngle; //  0x51c Size(4)
	float TmpViewportSideAngle; //  0x520 Size(4)
	Unknown CenterPosition; //  0x524 Size(8)
	Unknown U; //  0x530 Size(8)
	Unknown Timer_AutoPerkDeck; //  0x538 Size(8)
	int32_t LastPlayZoneID; //  0x540 Size(4)
	char bShowLevelUp; //  0x544 Size(1)
	char IsPlayingUltimateSound; //  0x545 Size(1)
	char bIsUnlockUltimateSkill; //  0x546 Size(1)

	void CheckUltimateSound(int32_t CurrentLevel); // Function U.U.CheckUltimateSound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Action; //  0x250 Size(8)
	Unknown Image_14; //  0x258 Size(8)
	Unknown LeftBtn; //  0x260 Size(8)
	Unknown MidBtn; //  0x268 Size(8)
	Unknown Mouse; //  0x270 Size(8)
	Unknown RightBtn; //  0x278 Size(8)
	Unknown ScaleBox_2; //  0x280 Size(8)
	Unknown SideDown; //  0x288 Size(8)
	Unknown SideUp; //  0x290 Size(8)
	Unknown Text_Action; //  0x298 Size(8)
	Unknown Text_Action_UsingAlphaBg; //  0x2a0 Size(8)
	Unknown Turn; //  0x2a8 Size(8)
	Unknown WheelDown; //  0x2b0 Size(8)
	Unknown WheelUp; //  0x2b8 Size(8)
	Unknown WidgetSwitcher_TextStyle; //  0x2c0 Size(8)
	Unknown X; //  0x2c8 Size(8)
	Unknown Y; //  0x2d0 Size(8)
	Unknown Temp; //  0x2d8 Size(8)
	char NewVar_1; //  0x2e0 Size(1)
	float DefalutScale; //  0x2e4 Size(4)

	void SetFontSize(int32_t Size); // Function U.U.SetFontSize(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown C; //  0x250 Size(8)
	Unknown Blink; //  0x258 Size(8)
	Unknown Dot; //  0x260 Size(8)
	Unknown MainCanvas; //  0x268 Size(8)
	Unknown BT; //  0x270 Size(8)
	Unknown C; //  0x278 Size(8)
	Unknown C; //  0x280 Size(8)
	Unknown C; //  0x288 Size(8)
	Unknown C; //  0x290 Size(8)
	Unknown C; //  0x298 Size(8)
	Unknown ED; //  0x2a0 Size(8)
	Unknown ED; //  0x2a8 Size(8)
	Unknown Image_1; //  0x2b0 Size(8)
	Unknown Image_2; //  0x2b8 Size(8)
	Unknown Image_3; //  0x2c0 Size(8)
	Unknown Image_5; //  0x2c8 Size(8)
	Unknown Image_10; //  0x2d0 Size(8)
	Unknown Image_204; //  0x2d8 Size(8)
	Unknown IM; //  0x2e0 Size(8)
	Unknown IM; //  0x2e8 Size(8)
	Unknown TX; //  0x2f0 Size(8)
	Unknown TX; //  0x2f8 Size(8)
	Unknown TX; //  0x300 Size(8)
	Unknown TXT_Connecting_Dot; //  0x308 Size(8)
	Unknown U; //  0x310 Size(8)
	Unknown TitleWidgetRef; //  0x318 Size(8)
	int32_t State; //  0x320 Size(4)
	char bPlayOnce; //  0x324 Size(1)
	char bPopupOpen; //  0x325 Size(1)
	Unknown ExitPopupKey; //  0x328 Size(18)

	void SetTitleWidget(Unknown TitleWidget); // Function U.U.SetTitleWidget(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Ani_FadeOut; //  0x250 Size(8)
	Unknown Ani_FadeIn; //  0x258 Size(8)
	Unknown 1; //  0x260 Size(8)
	Unknown 10; //  0x268 Size(8)
	Unknown 2; //  0x270 Size(8)
	Unknown 3; //  0x278 Size(8)
	Unknown 4; //  0x280 Size(8)
	Unknown 5; //  0x288 Size(8)
	Unknown 6; //  0x290 Size(8)
	Unknown 7; //  0x298 Size(8)
	Unknown 8; //  0x2a0 Size(8)
	Unknown 9; //  0x2a8 Size(8)
	Unknown Button_GamePlayTutorial; //  0x2b0 Size(8)
	Unknown Button_TutorialMovie; //  0x2b8 Size(8)
	Unknown Image_62; //  0x2c0 Size(8)
	Unknown Light1; //  0x2c8 Size(8)
	Unknown Light2; //  0x2d0 Size(8)
	Unknown red1; //  0x2d8 Size(8)
	Unknown red2; //  0x2e0 Size(8)
	Unknown RichTextBlock; //  0x2e8 Size(8)

	void MoveNextScene(); // Function U.U.MoveNextScene(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown FadeIn; //  0x250 Size(8)
	Unknown FadeOut; //  0x258 Size(8)
	Unknown Image_69; //  0x260 Size(8)

	void SequenceEvent__ENTRYPOINTU_2(); // Function U.U.SequenceEvent__ENTRYPOINTU_2(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelLoginWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown Blink; //  0x250 Size(8)
	Unknown FadeIn; //  0x258 Size(8)
	Unknown Button_480; //  0x260 Size(8)
	Unknown Button_482; //  0x268 Size(8)
	Unknown Button_483; //  0x270 Size(8)
	Unknown Button_484; //  0x278 Size(8)
	Unknown Button_485; //  0x280 Size(8)
	Unknown Button_486; //  0x288 Size(8)
	Unknown Button_ExitGame; //  0x290 Size(8)
	Unknown Button_Retry; //  0x298 Size(8)
	Unknown CanvasPanel_10; //  0x2a0 Size(8)
	Unknown CanvasPanel_143; //  0x2a8 Size(8)
	Unknown CanvasPanel_Default; //  0x2b0 Size(8)
	Unknown CanvasPanel_JuvenileRestricted; //  0x2b8 Size(8)
	Unknown CanvasPanel_RestrictedUser; //  0x2c0 Size(8)
	Unknown CanvasPanel_ServerInspectio; //  0x2c8 Size(8)
	Unknown CanvasPanel_UnableToConnectServer; //  0x2d0 Size(8)
	Unknown CanvasPanel_WaitingServer; //  0x2d8 Size(8)
	Unknown HorizontalBox_1; //  0x2e0 Size(8)
	Unknown HorizontalBox_2; //  0x2e8 Size(8)
	Unknown Image_122; //  0x2f0 Size(8)
	Unknown Image_123; //  0x2f8 Size(8)
	Unknown Image_309; //  0x300 Size(8)
	Unknown Image_bg; //  0x308 Size(8)
	Unknown SizeBox; //  0x310 Size(8)
	Unknown SizeBox_2; //  0x318 Size(8)
	Unknown SizeBox_85; //  0x320 Size(8)
	Unknown TextBlock; //  0x328 Size(8)
	Unknown TextBlock_2; //  0x330 Size(8)
	Unknown TextBlock_3; //  0x338 Size(8)
	Unknown TextBlock_4; //  0x340 Size(8)
	Unknown TextBlock_544; //  0x348 Size(8)
	Unknown TextBlock_546; //  0x350 Size(8)
	Unknown TextBlock_Desc; //  0x358 Size(8)
	Unknown TextBlock_EndTime; //  0x360 Size(8)
	Unknown Throbber_1; //  0x368 Size(8)
	Unknown Throbber_979; //  0x370 Size(8)
	Unknown TX; //  0x378 Size(8)
	Unknown WidgetSwitcher_1; //  0x380 Size(8)
	Unknown TitleWidgetRef; //  0x388 Size(8)
	struct FString ErrorID; //  0x390 Size(10)
	int32_t ErrorIndex; //  0x3a0 Size(4)
	struct FString ErrorParameters; //  0x3a8 Size(10)
	Unknown MediaPlayer; //  0x3b8 Size(8)
	Unknown Media; //  0x3c0 Size(8)
	Unknown MediaTexture; //  0x3c8 Size(8)
	Unknown MediaSoundComp; //  0x3d0 Size(8)
	int32_t ApplyUserInfoCount; //  0x3d8 Size(4)
	char bServicePlatformFlow; //  0x3dc Size(1)

	void DefaultMessage(); // Function U.U.DefaultMessage(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown FadeIn; //  0x250 Size(8)
	Unknown FadeOut; //  0x258 Size(8)
	Unknown Image; //  0x260 Size(8)
	Unknown Image_2; //  0x268 Size(8)
	Unknown Image_69; //  0x270 Size(8)

	void SequenceEvent__ENTRYPOINTU_2(); // Function U.U.SequenceEvent__ENTRYPOINTU_2(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelScopeWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown CanvasPanel_1; //  0x250 Size(8)
	Unknown Image_1; //  0x258 Size(8)
	Unknown NewVar_1; //  0x260 Size(8)

	void SetScopeImageAngle(float NewAngle); // Function U.U.SetScopeImageAngle(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UBravoHotelScopeWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown CanvasPanel_1; //  0x250 Size(8)
	Unknown Image_19; //  0x258 Size(8)
	Unknown Image_20; //  0x260 Size(8)
	Unknown Image_21; //  0x268 Size(8)
	Unknown Image_22; //  0x270 Size(8)
	Unknown Image_23; //  0x278 Size(8)
	Unknown Image_24; //  0x280 Size(8)
	Unknown WidgetSwitcher_167; //  0x288 Size(8)
	Unknown NewVar_1; //  0x290 Size(8)

	void SetScopeImageAngle(float NewAngle); // Function U.U.SetScopeImageAngle(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x268 Size(8)
	Unknown SeatIcons; //  0x270 Size(8)
	Unknown WheelIcons; //  0x278 Size(8)

	void Setup(Unknown VehicleInstance); // Function U.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x268 Size(8)
	Unknown SeatIcons; //  0x270 Size(8)
	Unknown WheelIcons; //  0x278 Size(8)

	void Setup(Unknown VehicleInstance); // Function U.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x268 Size(8)
	Unknown SeatIcons; //  0x270 Size(8)
	Unknown WheelIcons; //  0x278 Size(8)

	void Setup(Unknown VehicleInstance); // Function U.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x268 Size(8)
	Unknown SeatIcons; //  0x270 Size(8)
	Unknown WheelIcons; //  0x278 Size(8)

	void Setup(Unknown VehicleInstance); // Function U.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x268 Size(8)
	Unknown SeatIcons; //  0x270 Size(8)
	Unknown WheelIcons; //  0x278 Size(8)

	void Setup(Unknown VehicleInstance); // Function U.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x268 Size(8)
	Unknown SeatIcons; //  0x270 Size(8)
	Unknown WheelIcons; //  0x278 Size(8)

	void Setup(Unknown VehicleInstance); // Function U.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x268 Size(8)
	Unknown SeatIcons; //  0x270 Size(8)
	Unknown WheelIcons; //  0x278 Size(8)

	void Setup(Unknown VehicleInstance); // Function U.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x268 Size(8)
	Unknown SeatIcons; //  0x270 Size(8)
	Unknown WheelIcons; //  0x278 Size(8)

	void Setup(Unknown VehicleInstance); // Function U.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass U.U
struct UU : UU {
	Unknown UberGraphFrame; //  0x268 Size(8)
	Unknown SeatIcons; //  0x270 Size(8)
	Unknown WheelIcons; //  0x278 Size(8)

	void Setup(Unknown VehicleInstance); // Function U.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

