// Enum UFSM.FSM_Transition
enum class FSM_Transition : uint8_t {
	Aborted = 0,
	Succeeded = 1,
	FSM_MAX = 2,
};

// Enum UFSM.ESeverity
enum class ESeverity : uint8_t {
	Fatal = 0,
	Error = 1,
	Warning = 2,
	Info = 3,
	ESeverity_MAX = 4,
};

// Class UFSM.FSM_SetState_Async
class UFSM_SetState_Async : public UBlueprintAsyncActionBase {

public:

	struct UStateMachineComponent Target; // 0x30 (8)
	struct FName StateName; // 0x38 (8)
	float Timer; // 0x40 (4)
	char Repeat : 0; // 0x44 (1)
	struct FTimerHandle TimerHandle; // 0x48 (8)
	struct FMulticastInlineDelegate OnSuccess; // 0x50 (16)
	struct FMulticastInlineDelegate OnAborted; // 0x60 (16)

	struct UFSM_SetState_Async FSM_SetState_Async(struct UStateMachineComponent FSM, float WaitForSeconds, struct FName Name, char Loop); // Function UFSM.FSM_SetState_Async.FSM_SetState_Async(Final|Native|Static|Public|BlueprintCallable) // <Game_BE.exe+0x1203AA0>
	void Execute(); // Function UFSM.FSM_SetState_Async.Execute(Final|Native|Private) // <Game_BE.exe+0x1202CD0>
};

// Class UFSM.FSM_SetStateID_Async
class UFSM_SetStateID_Async : public UBlueprintAsyncActionBase {

public:

	struct UStateMachineComponent Target; // 0x30 (8)
	char StateID; // 0x38 (1)
	float Timer; // 0x3C (4)
	char Repeat : 0; // 0x40 (1)
	struct FTimerHandle TimerHandle; // 0x48 (8)
	struct FMulticastInlineDelegate OnSuccess; // 0x50 (16)
	struct FMulticastInlineDelegate OnAborted; // 0x60 (16)

	struct UFSM_SetStateID_Async FSM_SetStateID_Async(struct UStateMachineComponent FSM, float WaitForSeconds, char ID, char Loop); // Function UFSM.FSM_SetStateID_Async.FSM_SetStateID_Async(Final|Native|Static|Public|BlueprintCallable) // <Game_BE.exe+0x1203370>
	void Execute(); // Function UFSM.FSM_SetStateID_Async.Execute(Final|Native|Private) // <Game_BE.exe+0x1202C50>
};

// Class UFSM.FSM_SetState_ConditionalAsync
class UFSM_SetState_ConditionalAsync : public UBlueprintAsyncActionBase {

public:

	struct UStateMachineComponent Target; // 0x30 (8)
	enum class FSM_Transition Conditional; // 0x38 (1)
	struct FName StateName; // 0x3C (8)
	float Timer; // 0x44 (4)
	char Repeat : 0; // 0x48 (1)
	struct FTimerHandle TimerHandle; // 0x50 (8)
	struct FMulticastInlineDelegate OnSuccess; // 0x58 (16)
	struct FMulticastInlineDelegate OnAborted; // 0x68 (16)

	struct UFSM_SetState_ConditionalAsync FSM_SetState_ConditionalAsync(struct UStateMachineComponent FSM, float WaitForSeconds, struct FName Name, enum class FSM_Transition Condition, char Loop); // Function UFSM.FSM_SetState_ConditionalAsync.FSM_SetState_ConditionalAsync(Final|Native|Static|Public|BlueprintCallable) // <Game_BE.exe+0x1203DF0>
	void Execute(); // Function UFSM.FSM_SetState_ConditionalAsync.Execute(Final|Native|Private) // <Game_BE.exe+0x1202D10>
};

// Class UFSM.FSM_SetStateID_ConditionalAsync
class UFSM_SetStateID_ConditionalAsync : public UBlueprintAsyncActionBase {

public:

	struct UStateMachineComponent Target; // 0x30 (8)
	enum class FSM_Transition Conditional; // 0x38 (1)
	char StateID; // 0x39 (1)
	float Timer; // 0x3C (4)
	char Repeat : 0; // 0x40 (1)
	struct FTimerHandle TimerHandle; // 0x48 (8)
	struct FMulticastInlineDelegate OnSuccess; // 0x50 (16)
	struct FMulticastInlineDelegate OnAborted; // 0x60 (16)

	struct UFSM_SetStateID_ConditionalAsync FSM_SetStateID_ConditionalAsync(struct UStateMachineComponent FSM, float WaitForSeconds, char ID, enum class FSM_Transition Condition, char Loop); // Function UFSM.FSM_SetStateID_ConditionalAsync.FSM_SetStateID_ConditionalAsync(Final|Native|Static|Public|BlueprintCallable) // <Game_BE.exe+0x12036D0>
	void Execute(); // Function UFSM.FSM_SetStateID_ConditionalAsync.Execute(Final|Native|Private) // <Game_BE.exe+0x1202C90>
};

// Class UFSM.FSM_SetState_AsyncWithCallbacks
class UFSM_SetState_AsyncWithCallbacks : public UBlueprintAsyncActionBase {

public:

	struct UStateMachineComponent Target; // 0x30 (8)
	struct FDelegate InBegin; // 0x38 (16)
	struct FDelegate InExit; // 0x48 (16)
	struct FName StateName; // 0x58 (8)
	float Timer; // 0x60 (4)
	char Repeat : 0; // 0x64 (1)
	struct FTimerHandle TimerHandle; // 0x68 (8)
	struct FMulticastInlineDelegate OnSuccess; // 0x70 (16)
	struct FMulticastInlineDelegate OnAborted; // 0x80 (16)

	struct UFSM_SetState_AsyncWithCallbacks FSM_SetState_AsyncWithCallbacks(struct UStateMachineComponent FSM, float WaitForSeconds, struct FName Name, char Loop, struct FDelegate& ExitPreviousStateCallback, struct FDelegate& BeginNextStateCallback); // Function UFSM.FSM_SetState_AsyncWithCallbacks.FSM_SetState_AsyncWithCallbacks(Final|Native|Static|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x1203BE0>
	void Execute(); // Function UFSM.FSM_SetState_AsyncWithCallbacks.Execute(Final|Native|Private) // <Game_BE.exe+0x1202CF0>
};

// Class UFSM.FSM_SetStateID_AsyncWithCallbacks
class UFSM_SetStateID_AsyncWithCallbacks : public UBlueprintAsyncActionBase {

public:

	struct UStateMachineComponent Target; // 0x30 (8)
	struct FDelegate InBegin; // 0x38 (16)
	struct FDelegate InExit; // 0x48 (16)
	char StateID; // 0x58 (1)
	float Timer; // 0x5C (4)
	char Repeat : 0; // 0x60 (1)
	struct FTimerHandle TimerHandle; // 0x68 (8)
	struct FMulticastInlineDelegate OnSuccess; // 0x70 (16)
	struct FMulticastInlineDelegate OnAborted; // 0x80 (16)

	struct UFSM_SetStateID_AsyncWithCallbacks FSM_SetStateID_AsyncWithCallbacks(struct UStateMachineComponent FSM, float WaitForSeconds, char ID, char Loop, struct FDelegate& ExitPreviousStateCallback, struct FDelegate& BeginNextStateCallback); // Function UFSM.FSM_SetStateID_AsyncWithCallbacks.FSM_SetStateID_AsyncWithCallbacks(Final|Native|Static|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x12034B0>
	void Execute(); // Function UFSM.FSM_SetStateID_AsyncWithCallbacks.Execute(Final|Native|Private) // <Game_BE.exe+0x1202C70>
};

// Class UFSM.FSM_SetState_ConditionalAsyncWithCallbacks
class UFSM_SetState_ConditionalAsyncWithCallbacks : public UBlueprintAsyncActionBase {

public:

	struct UStateMachineComponent Target; // 0x30 (8)
	enum class FSM_Transition Conditional; // 0x38 (1)
	struct FDelegate InBegin; // 0x3C (16)
	struct FDelegate InExit; // 0x4C (16)
	struct FName StateName; // 0x5C (8)
	float Timer; // 0x64 (4)
	char Repeat : 0; // 0x68 (1)
	struct FTimerHandle TimerHandle; // 0x70 (8)
	struct FMulticastInlineDelegate OnSuccess; // 0x78 (16)
	struct FMulticastInlineDelegate OnAborted; // 0x88 (16)

	struct UFSM_SetState_ConditionalAsyncWithCallbacks FSM_SetState_ConditionalAsyncWithCallbacks(struct UStateMachineComponent FSM, float WaitForSeconds, struct FName Name, enum class FSM_Transition Condition, char Loop, struct FDelegate& ExitPreviousStateCallback, struct FDelegate& BeginNextStateCallback); // Function UFSM.FSM_SetState_ConditionalAsyncWithCallbacks.FSM_SetState_ConditionalAsyncWithCallbacks(Final|Native|Static|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x1203F70>
	void Execute(); // Function UFSM.FSM_SetState_ConditionalAsyncWithCallbacks.Execute(Final|Native|Private) // <Game_BE.exe+0x1202D30>
};

// Class UFSM.FSM_SetStateID_ConditionalAsyncWithCallbacks
class UFSM_SetStateID_ConditionalAsyncWithCallbacks : public UBlueprintAsyncActionBase {

public:

	struct UStateMachineComponent Target; // 0x30 (8)
	enum class FSM_Transition Conditional; // 0x38 (1)
	struct FDelegate InBegin; // 0x3C (16)
	struct FDelegate InExit; // 0x4C (16)
	char StateID; // 0x5C (1)
	float Timer; // 0x60 (4)
	char Repeat : 0; // 0x64 (1)
	struct FTimerHandle TimerHandle; // 0x68 (8)
	struct FMulticastInlineDelegate OnSuccess; // 0x70 (16)
	struct FMulticastInlineDelegate OnAborted; // 0x80 (16)

	struct UFSM_SetStateID_ConditionalAsyncWithCallbacks FSM_SetStateID_ConditionalAsyncWithCallbacks(struct UStateMachineComponent FSM, float WaitForSeconds, char ID, enum class FSM_Transition Condition, char Loop, struct FDelegate& ExitPreviousStateCallback, struct FDelegate& BeginNextStateCallback); // Function UFSM.FSM_SetStateID_ConditionalAsyncWithCallbacks.FSM_SetStateID_ConditionalAsyncWithCallbacks(Final|Native|Static|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x1203850>
	void Execute(); // Function UFSM.FSM_SetStateID_ConditionalAsyncWithCallbacks.Execute(Final|Native|Private) // <Game_BE.exe+0x1202CB0>
};

// Class UFSM.FSM_FinishState_Async
class UFSM_FinishState_Async : public UBlueprintAsyncActionBase {

public:

	struct UStateMachineComponent Target; // 0x30 (8)
	float Timer; // 0x38 (4)
	struct FTimerHandle TimerHandle; // 0x40 (8)
	struct FMulticastInlineDelegate OnSuccess; // 0x48 (16)
	struct FMulticastInlineDelegate OnAborted; // 0x58 (16)

	struct UFSM_FinishState_Async FSM_FinishState_Async(struct UStateMachineComponent FSM, float WaitForSeconds); // Function UFSM.FSM_FinishState_Async.FSM_FinishState_Async(Final|Native|Static|Public|BlueprintCallable) // <Game_BE.exe+0x1202D50>
	void Execute(); // Function UFSM.FSM_FinishState_Async.Execute(Final|Native|Private) // <Game_BE.exe+0x1202BD0>
};

// Class UFSM.FSM_FinishState_ConditionalAsync
class UFSM_FinishState_ConditionalAsync : public UBlueprintAsyncActionBase {

public:

	struct UStateMachineComponent Target; // 0x30 (8)
	enum class FSM_Transition Conditional; // 0x38 (1)
	struct FName FallbackState; // 0x3C (8)
	float Timer; // 0x44 (4)
	struct FTimerHandle TimerHandle; // 0x48 (8)
	struct FMulticastInlineDelegate OnSuccess; // 0x50 (16)
	struct FMulticastInlineDelegate OnAborted; // 0x60 (16)

	struct UFSM_FinishState_ConditionalAsync FSM_FinishState_ConditionalAsync(struct UStateMachineComponent FSM, enum class FSM_Transition Condition, float WaitForSeconds, struct FName Fallback); // Function UFSM.FSM_FinishState_ConditionalAsync.FSM_FinishState_ConditionalAsync(Final|Native|Static|Public|BlueprintCallable) // <Game_BE.exe+0x1202FB0>
	void Execute(); // Function UFSM.FSM_FinishState_ConditionalAsync.Execute(Final|Native|Private) // <Game_BE.exe+0x1202C10>
};

// Class UFSM.FSM_FinishState_AsyncWithCallbacks
class UFSM_FinishState_AsyncWithCallbacks : public UBlueprintAsyncActionBase {

public:

	struct UStateMachineComponent Target; // 0x30 (8)
	struct FDelegate InBegin; // 0x38 (16)
	struct FDelegate InExit; // 0x48 (16)
	float Timer; // 0x58 (4)
	struct FTimerHandle TimerHandle; // 0x60 (8)
	struct FMulticastInlineDelegate OnSuccess; // 0x68 (16)
	struct FMulticastInlineDelegate OnAborted; // 0x78 (16)

	struct UFSM_FinishState_AsyncWithCallbacks FSM_FinishState_AsyncWithCallbacks(struct UStateMachineComponent FSM, float WaitForSeconds, struct FDelegate& ExitPreviousStateCallback, struct FDelegate& BeginNextStateCallback); // Function UFSM.FSM_FinishState_AsyncWithCallbacks.FSM_FinishState_AsyncWithCallbacks(Final|Native|Static|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x1202E20>
	void Execute(); // Function UFSM.FSM_FinishState_AsyncWithCallbacks.Execute(Final|Native|Private) // <Game_BE.exe+0x1202BF0>
};

// Class UFSM.FSM_FinishState_ConditionalAsyncWithCallbacks
class UFSM_FinishState_ConditionalAsyncWithCallbacks : public UBlueprintAsyncActionBase {

public:

	struct UStateMachineComponent Target; // 0x30 (8)
	enum class FSM_Transition Conditional; // 0x38 (1)
	struct FDelegate InBegin; // 0x3C (16)
	struct FDelegate InExit; // 0x4C (16)
	struct FDelegate InFallback; // 0x5C (16)
	struct FName FallbackState; // 0x6C (8)
	float Timer; // 0x74 (4)
	struct FTimerHandle TimerHandle; // 0x78 (8)
	struct FMulticastInlineDelegate OnSuccess; // 0x80 (16)
	struct FMulticastInlineDelegate OnAborted; // 0x90 (16)

	struct UFSM_FinishState_ConditionalAsyncWithCallbacks FSM_FinishState_ConditionalAsyncWithCallbacks(struct UStateMachineComponent FSM, enum class FSM_Transition Condition, float WaitForSeconds, struct FName Fallback, struct FDelegate& ExitPreviousStateCallback, struct FDelegate& BeginNextStateCallback, struct FDelegate& BeginFallbackStateCallback); // Function UFSM.FSM_FinishState_ConditionalAsyncWithCallbacks.FSM_FinishState_ConditionalAsyncWithCallbacks(Final|Native|Static|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x12030F0>
	void Execute(); // Function UFSM.FSM_FinishState_ConditionalAsyncWithCallbacks.Execute(Final|Native|Private) // <Game_BE.exe+0x1202C30>
};

// Class UFSM.BTTask_FSM_AddState
class UBTTask_FSM_AddState : public UBTTask_BlackboardBase {

public:

	struct UStateMachineComponent FSM; // 0x98 (8)
	struct FName TargetFSM; // 0xA0 (8)
	struct FName NewStateName; // 0xA8 (8)
	char Debug : 0; // 0xB0 (1)
	char ForceSuccess : 0; // 0xB1 (1)
};

// Class UFSM.BTTask_FSM_SetState
class UBTTask_FSM_SetState : public UBTTask_BlackboardBase {

public:

	struct UStateMachineComponent FSM; // 0x98 (8)
	struct FName TargetFSM; // 0xA0 (8)
	struct FName StateName; // 0xA8 (8)
	char Debug : 0; // 0xB0 (1)
	char ForceSuccess : 0; // 0xB1 (1)
};

// Class UFSM.BTTask_FSM_RemoveState
class UBTTask_FSM_RemoveState : public UBTTask_BlackboardBase {

public:

	struct UStateMachineComponent FSM; // 0x98 (8)
	struct FName TargetFSM; // 0xA0 (8)
	struct FName StateName; // 0xA8 (8)
	char Debug : 0; // 0xB0 (1)
	char ForceSuccess : 0; // 0xB1 (1)
};

// Class UFSM.BTTask_FSM_CheckState
class UBTTask_FSM_CheckState : public UBTTask_BlackboardBase {

public:

	struct UStateMachineComponent FSM; // 0x98 (8)
	struct FName TargetFSM; // 0xA0 (8)
	struct FName StateName; // 0xA8 (8)
	char Debug : 0; // 0xB0 (1)
	char ForceSuccess : 0; // 0xB1 (1)
};

// Class UFSM.RSM
class URSM : public Object {

public:

	struct FGuid SGUID; // 0x28 (16)
	int32_t PlayerId; // 0x38 (4)
	struct TWeakObjectPtr<struct Object> Owner; // 0x3C (8)
};

// Class UFSM.ReactiveStateMachine
class UReactiveStateMachine : public URSM {

public:

	struct TArray<struct UStateAction> StateGraph; // 0x58 (16)
	float MachineTime; // 0x68 (4)
	struct FMulticastInlineDelegate _OnEntry; // 0x70 (16)
	struct FMulticastInlineDelegate _OnExit; // 0x80 (16)
	struct TMap<struct FGuid, struct FMachinePayloadData> MachineData; // 0x90 (80)

	void Update(float DeltaTime); // Function UFSM.ReactiveStateMachine.Update(Final|Native|Private) // <Game_BE.exe+0x1208830>
	void OnUpdate(float DeltaTime); // Function UFSM.ReactiveStateMachine.OnUpdate(Event|Protected|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void OnExit(); // Function UFSM.ReactiveStateMachine.OnExit(Event|Protected|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void OnEntry(); // Function UFSM.ReactiveStateMachine.OnEntry(Event|Protected|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void OnConstruct(); // Function UFSM.ReactiveStateMachine.OnConstruct(Event|Protected|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	char IsMachineActive(); // Function UFSM.ReactiveStateMachine.IsMachineActive(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x1208410>
	void Init(); // Function UFSM.ReactiveStateMachine.Init(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x12080C0>
	float GetStateMachineUpdateTime(); // Function UFSM.ReactiveStateMachine.GetStateMachineUpdateTime(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <Game_BE.exe+0x1208060>
	struct UReactiveStateMachine GetOwnerAsStateMachine(); // Function UFSM.ReactiveStateMachine.GetOwnerAsStateMachine(Final|Native|Private|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x1207EB0>
	struct AHUD GetOwnerAsHUD(); // Function UFSM.ReactiveStateMachine.GetOwnerAsHUD(Final|Native|Private|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x1208000>
	struct AGameModeBase GetOwnerAsGameMode(); // Function UFSM.ReactiveStateMachine.GetOwnerAsGameMode(Final|Native|Private|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x1207FD0>
	struct AAIController GetOwnerAsControllerAI(); // Function UFSM.ReactiveStateMachine.GetOwnerAsControllerAI(Final|Native|Private|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x1207FA0>
	struct APlayerController GetOwnerAsController(); // Function UFSM.ReactiveStateMachine.GetOwnerAsController(Final|Native|Private|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x1207F70>
	struct UActorComponent GetOwnerAsComponent(); // Function UFSM.ReactiveStateMachine.GetOwnerAsComponent(Final|Native|Private|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x1207F40>
	struct ACharacter GetOwnerAsCharacter(); // Function UFSM.ReactiveStateMachine.GetOwnerAsCharacter(Final|Native|Private|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x1207F10>
	struct UActor GetOwnerAsActor(); // Function UFSM.ReactiveStateMachine.GetOwnerAsActor(Final|Native|Private|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x1207EE0>
	struct Object GetOwner(); // Function UFSM.ReactiveStateMachine.GetOwner(Final|Native|Private|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x1207E80>
	void Exit(); // Function UFSM.ReactiveStateMachine.Exit(Final|Native|Private) // <Game_BE.exe+0x12063B0>
	void Entry(); // Function UFSM.ReactiveStateMachine.Entry(Final|Native|Private) // <Game_BE.exe+0x1206390>
	void End(); // Function UFSM.ReactiveStateMachine.End(Final|Native|Public|BlueprintCallable) // <Game_BE.exe+0x1206370>
};

// Class UFSM.FSMSettings
class UFSMSettings : public Object {

public:

	char EnableInterfaceStatePropagation : 0; // 0x28 (1)
	char SuppressRPCWarnings : 0; // 0x29 (1)
	float DefaultTickInterval; // 0x2C (4)
	struct TArray<struct FName> DefaultStates; // 0x30 (16)
};

// Class UFSM.RSMSubsystem
class URSMSubsystem : public ULocalPlayerSubsystem {

public:

	struct TArray<struct UReactiveStateMachine> MachineStack; // 0x30 (16)
};

// Class UFSM.StateMachineABP
class UStateMachineABP : public UAnimInstance {

public:

	struct UStateMachineComponent FSM; // 0x270 (8)
	char OverrideFSM : 0; // 0x278 (1)
	struct FName TargetFSM; // 0x27C (8)
	struct FName TargetASM; // 0x284 (8)

	struct UStateMachineComponent GetFSMComponentByName(struct FName Name); // Function UFSM.StateMachineABP.GetFSMComponentByName(Final|Native|Public|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x120CAA0>
	struct UStateMachineComponent GetFSMComponent(); // Function UFSM.StateMachineABP.GetFSMComponent(Final|Native|Public|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x120CA70>
};

// Class UFSM.StateMachineComponent
class UStateMachineComponent : public UActorComponent {

public:

	struct FSM_ExitEvent FSM_ExitArguments; // 0xB8 (12)
	struct FSM_BeginEvent FSM_BeginArguments; // 0xC4 (12)
	struct FSM_UpdateEvent FSM_UpdateArguments; // 0xD0 (8)
	char IsOverriden : 0; // 0xE0 (1)
	char IsFullyInitialized : 0; // 0xE1 (1)
	char StateID; // 0xE2 (1)
	char PreviousStateID; // 0xE3 (1)
	float StateTime; // 0xE4 (4)
	struct FSM_State STATE_Null; // 0xE8 (64)
	struct TMap<char, struct FSM_State> State; // 0x128 (80)
	struct FDelegate InBegin; // 0x178 (16)
	struct FDelegate InUpdate; // 0x188 (16)
	struct FDelegate InExit; // 0x198 (16)
	struct FName StartupState; // 0x1A8 (8)
	struct TArray<struct FName> States; // 0x1B0 (16)
	struct TMap<struct FName, struct FSM_Link> LINKS; // 0x1C0 (80)
	char UseEnumFromCPP : 0; // 0x210 (1)
	struct FString CPP_EnumName; // 0x218 (16)
	struct UEnum K2_Enumerator; // 0x228 (8)
	char ReplicationMode; // 0x230 (1)
	char BlueprintAutoFlowFSM : 0; // 0x231 (1)
	char BlueprintAutoFlowTransitions : 0; // 0x232 (1)
	char AlwaysTickFSM : 0; // 0x233 (1)
	char ReplicateStateID : 0; // 0x234 (1)
	char ReplicatePreviousStateID : 0; // 0x235 (1)
	char ReplicateStateTime : 0; // 0x236 (1)
	char Debug : 0; // 0x237 (1)
	struct FMulticastInlineDelegate OnInitialized; // 0x238 (16)
	struct FMulticastInlineDelegate OnBegin; // 0x248 (16)
	struct FMulticastInlineDelegate OnUpdate; // 0x258 (16)
	struct FMulticastInlineDelegate OnExit; // 0x268 (16)

	void Update(char UpState, struct FDelegate& Callback); // Function UFSM.StateMachineComponent.Update(Native|Protected|HasOutParms) // <Game_BE.exe+0x120F810>
	void SetStateWithCallbacks(struct FName Name, enum class FSM_Transition& Transition, struct FDelegate& ExitPreviousStateCallback, struct FDelegate& BeginNextStateCallback); // Function UFSM.StateMachineComponent.SetStateWithCallbacks(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120F230>
	void SetStateValueWithCallbacks(struct FSM_State& Value, enum class FSM_Transition& Transition, struct FDelegate& ExitPreviousStateCallback, struct FDelegate& BeginNextStateCallback); // Function UFSM.StateMachineComponent.SetStateValueWithCallbacks(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120EC60>
	void SetStateValue_ConditionalWithCallbacks(struct FSM_State& Value, enum class FSM_Transition Condition, enum class FSM_Transition& Transition, struct FDelegate& ExitPreviousStateCallback, struct FDelegate& BeginNextStateCallback); // Function UFSM.StateMachineComponent.SetStateValue_ConditionalWithCallbacks(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120EFE0>
	void SetStateValue_Conditional(struct FSM_State& Value, enum class FSM_Transition Condition, enum class FSM_Transition& Transition); // Function UFSM.StateMachineComponent.SetStateValue_Conditional(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120EE70>
	void SetStateValue(struct FSM_State& Value, enum class FSM_Transition& Transition); // Function UFSM.StateMachineComponent.SetStateValue(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120EB20>
	void SetStateIDWithCallbacks(char ID, enum class FSM_Transition& Transition, struct FDelegate& ExitPreviousStateCallback, struct FDelegate& BeginNextStateCallback); // Function UFSM.StateMachineComponent.SetStateIDWithCallbacks(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120E690>
	void SetStateID_ConditionalWithCallbacks(char ID, enum class FSM_Transition Condition, enum class FSM_Transition& Transition, struct FDelegate& ExitPreviousStateCallback, struct FDelegate& BeginNextStateCallback); // Function UFSM.StateMachineComponent.SetStateID_ConditionalWithCallbacks(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120E940>
	void SetStateID_Conditional(char ID, enum class FSM_Transition Condition, enum class FSM_Transition& Transition); // Function UFSM.StateMachineComponent.SetStateID_Conditional(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120E830>
	void SetStateID(char ID, enum class FSM_Transition& Transition); // Function UFSM.StateMachineComponent.SetStateID(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120E5C0>
	void SetState_ConditionalWithCallbacks(struct FName Name, enum class FSM_Transition Condition, enum class FSM_Transition& Transition, struct FDelegate& ExitPreviousStateCallback, struct FDelegate& BeginNextStateCallback); // Function UFSM.StateMachineComponent.SetState_ConditionalWithCallbacks(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120F4E0>
	void SetState_Conditional(struct FName Name, enum class FSM_Transition Condition, enum class FSM_Transition& Transition); // Function UFSM.StateMachineComponent.SetState_Conditional(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120F3D0>
	void SetState(struct FName Name, enum class FSM_Transition& Transition); // Function UFSM.StateMachineComponent.SetState(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120E4F0>
	void SERVER_SetStateValue(struct FSM_State Value, char Validate); // Function UFSM.StateMachineComponent.SERVER_SetStateValue(Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // <Game_BE.exe+0x120E3A0>
	void SERVER_SetStateID(char ID, char Validate); // Function UFSM.StateMachineComponent.SERVER_SetStateID(Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // <Game_BE.exe+0x120E2A0>
	void SERVER_SetState(struct FName Name, char Validate); // Function UFSM.StateMachineComponent.SERVER_SetState(Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // <Game_BE.exe+0x120E1A0>
	void SERVER_RemoveState(struct FName Name, char Validate); // Function UFSM.StateMachineComponent.SERVER_RemoveState(Net|NetReliableNative|Event|Public|NetServer|NetValidate) // <Game_BE.exe+0x120E0A0>
	void SERVER_MakeStates(struct TArray<struct FName> NewStates, char Validate); // Function UFSM.StateMachineComponent.SERVER_MakeStates(Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // <Game_BE.exe+0x120DF80>
	void SERVER_GoToFSM(struct UStateMachineComponent TargetMachine, char Validate); // Function UFSM.StateMachineComponent.SERVER_GoToFSM(Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // <Game_BE.exe+0x120DE80>
	void SERVER_FinishState(char Validate); // Function UFSM.StateMachineComponent.SERVER_FinishState(Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // <Game_BE.exe+0x120DDC0>
	void SERVER_AddState(char ID, struct FName Name, char Validate); // Function UFSM.StateMachineComponent.SERVER_AddState(Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // <Game_BE.exe+0x120DC80>
	void SERVER_ActivateFSM(char Validate); // Function UFSM.StateMachineComponent.SERVER_ActivateFSM(Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // <Game_BE.exe+0x120DBC0>
	void RemoveState(struct FName Name, enum class FSM_Transition& Transition); // Function UFSM.StateMachineComponent.RemoveState(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120DAF0>
	enum class FSM_Transition Pure_SetStateByID(char ID); // Function UFSM.StateMachineComponent.Pure_SetStateByID(Final|Native|Public|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x120DA60>
	enum class FSM_Transition Pure_SetState(struct FName Name); // Function UFSM.StateMachineComponent.Pure_SetState(Final|Native|Public|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x120D9D0>
	enum class FSM_Transition Pure_RemoveState(struct FName Name); // Function UFSM.StateMachineComponent.Pure_RemoveState(Final|Native|Public|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x120D940>
	enum class FSM_Transition Pure_AddState(char ID, struct FName Name); // Function UFSM.StateMachineComponent.Pure_AddState(Final|Native|Public|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x120D880>
	void OnREP_StateTime(float& Time); // Function UFSM.StateMachineComponent.OnREP_StateTime(Native|Event|Public|HasOutParms|BlueprintEvent) // <Game_BE.exe+0x120D7E0>
	void OnREP_StateID(char& ID); // Function UFSM.StateMachineComponent.OnREP_StateID(Native|Event|Public|HasOutParms|BlueprintEvent) // <Game_BE.exe+0x120D740>
	void OnREP_PreviousStateID(char& PreviousID); // Function UFSM.StateMachineComponent.OnREP_PreviousStateID(Native|Event|Public|HasOutParms|BlueprintEvent) // <Game_BE.exe+0x120D6A0>
	void OnInitializedFSM(struct UStateMachineComponent Context); // Function UFSM.StateMachineComponent.OnInitializedFSM(Native|Event|Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x120D610>
	void OnAnyUpdateState(struct UStateMachineComponent Context, struct FName WithStateName, char WithStateID, float WithStateTime); // Function UFSM.StateMachineComponent.OnAnyUpdateState(Native|Event|Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x120D4D0>
	void OnAnyExitState(struct UStateMachineComponent Context, struct FName WithStateName, char WithStateID); // Function UFSM.StateMachineComponent.OnAnyExitState(Native|Event|Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x120D3D0>
	void OnAnyBeginState(struct UStateMachineComponent Context, struct FName WithStateName, char WithStateID, char WithPrevious); // Function UFSM.StateMachineComponent.OnAnyBeginState(Native|Event|Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x120D290>
	void MULTI_SetStateValue(struct FSM_State Value); // Function UFSM.StateMachineComponent.MULTI_SetStateValue(Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // <Game_BE.exe+0x120D0B0>
	void MULTI_SetStateID(char ID); // Function UFSM.StateMachineComponent.MULTI_SetStateID(Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // <Game_BE.exe+0x120D030>
	void MULTI_SetState(struct FName Name); // Function UFSM.StateMachineComponent.MULTI_SetState(Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // <Game_BE.exe+0x120CFA0>
	void MULTI_RemoveState(struct FName Name); // Function UFSM.StateMachineComponent.MULTI_RemoveState(Net|NetReliableNative|Event|NetMulticast|Public) // <Game_BE.exe+0x120CF10>
	void MULTI_MakeStates(struct TArray<struct FName> NewStates); // Function UFSM.StateMachineComponent.MULTI_MakeStates(Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // <Game_BE.exe+0x120CE70>
	void MULTI_GoToFSM(struct UStateMachineComponent TargetMachine); // Function UFSM.StateMachineComponent.MULTI_GoToFSM(Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // <Game_BE.exe+0x120CDE0>
	void MULTI_FinishState(); // Function UFSM.StateMachineComponent.MULTI_FinishState(Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // <Game_BE.exe+0x120CDC0>
	void MULTI_AddState(char ID, struct FName Name); // Function UFSM.StateMachineComponent.MULTI_AddState(Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // <Game_BE.exe+0x120CCF0>
	void MULTI_ActivateFSM(); // Function UFSM.StateMachineComponent.MULTI_ActivateFSM(Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // <Game_BE.exe+0x120CCD0>
	void MakeStates(struct TArray<struct FName>& NewStates, enum class FSM_Transition& Transition); // Function UFSM.StateMachineComponent.MakeStates(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120D180>
	char IsInitializedFSM(); // Function UFSM.StateMachineComponent.IsInitializedFSM(Final|Native|Public|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x120CCB0>
	void GoToFSM(struct UStateMachineComponent TargetMachine, enum class FSM_Transition& Transition); // Function UFSM.StateMachineComponent.GoToFSM(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120CBE0>
	float GetTime(); // Function UFSM.StateMachineComponent.GetTime(Final|Native|Public|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x120CBC0>
	struct FName GetPreviousStateName(); // Function UFSM.StateMachineComponent.GetPreviousStateName(Final|Native|Public|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x120CB50>
	char GetPreviousStateID(); // Function UFSM.StateMachineComponent.GetPreviousStateID(Final|Native|Public|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x120CB30>
	struct FName GetCurrentStateName(); // Function UFSM.StateMachineComponent.GetCurrentStateName(Final|Native|Public|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x120CA40>
	char GetCurrentStateID(); // Function UFSM.StateMachineComponent.GetCurrentStateID(Final|Native|Public|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x120CA20>
	struct FSM_State GetActiveState(); // Function UFSM.StateMachineComponent.GetActiveState(Final|Native|Public|BlueprintCallable|BlueprintPure) // <Game_BE.exe+0x120C9B0>
	void FSM_UpdateArgs(struct FSM_UpdateEvent StateInfo); // Function UFSM.StateMachineComponent.FSM_UpdateArgs(Final|Native|Private) // <Game_BE.exe+0x120C4E0>
	void FSM_TransitionRule(enum class FSM_Transition& Condition); // Function UFSM.StateMachineComponent.FSM_TransitionRule(Final|Native|Private|HasOutParms) // <Game_BE.exe+0x120C470>
	void FSM_ExitArgs(struct FSM_ExitEvent StateInfo); // Function UFSM.StateMachineComponent.FSM_ExitArgs(Final|Native|Private) // <Game_BE.exe+0x120C400>
	void FSM_BeginArgs(struct FSM_BeginEvent StateInfo); // Function UFSM.StateMachineComponent.FSM_BeginArgs(Final|Native|Private) // <Game_BE.exe+0x120C400>
	void FinishStateWithCallbacks(enum class FSM_Transition& Transition, struct FDelegate& ExitPreviousStateCallback, struct FDelegate& BeginNextStateCallback); // Function UFSM.StateMachineComponent.FinishStateWithCallbacks(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120C5D0>
	void FinishState_ConditionalWithCallbacks(enum class FSM_Transition Condition, enum class FSM_Transition& Transition, struct FDelegate& ExitPreviousStateCallback, struct FDelegate& BeginNextStateCallback); // Function UFSM.StateMachineComponent.FinishState_ConditionalWithCallbacks(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120C810>
	void FinishState_Conditional(enum class FSM_Transition Condition, enum class FSM_Transition& Transition); // Function UFSM.StateMachineComponent.FinishState_Conditional(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120C740>
	void FinishState(enum class FSM_Transition& Transition); // Function UFSM.StateMachineComponent.FinishState(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120C540>
	char Exit(char ExitState, char NextState, enum class FSM_Transition& Transition, struct FDelegate& Callback); // Function UFSM.StateMachineComponent.Exit(Native|Protected|HasOutParms) // <Game_BE.exe+0x120C1A0>
	void Event_OnUpdateState(char CurrentState, struct FName StateName, float StateTimer); // Function UFSM.StateMachineComponent.Event_OnUpdateState(Event|Public|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void Event_OnExitState(char CurrentState, struct FName StateName, enum class FSM_Transition Transition); // Function UFSM.StateMachineComponent.Event_OnExitState(Event|Public|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void Event_OnConstruct(); // Function UFSM.StateMachineComponent.Event_OnConstruct(Event|Public|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void Event_OnBeginState(char CurrentState, char PreviousState, struct FName StateName, enum class FSM_Transition Transition); // Function UFSM.StateMachineComponent.Event_OnBeginState(Event|Public|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void Enter(char InState, struct FDelegate& Callback); // Function UFSM.StateMachineComponent.Enter(Native|Protected|HasOutParms) // <Game_BE.exe+0x120BFF0>
	void CLIENT_SetStateValue(struct FSM_State Value); // Function UFSM.StateMachineComponent.CLIENT_SetStateValue(Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // <Game_BE.exe+0x120BF20>
	void CLIENT_SetStateID(char ID); // Function UFSM.StateMachineComponent.CLIENT_SetStateID(Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // <Game_BE.exe+0x120BEA0>
	void CLIENT_SetState(struct FName Name); // Function UFSM.StateMachineComponent.CLIENT_SetState(Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // <Game_BE.exe+0x120BE10>
	void CLIENT_RemoveState(struct FName Name); // Function UFSM.StateMachineComponent.CLIENT_RemoveState(Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // <Game_BE.exe+0x120BD80>
	void CLIENT_MakeStates(struct TArray<struct FName> NewStates); // Function UFSM.StateMachineComponent.CLIENT_MakeStates(Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // <Game_BE.exe+0x120BCE0>
	void CLIENT_GoToFSM(struct UStateMachineComponent TargetMachine); // Function UFSM.StateMachineComponent.CLIENT_GoToFSM(Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // <Game_BE.exe+0x120BC50>
	void CLIENT_FinishState(); // Function UFSM.StateMachineComponent.CLIENT_FinishState(Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // <Game_BE.exe+0x120BC30>
	void CLIENT_AddState(char ID, struct FName Name); // Function UFSM.StateMachineComponent.CLIENT_AddState(Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // <Game_BE.exe+0x120BB60>
	void CLIENT_ActivateFSM(); // Function UFSM.StateMachineComponent.CLIENT_ActivateFSM(Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // <Game_BE.exe+0x120BB40>
	struct FSM_State AddState(char ID, struct FName Name, enum class FSM_Transition& Transition); // Function UFSM.StateMachineComponent.AddState(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120B9F0>
	void ActivateFSM(enum class FSM_Transition& Transition); // Function UFSM.StateMachineComponent.ActivateFSM(Final|Native|Public|HasOutParms|BlueprintCallable) // <Game_BE.exe+0x120B960>
};

// ScriptStruct UFSM.SM_SetMachineState
struct FSM_SetMachineState : FAnimNode_Base {
	struct FPoseLink BasePose; // 0x10 (16)
	struct FName FSM; // 0x20 (8)
	struct FName ASM; // 0x28 (8)
	char EveryFrame : 0; // 0x30 (1)
};

// ScriptStruct UFSM.SM_BlendStateMachines
struct FSM_BlendStateMachines : FAnimNode_Base {
	struct FPoseLink BasePose; // 0x10 (16)
	struct FPoseLink BlendPose; // 0x20 (16)
};

// ScriptStruct UFSM.MachinePayloadData
struct FMachinePayloadData {
	struct TArray<struct UClass*> Actions; // 0x0 (16)
};

// ScriptStruct UFSM.SM_Link
struct FSM_Link {
	struct FName NextState; // 0x0 (8)
	struct FName Function; // 0x8 (8)
};

// ScriptStruct UFSM.SM_State
struct FSM_State {
	struct FName Name; // 0x0 (8)
	struct UStateMachineComponent Owner; // 0x8 (8)
	struct FMulticastInlineDelegate OnBeginState; // 0x10 (16)
	struct FMulticastInlineDelegate OnUpdateState; // 0x20 (16)
	struct FMulticastInlineDelegate OnExitState; // 0x30 (16)
};

// ScriptStruct UFSM.SM_ExitEvent
struct FSM_ExitEvent {
	char StateID; // 0x0 (1)
	char NextStateID; // 0x1 (1)
	struct FName NextStateName; // 0x4 (8)
};

// ScriptStruct UFSM.SM_UpdateEvent
struct FSM_UpdateEvent {
	char StateID; // 0x0 (1)
	float StateTime; // 0x4 (4)
};

// ScriptStruct UFSM.SM_BeginEvent
struct FSM_BeginEvent {
	char StateID; // 0x0 (1)
	char PreviousStateID; // 0x1 (1)
	struct FName PreviousStateName; // 0x4 (8)
};

// Function UFSM.FSM_SetState_Async.FSM_SetState_Async
inline struct UFSM_SetState_Async UFSM_SetState_Async::FSM_SetState_Async(struct UStateMachineComponent FSM, float WaitForSeconds, struct FName Name, char Loop) {
	static auto fn = UObject::FindObject<UFunction>("Function UFSM.FSM_SetState_Async.FSM_SetState_Async");

	struct FSM_SetState_Async_Params {
		struct UStateMachineComponent FSM;
		float WaitForSeconds;
		struct FName Name;
		char Loop;
		struct UFSM_SetState_Async ReturnValue;

	}; FSM_SetState_Async_Params Params;

	Params.FSM = FSM;
	Params.WaitForSeconds = WaitForSeconds;
	Params.Name = Name;
	Params.Loop = Loop;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;

	return params.ReturnValue;
}

// Function UFSM.FSM_SetState_Async.Execute
inline void UFSM_SetState_Async::Execute() {
