// WidgetBlueprintGeneratedClass UW-AttackUserWidget.UW-AttackUserWidget_C
class UUW-AttackUserWidget_C : public UBravoHotelAttackUserWidget {

public:

	struct UWidgetAnimation Enemy_Lv_Motion_FadeOut_Inert; // 0x2A0 (8)
	struct UWidgetAnimation Enemy_Lv_Motion_FadeIn_Inert; // 0x2A8 (8)
	struct UWidgetAnimation FadeOut; // 0x2B0 (8)
	struct UOverlay Enemy_Inert; // 0x2B8 (8)
	struct UHorizontalBox HorizontalBox_1; // 0x2C0 (8)
	struct UHorizontalBox HorizontalBox_2; // 0x2C8 (8)
	struct UImage Image_2; // 0x2D0 (8)
	struct UImage Image_145; // 0x2D8 (8)
	struct UOverlay Overlay_2; // 0x2E0 (8)
	struct UOverlay Overlay_98; // 0x2E8 (8)
	struct UActor Pawn; // 0x2F0 (8)
};

