// WidgetBlueprintGeneratedClass UW-ArmoryResultListWidget.UW-ArmoryResultListWidget_C
class UUW-ArmoryResultListWidget_C : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Armory_Repair_M; // 0x250 (8)
	struct Unknown Armory_Strengthen_M; // 0x258 (8)
	struct Unknown Armory_Failed_M; // 0x260 (8)
	struct Unknown Armory_Break_M; // 0x268 (8)
	struct Unknown Armory_Failed_Break_M; // 0x270 (8)
	struct Unknown Armory_Failed_Down_M; // 0x278 (8)
	struct Unknown Armory_Awesome_M; // 0x280 (8)
	struct Unknown Armory_Success_M; // 0x288 (8)
	struct Unknown Armory_Awesome; // 0x290 (8)
	struct Unknown Armory_Break; // 0x298 (8)
	struct Unknown Armory_Failed; // 0x2A0 (8)
	struct Unknown Armory_Failed_Break; // 0x2A8 (8)
	struct Unknown Armory_Failed_Down; // 0x2B0 (8)
	struct Unknown Armory_Repair; // 0x2B8 (8)
	struct Unknown Armory_Strengthen; // 0x2C0 (8)
	struct Unknown Armory_Success; // 0x2C8 (8)
	struct Unknown Awesome_Damage1; // 0x2D0 (8)
	struct Unknown Awesome_Damage2; // 0x2D8 (8)
	struct Unknown Awesome_ItemName; // 0x2E0 (8)
	struct Unknown Awesome_Level1; // 0x2E8 (8)
	struct Unknown Awesome_Level2; // 0x2F0 (8)
	struct Unknown Awesome_MagSize1; // 0x2F8 (8)
	struct Unknown Awesome_MagSize2; // 0x300 (8)
	struct Unknown Awesome_Spread1; // 0x308 (8)
	struct Unknown Awesome_Spread2; // 0x310 (8)
	struct Unknown Awesome_UpLevel; // 0x318 (8)
	struct Unknown Break_Count; // 0x320 (8)
	struct Unknown Break_ItemName; // 0x328 (8)
	struct Unknown BreakTitle; // 0x330 (8)
	struct Unknown Button_1; // 0x338 (8)
	struct Unknown Button_2; // 0x340 (8)
	struct Unknown Button_228; // 0x348 (8)
	struct Unknown Button_230; // 0x350 (8)
	struct Unknown Button_232; // 0x358 (8)
	struct Unknown Button_233; // 0x360 (8)
	struct Unknown Button_EnchanceCancle; // 0x368 (8)
	struct Unknown Button_Enhance; // 0x370 (8)
	struct Unknown Button_Fatigue; // 0x378 (8)
	struct Unknown Empty; // 0x380 (8)
	struct Unknown FB_Damage1; // 0x388 (8)
	struct Unknown FB_Damage2; // 0x390 (8)
	struct Unknown FB_Level1; // 0x398 (8)
	struct Unknown FB_Level2; // 0x3A0 (8)
	struct Unknown FB_MagSize1; // 0x3A8 (8)
	struct Unknown FB_MagSize2; // 0x3B0 (8)
	struct Unknown FB_Spread1; // 0x3B8 (8)
	struct Unknown FB_Spread2; // 0x3C0 (8)
	struct Unknown FD_Damage1; // 0x3C8 (8)
	struct Unknown FD_Damage2; // 0x3D0 (8)
	struct Unknown FD_DownLevel; // 0x3D8 (8)
	struct Unknown FD_Level1; // 0x3E0 (8)
	struct Unknown FD_Level2; // 0x3E8 (8)
	struct Unknown FD_MagSize1; // 0x3F0 (8)
	struct Unknown FD_MagSize2; // 0x3F8 (8)
	struct Unknown FD_Spread1; // 0x400 (8)
	struct Unknown FD_Spread2; // 0x408 (8)
	struct Unknown HorizontalBox_Awesome_Damage; // 0x410 (8)
	struct Unknown HorizontalBox_Awesome_MagSize; // 0x418 (8)
	struct Unknown HorizontalBox_Awesome_Spread; // 0x420 (8)
	struct Unknown HorizontalBox_FB_Damage; // 0x428 (8)
	struct Unknown HorizontalBox_FB_MagSize; // 0x430 (8)
	struct Unknown HorizontalBox_FB_Spread; // 0x438 (8)
	struct Unknown HorizontalBox_FD_Damage; // 0x440 (8)
	struct Unknown HorizontalBox_FD_MasSize; // 0x448 (8)
	struct Unknown HorizontalBox_FD_Spread; // 0x450 (8)
	struct Unknown HorizontalBox_Strengthen_Damage; // 0x458 (8)
	struct Unknown HorizontalBox_Strengthen_MagSize; // 0x460 (8)
	struct Unknown HorizontalBox_Strengthen_Spread; // 0x468 (8)
	struct Unknown HorizontalBox_Success_Damage; // 0x470 (8)
	struct Unknown HorizontalBox_Success_Durable; // 0x478 (8)
	struct Unknown HorizontalBox_Success_Fatigue; // 0x480 (8)
	struct Unknown HorizontalBox_Success_MagSize; // 0x488 (8)
	struct Unknown HorizontalBox_Success_Spread; // 0x490 (8)
	struct Unknown Image; // 0x498 (8)
	struct Unknown Image_2; // 0x4A0 (8)
	struct Unknown Image_3; // 0x4A8 (8)
	struct Unknown Image_4; // 0x4B0 (8)
	struct Unknown Image_8; // 0x4B8 (8)
	struct Unknown Image_14; // 0x4C0 (8)
	struct Unknown Image_15; // 0x4C8 (8)
	struct Unknown Image_16; // 0x4D0 (8)
	struct Unknown Image_17; // 0x4D8 (8)
	struct Unknown Image_18; // 0x4E0 (8)
	struct Unknown Image_20; // 0x4E8 (8)
	struct Unknown Image_27; // 0x4F0 (8)
	struct Unknown Image_167; // 0x4F8 (8)
	struct Unknown Image_501; // 0x500 (8)
	struct Unknown Image_503; // 0x508 (8)
	struct Unknown Image_817; // 0x510 (8)
	struct Unknown Image_820; // 0x518 (8)
	struct Unknown Image_821; // 0x520 (8)
	struct Unknown Image_822; // 0x528 (8)
	struct Unknown Image_823; // 0x530 (8)
	struct Unknown Image_824; // 0x538 (8)
	struct Unknown Image_825; // 0x540 (8)
	struct Unknown Image_826; // 0x548 (8)
	struct Unknown Image_827; // 0x550 (8)
	struct Unknown Image_828; // 0x558 (8)
	struct Unknown Image_829; // 0x560 (8)
	struct Unknown Image_830; // 0x568 (8)
	struct Unknown Image_831; // 0x570 (8)
	struct Unknown Image_832; // 0x578 (8)
	struct Unknown Image_833; // 0x580 (8)
	struct Unknown Image_834; // 0x588 (8)
	struct Unknown Image_835; // 0x590 (8)
	struct Unknown Image_836; // 0x598 (8)
	struct Unknown Image_837; // 0x5A0 (8)
	struct Unknown Image_838; // 0x5A8 (8)
	struct Unknown Image_839; // 0x5B0 (8)
	struct Unknown Image_840; // 0x5B8 (8)
	struct Unknown Image_841; // 0x5C0 (8)
	struct Unknown Image_842; // 0x5C8 (8)
	struct Unknown Image_843; // 0x5D0 (8)
	struct Unknown Image_845; // 0x5D8 (8)
	struct Unknown Image_846; // 0x5E0 (8)
	struct Unknown Image_847; // 0x5E8 (8)
	struct Unknown Image_848; // 0x5F0 (8)
	struct Unknown Image_849; // 0x5F8 (8)
	struct Unknown Image_850; // 0x600 (8)
	struct Unknown Image_851; // 0x608 (8)
	struct Unknown Image_852; // 0x610 (8)
	struct Unknown Image_853; // 0x618 (8)
	struct Unknown Image_854; // 0x620 (8)
	struct Unknown Image_855; // 0x628 (8)
	struct Unknown Image_856; // 0x630 (8)
	struct Unknown Image_857; // 0x638 (8)
	struct Unknown Image_858; // 0x640 (8)
	struct Unknown Image_859; // 0x648 (8)
	struct Unknown Image_860; // 0x650 (8)
	struct Unknown Image_861; // 0x658 (8)
	struct Unknown Image_862; // 0x660 (8)
	struct Unknown Image_863; // 0x668 (8)
	struct Unknown Image_864; // 0x670 (8)
	struct Unknown Image_865; // 0x678 (8)
	struct Unknown Image_866; // 0x680 (8)
	struct Unknown Image_867; // 0x688 (8)
	struct Unknown Image_868; // 0x690 (8)
	struct Unknown Image_921; // 0x698 (8)
	struct Unknown Image_1264; // 0x6A0 (8)
	struct Unknown Image_1266; // 0x6A8 (8)
	struct Unknown Image_1269; // 0x6B0 (8)
	struct Unknown Image_1270; // 0x6B8 (8)
	struct Unknown Image_1271; // 0x6C0 (8)
	struct Unknown Image_1272; // 0x6C8 (8)
	struct Unknown Image_1273; // 0x6D0 (8)
	struct Unknown Image_1277; // 0x6D8 (8)
	struct Unknown Image_1278; // 0x6E0 (8)
	struct Unknown Image_1279; // 0x6E8 (8)
	struct Unknown Image_1280; // 0x6F0 (8)
	struct Unknown Image_1284; // 0x6F8 (8)
	struct Unknown Image_1285; // 0x700 (8)
	struct Unknown Image_1318; // 0x708 (8)
	struct Unknown Image_1319; // 0x710 (8)
	struct Unknown Image_1320; // 0x718 (8)
	struct Unknown Image_1321; // 0x720 (8)
	struct Unknown Image_1322; // 0x728 (8)
	struct Unknown Image_1323; // 0x730 (8)
	struct Unknown Image_1324; // 0x738 (8)
	struct Unknown Image_1329; // 0x740 (8)
	struct Unknown Image_1330; // 0x748 (8)
	struct Unknown Image_1335; // 0x750 (8)
	struct Unknown Image_1336; // 0x758 (8)
	struct Unknown Image_1341; // 0x760 (8)
	struct Unknown Image_1342; // 0x768 (8)
	struct Unknown Image_1343; // 0x770 (8)
	struct Unknown Image_1344; // 0x778 (8)
	struct Unknown Image_1345; // 0x780 (8)
	struct Unknown Image_1346; // 0x788 (8)
	struct Unknown Image_1347; // 0x790 (8)
	struct Unknown Image_1348; // 0x798 (8)
	struct Unknown Image_1349; // 0x7A0 (8)
	struct Unknown Image_1350; // 0x7A8 (8)
	struct Unknown Image_1351; // 0x7B0 (8)
	struct Unknown Image_1352; // 0x7B8 (8)
	struct Unknown Image_1353; // 0x7C0 (8)
	struct Unknown Image_1354; // 0x7C8 (8)
	struct Unknown Image_1355; // 0x7D0 (8)
	struct Unknown Image_1356; // 0x7D8 (8)
	struct Unknown Image_1358; // 0x7E0 (8)
	struct Unknown Image_1359; // 0x7E8 (8)
	struct Unknown Image_1361; // 0x7F0 (8)
	struct Unknown Image_1362; // 0x7F8 (8)
	struct Unknown Image_1363; // 0x800 (8)
	struct Unknown Image_1364; // 0x808 (8)
	struct Unknown Image_1366; // 0x810 (8)
	struct Unknown Image_1368; // 0x818 (8)
	struct Unknown Image_1369; // 0x820 (8)
	struct Unknown Image_1370; // 0x828 (8)
	struct Unknown Image_1372; // 0x830 (8)
	struct Unknown Image_1374; // 0x838 (8)
	struct Unknown Image_1375; // 0x840 (8)
	struct Unknown Image_1376; // 0x848 (8)
	struct Unknown Image_1378; // 0x850 (8)
	struct Unknown Image_1380; // 0x858 (8)
	struct Unknown Image_1381; // 0x860 (8)
	struct Unknown Image_1382; // 0x868 (8)
	struct Unknown Image_1384; // 0x870 (8)
	struct Unknown Image_1972; // 0x878 (8)
	struct Unknown ImageTX_Complete_Fail; // 0x880 (8)
	struct Unknown ItemList; // 0x888 (8)
	struct Unknown Overlay_FB_ItemList; // 0x890 (8)
	struct Unknown Strengthen_Cost; // 0x898 (8)
	struct Unknown Strengthen_Count; // 0x8A0 (8)
	struct Unknown Strengthen_CurrentDamageText1; // 0x8A8 (8)
	struct Unknown Strengthen_CurrentDamageText2; // 0x8B0 (8)
	struct Unknown Strengthen_CurrentMagSizeText1; // 0x8B8 (8)
	struct Unknown Strengthen_CurrentMagSizeText2; // 0x8C0 (8)
	struct Unknown Strengthen_CurrentSpreadText1; // 0x8C8 (8)
	struct Unknown Strengthen_CurrentSpreadText2; // 0x8D0 (8)
	struct Unknown Strengthen_Icon; // 0x8D8 (8)
	struct Unknown Strengthen_IconType1; // 0x8E0 (8)
	struct Unknown Strengthen_IconType2; // 0x8E8 (8)
	struct Unknown Strengthen_IconType3; // 0x8F0 (8)
	struct Unknown Strengthen_Level1; // 0x8F8 (8)
	struct Unknown Strengthen_Level2; // 0x900 (8)
	struct Unknown Strengthen_Name; // 0x908 (8)
	struct Unknown Strengthen_TextType1; // 0x910 (8)
	struct Unknown Strengthen_TextType2; // 0x918 (8)
	struct Unknown Strengthen_TextType3; // 0x920 (8)
	struct Unknown Success_Damage1; // 0x928 (8)
	struct Unknown Success_Damage2; // 0x930 (8)
	struct Unknown Success_ItemName; // 0x938 (8)
	struct Unknown Success_ItemName_2; // 0x940 (8)
	struct Unknown Success_Level1; // 0x948 (8)
	struct Unknown Success_Level2; // 0x950 (8)
	struct Unknown Success_MagSize1; // 0x958 (8)
	struct Unknown Success_MagSize2; // 0x960 (8)
	struct Unknown Success_Spread1; // 0x968 (8)
	struct Unknown Success_Spread2; // 0x970 (8)
	struct Unknown Success_UpLevel; // 0x978 (8)
	struct Unknown T_Durability; // 0x980 (8)
	struct Unknown T_Fatigue; // 0x988 (8)
	struct Unknown T_PreFatigue; // 0x990 (8)
	struct Unknown TerrainHeight; // 0x998 (8)
	struct Unknown TextBlock_2089; // 0x9A0 (8)
	struct Unknown TextBlock_FB_ItemCount; // 0x9A8 (8)
	struct Unknown TextBlock_FB_ItemName; // 0x9B0 (8)
	struct Unknown TextBlock_FB_Title; // 0x9B8 (8)
	struct Unknown WidgetSwitcher_1; // 0x9C0 (8)
	struct Unknown ResultInfo; // 0x9C8 (56)
	float CurrentDurability; // 0xA00 (4)

	void SequenceEvent__ENTRYPOINTUW-ArmoryResultListWidget_16(); // Function UW-ArmoryResultListWidget.UW-ArmoryResultListWidget_C.SequenceEvent__ENTRYPOINTUW-ArmoryResultListWidget_16(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	void SequenceEvent__ENTRYPOINTUW-ArmoryResultListWidget_15(); // Function UW-ArmoryResultListWidget.UW-ArmoryResultListWidget_C.SequenceEvent__ENTRYPOINTUW-ArmoryResultListWidget_15(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	void SequenceEvent__ENTRYPOINTUW-ArmoryResultListWidget_14(); // Function UW-ArmoryResultListWidget.UW-ArmoryResultListWidget_C.SequenceEvent__ENTRYPOINTUW-ArmoryResultListWidget_14(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
