// WidgetBlueprintGeneratedClass UW-AttackUserWidget.UW-AttackUserWidget_C
class UUW-AttackUserWidget_C : public UBravoHotelAttackUserWidget {

public:

	struct Unknown Enemy_Lv_Motion_FadeOut_Inert; // 0x2A0 (8)
	struct Unknown Enemy_Lv_Motion_FadeIn_Inert; // 0x2A8 (8)
	struct Unknown FadeOut; // 0x2B0 (8)
	struct Unknown Enemy_Inert; // 0x2B8 (8)
	struct Unknown HorizontalBox_1; // 0x2C0 (8)
	struct Unknown HorizontalBox_2; // 0x2C8 (8)
	struct Unknown Image_2; // 0x2D0 (8)
	struct Unknown Image_145; // 0x2D8 (8)
	struct Unknown Overlay_2; // 0x2E0 (8)
	struct Unknown Overlay_98; // 0x2E8 (8)
	struct Unknown Pawn; // 0x2F0 (8)
};

