// WidgetBlueprintGeneratedClass UW-BlackMarket_Main.UW-BlackMarket_Main_C
class UUW-BlackMarket_Main_C : public UBravoHotelDevelopmentBlackMarket {

public:

	struct Unknown UberGraphFrame; // 0x2E8 (8)
	struct Unknown AllItem; // 0x2F0 (8)
	struct Unknown Button_1004; // 0x2F8 (8)
	struct Unknown CheckBox_1; // 0x300 (8)
	struct Unknown CP-Column; // 0x308 (8)
	struct Unknown IMG-Ammo; // 0x310 (8)
	struct Unknown IMG-Attachment; // 0x318 (8)
	struct Unknown IMG-Consumable; // 0x320 (8)
	struct Unknown IMG-Custom; // 0x328 (8)
	struct Unknown IMG-Gear; // 0x330 (8)
	struct Unknown IMG-Perk; // 0x338 (8)
	struct Unknown IMG-Preset; // 0x340 (8)
	struct Unknown IMG-TopBG; // 0x348 (8)
	struct Unknown IMG-Vehicle; // 0x350 (8)
	struct Unknown IMG-Weapon; // 0x358 (8)
	struct Unknown IMG-Wearable; // 0x360 (8)
	struct Unknown Text_culture; // 0x368 (8)
	struct Unknown UW-BlackMarket_Character; // 0x370 (8)
	struct Unknown UW-BlackMarket_SubTab; // 0x378 (8)
	struct Unknown WB-ItemList; // 0x380 (8)
	struct Unknown WrapBox_6; // 0x388 (8)
	enum class Unknow CurrentTab; // 0x390 (1)
	struct Unknown SelectTabColor; // 0x394 (16)
	struct Unknown UnSelectTabColor; // 0x3A4 (16)
	char ShowWorkInProcess : 0; // 0x3B4 (1)
	struct TArray<Unknown> ItemList; // 0x3B8 (16)
	enum class Unknow SelectedWeaponSubTab; // 0x3C8 (1)
	enum class Unknow SelectedAttachmentSubTab; // 0x3C9 (1)
	enum class Unknow SelectedWearableSubTab; // 0x3CA (1)
	enum class Unknow SelectedGearSubTab; // 0x3CB (1)
	enum class Unknow SelectedCustomSubTab; // 0x3CC (1)
	struct TArray<Unknown> SortTypeList; // 0x3D0 (16)
	struct TArray<Unknown> WeaponAscendList; // 0x3E0 (16)
	int32_t CurrentWeaponSortType; // 0x3F0 (4)
	struct TArray<Unknown> AmmoAscendList; // 0x3F8 (16)
	int32_t CurrentAmmoSortType; // 0x408 (4)
	struct TArray<Unknown> AttachmentAscendList; // 0x410 (16)
	int32_t CurrentAttachmentSortType; // 0x420 (4)
	int32_t CurrentWearableSortType; // 0x424 (4)
	int32_t CurrentConsumableSortType; // 0x428 (4)
	int32_t CurrentCustomSortType; // 0x42C (4)
	int32_t CurrentVehicleSortType; // 0x430 (4)
	struct TArray<Unknown> WearableAscendList; // 0x438 (16)
	struct TArray<Unknown> ConsumableAscendList; // 0x448 (16)
	struct TArray<Unknown> CustomAscendList; // 0x458 (16)
	struct TArray<Unknown> VehicleAscendList; // 0x468 (16)
	struct Unknown SaveData; // 0x478 (8)
	struct TArray<Unknown> GearAscendList; // 0x480 (16)
	int32_t CurrentGearSortType; // 0x490 (4)
	struct FString BlackmarketSaveSlotName; // 0x498 (16)
	int32_t TestIndex; // 0x4A8 (4)
	struct TArray<Unknown> PerkAscendList; // 0x4B0 (16)
	int32_t CurrentPerkSortType; // 0x4C0 (4)
	enum class Unknow SelectedPerkSubTab; // 0x4C4 (1)
	int32_t CurrentPresetSortType; // 0x4C8 (4)
	struct TArray<Unknown> PresetAscendList; // 0x4D0 (16)
	struct FName SelectedPerkClass; // 0x4E0 (8)
	enum class Unknow SelectedConsumableSubTab; // 0x4E8 (1)

	void IsCorrectPresetSlot(enum class Unknow status, char& bResult); // Function UW-BlackMarket_Main.UW-BlackMarket_Main_C.IsCorrectPresetSlot(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void InitPresetList(); // Function UW-BlackMarket_Main.UW-BlackMarket_Main_C.InitPresetList(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void SetPresetSlot_Impl(int32_t SortType, char bHideOption); // Function UW-BlackMarket_Main.UW-BlackMarket_Main_C.SetPresetSlot_Impl(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
