// WidgetBlueprintGeneratedClass UW-BasicConversation.UW-BasicConversation_C
class UUW-BasicConversation_C : public UBravoHotelConversationWidget {

public:

	struct Unknown UberGraphFrame; // 0x258 (8)
	struct Unknown First; // 0x260 (8)
	struct Unknown Hide; // 0x268 (8)
	struct Unknown Show; // 0x270 (8)
	struct Unknown Idle; // 0x278 (8)
	struct Unknown Bg; // 0x280 (8)
	struct Unknown Bg_2; // 0x288 (8)
	struct Unknown Bg_3; // 0x290 (8)
	struct Unknown Button_407; // 0x298 (8)
	struct Unknown Image; // 0x2A0 (8)
	struct Unknown Image_2; // 0x2A8 (8)
	struct Unknown Image_55; // 0x2B0 (8)
	struct Unknown Image_340; // 0x2B8 (8)
	struct Unknown Overlay_Base; // 0x2C0 (8)
	struct Unknown TextBlock_Message; // 0x2C8 (8)
	struct Unknown TextBlock_SpeakerName; // 0x2D0 (8)
	struct Unknown UW-ImageText; // 0x2D8 (8)
	struct Unknown WidgetSwitcher_Face; // 0x2E0 (8)
	struct Unknown SentenceData; // 0x2E8 (176)

	void Finished_F3AEE8B3477DC5B8B5A3EA8301B8E940(); // Function UW-BasicConversation.UW-BasicConversation_C.Finished_F3AEE8B3477DC5B8B5A3EA8301B8E940(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6E050>
	void Construct(); // Function UW-BasicConversation.UW-BasicConversation_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6E050>
	void ShowSentense(struct Unknown& SentenceData); // Function UW-BasicConversation.UW-BasicConversation_C.ShowSentense(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6E050>
	void HideSentense(); // Function UW-BasicConversation.UW-BasicConversation_C.HideSentense(Event|Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6E050>
	void BndEvt__Button_406_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function UW-BasicConversation.UW-BasicConversation_C.BndEvt__Button_406_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6E050>
	void ExecuteUbergraph_UW-BasicConversation(int32_t EntryPoint); // Function UW-BasicConversation.UW-BasicConversation_C.ExecuteUbergraph_UW-BasicConversation(Final|UbergraphFunction|HasDefaults) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6E050>
};

// Function UW-BasicConversation.UW-BasicConversation_C.Finished_F3AEE8B3477DC5B8B5A3EA8301B8E940
inline void UUW-BasicConversation_C::Finished_F3AEE8B3477DC5B8B5A3EA8301B8E940() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-BasicConversation.UW-BasicConversation_C.Finished_F3AEE8B3477DC5B8B5A3EA8301B8E940");

	struct Finished_F3AEE8B3477DC5B8B5A3EA8301B8E940_Params {
		
	}; Finished_F3AEE8B3477DC5B8B5A3EA8301B8E940_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-BasicConversation.UW-BasicConversation_C.Construct
inline void UUW-BasicConversation_C::Construct() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-BasicConversation.UW-BasicConversation_C.Construct");

	struct Construct_Params {
		
	}; Construct_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-BasicConversation.UW-BasicConversation_C.ShowSentense
inline void UUW-BasicConversation_C::ShowSentense(struct Unknown& SentenceData) {
	static auto fn = UObject::FindObject<UFunction>("Function UW-BasicConversation.UW-BasicConversation_C.ShowSentense");

	struct ShowSentense_Params {
		struct Unknown& SentenceData;
	}; ShowSentense_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;

	SentenceData = Params.SentenceData;

}

// Function UW-BasicConversation.UW-BasicConversation_C.HideSentense
inline void UUW-BasicConversation_C::HideSentense() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-BasicConversation.UW-BasicConversation_C.HideSentense");

	struct HideSentense_Params {
		
	}; HideSentense_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-BasicConversation.UW-BasicConversation_C.BndEvt__Button_406_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
inline void UUW-BasicConversation_C::BndEvt__Button_406_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-BasicConversation.UW-BasicConversation_C.BndEvt__Button_406_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature");

	struct BndEvt__Button_406_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params {
		
	}; BndEvt__Button_406_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-BasicConversation.UW-BasicConversation_C.ExecuteUbergraph_UW-BasicConversation
inline void UUW-BasicConversation_C::ExecuteUbergraph_UW-BasicConversation(int32_t EntryPoint) {
	static auto fn = UObject::FindObject<UFunction>("Function UW-BasicConversation.UW-BasicConversation_C.ExecuteUbergraph_UW-BasicConversation");

	struct ExecuteUbergraph_UW-BasicConversation_Params {
		int32_t EntryPoint;
	}; ExecuteUbergraph_UW-BasicConversation_Params Params;

	Params.EntryPoint = EntryPoint;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

