// WidgetBlueprintGeneratedClass UW-BlackMarket_Main.UW-BlackMarket_Main_C
class UUW-BlackMarket_Main_C : public UBravoHotelDevelopmentBlackMarket {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2E8 (8)
	struct UButton AllItem; // 0x2F0 (8)
	struct UButton Button_1004; // 0x2F8 (8)
	struct UCheckBox CheckBox_1; // 0x300 (8)
	struct UCanvasPanel CP-Column; // 0x308 (8)
	struct UImage IMG-Ammo; // 0x310 (8)
	struct UImage IMG-Attachment; // 0x318 (8)
	struct UImage IMG-Consumable; // 0x320 (8)
	struct UImage IMG-Custom; // 0x328 (8)
	struct UImage IMG-Gear; // 0x330 (8)
	struct UImage IMG-Perk; // 0x338 (8)
	struct UImage IMG-Preset; // 0x340 (8)
	struct UImage IMG-TopBG; // 0x348 (8)
	struct UImage IMG-Vehicle; // 0x350 (8)
	struct UImage IMG-Weapon; // 0x358 (8)
	struct UImage IMG-Wearable; // 0x360 (8)
	struct UTextBlock Text_culture; // 0x368 (8)
	struct UUW-BlackMarket_Character_C UW-BlackMarket_Character; // 0x370 (8)
	struct UUW-BlackMarket_SubTab_C UW-BlackMarket_SubTab; // 0x378 (8)
	struct UWrapBox WB-ItemList; // 0x380 (8)
	struct UWrapBox WrapBox_6; // 0x388 (8)
	enum class EBlackmarketTabType CurrentTab; // 0x390 (1)
	struct FLinearColor SelectTabColor; // 0x394 (16)
	struct FLinearColor UnSelectTabColor; // 0x3A4 (16)
	char ShowWorkInProcess : 0; // 0x3B4 (1)
	struct TArray<struct FInventoryItemDetailInfo> ItemList; // 0x3B8 (16)
	enum class EWeaponType SelectedWeaponSubTab; // 0x3C8 (1)
	enum class EWeaponAttachmentType SelectedAttachmentSubTab; // 0x3C9 (1)
	enum class EWearableItemType SelectedWearableSubTab; // 0x3CA (1)
	enum class EWearableItemType SelectedGearSubTab; // 0x3CB (1)
	enum class EWearableItemType SelectedCustomSubTab; // 0x3CC (1)
	struct TArray<int32_t> SortTypeList; // 0x3D0 (16)
	struct TArray<char> WeaponAscendList; // 0x3E0 (16)
	int32_t CurrentWeaponSortType; // 0x3F0 (4)
	struct TArray<char> AmmoAscendList; // 0x3F8 (16)
	int32_t CurrentAmmoSortType; // 0x408 (4)
	struct TArray<char> AttachmentAscendList; // 0x410 (16)
	int32_t CurrentAttachmentSortType; // 0x420 (4)
	int32_t CurrentWearableSortType; // 0x424 (4)
	int32_t CurrentConsumableSortType; // 0x428 (4)
	int32_t CurrentCustomSortType; // 0x42C (4)
	int32_t CurrentVehicleSortType; // 0x430 (4)
	struct TArray<char> WearableAscendList; // 0x438 (16)
	struct TArray<char> ConsumableAscendList; // 0x448 (16)
	struct TArray<char> CustomAscendList; // 0x458 (16)
	struct TArray<char> VehicleAscendList; // 0x468 (16)
	struct UBP-BlackmarketSaveGame_C SaveData; // 0x478 (8)
	struct TArray<char> GearAscendList; // 0x480 (16)
	int32_t CurrentGearSortType; // 0x490 (4)
	struct FString BlackmarketSaveSlotName; // 0x498 (16)
	int32_t TestIndex; // 0x4A8 (4)
	struct TArray<char> PerkAscendList; // 0x4B0 (16)
	int32_t CurrentPerkSortType; // 0x4C0 (4)
	enum class EPerkSlotFlag SelectedPerkSubTab; // 0x4C4 (1)
	int32_t CurrentPresetSortType; // 0x4C8 (4)
	struct TArray<char> PresetAscendList; // 0x4D0 (16)
	struct FName SelectedPerkClass; // 0x4E0 (8)
	enum class EItemType SelectedConsumableSubTab; // 0x4E8 (1)

	void IsCorrectPresetSlot(enum class EDevelopmentStatus status, char& bResult); // Function UW-BlackMarket_Main.UW-BlackMarket_Main_C.IsCorrectPresetSlot(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void InitPresetList(); // Function UW-BlackMarket_Main.UW-BlackMarket_Main_C.InitPresetList(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
	void SetPresetSlot_Impl(int32_t SortType, char bHideOption); // Function UW-BlackMarket_Main.UW-BlackMarket_Main_C.SetPresetSlot_Impl(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B87A30>
