// WidgetBlueprintGeneratedClass UW-BlackMarket_SubTab.UW-BlackMarket_SubTab_C
class UUW-BlackMarket_SubTab_C : public UUserWidget {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248 (8)
	struct UButton BTN-Amplifier; // 0x250 (8)
	struct UButton BTN-Attachment-ALL; // 0x258 (8)
	struct UButton BTN-Attachment-Barrel; // 0x260 (8)
	struct UButton BTN-Attachment-Grip; // 0x268 (8)
	struct UButton BTN-Attachment-Mag; // 0x270 (8)
	struct UButton BTN-Attachment-Muzzle; // 0x278 (8)
	struct UButton BTN-Attachment-Sight; // 0x280 (8)
	struct UButton BTN-Attachment-Stock; // 0x288 (8)
	struct UButton BTN-Consumable_Chest; // 0x290 (8)
	struct UButton BTN-Consumable_Material; // 0x298 (8)
	struct UButton BTN-Consumable_Recipe; // 0x2A0 (8)
	struct UButton BTN-Consumable_Usable; // 0x2A8 (8)
	struct UButton BTN-Custom-ALL; // 0x2B0 (8)
	struct UButton BTN-Custom-Face; // 0x2B8 (8)
	struct UButton BTN-Custom-Hair; // 0x2C0 (8)
	struct UButton BTN-Gear-All; // 0x2C8 (8)
	struct UButton BTN-Gear-Armor; // 0x2D0 (8)
	struct UButton BTN-Gear-Bag; // 0x2D8 (8)
	struct UButton BTN-Gear-Ghillie; // 0x2E0 (8)
	struct UButton BTN-Gear-Helmet; // 0x2E8 (8)
	struct UButton BTN-ResetHair; // 0x2F0 (8)
	struct UButton BTN-WeaponALL; // 0x2F8 (8)
	struct UButton BTN-Wearable-ALL; // 0x300 (8)
	struct UButton BTN-Wearable-Bottom; // 0x308 (8)
	struct UButton BTN-Wearable-EyeWear; // 0x310 (8)
	struct UButton BTN-Wearable-Gloves; // 0x318 (8)
	struct UButton BTN-Wearable-Hat; // 0x320 (8)
	struct UButton BTN-Wearable-Mask; // 0x328 (8)
	struct UButton BTN-Wearable-Outer; // 0x330 (8)
	struct UButton BTN-Wearable-Shoes; // 0x338 (8)
	struct UButton BTN-Wearable-Top; // 0x340 (8)
	struct UButton BTN-WepaonAR; // 0x348 (8)
	struct UButton BTN-WepaonDMR; // 0x350 (8)
	struct UButton BTN-WepaonMelee; // 0x358 (8)
	struct UButton BTN-WepaonPistol; // 0x360 (8)
	struct UButton BTN-WepaonShotgun; // 0x368 (8)
	struct UButton BTN-WepaonSMG; // 0x370 (8)
	struct UButton BTN-WepaonSR; // 0x378 (8)
	struct UButton BTN-WepaonThrowing; // 0x380 (8)
	struct UButton Button_1; // 0x388 (8)
	struct UButton Button_2; // 0x390 (8)
	struct UButton Button_3; // 0x398 (8)
	struct UButton Button_4; // 0x3A0 (8)
	struct UImage Image_1; // 0x3A8 (8)
	struct UImage Image_2; // 0x3B0 (8)
	struct UImage Image_3; // 0x3B8 (8)
	struct UImage Image_4; // 0x3C0 (8)
	struct UImage IMG-Attach-Check01; // 0x3C8 (8)
	struct UImage IMG-Attach-Check02; // 0x3D0 (8)
	struct UImage IMG-Attach-Check03; // 0x3D8 (8)
	struct UImage IMG-Attach-Check04; // 0x3E0 (8)
	struct UImage IMG-Attach-Check05; // 0x3E8 (8)
	struct UImage IMG-Attach-Check06; // 0x3F0 (8)
	struct UImage IMG-Attachment-ALL; // 0x3F8 (8)
	struct UImage IMG-Check02; // 0x400 (8)
	struct UImage IMG-Check03; // 0x408 (8)
	struct UImage IMG-Check04; // 0x410 (8)
	struct UImage IMG-Check05; // 0x418 (8)
	struct UImage IMG-Check06; // 0x420 (8)
	struct UImage IMG-Check07; // 0x428 (8)
	struct UImage IMG-Check08; // 0x430 (8)
	struct UImage IMG-Check09; // 0x438 (8)
	struct UImage IMG-Check10; // 0x440 (8)
	struct UImage IMG-Check11; // 0x448 (8)
	struct UImage IMG-Consumable_Chest_Check; // 0x450 (8)
	struct UImage IMG-Consumable_Material_Check; // 0x458 (8)
	struct UImage IMG-Consumable_Recipe_Check; // 0x460 (8)
	struct UImage IMG-Consumable_Usable_Check; // 0x468 (8)
	struct UImage IMG-Custom-ALL; // 0x470 (8)
	struct UImage IMG-Custom-Face; // 0x478 (8)
	struct UImage IMG-Custom-Hair; // 0x480 (8)
	struct UImage IMG-Gear-All; // 0x488 (8)
	struct UImage IMG-Gear-Armor; // 0x490 (8)
	struct UImage IMG-Gear-Bag; // 0x498 (8)
	struct UImage IMG-Gear-Ghillie; // 0x4A0 (8)
	struct UImage IMG-Gear-Helmet; // 0x4A8 (8)
	struct UImage IMG-Wearable-Check01; // 0x4B0 (8)
	struct UImage IMG-Wearable-Check02; // 0x4B8 (8)
	struct UImage IMG-Wearable-Check03; // 0x4C0 (8)
	struct UImage IMG-Wearable-Check04; // 0x4C8 (8)
	struct UImage IMG-Wearable-Check05; // 0x4D0 (8)
	struct UImage IMG-Wearable-Check06; // 0x4D8 (8)
	struct UImage IMG-Wearable-Check09; // 0x4E0 (8)
	struct UImage IMG-Wearable-Check10; // 0x4E8 (8)
	struct UImage IMG-Wearable-Check12; // 0x4F0 (8)
	struct USizeBox SB-Attachment; // 0x4F8 (8)
	struct USizeBox SB-Consumable; // 0x500 (8)
	struct USizeBox SB-Custom; // 0x508 (8)
	struct USizeBox SB-Gear; // 0x510 (8)
	struct USizeBox SB-Perk; // 0x518 (8)
	struct USizeBox SB-Weapon; // 0x520 (8)
	struct USizeBox SB-Wearable; // 0x528 (8)
	struct UTextBlock TextBlock_2; // 0x530 (8)
	struct UTextBlock TextBlock_3; // 0x538 (8)
	struct UTextBlock TextBlock_4; // 0x540 (8)
	struct UTextBlock TextBlock_5; // 0x548 (8)
	struct UTextBlock TXT-Attachment-ALL; // 0x550 (8)
	struct UTextBlock TXT-Attachment-Barrel; // 0x558 (8)
	struct UTextBlock TXT-Attachment-Grip; // 0x560 (8)
	struct UTextBlock TXT-Attachment-Mag; // 0x568 (8)
	struct UTextBlock TXT-Attachment-Muzzle; // 0x570 (8)
	struct UTextBlock TXT-Attachment-Sight; // 0x578 (8)
	struct UTextBlock TXT-Attachment-Stock; // 0x580 (8)
	struct UTextBlock TXT-Consumable_Chest; // 0x588 (8)
	struct UTextBlock TXT-Consumable_Material; // 0x590 (8)
	struct UTextBlock TXT-Consumable_Recipe; // 0x598 (8)
	struct UTextBlock TXT-Consumable_Usable; // 0x5A0 (8)
	struct UTextBlock TXT-Custom-ALL; // 0x5A8 (8)
	struct UTextBlock TXT-Custom-Face; // 0x5B0 (8)
	struct UTextBlock TXT-Custom-Hair; // 0x5B8 (8)
	struct UTextBlock TXT-Gear-All; // 0x5C0 (8)
	struct UTextBlock TXT-Gear-Armor; // 0x5C8 (8)
	struct UTextBlock TXT-Gear-Bag; // 0x5D0 (8)
	struct UTextBlock TXT-Gear-Ghillie; // 0x5D8 (8)
	struct UTextBlock TXT-Gear-Helmet; // 0x5E0 (8)
	struct UTextBlock TXT-Wearable-ALL; // 0x5E8 (8)
	struct UTextBlock TXT-Wearable-Bottom; // 0x5F0 (8)
	struct UTextBlock TXT-Wearable-Eyewear; // 0x5F8 (8)
	struct UTextBlock TXT-Wearable-Gloves; // 0x600 (8)
	struct UTextBlock TXT-Wearable-Mask; // 0x608 (8)
	struct UTextBlock TXT-Wearable-Outer; // 0x610 (8)
	struct UTextBlock TXT-Wearable-Shoes; // 0x618 (8)
	struct UTextBlock TXT-Wearable-Top; // 0x620 (8)
	struct UTextBlock TXT-Wearable_Hat; // 0x628 (8)
	struct UTextBlock TXT-WepaonALL; // 0x630 (8)
	struct UTextBlock TXT-WepaonAmplifier; // 0x638 (8)
	struct UTextBlock TXT-WepaonAR; // 0x640 (8)
	struct UTextBlock TXT-WepaonDMR; // 0x648 (8)
	struct UTextBlock TXT-WepaonMelee; // 0x650 (8)
	struct UTextBlock TXT-WepaonPistol; // 0x658 (8)
	struct UTextBlock TXT-WepaonShotgun; // 0x660 (8)
	struct UTextBlock TXT-WepaonSMG; // 0x668 (8)
	struct UTextBlock TXT-WepaonSR; // 0x670 (8)
	struct UTextBlock TXT-WepaonThrowing; // 0x678 (8)
	struct UVerticalBox VerticalBox_Perk; // 0x680 (8)
	struct FSlateColor NormalSlateColor; // 0x688 (40)
	struct FSlateColor SelectedSlateColor; // 0x6B0 (40)
	struct UUW-BlackMarket_Main_C BlackMarketMainRef; // 0x6D8 (8)

	void SetConsumableData(enum class EItemType Type); // Function UW-BlackMarket_SubTab.UW-BlackMarket_SubTab_C.SetConsumableData(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	void DeselectConsumableButton(enum class EItemType Type); // Function UW-BlackMarket_SubTab.UW-BlackMarket_SubTab_C.DeselectConsumableButton(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	void SelectConsumableButton(enum class EItemType Type); // Function UW-BlackMarket_SubTab.UW-BlackMarket_SubTab_C.SelectConsumableButton(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	void CreatePerkTab(); // Function UW-BlackMarket_SubTab.UW-BlackMarket_SubTab_C.CreatePerkTab(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
