// WidgetBlueprintGeneratedClass UW-Inventory_ProximitySlot.UW-Inventory_ProximitySlot_C
class UUW-Inventory_ProximitySlot_C : public UUW-Inventory_SlotBase_C {

public:

	struct Unknown UberGraphFrame; // 0x1350 (8)
	struct Unknown P_Upgrade_Arrow; // 0x1358 (8)
	struct Unknown C_SlotHover_ItemState_Hide; // 0x1360 (8)
	struct Unknown C_SlotHover_ItemState_Show; // 0x1368 (8)
	struct Unknown Hover_Gold; // 0x1370 (8)
	struct Unknown P_SlotHover; // 0x1378 (8)
	struct Unknown BGImage; // 0x1380 (8)
	struct Unknown BGImage_2; // 0x1388 (8)
	struct Unknown CanvasPanel_ITemState; // 0x1390 (8)
	struct Unknown CanvasPanel_Unnecessary; // 0x1398 (8)
	struct Unknown Count; // 0x13A0 (8)
	struct Unknown Crate_Default; // 0x13A8 (8)
	struct Unknown Crate_Hover; // 0x13B0 (8)
	struct Unknown DurabilityBar; // 0x13B8 (8)
	struct Unknown fill; // 0x13C0 (8)
	struct Unknown HorizontalBox_Rarity; // 0x13C8 (8)
	struct Unknown HoverImage; // 0x13D0 (8)
	struct Unknown HoverImage_Gold; // 0x13D8 (8)
	struct Unknown HoverImage_Round; // 0x13E0 (8)
	struct Unknown Image_1; // 0x13E8 (8)
	struct Unknown Image_2; // 0x13F0 (8)
	struct Unknown Image_531; // 0x13F8 (8)
	struct Unknown Image_539; // 0x1400 (8)
	struct Unknown Image_540; // 0x1408 (8)
	struct Unknown Image_541; // 0x1410 (8)
	struct Unknown Image_542; // 0x1418 (8)
	struct Unknown Image_543; // 0x1420 (8)
	struct Unknown Image_544; // 0x1428 (8)
	struct Unknown Image_Bindable; // 0x1430 (8)
	struct Unknown Image_Supply; // 0x1438 (8)
	struct Unknown ItemImage; // 0x1440 (8)
	struct Unknown ItemNameName; // 0x1448 (8)
	struct Unknown ItemState_Text; // 0x1450 (8)
	struct Unknown KeepedItem_List; // 0x1458 (8)
	struct Unknown KeepedItem_ListHover; // 0x1460 (8)
	struct Unknown LvColor; // 0x1468 (8)
	struct Unknown NeedMaterial; // 0x1470 (8)
	struct Unknown SizeBox_1; // 0x1478 (8)
	struct Unknown TextBlock_Range; // 0x1480 (8)
	struct Unknown UpgradeItem; // 0x1488 (8)
	struct Unknown UpgradeItem_Arrow01; // 0x1490 (8)
	struct Unknown UpgradeItem_Arrow02; // 0x1498 (8)
	struct Unknown UpgradeItem_default; // 0x14A0 (8)
	struct Unknown UpgradeItem_Hover; // 0x14A8 (8)
	struct Unknown weapon__; // 0x14B0 (8)
	struct Unknown WeaponColorBg; // 0x14B8 (8)
	struct Unknown WeaponEquipItem_Default; // 0x14C0 (8)
	struct Unknown WeaponEquipItem_Hover; // 0x14C8 (8)
	struct Unknown WeaponItemImage; // 0x14D0 (8)
	struct Unknown WeaponType; // 0x14D8 (8)
	struct Unknown PickupRef; // 0x14E0 (8)
	struct Unknown DroppedItemInfo; // 0x14E8 (152)
	struct Unknown DropBoxRef; // 0x1580 (8)
	char bGold : 0; // 0x1588 (1)
	struct Unknown SelectedHoverImage; // 0x1590 (8)
	struct Unknown WeaponData; // 0x1598 (2848)
	struct Unknown MedicalBGColor; // 0x20B8 (16)
	int32_t CurCount; // 0x20C8 (4)
	struct FMulticastInlineDelegate SetSlotInfo; // 0x20D0 (16)
	struct Unknown TargetActor; // 0x20E0 (8)
	struct Unknown StealableCharacter; // 0x20E8 (8)
	struct TArray<Unknown> ShowRarityStar; // 0x20F0 (16)
	struct TArray<Unknown> ShowIconBG; // 0x2100 (16)

	void CheckHoverMaterial(); // Function UW-Inventory_ProximitySlot.UW-Inventory_ProximitySlot_C.CheckHoverMaterial(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	void IsRoundItemType(char& bRoundItem); // Function UW-Inventory_ProximitySlot.UW-Inventory_ProximitySlot_C.IsRoundItemType(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game_BE.exe+0x2B812B0>
	void SetNeededInfo(); // Function UW-Inventory_ProximitySlot.UW-Inventory_ProximitySlot_C.SetNeededInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	void InitTargetActor(); // Function UW-Inventory_ProximitySlot.UW-Inventory_ProximitySlot_C.InitTargetActor(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
