// WidgetBlueprintGeneratedClass UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C
class UUW-Inventory_WeaponSlot_C : public UUW-Inventory_SlotBase_C {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1358 (8)
	struct UWidgetAnimation Anim_LoopHintMainWeapon; // 0x1360 (8)
	struct UWidgetAnimation Anim_Material_Get; // 0x1368 (8)
	struct UWidgetAnimation Anim_Material_Hover; // 0x1370 (8)
	struct UWidgetAnimation Anim_Upgrade; // 0x1378 (8)
	struct UWidgetAnimation Anim_Progress; // 0x1380 (8)
	struct UWidgetAnimation WeaponPerk_fadeIn; // 0x1388 (8)
	struct UWidgetAnimation Anim_LoopNotifySubWeapon; // 0x1390 (8)
	struct UWidgetAnimation Anim_StartNotifySubWeapon; // 0x1398 (8)
	struct UWidgetAnimation Anim_LoopNotifyMainWeapon; // 0x13A0 (8)
	struct UWidgetAnimation Anim_StartNotifyMainWeapon; // 0x13A8 (8)
	struct UTextBlock Ammo01; // 0x13B0 (8)
	struct UTextBlock Ammo02; // 0x13B8 (8)
	struct UTextBlock AmmoInfo01; // 0x13C0 (8)
	struct UTextBlock AmmoInfo02; // 0x13C8 (8)
	struct UUW-Inventory_WeaponAttachmentSlot_C Barrel01; // 0x13D0 (8)
	struct UImage BG01; // 0x13D8 (8)
	struct UImage BG02; // 0x13E0 (8)
	struct UImage BorderImage02; // 0x13E8 (8)
	struct UButton btn_RecipeTree; // 0x13F0 (8)
	struct UUW-Inventory_WeaponAttachmentSlot_C ButtStockSlot01; // 0x13F8 (8)
	struct UUW-Inventory_WeaponAttachmentSlot_C ButtStockSlot02; // 0x1400 (8)
	struct UCanvasPanel Canvas_AnimMain; // 0x1408 (8)
	struct UCanvasPanel Canvas_AnimMain_Progress; // 0x1410 (8)
	struct UCanvasPanel Canvas_AnimMain_Upgrade; // 0x1418 (8)
	struct UCanvasPanel Canvas_AnimSub; // 0x1420 (8)
	struct UImage Choice_BG01; // 0x1428 (8)
	struct UImage Choice_BG02; // 0x1430 (8)
	struct UUW-Inventory_WeaponAttachmentSlot_C GripSlot01; // 0x1438 (8)
	struct UHorizontalBox HorizontalBox_Perk; // 0x1440 (8)
	struct UHorizontalBox HorizontalBox_Rarity1; // 0x1448 (8)
	struct UHorizontalBox HorizontalBox_Rarity2; // 0x1450 (8)
	struct UImage Image_2; // 0x1458 (8)
	struct UImage Image_3; // 0x1460 (8)
	struct UImage Image_5; // 0x1468 (8)
	struct UImage Image_7; // 0x1470 (8)
	struct UImage Image_48; // 0x1478 (8)
	struct UImage Image_85; // 0x1480 (8)
	struct UImage Image_86; // 0x1488 (8)
	struct UImage Image_175; // 0x1490 (8)
	struct UImage Image_202; // 0x1498 (8)
	struct UImage Image_212; // 0x14A0 (8)
	struct UImage Image_214; // 0x14A8 (8)
	struct UImage Image_217; // 0x14B0 (8)
	struct UImage Image_219; // 0x14B8 (8)
	struct UImage Image_234; // 0x14C0 (8)
	struct UImage Image_356; // 0x14C8 (8)
	struct UImage Image_369; // 0x14D0 (8)
	struct UImage Image_371; // 0x14D8 (8)
	struct UImage Image_372; // 0x14E0 (8)
	struct UImage Image_682; // 0x14E8 (8)
	struct UImage Image_805; // 0x14F0 (8)
	struct UImage Image_807; // 0x14F8 (8)
	struct UImage Image_808; // 0x1500 (8)
	struct UImage Image_809; // 0x1508 (8)
	struct UImage Image_1071; // 0x1510 (8)
	struct UImage Image_Bindable; // 0x1518 (8)
	struct UImage Image_Supply; // 0x1520 (8)
	struct UImage ImageAmmo01; // 0x1528 (8)
	struct UImage ImageAmmo02; // 0x1530 (8)
	struct USizeBox Info01; // 0x1538 (8)
	struct USizeBox Info02; // 0x1540 (8)
	struct UImage Line01; // 0x1548 (8)
	struct UImage Line02; // 0x1550 (8)
	struct UUW-Inventory_WeaponAttachmentSlot_C MagazineSlot01; // 0x1558 (8)
	struct UUW-Inventory_WeaponAttachmentSlot_C MagazineSlot02; // 0x1560 (8)
	struct USizeBox MainWeaponSlot; // 0x1568 (8)
	struct UUW-Inventory_WeaponAttachmentSlot_C MuzzleDeviceSlot01; // 0x1570 (8)
	struct UUW-Inventory_WeaponAttachmentSlot_C MuzzleDeviceSlot02; // 0x1578 (8)
	struct UOverlay Overlay_2; // 0x1580 (8)
	struct UUW-Inventory_WeaponAttachmentSlot_C Perk01; // 0x1588 (8)
	struct UUW-Inventory_WeaponAttachmentSlot_C Perk01_Sub; // 0x1590 (8)
	struct UUW-Inventory_WeaponAttachmentSlot_C Perk02; // 0x1598 (8)
	struct UUW-Inventory_WeaponAttachmentSlot_C Perk02_Sub; // 0x15A0 (8)
	struct UUW-Inventory_WeaponAttachmentSlot_C Perk03; // 0x15A8 (8)
	struct UUW-Inventory_WeaponAttachmentSlot_C Perk03_Sub; // 0x15B0 (8)
	struct UUW-Inventory_WeaponAttachmentSlot_C Perk04; // 0x15B8 (8)
	struct UUW-Inventory_WeaponAttachmentSlot_C Perk04_Sub; // 0x15C0 (8)
	struct UUW-Inventory_WeaponAttachmentSlot_C SightSlot01; // 0x15C8 (8)
	struct UUW-Inventory_WeaponAttachmentSlot_C SightSlot02; // 0x15D0 (8)
	struct USizeBox SubWeaponSlot; // 0x15D8 (8)
	struct UTextBlock TextBlock_1; // 0x15E0 (8)
	struct UTextBlock TextBlock_Range01; // 0x15E8 (8)
	struct UImage TopNameBG01; // 0x15F0 (8)
	struct UImage TopNameBG02; // 0x15F8 (8)
	struct UUW-Inventory_MaterialIconSlot_C UW-Inventory_MaterialIconSlot; // 0x1600 (8)
	struct UUW-Inventory_WeaponPerkSlot_C UW-Inventory_WeaponPerkSlot; // 0x1608 (8)
	struct UUW-Inventory_WeaponPerkSlot_C UW-Inventory_WeaponPerkSlot_C_2; // 0x1610 (8)
	struct UUW-Inventory_WeaponPerkSlot_C UW-Inventory_WeaponPerkSlot_C_3; // 0x1618 (8)
	struct UUW-StatupWidget_C UW-StatupWidget; // 0x1620 (8)
	struct UImage WeaponImage01; // 0x1628 (8)
	struct UImage WeaponImage02; // 0x1630 (8)
	struct UTextBlock WeaponIndex01; // 0x1638 (8)
	struct UTextBlock WeaponIndex02; // 0x1640 (8)
	struct UTextBlock WeaponName01; // 0x1648 (8)
	struct UTextBlock WeaponName02; // 0x1650 (8)
	struct UOverlay WeaponTitle01; // 0x1658 (8)
	struct UOverlay WeaponTitle02; // 0x1660 (8)
	struct UWidgetSwitcher WidgetSwitcher_1; // 0x1668 (8)
	struct UWidgetSwitcher WidgetSwitcher_Rarity; // 0x1670 (8)
	struct UWidgetSwitcher WidgetSwitcher_SpecialWeapon; // 0x1678 (8)
	enum class EWeaponType WeaponType; // 0x1680 (1)
	int32_t SlotIndex; // 0x1684 (4)
	struct ABravoHotelWeaponBase WeaponBase; // 0x1688 (8)
	char bCanEquip : 0; // 0x1690 (1)
	struct TMap<enum class EWeaponAttachmentType, struct UUW-Inventory_WeaponAttachmentSlot_C> WeaponAttachmentSlots01; // 0x1698 (80)
	struct TMap<enum class EWeaponAttachmentType, struct UUW-Inventory_WeaponAttachmentSlot_C> WeaponAttachmentSlots02; // 0x16E8 (80)
	float WeaponIconHeight; // 0x1738 (4)
	char bHover : 0; // 0x173C (1)
	struct UUW-Inventory_ItemSlotHover_C HoverWidget; // 0x1740 (8)
	int32_t NotifyAnimLoopNum; // 0x1748 (4)

	void IsEquipped(char& Return); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.IsEquipped(Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // <Game_BE.exe+0x2B80160>
	void CheckNeedEmptyPerkWeaponTooltip(char& NewParam); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.CheckNeedEmptyPerkWeaponTooltip(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // <Game_BE.exe+0x2B80160>
	void ShowStatupAnim(struct FStatupAnimParameters& StatParams); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.ShowStatupAnim(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void SetMaterialIcon(); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.SetMaterialIcon(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
