// WidgetBlueprintGeneratedClass UW-Inventory_ProximitySlot.UW-Inventory_ProximitySlot_C
class UUW-Inventory_ProximitySlot_C : public UUW-Inventory_SlotBase_C {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1360 (8)
	struct UWidgetAnimation P_Upgrade_Arrow; // 0x1368 (8)
	struct UWidgetAnimation C_SlotHover_ItemState_Hide; // 0x1370 (8)
	struct UWidgetAnimation C_SlotHover_ItemState_Show; // 0x1378 (8)
	struct UWidgetAnimation Hover_Gold; // 0x1380 (8)
	struct UWidgetAnimation P_SlotHover; // 0x1388 (8)
	struct UImage BGImage; // 0x1390 (8)
	struct UImage BGImage_2; // 0x1398 (8)
	struct UCanvasPanel CanvasPanel_ITemState; // 0x13A0 (8)
	struct UCanvasPanel CanvasPanel_Unnecessary; // 0x13A8 (8)
	struct UTextBlock Count; // 0x13B0 (8)
	struct UImage Crate_Default; // 0x13B8 (8)
	struct UImage Crate_Hover; // 0x13C0 (8)
	struct UProgressBar DurabilityBar; // 0x13C8 (8)
	struct UImage fill; // 0x13D0 (8)
	struct UHorizontalBox HorizontalBox_Rarity; // 0x13D8 (8)
	struct UImage HoverImage; // 0x13E0 (8)
	struct UImage HoverImage_Gold; // 0x13E8 (8)
	struct UImage HoverImage_Round; // 0x13F0 (8)
	struct UImage Image_1; // 0x13F8 (8)
	struct UImage Image_2; // 0x1400 (8)
	struct UImage Image_531; // 0x1408 (8)
	struct UImage Image_539; // 0x1410 (8)
	struct UImage Image_540; // 0x1418 (8)
	struct UImage Image_541; // 0x1420 (8)
	struct UImage Image_542; // 0x1428 (8)
	struct UImage Image_543; // 0x1430 (8)
	struct UImage Image_544; // 0x1438 (8)
	struct UImage Image_Bindable; // 0x1440 (8)
	struct UImage Image_Supply; // 0x1448 (8)
	struct UImage ItemImage; // 0x1450 (8)
	struct UTextBlock ItemNameName; // 0x1458 (8)
	struct UTextBlock ItemState_Text; // 0x1460 (8)
	struct UImage KeepedItem_List; // 0x1468 (8)
	struct UImage KeepedItem_ListHover; // 0x1470 (8)
	struct UImage LvColor; // 0x1478 (8)
	struct UImage NeedMaterial; // 0x1480 (8)
	struct USizeBox SizeBox_1; // 0x1488 (8)
	struct UTextBlock TextBlock_Range; // 0x1490 (8)
	struct UCanvasPanel UpgradeItem; // 0x1498 (8)
	struct UImage UpgradeItem_Arrow01; // 0x14A0 (8)
	struct UImage UpgradeItem_Arrow02; // 0x14A8 (8)
	struct UImage UpgradeItem_default; // 0x14B0 (8)
	struct UImage UpgradeItem_Hover; // 0x14B8 (8)
	struct UTextBlock weapon__; // 0x14C0 (8)
	struct UImage WeaponColorBg; // 0x14C8 (8)
	struct UImage WeaponEquipItem_Default; // 0x14D0 (8)
	struct UImage WeaponEquipItem_Hover; // 0x14D8 (8)
	struct UImage WeaponItemImage; // 0x14E0 (8)
	struct UTextBlock WeaponType; // 0x14E8 (8)
	struct ABravoHotelPickup PickupRef; // 0x14F0 (8)
	struct FInventoryItemInfo DroppedItemInfo; // 0x14F8 (152)
	struct ABravoHotelDropBoxActor DropBoxRef; // 0x1590 (8)
	char bGold : 0; // 0x1598 (1)
	struct UImage SelectedHoverImage; // 0x15A0 (8)
	struct FBravoHotelWeaponInfo WeaponData; // 0x15A8 (2864)
	struct FLinearColor MedicalBGColor; // 0x20D8 (16)
	int32_t CurCount; // 0x20E8 (4)
	struct FMulticastInlineDelegate SetSlotInfo; // 0x20F0 (16)
	struct UActor TargetActor; // 0x2100 (8)
	struct ABravoHotelCharacter StealableCharacter; // 0x2108 (8)
	struct TArray<struct FName> ShowRarityStar; // 0x2110 (16)
	struct TArray<struct FName> ShowIconBG; // 0x2120 (16)

	void CheckHoverMaterial(); // Function UW-Inventory_ProximitySlot.UW-Inventory_ProximitySlot_C.CheckHoverMaterial(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	void IsRoundItemType(char& bRoundItem); // Function UW-Inventory_ProximitySlot.UW-Inventory_ProximitySlot_C.IsRoundItemType(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	void SetNeededInfo(); // Function UW-Inventory_ProximitySlot.UW-Inventory_ProximitySlot_C.SetNeededInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	void InitTargetActor(); // Function UW-Inventory_ProximitySlot.UW-Inventory_ProximitySlot_C.InitTargetActor(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
