// WidgetBlueprintGeneratedClass UW-Inventory_CarriedSlot.UW-Inventory_CarriedSlot_C
class UUW-Inventory_CarriedSlot_C : public UUW-Inventory_SlotBase_C {

public:

	struct Unknown UberGraphFrame; // 0x1358 (8)
	struct Unknown Ani_Tutorial_Glow; // 0x1360 (8)
	struct Unknown C_Slot_Up_Arrow; // 0x1368 (8)
	struct Unknown C_SlotHover_ItemState_Hide; // 0x1370 (8)
	struct Unknown C_SlotHover_ItemState_Show; // 0x1378 (8)
	struct Unknown C_SlotHover; // 0x1380 (8)
	struct Unknown BGImage; // 0x1388 (8)
	struct Unknown BGImage_2; // 0x1390 (8)
	struct Unknown CanvasPanel_ITemState; // 0x1398 (8)
	struct Unknown Count120; // 0x13A0 (8)
	struct Unknown Crate_Default; // 0x13A8 (8)
	struct Unknown Crate_Hover; // 0x13B0 (8)
	struct Unknown Effect_Booster; // 0x13B8 (8)
	struct Unknown Effect_Capsule; // 0x13C0 (8)
	struct Unknown HorizontalBox_Rarity; // 0x13C8 (8)
	struct Unknown HoverImage; // 0x13D0 (8)
	struct Unknown HoverImage_Round; // 0x13D8 (8)
	struct Unknown Image_531; // 0x13E0 (8)
	struct Unknown Image_539; // 0x13E8 (8)
	struct Unknown Image_540; // 0x13F0 (8)
	struct Unknown Image_541; // 0x13F8 (8)
	struct Unknown Image_542; // 0x1400 (8)
	struct Unknown Image_543; // 0x1408 (8)
	struct Unknown Image_544; // 0x1410 (8)
	struct Unknown Image_Bindable; // 0x1418 (8)
	struct Unknown Image_Supply; // 0x1420 (8)
	struct Unknown ItemImage; // 0x1428 (8)
	struct Unknown ItemState_Text; // 0x1430 (8)
	struct Unknown KeepedItem_List; // 0x1438 (8)
	struct Unknown KeepedItem_ListHover; // 0x1440 (8)
	struct Unknown LvColor; // 0x1448 (8)
	struct Unknown Motion; // 0x1450 (8)
	struct Unknown ProgressBar_309; // 0x1458 (8)
	struct Unknown SizeBox_1; // 0x1460 (8)
	struct Unknown TextBlock_3; // 0x1468 (8)
	struct Unknown Tutorial_Glow; // 0x1470 (8)
	struct Unknown UW-MouseRightClick_Big; // 0x1478 (8)
	struct Unknown UW-MouseRightClick_Small; // 0x1480 (8)
	struct Unknown WeaponColorBg; // 0x1488 (8)
	struct Unknown WeaponEquipItem_Default; // 0x1490 (8)
	struct Unknown WeaponEquipItem_Hover; // 0x1498 (8)
	struct Unknown WeaponItemImage; // 0x14A0 (8)
	int32_t InventoryItemInfoIndex; // 0x14A8 (4)
	struct Unknown MedicalBGColor; // 0x14AC (16)
	int32_t CurCount; // 0x14BC (4)
	struct FMulticastInlineDelegate SetSlotInfo; // 0x14C0 (16)
	char CanUseCapsule : 0; // 0x14D0 (1)
	struct Unknown SelectedHoverImage; // 0x14D8 (8)
	struct TArray<Unknown> ShowRarityStar; // 0x14E0 (16)
	struct TArray<Unknown> ShowIconBG; // 0x14F0 (16)

	void CheckBoosterItem(char& IsBoost, struct Unknown& OutColor, struct Unknown& OutTexture); // Function UW-Inventory_CarriedSlot.UW-Inventory_CarriedSlot_C.CheckBoosterItem(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void SetBoosterItem(); // Function UW-Inventory_CarriedSlot.UW-Inventory_CarriedSlot_C.SetBoosterItem(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void IsDraging(char& bResult); // Function UW-Inventory_CarriedSlot.UW-Inventory_CarriedSlot_C.IsDraging(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game_BE.exe+0x2B80160>
	void IsRoundItemType(char& bRoundItem); // Function UW-Inventory_CarriedSlot.UW-Inventory_CarriedSlot_C.IsRoundItemType(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game_BE.exe+0x2B80160>
