// WidgetBlueprintGeneratedClass UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C
class UUW-Inventory_WeaponSlot_C : public UUW-Inventory_SlotBase_C {

public:

	struct Unknown UberGraphFrame; // 0x1360 (8)
	struct Unknown Anim_LoopHintMainWeapon; // 0x1368 (8)
	struct Unknown Anim_Material_Get; // 0x1370 (8)
	struct Unknown Anim_Material_Hover; // 0x1378 (8)
	struct Unknown Anim_Upgrade; // 0x1380 (8)
	struct Unknown Anim_Progress; // 0x1388 (8)
	struct Unknown WeaponPerk_fadeIn; // 0x1390 (8)
	struct Unknown Anim_LoopNotifySubWeapon; // 0x1398 (8)
	struct Unknown Anim_StartNotifySubWeapon; // 0x13A0 (8)
	struct Unknown Anim_LoopNotifyMainWeapon; // 0x13A8 (8)
	struct Unknown Anim_StartNotifyMainWeapon; // 0x13B0 (8)
	struct Unknown Ammo01; // 0x13B8 (8)
	struct Unknown Ammo02; // 0x13C0 (8)
	struct Unknown AmmoInfo01; // 0x13C8 (8)
	struct Unknown AmmoInfo02; // 0x13D0 (8)
	struct Unknown Barrel01; // 0x13D8 (8)
	struct Unknown BG01; // 0x13E0 (8)
	struct Unknown BG02; // 0x13E8 (8)
	struct Unknown BorderImage02; // 0x13F0 (8)
	struct Unknown btn_RecipeTree; // 0x13F8 (8)
	struct Unknown ButtStockSlot01; // 0x1400 (8)
	struct Unknown ButtStockSlot02; // 0x1408 (8)
	struct Unknown Canvas_AnimMain; // 0x1410 (8)
	struct Unknown Canvas_AnimMain_Progress; // 0x1418 (8)
	struct Unknown Canvas_AnimMain_Upgrade; // 0x1420 (8)
	struct Unknown Canvas_AnimSub; // 0x1428 (8)
	struct Unknown Choice_BG01; // 0x1430 (8)
	struct Unknown Choice_BG02; // 0x1438 (8)
	struct Unknown GripSlot01; // 0x1440 (8)
	struct Unknown HorizontalBox_Perk; // 0x1448 (8)
	struct Unknown HorizontalBox_Rarity1; // 0x1450 (8)
	struct Unknown HorizontalBox_Rarity2; // 0x1458 (8)
	struct Unknown Image_2; // 0x1460 (8)
	struct Unknown Image_3; // 0x1468 (8)
	struct Unknown Image_5; // 0x1470 (8)
	struct Unknown Image_7; // 0x1478 (8)
	struct Unknown Image_48; // 0x1480 (8)
	struct Unknown Image_85; // 0x1488 (8)
	struct Unknown Image_86; // 0x1490 (8)
	struct Unknown Image_175; // 0x1498 (8)
	struct Unknown Image_202; // 0x14A0 (8)
	struct Unknown Image_212; // 0x14A8 (8)
	struct Unknown Image_214; // 0x14B0 (8)
	struct Unknown Image_217; // 0x14B8 (8)
	struct Unknown Image_219; // 0x14C0 (8)
	struct Unknown Image_234; // 0x14C8 (8)
	struct Unknown Image_356; // 0x14D0 (8)
	struct Unknown Image_369; // 0x14D8 (8)
	struct Unknown Image_371; // 0x14E0 (8)
	struct Unknown Image_372; // 0x14E8 (8)
	struct Unknown Image_682; // 0x14F0 (8)
	struct Unknown Image_805; // 0x14F8 (8)
	struct Unknown Image_807; // 0x1500 (8)
	struct Unknown Image_808; // 0x1508 (8)
	struct Unknown Image_809; // 0x1510 (8)
	struct Unknown Image_1071; // 0x1518 (8)
	struct Unknown Image_Bindable; // 0x1520 (8)
	struct Unknown Image_Supply; // 0x1528 (8)
	struct Unknown ImageAmmo01; // 0x1530 (8)
	struct Unknown ImageAmmo02; // 0x1538 (8)
	struct Unknown Info01; // 0x1540 (8)
	struct Unknown Info02; // 0x1548 (8)
	struct Unknown Line01; // 0x1550 (8)
	struct Unknown Line02; // 0x1558 (8)
	struct Unknown MagazineSlot01; // 0x1560 (8)
	struct Unknown MagazineSlot02; // 0x1568 (8)
	struct Unknown MainWeaponSlot; // 0x1570 (8)
	struct Unknown MuzzleDeviceSlot01; // 0x1578 (8)
	struct Unknown MuzzleDeviceSlot02; // 0x1580 (8)
	struct Unknown Overlay_2; // 0x1588 (8)
	struct Unknown Perk01; // 0x1590 (8)
	struct Unknown Perk01_Sub; // 0x1598 (8)
	struct Unknown Perk02; // 0x15A0 (8)
	struct Unknown Perk02_Sub; // 0x15A8 (8)
	struct Unknown Perk03; // 0x15B0 (8)
	struct Unknown Perk03_Sub; // 0x15B8 (8)
	struct Unknown Perk04; // 0x15C0 (8)
	struct Unknown Perk04_Sub; // 0x15C8 (8)
	struct Unknown SightSlot01; // 0x15D0 (8)
	struct Unknown SightSlot02; // 0x15D8 (8)
	struct Unknown SubWeaponSlot; // 0x15E0 (8)
	struct Unknown TextBlock_1; // 0x15E8 (8)
	struct Unknown TextBlock_Range01; // 0x15F0 (8)
	struct Unknown TopNameBG01; // 0x15F8 (8)
	struct Unknown TopNameBG02; // 0x1600 (8)
	struct Unknown UW-Inventory_MaterialIconSlot; // 0x1608 (8)
	struct Unknown UW-Inventory_WeaponPerkSlot; // 0x1610 (8)
	struct Unknown UW-Inventory_WeaponPerkSlot_C_2; // 0x1618 (8)
	struct Unknown UW-Inventory_WeaponPerkSlot_C_3; // 0x1620 (8)
	struct Unknown UW-StatupWidget; // 0x1628 (8)
	struct Unknown WeaponImage01; // 0x1630 (8)
	struct Unknown WeaponImage02; // 0x1638 (8)
	struct Unknown WeaponIndex01; // 0x1640 (8)
	struct Unknown WeaponIndex02; // 0x1648 (8)
	struct Unknown WeaponName01; // 0x1650 (8)
	struct Unknown WeaponName02; // 0x1658 (8)
	struct Unknown WeaponTitle01; // 0x1660 (8)
	struct Unknown WeaponTitle02; // 0x1668 (8)
	struct Unknown WidgetSwitcher_1; // 0x1670 (8)
	struct Unknown WidgetSwitcher_Rarity; // 0x1678 (8)
	struct Unknown WidgetSwitcher_SpecialWeapon; // 0x1680 (8)
	enum class Unknow WeaponType; // 0x1688 (1)
	int32_t SlotIndex; // 0x168C (4)
	struct Unknown WeaponBase; // 0x1690 (8)
	char bCanEquip : 0; // 0x1698 (1)
	struct TMap<Unknown, Unknown> WeaponAttachmentSlots01; // 0x16A0 (80)
	struct TMap<Unknown, Unknown> WeaponAttachmentSlots02; // 0x16F0 (80)
	float WeaponIconHeight; // 0x1740 (4)
	char bHover : 0; // 0x1744 (1)
	struct Unknown HoverWidget; // 0x1748 (8)
	int32_t NotifyAnimLoopNum; // 0x1750 (4)

	void IsEquipped(char& Return); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.IsEquipped(Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6E050>
	void CheckNeedEmptyPerkWeaponTooltip(char& NewParam); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.CheckNeedEmptyPerkWeaponTooltip(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6E050>
	void ShowStatupAnim(struct Unknown& StatParams); // Function UW-Inventory_WeaponSlot.UW-Inventory_WeaponSlot_C.ShowStatupAnim(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6E050>
