// WidgetBlueprintGeneratedClass UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C
class UUW-Inventory_ItemSlotHover_C : public UBravoHotelInventoryHoverWidget {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x280 (8)
	struct UWidgetAnimation UpArrow; // 0x288 (8)
	struct UWidgetAnimation FadeIn; // 0x290 (8)
	struct UImage Ammo_Compare; // 0x298 (8)
	struct UTextBlock Ammo_Value; // 0x2A0 (8)
	struct UImage AmmoIcon; // 0x2A8 (8)
	struct UTextBlock AmmoInfo; // 0x2B0 (8)
	struct UImage Arrow_01; // 0x2B8 (8)
	struct UImage Arrow_02; // 0x2C0 (8)
	struct UWrapBox BuffList; // 0x2C8 (8)
	struct UWrapBox BuffList_2; // 0x2D0 (8)
	struct UImage EffectiveRange_Compare; // 0x2D8 (8)
	struct UTextBlock EffectiveRange_Value; // 0x2E0 (8)
	struct UImage FiringRate_Compare; // 0x2E8 (8)
	struct UTextBlock FiringRate_Value; // 0x2F0 (8)
	struct UHorizontalBox HorizontalBox_ItemRarity; // 0x2F8 (8)
	struct UHorizontalBox HorizontalBox_MaterialRarity; // 0x300 (8)
	struct UHorizontalBox HorizontalBox_WeaponRarity; // 0x308 (8)
	struct UImage Image; // 0x310 (8)
	struct UImage Image_2; // 0x318 (8)
	struct UImage Image_3; // 0x320 (8)
	struct UImage Image_8; // 0x328 (8)
	struct UImage Image_9; // 0x330 (8)
	struct UImage Image_10; // 0x338 (8)
	struct UImage Image_11; // 0x340 (8)
	struct UImage Image_12; // 0x348 (8)
	struct UImage Image_13; // 0x350 (8)
	struct UImage Image_14; // 0x358 (8)
	struct UImage Image_15; // 0x360 (8)
	struct UImage Image_16; // 0x368 (8)
	struct UImage Image_20; // 0x370 (8)
	struct UImage Image_22; // 0x378 (8)
	struct UImage Image_23; // 0x380 (8)
	struct UImage Image_24; // 0x388 (8)
	struct UImage Image_25; // 0x390 (8)
	struct UImage Image_26; // 0x398 (8)
	struct UImage Image_27; // 0x3A0 (8)
	struct UImage Image_28; // 0x3A8 (8)
	struct UImage Image_29; // 0x3B0 (8)
	struct UImage Image_30; // 0x3B8 (8)
	struct UImage Image_31; // 0x3C0 (8)
	struct UImage Image_32; // 0x3C8 (8)
	struct UImage Image_310; // 0x3D0 (8)
	struct UImage Image_557; // 0x3D8 (8)
	struct UImage Image_WeaponLock; // 0x3E0 (8)
	struct UImage Img_MaterialBG; // 0x3E8 (8)
	struct UImage IMG_MaterialIcon; // 0x3F0 (8)
	struct UImage IMG_Stat; // 0x3F8 (8)
	struct UImage ItemBg; // 0x400 (8)
	struct UImage ItemBg_01; // 0x408 (8)
	struct UImage ItemBg_02; // 0x410 (8)
	struct UImage ItemSlot-BG; // 0x418 (8)
	struct UTextBlock ItemSlot-Capacity; // 0x420 (8)
	struct UTextBlock ItemSlot-Capacity_2; // 0x428 (8)
	struct UTextBlock ItemSlot-Description; // 0x430 (8)
	struct UTextBlock ItemSlot-Description_2; // 0x438 (8)
	struct UImage ItemSlot-ItemImage; // 0x440 (8)
	struct UTextBlock ItemSlot-ItemName; // 0x448 (8)
	struct UTextBlock ItemSlot-ItemType; // 0x450 (8)
	struct UImage ItemSlot-ItemTypeMark; // 0x458 (8)
	struct UCanvasPanel ItemSlotHover; // 0x460 (8)
	struct UImage PerkBG; // 0x468 (8)
	struct UImage PerkImage; // 0x470 (8)
	struct UTextBlock PerkLevelText; // 0x478 (8)
	struct UTextBlock PerkName; // 0x480 (8)
	struct UCanvasPanel PerkSlotHover; // 0x488 (8)
	struct UImage PopupHover-BG_2; // 0x490 (8)
	struct UImage Power_Compare; // 0x498 (8)
	struct UTextBlock Power_Value; // 0x4A0 (8)
	struct USizeBox SizeBox; // 0x4A8 (8)
	struct USizeBox SizeBox_7; // 0x4B0 (8)
	struct USizeBox SizeBox_ComparingText; // 0x4B8 (8)
	struct USizeBox SizeBox_ItemDivide; // 0x4C0 (8)
	struct UImage Stability_Compare; // 0x4C8 (8)
	struct UTextBlock Stability_Value; // 0x4D0 (8)
	struct UCanvasPanel StatSlotHover; // 0x4D8 (8)
	struct UTextBlock T_BindPlayerName; // 0x4E0 (8)
	struct UTextBlock T_Material; // 0x4E8 (8)
	struct UTextBlock T_MaterialDesc; // 0x4F0 (8)
	struct UTextBlock T_PerkDescLv1; // 0x4F8 (8)
	struct UTextBlock T_PerkDescLv2; // 0x500 (8)
	struct UTextBlock T_PerkDescLv3; // 0x508 (8)
	struct UTextBlock T_Stat; // 0x510 (8)
	struct UTextBlock T_StatDesc; // 0x518 (8)
	struct URichTextBlock T_TooltipDesc; // 0x520 (8)
	struct UTextBlock T_UltimateDesc; // 0x528 (8)
	struct UTextBlock T_UnlockUltimateLevel; // 0x530 (8)
	struct UTextBlock Text_CombineTarget; // 0x538 (8)
	struct UTextBlock TextBlock_3; // 0x540 (8)
	struct UTextBlock TextBlock_4; // 0x548 (8)
	struct UTextBlock TextBlock_5; // 0x550 (8)
	struct UTextBlock TextBlock_6; // 0x558 (8)
	struct UCanvasPanel UpArrowAni; // 0x560 (8)
	struct UUW-Inventory_ItemSlotHover_WeaponSlot_C UW-Inventory_ItemSlotHover_WeaponSlot; // 0x568 (8)
	struct UUW-Inventory_ItemSlotHover_WeaponSlot_C UW-Inventory_ItemSlotHover_WeaponSlot_2; // 0x570 (8)
	struct UUW-Inventory_ItemSlotHover_WeaponSlot_C UW-Inventory_ItemSlotHover_WeaponSlot_C; // 0x578 (8)
	struct UUW-Inventory_ItemSlotHover_WeaponSlot_C UW-Inventory_ItemSlotHover_WeaponSlot_C_2; // 0x580 (8)
	struct UUW-Inventory_ItemSlotHover_WeaponSlot_C UW-Inventory_ItemSlotHover_WeaponSlot_C_3; // 0x588 (8)
	struct UUW-Inventory_ItemSlotHover_WeaponSlot_C UW-Inventory_ItemSlotHover_WeaponSlot_C_4; // 0x590 (8)
	struct UVerticalBox VerticalBox_3; // 0x598 (8)
	struct UVerticalBox VerticalBox_BuffList; // 0x5A0 (8)
	struct UVerticalBox VerticalBox_BuffList_2; // 0x5A8 (8)
	struct UVerticalBox VerticalBox_CombineTarget; // 0x5B0 (8)
	struct UVerticalBox VerticalBox_Divide; // 0x5B8 (8)
	struct UVerticalBox VerticalBox_ItemDivide; // 0x5C0 (8)
	struct UVerticalBox VerticalBox_WeaponBindedInfo; // 0x5C8 (8)
	struct UTextBlock WeaponItemCapacity; // 0x5D0 (8)
	struct UTextBlock WeaponItemComparingName; // 0x5D8 (8)
	struct UTextBlock WeaponItemDescription; // 0x5E0 (8)
	struct UImage WeaponItemImage; // 0x5E8 (8)
	struct UImage WeaponItemSlot-BG; // 0x5F0 (8)
	struct UCanvasPanel WeaponItemSlotHover; // 0x5F8 (8)
	struct UTextBlock WeaponItemType; // 0x600 (8)
	struct UImage WeaponLockImage; // 0x608 (8)
	struct UTextBlock WeaponName; // 0x610 (8)
	struct UWidgetSwitcher WidgetSwitcher; // 0x618 (8)
	struct UWidgetSwitcher WidgetSwitcher_1; // 0x620 (8)
	struct UWidgetSwitcher WidgetSwitcher_2; // 0x628 (8)
	struct UWidgetSwitcher WidgetSwitcher_3; // 0x630 (8)
	struct UWidgetSwitcher WidgetSwitcher_4; // 0x638 (8)
	struct UWidgetSwitcher WidgetSwitcher_Main; // 0x640 (8)
	struct UWidgetSwitcher WidgetSwitcher_PerkUltimate; // 0x648 (8)
	struct FInventoryItemInfo ItemInfo; // 0x650 (152)
	struct FBravoHotelWeaponInfo WeaponInfo; // 0x6E8 (2864)
	char bCompare : 0; // 0x1218 (1)
	struct FSlateColor NormalSlateColor; // 0x1220 (40)
	struct FSlateColor UpSlateColor; // 0x1248 (40)
	struct FSlateColor DownSlateColor; // 0x1270 (40)
	struct FLinearColor UpLinearColor; // 0x1298 (16)
	struct FLinearColor DownLinearColor; // 0x12A8 (16)
	struct ABravoHotelWeaponBase WeaponObjectRef; // 0x12B8 (8)
	struct FInventoryItemDetailInfo ItemDetailInfo; // 0x12C0 (1168)
	struct FPerkUIInfo PerkInfo; // 0x1750 (44)
	struct FPerkData PerkData; // 0x1780 (224)
	struct FName Ammo; // 0x1860 (8)
	enum class ItemWidgetDragType DragType; // 0x1868 (1)
	struct UWidget HoveredWidget; // 0x1870 (8)
	struct UUserWidget CurrentShowingWidgetRef; // 0x1878 (8)
	char IsUltimatePerk : 0; // 0x1880 (1)
	struct FText UltimateName; // 0x1888 (24)
	struct FLinearColor UltimateLinearColor; // 0x18A0 (16)
	struct TSoftObjectPtr<Object> UltimateImage; // 0x18B0 (40)
	struct FTimerHandle HoverTimerHandle; // 0x18D8 (8)
	char NeedCheckVisibility : 0; // 0x18E0 (1)
	char IsVisualMode : 0; // 0x18E1 (1)
	char IsRandomPerk : 0; // 0x18E2 (1)
	struct TArray<struct UImage> ItemRarityImages; // 0x18E8 (16)
	struct TArray<struct UImage> WeaponRarityImages; // 0x18F8 (16)

	float GetDisplayAccuracy(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetDisplayAccuracy(Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	float GetDisplayDamage(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetDisplayDamage(Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	int32_t GetDisplayEffectiveRange(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetDisplayEffectiveRange(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
