// WidgetBlueprintGeneratedClass UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C
class UUW-Inventory_ItemSlotHover_C : public UBravoHotelInventoryHoverWidget {

public:

	struct Unknown UberGraphFrame; // 0x280 (8)
	struct Unknown UpArrow; // 0x288 (8)
	struct Unknown FadeIn; // 0x290 (8)
	struct Unknown Ammo_Compare; // 0x298 (8)
	struct Unknown Ammo_Value; // 0x2A0 (8)
	struct Unknown AmmoIcon; // 0x2A8 (8)
	struct Unknown AmmoInfo; // 0x2B0 (8)
	struct Unknown Arrow_01; // 0x2B8 (8)
	struct Unknown Arrow_02; // 0x2C0 (8)
	struct Unknown BuffList; // 0x2C8 (8)
	struct Unknown BuffList_2; // 0x2D0 (8)
	struct Unknown EffectiveRange_Compare; // 0x2D8 (8)
	struct Unknown EffectiveRange_Value; // 0x2E0 (8)
	struct Unknown FiringRate_Compare; // 0x2E8 (8)
	struct Unknown FiringRate_Value; // 0x2F0 (8)
	struct Unknown HorizontalBox_ItemRarity; // 0x2F8 (8)
	struct Unknown HorizontalBox_MaterialRarity; // 0x300 (8)
	struct Unknown HorizontalBox_WeaponRarity; // 0x308 (8)
	struct Unknown Image; // 0x310 (8)
	struct Unknown Image_2; // 0x318 (8)
	struct Unknown Image_3; // 0x320 (8)
	struct Unknown Image_8; // 0x328 (8)
	struct Unknown Image_9; // 0x330 (8)
	struct Unknown Image_10; // 0x338 (8)
	struct Unknown Image_11; // 0x340 (8)
	struct Unknown Image_12; // 0x348 (8)
	struct Unknown Image_13; // 0x350 (8)
	struct Unknown Image_14; // 0x358 (8)
	struct Unknown Image_15; // 0x360 (8)
	struct Unknown Image_16; // 0x368 (8)
	struct Unknown Image_20; // 0x370 (8)
	struct Unknown Image_22; // 0x378 (8)
	struct Unknown Image_23; // 0x380 (8)
	struct Unknown Image_24; // 0x388 (8)
	struct Unknown Image_25; // 0x390 (8)
	struct Unknown Image_26; // 0x398 (8)
	struct Unknown Image_27; // 0x3A0 (8)
	struct Unknown Image_28; // 0x3A8 (8)
	struct Unknown Image_29; // 0x3B0 (8)
	struct Unknown Image_30; // 0x3B8 (8)
	struct Unknown Image_31; // 0x3C0 (8)
	struct Unknown Image_32; // 0x3C8 (8)
	struct Unknown Image_310; // 0x3D0 (8)
	struct Unknown Image_557; // 0x3D8 (8)
	struct Unknown Image_WeaponLock; // 0x3E0 (8)
	struct Unknown Img_MaterialBG; // 0x3E8 (8)
	struct Unknown IMG_MaterialIcon; // 0x3F0 (8)
	struct Unknown IMG_Stat; // 0x3F8 (8)
	struct Unknown ItemBg; // 0x400 (8)
	struct Unknown ItemBg_01; // 0x408 (8)
	struct Unknown ItemBg_02; // 0x410 (8)
	struct Unknown ItemSlot-BG; // 0x418 (8)
	struct Unknown ItemSlot-Capacity; // 0x420 (8)
	struct Unknown ItemSlot-Capacity_2; // 0x428 (8)
	struct Unknown ItemSlot-Description; // 0x430 (8)
	struct Unknown ItemSlot-Description_2; // 0x438 (8)
	struct Unknown ItemSlot-ItemImage; // 0x440 (8)
	struct Unknown ItemSlot-ItemName; // 0x448 (8)
	struct Unknown ItemSlot-ItemType; // 0x450 (8)
	struct Unknown ItemSlot-ItemTypeMark; // 0x458 (8)
	struct Unknown ItemSlotHover; // 0x460 (8)
	struct Unknown PerkBG; // 0x468 (8)
	struct Unknown PerkImage; // 0x470 (8)
	struct Unknown PerkLevelText; // 0x478 (8)
	struct Unknown PerkName; // 0x480 (8)
	struct Unknown PerkSlotHover; // 0x488 (8)
	struct Unknown PopupHover-BG_2; // 0x490 (8)
	struct Unknown Power_Compare; // 0x498 (8)
	struct Unknown Power_Value; // 0x4A0 (8)
	struct Unknown SizeBox; // 0x4A8 (8)
	struct Unknown SizeBox_7; // 0x4B0 (8)
	struct Unknown SizeBox_ComparingText; // 0x4B8 (8)
	struct Unknown SizeBox_ItemDivide; // 0x4C0 (8)
	struct Unknown Stability_Compare; // 0x4C8 (8)
	struct Unknown Stability_Value; // 0x4D0 (8)
	struct Unknown StatSlotHover; // 0x4D8 (8)
	struct Unknown T_BindPlayerName; // 0x4E0 (8)
	struct Unknown T_Material; // 0x4E8 (8)
	struct Unknown T_MaterialDesc; // 0x4F0 (8)
	struct Unknown T_PerkDescLv1; // 0x4F8 (8)
	struct Unknown T_PerkDescLv2; // 0x500 (8)
	struct Unknown T_PerkDescLv3; // 0x508 (8)
	struct Unknown T_Stat; // 0x510 (8)
	struct Unknown T_StatDesc; // 0x518 (8)
	struct Unknown T_TooltipDesc; // 0x520 (8)
	struct Unknown T_UltimateDesc; // 0x528 (8)
	struct Unknown T_UnlockUltimateLevel; // 0x530 (8)
	struct Unknown Text_CombineTarget; // 0x538 (8)
	struct Unknown TextBlock_3; // 0x540 (8)
	struct Unknown TextBlock_4; // 0x548 (8)
	struct Unknown TextBlock_5; // 0x550 (8)
	struct Unknown TextBlock_6; // 0x558 (8)
	struct Unknown UpArrowAni; // 0x560 (8)
	struct Unknown UW-Inventory_ItemSlotHover_WeaponSlot; // 0x568 (8)
	struct Unknown UW-Inventory_ItemSlotHover_WeaponSlot_2; // 0x570 (8)
	struct Unknown UW-Inventory_ItemSlotHover_WeaponSlot_C; // 0x578 (8)
	struct Unknown UW-Inventory_ItemSlotHover_WeaponSlot_C_2; // 0x580 (8)
	struct Unknown UW-Inventory_ItemSlotHover_WeaponSlot_C_3; // 0x588 (8)
	struct Unknown UW-Inventory_ItemSlotHover_WeaponSlot_C_4; // 0x590 (8)
	struct Unknown VerticalBox_3; // 0x598 (8)
	struct Unknown VerticalBox_BuffList; // 0x5A0 (8)
	struct Unknown VerticalBox_BuffList_2; // 0x5A8 (8)
	struct Unknown VerticalBox_CombineTarget; // 0x5B0 (8)
	struct Unknown VerticalBox_Divide; // 0x5B8 (8)
	struct Unknown VerticalBox_ItemDivide; // 0x5C0 (8)
	struct Unknown VerticalBox_WeaponBindedInfo; // 0x5C8 (8)
	struct Unknown WeaponItemCapacity; // 0x5D0 (8)
	struct Unknown WeaponItemComparingName; // 0x5D8 (8)
	struct Unknown WeaponItemDescription; // 0x5E0 (8)
	struct Unknown WeaponItemImage; // 0x5E8 (8)
	struct Unknown WeaponItemSlot-BG; // 0x5F0 (8)
	struct Unknown WeaponItemSlotHover; // 0x5F8 (8)
	struct Unknown WeaponItemType; // 0x600 (8)
	struct Unknown WeaponLockImage; // 0x608 (8)
	struct Unknown WeaponName; // 0x610 (8)
	struct Unknown WidgetSwitcher; // 0x618 (8)
	struct Unknown WidgetSwitcher_1; // 0x620 (8)
	struct Unknown WidgetSwitcher_2; // 0x628 (8)
	struct Unknown WidgetSwitcher_3; // 0x630 (8)
	struct Unknown WidgetSwitcher_4; // 0x638 (8)
	struct Unknown WidgetSwitcher_Main; // 0x640 (8)
	struct Unknown WidgetSwitcher_PerkUltimate; // 0x648 (8)
	struct Unknown ItemInfo; // 0x650 (152)
	struct Unknown WeaponInfo; // 0x6E8 (2848)
	char bCompare : 0; // 0x1208 (1)
	struct Unknown NormalSlateColor; // 0x1210 (40)
	struct Unknown UpSlateColor; // 0x1238 (40)
	struct Unknown DownSlateColor; // 0x1260 (40)
	struct Unknown UpLinearColor; // 0x1288 (16)
	struct Unknown DownLinearColor; // 0x1298 (16)
	struct Unknown WeaponObjectRef; // 0x12A8 (8)
	struct Unknown ItemDetailInfo; // 0x12B0 (1168)
	struct Unknown PerkInfo; // 0x1740 (44)
	struct Unknown PerkData; // 0x1770 (224)
	struct FName Ammo; // 0x1850 (8)
	enum class Unknow DragType; // 0x1858 (1)
	struct Unknown HoveredWidget; // 0x1860 (8)
	struct Unknown CurrentShowingWidgetRef; // 0x1868 (8)
	char IsUltimatePerk : 0; // 0x1870 (1)
	struct FText UltimateName; // 0x1878 (24)
	struct Unknown UltimateLinearColor; // 0x1890 (16)
	struct Unknown UltimateImage; // 0x18A0 (40)
	struct Unknown HoverTimerHandle; // 0x18C8 (8)
	char NeedCheckVisibility : 0; // 0x18D0 (1)
	char IsVisualMode : 0; // 0x18D1 (1)
	char IsRandomPerk : 0; // 0x18D2 (1)
	struct TArray<Unknown> ItemRarityImages; // 0x18D8 (16)
	struct TArray<Unknown> WeaponRarityImages; // 0x18E8 (16)

	float GetDisplayAccuracy(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetDisplayAccuracy(Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	float GetDisplayDamage(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetDisplayDamage(Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	int32_t GetDisplayEffectiveRange(); // Function UW-Inventory_ItemSlotHover.UW-Inventory_ItemSlotHover_C.GetDisplayEffectiveRange(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
