// WidgetBlueprintGeneratedClass UW-Inventory_CarriedSlot.UW-Inventory_CarriedSlot_C
class UUW-Inventory_CarriedSlot_C : public UUW-Inventory_SlotBase_C {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1358 (8)
	struct UWidgetAnimation Ani_Tutorial_Glow; // 0x1360 (8)
	struct UWidgetAnimation C_Slot_Up_Arrow; // 0x1368 (8)
	struct UWidgetAnimation C_SlotHover_ItemState_Hide; // 0x1370 (8)
	struct UWidgetAnimation C_SlotHover_ItemState_Show; // 0x1378 (8)
	struct UWidgetAnimation C_SlotHover; // 0x1380 (8)
	struct UImage BGImage; // 0x1388 (8)
	struct UImage BGImage_2; // 0x1390 (8)
	struct UCanvasPanel CanvasPanel_ITemState; // 0x1398 (8)
	struct UTextBlock Count120; // 0x13A0 (8)
	struct UImage Crate_Default; // 0x13A8 (8)
	struct UImage Crate_Hover; // 0x13B0 (8)
	struct UImage Effect_Booster; // 0x13B8 (8)
	struct UImage Effect_Capsule; // 0x13C0 (8)
	struct UHorizontalBox HorizontalBox_Rarity; // 0x13C8 (8)
	struct UImage HoverImage; // 0x13D0 (8)
	struct UImage HoverImage_Round; // 0x13D8 (8)
	struct UImage Image_531; // 0x13E0 (8)
	struct UImage Image_539; // 0x13E8 (8)
	struct UImage Image_540; // 0x13F0 (8)
	struct UImage Image_541; // 0x13F8 (8)
	struct UImage Image_542; // 0x1400 (8)
	struct UImage Image_543; // 0x1408 (8)
	struct UImage Image_544; // 0x1410 (8)
	struct UImage Image_Bindable; // 0x1418 (8)
	struct UImage Image_Supply; // 0x1420 (8)
	struct UImage ItemImage; // 0x1428 (8)
	struct UTextBlock ItemState_Text; // 0x1430 (8)
	struct UImage KeepedItem_List; // 0x1438 (8)
	struct UImage KeepedItem_ListHover; // 0x1440 (8)
	struct UImage LvColor; // 0x1448 (8)
	struct UImage Motion; // 0x1450 (8)
	struct UProgressBar ProgressBar_309; // 0x1458 (8)
	struct USizeBox SizeBox_1; // 0x1460 (8)
	struct UTextBlock TextBlock_3; // 0x1468 (8)
	struct UImage Tutorial_Glow; // 0x1470 (8)
	struct UUW-MouseRightClick_C UW-MouseRightClick_Big; // 0x1478 (8)
	struct UUW-MouseRightClick_C UW-MouseRightClick_Small; // 0x1480 (8)
	struct UImage WeaponColorBg; // 0x1488 (8)
	struct UImage WeaponEquipItem_Default; // 0x1490 (8)
	struct UImage WeaponEquipItem_Hover; // 0x1498 (8)
	struct UImage WeaponItemImage; // 0x14A0 (8)
	int32_t InventoryItemInfoIndex; // 0x14A8 (4)
	struct FLinearColor MedicalBGColor; // 0x14AC (16)
	int32_t CurCount; // 0x14BC (4)
	struct FMulticastInlineDelegate SetSlotInfo; // 0x14C0 (16)
	char CanUseCapsule : 0; // 0x14D0 (1)
	struct UImage SelectedHoverImage; // 0x14D8 (8)
	struct TArray<struct FName> ShowRarityStar; // 0x14E0 (16)
	struct TArray<struct FName> ShowIconBG; // 0x14F0 (16)

	void CheckBoosterItem(char& IsBoost, struct FLinearColor& OutColor, struct UTexture& OutTexture); // Function UW-Inventory_CarriedSlot.UW-Inventory_CarriedSlot_C.CheckBoosterItem(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void SetBoosterItem(); // Function UW-Inventory_CarriedSlot.UW-Inventory_CarriedSlot_C.SetBoosterItem(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void IsDraging(char& bResult); // Function UW-Inventory_CarriedSlot.UW-Inventory_CarriedSlot_C.IsDraging(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game_BE.exe+0x2B80160>
	void IsRoundItemType(char& bRoundItem); // Function UW-Inventory_CarriedSlot.UW-Inventory_CarriedSlot_C.IsRoundItemType(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game_BE.exe+0x2B80160>
