// WidgetBlueprintGeneratedClass UW-InventoryWidget.UW-InventoryWidget_C
class UUW-InventoryWidget_C : public UBravoHotelInventoryWidget {

public:

	struct Unknown UberGraphFrame; // 0x278 (8)
	struct Unknown FadeIn; // 0x280 (8)
	struct Unknown BackgroundBlur_1; // 0x288 (8)
	struct Unknown BackPackBound_begin; // 0x290 (8)
	struct Unknown BackPackBound_end; // 0x298 (8)
	struct Unknown BlackMarketOverlay; // 0x2A0 (8)
	struct Unknown BTN-BlackMarket; // 0x2A8 (8)
	struct Unknown Button_SortByTime; // 0x2B0 (8)
	struct Unknown Button_SortByType; // 0x2B8 (8)
	struct Unknown CanvasPanel_1; // 0x2C0 (8)
	struct Unknown CanvasPanel_7; // 0x2C8 (8)
	struct Unknown CanvasPanel_16; // 0x2D0 (8)
	struct Unknown Carried_Area; // 0x2D8 (8)
	struct Unknown CarriedBound_begin; // 0x2E0 (8)
	struct Unknown CarriedBound_end; // 0x2E8 (8)
	struct Unknown CarriedList; // 0x2F0 (8)
	struct Unknown CarriedList_StrongBox; // 0x2F8 (8)
	struct Unknown CheckBox; // 0x300 (8)
	struct Unknown CheckBox_1; // 0x308 (8)
	struct Unknown CheckBox_2; // 0x310 (8)
	struct Unknown CombineRecipe; // 0x318 (8)
	struct Unknown EquippedList; // 0x320 (8)
	struct Unknown HorizontalBox; // 0x328 (8)
	struct Unknown HorizontalBox_7; // 0x330 (8)
	struct Unknown HorizontalBox_WeightMax; // 0x338 (8)
	struct Unknown Image; // 0x340 (8)
	struct Unknown Image_2; // 0x348 (8)
	struct Unknown Image_3; // 0x350 (8)
	struct Unknown Image_5; // 0x358 (8)
	struct Unknown Image_6; // 0x360 (8)
	struct Unknown Image_7; // 0x368 (8)
	struct Unknown Image_8; // 0x370 (8)
	struct Unknown Image_9; // 0x378 (8)
	struct Unknown Image_10; // 0x380 (8)
	struct Unknown Image_223; // 0x388 (8)
	struct Unknown Image_227; // 0x390 (8)
	struct Unknown Image_271; // 0x398 (8)
	struct Unknown Image_324; // 0x3A0 (8)
	struct Unknown Image_489; // 0x3A8 (8)
	struct Unknown Image_556; // 0x3B0 (8)
	struct Unknown Image_Guess; // 0x3B8 (8)
	struct Unknown Image_ItemInfo; // 0x3C0 (8)
	struct Unknown IMG-BG; // 0x3C8 (8)
	struct Unknown IMG-BlackMarketBorder; // 0x3D0 (8)
	struct Unknown InputMaskImage; // 0x3D8 (8)
	struct Unknown Material_Area; // 0x3E0 (8)
	struct Unknown MaterialBound_begin; // 0x3E8 (8)
	struct Unknown MaterialBound_end; // 0x3F0 (8)
	struct Unknown ProgressBar_MaxWeight; // 0x3F8 (8)
	struct Unknown ProgressBar_Weight; // 0x400 (8)
	struct Unknown ProgressBar_WeightBag; // 0x408 (8)
	struct Unknown ProximityBound; // 0x410 (8)
	struct Unknown ProximityList; // 0x418 (8)
	struct Unknown StrongBox_Area; // 0x420 (8)
	struct Unknown T_AdditionalMaxWeight; // 0x428 (8)
	struct Unknown T_AdditionalMaxWeightSymbol; // 0x430 (8)
	struct Unknown T_AdditionalWeight; // 0x438 (8)
	struct Unknown T_AdditionalWeightSymbol; // 0x440 (8)
	struct Unknown T_MaxWeight; // 0x448 (8)
	struct Unknown T_StrongboxCount; // 0x450 (8)
	struct Unknown T_Weight; // 0x458 (8)
	struct Unknown T_WeightSlash; // 0x460 (8)
	struct Unknown TextBlock_11; // 0x468 (8)
	struct Unknown TextBlock_CurrentGold; // 0x470 (8)
	struct Unknown TextBlock_SortByTime; // 0x478 (8)
	struct Unknown TextBlock_SortByType; // 0x480 (8)
	struct Unknown UW-Inventory_FreeSupplyToolTip; // 0x488 (8)
	struct Unknown UW-Inventory_ItemInfoTooltip; // 0x490 (8)
	struct Unknown UW-Inventory_Keeped; // 0x498 (8)
	struct Unknown UW-Inventory_Material; // 0x4A0 (8)
	struct Unknown UW-Inventory_Recipe; // 0x4A8 (8)
	struct Unknown UW-SearchingMaterial; // 0x4B0 (8)
	struct Unknown WeaponBound; // 0x4B8 (8)
	struct Unknown WeaponList; // 0x4C0 (8)
	struct Unknown WeightPerCent; // 0x4C8 (8)
	struct Unknown PlayerController; // 0x4D0 (8)
	char bItemDrag : 0; // 0x4D8 (1)
	struct Unknown DropPopup; // 0x4E0 (8)
	float MaximumWeight; // 0x4E8 (4)
	int32_t OldProximityItemCount; // 0x4EC (4)
	struct Unknown ProximityGround; // 0x4F0 (8)
	struct Unknown DefaultPawnRef; // 0x4F8 (8)
	struct TArray<Unknown> ProximityGroundPool; // 0x500 (16)
	struct Unknown OldDefaultPawnRef; // 0x510 (8)
	struct Unknown CharacterTimerHandle; // 0x518 (8)
	struct TArray<Unknown> DropBoxWidgetList; // 0x520 (16)
	struct Unknown DropBoxParentWidget; // 0x530 (8)
	struct Unknown SavedInventorySettings; // 0x538 (8)
	struct Unknown EquipedWeapon; // 0x540 (8)
	struct TArray<Unknown> OldWeaponList; // 0x548 (16)
	char ChangeAttachments : 0; // 0x558 (1)
	struct Unknown ItemHoverWidget; // 0x560 (8)
	struct Unknown MainWidget; // 0x568 (8)
	struct FMulticastInlineDelegate EventDispatcher_OnCloseInventory; // 0x570 (16)
	struct TArray<Unknown> StealableWidgetList; // 0x580 (16)
	char bItemInfoHovered : 0; // 0x590 (1)
	char bFirstTimeNotifyItemInfo : 0; // 0x591 (1)
	struct Unknown Timer_ItemInfoTooltip; // 0x598 (8)
	char IsShowingItemInfoTooltip : 0; // 0x5A0 (1)
	int32_t FirstTimeCapsuleItem; // 0x5A4 (4)
	int32_t FirstTimeCraft; // 0x5A8 (4)
	char bGoldWarning : 0; // 0x5AC (1)
	struct Unknown DefaultWeightColor; // 0x5B0 (40)
	struct Unknown MinusWeightColor; // 0x5D8 (40)
	struct Unknown PlusWeightColor; // 0x600 (40)

	void AllHiddenMaterialWidget(); // Function UW-InventoryWidget.UW-InventoryWidget_C.AllHiddenMaterialWidget(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void ResetAllSlotScrollToStart(); // Function UW-InventoryWidget.UW-InventoryWidget_C.ResetAllSlotScrollToStart(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void SetWeightText(struct Unknown& WeightTextRef, struct Unknown& SymbolTextRef, float Weight); // Function UW-InventoryWidget.UW-InventoryWidget_C.SetWeightText(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void ResetAllHoverEffect(); // Function UW-InventoryWidget.UW-InventoryWidget_C.ResetAllHoverEffect(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
