// WidgetBlueprintGeneratedClass UW-Inventory_Perk.UW-Inventory_Perk_C
class UUW-Inventory_Perk_C : public UBravoHotelInventoryPerkWidget {

public:

	struct Unknown UberGraphFrame; // 0x2E8 (8)
	struct Unknown Anim_Glow; // 0x2F0 (8)
	struct Unknown HideFreeSupply; // 0x2F8 (8)
	struct Unknown ShowFreeSupply; // 0x300 (8)
	struct Unknown LevelUp; // 0x308 (8)
	struct Unknown Ability_Defense; // 0x310 (8)
	struct Unknown Ability_Speed; // 0x318 (8)
	struct Unknown Ability_Power; // 0x320 (8)
	struct Unknown Survive_FadeInOut; // 0x328 (8)
	struct Unknown Anim_LevelUpDefense; // 0x330 (8)
	struct Unknown Anim_LevelUpSpeed; // 0x338 (8)
	struct Unknown Anim_LevelUpPower; // 0x340 (8)
	struct Unknown btn_ItemTree; // 0x348 (8)
	struct Unknown btn_PerkDeckDisabled; // 0x350 (8)
	struct Unknown btn_PerkDeckDisabled_2; // 0x358 (8)
	struct Unknown btn_PerkDeckEnabled; // 0x360 (8)
	struct Unknown btn_PerkDeckEnabled_2; // 0x368 (8)
	struct Unknown Canvas_BG; // 0x370 (8)
	struct Unknown Canvas_ChangeClass; // 0x378 (8)
	struct Unknown Canvas_ChangeDisable; // 0x380 (8)
	struct Unknown Canvas_ChangeDisable_2; // 0x388 (8)
	struct Unknown Canvas_ChangeEnable; // 0x390 (8)
	struct Unknown Canvas_ChangeEnable_2; // 0x398 (8)
	struct Unknown Canvas_ChangeSupply; // 0x3A0 (8)
	struct Unknown Canvas_LevelupEffect; // 0x3A8 (8)
	struct Unknown Canvas_Main; // 0x3B0 (8)
	struct Unknown Canvas_Perk; // 0x3B8 (8)
	struct Unknown Canvas_SupplyButton; // 0x3C0 (8)
	struct Unknown Canvas_UltimateEffect; // 0x3C8 (8)
	struct Unknown Canvas_UltimateLightEffect; // 0x3D0 (8)
	struct Unknown HorizontalBox_300; // 0x3D8 (8)
	struct Unknown HorizontalBox_303; // 0x3E0 (8)
	struct Unknown HorizontalBox_Stat; // 0x3E8 (8)
	struct Unknown HorizontalBox_UnlockLevel; // 0x3F0 (8)
	struct Unknown Image; // 0x3F8 (8)
	struct Unknown Image_5; // 0x400 (8)
	struct Unknown Image_86; // 0x408 (8)
	struct Unknown Image_126; // 0x410 (8)
	struct Unknown Image_163; // 0x418 (8)
	struct Unknown Image_180; // 0x420 (8)
	struct Unknown Image_200; // 0x428 (8)
	struct Unknown Image_203; // 0x430 (8)
	struct Unknown Image_222; // 0x438 (8)
	struct Unknown Image_384; // 0x440 (8)
	struct Unknown Image_387; // 0x448 (8)
	struct Unknown Image_388; // 0x450 (8)
	struct Unknown Image_389; // 0x458 (8)
	struct Unknown Image_485; // 0x460 (8)
	struct Unknown Image_571; // 0x468 (8)
	struct Unknown Image_1098; // 0x470 (8)
	struct Unknown Image_1100; // 0x478 (8)
	struct Unknown Image_1104; // 0x480 (8)
	struct Unknown Image_Cycle; // 0x488 (8)
	struct Unknown Image_Cycle_2; // 0x490 (8)
	struct Unknown IMG_ClassIcon; // 0x498 (8)
	struct Unknown IMG_PerkDeckIcon; // 0x4A0 (8)
	struct Unknown IMG_Supply; // 0x4A8 (8)
	struct Unknown IMG_UltimatedSkill; // 0x4B0 (8)
	struct Unknown InvalidationBox_1; // 0x4B8 (8)
	struct Unknown KeyImageWidget; // 0x4C0 (8)
	struct Unknown NotEnoughGold; // 0x4C8 (8)
	struct Unknown Over_Ultimate; // 0x4D0 (8)
	struct Unknown Overlay_UltimateKey; // 0x4D8 (8)
	struct Unknown Spacer_251; // 0x4E0 (8)
	struct Unknown T_ClassName; // 0x4E8 (8)
	struct Unknown T_Defense; // 0x4F0 (8)
	struct Unknown T_DefenseAnim; // 0x4F8 (8)
	struct Unknown T_Power; // 0x500 (8)
	struct Unknown T_PowerAnim; // 0x508 (8)
	struct Unknown T_Speed; // 0x510 (8)
	struct Unknown T_SpeedAnim; // 0x518 (8)
	struct Unknown T_UltimateName; // 0x520 (8)
	struct Unknown T_UnlockLevel; // 0x528 (8)
	struct Unknown T_UnlockLevel2; // 0x530 (8)
	struct Unknown T_WeaponName; // 0x538 (8)
	struct Unknown TextBlock_2; // 0x540 (8)
	struct Unknown TextBlock_3; // 0x548 (8)
	struct Unknown TextBlock_4; // 0x550 (8)
	struct Unknown TextBlock_9; // 0x558 (8)
	struct Unknown TextBlock_ClassLevel; // 0x560 (8)
	struct Unknown TextBlock_Count_Blue; // 0x568 (8)
	struct Unknown TextBlock_Count_Green; // 0x570 (8)
	struct Unknown TextBlock_Count_Red; // 0x578 (8)
	struct Unknown TextBlock_Defense; // 0x580 (8)
	struct Unknown TextBlock_Power; // 0x588 (8)
	struct Unknown TextBlock_Price; // 0x590 (8)
	struct Unknown TextBlock_Price_2; // 0x598 (8)
	struct Unknown TextBlock_Select; // 0x5A0 (8)
	struct Unknown TextBlock_Select_2; // 0x5A8 (8)
	struct Unknown TextBlock_Speed; // 0x5B0 (8)
	struct Unknown TextBlock_SurviveMessage01; // 0x5B8 (8)
	struct Unknown TextBlock_SurviveMessage02; // 0x5C0 (8)
	struct Unknown TextBlock_UltimateDesc; // 0x5C8 (8)
	struct Unknown Title; // 0x5D0 (8)
	struct Unknown UltiLight_001; // 0x5D8 (8)
	struct Unknown UltiLight_002; // 0x5E0 (8)
	struct Unknown UltiLight_003; // 0x5E8 (8)
	struct Unknown UW-Inventory_PerkSlot; // 0x5F0 (8)
	struct Unknown UW-Inventory_PerkSlot_2; // 0x5F8 (8)
	struct Unknown UW-Inventory_PerkSlot_3; // 0x600 (8)
	struct Unknown UW-Inventory_PerkSlot_4; // 0x608 (8)
	struct Unknown UW-Inventory_PerkSlot_5; // 0x610 (8)
	struct Unknown UW-Inventory_PerkSlot_6; // 0x618 (8)
	struct Unknown UW-Inventory_PerkSlot_7; // 0x620 (8)
	struct Unknown UW-Inventory_PerkSlot_8; // 0x628 (8)
	struct Unknown UW-Inventory_PerkSlot_9; // 0x630 (8)
	struct Unknown VB_Health; // 0x638 (8)
	struct Unknown VB_Power; // 0x640 (8)
	struct Unknown VB_Speed; // 0x648 (8)
	struct Unknown VerticalBox_Blue; // 0x650 (8)
	struct Unknown VerticalBox_Green; // 0x658 (8)
	struct Unknown VerticalBox_Red; // 0x660 (8)
	struct Unknown WidgetSwitcher_ChangeClass; // 0x668 (8)
	struct Unknown WidgetSwitcher_ChangeSupply; // 0x670 (8)
	struct Unknown WidgetSwitcher_TreeAndClass; // 0x678 (8)
	struct Unknown WidgetSwitcher_Ultimate; // 0x680 (8)
	struct FName CurrentPerkDeckName; // 0x688 (8)
	struct TArray<Unknown> CurrentPerkInfos; // 0x690 (16)
	struct FName ExpertWeaponKey; // 0x6A0 (8)
	struct TMap<Unknown, Unknown> CurrentPerkCells; // 0x6A8 (80)
	int32_t PerkMode; // 0x6F8 (4)
	struct Unknown HoverWidget; // 0x700 (8)
	int32_t PowerValue; // 0x708 (4)
	struct Unknown TimerHandle_Power; // 0x710 (8)
	int32_t SpeedValue; // 0x718 (4)
	struct Unknown TimerHandle_Speed; // 0x720 (8)
	int32_t DefenseValue; // 0x728 (4)
	struct Unknown TimerHandle_Defense; // 0x730 (8)
	char bPlayAbilityCountSoundStart : 0; // 0x738 (1)
	char bPlayAbilityCountSoundEnd : 0; // 0x739 (1)
	struct Unknown LevelUpSound; // 0x740 (8)
	char EnableSupplyBtn : 0; // 0x748 (1)
	struct Unknown FreeSupplyTimer; // 0x750 (8)
	struct Unknown NotEnoughtGoldTimer; // 0x758 (8)
	struct TArray<Unknown> GainPerkPopups; // 0x760 (16)
	char IsPlayingUltimateSound : 0; // 0x770 (1)
	int32_t LastLevel; // 0x774 (4)
	struct Unknown PerkDeckClassInfo; // 0x778 (40)

	void SequenceEvent__ENTRYPOINTUW-Inventory_Perk_2(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.SequenceEvent__ENTRYPOINTUW-Inventory_Perk_2(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void SequenceEvent__ENTRYPOINTUW-Inventory_Perk_1(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.SequenceEvent__ENTRYPOINTUW-Inventory_Perk_1(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void SetEnabledInvalidationbox(char Enabled); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.SetEnabledInvalidationbox(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void ResetUltimateSound(); // Function UW-Inventory_Perk.UW-Inventory_Perk_C.ResetUltimateSound(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
