// WidgetBlueprintGeneratedClass UW-Lobby_Main_Web.UW-Lobby_Main_Web_C
class UUW-Lobby_Main_Web_C : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown NewAnimation_2; // 0x250 (8)
	struct Unknown BackgroundBlur_1; // 0x258 (8)
	struct Unknown Blur; // 0x260 (8)
	struct Unknown CanvasPanel_1; // 0x268 (8)
	struct Unknown Focus; // 0x270 (8)
	struct Unknown FocusPanel; // 0x278 (8)
	struct Unknown Lobby; // 0x280 (8)
	struct Unknown UW-ArmoryWidget; // 0x288 (8)
	struct Unknown UW-CustomizedCharacter; // 0x290 (8)
	struct Unknown UW-Exit_Popup; // 0x298 (8)
	struct Unknown UW-Lobby_ArmoryMain; // 0x2A0 (8)
	struct Unknown UW-ReplayListWidget; // 0x2A8 (8)
	struct Unknown UW-Volume; // 0x2B0 (8)
	struct Unknown NormalTextColor; // 0x2B8 (40)
	struct Unknown HoverTextColor; // 0x2E0 (40)
	struct Unknown LobbyWidgetRef; // 0x308 (8)
	struct Unknown NormalSelectedTextColor; // 0x310 (40)
	struct Unknown HoverSelectedTextColor; // 0x338 (40)
	struct Unknown NormalOptionButtonColor; // 0x360 (16)
	struct Unknown HoverOptionButtonColor; // 0x370 (16)
	struct Unknown MatchingPopupTimerHandle; // 0x380 (8)
	struct Unknown PopupKey; // 0x388 (24)
	char bExitPopupOpen : 0; // 0x3A0 (1)
	char bOptionPopupOpen : 0; // 0x3A1 (1)
	char BattleMode; // 0x3A2 (1)
	struct Unknown LobbyCoherentSprite; // 0x3A8 (8)
	struct Unknown SettingWidget; // 0x3B0 (8)
	struct Unknown LobbySound; // 0x3B8 (8)
	struct FString CurrentTab; // 0x3C0 (16)
	struct Unknown UW-Inventory_ItemSlotHover; // 0x3D0 (8)
	struct Unknown LobbyCoherent2DTexture; // 0x3D8 (8)

	void EndCraft(); // Function UW-Lobby_Main_Web.UW-Lobby_Main_Web_C.EndCraft(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	void StartCraft(struct Unknown& CraftWeapon); // Function UW-Lobby_Main_Web.UW-Lobby_Main_Web_C.StartCraft(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	void GetHoverWidget(struct Unknown& UW-Inventory_ItemSlotHover); // Function UW-Lobby_Main_Web.UW-Lobby_Main_Web_C.GetHoverWidget(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <Game_BE.exe+0x2B812B0>
	void CreateHoverWidget(); // Function UW-Lobby_Main_Web.UW-Lobby_Main_Web_C.CreateHoverWidget(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	void OnChangedArmoryTab(struct FString TabName); // Function UW-Lobby_Main_Web.UW-Lobby_Main_Web_C.OnChangedArmoryTab(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
