// WidgetBlueprintGeneratedClass UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C
class UUW-MatchEnd_Animation_02_C : public UUserWidget {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248 (8)
	struct UWidgetAnimation Anim_DamageList; // 0x250 (8)
	struct UWidgetAnimation Event2; // 0x258 (8)
	struct UWidgetAnimation Event; // 0x260 (8)
	struct UWidgetAnimation Anim_Second; // 0x268 (8)
	struct UWidgetAnimation Hide; // 0x270 (8)
	struct UWidgetAnimation Infos_ani; // 0x278 (8)
	struct UWidgetAnimation Anim_Defeat; // 0x280 (8)
	struct UWidgetAnimation Anim_Victory; // 0x288 (8)
	struct UImage Arrow; // 0x290 (8)
	struct UImage Arrow_2; // 0x298 (8)
	struct UImage ArrowLine; // 0x2A0 (8)
	struct UImage ArrowLine_2; // 0x2A8 (8)
	struct UBackgroundBlur BackgroundBlur; // 0x2B0 (8)
	struct UBackgroundBlur BackgroundBlur_447; // 0x2B8 (8)
	struct UImage BlackBG01; // 0x2C0 (8)
	struct UImage BlackBG02; // 0x2C8 (8)
	struct UImage BottomLine; // 0x2D0 (8)
	struct UImage BottomLine_2; // 0x2D8 (8)
	struct UButton Button_2; // 0x2E0 (8)
	struct UButton Button_104; // 0x2E8 (8)
	struct UButton Button_MatchEnd; // 0x2F0 (8)
	struct UButton Button_Skip; // 0x2F8 (8)
	struct UCanvasPanel CanvasPanel_49; // 0x300 (8)
	struct UCanvasPanel CanvasPanel_488; // 0x308 (8)
	struct UCanvasPanel CanvasPanel_DropItem; // 0x310 (8)
	struct UCanvasPanel CanvasPanel_DropItem2; // 0x318 (8)
	struct UCanvasPanel CanvasPanel_Enemy; // 0x320 (8)
	struct UCanvasPanel CanvasPanel_KillerInfo_Renew; // 0x328 (8)
	struct UCanvasPanel CanvasPanel_Skip; // 0x330 (8)
	struct UScaleBox Defeat; // 0x338 (8)
	struct UImage Glow1; // 0x340 (8)
	struct UImage Glow1_2; // 0x348 (8)
	struct UImage Glow2; // 0x350 (8)
	struct UImage Glow3; // 0x358 (8)
	struct UImage Glow3_2; // 0x360 (8)
	struct UImage GlowLine; // 0x368 (8)
	struct UTextBlock HeadShot; // 0x370 (8)
	struct UHorizontalBox HorizontalBox_KillerWeaponInfo; // 0x378 (8)
	struct UHorizontalBox HorizontalBox_Rarity; // 0x380 (8)
	struct UImage Image_3; // 0x388 (8)
	struct UImage Image_4; // 0x390 (8)
	struct UImage Image_5; // 0x398 (8)
	struct UImage Image_6; // 0x3A0 (8)
	struct UImage Image_7; // 0x3A8 (8)
	struct UImage Image_8; // 0x3B0 (8)
	struct UImage Image_10; // 0x3B8 (8)
	struct UImage Image_11; // 0x3C0 (8)
	struct UImage Image_12; // 0x3C8 (8)
	struct UImage Image_13; // 0x3D0 (8)
	struct UImage Image_14; // 0x3D8 (8)
	struct UImage Image_15; // 0x3E0 (8)
	struct UImage Image_16; // 0x3E8 (8)
	struct UImage Image_17; // 0x3F0 (8)
	struct UImage Image_18; // 0x3F8 (8)
	struct UImage Image_19; // 0x400 (8)
	struct UImage Image_20; // 0x408 (8)
	struct UImage Image_21; // 0x410 (8)
	struct UImage Image_22; // 0x418 (8)
	struct UImage Image_23; // 0x420 (8)
	struct UImage Image_24; // 0x428 (8)
	struct UImage Image_25; // 0x430 (8)
	struct UImage Image_26; // 0x438 (8)
	struct UImage Image_252; // 0x440 (8)
	struct UImage Image_505; // 0x448 (8)
	struct UImage Image_605; // 0x450 (8)
	struct UImage Image_816; // 0x458 (8)
	struct UImage Image_1091; // 0x460 (8)
	struct UImage Image_1443; // 0x468 (8)
	struct UImage Image_1558; // 0x470 (8)
	struct UImage Image_KillerClassIcon; // 0x478 (8)
	struct UImage Image_MyClassIcon; // 0x480 (8)
	struct UImage L_Wing01; // 0x488 (8)
	struct UImage L_Wing01_2; // 0x490 (8)
	struct UImage L_Wing01_3; // 0x498 (8)
	struct UImage L_Wing01_4; // 0x4A0 (8)
	struct UImage L_Wing02; // 0x4A8 (8)
	struct UImage L_Wing02_2; // 0x4B0 (8)
	struct UImage L_Wing02_3; // 0x4B8 (8)
	struct UImage L_Wing02_4; // 0x4C0 (8)
	struct UImage L_Wing03; // 0x4C8 (8)
	struct UImage L_Wing03_2; // 0x4D0 (8)
	struct UImage L_Wing03_3; // 0x4D8 (8)
	struct UImage L_Wing03_4; // 0x4E0 (8)
	struct UImage L_WingLine; // 0x4E8 (8)
	struct UImage L_WingLine_2; // 0x4F0 (8)
	struct UImage Logo; // 0x4F8 (8)
	struct UImage Logo_2; // 0x500 (8)
	struct UOverlay Overlay_1; // 0x508 (8)
	struct UOverlay Overlay_WeaponLevel; // 0x510 (8)
	struct UEditableText PosX; // 0x518 (8)
	struct UEditableText PosY; // 0x520 (8)
	struct UEditableText PosZ; // 0x528 (8)
	struct UImage R_Wing01; // 0x530 (8)
	struct UImage R_Wing01_2; // 0x538 (8)
	struct UImage R_Wing01_3; // 0x540 (8)
	struct UImage R_Wing01_4; // 0x548 (8)
	struct UImage R_Wing02; // 0x550 (8)
	struct UImage R_Wing02_2; // 0x558 (8)
	struct UImage R_Wing02_3; // 0x560 (8)
	struct UImage R_Wing02_4; // 0x568 (8)
	struct UImage R_Wing03; // 0x570 (8)
	struct UImage R_Wing03_2; // 0x578 (8)
	struct UImage R_Wing03_3; // 0x580 (8)
	struct UImage R_Wing03_4; // 0x588 (8)
	struct UImage R_WingLine; // 0x590 (8)
	struct UImage R_WingLine_2; // 0x598 (8)
	struct UImage Ribbon; // 0x5A0 (8)
	struct UImage Ribbon_2; // 0x5A8 (8)
	struct UImage Ring; // 0x5B0 (8)
	struct UScrollBox ScrollBox_DropItem; // 0x5B8 (8)
	struct UScrollBox ScrollBox_DropItem2; // 0x5C0 (8)
	struct UTextBlock T_DamageType; // 0x5C8 (8)
	struct UTextBlock T_DropCount; // 0x5D0 (8)
	struct UTextBlock T_DropCount2; // 0x5D8 (8)
	struct UTextBlock T_WeaponLevel; // 0x5E0 (8)
	struct UTextBlock TextBlock_3; // 0x5E8 (8)
	struct UTextBlock TextBlock_4; // 0x5F0 (8)
	struct UTextBlock TextBlock_5; // 0x5F8 (8)
	struct UTextBlock TextBlock_6; // 0x600 (8)
	struct UTextBlock TextBlock_8; // 0x608 (8)
	struct UTextBlock TextBlock_9; // 0x610 (8)
	struct UTextBlock TextBlock_10; // 0x618 (8)
	struct UTextBlock TextBlock_900; // 0x620 (8)
	struct UImage TopLine; // 0x628 (8)
	struct UImage TopLine_2; // 0x630 (8)
	struct UUW-MatchEnd_Animation_02_DamagePlayerInfo_C UW-MatchEnd_Animation_02_DamagePlayerInfo; // 0x638 (8)
	struct UUW-MatchEnd_Animation_02_DamagePlayerInfo_C UW-MatchEnd_Animation_02_DamagePlayerInfo_2; // 0x640 (8)
	struct UUW-Matchend_DamageListBox_C UW-Matchend_DamageListBox; // 0x648 (8)
	struct UUW-MatchEnd_RewardSlot_02_C UW-MatchEnd_RewardSlot; // 0x650 (8)
	struct UUW-MatchEnd_RewardSlot_02_C UW-MatchEnd_RewardSlot_2; // 0x658 (8)
	struct UUW-MatchEnd_RewardSlot_02_C UW-MatchEnd_RewardSlot_3; // 0x660 (8)
	struct UUW-MatchEnd_RewardSlot_02_C UW-MatchEnd_RewardSlot_02; // 0x668 (8)
	struct UTextBlock WeaponName; // 0x670 (8)
	struct UWidgetSwitcher WidgetSwitcher_DamageCauser; // 0x678 (8)
	struct UWidgetSwitcher WidgetSwitcher_KillerInfo; // 0x680 (8)
	struct UWidgetSwitcher WidgetSwitcher_SkipButton; // 0x688 (8)
	struct UTextBlock WinText1; // 0x690 (8)
	struct UTextBlock WinText1_2; // 0x698 (8)
	struct UTextBlock WinText1_3; // 0x6A0 (8)
	struct UTextBlock WinText1_4; // 0x6A8 (8)
	struct UTextBlock WinText2; // 0x6B0 (8)
	struct UTextBlock WinText3; // 0x6B8 (8)
	char MatchEnd : 0; // 0x6C0 (1)
	struct FMatchEndAnimation AnimationData; // 0x6C1 (2)
	struct UUW-MatchEndWidget_C MatchEndWidgetRef; // 0x6C8 (8)
	struct FMatchEndSimpleResult SimpleResult; // 0x6D0 (272)
	struct TArray<struct FTimerHandle> SimpleTimer; // 0x7E0 (16)
	struct FMulticastInlineDelegate EventDispatcher_HideComplete; // 0x7F0 (16)
	char bSuccessWinEventCall : 0; // 0x800 (1)
	struct TArray<struct FAudioPlayingHandle> PlayingAudio; // 0x808 (16)
	char bTestMode : 0; // 0x818 (1)
	char bTestIsWin : 0; // 0x819 (1)
	float MatchFinalResultShowTime; // 0x81C (4)
	struct FMulticastInlineDelegate EventDispatcher_MoveToMatchEnd; // 0x820 (16)

	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02_4(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02_4(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02_3(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02_3(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02_2(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02_2(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
