// WidgetBlueprintGeneratedClass UW-MainWidget.UW-MainWidget_C
class UUW-MainWidget_C : public UBravoHotelMainWidget {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x458 (8)
	struct UWidgetAnimation Anim_HideWidget; // 0x460 (8)
	struct UWidgetAnimation HideLaserPoint; // 0x468 (8)
	struct UWidgetAnimation ShowLaserPoint; // 0x470 (8)
	struct UBackgroundBlur BackgroundBlur_154; // 0x478 (8)
	struct UCanvasPanel Canvas; // 0x480 (8)
	struct UHorizontalBox HB_PerkSpin; // 0x488 (8)
	struct UImage RedCircle; // 0x490 (8)
	struct UTextBlock TextBlock_Start; // 0x498 (8)
	struct UUW-CompassWidget_C UW-CompassWidget; // 0x4A0 (8)
	struct UUW-HUDMessageWidget_C UW-HUDMessageWidget; // 0x4A8 (8)
	struct UUW-InteractionWidget_C UW-InteractionWidget; // 0x4B0 (8)
	struct UUW-JetpackWidget_C UW-JetpackWidget; // 0x4B8 (8)
	struct UUW-MS_C UW-MS; // 0x4C0 (8)
	struct UUW-PerkLevelUp_02_C UW-PerkLevelUp_02; // 0x4C8 (8)
	struct UUW-VehicleWidget_C UW-VehicleWidget; // 0x4D0 (8)
	struct ABravoHotelCharacter TargetPawn; // 0x4D8 (8)
	struct FDisplayAbility LastDisplayAbility; // 0x4E0 (12)
	struct TArray<struct UUW-GainPerk_C> GainPerkPopups; // 0x4F0 (16)
	struct UUW-Radar_Cursor_C UW-RaderCursorWidget; // 0x500 (8)
	struct UUserWidget UW-DefaultCursorWidget; // 0x508 (8)
	struct FTimerHandle Timer_IsMouseWidgetInMap; // 0x510 (8)
	struct UUW-NitroBoomTargetWidget_C UW-NitroBoomTargetWidget; // 0x518 (8)
	char bIsShow : 0; // 0x520 (1)
	float TmpViewportUpAngle; // 0x524 (4)
	float TmpViewportSideAngle; // 0x528 (4)
	struct FVector2D CenterPosition; // 0x52C (8)
	struct UUW-MapImageWidget_C UW-MapImageRef; // 0x538 (8)
	struct FTimerHandle Timer_AutoPerkDeck; // 0x540 (8)
	int32_t LastPlayZoneID; // 0x548 (4)
	char bShowLevelUp : 0; // 0x54C (1)
	char IsPlayingUltimateSound : 0; // 0x54D (1)
	char bIsUnlockUltimateSkill : 0; // 0x54E (1)

	void HideSkillMouseCursor(); // Function UW-MainWidget.UW-MainWidget_C.HideSkillMouseCursor(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void ShowSkillMouseCursor(); // Function UW-MainWidget.UW-MainWidget_C.ShowSkillMouseCursor(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void CheckUltimateSound(int32_t CurrentLevel); // Function UW-MainWidget.UW-MainWidget_C.CheckUltimateSound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void UpdateAllInvalidationbox(); // Function UW-MainWidget.UW-MainWidget_C.UpdateAllInvalidationbox(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void SetSightInfoPosition(enum class EFireType FireType); // Function UW-MainWidget.UW-MainWidget_C.SetSightInfoPosition(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
