// WidgetBlueprintGeneratedClass UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C
class UUW-MatchEnd_Animation_02_C : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Event2; // 0x250 (8)
	struct Unknown Event; // 0x258 (8)
	struct Unknown Anim_Second; // 0x260 (8)
	struct Unknown Hide; // 0x268 (8)
	struct Unknown Infos_ani; // 0x270 (8)
	struct Unknown Anim_Defeat; // 0x278 (8)
	struct Unknown Anim_Victory; // 0x280 (8)
	struct Unknown Arrow; // 0x288 (8)
	struct Unknown Arrow_2; // 0x290 (8)
	struct Unknown ArrowLine; // 0x298 (8)
	struct Unknown ArrowLine_2; // 0x2A0 (8)
	struct Unknown BackgroundBlur; // 0x2A8 (8)
	struct Unknown BackgroundBlur_447; // 0x2B0 (8)
	struct Unknown BlackBG01; // 0x2B8 (8)
	struct Unknown BlackBG02; // 0x2C0 (8)
	struct Unknown BottomLine; // 0x2C8 (8)
	struct Unknown BottomLine_2; // 0x2D0 (8)
	struct Unknown Button; // 0x2D8 (8)
	struct Unknown Button_2; // 0x2E0 (8)
	struct Unknown Button_104; // 0x2E8 (8)
	struct Unknown CanvasPanel_7; // 0x2F0 (8)
	struct Unknown CanvasPanel_49; // 0x2F8 (8)
	struct Unknown CanvasPanel_488; // 0x300 (8)
	struct Unknown CanvasPanel_832; // 0x308 (8)
	struct Unknown Glow1; // 0x310 (8)
	struct Unknown Glow1_2; // 0x318 (8)
	struct Unknown Glow2; // 0x320 (8)
	struct Unknown Glow3; // 0x328 (8)
	struct Unknown Glow3_2; // 0x330 (8)
	struct Unknown GlowLine; // 0x338 (8)
	struct Unknown HeadShot; // 0x340 (8)
	struct Unknown HorizontalBox_KillerWeaponInfo; // 0x348 (8)
	struct Unknown HorizontalBox_Rarity; // 0x350 (8)
	struct Unknown Image_4; // 0x358 (8)
	struct Unknown Image_5; // 0x360 (8)
	struct Unknown Image_6; // 0x368 (8)
	struct Unknown Image_7; // 0x370 (8)
	struct Unknown Image_8; // 0x378 (8)
	struct Unknown Image_16; // 0x380 (8)
	struct Unknown Image_17; // 0x388 (8)
	struct Unknown Image_18; // 0x390 (8)
	struct Unknown Image_19; // 0x398 (8)
	struct Unknown Image_20; // 0x3A0 (8)
	struct Unknown Image_21; // 0x3A8 (8)
	struct Unknown Image_22; // 0x3B0 (8)
	struct Unknown Image_23; // 0x3B8 (8)
	struct Unknown Image_252; // 0x3C0 (8)
	struct Unknown Image_505; // 0x3C8 (8)
	struct Unknown Image_1091; // 0x3D0 (8)
	struct Unknown Image_1443; // 0x3D8 (8)
	struct Unknown Image_1558; // 0x3E0 (8)
	struct Unknown L_Wing01; // 0x3E8 (8)
	struct Unknown L_Wing01_2; // 0x3F0 (8)
	struct Unknown L_Wing01_3; // 0x3F8 (8)
	struct Unknown L_Wing01_4; // 0x400 (8)
	struct Unknown L_Wing02; // 0x408 (8)
	struct Unknown L_Wing02_2; // 0x410 (8)
	struct Unknown L_Wing02_3; // 0x418 (8)
	struct Unknown L_Wing02_4; // 0x420 (8)
	struct Unknown L_Wing03; // 0x428 (8)
	struct Unknown L_Wing03_2; // 0x430 (8)
	struct Unknown L_Wing03_3; // 0x438 (8)
	struct Unknown L_Wing03_4; // 0x440 (8)
	struct Unknown L_WingLine; // 0x448 (8)
	struct Unknown L_WingLine_2; // 0x450 (8)
	struct Unknown Logo; // 0x458 (8)
	struct Unknown Logo_2; // 0x460 (8)
	struct Unknown Overlay_1; // 0x468 (8)
	struct Unknown Overlay_WeaponLevel; // 0x470 (8)
	struct Unknown PosX; // 0x478 (8)
	struct Unknown PosY; // 0x480 (8)
	struct Unknown PosZ; // 0x488 (8)
	struct Unknown R_Wing01; // 0x490 (8)
	struct Unknown R_Wing01_2; // 0x498 (8)
	struct Unknown R_Wing01_3; // 0x4A0 (8)
	struct Unknown R_Wing01_4; // 0x4A8 (8)
	struct Unknown R_Wing02; // 0x4B0 (8)
	struct Unknown R_Wing02_2; // 0x4B8 (8)
	struct Unknown R_Wing02_3; // 0x4C0 (8)
	struct Unknown R_Wing02_4; // 0x4C8 (8)
	struct Unknown R_Wing03; // 0x4D0 (8)
	struct Unknown R_Wing03_2; // 0x4D8 (8)
	struct Unknown R_Wing03_3; // 0x4E0 (8)
	struct Unknown R_Wing03_4; // 0x4E8 (8)
	struct Unknown R_WingLine; // 0x4F0 (8)
	struct Unknown R_WingLine_2; // 0x4F8 (8)
	struct Unknown Ribbon; // 0x500 (8)
	struct Unknown Ribbon_2; // 0x508 (8)
	struct Unknown ring; // 0x510 (8)
	struct Unknown ScrollBox_1; // 0x518 (8)
	struct Unknown T_DamageType; // 0x520 (8)
	struct Unknown T_WeaponLevel; // 0x528 (8)
	struct Unknown TextBlock_3; // 0x530 (8)
	struct Unknown TextBlock_4; // 0x538 (8)
	struct Unknown TextBlock_5; // 0x540 (8)
	struct Unknown TextBlock_6; // 0x548 (8)
	struct Unknown TextBlock_8; // 0x550 (8)
	struct Unknown TextBlock_9; // 0x558 (8)
	struct Unknown TextBlock_10; // 0x560 (8)
	struct Unknown TextBlock_11; // 0x568 (8)
	struct Unknown TextBlock_900; // 0x570 (8)
	struct Unknown TopLine; // 0x578 (8)
	struct Unknown TopLine_2; // 0x580 (8)
	struct Unknown UW-MatchEnd_RewardSlot; // 0x588 (8)
	struct Unknown UW-MatchEnd_RewardSlot_02; // 0x590 (8)
	struct Unknown WeaponName; // 0x598 (8)
	struct Unknown WidgetSwitcher_DamageCauser; // 0x5A0 (8)
	struct Unknown WinText1; // 0x5A8 (8)
	struct Unknown WinText1_2; // 0x5B0 (8)
	struct Unknown WinText1_3; // 0x5B8 (8)
	struct Unknown WinText1_4; // 0x5C0 (8)
	struct Unknown WinText2; // 0x5C8 (8)
	struct Unknown WinText3; // 0x5D0 (8)
	char MatchEnd : 0; // 0x5D8 (1)
	struct Unknown AnimationData; // 0x5D9 (2)
	struct Unknown MatchEndWidgetRef; // 0x5E0 (8)
	struct Unknown SimpleResult; // 0x5E8 (168)
	struct TArray<Unknown> SimpleTimer; // 0x690 (16)
	struct FMulticastInlineDelegate EventDispatcher_HideComplete; // 0x6A0 (16)
	char bSuccessWinEventCall : 0; // 0x6B0 (1)
	struct TArray<Unknown> PlayingAudio; // 0x6B8 (16)
	char bTestMode : 0; // 0x6C8 (1)
	char bTestIsWin : 0; // 0x6C9 (1)
	float MatchFinalResultShowTime; // 0x6CC (4)

	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02_2(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02_2(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02_1(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02_1(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void CheckSkipBtn(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.CheckSkipBtn(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void PlayCharacterResultAnimation(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.PlayCharacterResultAnimation(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void UpdateInputMode(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.UpdateInputMode(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void RemoveOverlapedWidgets(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.RemoveOverlapedWidgets(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void SetKillerInfo(struct Unknown SimpleResult); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SetKillerInfo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void SetDropedItem(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SetDropedItem(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void ShowMatchEndAnimation(struct Unknown AnimationData, struct Unknown Result, char IsTestMode, char bIsRetire); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.ShowMatchEndAnimation(BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void 鉹@t元_1(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.鉹@t元_1(BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void ShowLoseAnimation(struct Unknown Data); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.ShowLoseAnimation(BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void DelegateOnWhoKilledMe_Event_1(struct Unknown& SimpleResult); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.DelegateOnWhoKilledMe_Event_1(HasOutParms|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void HideAnimation(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.HideAnimation(BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void 鉹@t元_2(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.鉹@t元_2(BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void Tick(struct Unknown MyGeometry, float InDeltaTime); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void Construct(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void 鉹@t元_3(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.鉹@t元_3(BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void 鉹@t元_4(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.鉹@t元_4(BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void Init(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.Init(BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void BndEvt__Button_103_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.BndEvt__Button_103_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void BndEvt__Button_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.BndEvt__Button_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void ExecuteUbergraph_UW-MatchEnd_Animation_02(int32_t EntryPoint); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.ExecuteUbergraph_UW-MatchEnd_Animation_02(Final|UbergraphFunction|HasDefaults) // <Game_BE.exe+0x2B80160>
	void EventDispatcher_HideComplete__DelegateSignature(); // Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.EventDispatcher_HideComplete__DelegateSignature(Public|Delegate|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
};

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02_2
inline void UUW-MatchEnd_Animation_02_C::SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02_2() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02_2");

	struct SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02_2_Params {
		
	}; SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02_2_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02_1
inline void UUW-MatchEnd_Animation_02_C::SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02_1() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02_1");

	struct SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02_1_Params {
		
	}; SequenceEvent__ENTRYPOINTUW-MatchEnd_Animation_02_1_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.CheckSkipBtn
inline void UUW-MatchEnd_Animation_02_C::CheckSkipBtn() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.CheckSkipBtn");

	struct CheckSkipBtn_Params {
		
	}; CheckSkipBtn_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.PlayCharacterResultAnimation
inline void UUW-MatchEnd_Animation_02_C::PlayCharacterResultAnimation() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.PlayCharacterResultAnimation");

	struct PlayCharacterResultAnimation_Params {
		
	}; PlayCharacterResultAnimation_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.UpdateInputMode
inline void UUW-MatchEnd_Animation_02_C::UpdateInputMode() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.UpdateInputMode");

	struct UpdateInputMode_Params {
		
	}; UpdateInputMode_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.RemoveOverlapedWidgets
inline void UUW-MatchEnd_Animation_02_C::RemoveOverlapedWidgets() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.RemoveOverlapedWidgets");

	struct RemoveOverlapedWidgets_Params {
		
	}; RemoveOverlapedWidgets_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SetKillerInfo
inline void UUW-MatchEnd_Animation_02_C::SetKillerInfo(struct Unknown SimpleResult) {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SetKillerInfo");

	struct SetKillerInfo_Params {
		struct Unknown SimpleResult;
	}; SetKillerInfo_Params Params;

	Params.SimpleResult = SimpleResult;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SetDropedItem
inline void UUW-MatchEnd_Animation_02_C::SetDropedItem() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.SetDropedItem");

	struct SetDropedItem_Params {
		
	}; SetDropedItem_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.ShowMatchEndAnimation
inline void UUW-MatchEnd_Animation_02_C::ShowMatchEndAnimation(struct Unknown AnimationData, struct Unknown Result, char IsTestMode, char bIsRetire) {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.ShowMatchEndAnimation");

	struct ShowMatchEndAnimation_Params {
		struct Unknown AnimationData;
		struct Unknown Result;
		char IsTestMode;
		char bIsRetire;
	}; ShowMatchEndAnimation_Params Params;

	Params.AnimationData = AnimationData;
	Params.Result = Result;
	Params.IsTestMode = IsTestMode;
	Params.bIsRetire = bIsRetire;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.鉹@t元_1
inline void UUW-MatchEnd_Animation_02_C::鉹@t元_1() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.鉹@t元_1");

	struct 鉹@t元_1_Params {
		
	}; 鉹@t元_1_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.ShowLoseAnimation
inline void UUW-MatchEnd_Animation_02_C::ShowLoseAnimation(struct Unknown Data) {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.ShowLoseAnimation");

	struct ShowLoseAnimation_Params {
		struct Unknown Data;
	}; ShowLoseAnimation_Params Params;

	Params.Data = Data;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.DelegateOnWhoKilledMe_Event_1
inline void UUW-MatchEnd_Animation_02_C::DelegateOnWhoKilledMe_Event_1(struct Unknown& SimpleResult) {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.DelegateOnWhoKilledMe_Event_1");

	struct DelegateOnWhoKilledMe_Event_1_Params {
		struct Unknown& SimpleResult;
	}; DelegateOnWhoKilledMe_Event_1_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;

	SimpleResult = Params.SimpleResult;

}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
inline void UUW-MatchEnd_Animation_02_C::BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature");

	struct BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params {
		
	}; BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.HideAnimation
inline void UUW-MatchEnd_Animation_02_C::HideAnimation() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.HideAnimation");

	struct HideAnimation_Params {
		
	}; HideAnimation_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.鉹@t元_2
inline void UUW-MatchEnd_Animation_02_C::鉹@t元_2() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.鉹@t元_2");

	struct 鉹@t元_2_Params {
		
	}; 鉹@t元_2_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.Tick
inline void UUW-MatchEnd_Animation_02_C::Tick(struct Unknown MyGeometry, float InDeltaTime) {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.Tick");

	struct Tick_Params {
		struct Unknown MyGeometry;
		float InDeltaTime;
	}; Tick_Params Params;

	Params.MyGeometry = MyGeometry;
	Params.InDeltaTime = InDeltaTime;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.Construct
inline void UUW-MatchEnd_Animation_02_C::Construct() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.Construct");

	struct Construct_Params {
		
	}; Construct_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.鉹@t元_3
inline void UUW-MatchEnd_Animation_02_C::鉹@t元_3() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.鉹@t元_3");

	struct 鉹@t元_3_Params {
		
	}; 鉹@t元_3_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.鉹@t元_4
inline void UUW-MatchEnd_Animation_02_C::鉹@t元_4() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.鉹@t元_4");

	struct 鉹@t元_4_Params {
		
	}; 鉹@t元_4_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.Init
inline void UUW-MatchEnd_Animation_02_C::Init() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.Init");

	struct Init_Params {
		
	}; Init_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.BndEvt__Button_103_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
inline void UUW-MatchEnd_Animation_02_C::BndEvt__Button_103_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.BndEvt__Button_103_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature");

	struct BndEvt__Button_103_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params {
		
	}; BndEvt__Button_103_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.BndEvt__Button_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
inline void UUW-MatchEnd_Animation_02_C::BndEvt__Button_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.BndEvt__Button_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature");

	struct BndEvt__Button_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params {
		
	}; BndEvt__Button_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.ExecuteUbergraph_UW-MatchEnd_Animation_02
inline void UUW-MatchEnd_Animation_02_C::ExecuteUbergraph_UW-MatchEnd_Animation_02(int32_t EntryPoint) {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.ExecuteUbergraph_UW-MatchEnd_Animation_02");

	struct ExecuteUbergraph_UW-MatchEnd_Animation_02_Params {
		int32_t EntryPoint;
	}; ExecuteUbergraph_UW-MatchEnd_Animation_02_Params Params;

	Params.EntryPoint = EntryPoint;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.EventDispatcher_HideComplete__DelegateSignature
inline void UUW-MatchEnd_Animation_02_C::EventDispatcher_HideComplete__DelegateSignature() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-MatchEnd_Animation_02.UW-MatchEnd_Animation_02_C.EventDispatcher_HideComplete__DelegateSignature");

	struct EventDispatcher_HideComplete__DelegateSignature_Params {
		
	}; EventDispatcher_HideComplete__DelegateSignature_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

