// WidgetBlueprintGeneratedClass UW-MainWidget.UW-MainWidget_C
class UUW-MainWidget_C : public UBravoHotelMainWidget {

public:

	struct Unknown UberGraphFrame; // 0x450 (8)
	struct Unknown Anim_HideWidget; // 0x458 (8)
	struct Unknown HideLaserPoint; // 0x460 (8)
	struct Unknown ShowLaserPoint; // 0x468 (8)
	struct Unknown BackgroundBlur_154; // 0x470 (8)
	struct Unknown Canvas; // 0x478 (8)
	struct Unknown HB_PerkSpin; // 0x480 (8)
	struct Unknown RedCircle; // 0x488 (8)
	struct Unknown TextBlock_Start; // 0x490 (8)
	struct Unknown UW-CompassWidget; // 0x498 (8)
	struct Unknown UW-HUDMessageWidget; // 0x4A0 (8)
	struct Unknown UW-InteractionWidget; // 0x4A8 (8)
	struct Unknown UW-JetpackWidget; // 0x4B0 (8)
	struct Unknown UW-MS; // 0x4B8 (8)
	struct Unknown UW-PerkLevelUp_02; // 0x4C0 (8)
	struct Unknown UW-VehicleWidget; // 0x4C8 (8)
	struct Unknown TargetPawn; // 0x4D0 (8)
	struct Unknown LastDisplayAbility; // 0x4D8 (12)
	struct TArray<Unknown> GainPerkPopups; // 0x4E8 (16)
	struct Unknown UW-RaderCursorWidget; // 0x4F8 (8)
	struct Unknown UW-DefaultCursorWidget; // 0x500 (8)
	struct Unknown Timer_IsMouseWidgetInMap; // 0x508 (8)
	struct Unknown UW-NitroBoomTargetWidget; // 0x510 (8)
	char bIsShow : 0; // 0x518 (1)
	float TmpViewportUpAngle; // 0x51C (4)
	float TmpViewportSideAngle; // 0x520 (4)
	struct Unknown CenterPosition; // 0x524 (8)
	struct Unknown UW-MapImageRef; // 0x530 (8)
	struct Unknown Timer_AutoPerkDeck; // 0x538 (8)
	int32_t LastPlayZoneID; // 0x540 (4)
	char bShowLevelUp : 0; // 0x544 (1)
	char IsPlayingUltimateSound : 0; // 0x545 (1)
	char bIsUnlockUltimateSkill : 0; // 0x546 (1)

	void HideSkillMouseCursor(); // Function UW-MainWidget.UW-MainWidget_C.HideSkillMouseCursor(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void ShowSkillMouseCursor(); // Function UW-MainWidget.UW-MainWidget_C.ShowSkillMouseCursor(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void CheckUltimateSound(int32_t CurrentLevel); // Function UW-MainWidget.UW-MainWidget_C.CheckUltimateSound(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void UpdateAllInvalidationbox(); // Function UW-MainWidget.UW-MainWidget_C.UpdateAllInvalidationbox(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
