// WidgetBlueprintGeneratedClass UW-MatchEnd_Ranking.UW-MatchEnd_Ranking_C
class UUW-MatchEnd_Ranking_C : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown FadeIn3; // 0x250 (8)
	struct Unknown FadeIn2; // 0x258 (8)
	struct Unknown RankDown; // 0x260 (8)
	struct Unknown RankUp; // 0x268 (8)
	struct Unknown FadeOut; // 0x270 (8)
	struct Unknown FadeIn; // 0x278 (8)
	struct Unknown Button_DeathCam; // 0x280 (8)
	struct Unknown Button_Exit; // 0x288 (8)
	struct Unknown Button_Report; // 0x290 (8)
	struct Unknown Button_Spectate; // 0x298 (8)
	struct Unknown Image; // 0x2A0 (8)
	struct Unknown Image_2; // 0x2A8 (8)
	struct Unknown Image_3; // 0x2B0 (8)
	struct Unknown Image_4; // 0x2B8 (8)
	struct Unknown Image_5; // 0x2C0 (8)
	struct Unknown Image_6; // 0x2C8 (8)
	struct Unknown Image_7; // 0x2D0 (8)
	struct Unknown Image_8; // 0x2D8 (8)
	struct Unknown Image_135; // 0x2E0 (8)
	struct Unknown Image_149; // 0x2E8 (8)
	struct Unknown Image_239; // 0x2F0 (8)
	struct Unknown Image_314; // 0x2F8 (8)
	struct Unknown Image_377; // 0x300 (8)
	struct Unknown Image_444; // 0x308 (8)
	struct Unknown Image_477; // 0x310 (8)
	struct Unknown Image_518; // 0x318 (8)
	struct Unknown Image_531; // 0x320 (8)
	struct Unknown Image_745; // 0x328 (8)
	struct Unknown Image_992; // 0x330 (8)
	struct Unknown Image_1373; // 0x338 (8)
	struct Unknown Image_1459; // 0x340 (8)
	struct Unknown Image_1506; // 0x348 (8)
	struct Unknown Image_1508; // 0x350 (8)
	struct Unknown Image_1925; // 0x358 (8)
	struct Unknown Image_NextTireIcon; // 0x360 (8)
	struct Unknown Light_01; // 0x368 (8)
	struct Unknown Light_02; // 0x370 (8)
	struct Unknown Light_03; // 0x378 (8)
	struct Unknown Light_04; // 0x380 (8)
	struct Unknown Light_05; // 0x388 (8)
	struct Unknown Light_06; // 0x390 (8)
	struct Unknown Light_07; // 0x398 (8)
	struct Unknown Light_08; // 0x3A0 (8)
	struct Unknown Overlay_Rank; // 0x3A8 (8)
	struct Unknown Overlay_Report; // 0x3B0 (8)
	struct Unknown Overlay_Spectate; // 0x3B8 (8)
	struct Unknown ProgressBar_Current; // 0x3C0 (8)
	struct Unknown ProgressBar_Down; // 0x3C8 (8)
	struct Unknown ProgressBar_Up; // 0x3D0 (8)
	struct Unknown ScrollBox_GoldList; // 0x3D8 (8)
	struct Unknown ScrollBox_ItemList; // 0x3E0 (8)
	struct Unknown SizeBox_8; // 0x3E8 (8)
	struct Unknown Spacer_6018; // 0x3F0 (8)
	struct Unknown Spacer_6217; // 0x3F8 (8)
	struct Unknown Spacer_Center; // 0x400 (8)
	struct Unknown T_RemainTime; // 0x408 (8)
	struct Unknown team_kill; // 0x410 (8)
	struct Unknown Team_Revives; // 0x418 (8)
	struct Unknown Text_Report; // 0x420 (8)
	struct Unknown TextBlock_1425; // 0x428 (8)
	struct Unknown TextBlock_CurrentRP; // 0x430 (8)
	struct Unknown TextBlock_ItemCount; // 0x438 (8)
	struct Unknown TextBlock_Kill; // 0x440 (8)
	struct Unknown TextBlock_MatchRP; // 0x448 (8)
	struct Unknown TextBlock_NextRP; // 0x450 (8)
	struct Unknown TextBlock_Rank; // 0x458 (8)
	struct Unknown TextBlock_Resuscitates; // 0x460 (8)
	struct Unknown TextBlock_Title; // 0x468 (8)
	struct Unknown TextBlock_TotalGold; // 0x470 (8)
	struct Unknown TextBlock_TotalTeamCount; // 0x478 (8)
	struct Unknown UW-MatchEnd_RewardSlot; // 0x480 (8)
	struct Unknown UW-MatchEnd_RewardSlot_C; // 0x488 (8)
	struct Unknown UW-MatchEnd_RewardSlot_C_1; // 0x490 (8)
	struct Unknown UW-MatchEnd_RewardSlot_C_2; // 0x498 (8)
	struct Unknown UW-RewardGoldSlot; // 0x4A0 (8)
	struct Unknown VerticalBox_188; // 0x4A8 (8)
	struct Unknown FinalResultData; // 0x4B0 (4)
	struct Unknown PlayerState; // 0x4B8 (8)
	struct Unknown Timehandle_Rank; // 0x4C0 (8)
	int32_t PlayerOriRP; // 0x4C8 (4)
	int32_t TargetRP; // 0x4CC (4)
	int32_t CurrentRP; // 0x4D0 (4)
	int32_t NextTireRP; // 0x4D4 (4)
	char Increase : 0; // 0x4D8 (1)
	int32_t CurrentTierID; // 0x4DC (4)
	char bMaxPrograssbar : 0; // 0x4E0 (1)
	struct Unknown MatchEndWidgetRef; // 0x4E8 (8)
	int32_t RandomGold; // 0x4F0 (4)
	struct Unknown GoldHandle; // 0x4F8 (8)
	char IsWinningCam : 0; // 0x500 (1)
	int32_t GainGoldValue; // 0x504 (4)
	struct Unknown GainGoldHandle; // 0x508 (8)
	struct Unknown StartSound; // 0x510 (4)

	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Ranking_4(); // Function UW-MatchEnd_Ranking.UW-MatchEnd_Ranking_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Ranking_4(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Ranking_3(); // Function UW-MatchEnd_Ranking.UW-MatchEnd_Ranking_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Ranking_3(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void SequenceEvent__ENTRYPOINTUW-MatchEnd_Ranking_2(); // Function UW-MatchEnd_Ranking.UW-MatchEnd_Ranking_C.SequenceEvent__ENTRYPOINTUW-MatchEnd_Ranking_2(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
