// WidgetBlueprintGeneratedClass UW-MapComp.UW-MapComp_C
class UUW-MapComp_C : public UBravoHotelMapCompWidget {

public:

	struct Unknown UberGraphFrame; // 0x500 (8)
	struct Unknown Aircraft; // 0x508 (8)
	struct Unknown Background; // 0x510 (8)
	struct Unknown Canvas; // 0x518 (8)
	struct Unknown InvalidationBox_1; // 0x520 (8)
	struct Unknown TestDescentEndPoint_2; // 0x528 (8)
	struct Unknown TestDescentStartPoint_2; // 0x530 (8)
	struct Unknown TestLineRouteDotline_2; // 0x538 (8)
	int32_t MapDisplayInfoFlag; // 0x540 (4)
	struct FMulticastInlineDelegate OnWheelOnMap; // 0x548 (16)
	struct FMulticastInlineDelegate OnMouseButtonUpOnMap; // 0x558 (16)
	struct FMulticastInlineDelegate OnObjectClickOnMap; // 0x568 (16)
	struct FMulticastInlineDelegate OnDragginOnMap; // 0x578 (16)
	char IsDragging : 0; // 0x588 (1)
	float DeltaValue; // 0x58C (4)
	struct TArray<Unknown> GridString_XAxis; // 0x590 (16)
	struct TArray<Unknown> GridString_YAxis; // 0x5A0 (16)
	struct Unknown PersonalSupplyBoxRef; // 0x5B0 (8)
	struct Unknown ReplayFreeCamWidget; // 0x5B8 (8)
	float MapScaleInterpSpeed; // 0x5C0 (4)
	char MouseRightBtnDown : 0; // 0x5C4 (1)
	struct Unknown SelectPingMenuTimer; // 0x5C8 (8)
	struct Unknown SelectionMenu; // 0x5D0 (8)
	struct FMulticastInlineDelegate OnMouseButtonDownOnMap; // 0x5D8 (16)
	struct Unknown MouseButtonDownPos; // 0x5E8 (8)
	char IsUpdateMapScale : 0; // 0x5F0 (1)
	float MapScaleInerpSpeedRatio; // 0x5F4 (4)
	char IsDrawingRoutePing : 0; // 0x5F8 (1)
	struct TArray<Unknown> IgnoreAreaCircleLines; // 0x600 (16)

	void CheckAgreePing(char& bRet, struct Unknown& Location); // Function UW-MapComp.UW-MapComp_C.CheckAgreePing(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void Get Cur Mouse Point(struct Unknown& Pos); // Function UW-MapComp.UW-MapComp_C.Get Cur Mouse Point(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void CalcMapScaleInterpSpeed(int32_t TargetZoomLevel); // Function UW-MapComp.UW-MapComp_C.CalcMapScaleInterpSpeed(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void Remove Area Widget(enum class Unknow Type, struct Unknown Info); // Function UW-MapComp.UW-MapComp_C.Remove Area Widget(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
