// WidgetBlueprintGeneratedClass UW-PersonalSupplyBoxWidget.UW-PersonalSupplyBoxWidget_C
class UUW-PersonalSupplyBoxWidget_C : public UBravoHotelPersonalSupplyBoxWidget {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3F8 (8)
	struct UWidgetAnimation Ani_PadOn; // 0x400 (8)
	struct UImage BG_Pad; // 0x408 (8)
	struct UButton btn_PerkDeckEnabled; // 0x410 (8)
	struct UCanvasPanel Canvas_ChangeEnable; // 0x418 (8)
	struct UCanvasPanel CanvasPanel; // 0x420 (8)
	struct UCanvasPanel CanvasPanel_3; // 0x428 (8)
	struct UComboBoxString ComboBoxString_237; // 0x430 (8)
	struct UTextBlock CurHaveGoldValue; // 0x438 (8)
	struct UTextBlock CurPriceText; // 0x440 (8)
	struct UImage Down; // 0x448 (8)
	struct UImage EquipBg; // 0x450 (8)
	struct UOverlay Free; // 0x458 (8)
	struct UImage GoldImage; // 0x460 (8)
	struct UImage GoldImage_2; // 0x468 (8)
	struct UOverlay GoldLack; // 0x470 (8)
	struct UTextBlock HaveWeaponText; // 0x478 (8)
	struct UHorizontalBox HorizontalBox_1; // 0x480 (8)
	struct UImage Image; // 0x488 (8)
	struct UImage Image_2; // 0x490 (8)
	struct UImage Image_3; // 0x498 (8)
	struct UImage Image_4; // 0x4A0 (8)
	struct UImage Image_5; // 0x4A8 (8)
	struct UImage Image_91; // 0x4B0 (8)
	struct UImage Image_119; // 0x4B8 (8)
	struct UImage Image_172; // 0x4C0 (8)
	struct UImage Image_192; // 0x4C8 (8)
	struct UImage Image_251; // 0x4D0 (8)
	struct UImage Image_362; // 0x4D8 (8)
	struct UImage Image_400; // 0x4E0 (8)
	struct UImage Image_545; // 0x4E8 (8)
	struct UImage Image_552; // 0x4F0 (8)
	struct UImage Image_614; // 0x4F8 (8)
	struct UImage Image_722; // 0x500 (8)
	struct UImage Image_1025; // 0x508 (8)
	struct UImage Image_1262; // 0x510 (8)
	struct UImage ItemIcon; // 0x518 (8)
	struct UTextBlock Items_1Text; // 0x520 (8)
	struct UScrollBox ItemScroll; // 0x528 (8)
	struct UTextBlock ItemsText; // 0x530 (8)
	struct UTextBlock OkText; // 0x538 (8)
	struct UOverlay Overlay_4; // 0x540 (8)
	struct UOverlay Overlay_215; // 0x548 (8)
	struct UImage PriceBg; // 0x550 (8)
	struct UImage PriceBg_2; // 0x558 (8)
	struct UTextBlock PriceText; // 0x560 (8)
	struct UTextBlock PriceValue; // 0x568 (8)
	struct URichTextBlock RichTextBlock; // 0x570 (8)
	struct URichTextBlock RichTextBlock_74; // 0x578 (8)
	struct USizeBox SizeBox_4; // 0x580 (8)
	struct UImage SlotBg; // 0x588 (8)
	struct UTextBlock SortText; // 0x590 (8)
	struct UTextBlock SpecialWeaponText; // 0x598 (8)
	struct UTextBlock TextBlock_3; // 0x5A0 (8)
	struct UImage Up; // 0x5A8 (8)
	struct UUW-PersonalSupplyBoxConsumableItemSlotWidget_C UW-PersonalSupplyBoxConsumableItemSlotWidget_2; // 0x5B0 (8)
	struct UUW-PersonalSupplyBoxConsumableItemSlotWidget_C UW-PersonalSupplyBoxConsumableItemSlotWidget_3; // 0x5B8 (8)
	struct UUW-PersonalSupplyBoxConsumableItemSlotWidget_C UW-PersonalSupplyBoxConsumableItemSlotWidget_4; // 0x5C0 (8)
	struct UUW-PersonalSupplyBoxConsumableItemSlotWidget_C UW-PersonalSupplyBoxConsumableItemSlotWidget_5; // 0x5C8 (8)
	struct UUW-PersonalSupplyBoxConsumableItemSlotWidget_C UW-PersonalSupplyBoxConsumableItemSlotWidget_6; // 0x5D0 (8)
	struct UUW-PersonalSupplyBoxWeaponInfoWidget_C UW-PersonalSupplyBoxWeaponInfoWidget_186; // 0x5D8 (8)
	struct UUW-SupplyToolTip_C UW-SupplyToolTip; // 0x5E0 (8)
	struct UUW-Timer_C UW-Timer; // 0x5E8 (8)
	struct UVerticalBox VerticalBox_1; // 0x5F0 (8)
	struct UScrollBox WeaponScroll; // 0x5F8 (8)
	struct UWidgetSwitcher WidgetSwitcher_1; // 0x600 (8)
	struct TArray<struct FText> SortType; // 0x608 (16)
	struct TArray<struct UImage> RarityList; // 0x618 (16)
	struct TMap<struct FString, struct UUW-ComboBoxText_C> ComboxList; // 0x628 (80)
	struct FString SelectComboBox; // 0x678 (16)
	char IsShowAni : 0; // 0x688 (1)
	char IsFree : 0; // 0x689 (1)
	struct FSupplyItem SaveSupplyItem; // 0x690 (256)
	int32_t CurOwnGold; // 0x790 (4)
	int32_t TotalPrice; // 0x794 (4)

	struct FEventReply OnMouseButtonDown(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // Function UW-PersonalSupplyBoxWidget.UW-PersonalSupplyBoxWidget_C.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	void GetEmptySlot(char& bRet, struct UUW-PersonalSupplyBoxConsumableItemSlotWidget_C& Slot); // Function UW-PersonalSupplyBoxWidget.UW-PersonalSupplyBoxWidget_C.GetEmptySlot(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	char OnDrop(struct FGeometry MyGeometry, struct FPointerEvent PointerEvent, struct UDragDropOperation Operation); // Function UW-PersonalSupplyBoxWidget.UW-PersonalSupplyBoxWidget_C.OnDrop(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
