// WidgetBlueprintGeneratedClass UW-PerkDeckWidget.UW-PerkDeckWidget_C
class UUW-PerkDeckWidget_C : public UBravoHotelPerkDeckWidget {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248 (8)
	struct UWidgetAnimation Msg_open; // 0x250 (8)
	struct UWidgetAnimation POPUP_OPEN; // 0x258 (8)
	struct UWidgetAnimation Idle; // 0x260 (8)
	struct UButton btn_Choose; // 0x268 (8)
	struct UButton btn_OK; // 0x270 (8)
	struct UButton btn_OK_6; // 0x278 (8)
	struct UButton btn_PerkDeck; // 0x280 (8)
	struct UButton Button_CloseMovie; // 0x288 (8)
	struct UButton Button_PlayMovie; // 0x290 (8)
	struct UButton Button_Refresh; // 0x298 (8)
	struct UButton Button_Reselect; // 0x2A0 (8)
	struct UButton Button_SelectMode; // 0x2A8 (8)
	struct UCanvasPanel Canvas_CantSelectMessage; // 0x2B0 (8)
	struct UCanvasPanel Canvas_MovieScreen; // 0x2B8 (8)
	struct UCanvasPanel CanvasPanel_ClassList; // 0x2C0 (8)
	struct UCanvasPanel CanvasPanel_NewbieAdvantage; // 0x2C8 (8)
	struct UCheckBox CheckBox_PerkDeckNotReOpen; // 0x2D0 (8)
	struct UOverlay GoldLack; // 0x2D8 (8)
	struct UHorizontalBox HorizontalBox_ClassList; // 0x2E0 (8)
	struct UHorizontalBox HorizontalBox_PerkDeckReOpen; // 0x2E8 (8)
	struct UImage Image_1; // 0x2F0 (8)
	struct UImage Image_2; // 0x2F8 (8)
	struct UImage Image_5; // 0x300 (8)
	struct UImage Image_10; // 0x308 (8)
	struct UImage Image_11; // 0x310 (8)
	struct UImage Image_13; // 0x318 (8)
	struct UImage Image_134; // 0x320 (8)
	struct UImage Image_213; // 0x328 (8)
	struct UImage Image_247; // 0x330 (8)
	struct UImage Image_271; // 0x338 (8)
	struct UImage Image_276; // 0x340 (8)
	struct UImage Image_335; // 0x348 (8)
	struct UImage Image_342; // 0x350 (8)
	struct UImage Image_484; // 0x358 (8)
	struct UImage Image_566; // 0x360 (8)
	struct UImage Image_1200; // 0x368 (8)
	struct UImage Image_1511; // 0x370 (8)
	struct UImage Image_Class; // 0x378 (8)
	struct UImage Image_ClassIcon; // 0x380 (8)
	struct UImage Image_Cycle; // 0x388 (8)
	struct UImage Image_Cycle_2; // 0x390 (8)
	struct UImage Image_Cycle_4; // 0x398 (8)
	struct UImage Image_Weapon; // 0x3A0 (8)
	struct UImage Img_Movie; // 0x3A8 (8)
	struct UHorizontalBox ReseletTextGroup1; // 0x3B0 (8)
	struct UHorizontalBox ReseletTextGroup1_2; // 0x3B8 (8)
	struct UOverlay ReseletTextGroup2; // 0x3C0 (8)
	struct UOverlay ReseletTextGroup2_2; // 0x3C8 (8)
	struct UOverlay ReseletTextGroup2_4; // 0x3D0 (8)
	struct UScaleBox ScaleBox_ClassList; // 0x3D8 (8)
	struct UScaleBox ScaleBox_SelectNotifyMessage; // 0x3E0 (8)
	struct USizeBox SizeBox_Choose; // 0x3E8 (8)
	struct USizeBox SizeBox_Ok; // 0x3F0 (8)
	struct USizeBox SizeBox_Ok2; // 0x3F8 (8)
	struct USizeBox SizeBox_Random; // 0x400 (8)
	struct USizeBox SizeBox_Refrest; // 0x408 (8)
	struct USizeBox SizeBox_Select; // 0x410 (8)
	struct UTextBlock T_AmmoName; // 0x418 (8)
	struct UTextBlock T_ClassDeckName; // 0x420 (8)
	struct UTextBlock T_ClassDesc; // 0x428 (8)
	struct UTextBlock T_CurrentGold; // 0x430 (8)
	struct UTextBlock T_WeaponDesc; // 0x438 (8)
	struct UTextBlock T_WeaponName; // 0x440 (8)
	struct UTextBlock TextBlock_Close; // 0x448 (8)
	struct UTextBlock TextBlock_Close_2; // 0x450 (8)
	struct UTextBlock TextBlock_Close_7; // 0x458 (8)
	struct UTextBlock TextBlock_MaxReset; // 0x460 (8)
	struct UTextBlock TextBlock_MaxReset_2; // 0x468 (8)
	struct UTextBlock TextBlock_Price_ChangeDeckList; // 0x470 (8)
	struct UTextBlock TextBlock_Price_Random; // 0x478 (8)
	struct UTextBlock TextBlock_Price_Select; // 0x480 (8)
	struct UTextBlock TextBlock_RandomRemainCount; // 0x488 (8)
	struct UTextBlock TextBlock_RefreshRemainCount; // 0x490 (8)
	struct UTextBlock TextBlock_Reselect; // 0x498 (8)
	struct UTextBlock TextBlock_Reselect_2; // 0x4A0 (8)
	struct UTextBlock TextBlock_Reselect_4; // 0x4A8 (8)
	struct UUW-Inventory_Perk_C UW-Inventory_Perk; // 0x4B0 (8)
	struct UUW-Timer_C UW-Timer; // 0x4B8 (8)
	struct UWidgetSwitcher WidgetSwitcher_ChangeDeck; // 0x4C0 (8)
	struct UWidgetSwitcher WidgetSwitcher_ChangeDeck_2; // 0x4C8 (8)
	struct UWidgetSwitcher WidgetSwitcher_Reselect; // 0x4D0 (8)
	struct UWidgetSwitcher WidgetSwitcher_Reselect_2; // 0x4D8 (8)
	struct UWidgetSwitcher WidgetSwitcher_Reselect_4; // 0x4E0 (8)
	struct UUW-InventoryWidget_C InventoryWidget; // 0x4E8 (8)
	struct TArray<struct UUW-Inventory_PopupPerkSlot_C> Slots; // 0x4F0 (16)
	struct FSlateBrush IconBrush; // 0x500 (136)
	struct UUW-Inventory_ItemSlotHover_C HoverWidget; // 0x588 (8)
	struct FTimerHandle HoverTimerHandle; // 0x590 (8)
	int64_t LocalTemp; // 0x598 (8)
	struct UMediaPlayer MediaPlayer; // 0x5A0 (8)
	struct TMap<int32_t, struct UMediaSource> ClassVideo_Map; // 0x5A8 (80)
	char bBlockButton : 0; // 0x5F8 (1)
	char bButtonEnabled : 0; // 0x5F9 (1)
	char bCanRemainCount : 0; // 0x5FA (1)
	char bCanCurrentGold : 0; // 0x5FB (1)
	char bWaitingResponse : 0; // 0x5FC (1)
	int64_t CurrentGold; // 0x600 (8)
	int32_t ChangeDeckCount; // 0x608 (4)
	int32_t ChangeDeckListCount; // 0x60C (4)
	int32_t PerkDeckID; // 0x610 (4)
	int32_t DisableTime; // 0x614 (4)
	struct TMap<struct FName, struct UUW-PerkDeckSelectItemWidget_C> ClassInfoWidgetMap; // 0x618 (80)
	struct FPerkDeckSelectInfo CurrentPerkDeckSelectInfo; // 0x668 (24)
	int32_t LocalPerkMode; // 0x680 (4)
	float ClassListPadding; // 0x684 (4)
	struct FTimerHandle Handle_PlayMovie; // 0x688 (8)
	struct UMediaSource CurrentClassVideo; // 0x690 (8)
	struct FTimerHandle Handle_SetPerkInfoByHoverClassButton; // 0x698 (8)
	char LastClassButtonHovered : 0; // 0x6A0 (1)
	int32_t LastClassIndex; // 0x6A4 (4)

	void SequenceEvent__ENTRYPOINTUW-PerkDeckWidget_3(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.SequenceEvent__ENTRYPOINTUW-PerkDeckWidget_3(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
	void SequenceEvent__ENTRYPOINTUW-PerkDeckWidget_2(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.SequenceEvent__ENTRYPOINTUW-PerkDeckWidget_2(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
	void SequenceEvent__ENTRYPOINTUW-PerkDeckWidget_1(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.SequenceEvent__ENTRYPOINTUW-PerkDeckWidget_1(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
	void SetPerkDeckReOpenCheck(); // Function UW-PerkDeckWidget.UW-PerkDeckWidget_C.SetPerkDeckReOpenCheck(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
