// WidgetBlueprintGeneratedClass UW-PersonalSupplyBoxWidget.UW-PersonalSupplyBoxWidget_C
class UUW-PersonalSupplyBoxWidget_C : public UBravoHotelPersonalSupplyBoxWidget {

public:

	struct Unknown UberGraphFrame; // 0x3F8 (8)
	struct Unknown Ani_PadOn; // 0x400 (8)
	struct Unknown BG_Pad; // 0x408 (8)
	struct Unknown btn_PerkDeckEnabled; // 0x410 (8)
	struct Unknown Canvas_ChangeEnable; // 0x418 (8)
	struct Unknown CanvasPanel; // 0x420 (8)
	struct Unknown CanvasPanel_3; // 0x428 (8)
	struct Unknown ComboBoxString_237; // 0x430 (8)
	struct Unknown CurHaveGoldValue; // 0x438 (8)
	struct Unknown CurPriceText; // 0x440 (8)
	struct Unknown Down; // 0x448 (8)
	struct Unknown EquipBg; // 0x450 (8)
	struct Unknown Free; // 0x458 (8)
	struct Unknown GoldImage; // 0x460 (8)
	struct Unknown GoldImage_2; // 0x468 (8)
	struct Unknown GoldLack; // 0x470 (8)
	struct Unknown HaveWeaponText; // 0x478 (8)
	struct Unknown HorizontalBox_1; // 0x480 (8)
	struct Unknown Image; // 0x488 (8)
	struct Unknown Image_2; // 0x490 (8)
	struct Unknown Image_3; // 0x498 (8)
	struct Unknown Image_4; // 0x4A0 (8)
	struct Unknown Image_5; // 0x4A8 (8)
	struct Unknown Image_91; // 0x4B0 (8)
	struct Unknown Image_119; // 0x4B8 (8)
	struct Unknown Image_172; // 0x4C0 (8)
	struct Unknown Image_192; // 0x4C8 (8)
	struct Unknown Image_251; // 0x4D0 (8)
	struct Unknown Image_362; // 0x4D8 (8)
	struct Unknown Image_400; // 0x4E0 (8)
	struct Unknown Image_545; // 0x4E8 (8)
	struct Unknown Image_552; // 0x4F0 (8)
	struct Unknown Image_614; // 0x4F8 (8)
	struct Unknown Image_722; // 0x500 (8)
	struct Unknown Image_1025; // 0x508 (8)
	struct Unknown Image_1262; // 0x510 (8)
	struct Unknown ItemIcon; // 0x518 (8)
	struct Unknown Items_1Text; // 0x520 (8)
	struct Unknown ItemScroll; // 0x528 (8)
	struct Unknown ItemsText; // 0x530 (8)
	struct Unknown OkText; // 0x538 (8)
	struct Unknown Overlay_4; // 0x540 (8)
	struct Unknown Overlay_215; // 0x548 (8)
	struct Unknown PriceBg; // 0x550 (8)
	struct Unknown PriceBg_2; // 0x558 (8)
	struct Unknown PriceText; // 0x560 (8)
	struct Unknown PriceValue; // 0x568 (8)
	struct Unknown RichTextBlock; // 0x570 (8)
	struct Unknown RichTextBlock_74; // 0x578 (8)
	struct Unknown SizeBox_4; // 0x580 (8)
	struct Unknown SlotBg; // 0x588 (8)
	struct Unknown SortText; // 0x590 (8)
	struct Unknown SpecialWeaponText; // 0x598 (8)
	struct Unknown TextBlock_3; // 0x5A0 (8)
	struct Unknown Up; // 0x5A8 (8)
	struct Unknown UW-PersonalSupplyBoxConsumableItemSlotWidget_2; // 0x5B0 (8)
	struct Unknown UW-PersonalSupplyBoxConsumableItemSlotWidget_3; // 0x5B8 (8)
	struct Unknown UW-PersonalSupplyBoxConsumableItemSlotWidget_4; // 0x5C0 (8)
	struct Unknown UW-PersonalSupplyBoxConsumableItemSlotWidget_5; // 0x5C8 (8)
	struct Unknown UW-PersonalSupplyBoxConsumableItemSlotWidget_6; // 0x5D0 (8)
	struct Unknown UW-PersonalSupplyBoxWeaponInfoWidget_186; // 0x5D8 (8)
	struct Unknown UW-SupplyToolTip; // 0x5E0 (8)
	struct Unknown UW-Timer; // 0x5E8 (8)
	struct Unknown VerticalBox_1; // 0x5F0 (8)
	struct Unknown WeaponScroll; // 0x5F8 (8)
	struct Unknown WidgetSwitcher_1; // 0x600 (8)
	struct TArray<Unknown> SortType; // 0x608 (16)
	struct TArray<Unknown> RarityList; // 0x618 (16)
	struct TMap<Unknown, Unknown> ComboxList; // 0x628 (80)
	struct FString SelectComboBox; // 0x678 (16)
	char IsShowAni : 0; // 0x688 (1)
	char IsFree : 0; // 0x689 (1)
	struct Unknown SaveSupplyItem; // 0x690 (256)
	int32_t CurOwnGold; // 0x790 (4)
	int32_t TotalPrice; // 0x794 (4)

	struct Unknown OnMouseButtonDown(struct Unknown MyGeometry, struct Unknown& MouseEvent); // Function UW-PersonalSupplyBoxWidget.UW-PersonalSupplyBoxWidget_C.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	void GetEmptySlot(char& bRet, struct Unknown& Slot); // Function UW-PersonalSupplyBoxWidget.UW-PersonalSupplyBoxWidget_C.GetEmptySlot(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
	char OnDrop(struct Unknown MyGeometry, struct Unknown PointerEvent, struct Unknown Operation); // Function UW-PersonalSupplyBoxWidget.UW-PersonalSupplyBoxWidget_C.OnDrop(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B6DD70>
