// WidgetBlueprintGeneratedClass UW-ReplayTimelineBasic.UW-ReplayTimelineBasic_C
class UUW-ReplayTimelineBasic_C : public UBravoHotelReplayTimelineWidget {

public:

	struct Unknown UberGraphFrame; // 0x360 (8)
	struct Unknown Bg; // 0x368 (8)
	struct Unknown Border_Timeline; // 0x370 (8)
	struct Unknown Border_TimeToGo; // 0x378 (8)
	struct Unknown BT_FreeCam; // 0x380 (8)
	struct Unknown BT_ReplayPause; // 0x388 (8)
	struct Unknown BT_ReplayResume; // 0x390 (8)
	struct Unknown BT_SpeedDown; // 0x398 (8)
	struct Unknown BT_SpeedUp; // 0x3A0 (8)
	struct Unknown BT_TimelineScaleDown; // 0x3A8 (8)
	struct Unknown BT_TimelineScaleUp; // 0x3B0 (8)
	struct Unknown Canvas_EventMarkers; // 0x3B8 (8)
	struct Unknown Chk_ShowKill; // 0x3C0 (8)
	struct Unknown Chk_ShowKnockout; // 0x3C8 (8)
	struct Unknown Chk_ShowMyKill; // 0x3D0 (8)
	struct Unknown Chk_ShowMyKnockout; // 0x3D8 (8)
	struct Unknown Chk_ShowMyResuscitated; // 0x3E0 (8)
	struct Unknown Chk_ShowResuscitated; // 0x3E8 (8)
	struct Unknown ReplayTimelineSlider; // 0x3F0 (8)
	struct Unknown ScrollBox_Timeline; // 0x3F8 (8)
	struct Unknown SizeBox_Timeline; // 0x400 (8)
	struct Unknown Slider_TimelineScale; // 0x408 (8)
	struct Unknown T_CameraType; // 0x410 (8)
	struct Unknown T_CurrentTime; // 0x418 (8)
	struct Unknown T_PlaySpeed; // 0x420 (8)
	struct Unknown T_TimeToGo; // 0x428 (8)
	struct Unknown T_TotalTime; // 0x430 (8)
	float TimelineSizeBoxOffset; // 0x438 (4)
	struct Unknown* Class_EventMarker_Kill; // 0x440 (8)
	struct Unknown* Class_EventMarker_Knockout; // 0x448 (8)
	float LastViewportSize; // 0x450 (4)
	char IsMouseOnBorder : 0; // 0x454 (1)
	struct Unknown* Class_EventMarker_Resuscitated; // 0x458 (8)
	struct Unknown* Class_EventMarker_WhenReported; // 0x460 (8)
	enum class Unknow CameraType; // 0x468 (1)
	char ViewMode; // 0x469 (1)

	void CheckCameraType(); // Function UW-ReplayTimelineBasic.UW-ReplayTimelineBasic_C.CheckCameraType(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	struct Unknown GetTimelineToolTipPositionBySlider(struct FString& ToolTipTime); // Function UW-ReplayTimelineBasic.UW-ReplayTimelineBasic_C.GetTimelineToolTipPositionBySlider(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	void SetTimeToGo(); // Function UW-ReplayTimelineBasic.UW-ReplayTimelineBasic_C.SetTimeToGo(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	void CheckTimeToGo(); // Function UW-ReplayTimelineBasic.UW-ReplayTimelineBasic_C.CheckTimeToGo(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
	void CalcTimelineScale(char IsUpScale); // Function UW-ReplayTimelineBasic.UW-ReplayTimelineBasic_C.CalcTimelineScale(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B812B0>
