// WidgetBlueprintGeneratedClass UW-ScenarioStartPopup.UW-ScenarioStartPopup_C
class UUW-ScenarioStartPopup_C : public UUserWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Ani_FadeOut; // 0x250 (8)
	struct Unknown Ani_FadeIn; // 0x258 (8)
	struct Unknown 1; // 0x260 (8)
	struct Unknown 10; // 0x268 (8)
	struct Unknown 2; // 0x270 (8)
	struct Unknown 3; // 0x278 (8)
	struct Unknown 4; // 0x280 (8)
	struct Unknown 5; // 0x288 (8)
	struct Unknown 6; // 0x290 (8)
	struct Unknown 7; // 0x298 (8)
	struct Unknown 8; // 0x2A0 (8)
	struct Unknown 9; // 0x2A8 (8)
	struct Unknown Button_Beteran; // 0x2B0 (8)
	struct Unknown Button_GamePlayTutorial; // 0x2B8 (8)
	struct Unknown Button_TutorialMovie; // 0x2C0 (8)
	struct Unknown Image_62; // 0x2C8 (8)
	struct Unknown Image_369; // 0x2D0 (8)
	struct Unknown Light1; // 0x2D8 (8)
	struct Unknown Light2; // 0x2E0 (8)
	struct Unknown red1; // 0x2E8 (8)
	struct Unknown red2; // 0x2F0 (8)
	struct Unknown RichTextBlock; // 0x2F8 (8)
	struct Unknown RichTextBlock_418; // 0x300 (8)
	char NextScene : 0; // 0x308 (1)

	void MoveNextScene(); // Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.MoveNextScene(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void Construct(); // Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void BndEvt__Button_247_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.BndEvt__Button_247_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void CustomEvent_1(); // Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.CustomEvent_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void CustomEvent(); // Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.CustomEvent(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void BndEvt__Button_Beteran_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.BndEvt__Button_Beteran_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void CustomEvent_2(); // Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.CustomEvent_2(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void OnTrainingModeOffDelegate_Event_1(); // Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.OnTrainingModeOffDelegate_Event_1(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void ExecuteUbergraph_UW-ScenarioStartPopup(int32_t EntryPoint); // Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.ExecuteUbergraph_UW-ScenarioStartPopup(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
};

// Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.MoveNextScene
inline void UUW-ScenarioStartPopup_C::MoveNextScene() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.MoveNextScene");

	struct MoveNextScene_Params {
		
	}; MoveNextScene_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.Construct
inline void UUW-ScenarioStartPopup_C::Construct() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.Construct");

	struct Construct_Params {
		
	}; Construct_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
inline void UUW-ScenarioStartPopup_C::BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature");

	struct BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params {
		
	}; BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.BndEvt__Button_247_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
inline void UUW-ScenarioStartPopup_C::BndEvt__Button_247_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.BndEvt__Button_247_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature");

	struct BndEvt__Button_247_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params {
		
	}; BndEvt__Button_247_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.CustomEvent_1
inline void UUW-ScenarioStartPopup_C::CustomEvent_1() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.CustomEvent_1");

	struct CustomEvent_1_Params {
		
	}; CustomEvent_1_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.CustomEvent
inline void UUW-ScenarioStartPopup_C::CustomEvent() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.CustomEvent");

	struct CustomEvent_Params {
		
	}; CustomEvent_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.BndEvt__Button_Beteran_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
inline void UUW-ScenarioStartPopup_C::BndEvt__Button_Beteran_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.BndEvt__Button_Beteran_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature");

	struct BndEvt__Button_Beteran_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params {
		
	}; BndEvt__Button_Beteran_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.CustomEvent_2
inline void UUW-ScenarioStartPopup_C::CustomEvent_2() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.CustomEvent_2");

	struct CustomEvent_2_Params {
		
	}; CustomEvent_2_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.OnTrainingModeOffDelegate_Event_1
inline void UUW-ScenarioStartPopup_C::OnTrainingModeOffDelegate_Event_1() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.OnTrainingModeOffDelegate_Event_1");

	struct OnTrainingModeOffDelegate_Event_1_Params {
		
	}; OnTrainingModeOffDelegate_Event_1_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.ExecuteUbergraph_UW-ScenarioStartPopup
inline void UUW-ScenarioStartPopup_C::ExecuteUbergraph_UW-ScenarioStartPopup(int32_t EntryPoint) {
	static auto fn = UObject::FindObject<UFunction>("Function UW-ScenarioStartPopup.UW-ScenarioStartPopup_C.ExecuteUbergraph_UW-ScenarioStartPopup");

	struct ExecuteUbergraph_UW-ScenarioStartPopup_Params {
		int32_t EntryPoint;
	}; ExecuteUbergraph_UW-ScenarioStartPopup_Params Params;

	Params.EntryPoint = EntryPoint;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

