// WidgetBlueprintGeneratedClass UW-Sight_Digital_Background.UW-Sight_Digital_Background_C
class UUW-Sight_Digital_Background_C : public UBravoHotelScopeWidget {

public:

	struct Unknown UberGraphFrame; // 0x248 (8)
	struct Unknown Idle; // 0x250 (8)
	struct Unknown Scope_In; // 0x258 (8)
	struct Unknown CanvasPanel_1; // 0x260 (8)
	struct Unknown Distance_Image; // 0x268 (8)
	struct Unknown Distance_Text; // 0x270 (8)
	struct Unknown Magnify_Image; // 0x278 (8)
	struct Unknown Magnify_Text; // 0x280 (8)
	struct Unknown Scope_BG; // 0x288 (8)
	struct Unknown Scope_Info_Line; // 0x290 (8)
	struct Unknown Scope_Wing; // 0x298 (8)

	struct Unknown Get_Distance_Text_ColorAndOpacity_1(); // Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.Get_Distance_Text_ColorAndOpacity_1(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	struct FText Get_Magnify_Text(); // Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.Get_Magnify_Text(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	struct FText Get_DistanceText(); // Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.Get_DistanceText(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void SetScopeImageAngle(float NewAngle); // Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.SetScopeImageAngle(BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void K2_OnEnterADS(); // Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.K2_OnEnterADS(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void K2_OnExitADS(); // Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.K2_OnExitADS(Event|Public|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void ExecuteUbergraph_UW-Sight_Digital_Background(int32_t EntryPoint); // Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.ExecuteUbergraph_UW-Sight_Digital_Background(Final|UbergraphFunction) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
};

// Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.Get_Distance_Text_ColorAndOpacity_1
inline struct Unknown UUW-Sight_Digital_Background_C::Get_Distance_Text_ColorAndOpacity_1() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.Get_Distance_Text_ColorAndOpacity_1");

	struct Get_Distance_Text_ColorAndOpacity_1_Params {
		
		struct Unknown ReturnValue;

	}; Get_Distance_Text_ColorAndOpacity_1_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;

	return params.ReturnValue;
}

// Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.Get_Magnify_Text
inline struct FText UUW-Sight_Digital_Background_C::Get_Magnify_Text() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.Get_Magnify_Text");

	struct Get_Magnify_Text_Params {
		
		struct FText ReturnValue;

	}; Get_Magnify_Text_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;

	return params.ReturnValue;
}

// Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.Get_DistanceText
inline struct FText UUW-Sight_Digital_Background_C::Get_DistanceText() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.Get_DistanceText");

	struct Get_DistanceText_Params {
		
		struct FText ReturnValue;

	}; Get_DistanceText_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;

	return params.ReturnValue;
}

// Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.SetScopeImageAngle
inline void UUW-Sight_Digital_Background_C::SetScopeImageAngle(float NewAngle) {
	static auto fn = UObject::FindObject<UFunction>("Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.SetScopeImageAngle");

	struct SetScopeImageAngle_Params {
		float NewAngle;
	}; SetScopeImageAngle_Params Params;

	Params.NewAngle = NewAngle;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.K2_OnEnterADS
inline void UUW-Sight_Digital_Background_C::K2_OnEnterADS() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.K2_OnEnterADS");

	struct K2_OnEnterADS_Params {
		
	}; K2_OnEnterADS_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.K2_OnExitADS
inline void UUW-Sight_Digital_Background_C::K2_OnExitADS() {
	static auto fn = UObject::FindObject<UFunction>("Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.K2_OnExitADS");

	struct K2_OnExitADS_Params {
		
	}; K2_OnExitADS_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.ExecuteUbergraph_UW-Sight_Digital_Background
inline void UUW-Sight_Digital_Background_C::ExecuteUbergraph_UW-Sight_Digital_Background(int32_t EntryPoint) {
	static auto fn = UObject::FindObject<UFunction>("Function UW-Sight_Digital_Background.UW-Sight_Digital_Background_C.ExecuteUbergraph_UW-Sight_Digital_Background");

	struct ExecuteUbergraph_UW-Sight_Digital_Background_Params {
		int32_t EntryPoint;
	}; ExecuteUbergraph_UW-Sight_Digital_Background_Params Params;

	Params.EntryPoint = EntryPoint;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

