// WidgetBlueprintGeneratedClass UW-TopInfoWidget.UW-TopInfoWidget_C
class UUW-TopInfoWidget_C : public UBravoHotelTopInfoWidget {

public:

	struct Unknown UberGraphFrame; // 0x278 (8)
	struct Unknown Anim_HideWidget; // 0x280 (8)
	struct Unknown Canvas; // 0x288 (8)
	struct Unknown Canvas_Minimap; // 0x290 (8)
	struct Unknown CanvasPanel_StatupFirst; // 0x298 (8)
	struct Unknown CanvasPanel_StatupThird; // 0x2A0 (8)
	struct Unknown T_GameVersion; // 0x2A8 (8)
	struct Unknown UW-CastingWidget; // 0x2B0 (8)
	struct Unknown UW-DamageLogWidget; // 0x2B8 (8)
	struct Unknown UW-HUDMessageWidget; // 0x2C0 (8)
	struct Unknown UW-Inventory_Perk; // 0x2C8 (8)
	struct Unknown UW-KillInfoWidget; // 0x2D0 (8)
	struct Unknown UW-MinimapWidget; // 0x2D8 (8)
	struct Unknown UW-PlayerInfoWidget_02; // 0x2E0 (8)
	struct Unknown UW-StatupWidget; // 0x2E8 (8)
	struct Unknown UW-TeamInfoWidget; // 0x2F0 (8)
	struct Unknown UW-Volume; // 0x2F8 (8)
	struct Unknown Vertical_MinimapAndTeamInfo; // 0x300 (8)
	struct Unknown PlayerController; // 0x308 (8)
	struct Unknown UW-Inventory_ItemSlotHover; // 0x310 (8)
	struct Unknown MainWidget; // 0x318 (8)
	enum class Unknow CurrentState; // 0x320 (1)
	struct Unknown LastDisplayAbility; // 0x324 (12)

	void ShowStatupAnim(struct Unknown& StatupParams); // Function UW-TopInfoWidget.UW-TopInfoWidget_C.ShowStatupAnim(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void CheckStatupAnim(struct Unknown& DisplayAbility); // Function UW-TopInfoWidget.UW-TopInfoWidget_C.CheckStatupAnim(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void OnShowNotRecorverHPMessage(char Type, int32_t ItemId); // Function UW-TopInfoWidget.UW-TopInfoWidget_C.OnShowNotRecorverHPMessage(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
	void On Battle Royale State Changed(enum class Unknow PreviousState, enum class Unknow CurrentState); // Function UW-TopInfoWidget.UW-TopInfoWidget_C.On Battle Royale State Changed(Public|BlueprintCallable|BlueprintEvent) // <Game_BE.exe+0x2B80160>
