// WidgetBlueprintGeneratedClass UW-TopInfoWidget.UW-TopInfoWidget_C
class UUW-TopInfoWidget_C : public UBravoHotelTopInfoWidget {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x278 (8)
	struct UWidgetAnimation Anim_HideWidget; // 0x280 (8)
	struct UCanvasPanel Canvas; // 0x288 (8)
	struct UCanvasPanel Canvas_Minimap; // 0x290 (8)
	struct UCanvasPanel CanvasPanel_StatupFirst; // 0x298 (8)
	struct UCanvasPanel CanvasPanel_StatupThird; // 0x2A0 (8)
	struct UTextBlock T_GameVersion; // 0x2A8 (8)
	struct UUW-CastingWidget_C UW-CastingWidget; // 0x2B0 (8)
	struct UUW-HUDMessageWidget_C UW-HUDMessageWidget; // 0x2B8 (8)
	struct UUW-Inventory_Perk_C UW-Inventory_Perk; // 0x2C0 (8)
	struct UUW-ListWidget_C UW-ListWidget_DamageLog; // 0x2C8 (8)
	struct UUW-ListWidget_C UW-ListWidget_GainPerk; // 0x2D0 (8)
	struct UUW-ListWidget_C UW-ListWidget_KillMessage; // 0x2D8 (8)
	struct UUW-MinimapWidget_C UW-MinimapWidget; // 0x2E0 (8)
	struct UUW-PlayerInfoWidget_Renew_C UW-PlayerInfoWidget_02; // 0x2E8 (8)
	struct UUW-StatupWidget_C UW-StatupWidget; // 0x2F0 (8)
	struct UUW-TeamInfoWidget_C UW-TeamInfoWidget; // 0x2F8 (8)
	struct UUW-Volume_C UW-Volume; // 0x300 (8)
	struct UVerticalBox Vertical_MinimapAndTeamInfo; // 0x308 (8)
	struct ABravoHotelPlayerController PlayerController; // 0x310 (8)
	struct UUW-Inventory_ItemSlotHover_C UW-Inventory_ItemSlotHover; // 0x318 (8)
	struct UBravoHotelMainWidget MainWidget; // 0x320 (8)
	enum class EPlayerState CurrentState; // 0x328 (1)
	struct FDisplayAbility LastDisplayAbility; // 0x32C (12)

	void ShowStatupAnim(struct FStatupAnimParameters& StatupParams); // Function UW-TopInfoWidget.UW-TopInfoWidget_C.ShowStatupAnim(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	void CheckStatupAnim(struct FDisplayAbility& DisplayAbility); // Function UW-TopInfoWidget.UW-TopInfoWidget_C.CheckStatupAnim(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
	void OnShowNotRecorverHPMessage(char Type, int32_t ItemId); // Function UW-TopInfoWidget.UW-TopInfoWidget_C.OnShowNotRecorverHPMessage(Public|HasDefaults|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B86EC0>
