// WidgetBlueprintGeneratedClass UW-VehicleSeatWidget.UW-VehicleSeatWidget_C
class UUW-VehicleSeatWidget_C : public UUserWidget {

public:

	struct Unknown Image_81; // 0x248 (8)
	struct Unknown Image_86; // 0x250 (8)
	struct Unknown Image_88; // 0x258 (8)
	struct Unknown Image_89; // 0x260 (8)
	struct Unknown Image_90; // 0x268 (8)
	struct Unknown Image_91; // 0x270 (8)
	struct Unknown Image_92; // 0x278 (8)
	struct Unknown Image_93; // 0x280 (8)
	struct Unknown Image_94; // 0x288 (8)
	struct Unknown Image_95; // 0x290 (8)
	struct Unknown Image_96; // 0x298 (8)
	struct Unknown Image_97; // 0x2A0 (8)
	struct Unknown Image_98; // 0x2A8 (8)
	struct Unknown Image_99; // 0x2B0 (8)
	struct Unknown Image_100; // 0x2B8 (8)
	struct Unknown Image_101; // 0x2C0 (8)
	struct Unknown Image_102; // 0x2C8 (8)
	struct Unknown Image_103; // 0x2D0 (8)
	struct Unknown Image_104; // 0x2D8 (8)
	struct Unknown Image_107; // 0x2E0 (8)
	struct Unknown Image_108; // 0x2E8 (8)
	struct Unknown Image_119; // 0x2F0 (8)
	struct Unknown Image_120; // 0x2F8 (8)
	struct Unknown Image_121; // 0x300 (8)
	struct Unknown Image_122; // 0x308 (8)
	struct Unknown Image_123; // 0x310 (8)
	struct Unknown Image_134; // 0x318 (8)
	struct Unknown Image_137; // 0x320 (8)
	struct Unknown Image_138; // 0x328 (8)
	struct Unknown Image_139; // 0x330 (8)
	struct Unknown Image_140; // 0x338 (8)
	struct Unknown Image_141; // 0x340 (8)
	struct Unknown Image_142; // 0x348 (8)
	struct Unknown Image_143; // 0x350 (8)
	struct Unknown Image_144; // 0x358 (8)
	struct Unknown Image_145; // 0x360 (8)
	struct Unknown Image_146; // 0x368 (8)
	struct Unknown Image_147; // 0x370 (8)
	struct Unknown Image_148; // 0x378 (8)
	struct Unknown Image_149; // 0x380 (8)
	struct Unknown Image_152; // 0x388 (8)
	struct Unknown Image_153; // 0x390 (8)
	struct Unknown Image_154; // 0x398 (8)
	struct Unknown Image_155; // 0x3A0 (8)
	struct Unknown Image_156; // 0x3A8 (8)
	struct Unknown Image_157; // 0x3B0 (8)
	struct Unknown Image_158; // 0x3B8 (8)
	struct Unknown Image_159; // 0x3C0 (8)
	struct Unknown Image_160; // 0x3C8 (8)
	struct Unknown Image_161; // 0x3D0 (8)
	struct Unknown Image_162; // 0x3D8 (8)
	struct Unknown Image_163; // 0x3E0 (8)
	struct Unknown Image_164; // 0x3E8 (8)
	struct Unknown WidgetSwitcher_1; // 0x3F0 (8)
};

