// WidgetBlueprintGeneratedClass UW-WorldMapWidget.UW-WorldMapWidget_C
class UUW-WorldMapWidget_C : public UBravoHotelWorldMapWidget {

public:

	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2B8 (8)
	struct UWidgetAnimation FadeIn; // 0x2C0 (8)
	struct UWidgetAnimation NewAnimation_2; // 0x2C8 (8)
	struct UImage Bg; // 0x2D0 (8)
	struct UBP-CheckWeightMap_C BP-CheckWeightMap; // 0x2D8 (8)
	struct UUW-MapComp_C BP-MapComp; // 0x2E0 (8)
	struct UButton CloseButton; // 0x2E8 (8)
	struct UButton ShowHelBoxButton; // 0x2F0 (8)
	struct UUW-ClassinfoitemBoardWidget_C UW-ClassinfoitemBoardWidget; // 0x2F8 (8)
	struct UWidgetSwitcher WidgetSwitcher_1; // 0x300 (8)
	int32_t MAX_ZOOM_LEVEL; // 0x308 (4)
	int32_t zoomLevel; // 0x30C (4)
	float MAX_SCALE_FACTOR; // 0x310 (4)
	int32_t InitializeCount; // 0x314 (4)
	struct FVector2D PosOnViewport; // 0x318 (8)
	float CurrentScaleFactor; // 0x320 (4)
	struct FVector2D MouseButtonDownPos; // 0x324 (8)
	struct FTimerHandle SelectPingMenuTimer; // 0x330 (8)
	struct UWBP_SPS_SelectionMenu_C SelectionMenu; // 0x338 (8)
	char IsRoutePing : 0; // 0x340 (1)
	int32_t MaxRoutePointCount; // 0x344 (4)
	struct TArray<struct FVector> RoutePointArray; // 0x348 (16)

	struct UBravoHotelMapCompWidget GetMapCompWidget(); // Function UW-WorldMapWidget.UW-WorldMapWidget_C.GetMapCompWidget(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
	void SetClassInfoBoardVisibilityByZoomLevel(int32_t LastZoomLevel, int32_t NewZoomLevel); // Function UW-WorldMapWidget.UW-WorldMapWidget_C.SetClassInfoBoardVisibilityByZoomLevel(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
	void GetZoomLevel(int32_t& zoomLevel); // Function UW-WorldMapWidget.UW-WorldMapWidget_C.GetZoomLevel(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2BA5C80>
