// WidgetBlueprintGeneratedClass UW-WorldMapWidget.UW-WorldMapWidget_C
class UUW-WorldMapWidget_C : public UBravoHotelWorldMapWidget {

public:

	struct Unknown UberGraphFrame; // 0x2B8 (8)
	struct Unknown FadeIn; // 0x2C0 (8)
	struct Unknown NewAnimation_2; // 0x2C8 (8)
	struct Unknown Bg; // 0x2D0 (8)
	struct Unknown BP-CheckWeightMap; // 0x2D8 (8)
	struct Unknown BP-MapComp; // 0x2E0 (8)
	struct Unknown CloseButton; // 0x2E8 (8)
	struct Unknown ShowHelBoxButton; // 0x2F0 (8)
	struct Unknown UW-ClassinfoitemBoardWidget; // 0x2F8 (8)
	struct Unknown WidgetSwitcher_1; // 0x300 (8)
	int32_t MAX_ZOOM_LEVEL; // 0x308 (4)
	int32_t ZoomLevel; // 0x30C (4)
	float MAX_SCALE_FACTOR; // 0x310 (4)
	int32_t InitializeCount; // 0x314 (4)
	struct Unknown PosOnViewport; // 0x318 (8)
	float CurrentScaleFactor; // 0x320 (4)
	struct Unknown MouseButtonDownPos; // 0x324 (8)
	struct Unknown SelectPingMenuTimer; // 0x330 (8)
	struct Unknown SelectionMenu; // 0x338 (8)
	char IsRoutePing : 0; // 0x340 (1)
	int32_t MaxRoutePointCount; // 0x344 (4)
	struct TArray<Unknown> RoutePointArray; // 0x348 (16)

	void SetClassInfoBoardVisibilityByZoomLevel(int32_t LastZoomLevel, int32_t NewZoomLevel); // Function UW-WorldMapWidget.UW-WorldMapWidget_C.SetClassInfoBoardVisibilityByZoomLevel(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void GetZoomLevel(int32_t& ZoomLevel); // Function UW-WorldMapWidget.UW-WorldMapWidget_C.GetZoomLevel(Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void StopRoutePing(); // Function UW-WorldMapWidget.UW-WorldMapWidget_C.StopRoutePing(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
	void UpdateRoutePing(); // Function UW-WorldMapWidget.UW-WorldMapWidget_C.UpdateRoutePing(Public|BlueprintCallable|BlueprintEvent) // <BravoHotelClient-Win64-Shipping.protected.exe+0x2B812B0>
