// WidgetBlueprintGeneratedClass UW_ReplayUserNameTooltip.UW_ReplayUserNameTooltip_C
struct UUW_ReplayUserNameTooltip_C : UBravoHotelItemUseWidget {
	struct Unknown UberGraphFrame; //  0x268 Size(8)
	struct Unknown BT_UserName; //  0x270 Size(8)
	struct Unknown CP_Main; //  0x278 Size(8)
	struct Unknown HB_ItemInfo; //  0x280 Size(8)
	struct Unknown Image_264; //  0x288 Size(8)
	struct Unknown Image_265; //  0x290 Size(8)
	struct Unknown Image_1163; //  0x298 Size(8)
	struct Unknown IMG_Frontbar; //  0x2a0 Size(8)
	struct Unknown IMG_Item; //  0x2a8 Size(8)
	struct Unknown Img_TeamColor; //  0x2b0 Size(8)
	struct Unknown PB_HP; //  0x2b8 Size(8)
	struct Unknown PB_ItemCasting; //  0x2c0 Size(8)
	struct Unknown PB_Message; //  0x2c8 Size(8)
	struct Unknown SizeBox_Message; //  0x2d0 Size(8)
	struct Unknown Switcher_Casting; //  0x2d8 Size(8)
	struct Unknown T_Item; //  0x2e0 Size(8)
	struct Unknown T_Message; //  0x2e8 Size(8)
	struct Unknown T_Quantity; //  0x2f0 Size(8)
	struct Unknown T_TeamNum; //  0x2f8 Size(8)
	struct Unknown T_UserName; //  0x300 Size(8)
	struct Unknown PlayerState; //  0x308 Size(8)
	struct Unknown ReplayController; //  0x310 Size(8)
	struct Unknown TargetCharacter; //  0x318 Size(8)
	struct Unknown MaxViewportSize; //  0x320 Size(8)
	struct Unknown LocalScreenPosition; //  0x328 Size(8)
	char IsPositionUpdated; //  0x330 Size(1)
	float DefaultCharacterZLocation; //  0x334 Size(4)
	struct Unknown TargetPawn; //  0x338 Size(8)

	void SetEquippedWeapon(char& SUCCESS); // Function UW_ReplayUserNameTooltip.UW_ReplayUserNameTooltip_C.SetEquippedWeapon(Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

