// WidgetBlueprintGeneratedClass UW_UserNameTooltip.UW_UserNameTooltip_C
struct UUW_UserNameTooltip_C : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown BT_UserName; //  0x250 Size(8)
	struct Unknown CP_Main; //  0x258 Size(8)
	struct Unknown HB_ItemInfo; //  0x260 Size(8)
	struct Unknown Image_264; //  0x268 Size(8)
	struct Unknown Image_265; //  0x270 Size(8)
	struct Unknown Image_1163; //  0x278 Size(8)
	struct Unknown IMG_Frontbar; //  0x280 Size(8)
	struct Unknown IMG_Item; //  0x288 Size(8)
	struct Unknown Img_TeamColor; //  0x290 Size(8)
	struct Unknown PB_HP; //  0x298 Size(8)
	struct Unknown PB_ItemCasting; //  0x2a0 Size(8)
	struct Unknown T_Item; //  0x2a8 Size(8)
	struct Unknown T_Quantity; //  0x2b0 Size(8)
	struct Unknown T_TeamNum; //  0x2b8 Size(8)
	struct Unknown T_UserName; //  0x2c0 Size(8)
	struct Unknown PlayerState; //  0x2c8 Size(8)
	struct Unknown ReplayController; //  0x2d0 Size(8)
	struct Unknown TargetCharacter; //  0x2d8 Size(8)
	struct Unknown MaxViewportSize; //  0x2e0 Size(8)
	struct Unknown LocalScreenPosition; //  0x2e8 Size(8)
	char IsPositionUpdated; //  0x2f0 Size(1)
	float DefaultCharacterZLocation; //  0x2f4 Size(4)

	void SetEnableNameButton(char Enable); // Function UW_UserNameTooltip.UW_UserNameTooltip_C.SetEnableNameButton(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

