// WidgetBlueprintGeneratedClass Vehi.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x268 Size(8)
	struct Unknown SeatIcons; //  0x270 Size(8)
	struct Unknown WheelIcons; //  0x278 Size(8)

	void Setup(struct Unknown VehicleInstance); // Function Vehi.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass Vehi.U
struct UU : UUserWidget {
	struct Unknown MySeatColor; //  0x248 Size(10)
	struct Unknown WheelGroup; //  0x258 Size(8)
	struct Unknown SeatGroup; //  0x260 Size(8)

	void Setup(struct Unknown VehicleInstance); // Function Vehi2.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass Vehion.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x268 Size(8)
	struct Unknown SeatIcons; //  0x270 Size(8)
	struct Unknown WheelIcons; //  0x278 Size(8)

	void Setup(struct Unknown VehicleInstance); // Function Vehi.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass Vehi.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x268 Size(8)
	struct Unknown SeatIcons; //  0x270 Size(8)
	struct Unknown WheelIcons; //  0x278 Size(8)

	void Setup(struct Unknown VehicleInstance); // Function Vehi.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass Vehi.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x268 Size(8)
	struct Unknown SeatIcons; //  0x270 Size(8)
	struct Unknown WheelIcons; //  0x278 Size(8)

	void Setup(struct Unknown VehicleInstance); // Function Vehippearjti.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass Vehiadskij.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x268 Size(8)
	struct Unknown SeatIcons; //  0x270 Size(8)
	struct Unknown WheelIcons; //  0x278 Size(8)

	void Setup(struct Unknown VehicleInstance); // Function Vehi.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass Vehi.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x268 Size(8)
	struct Unknown SeatIcons; //  0x270 Size(8)
	struct Unknown WheelIcons; //  0x278 Size(8)

	void Setup(struct Unknown VehicleInstance); // Function Vehi.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass Vehi.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x268 Size(8)
	struct Unknown SeatIcons; //  0x270 Size(8)
	struct Unknown WheelIcons; //  0x278 Size(8)

	void Setup(struct Unknown VehicleInstance); // Function Vehi.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass Vehi.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x268 Size(8)
	struct Unknown SeatIcons; //  0x270 Size(8)
	struct Unknown WheelIcons; //  0x278 Size(8)

	void Setup(struct Unknown VehicleInstance); // Function Vehi.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass Vehi.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x268 Size(8)
	struct Unknown SeatIcons; //  0x270 Size(8)
	struct Unknown WheelIcons; //  0x278 Size(8)

	void Setup(struct Unknown VehicleInstance); // Function Vehiverine.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

// WidgetBlueprintGeneratedClass Vehi.U
struct UU : UU {
	struct Unknown UberGraphFrame; //  0x268 Size(8)
	struct Unknown SeatIcons; //  0x270 Size(8)
	struct Unknown WheelIcons; //  0x278 Size(8)

	void Setup(struct Unknown VehicleInstance); // Function Vehi.U.Setup(Public|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

