// WidgetBlueprintGeneratedClass WB.WB
struct UWB : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown FadeOut; //  0x250 Size(8)
	Unknown FadeIn; //  0x258 Size(8)
	Unknown Image_Effect; //  0x260 Size(8)
	Unknown NewVar_1; //  0x268 Size(8)
	char IsFadeInOutEvent; //  0x270 Size(1)
	float CurrentFade; //  0x274 Size(4)

	void SetMaterialParameter(float Opacity, float Speed, float Scale); // Function WB.WB.SetMaterialParameter(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

// WidgetBlueprintGeneratedClass WB.WB
struct UWB : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown HeartBeat; //  0x250 Size(8)
	Unknown FadeOut; //  0x258 Size(8)
	Unknown FadeIn; //  0x260 Size(8)
	Unknown Image; //  0x268 Size(8)
	Unknown Image_95; //  0x270 Size(8)
	Unknown Image_140; //  0x278 Size(8)
	Unknown NewVar_1; //  0x280 Size(8)
	char IsFadeInOutEvent; //  0x288 Size(1)
	float CurrentFade; //  0x28c Size(4)

	void Construct(); // Function WB.WB.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <Game+0x23a73f0>
};

