// WidgetBlueprintGeneratedClass WBP_SPS_SelectionMenu.WBP_SPS_SelectionMenu_C
struct UWBP_SPS_SelectionMenu_C : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Canvas; //  0x250 Size(8)
	struct Unknown CenterCursor; //  0x258 Size(8)
	struct Unknown DisplayText; //  0x260 Size(8)
	struct Unknown Image; //  0x268 Size(8)
	struct Unknown Image_2; //  0x270 Size(8)
	struct Unknown Image_3; //  0x278 Size(8)
	struct Unknown Image_4; //  0x280 Size(8)
	struct Unknown Image_5; //  0x288 Size(8)
	struct Unknown Image_6; //  0x290 Size(8)
	struct Unknown Image_7; //  0x298 Size(8)
	struct Unknown Image_274; //  0x2a0 Size(8)
	struct Unknown Message0; //  0x2a8 Size(8)
	struct Unknown Message2; //  0x2b0 Size(8)
	struct Unknown Message3; //  0x2b8 Size(8)
	struct Unknown Message3_1; //  0x2c0 Size(8)
	struct Unknown Message3_2; //  0x2c8 Size(8)
	struct Unknown Message3_3; //  0x2d0 Size(8)
	struct Unknown Message3_4; //  0x2d8 Size(8)
	struct Unknown Message3_5; //  0x2e0 Size(8)
	struct Unknown Message3_6; //  0x2e8 Size(8)
	struct Unknown Message3_7; //  0x2f0 Size(8)
	struct Unknown Message3_8; //  0x2f8 Size(8)
	struct Unknown Message4; //  0x300 Size(8)
	struct Unknown Message5; //  0x308 Size(8)
	struct Unknown Message6; //  0x310 Size(8)
	struct Unknown Message7; //  0x318 Size(8)
	struct Unknown Messgae1; //  0x320 Size(8)
	struct Unknown Over1; //  0x328 Size(8)
	struct Unknown Over2; //  0x330 Size(8)
	struct Unknown Over3; //  0x338 Size(8)
	struct Unknown Over4; //  0x340 Size(8)
	struct Unknown Over5; //  0x348 Size(8)
	struct Unknown Over6; //  0x350 Size(8)
	struct Unknown Over7; //  0x358 Size(8)
	struct Unknown Over8; //  0x360 Size(8)
	struct Unknown Slot0; //  0x368 Size(8)
	struct Unknown Slot1; //  0x370 Size(8)
	struct Unknown Slot2; //  0x378 Size(8)
	struct Unknown Slot3; //  0x380 Size(8)
	struct Unknown Slot4; //  0x388 Size(8)
	struct Unknown Slot5; //  0x390 Size(8)
	struct Unknown Slot6; //  0x398 Size(8)
	struct Unknown Slot7; //  0x3a0 Size(8)
	struct Unknown Type; //  0x3a8 Size(8)
	struct Unknown U; //  0x3b0 Size(8)
	struct Unknown WidgetSwitcher_133; //  0x3b8 Size(8)
	struct TArray<Unknown> SelectionWidgets; //  0x3c0 Size(10)
	struct Unknown MenuCenter; //  0x3d0 Size(8)
	struct Unknown ReferenceVector; //  0x3d8 Size(c)
	struct FMulticastInlineDelegate Selected; //  0x3e8 Size(10)
	struct Unknown SmartPingComponent; //  0x3f8 Size(8)
	struct Unknown RadialMenuMaterial; //  0x400 Size(8)
	int32_t SelectedIndex; //  0x408 Size(4)
	int32_t StartIndex; //  0x40c Size(4)
	float AngleSize; //  0x410 Size(4)
	float DistanceFromCenter; //  0x414 Size(4)
	int32_t Divisions; //  0x418 Size(4)
	float SelectionToleranceFromCenter; //  0x41c Size(4)
	struct FMulticastInlineDelegate Hovered; //  0x420 Size(10)
	struct FMulticastInlineDelegate ClearPing; //  0x430 Size(10)
	char IsPingType; //  0x440 Size(1)
	char Enable; //  0x441 Size(1)

	void GetRequestTextFromIndex(int32_t Index, struct Unknown& Text); // Function WBP_SPS_SelectionMenu.WBP_SPS_SelectionMenu_C.GetRequestTextFromIndex(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

