// WidgetBlueprintGeneratedClass WBP_SPS_UseItemSelectionMenu.WBP_SPS_UseItemSelectionMenu_C
struct UWBP_SPS_UseItemSelectionMenu_C : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown Bg1; //  0x250 Size(8)
	struct Unknown bg2; //  0x258 Size(8)
	struct Unknown Bg3; //  0x260 Size(8)
	struct Unknown Bg4; //  0x268 Size(8)
	struct Unknown Bg5; //  0x270 Size(8)
	struct Unknown Bg6; //  0x278 Size(8)
	struct Unknown Bg7; //  0x280 Size(8)
	struct Unknown Bg8; //  0x288 Size(8)
	struct Unknown Canvas; //  0x290 Size(8)
	struct Unknown CenterCursor; //  0x298 Size(8)
	struct Unknown DisplayText; //  0x2a0 Size(8)
	struct Unknown IconImage; //  0x2a8 Size(8)
	struct Unknown Index1; //  0x2b0 Size(8)
	struct Unknown Index2; //  0x2b8 Size(8)
	struct Unknown Index3; //  0x2c0 Size(8)
	struct Unknown Index4; //  0x2c8 Size(8)
	struct Unknown Index5; //  0x2d0 Size(8)
	struct Unknown Index6; //  0x2d8 Size(8)
	struct Unknown Index7; //  0x2e0 Size(8)
	struct Unknown Index8; //  0x2e8 Size(8)
	struct Unknown Key1; //  0x2f0 Size(8)
	struct Unknown Key2; //  0x2f8 Size(8)
	struct Unknown Key3; //  0x300 Size(8)
	struct Unknown Key4; //  0x308 Size(8)
	struct Unknown Key5; //  0x310 Size(8)
	struct Unknown Key6; //  0x318 Size(8)
	struct Unknown Key7; //  0x320 Size(8)
	struct Unknown Key8; //  0x328 Size(8)
	struct Unknown Message2; //  0x330 Size(8)
	struct Unknown Message3; //  0x338 Size(8)
	struct Unknown Message3_1; //  0x340 Size(8)
	struct Unknown Message3_2; //  0x348 Size(8)
	struct Unknown Message3_3; //  0x350 Size(8)
	struct Unknown Message3_4; //  0x358 Size(8)
	struct Unknown Message3_5; //  0x360 Size(8)
	struct Unknown Message3_6; //  0x368 Size(8)
	struct Unknown Message3_7; //  0x370 Size(8)
	struct Unknown Message3_8; //  0x378 Size(8)
	struct Unknown Message4; //  0x380 Size(8)
	struct Unknown Message5; //  0x388 Size(8)
	struct Unknown Message6; //  0x390 Size(8)
	struct Unknown Message7; //  0x398 Size(8)
	struct Unknown Message8; //  0x3a0 Size(8)
	struct Unknown Messgae1; //  0x3a8 Size(8)
	struct Unknown Over1; //  0x3b0 Size(8)
	struct Unknown Over2; //  0x3b8 Size(8)
	struct Unknown Over3; //  0x3c0 Size(8)
	struct Unknown Over4; //  0x3c8 Size(8)
	struct Unknown Over5; //  0x3d0 Size(8)
	struct Unknown Over6; //  0x3d8 Size(8)
	struct Unknown Over7; //  0x3e0 Size(8)
	struct Unknown Over8; //  0x3e8 Size(8)
	struct Unknown UseSlot1; //  0x3f0 Size(8)
	struct Unknown UseSlot2; //  0x3f8 Size(8)
	struct Unknown UseSlot3; //  0x400 Size(8)
	struct Unknown UseSlot4; //  0x408 Size(8)
	struct Unknown UseSlot5; //  0x410 Size(8)
	struct Unknown UseSlot6; //  0x418 Size(8)
	struct Unknown UseSlot7; //  0x420 Size(8)
	struct Unknown UseSlot8; //  0x428 Size(8)
	struct Unknown U; //  0x430 Size(8)
	struct Unknown WidgetSwitcher_133; //  0x438 Size(8)
	struct TArray<Unknown> SelectionWidgets; //  0x440 Size(10)
	struct Unknown MenuCenter; //  0x450 Size(8)
	struct Unknown ReferenceVector; //  0x458 Size(c)
	struct FMulticastInlineDelegate Selected; //  0x468 Size(10)
	int32_t SelectedIndex; //  0x478 Size(4)
	float AngleSize; //  0x47c Size(4)
	float DistanceFromCenter; //  0x480 Size(4)
	int32_t Divisions; //  0x484 Size(4)
	float SelectionToleranceFromCenter; //  0x488 Size(4)
	struct FMulticastInlineDelegate Hovered; //  0x490 Size(10)
	struct FMulticastInlineDelegate ClearPing; //  0x4a0 Size(10)
	struct FText Title; //  0x4b0 Size(18)
	struct FName ItemKey; //  0x4c8 Size(8)
	float OverOpacity; //  0x4d0 Size(4)
	float BgOpacity; //  0x4d4 Size(4)
	struct TMap<{}, {}>Unknown List; //  0x4d8 Size(50)
	enum class Unknow IndexTextVisible; //  0x528 Size(1)
	char NewVar_1; //  0x529 Size(1)
	struct TSoftObjectPtr<Unknown> Image; //  0x530 Size(28)
	float TextOpacity; //  0x558 Size(4)

	void Get(int32_t Index, struct Unknown& Icon); // Function WBP_SPS_UseItemSelectionMenu.WBP_SPS_UseItemSelectionMenu_C.Get(Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

