// WidgetBlueprintGeneratedClass WBP_SPS_UseItemSelectionIcon.WBP_SPS_UseItemSelectionIcon_C
struct UWBP_SPS_UseItemSelectionIcon_C : UUserWidget {
	struct Unknown UberGraphFrame; //  0x248 Size(8)
	struct Unknown IconImage; //  0x250 Size(8)
	struct FMulticastInlineDelegate Hovered; //  0x258 Size(10)
	struct FMulticastInlineDelegate Unhovered; //  0x268 Size(10)
	struct FMulticastInlineDelegate Pressed; //  0x278 Size(10)
	struct Unknown SmartPingComponent; //  0x288 Size(8)
	int32_t Index; //  0x290 Size(4)
	struct Unknown TintColorToUse; //  0x294 Size(10)
	char Found; //  0x2a4 Size(1)
	struct Unknown Settings; //  0x2a8 Size(b8)
	struct FName TableID; //  0x360 Size(8)
	struct TSoftObjectPtr<Unknown> Image; //  0x368 Size(28)

	void OnLoaded_6834BC7D48AF986BC5969685C4D6D2B3(struct Unknown Loaded); // Function WBP_SPS_UseItemSelectionIcon.WBP_SPS_UseItemSelectionIcon_C.OnLoaded_6834BC7D48AF986BC5969685C4D6D2B3(BlueprintCallable|BlueprintEvent) // <Game+0x23b1e70>
};

