// WidgetBlueprintGeneratedClass WBP_SPS_UseItemSelectionIcon.WBP_SPS_UseItemSelectionIco
struct UWBP_SPS_UseItemSelectionIcot : UUserWidget {
	Unknown UberGraphFrame; //  0x248 Size(8)
	Unknown IconImage; //  0x250 Size(8)
	struct FMulticastInlineDelegate Hovered; //  0x258 Size(10)
	struct FMulticastInlineDelegate Unhovered; //  0x268 Size(10)
	struct FMulticastInlineDelegate Pressed; //  0x278 Size(10)
	Unknown SmartPingComponent; //  0x288 Size(8)
	int32_t Index; //  0x290 Size(4)
	Unknown TintColorToUse; //  0x294 Size(10)
	char Found; //  0x2a4 Size(1)
	Unknown Settings; //  0x2a8 Size(b8)
	struct FName TableID; //  0x360 Size(8)
	Unknown Image; //  0x368 Size(28)

	void OnLoaded_6834BC7D48AF986BC5969685C4D6D2B3(Unknown Loaded); // Function WBP_SPS_UseItemSelectionIcon.WBP_SPS_UseItemSelectionIcot.OnLoaded_6834BC7D48AF986BC5969685C4D6D2B3(BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

