// WidgetBlueprintGeneratedClass WBP_SPS_Icon.WBP_SPS_Icon_C
struct UWBP_SPS_Icon_C : UBravoHotelSmartPingIconWidget {
	Unknown UberGraphFrame; //  0x440 Size(8)
	Unknown BgIcon; //  0x448 Size(8)
	Unknown Icon; //  0x450 Size(8)
	Unknown Image_175; //  0x458 Size(8)
	Unknown Indicator; //  0x460 Size(8)
	Unknown Overlay_1; //  0x468 Size(8)
	Unknown TeamIndex; //  0x470 Size(8)
	Unknown TextBlock; //  0x478 Size(8)
	Unknown TextBlock_2; //  0x480 Size(8)
	Unknown TextBlock_3; //  0x488 Size(8)
	Unknown TextBlock_4; //  0x490 Size(8)
	Unknown TextBlock_5; //  0x498 Size(8)
	Unknown TextBlock_6; //  0x4a0 Size(8)
	Unknown TextBlock_7; //  0x4a8 Size(8)
	Unknown TextBlock_8; //  0x4b0 Size(8)
	Unknown TextBlock_9; //  0x4b8 Size(8)
	Unknown TextBlock_10; //  0x4c0 Size(8)
	Unknown TextBlock_12; //  0x4c8 Size(8)
	Unknown VerticalBox_301; //  0x4d0 Size(8)
	Unknown PlayerCamera; //  0x4d8 Size(8)
	Unknown ParentComponent; //  0x4e0 Size(8)
	Unknown CanvasSlot; //  0x4e8 Size(8)
	Unknown MaterialPingInfo; //  0x4f0 Size(30)

	char SetExpertWeaponPing(Unknown& PingInfo); // Function WBP_SPS_Icon.WBP_SPS_Icon_C.SetExpertWeaponPing(Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // <Game+0x23a73f0>
};

