// Enum XlntLib.ExcelUnderlineType
enum class ExcelUnderlineType : uint8_t {
	ExcelUnderlineType = 0,
	ExcelUnderlineType = 1,
	ExcelUnderlineType = 2,
	ExcelUnderlineType = 3,
	ExcelUnderlineType = 4,
	ExcelUnderlineType = 5,
};

// Enum XlntLib.ExcelFillType
enum class ExcelFillType : uint8_t {
	ExcelFillType = 0,
	ExcelFillType = 1,
	ExcelFillType = 2,
};

// Enum XlntLib.ExcelGradientFillType
enum class ExcelGradientFillType : uint8_t {
	ExcelGradientFillType = 0,
	ExcelGradientFillType = 1,
	ExcelGradientFillType = 2,
};

// Enum XlntLib.ExcelPatternFillType
enum class ExcelPatternFillType : uint8_t {
	ExcelPatternFillType = 0,
	ExcelPatternFillType = 1,
	ExcelPatternFillType = 2,
	ExcelPatternFillType = 3,
	ExcelPatternFillType = 4,
	ExcelPatternFillType = 5,
	ExcelPatternFillType = 6,
	ExcelPatternFillType = 7,
	ExcelPatternFillType = 8,
	ExcelPatternFillType = 9,
	ExcelPatternFillType = 10,
	ExcelPatternFillType = 11,
	ExcelPatternFillType = 12,
	ExcelPatternFillType = 13,
	ExcelPatternFillType = 14,
	ExcelPatternFillType = 15,
	ExcelPatternFillType = 16,
	ExcelPatternFillType = 17,
	ExcelPatternFillType = 18,
	ExcelPatternFillType = 19,
};

// Enum XlntLib.ExcelColorType
enum class ExcelColorType : uint8_t {
	ExcelColorType = 0,
	ExcelColorType = 1,
	ExcelColorType = 2,
	ExcelColorType = 3,
};

// Enum XlntLib.ExcelBorderStyle
enum class ExcelBorderStyle : uint8_t {
	ExcelBorderStyle = 0,
	ExcelBorderStyle = 1,
	ExcelBorderStyle = 2,
	ExcelBorderStyle = 3,
	ExcelBorderStyle = 4,
	ExcelBorderStyle = 5,
	ExcelBorderStyle = 6,
	ExcelBorderStyle = 7,
	ExcelBorderStyle = 8,
	ExcelBorderStyle = 9,
	ExcelBorderStyle = 10,
	ExcelBorderStyle = 11,
	ExcelBorderStyle = 12,
	ExcelBorderStyle = 13,
	ExcelBorderStyle = 14,
};

// Enum XlntLib.ExcelBorderSideType
enum class ExcelBorderSideType : uint8_t {
	ExcelBorderSideType = 0,
	ExcelBorderSideType = 1,
	ExcelBorderSideType = 2,
	ExcelBorderSideType = 3,
	ExcelBorderSideType = 4,
	ExcelBorderSideType = 5,
	ExcelBorderSideType = 6,
	ExcelBorderSideType = 7,
};

// Enum XlntLib.ExcelBorderDiagonalDirection
enum class ExcelBorderDiagonalDirection : uint8_t {
	ExcelBorderDiagonalDirection = 0,
	ExcelBorderDiagonalDirection = 1,
	ExcelBorderDiagonalDirection = 2,
	ExcelBorderDiagonalDirection = 3,
	ExcelBorderDiagonalDirection = 4,
};

// Enum XlntLib.ExcelVerticalAlignment
enum class ExcelVerticalAlignment : uint8_t {
	ExcelVerticalAlignment = 0,
	ExcelVerticalAlignment = 1,
	ExcelVerticalAlignment = 2,
	ExcelVerticalAlignment = 3,
	ExcelVerticalAlignment = 4,
	ExcelVerticalAlignment = 5,
};

// Enum XlntLib.ExcelHorizontalAlignment
enum class ExcelHorizontalAlignment : uint8_t {
	ExcelHorizontalAlignment = 0,
	ExcelHorizontalAlignment = 1,
	ExcelHorizontalAlignment = 2,
	ExcelHorizontalAlignment = 3,
	ExcelHorizontalAlignment = 4,
	ExcelHorizontalAlignment = 5,
	ExcelHorizontalAlignment = 6,
	ExcelHorizontalAlignment = 7,
	ExcelHorizontalAlignment = 8,
};

// Enum XlntLib.ExcelExtendedProperty
enum class ExcelExtendedProperty : uint8_t {
	ExcelExtendedProperty = 0,
	ExcelExtendedProperty = 1,
	ExcelExtendedProperty = 2,
	ExcelExtendedProperty = 3,
	ExcelExtendedProperty = 4,
	ExcelExtendedProperty = 5,
	ExcelExtendedProperty = 6,
	ExcelExtendedProperty = 7,
	ExcelExtendedProperty = 8,
	ExcelExtendedProperty = 9,
	ExcelExtendedProperty = 10,
	ExcelExtendedProperty = 11,
	ExcelExtendedProperty = 12,
	ExcelExtendedProperty = 13,
	ExcelExtendedProperty = 14,
	ExcelExtendedProperty = 15,
	ExcelExtendedProperty = 16,
	ExcelExtendedProperty = 17,
	ExcelExtendedProperty = 18,
	ExcelExtendedProperty = 19,
	ExcelExtendedProperty = 20,
	ExcelExtendedProperty = 21,
	ExcelExtendedProperty = 22,
	ExcelExtendedProperty = 23,
	ExcelExtendedProperty = 24,
	ExcelExtendedProperty = 25,
	ExcelExtendedProperty = 26,
	ExcelExtendedProperty = 27,
};

// Enum XlntLib.ExcelCoreProperty
enum class ExcelCoreProperty : uint8_t {
	ExcelCoreProperty = 0,
	ExcelCoreProperty = 1,
	ExcelCoreProperty = 2,
	ExcelCoreProperty = 3,
	ExcelCoreProperty = 4,
	ExcelCoreProperty = 5,
	ExcelCoreProperty = 6,
	ExcelCoreProperty = 7,
	ExcelCoreProperty = 8,
	ExcelCoreProperty = 9,
	ExcelCoreProperty = 10,
	ExcelCoreProperty = 11,
	ExcelCoreProperty = 12,
	ExcelCoreProperty = 13,
	ExcelCoreProperty = 14,
	ExcelCoreProperty = 15,
};

// Enum XlntLib.ExcelCellType
enum class ExcelCellType : uint8_t {
	ExcelCellType = 0,
	ExcelCellType = 1,
	ExcelCellType = 2,
	ExcelCellType = 3,
	ExcelCellType = 4,
	ExcelCellType = 5,
	ExcelCellType = 6,
	ExcelCellType = 7,
	ExcelCellType = 8,
};

// Enum XlntLib.ExcelBaseDate
enum class ExcelBaseDate : uint8_t {
	ExcelBaseDate = 0,
	ExcelBaseDate = 1,
	ExcelBaseDate = 2,
};

// Enum XlntLib.ExcelVariantType
enum class ExcelVariantType : uint8_t {
	ExcelVariantType = 0,
	ExcelVariantType = 1,
	ExcelVariantType = 2,
	ExcelVariantType = 3,
	ExcelVariantType = 4,
	ExcelVariantType = 5,
	ExcelVariantType = 6,
};

// Enum XlntLib.ExcelSortType
enum class ExcelSortType : uint8_t {
	ExcelSortType = 0,
	ExcelSortType = 1,
	ExcelSortType = 2,
	ExcelSortType = 3,
};

// Class XlntLib.ExcelWorkbook
class UExcelWorkbook : public Object {

public:

	struct TArray<Unknown> mSheets; // 0x28 (16)
	struct Unknown mActiveSheet; // 0x38 (8)

	struct FString Title(); // Function XlntLib.ExcelWorkbook.Title(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1352DB0>
	char StopWatch(struct Unknown WorldContextObject); // Function XlntLib.ExcelWorkbook.StopWatch(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1352520>
	char StartWatch(struct Unknown WorldContextObject, struct FDelegate onChanged, char autoReload, float Rate); // Function XlntLib.ExcelWorkbook.StartWatch(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x13523A0>
	struct Unknown SheetWithTitle(struct FString Title); // Function XlntLib.ExcelWorkbook.SheetWithTitle(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x13522A0>
	struct Unknown SheetWithId(int32_t ID); // Function XlntLib.ExcelWorkbook.SheetWithId(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1352210>
	struct TArray<Unknown> SheetTitles(); // Function XlntLib.ExcelWorkbook.SheetTitles(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1352190>
	int32_t SheetCount(); // Function XlntLib.ExcelWorkbook.SheetCount(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1352160>
	struct Unknown SheetAt(int32_t Index); // Function XlntLib.ExcelWorkbook.SheetAt(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x13520D0>
	void SetTitle(struct FString Value); // Function XlntLib.ExcelWorkbook.SetTitle(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1351EF0>
	void SetExtendedPropertyValue(enum class Unknow Property, struct Unknown Value); // Function XlntLib.ExcelWorkbook.SetExtendedPropertyValue(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1351660>
	void SetCustomProperty(struct FString Name, struct Unknown Value); // Function XlntLib.ExcelWorkbook.SetCustomProperty(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1351250>
	void SetCorePropertyValue(enum class Unknow Property, struct Unknown Value); // Function XlntLib.ExcelWorkbook.SetCorePropertyValue(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1351080>
	void SetBaseDate(enum class Unknow BaseDate); // Function XlntLib.ExcelWorkbook.SetBaseDate(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1350DF0>
	void SetActiveSheetWithTitle(struct FString Title); // Function XlntLib.ExcelWorkbook.SetActiveSheetWithTitle(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1350D00>
	void SetActiveSheetAt(int32_t Index); // Function XlntLib.ExcelWorkbook.SetActiveSheetAt(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1350C80>
	void SetActiveSheet(struct Unknown sheet); // Function XlntLib.ExcelWorkbook.SetActiveSheet(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1350C00>
	char SaveAs(struct FString Path, char isAbsolutePath, char isSave); // Function XlntLib.ExcelWorkbook.SaveAs(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1350A80>
	char Save(); // Function XlntLib.ExcelWorkbook.Save(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1350A50>
	void RemoveSheet(struct Unknown sheet); // Function XlntLib.ExcelWorkbook.RemoveSheet(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1350940>
	char Reload(); // Function XlntLib.ExcelWorkbook.Reload(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1350910>
	char Load(struct FString fullPath); // Function XlntLib.ExcelWorkbook.Load(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x1350020>
	char HasTitle(); // Function XlntLib.ExcelWorkbook.HasTitle(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x134F6F0>
	char HasExtendedProperty(enum class Unknow Property); // Function XlntLib.ExcelWorkbook.HasExtendedProperty(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x134F660>
	char HasCustomProperty(struct FString Name); // Function XlntLib.ExcelWorkbook.HasCustomProperty(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x134F560>
	char HasCoreProperty(enum class Unknow Property); // Function XlntLib.ExcelWorkbook.HasCoreProperty(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x134F4D0>
	struct Unknown GetExtendedPropertyValue(enum class Unknow Property); // Function XlntLib.ExcelWorkbook.GetExtendedPropertyValue(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x134F350>
	struct Unknown GetCustomProperty(struct FString Name); // Function XlntLib.ExcelWorkbook.GetCustomProperty(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x134F220>
	struct Unknown GetCorePropertyValue(enum class Unknow Property); // Function XlntLib.ExcelWorkbook.GetCorePropertyValue(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x134F160>
	struct Unknown CreateSheet(int32_t Index, char SetActive); // Function XlntLib.ExcelWorkbook.CreateSheet(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x134D170>
	struct Unknown CopySheet(struct Unknown sheet, int32_t Index); // Function XlntLib.ExcelWorkbook.CopySheet(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x134D0B0>
	char ContainsSheet(struct FString Title); // Function XlntLib.ExcelWorkbook.ContainsSheet(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x134CFB0>
	void Clear(); // Function XlntLib.ExcelWorkbook.Clear(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x134CC80>
	enum class Unknow BaseDate(); // Function XlntLib.ExcelWorkbook.BaseDate(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x134BE20>
	void ApplyToCells(struct Unknown WorldContextObject, struct FDelegate onCell); // Function XlntLib.ExcelWorkbook.ApplyToCells(Final|Native|Public|BlueprintCallable) // <BravoHotelClient-Win64-Shipping.protected.exe+0x134BD40>
	struct TArray<Unknown> AllSheets(); // Function XlntLib.ExcelWorkbook.AllSheets(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x134BCB0>
	struct TArray<Unknown> AllExtendedProperties(); // Function XlntLib.ExcelWorkbook.AllExtendedProperties(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x134BBB0>
	struct TArray<Unknown> AllCustomProperties(); // Function XlntLib.ExcelWorkbook.AllCustomProperties(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x134BB30>
	struct TArray<Unknown> AllCoreProperties(); // Function XlntLib.ExcelWorkbook.AllCoreProperties(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <BravoHotelClient-Win64-Shipping.protected.exe+0x134BAB0>
	struct Unknown ActiveSheet(); // Function XlntLib.ExcelWorkbook.ActiveSheet(Final|Native|Public|BlueprintCallable|BlueprintPure) // <BravoHotelClient-Win64-Shipping.protected.exe+0x134BA80>
};

// ScriptStruct XlntLib.ExcelAlignment
struct FExcelAlignment {
	char ShrinkToFit : 0; // 0x0 (1)
	char WrapText : 0; // 0x1 (1)
	int32_t Indent; // 0x4 (4)
	int32_t TextRotation; // 0x8 (4)
	enum class Unknow HorizontalAlignment; // 0xC (1)
	enum class Unknow VerticalAlignment; // 0xD (1)
};

// ScriptStruct XlntLib.ExcelBorder
struct FExcelBorder {
	struct Unknown Start; // 0x0 (36)
	struct Unknown End; // 0x24 (36)
	struct Unknown Top; // 0x48 (36)
	struct Unknown Bottom; // 0x6C (36)
	struct Unknown Horizontal; // 0x90 (36)
	struct Unknown Vertical; // 0xB4 (36)
	struct Unknown Diagonal; // 0xD8 (36)
	enum class Unknow DiagonalDirection; // 0xFC (1)
};

// ScriptStruct XlntLib.ExcelBorderSide
struct FExcelBorderSide {
	struct Unknown Color; // 0x0 (32)
	enum class Unknow Style; // 0x20 (1)
};

// ScriptStruct XlntLib.ExcelColor
struct FExcelColor {
	enum class Unknow Type; // 0x0 (1)
	int32_t ColorIndex; // 0x4 (4)
	struct Unknown ColorValue; // 0x8 (16)
	float Tint; // 0x18 (4)
	char IsAutoColor : 0; // 0x1C (1)
};

// ScriptStruct XlntLib.ExcelCellRangeReference
struct FExcelCellRangeReference {
	struct Unknown TopLeft; // 0x0 (8)
	struct Unknown BottomRight; // 0x8 (8)
};

// ScriptStruct XlntLib.ExcelCellReference
struct FExcelCellReference {
	int32_t Column; // 0x0 (4)
	int32_t Row; // 0x4 (4)
};

// ScriptStruct XlntLib.ExcelFill
struct FExcelFill {
	enum class Unknow Type; // 0x0 (1)
	struct Unknown PatternFill; // 0x4 (68)
	struct Unknown GradientFill; // 0x48 (104)
};

// ScriptStruct XlntLib.ExcelGradientFill
struct FExcelGradientFill {
	enum class Unknow Type; // 0x0 (1)
	float Degree; // 0x4 (4)
	struct Unknown Distance; // 0x8 (16)
	struct TMap<Unknown, Unknown> Stops; // 0x18 (80)
};

// ScriptStruct XlntLib.ExcelPatternFill
struct FExcelPatternFill {
	enum class Unknow Type; // 0x0 (1)
	struct Unknown ForegroundColor; // 0x4 (32)
	struct Unknown BackgroundColor; // 0x24 (32)
};

// ScriptStruct XlntLib.ExcelFont
struct FExcelFont {
	struct FString Name; // 0x0 (16)
	float Size; // 0x10 (4)
	char IsBold : 0; // 0x14 (1)
	char IsItalic : 0; // 0x15 (1)
	char IsSuperScript : 0; // 0x16 (1)
	char IsStrikeThrough : 0; // 0x17 (1)
	char IsOutline : 0; // 0x18 (1)
	char IsShadow : 0; // 0x19 (1)
	enum class Unknow UnderlineType; // 0x1A (1)
	struct Unknown Color; // 0x1C (32)
	int32_t Family; // 0x3C (4)
	int32_t Charset; // 0x40 (4)
	struct FString Scheme; // 0x48 (16)
};

// ScriptStruct XlntLib.ExcelNumberFormat
struct FExcelNumberFormat {
	int32_t ID; // 0x0 (4)
	struct FString FormatString; // 0x8 (16)
};

// ScriptStruct XlntLib.ExcelProtection
struct FExcelProtection {
	char IsLocked : 0; // 0x0 (1)
	char IsHidden : 0; // 0x1 (1)
};

// Function XlntLib.ExcelWorkbook.Title
inline struct FString UExcelWorkbook::Title() {
	static auto fn = UObject::FindObject<UFunction>("Function XlntLib.ExcelWorkbook.Title");

	struct Title_Params {
		
		struct FString ReturnValue;

	}; Title_Params Params;


	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;

	return params.ReturnValue;
}

// Function XlntLib.ExcelWorkbook.StopWatch
inline char UExcelWorkbook::StopWatch(struct Unknown WorldContextObject) {
	static auto fn = UObject::FindObject<UFunction>("Function XlntLib.ExcelWorkbook.StopWatch");

	struct StopWatch_Params {
		struct Unknown WorldContextObject;
		char ReturnValue;

	}; StopWatch_Params Params;

	Params.WorldContextObject = WorldContextObject;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;

	return params.ReturnValue;
}

// Function XlntLib.ExcelWorkbook.StartWatch
